{
  "movieId": "archive-dias-de-odio-1954",
  "title": "Dias De Odio (1954)",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dias-de-odio-1954",
      "id": "dias-de-odio-1954",
      "title": "Dias De Odio (1954)",
      "description": "Días de odio  es una  película   argentina  en blanco y negro dirigida por  Leopoldo Torre Nilsson  con guion de él mismo sobre el cuento de  Jorge Luis Borges  titulado  Emma Zunz , que fue incluido en el libro  El Aleph  y editado por primera vez en 1949. Fue estrenada el 3 de junio de 1954 y tuvo como protagonistas principales a  Elisa Galvé ,  Nicolás Fregues ,  Raúl del Valle ,  Enrique de Pedro ,  Duilio Marzio  y  Virginia Romay . El productor de la película fue  Armando Bó . (Wikipedia) Sinopsis Emma Zunz , encarnada por Elisa Galvé, es una muchacha joven de vida más bien solitaria, con pocas amigas. Cuando recibe una carta que le hace saber del suicidio de su padre encarcelado en  Brasil  comienza a planear su venganza contra Plesner (Nicolás Fregues), un empresario que fue compañero de trabajo de su padre a quien este atribuía la responsabilidad por el desfalco que había provocado su encarcelamiento y la ruina de su familia. Luego de obtener trabajo en la fábrica de Plesner, Emma va a una taberna frecuentada por marineros y prostitutas y tiene una relación sexual con un marinero encarnado por Raúl del Valle. Concurre entonces a la oficina de Plesner, a quien le había pedido que la recibiera ese día en que por ser feriado no se trabajaba en la fábrica, con el pretexto de advertirle sobre una posible huelga. Encontrándose solos lo hace salir de la oficina para buscarle un vaso de agua, toma un revólver que Plesner guardaba en su escritorio y lo mata. Cuando llega la policía alega que su empleador la había citado ese día con un pretexto y la había violado, por lo que su acción queda impune como acto en defensa propia Reparto Elisa Galvé ... Emma Zunz Nicolás Fregues  ... Plesner Raúl del Valle  ... Marinero Duilio Marzio  ... Joven Virginia Romay  … Madre de Emma José María Fra … Cholo Enrique de Pedro  ... Padre de Emma Nelly Prince Héctor Bianciotti Julio De Grazia José Guisone Marta Reguera Lina Bardo Renée Benet Liza Darnet Élida Dey Silvia Drei Lois Blue Faure Jr. Otto Fried Leonor Garret Roberto Germán Carmen Giménez Adolfo Laclam Hugo Loyácono Pascual Menutti Ángel Morel Paco Quesada Luis A. Setti Leonor Vázquez",
      "fileSize": 1103085293,
      "addedAt": "2026-01-07T00:08:07.354Z",
      "thumbnail": "https://archive.org/services/img/dias-de-odio-1954",
      "language": "spa",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 365
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.354Z"
}