{
  "imdbId": "archive-la-dentelliere",
  "title": "La Dentellière",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-dentelliere",
      "title": "La Dentellière",
      "description": "La Dentellière La Dentellière est un film franco-suisse réalisé par Claude Goretta et sorti en 1977. Il est inspiré du roman éponyme de Pascal Lainé qui reçut le prix Goncourt en 1974. Béatrice, 18 ans, est apprentie dans un salon de coiffure à Paris. Elle est issue d'un milieu modeste, très réservée et silencieuse. Sa patronne et amie Marylène, très expansive, qui la surnomme Pomme, l'emmène à Cabourg pour quelques jours de vacances. Béatrice y rencontre François, un jeune étudiant, fils d'une famille bourgeoise, brillant. Ils s'aiment et décident d'habiter ensemble à Paris. François présente Béatrice à ses camarades étudiants, puis à ses parents. Mais, Béatrice n'appartient ni à son milieu, ni à sa culture. Elle écoute en silence. Des fractures apparaissent dans leur couple. Le fossé qui les sépare sur le plan culturel et social crée des tensions qui auront raison de leur amour. François décide de quitter Béatrice qui accepte sa décision sans se révolter et s'efface toujours en silence. Mais la souffrance qu'elle cache et tente de refouler la conduit à l'hôpital psychiatrique où François lui rend visite, six mois plus tard. Hélas, la communication est impossible entre les deux êtres, François retourne à ses examens tandis que Pomme s'adonne à la dentelle pour tenter de surmonter son mal être. Réalisation : Claude Goretta Scénario : Claude Goretta et Pascal Lainé d'après son roman La Dentellière Casting : Isabelle Huppert : Béatrice dite Pomme Yves Beneyton : François Béligné Florence Giorgetti : Marylène Torrent, la patronne du salon de coiffure Anne-Marie Düringer : la mère de Pomme Renate Schroeter : Marianne, la compagne de Gérard Christian Baltauss : Gérard, un ami de François Monique Chaumette : Mme Béligné, la mère de François Jean Obé : M. Béligné, le père de François Jeanne Allard : Thérèse Sabine Azéma : Corinne, l'étudiante marxiste Christian Peythieu : un ami de François Heribert Sasse Michel de Ré : peintre Odile Poisson : caissière salon de coiffure Gilberte Géniat : épicière Agnès Château : jeune femme sur la balançoire Yan Brian : John, l'ami américain de Marylène Lucienne Legrand : une cliente du salon de coiffure",
      "fileSize": 6231041644,
      "id": "la-dentelliere"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.701Z"
}