{
  "imdbId": "archive-FestivaldeCannesFrom13thto24thMay2015_201505",
  "title": "NAHID by Ida PANAHANDEH Festival De Cannes From 13th To 24th May 2015",
  "year": 2015,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FestivaldeCannesFrom13thto24thMay2015_201505",
      "title": "FestivaldeCannesFrom13thto24thMay2015 201505",
      "description": "NAHID by Ida PANAHANDEH Festival De Cannes From 13th To 24th May 2015 Edit by ays Published May 22, 2015 Topics NAHID by Ida PANAHANDEH Festival De Cannes From 13th To 24th May 2015 SHOW MORE (this item is currently being modified/updated with a \"book_op\" task) NAHID by Ida PANAHANDEH  Festival De Cannes From 13th To 24th May 2015 Following the success of the Academy Award winning Iranian film ‘A Separation’ the latest Iranian realist movie making waves at the Cannes Film Festival is ‘Nahid,’ the debut offering of director Ida Panahandeh. The film follows Nahid, a single mother with a rebellious son. She is pursued by middle-aged Masoud, who vows to save her financially, but if she remarries she loses custody of her son. Nahid is forced by law to choose between her lover and her son. Despite the fact the film is a first for director Ida Panahandeh he has been in the industry for years: “The reason the film appears crafted is because I have 15 years experience in film. I studied cinema and started making shorts, documentaries and then TV movies. I made three films for television and used my knowledge to make this film. The screenplay was written over two years and we have spent a long time on the project. It wasn’t my intention to make a film about the situation of women In Iran . It is a love story about a woman in Iran. It is not a story about all Iranian women.”",
      "id": "FestivaldeCannesFrom13thto24thMay2015_201505"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:06.801Z"
}