{
  "movieId": "archive-gente-decente-1989",
  "title": "Gente Decente (1989)",
  "year": 1989,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gente-decente-1989",
      "id": "gente-decente-1989",
      "title": "Gente Decente (1989)",
      "description": "Título Original:  Gente Decente Director:  Mario David Basada en cuento de:  Enrique Medina Año:  1989 (Estreno: noviembre de 1989) País:  Argentina Actores:  Hugo Soto, Hector Bidonde, Beatriz Vives, Ernesto Torchia Juan D’Urbano, Juan Carlos Ucello, Gaby Lerner y Paola Karavias. Fotografía:  Hector Colladoro Jefe de Producción:  Jaime Livsit Asistente de Dirección:  Horacio Guisado Sonido:  Jorge Longo Sinopsis:  Luis (Hugo Soto) y Laura (Beatriz Vives) habitan un pequeño departamento. Aunque se aman intensamente se sienten cercados por la falta de espacio vital y ruidos propios de ese lugar tan reducido en que viven y donde, según Luis, sólo pueden verse fragmentados, como «de a pedazos». Un día mientras Laura observa una vidriera, él siente que la redescubre. Ubicado a suficiente distancia la ve sumamente atractiva. A partir de ese día le pide que camine, se mueva y se vista de otra manera para poderla apreciar en plenitud. Paralelamente a ello, la excitación ante ese juego crece, se potencializa en ambos. El acoplamiento así tiene un nuevo ingrediente que los unirá cada vez más y con creciente pasión de amantes. Repentinamente alguien (Héctor Bidonde) les descubre el juego. Próximo a ellos percibe la propuesta y el logro de Luis y Laura. Es de la misma raza y así lo comprenden los tres. De ahora en más comenzarán un extraño y morboso triángulo. Y todo seguirá su curso, para que cada uno en su devenir razonable pueda vivir como «Gente Decente».  https://www.rarovhs.com/gente-decente/",
      "fileSize": 4764282989,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/gente-decente-1989",
      "language": "spa",
      "year": 1989,
      "collection": "feature_films",
      "downloads": 167
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.017Z"
}