{
  "movieId": "archive-how-to-make-a-monster-1958",
  "title": "How To Make A Monster 1958 ★★★ Horror/Drama [1:13:28]",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/how-to-make-a-monster-1958",
      "id": "how-to-make-a-monster-1958",
      "title": "How To Make A Monster 1958 ★★★ Horror/Drama [1:13:28]",
      "description": "How to Make a Monster is a 1958 American horror film drama. It was produced and written by Herman Cohen, directed by Herbert L. Strock, and starring Gary Conway, Robert H. Harris, Paul Brinegar, Morris Ankrum, Robert Shayne, and John Ashley. The film was released by American International Pictures as a double feature with Teenage Caveman. It is notable for its inclusion of props and studios that created actual sci-fi horror movies. The film is a follow-up to both I Was a Teenage Werewolf and I Was a Teenage Frankenstein. Like Teenage Frankenstein, a black-and-white film that switches to color in its final moments, How to Make a Monster was filmed in black-and-white and only the last reel (the fire scene finale) is in full color. Plot: Accomplished but eccentric film make-up artist Pete Dumond has been with the studio for decades and is totally devoted to his art, especially in the creation of screen monsters. His world ends abruptly when new management acquires the company and arbitrarily decides that the horror cycle has run its course and that the studio will now concentrate on escapist musicals. When he hears that he will be pink-slipped, the neurotic but usually affable Dumond turns psychotic and vows vengeance on the two executives that are responsible for the loss of his job. Using a combination of hypnosis and a newly developed chemical formula, Dumond is able to use mind control to compel the two young actors that are playing both the Teenage Werewolf and the Teenage Frankenstein to exact his vengeance for him.",
      "fileSize": 712116278,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/how-to-make-a-monster-1958",
      "language": "eng",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 502
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.614Z"
}