{
  "movieId": "archive-de-oldify-wwi-incredible-and-emotional-footage-of-french-refugees-towards-the-en",
  "title": "Incredible and emotional footage of French refugees towards the end of WW-I in 1918 in color!",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-wwi-incredible-and-emotional-footage-of-french-refugees-towards-the-en",
      "id": "de-oldify-wwi-incredible-and-emotional-footage-of-french-refugees-towards-the-en",
      "title": "Incredible and emotional footage of French refugees towards the end of WW-I in 1918 in color!",
      "description": "Many will be aware that after the outbreak of the First World War, the Netherlands was flooded with almost a million refugees from occupied Belgium. It is much less known that at the end of that war a second wave of refugees, mainly from northern French citizens, emerged. On October 20, 1918, the first refugees crossed the border south of Weert at Stamproy in the Dutch province of Limburg. After four years of world war and blockade, the increasing scarcity and the second wave of the Spanish flu that reached its peak in the autumn, the conditions in 1918 were considerably less favorable than four years earlier, when the Belgians had to be taken care of. The grueling journey of the French had begun weeks earlier. On September 27, 1918, the German occupier of Belgium and northern France issued an ultimatum to the population of about 250 towns and villages in northwestern part of France, which were located between the Hindenburg Line established by the Germans and the border with Belgium, to leave their homes. It was expected that heavy fighting would break out now that the Allies pushed the Germans back towards Belgium, making it recommendable to evacuate the area. The area comprised cities like Douai, Tourcoing, Mouscron, Roubaix and Lille. Those who had heeded the call fled mostly on foot through occupied Belgium, taking their meager possessions with them. Agreement had been reached with the Netherlands that a large group would be temporarily housed there. Many of the refugees were in very bad shape, especially the elderly and those weakened by the war conditions. After the first refugees eventually still unexpectedly crossed the border at Ittervoort, under Weert, the international press gathered in Limburg to record their stories and horrors. There was even a film crew on site filming the arrival of one of the many groups later that week. The film starts at Stramproy, where until the war broke out the steam tram Maaseik-Weert crossed the border, which was now closed.  The group of refugees is followed until they left the city via the station in Weert. What happened next is not shown in this film. A large number of refugees was given temporary shelter in Rotterdam Rijnhaven where they started to arrive from November the 9th onward when in the afternoon the first 1,200 French arrived from Eindhoven and Amersfoort at Feyenoord Station. On New Year's Eve 1919, the shelter in Rotterdam reached its peak with almost 4,500 French and 34 Belgian refugees. This flow would continue until the last French refugee had left the Netherlands in January. In total 427 French refugees died in the Netherlands as the result of their ordeal. Source: Beeld En Geluid Music: Trevor Kowalski.",
      "fileSize": 1412416328,
      "addedAt": "2026-01-07T00:07:59.605Z",
      "thumbnail": "https://archive.org/services/img/de-oldify-wwi-incredible-and-emotional-footage-of-french-refugees-towards-the-en",
      "language": "eng",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 100
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.605Z"
}