{
  "imdbId": "archive-MontageEphemeralBlue1960",
  "title": "Montage II: Ephemeral Blue, 1960",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MontageEphemeralBlue1960",
      "title": "Montage II: Ephemeral Blue, 1960",
      "description": "Montage II: Ephemeral Blue (1960) Written by Charles Plymell Music: David Levenson Voice: Richard Grove Sound: Jim Kramer Cast: Dee LaVelle, Brad Hammond, LaVona Spencer, Dorothy Sourbeer Direction and Photography by Wayne D. Sourbeer A series of eclectic images, built upon a Beat poem by Kansas native Charles Plymell who published several volumes of poetry and the memoir Last of The Moccasins. The images include a woman in black being hoisted by a pumping oil derrick, a businessman who lives in a coffin, childbirth, and much more. Sourbeer told me that Plymell was going through a tough time and was bolstered by his participation in the film. Some of the poetry is quite striking and some of the images are very memorable. So memorable in fact, that while researching the series in the early 1980s my m entionin g this fil m to people who hadn' t seen it for over twenty years spurred accurate recollections of its content. Several years later in 2000, I contacted poet Charles Plymell and he related that he had no copy of the film or the poem. I transcribed the poem from the film’s soundtrack and sent him both the transcription and a copy of the film. The Montage Series By Ben Urish Beginning in 1951 Wichita, Kansas had a vibrant and adventurous film society. The Wichita Film Society ( WFS ) was a focal point for those interested in the cinema arts and was both an institution of education, exhibition, and a hub for other aspects of the local art and theater scenes. By the late 1950s, the WFS had several members and frequent patrons who wanted to make films of their own and in 1959, three of them formed Montage Productions , named after their interest in the films (and film theories) of Sergei Eisenstein and V.I Pudovkin. The films in the series eventually were tied together by two broad and broadly defined attributes: 1) they were about people or places (or both) in Kansas, and 2) the films were artistic representations of other artistic representations, broadly defined. The series lasted until 1965 by which time the m e m bers ' careers took them away from Wichita and each other. Each film had its premiere at a WFS screening. Credits as they appear in the films and a brief synopsis of the films are printed below. In the early and mid - 1980s, I researched the history of The Wichita Film Society and as a result, came across the information about the Montage films written here. Through other local filmmakers and former WFS member s , I was able to get in touch with Corban LePell, Wayne Sourbeer, Richard Wright, and Bruce Conner. They shared their memories and insights and either loaned me copies of their films or told me where to find them. Eventually, the WFS rescreened their films for the public along with more recent films by local filmmakers. I then got the idea to try and finish their unfinished works and began to read up on the town of Nicodemus, the subject of one of their unfinished Montage Productions . Soon, however, I decided to make a film of my own, in more or less the same style that they had used. That film is listed here as well. Years later, former WFS chairperson Rob McHenry also made a film inspired by the Montage series and that film is also listed here. The leader of Montage Productions was Wayne Sourbeer, who later went on to be a noted photographer and also to make several awar d -winning documentaries and other films, as well as building a successful career at PBS . His awards included winning an Emmy . When contacted in the early 1980s he related that he had made the film Starry Night , about the noted Van Gogh painting and he reported that he thought of it as being “ Montage -like” in form and purpose. The other two members were Richard Meyer and Richard Grove. In addition to their work with the WFS and Montage Productions, they began a film class, assisted other local filmmakers, and even started another alternative film series at a local Wichita theater with university professor Walter Merrill who was a ma jo r supporter of both the Montage group and the film and art scene in Wichita. Meyer went into television work eventually being a station director while Grove ran various art museums and became a museum Educatio n Specialis t for the U .S. Office of Education. He often instituted film programs as part of his work.",
      "id": "MontageEphemeralBlue1960"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}