{
  "imdbId": "archive-par-le-trou-de-la-serrure-1901-directed-by-ferdinand-zecca",
  "title": "Par Le Trou De La Serrure ( 1901) Directed By Ferdinand Zecca",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/par-le-trou-de-la-serrure-1901-directed-by-ferdinand-zecca",
      "title": "Par Le Trou De La Serrure ( 1901) Directed By Ferdinand Zecca",
      "description": "What Is Seen Through a Keyhole (1901) 'Par le trou de la serrure' Director: Ferdinand Zecca Par le trou de la serrure is a 1901 French silent short comedy film directed by Ferdinand Zecca and distributed in France by Pathé Frères. It was also distributed in the United States under the titles What Is Seen Through a Keyhole and What Happened to the Inquisitive Janitor, and in the United Kingdom under the titles What Happened: The Inquisitive Janitor and Peeping Tom. Analysis: After being hired by Charles Pathé as main film director of the recently created film production company Pathé Frères, Zecca convinced Pathé to produce in addition to documentaries other genres of films, notably comedy films such as this one but also crime films, like Histoire d'un crime (1901), or religious subjects, like La vie et la passion du Christ (1903). He also introduced in France innovations with respect to cinematographic style. Par le trou de la serrure is the first French film featuring editing in order to combine wide shots and medium close-up point of view shots. Zecca was clearly influenced by George Albert Smith who had used for the first time these innovations in 1900 in his short films Grandma's Reading Glass and As Seen Through a Telescope. Par le trou de la serrure is also characteristic of a certain voyeuristic trend in early cinema in showing what was normally hidden in a hotel room. The film was judged by some, notably Georges Méliès's granddaughter, as being of dubious taste. Distribution: Par le trou de la serrure was distributed by Pathé Frères in 1901 in France, and in 1902 in the United States. In the latter country, it was also distributed by the Kleine Optical Company, the Edison Manufacturing Company, and the Lubin Manufacturing Company.[4] -From Wikipedia",
      "id": "par-le-trou-de-la-serrure-1901-directed-by-ferdinand-zecca"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:12.695Z"
}