{
  "imdbId": "archive-le-petomane-du-moulin-rouge-joseph-pujol-film-de-by-edison-0r-ixip-av-6-fs",
  "title": "LE PETOMANE DU MOULIN ROUGE Joseph Pujol (1900) Film By Edison",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/le-petomane-du-moulin-rouge-joseph-pujol-film-de-by-edison-0r-ixip-av-6-fs",
      "title": "Le Petomane Du Moulin Rouge Joseph Pujol Film De By Edison 0r Ixip Av 6 Fs",
      "description": "LE PETOMANE DU MOULIN ROUGE (1900) In 1900, Edison had planned to dazzle the world with his latest invention, moving black and white pictures featuring sound and smell! Edison first recorded a performance of Le Pétomane on film. At a strategic moment during the film, a foul smell was to be released. Joseph Pujol (June 1, 1857 – August 8, 1945), better known by his stage name Le Pétomane , French pronunciation: [ləpetɔman]), was a French flatulist (professional fartist) and entertainer. He was famous for his remarkable control of the abdominal muscles, which enabled him to seemingly fart at will. His stage name combines the French verb péter, \"to fart\" with the -mane, \"-maniac\" suffix, which translates to \"fartomaniac\". The profession is referred to as \"flatulist\", \"farteur\", or \"fartiste\". It was a common misconception that Pujol passed intestinal gas as part of his stage performance. Rather, he was allegedly able to \"inhale\" or move air into his rectum and then control the release of that air with his anal sphincter muscles. Evidence of his ability to control those muscles was seen in the early accounts of demonstrations of his abilities to fellow soldiers. Life and career: Joseph Pujol was born in Marseille, one of five children of stonemason and sculptor François Pujol and his wife Rose, in a family of Catalan origin. Soon after he left school, he had a strange experience while swimming in the sea. He put his head under the water and held his breath, whereupon he felt an icy cold penetrating his rear. He ran ashore in fright and was amazed to sense water pouring from his anus. While serving in the army, he told his fellow soldiers about his special ability, and repeated it for their amusement, sucking up water from a pan into his rectum and then projecting it up to several yards. He found that he could suck in air as well. A trained baker, Pujol would sometimes entertain his customers by imitating musical instruments and claiming to be playing them behind the counter. Pujol decided to try the stage, and debuted in Marseilles in 1887. When his act was well received, he moved to Paris, where he appeared at the Moulin Rouge in 1892. Some of the highlights of his stage act involved sound effects of cannon fire and thunderstorms, as well as playing \"'O Sole Mio\" and \"La Marseillaise\" on an ocarina through a rubber tube in his anus. He could also blow out a candle from several yards away. His audience included Edward, Prince of Wales; King Leopold II of the Belgians; and Sigmund Freud. In 1894, the managers of the Moulin Rouge sued Pujol for an impromptu exhibition he gave to aid a friend struggling with economic difficulties. Pujol was fined 3,000 francs, and the Moulin Rouge lost their star attraction as the disagreement led him to set up his own travelling show called the Theatre Pompadour. In the following decade Pujol tried to 'refine' and make his acts 'gentler'; one of his favourite numbers became a rhyme about a farm which he himself composed, and which he punctuated with anal renditions of the animals' sounds. With the outbreak of World War I, Pujol retired from the stage and returned to his bakery in Marseilles. Later he opened a biscuit factory in Toulon. He died in 1945, aged 88, and was buried in the cemetery of La Valette-du-Var, where his grave can still be seen today.",
      "id": "le-petomane-du-moulin-rouge-joseph-pujol-film-de-by-edison-0r-ixip-av-6-fs"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:07:06.037Z"
}