{
  "imdbId": "archive-the-dark-corner-1946_202405",
  "title": "The Dark Corner 1946 (CC) Crime, Film-Noir [1:35:11] Lucille Ball, William Bendix",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-dark-corner-1946_202405",
      "title": "The Dark Corner 1946 (CC) Crime, Film-Noir [1:35:11] Lucille Ball, William Bendix",
      "description": "When Bradford Galt (Mark Stevens), a tough private investigator, realizes that he's being followed, he confronts his assailant, a shifty fellow named Fred Foss (William Bendix). Galt's encounter with Foss leads to a web of intrigue involving prosperous art collector Hardy Cathcart (Clifton Webb) and his young wife, Mari (Cathy Downs). Soon Galt is in over his head -- but luckily for him, his tenacious secretary, Kathleen Stewart (Lucille Ball), is on hand to help him out. Trivia: In later years, Lucille Ball was vocal about hating the experience of shooting \"The Dark Corner\". The lion's share of her resentment was pointed at director Henry Hathaway, whose bullying reduced Ball to stuttering on set, at which point Hathaway accused her of being inebriated. Studio production head Darryl F. Zanuck borrowed Lucille Ball from MGM to play Kathleen. At the time, Ball was trying to break from MGM and had an \"unsettled\" personal life. A Henry Hathaway biographer wrote: \"Early into the shoot, it was obvious to Hathaway that Ball was not concentrating on her job. After she flubbed her lines one time too many, Hathaway embarrassed her before her peers by ordering her to leave the set and actually read the script.\" However, some regarded the role as one of Ball's finer dramatic performances. According to Hathaway, Ball subsequently apologized for her behavior. Soundtracks: Give Me the Simple Life (uncredited) Music by Rube Bloom",
      "fileSize": 886140848,
      "id": "the-dark-corner-1946_202405"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.683Z"
}