{
  "imdbId": "archive-ManhattanTower1932Restored",
  "title": "Manhattan Tower 1932 Restored",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ManhattanTower1932Restored",
      "title": "ManhattanTower1932Restored",
      "description": "Manhattan Tower 1932 This is a partially restored version of a public domain movie Manhattan Tower, an entertaining depression era film. The movie has several intertwined stories about some workers in this office building. Manhattan tower is a movie which has many modern resonances in the twenty first century. The theme of crooked businessmen, industrial failures, and common people being cheated is familiar and all too real after the Enron affair. It has a heart warming romance, some comedy, and many good shots of the Empire State building which inspired this tale. The movie was made the year after the Empire State building was opened. For nearly half a century it was the worlds tallest building, and is probably the most famous. I have included a complete cast list so you can watch for some well known actors such as Walter Brennan in character parts. There are other familiar faces in small parts that are not identified. The original was a VHS tape made from a fair 16mm copy of the movie. This copy is fairly complete and only about 1½ minutes seem to be missing. The video was slightly sharpened and the audio track was much improved by noise reduction, equalization, and tick/pop removal. The video jitter was partially reduced, and many defects were removed either by software or by hand. Unfortunately the available consumer software could not automatically remove the VHS/poor transfer wobble, or totally remove the video spots. Only some of the worst defects were removed by hand. The use of automatic video brightness control washed out details and caused brightness changes that could not be easily compensated. In addition the original copy was badly framed which cut off part of the picture. This version can play without any judder because it has been detelecined back to the original 24fps. This is probably the most watchable and listenable copy available of this movie until a better copy is made from a good print. 2012-12-22 The original upload had a bad goof where a section of the movie was duplicated and overlayed over a later section. It has been fixed and updated. Enjoy, J Clement Credited Cast: Mary Brian - Mary Harper Irene Rich - Ann Burns James Hall - Jimmy Duncan Hale Hamilton - David Witman Noel Francis - Marge Lyon Clay Clement - Kenneth Burns Nydia Westman - Miss Wood Jed Prouty - Mr. Hoyt Billy Dooley - Crane-Eaton Wade Boteler - Mr. Ramsay Uncredited Cast: Walter Brennan - Mechanic Ralph Brooks - Young Mechanic Kernan Cripps - Inspector Ned Connors Oliver Eckhardt - Information Clerk Adolph Faylauer - Elevator Passenger Eddie Foster - Crook Raoul Freeman - Janitor Henry Hall - Banker Bert Howard - Office Clerk Emmett King - Bank President Tom London - Mechanic",
      "id": "ManhattanTower1932Restored"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:17.977Z"
}