{
  "imdbId": "archive-la-ley-que-olvidaron-1938",
  "title": "La Ley Que Olvidaron (1937)",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-ley-que-olvidaron-1938",
      "title": "La Ley Que Olvidaron (1937)",
      "description": "La ley que olvidaron  es una película de  Argentina  en blanco y negro dirigida por  José Agustín Ferreyra  sobre guion de  José González Castillo  que se estrenó el 16 de marzo de 1937 y que tuvo como protagonistas a  Libertad Lamarque ,  Santiago Arrieta ,  Herminia Franco  y  Pepita Muñoz . Se basa en la historia de María Giménez, la sirvienta de una pensión que se encarga de criar a una pequeña por conveniencia de sus padres, quienes posteriormente tratan de apartarla de ella. (Wikipedia) Sinopsis María es una sirvienta que trabaja en la pensión de la familia Alurralde. Helena, hija de la dueña de la pensión, en una de sus salidas nocturnas con su prometido queda embarazada, pero se niega a tener una mala reputación. Helena y su familia planean atribuirle a la pequeña criatura a María para que la críe como si fuera su hija y también que se haga cargo de ella. Las cosas se complican cuando la familia quiere recuperar a la niña y María huye con ella diciendo que ella es su verdadera madre. Más tarde, ella va a la cárcel y en el juicio es ayudada por Alberto, un apuesto abogado del cual ella está enamorada en secreto. 1 ​ 2 ​ Reparto Intervinieron en el filme los siguientes intérpretes: 2 ​ 1 ​ Libertad Lamarque ... María Giménez Santiago Arrieta ... Alberto Giménez Herminia Franco ... Helena Alurralde Pepita Muñoz ... Doña Petronila Alurralde José Mazzili ... Carlos Carmen Méndez ... Hermelinda Oscar Soldati ... Belindo María Vitaliani ... Sra. Barranquero Salvador Arcella ... Don Nicola Juan Carrara Juan Siches de Alarcón F. Muñoz Cabrera Celia Lanaro Elisa Labardén Zulema Haydde Cairoli  como Pochita, la hija de María. Hugo Caprera",
      "id": "la-ley-que-olvidaron-1938"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}