{
  "imdbId": "archive-TheDrumsOfLoveForYT",
  "title": "\"The Drums of Love\" (1928) director D. W. Griffith",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheDrumsOfLoveForYT",
      "title": "\"The Drums of Love\" (1928) director D. W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Drums of Love\" is a poignant drama of impossible love. The events in the film occur in 19th century Latin America. A woman is being forced into an unwanted marriage with a crippled monarch, but finds herself attracted to his younger brother. \"The Drums of Love\" marks the end of an era - it is the last truly silent film (without a talkie version) created by the renowned director and 'the father of film' D.W. Griffith.    Directed by                       D.W. Griffith Cinematography by         Karl Struss, Harry Jackson, Billy Bitzer Starring                             Mary Philbin, Lionel Barrymore, Don Alvarado, Tully Marshall Distributed by                   United Artists Corp. Release date                      March 31, 1928 Country                             United States Running time                    85 m.     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "TheDrumsOfLoveForYT"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:58.274Z"
}