{
  "imdbId": "archive-TheUnwantedWoman-ZaneZiadi2005",
  "title": "The Unwanted Woman - Zane Ziadi (2005)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheUnwantedWoman-ZaneZiadi2005",
      "title": "TheUnwantedWoman ZaneZiadi2005",
      "description": "Synopsis \"An engaging film about relationship struggles\" - San Francisco Chronicle From acclaimed director Tahmineh Milani(Two Women; The Fifth Reaction) comes this searing tale about the struggles of women in modern-day Iran. Poor Sima puts up with her philandering and abusive husband, Ahmad. He is so blatant with his indiscretions that he asks Sima to cover for him when he plans a trip with his girlfriend Saba. In an Iran where unmarried couples can be arrested for fraternizing in public, Ahmad needs Sima to pretend that Saba is her cousin. Sima and the couple's young daughter accompany Ahmad and Saba on their trip - a humiliating situation for the devoted wife and mother. But, a surprising turn awaits the trio when they stop in a town where a man has just murdered his wife for her alleged affair. Marila Zarei (The Fifth Reaction) and Amin Hayayee (Coma), two of Iran's newest stars - shine in this controversial drama. DIRECTOR'S VIEW The story of âThe unwanted womanâ reveals opposition and clashes in relations.... in this story we face a man whose wife has betrayed him and a woman whose husband has betrayed her. The story of this movie reveals the effects of social, political and cultural conditions on the people of the society as a whole... In this story this chance is given to different people of the society to open up in the society specially in un developed countries with itâs limit ations and talk about their ideals,complexes and suppressed desires... Cast: Merila Zareie, Amin Hayayi, Parsa Pirouzfar, Elssa Firouz Azar, Keykavous Yakide",
      "id": "TheUnwantedWoman-ZaneZiadi2005"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:44.641Z"
}