{
  "movieId": "archive-high-tide-1947-colorized",
  "title": "High Tide 1947 colorized (Don Castle, Lee Tracy)",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/high-tide-1947-colorized",
      "id": "high-tide-1947-colorized",
      "title": "High Tide 1947 colorized (Don Castle, Lee Tracy)",
      "description": "Private detective Tim Slade (Don Castle) is hired by an old friend, newspaper editor Hugh Fresney (Lee Tracy), to protect him from a gangster (Anthony Warde), about whom the editor is planning an exposé. When the newspaper's publisher Clint Vaughn (Douglas Walton) is shot, Slade comes under suspicion by Inspector O'Haffey (Regis Toomey) because of his past association with Vaughn's wife (Julie Bishop) and when he is found at the scene of a second murder. Slade gets help from Vaughn's attractive secretary (Anabel Shaw). The entire story is told in flashback after an accident leaves Slade and Fresney pinned under a car at the seashore, with the incoming high tide about to engulf them. Based on the story \"Inside Job\" by Raoul Whitfield. Lee Tracy as Hugh Fresney Don Castle as Tim Slade Julie Bishop as Julie Vaughn Anabel Shaw as Dana Jones Regis Toomey as Inspector O'Haffey Douglas Walton as Clinton Vaughn Francis Ford as Pop Garrow Anthony Warde as Nick Dyke I colorized this using AI software that doesn't always get the colors right, but I think it looks fairly natural. Hopefully a more professional job will be done someday. For questions or general comments, please use the Colorized Movies Forum at https://archive.org/details/colorized-movies?tab=forum",
      "fileSize": 513767891,
      "addedAt": "2026-01-07T00:08:39.346Z",
      "thumbnail": "https://archive.org/services/img/high-tide-1947-colorized",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 6800
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.346Z"
}