{
  "imdbId": "archive-theEagle1925",
  "title": "\"The Eagle\" [1925]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theEagle1925",
      "title": "\"The Eagle\" [1925]",
      "description": "Sort of a Valentine treat. A comback film for Rudolph with this well-liked film. Plot [Wikipedia]... Vladimir Dubrovsky (Rudolph Valentino), a Cossack serving in the Russian army, comes to the notice of the Czarina (Louise Dresser) when he rescues Mascha (Vilma Banky), a beautiful young lady, and her aunt trapped in a runaway stagecoach. He is delighted when the Czarina offers to make him a general but horrified when she tries to seduce him. He flees and the Czarina puts a price on his head. Soon afterwards he receives a letter from his father informing him that the evil nobleman Kyrilla Troekouroff (James A. Marcus) has taken over his lands and is terrorizing the countryside. Hurrying home, Vladimir learns that his father has died. Vowing to avenge his father and help the victimized peasantry, he adopts a black mask and becomes the Black Eagle, a Robin Hood figure. Discovering that Kyrilla is Mascha's father, he takes the place of a tutor who has been sent for from France, but not previously seen by anyone in the household. Vladimir is thus able to become part of Kyrilla's household. As Vladimir's love for Mascha grows, he becomes more and more reluctant to continue seeking revenge against her father, and the two eventually flee the Troekouroff estate. Vladimir is captured by the Czarina's men, but the Czarina, once determined to have him executed, has a last minute change of heart, and she allows Vladimir, given a new French name, and Mascha to leave Russia for Paris. ---------- A curious note from Wikipedia... \"The Eagle is also notable in cinematic history for its famous extended tracking shot of the food laden table in the banquet scene.\" No lazy zoom lens there. ---------- David Atfield, an IMDb reviewer, wrote... This is an astonishing film, breathtakingly shot by George Barnes, which reveals how powerful the silent film could be. Like many silents this film is not about its plot but about the minutia of human behaviour and emotion. The moment when Valentino touches Banky's neck you can feel her thrill - her eyes moisten with passion. This is the kind of moment that the talkies had trouble with - words spoil the ecstasy of first touch - as many of the silent screen's great lovers found when they entered talkies. But Valentino did not live to make a talkie - and his legend is probably grateful. He is exceptional in this period romp through the Russia of Catherine the Great. Vilma Banky matches him superbly - she has the ethereal beauty of Garbo. James Marcus is fun as the baddie, but Louise Dresser is brilliant as Catherine the Great. The scene where she attempts to \"take advantage\" of Valentino is extraordinary - and a great step forward for female liberation. Combine these performances with the genius of Clarence Brown, the costumes of Adrian (which are intentionally not quite of the right period having a distinctive 1920's feel), and the production design of William Cameron Menzies and you have a masterpiece. It will surprise you at every turn, and the tracking shots are truly magnificent - especially that banquet scene! Don't miss it - and if you get the version with Carl Davis' score you are in for a real treat. ---------- And finally, the music bed is Claude Debussy's Quartet in G minor Opus 10.",
      "fileSize": 1347788051,
      "id": "theEagle1925"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.280Z"
}