{
  "movieId": "archive-GalvestonHurricaneAndTidalWaveOf1900",
  "title": "Galveston Hurricane and Tidal Wave of 1900",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/GalvestonHurricaneAndTidalWaveOf1900",
      "id": "GalvestonHurricaneAndTidalWaveOf1900",
      "title": "Galveston Hurricane and Tidal Wave of 1900",
      "description": "At the first news of the disaster by cyclone and tidal wave that devastated Galveston on Saturday, Sept. 8th, 1900, we (Thomas Edison Films) equipped a party of photographers and sent them by special train to the scene of the ruins. Arriving at the scene of desolation shortly after the storm had swept over that city (September 24, 1900), our party succeeded, at the risk of life and limb, in taking about a thousand feet of moving pictures. In spite of the fact that Galveston was under martial law and that the photographers were shot down at sight by the excited police guards, a very wide range of subject has been secured. The series, taken as a whole, will give the entire world a definite idea of the terrible disaster, unequaled since the Johnstown flood of 1889. Bird's Eye View of Dock Showing dismantled cars, wrecked warehouses, schooners and tugs that had been stranded on the docks; also the tents that had been rigged up for the poor people who had been left entirely homeless. Launching a Stranded Schooner from the Dock During the terrific storm all of the light craft along the dock front was lifted out of the water and washed up into the streets, many of them being carried for miles inland. This subject shows a number of boatmen who have banded together to get their craft back into the water, a panoramic view being taken of the schooner as she glided sideways down the improvised ways, forming a very interesting subject. Panorama of Galveston Power House This building and machinery supplied the electric power and electric light for the entire city of Galveston, including the car system. The building, which is of solid masonry, is a complete wreck, and together with the twisted iron work of the machinery, shows the tremendous power of the cyclone. Panorama of Orphans' Home* This is the building in which so many of the poor orphans met their death. The place is completely dismantled. In addition to the orphanage is shown one of the principal streets in Galveston blocked with overturned houses and other materials. Panorama of Wreckage of Water Front This picture shows the remains of one of the docks, several freight cars being piled one upon the other, while the most interesting part of the picture shows two schooners literally smashed one into the other, forming a most picturesque mass of wreckage. Panoramic View of Tremont Hotel This picture shows several buildings which were wrecked and also shows a rear view of this hotel, which is on the highest point of land in Galveston, and in which several thousand people were saved. Searching Ruins on Broadway for Dead Bodies This shows the heart of one of the tremendous drifts in the east end of Galveston. Hundreds of dead bodies are concealed in these immense masses, and at the time the picture was taken the odor given out could be detected for miles. The subject shows a gang of laborers clearing away the debris in the search for corpses, one of which was discovered while the picture was being taken. * None of the orphans in this home died. This was not true for the Sisters of Charity Orphanage: \"More than 6,000 men, women and children lost their lives. Among the dead were 10 sisters and 90 children from the St. Mary's Orphans Asylum, operated by the Sisters of Charity.\"",
      "fileSize": 174405500,
      "addedAt": "2026-01-07T00:06:25.399Z",
      "thumbnail": "https://archive.org/services/img/GalvestonHurricaneAndTidalWaveOf1900",
      "collection": "feature_films",
      "downloads": 9391
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}