{
  "imdbId": "archive-las-aguas-bajan-turbias-1952_202502",
  "title": "Las Aguas Bajan Turbias (1952)",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/las-aguas-bajan-turbias-1952_202502",
      "title": "Las Aguas Bajan Turbias (1952)",
      "description": "Las aguas bajan turbias  es una película  argentina , basada en la novela  El río oscuro  de  Alfredo Varela  (quien también colaboró en el guion). Realizada entre 1951 y 1952, es una obra representativa del estilo de cine político-social de su autor e intérprete principal,  Hugo del Carril , y está considerada entre las obras más destacadas del cine argentino. Fue estrenada el 9 de octubre de 1952 y se la ha exhibido también como  El infierno verde . Fue reconocida como la  sexta mejor película del cine argentino de todos los tiempos  en la encuesta realizada por el  Museo del Cine Pablo Ducrós Hicken  en 1977, mientras que ocupó el puesto 4 en la edición de 1984 y el 3 en la edición de 2000. 1 ​ En una nueva versión de la encuesta organizada en 2022 por las revistas especializadas  La vida útil ,  Taipei  y  La tierra quema , presentada en el  Festival Internacional de Cine de Mar del Plata , la película alcanzó el puesto 14. 2 ​(Wikipedia) Argumento Los hermanos Santos y Rufino Peralta (del Carril y Laxalt) se emplean como trabajadores en los  yerbatales  del Alto  Paraná . Allí se encontrarán con condiciones infrahumanas de trabajo y la codicia de los patrones. Además, Santos se enfrentará con un capataz por el amor de Amelia (Adriana Benetti). La rebelión va madurando, al tiempo que se va gestando la formación de un sindicato de trabajadores. Los obreros se alzan y castigan a sus explotadores. 3 ​ Reparto Intervinieron en el filme los siguientes intérpretes: 3 ​ Hugo del Carril Adriana Benetti Raúl del Valle Gloria Ferrandiz Pedro Laxalt Eloy Álvarez Herminia Franco Joaquín Petrosino Carlos Escobares Domingo Garibotto Francisco Audenino Luis Otero Robert Le Vigan Mecha López Fausto Etchegoin Carlos D'Agostino Benjamín Bageler Damasio Esquivel",
      "id": "las-aguas-bajan-turbias-1952_202502"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:38.887Z"
}