{
  "imdbId": "archive-ZananBedouneMardanShirin-neshat",
  "title": "Zanan Bedoune Mardan: Shirin-Neshat",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ZananBedouneMardanShirin-neshat",
      "title": "ZananBedouneMardanShirin Neshat",
      "description": "Shirin Neshat's first feature length film, is based on a magic realist novel written by Iranian author Sharnush Parsipour. The narrative interweaves the lives of four Iranian women during the summer of 1953, a pivotal moment in Iranian history when an American led Coup d'état brought down the democratically elected Prime Minister Dr. Mohammed Mossadegh and reinstalled the Shah to power. Synopsis The film chronicles the lives of the four characters in parallel manner. Each woman appearing to be suffering and running away from some sort of social, cultural or sexual oppression; yet their lives mysteriously converge in an orchard where they attempt to create their own society. The story follows the construction and eventual breakdown of this 'utopian' society. Cast: Navíd Akhavan, Bijan Daneshmand, Pegah Ferydoni, Arita Shahrzad, Shabnam Toloui, Orsolya Tóth, Essa Zahi Faurschou Beijing is proud to present \"Women without Men\" - a monumental film opus by the Iranian-American artist Shirin Neshat. It is her first exhibition in China. Shirin Neshat is known for her poetic and beautiful photographs and video films portraying Islamic culture in conceptual and stylized form. Being an Iranian living most of her life in exile in USA, she has with strength portrayed the many complexities within current Islamic culture, between religion and secularization, women and men, tradition and modernity, Eat and West. She is thus providing us with more varied images of fundamental human problems in contemporary Islamic culture, rather than the simplistic, stereotypically negative images of Islam we have become used to seeing in the media after 9/11. \"Women without Men\" is a series of 5 films that Shirin Neshat has created between 2004-2008. The film narratives are based on the controversial magical realist novel \"Women without Men\" from 1989 by the Iranian author Shahrnush Parsipur, whose entire literary ouvre is banned in Iran today. In five parallel sequences, Shirin Neshat portrays the lives of five Iranian Women in 1953, an important year in Iranianrecent history as the democratically elected prime minister was removed in a coup d'état mounted by American and British forces, whose task it was to reinstate the Shah, in order to avoid the nationalisation of the country's oil resources. Shirin Neshat is not creating a straightforward film version of the novel but rather her own interpretation of the five female main characters: Mahdokht, Zarin, Munis, Faezeh and Farokh Legha. Shirin Neshat retains the magic realism of the novel and allows the supernatural and surreal to interact with the stories.",
      "id": "ZananBedouneMardanShirin-neshat"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:56.733Z"
}