{
  "imdbId": "archive-the-flying-ace-part-1",
  "title": "The Flying Ace Part 1. 1920 {All Black Cast Silent Film} 1:05:50",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-flying-ace-part-1",
      "title": "The Flying Ace Part 1. 1920 {All Black Cast Silent Film} 1:05:50",
      "description": "The Flying Ace is a 1926 black-and-white silent drama film directed by Richard E. Norman with an all-African-American cast. This six-reel film, made by Norman Studios in Jacksonville, Florida, utilized a mix of professionals such as leads Laurence Criner and Kathryn Boyd, and non-professional actors. Films such as The Flying Ace, that used an all-African-American cast and were shown specifically to African-American audiences, were known as \"race films\". Norman Studios produced feature length and numerous short race films during the 1920s. The untapped black film going market and the plethora of talented performers unable to get work in mainstream films led to the production of race films by Norman Studios. Richard Norman's reason for producing race films was not solely a business decision. Although the studio was filling a niche, Norman was also motivated by the state of race relations at the time and wanted to make a positive impact. Norman cast J. Laurence Criner, a veteran of Harlem's prestigious all-black theater troupe the Lafayette Players, in the leading role of Captain Billy Stokes, a black pilot who fought in France during World War I. While Eugene Bullard was a black pilot in the Lafayette Escadrille, African-Americans were not allowed to serve as pilots in the United States Army Air Corps until 1940. The role of pilot Ruth Sawtelle, played by Kathryn Boyd, is loosely based on African-American aviator Bessie Coleman. Coleman had sent a letter to the Norman Studios expressing a wish to be in a film based on her life. Only a day before she was to appear in an exhibition in Jacksonville, she lost her life on April 30, 1926, when she fell from her aircraft. It is unclear whether Norman and Coleman had met. The Flying Ace was advertised as \"the greatest airplane thriller ever filmed\"; however, save for one brief sequence, the film was filmed entirely on the ground, using camera tricks, such as the creative use of the camera to create the upside down sequences to imply movement and altitude for the stationary aircraft. A full-scale mock-up of a Curtiss JN-4 biplane was also constructed. Cast: Laurence Criner as Capt. Billy Stokes (as Lawrence Criner) Kathryn Boyd as Ruth Sawtelle Boise De Legge as Blair Kimball Harold Platts as Finley Tucker Lions Daniels as Constable Jed Splivins George Colvin as Thomas Sawtelle Sam Jordan as Dr. Maynard R.L. Brown as Howard McAndrews (credited as Dr. R.L. Brown) Steve Reynolds as Peg (credited as Steve \"Peg\" Reynolds) In 2021, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".  From Wikipedia.",
      "id": "the-flying-ace-part-1"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:57.687Z"
}