{
  "imdbId": "archive-ayudame-a-vivir-1936",
  "title": "Ayudame A Vivir (1936)",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ayudame-a-vivir-1936",
      "title": "Ayudame A Vivir",
      "description": "Ayúdame a vivir  es una  película   argentina , dirigida por  José Agustín Ferreyra  y protagonizada por  Libertad Lamarque ,  Floren Delbene  y  Santiago Gómez Cou . Libertad Lamarque, a quien pertenecía la idea original, elaboró el guion juntamente con Ferreyra y el filme se estrenó el 26 de agosto de 1936. La película, que narra las desventuras románticas de una joven y evidentemente recoge experiencias personales de la propia Lamarque, introduce la innovación de interrumpir el diálogo para continuarlo con una canción entonada por la actriz. En Argentina tuvo gran éxito de público que se prolongó cuando fue exhibida en los otros países  latinoamericanos  y en  España  constituyéndose en la punta de lanza para la penetración del cine argentino en los mismos. (Wikipedia) Sinopsis Mientras estudia en un internado católico, en la década de 1930, la joven Luisa conoce a un muchacho, Julio, que desde la calle y reja por medio conversa con ella hasta que el arrogante hermano mayor de la muchacha que ha tomado el rol de jefe de la familia la retira del establecimiento y la lleva a vivir a la casona familiar junto con otro hermano y el abuelo. La relación con Julio continúa y con una pareja amiga hacen una salida a un parque. Al agravarse una tos que Luisa ya tenía en el internado se revela una  tuberculosis  por lo que es enviada a las sierras de  Córdoba  a reponerse provocando la separación con Julio, a quien sus amigos tratan sin resultado de hacer que salga con otras mujeres en  Buenos Aires . Ya repuesta, Luisa envía a Julio un telegrama anunciándole su regreso a Buenos Aires pero no lo recibe porque lo intercepta un amigo con el que había convenido ir ese día al cabaret. Cuando Julio vuelve a la madrugada borracho y con una rubia, encuentra en su casa a Luisa que comprueba su infidelidad. La rubia sale de la casa pero rueda por la escalera y Luisa es acusada de homicidio pero Julio consigue que la mujer agonizante la exculpe. La música cumple un papel peculiar en la película pues las canciones acompañan y complementan la trama. Así cuando Luisa hace la salida al parque con Julio escuchan en el reproductor portátil que llevan, a la orquesta de Alfredo Malerba acompañando el tango  Tu cariño  que canta la propia Libertad revelando en los versos desde el disco el cariño que Luisa siente por Julio. Cuando está ya repuesta de su enfermedad, Luisa entona entre los cerros la marcha  Canto a la vida  (\"Canta otra vez en mí la primavera\"). En la escena donde Luisa encuentra a Julio en evidente infidelidad, cantará el tango  Ayúdame a vivir  (\"Yo no sé qué nombre tiene quien jura por la cruz sin cumplir lo que promete\"). Finalmente, cuando Julio va a despedirse de Luisa, esta muestra sus sentimientos y adelanta cuál será el desenlace cantándole el tango  Arrepentido : \"mientras mi razón te condenaba sin piedad, mi alma, pobre alma. perdonaba tu maldad (...) con los brazos abiertos yo te espero, veni, veni, porque te quiero igual o más que ayer.\" 1 ​ El final de la película respetó el código de la época conforme al cual la mujer engañada siempre debía perdonar para salvar su pareja. 2 ​ Reparto Libertad Lamarque  ... Luisita Floren Delbene ... Julio Perla Mary ... Mariluz Delia Durruty  ... Teresa Lalo Harbín  ... Federico Santiago Gómez Cou  ... Enrique Atilio Supparo  ... Abuelo Juan Siches de Alarcón  ... Juan Alesio Guevara Fanny Dejouanne Nelly Edison Raúl Deval",
      "id": "ayudame-a-vivir-1936"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:08.092Z"
}