{
  "imdbId": "archive-acosada-1964",
  "title": "Acosada (1964)",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/acosada-1964",
      "title": "Acosada (1964)",
      "description": "Acosada   es una película coproducida por Argentina y Venezuela, dirigida por Alberto Dubois y protagonizada por Libertad Leblanc . La cinta es un drama erótico-policial en blanco y negro y fue estrenada en Buenos Aires el 10 de septiembre de 1964. [1] Esta película fue producida y distribuida por Gloria Films.             Es de hacer notar que, posteriormente, la distribuidora Cambist Films compró los derechos de la cinta para su exhibición en Estados Unidos, la dobló al idioma inglés y la película fue estrenada en ese país el 1 de junio de 1966 en Champaign, Illinois, bajo el título de \"El coño rosa: donde vive el pecado\". Actualmente, esta película es considerada como la película de mayor difusión internacional de la llamada \"diosa blanca\". (Wikipedia) Sinopsis Estando en  Nueva York , una rubia y bella bailarina argentina de danza exótica, Mara Luján (Libertad Leblanc), consigue un contrato para desempeñarse en un club nocturno de  Caracas , Venezuela, llamado \"The Pink Pussy\". Al llegar al hotel en Caracas, descubre que nadie ha hecho reservas para ella. Mara se dirige al club nocturno The Pink Pussy, pero el gerente le informa que nadie en Nueva York estaba autorizado para hacer contratos. Confundida y angustiada, regresa a su hotel y descubre que su habitación ha sido saqueada. Se han llevado pertenencias valiosas y sus documentos personales. El dueño del hotel accede a darle alojamiento a cambio de una costosa pulsera que ella le entrega. De pronto se encuentra varada en una ciudad extraña, sola, sin dinero y sin trabajo. Comienza a buscar empleo, pero solo obtiene respuestas negativas. Volviendo un día al hotel, dos hombres la meten dentro de un auto, la llevan hasta un sitio solitario y la violan. Entonces aparece un hombre llamado Alex ( Francisco Ferrari ), quien la reconforta y la lleva de vuelta a su hotel. De a poco, Alex se va ganando la confianza de Mara, y le consigue un contrato en The Pink Pussy. Lo que Mara no sabe es que Alex es el magnate del vicio en Caracas, y responsable de todo lo que le ha estado ocurriendo. Alex utiliza esta estratagema para atraer a muchachas indefensas de todas partes del globo, para luego enviciarlas y convertirlas en esclavas sexuales, para toda clase de perversiones. The Pink Pussy es la vidriera o escaparate que Alex utiliza para mostrar las \"mercancías\" a los potenciales clientes. En The Pink Pussy, Mara conoce a Ernesto ( Néstor Zavarce ), quien se desempeña en el club como animador. Él la lleva a conocer la ciudad, y se enamoran. Cuando Alex se entera de la relación entre Ernesto y Mara, monta en cólera y despide a Ernesto. Éste, creyendo que Mara ha tenido algo que ver en ello, la acusa amargamente de haberse convertido en la nueva \"chica\" de Alex. Entretanto, Elvira ( Eva Moreno ), la \"chica\" de Alex, una mujer destruida por el consumo de droga, se siente celosa de la atención que Alex dispensa a Mara. Elvira se pone en contacto con Mara y le revela quién es en verdad Alex, y le informa que todas sus pertenencias se encuentran en poder de Alex. Mara decide comprobar todo por sí misma, e idea una estratagema para llegar hasta la guarida de Alex. Pero Alex y sus secuaces la atrapan. Al saber que es Elvira quien lo ha delatado, Alex la manda a matar, pero uno de los hombres la deja escapar. Ernesto, que ha estado siguiendo los pasos de Mara, se da cuenta de que ella se halla en peligro y acudirá en su rescate Reparto Libertad Leblanc  ... Mara Luján Néstor Zavarce  (†) ... Ernesto Miranda Eva Moreno  (†) ... Elvira Francisco Ferrari  (†) ... Alex Del Villar José Jordá Adolfo Martínez Alcalá  (†) Alberto Álvarez  (†) Carmen Julia Álvarez Marina Baura Ada Riera Adelaida Torrente  (†) Napoleón Deffit  (†) Teresa Marti  (†) Gilberto Pinto  (†) Heriberto Escalona Dante Carle  (†) June Roberts Hugo Montes Vicente Quintian Jose Vasquez Manuel Calzada Paco de la Riera  (†) Manuel Torres Tucusito Brigitte",
      "fileSize": 1115765837,
      "id": "acosada-1964"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.439Z"
}