{
  "movieId": "archive-SarumadZemestunaftabkaran-eJangalByShaghayeghKamali",
  "title": "Sarumad zemestun (Aftabkaran-e Jangal) by Shaghayegh Kamali",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SarumadZemestunaftabkaran-eJangalByShaghayeghKamali",
      "id": "SarumadZemestunaftabkaran-eJangalByShaghayeghKamali",
      "title": "Sarumad zemestun (Aftabkaran-e Jangal) by Shaghayegh Kamali",
      "description": "Sarumad zemestun (Aftabkaran-e Jangal) Song: Shaghayegh Kamali Composition: Siavash Beizai ***** Poem ***** The winter has come to an end, the spring has blossomed. The red flower of the sun has risen once again, the night has escaped. The mountains are covered with tulips, the tulips are awake. They are planting sunshine in the moutains, flower by flower by flower. In the mountains, his heart is awake, he is bringing flowers and bread and will defend In his heart, he has a forest of stars. His lips wear a smile of light. His heart is filled with the flames of emotion. His voice is like a spring. His memory is like a deer in the forest of light.\" ********************\" \"Sari Sirun Yar\" (Mountain Sweetheart) (by Gusan Ashot) \"Hazar nazov yar hoveri het yek, Dzaghik pnjelov sarvori het yek, Sev dzious vra dzer gyughn em yekel, Dourad pak tesel molor mnatsel. Sari sirun yar, sari mekhak ber, Akh, che, inch mekhak, siro krak ber. Hazar mi dzaghki mej es metsatsel, Dzaghkants tsogherov mazerad tatsel, Mazerid buyra hervits e kalis, Zepyura berum srtis e talis. Sari sirun... Erb qo hayatska yerknin es harum, Var astghern ases nor luys en arnum, Qo dzaynn en arnum havq ou hovera, Akh, erb? k'arnem es qo matagh sera; Sari Sirun... Sarits e kalis es arvi joura, Berum e, yar, qo buyrn ou hambuyra, Ashot, te karas, qo erg ou hangov, Yarid kakhardir, togh toun ga handov. Sari sirun...\"",
      "fileSize": 123280894,
      "addedAt": "2026-01-07T00:06:51.868Z",
      "thumbnail": "https://archive.org/services/img/SarumadZemestunaftabkaran-eJangalByShaghayeghKamali",
      "collection": "feature_films",
      "downloads": 1854
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.868Z"
}