{
  "imdbId": "archive-mark-of-the-vampire-1935_202507",
  "title": "Mark of the Vampire 1935",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mark-of-the-vampire-1935_202507",
      "title": "Mark of the Vampire 1935",
      "description": "Mark of the Vampire  is a 1935 American  horror film  directed by  Tod Browning , and starring  Lionel Barrymore ,  Elizabeth Allan ,  Bela Lugosi ,  Lionel Atwill , and  Jean Hersholt , produced by  Metro Goldwyn Mayer . Its plot follows a series of deaths and attacks by vampires that brings eminent expert Professor Zelen to the aid of Irena Borotyn, who is about to be married. Her father, Sir Karell, died from complete loss of blood, with bite wounds on his neck, and it appears he may be one of the undead now plaguing the area. It has been described as a  talkie   remake  of Browning's  lost   silent   London After Midnight  (1927), though it does not credit the older film or its writers. Sir Karell Borotyn is found murdered in his house, with two tiny pinpoint wounds on his neck. The attending doctor, Dr. Doskil, and Sir Karell's friend Baron Otto von Zinden are convinced that he was killed by a  vampire . They suspect Count Mora and his daughter Luna, while the  Prague  Police Inspector Neumann refuses to believe them. Sir Karell's daughter Irena is the Count's next target. Professor Zelen, an expert on vampires and the  occult , arrives in order to prevent her death. After Irena is menaced by the vampires on several occasions, Zelen, Baron Otto, and Inspector Neumann descend into the ruined parts of the castle to hunt down the undead monsters and destroy them. When Zelen and Baron Otto find themselves alone, however, Zelen  hypnotizes  the Baron and asks him to relive the night of Sir Karell's murder. It is then revealed that the \"vampires\" are actually hired actors, and that the entire experience has been an elaborate  charade  concocted by Zelen in the hopes of tricking the real murderer —Baron Otto— into confessing to the crime. Acknowledging that the charade has failed to produce its intended results, Zelen, along with Irena and another actor who strongly resembles Sir Karell, compels the hypnotized Baron into re-enacting the murder, effectively proving his guilt. During the re-enactment, Baron Otto reveals his true motive: he wished to marry Irena, but her father would not allow it. He also reveals how he staged the murder to resemble a vampire attack. With Baron Otto arrested, Irena explains the plot to her fiance, Fedor, who was not involved in the subterfuge and believed that the vampires were real. The film ends with the actors who played the vampires packing up their supplies, and \"Count Mora\" exclaiming, \"This vampire business, it has given me a great idea for a new act! Luna, in the new act, I will be the vampire! Did you watch me? I gave all of me! I was greater than any  real  vampire!\" His fellow thespians are not enthusiastic.",
      "id": "mark-of-the-vampire-1935_202507"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:46.427Z"
}