{
  "imdbId": "archive-Mommartz_Selbstschusse_1967",
  "title": "1967 Selbstschüsse (Self Shots)",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mommartz_Selbstschusse_1967",
      "title": "Mommartz Selbstschusse",
      "description": "I threw the camera in the air and in this way I was able to express my aversion to conventional film show and skip my own limits. (LUTZ MOMMARTZ) \"Selfshots\" is the visual biography of an unconventional filmmaker. As a director, cinematographer and actor in one person, he points the camera on himself. He plays with her , throws it into the air, hurtling across the meadows, filmed his movements, his face and his hands and demonstrates in this way his adventurous relationship with a 16mm camera. Not the acting, but the filming itselve becomes the action. Lutz Mommartz makes in his movies ​​the quip of Gadard from \"film as the truth 24 times a second\" aware like no other. (WILFRIED REICHART, KÖLNER STADTANZEIGER, 4.1.68) \"Selfshots\" in which Lutz Mommartz can be seen, in a meadow, captured by the camera, that Lutz Mommartz carries while walking on a meadow, sometimes directed at his feet, sometimes throwing in the air, sometimes kissing, sometimes holding his hand before the lense. Even the camera itself can be seen: as a shadow on the meadow, in the air. The cameraman presentes his attitude to life to the public, without using tiring auxiliary constructions, with whom one else often messes around pretending distance pretending. This film should be an example of the very personal film and everybody may take something out of it. A second Lutz Mommartz was not to be discovered there, but two other films: Hellmuth Costard \"Why did you kiss me awake\" and Franz Wintzentsens \"Experiences of a doll\". (UWE NETTELBECK, DIE ZEIT, 5.1.68) We, the audience, are completly carried along by what the camera sees, and without staining it in an intellectual direction, Lutz Mommartz's film raises absorbing questions about the relationship between a person and what he perceives, between 'I' and 'eye'. (GUY BRETT, THE TIMES 3.9.70)",
      "id": "Mommartz_Selbstschusse_1967"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:18.080Z"
}