{
  "imdbId": "archive-de-oldify-prachtige-rondvlucht-over-amsterdam-scheveningen-delft-den-haag-en-rot",
  "title": "Prachtige rondvlucht over Amsterdam, Scheveningen, Delft, Den Haag en Rotterdam in 1926 in kleur!",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-prachtige-rondvlucht-over-amsterdam-scheveningen-delft-den-haag-en-rot",
      "title": "Prachtige rondvlucht over Amsterdam, Scheveningen, Delft, Den Haag en Rotterdam in 1926 in kleur!",
      "description": "A beautiful flight (with the KLM) over the Dutch cities of Amsterdam, Scheveningen, Delft, The Hague and Rotterdam nearly a century ago in color (A.I. enhanced & colorized). This flight was made with the H-NACC aircraft that took-off from Schiphol and headed for Rotterdam Waalhaven airport to pick up passngers for a scenic flight. The aircraft, type Fokker F.VII, can also be seen in even more detail in my next film. In previous years (1924) it served also on the first extremely long distance route between The Netherland and Batavia in the Dutch East Indies (nowadays Indonesia). Rotterdam Waalhaven airport was opened only 6 years earlier on 26 July 1920. To a large extent this airport was destroyed during WWII in 1940 and never rebuilt. In stead Rotterdam opened airport Zestienhoven in 1956, currently known as \"Rotterdam The Hague Airport\". The source of this film, Beeld En Geluid, states \"1927\" as the date of this film. However, this must be incorrect because the H-NACC crashed in Belgium on 9 July 1926. Therefore it can be assumed that this scenic flight happened not long before that fatal crash. Vliegtuig-enthousiasten zullen hun hart op kunnen halen aan deze film. Met name de zeer scherpe beelden van de beroemde H-NACC en ook van het stationsgebouw van Vliegveld Waalhaven zijn uniek! As usual, I need your help to identify all the locations and to add them to the timeline and CC captions, so please help if you can! Draft timeline: 00:00 The film starts while the H-NACC flies over the Rijksmuseum in Amsterdam 00:17 Bloemensingel and Munttoren in Amsterdam 00:23 Brief glimpse of the Dam and De Bijenkorf warehouse 00:29 Victoriahotel (bottom-left) 00:33 Amsterdam Central station and surroundings 00:38 Over Fort Schiphol 00:48 Towards Purmerplein in Amsterdam Noord; Nieuwendammerkerk 00:52 Purmerplein in Amsterdam Noord 01:12 Approaching Scheveningen from the North Sea 01:21 Flying over the old pier (destroyed in 1943) 01:28 The Kuhrhaus at Scheveningen 01:39 The lighthouse at Scheveningen 01:48 The Scheveningen fishing harbour 02:00 The entrance to the harbour 02:03 Waalhaven airport in Rotterdam 02:10 Passengers checking in for a scenic flight with the KLM 02:18 \"Only\" 7.50 Dutch Guilders for a ticket (about € 400 in today's money) 02:43 Stunning views of Waalhaven terminal building 03:12 Passengers gathering for boarding the H-NACC; kids are getting exited 03:39 The Fokker F.VII aircraft H-NACC is being prepared for the flight 03:48 First glimpses of Rotterdam from the air 03:54 The Peace Palace in The Hague (Donated by the American Carnegie) 04:00 The Hague (Bezuidenhout?) from above 04:06 Location (?) 04:10 Location (?) 04:14 Approaching Delft 04:18 The smelly Calvé \"Gist & Spiritus\" factory in Delft 04:21 Delft old town center 04:25 The Nieuwe Kerk and Grote Markt come into view 04:32 Flying over Rotterdam Hofplein area with the Delftse Poort 04:39 The Rotterdam City Hall 04:43 Post office building on the Coolsingel 04:50 The old city of Rotterdam, almost fully destroyed during WWII 04:54 Hardly anything remained standing after the German bombardement on 14/05/1940 04:57 Oranjeboom beer factory at the Nassaukade / Oranjeboomstraat (Feijenoord) 05:06 Location (?) 05:09 Inland vessels in the Rotterdam harbour 05:15 Separate rail- and road- bridges over the Maas River at Noordereiland in Rotterdam 05:23 A safe return to Rotterdam Waalhaven Airport. Music: Trevor Kowalski Source: Beeld En Geluid",
      "id": "de-oldify-prachtige-rondvlucht-over-amsterdam-scheveningen-delft-den-haag-en-rot"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:59.604Z"
}