{
  "imdbId": "archive-CaptainZ-Ro",
  "title": "Captain Z-ro",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CaptainZ-Ro",
      "title": "Captain Z-ro",
      "description": "Captain Z-ro (starring and created by Roy Steffens) was a children's television space opera featuring the eponimous time traveller and his companion, Jet (Bruce Haynes), visiting many key figures from the past. Copyright Status: All episodes were registered as published films in 1955 and 1956. In order for the copyrights in these films to continue to operate, renewals needed to be lodged in the relevant calendar years 1983 and 1984. No such renewals were lodged and the episodes entered the public domain. Later registration attempts on a number of episodes were rejected and cancelled by the USCO. A registration for the printed unpublished screenplays was allowed, however the registration states that it applies only to the material in the screenplays which was not previously published in the films. As such, that registration does not limit the public domain status of these original films. These episodes are available to download on this page:- 01 (18/Dec/55) Christopher Columbus. Registered as a published film (LP11103). Not Renewed. 02 (25/Dec/55) Daniel Boone. Registered as a published film (LP11101). Not Renewed. 03 (01/Jan/56) Marco Polo. Registered as a published film (LP11106). Not Renewed. 04 (08/Jan/56) Benedict Arnold. Registered as a published film (LP11093). Not Renewed. 05 (15/Jan/56) King John. Registered as a published film (LP11094). Not Renewed. 06 (22/Jan/56) Magellan. Registered as a published film (LP11092). Not Renewed. 07 (29/Jan/56) Pony Express. Registered as a published film (LP11099). Not Renewed. 08 (05/Feb/56) William Tell. Registered as a published film (LP11102). Not Renewed. 09 (12/Feb/56) Roger, the Robot. Registered as a published film (LP11112). Not Renewed. 10 (19/Feb/56) Blackbeard the Pirate. Registered as a published film (LP11111). Not Renewed. 11 (26/Feb/56) Attila the Hun. Registered as a published film (LP11100). Not Renewed. 12 (04/Mar/56) Robin Hood. Registered as a published film (LP11117). Not Renewed. 13 (11/Mar/56) Washington and Howe. Registered as a published film (LP11107). Not Renewed. 15 (25/Mar/56) Hernando Cortez. Registered as a published film (LP11095). Not Renewed. 16 (01/Apr/56) Molly Pitcher. Registered as a published film (LP11116). Not Renewed. 17 (08/Apr/56) Discovery of Gold. Registered as a published film (LP11098). Not Renewed. 18 (15/Apr/56) Meteor. Registered as a published film (LP11110). Not Renewed. 20 (29/Apr/56) Aztec Papers. Registered as a published film (LP11104). Not Renewed. 21 (06/May/56) Genghis Khan. Registered as a published film (LP11097). Not Renewed. 22 (13/May/56) The Great Pyramid. Registered as a published film (LP11108). Not Renewed. 23 (20/May/56) Leonardo da Vinci. Registered as a published film (LP11109). Not Renewed. 24 (27/May/56) William the Conqueror. Registered as a published film (LP11115). Not Renewed. 25 (03/Jun/56) Adventure in Space. Registered as a published film (LP11096). Not Renewed. 26 (10/Jun/56) King Alfred. Registered as a published film (LP11113). Not Renewed. These episodes are currently missing and may be considered \"lost\":- 14 (18/Mar/56) The Rosetta Stone. Registered as a published film (LP11114). Not Renewed. 19 (22/Apr/56) Captain Cook and the Hawaiian Islands. Registered as a published film (LP11105). Not Renewed.",
      "id": "CaptainZ-Ro"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:14.041Z"
}