{
  "imdbId": "archive-raffle-the-la-riffa-1991-monica-bellucci-giulio-scarpati-massimo-ghini-elena-can",
  "title": "Raffle, The, La Riffa 1991 Monica Bellucci, Giulio Scarpati, Massimo Ghini, Elena Cantarone, Christina Engelhardt, Tiziana Pini, Vieri Rizzini + Francesco Laudadio",
  "year": 1991,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/raffle-the-la-riffa-1991-monica-bellucci-giulio-scarpati-massimo-ghini-elena-can",
      "title": "Raffle, The, La Riffa 1991 Monica Bellucci, Giulio Scarpati, Massimo Ghini, Elena Cantarone, Christina Engelhardt, Tiziana Pini, Vieri Rizzini + Francesco Laudadio",
      "description": "Francesca’s husband dies and leaves her deeply in debt. Her period of mourning is cut short by her lawyer informing her that her late husband left her no money but massive debts. Odd for this type of movie, Francesca faces reality immediately and sells off most of her assets in an attempt to pay the bills, she even takes a job for a short time. A bit of blackmail helps out some. The fur that she got from blackmailing an acquaintance is sold and the money used to pay rent for a year, pay for daycare for her daughter and buy a cheap car.  When she informs her maid of the problem, the maid decides to stick by her side as she likes the job. After selling everything and still not getting out of debt, she decides to hold a raffle with herself as the main prize. She will stay with the winner for four years at 100 million per year. We have plenty of clues that despite knowing nothing of her husband’s finances, Francesca is quite smart. She knows that people are trying to take advantage of her situation and so she orchestrates a police investigation into the raffle that ends with her walking away with nineteen 100 million lire checks. English subtitles included",
      "id": "raffle-the-la-riffa-1991-monica-bellucci-giulio-scarpati-massimo-ghini-elena-can"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:08:41.997Z"
}