{
  "imdbId": "archive-onborrowedtime1952",
  "title": "On Borrowed Time 1952 Restored",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/onborrowedtime1952",
      "id": "onborrowedtime1952",
      "title": "On Borrowed Time 1952 Restored",
      "description": "This was a live performance June 25, 1952 captured on a kinescope recording, and later transferred to tape.  It has been restored to bring it closer to what the original may have looked like on TV in 1952.  A much better restoration is possible with pro software if the kinescope film still exists.  It was presented on the Celanese Theatre, which featured adaptations of plays by well-known authors.  The commercials were of course for Celanese plastic and fiber made into products.  There were other TV, radio, and movie adaptations of this successful play.  The movie and TV adaptations took out Gramps’s profanity, but left in a few mild words.  The profanity was a major source of humor.  The expression “go where the Woodbine twineth” was a euphemism for death in a song about a soldier by Septimus Winner in the late 1800s.   Author: Paul Osborn Based on Novel by: Lawrence C. Watkin Producer/Director: Alex Segal   ---Cast--- Ralph Morgan - Gramps Melville Cooper – Mr. Brink Mildred Dunnock - Demetria Philip Coolidge - Pilbeam Billy Chapin - Pud Clay Clement – Dr. Evans Nell Harrison – Granny Humphrey Davis – Grimes Norma Connolly – Marcia Michael Demarrias – A Boy   Adaptation: Norman Lessing Editor: Mab Anderson Settings: Albert Heschong Costumes: Audré Music: Bernard Green Technical Director: George Weber Executive Producer: A. Burke Crotty   Both Ralph Morgan (1883-1956) and Clay Clement (1888-1956) had parallel careers.  Both were born in the late 1800s and performed on stage, screen, and TV.  Both were in silent pictures in the East.  Ralph was one of the founders of the Screen Actors Guild, while Clay was one of the first inductees.  Neither made it as a well known star, but Clay had star billing in a couple of films.  Clay had a supporting role in “The Thin Man”, and was in both the original Broadway production  and film of “Rosalie”.  Ralph was born in Venezuela, and educated in Germany.  Clay was born in an acting family with a celebrated father, also using the stage name Clay Clement.   Mildred Dunnock,s 1901-1991) career spanned the 20th century, starting in the 1930s.  She was nominated for a number of awards and was celebrated for her stage role in Death of a Salesman, She received two Academy Awards for her role in the film.  She started her film career in the 1940s.   Philip Coolidge (1908-1967) had a film career from 1948 to 1967.  His first film “Boomerang” also had Clay Clement.  He was in some well known films as “North by Northwest”.   Melville Cooper (1896-1973) was a British actor who had a good career in stage, film, and TV in the US.  He was in a number of popular films and TV shows.  He was in a supporting role in the Academy Award film “Around the World in Eighty Days”.   Billy Chapin (1943-2016) was born in Los Angeles and was pushed into film acting as a child.  His career in film and stage spanned 1944 to 1959.  Sadly he suffered from alcoholism and died penniless.  He was praised for his acting technique.   Nell Harrison (1898-1981) was known for her roles in “The Producers” and the TV series “Inner Sanctum”.  She started acting on Broadway in 1931 but her film/TV career seems to have spanned 1953-1967.   Humphrey Davis (1913-1967) was a character actor on stage (1939-1977), radio, and TV.(1950-1981).  He was known for his role in “Annie Hall”.   Norma Connolly (1927-1998) is best known for her roles in “The Young Marrieds”, and “General Hospital”.  Her career spanned 1951-1998, and she received an award as supporting actress in “General Hospital”.   Michael Demarrias does not seem to be well known, as there are no entries on the web.   The original live broadcast was 30 frames per second interlaced, 60 half frames per second.    This resulted in very smooth motion on the conventional TVs at that time.  The broadcast was filmed, as a kinescope, at 24fps from a special monitor.  As a result the interlaced half frames created at 60fps are smeared together with some information lost during the film movement.  Since the picture was scanned from top to bottom, fast motion causes vertical lines to tilt sideways and split in the progressive 24fps kinescope image.  It is now possible using some very sophisticated pro software to turn the 24fps kinescope into a 60fps video with few artifacts.  For this video, available free software such as Avisynth and Virtualdub converted the 24fps to a approximately 30fps (29.97) progressive video, but not as well as pro software.  This is smoother than the original kinescope, but still has some smearing, artifacts and judder especially during fast pans.  Inexpensive software, Deshaker helped stabilize the video while Neat removed many spots.  Despot removed some residual small spots.  Some cropping removed artifacts at the edges of the scenes.  Since scenes were composed to accommodate TV overscan, the cropping only made the result closer to what might have been viewed in 1952. The available software can not compensate for wiggle due to film shrinkage.  That requires pro software.  Frame by frame hand editing removed some artifacts and many residual spots.  Apparently one studio camera had some dirt which shows up as a stationary spot against a moving background in only some scenes.  The opening commercial was undoubtedly on film at 24fps which was telecined for broadcast at 30fps, so it went  through even one more level of encoding.  The commercials were possibly live.  The kinescope films were originally used to time delay the live broadcast, or to archive it for replay.  Kinescope replay was noticeably inferior at that time, but it is now possible to fairly closely recreate the original broadcast.",
      "fileSize": 2987735968,
      "addedAt": "2026-01-07T00:10:02.902Z",
      "thumbnail": "https://archive.org/services/img/onborrowedtime1952",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 21339
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.902Z"
}