{
  "imdbId": "archive-rebecca-1940-film-noir-thirller-hitchcock",
  "title": "Rebecca (1940 Film Noir, Thriller, Hitchcock)",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rebecca-1940-film-noir-thirller-hitchcock",
      "title": "Rebecca (1940 Film Noir, Thriller, Hitchcock)",
      "description": "TAGLINES : 01) A lonely man, a lovely girl... struggling against the secret of Manderley 02) The shadow of this woman darkened their love. 03) The shadow of a remembered woman came between their lips... but these two had the courage to hope... and to live their love! 04) Overwhelming Romantic Adventure THAT WILL STORM YOUR HEART! (Print Ad- Buffalo Courier-Express, -(Buffalo, NY)- 30 March 1940) 05) The MOST GLAMOROUS WOMAN of All Time! 06) THE MIGHTY NOVEL LEAPS TO TURBULENT LIFE ON THE SCREEN! (Print Ad- Syracuse Herald-American, -(Syracuse, NY)- 24 March 1940) PLOT : A self-conscious woman juggles adjusting to her new role as an aristocrat's wife and avoiding being intimidated by his first wife's spectral presence. _IMDb STORYLINES : 01) Story of a young woman who marries a fascinating widower only to find out that she must live in the shadow of his former wife, Rebecca, who died mysteriously several years earlier. The young wife must come to grips with the terrible secret of her handsome, cold husband, Max De Winter (Laurence Olivier). She must also deal with the jealous, obsessed Mrs. Danvers (Judith Anderson), the housekeeper, who will not accept her as the mistress of the house. _ CINÉMOI channel 02) A shy lady's companion, staying in Monte Carlo with her stuffy employer, meets the wealthy Maxim de Winter (Sir Laurence Olivier). She and Max fall in love, marry, and return to Manderley, his large country estate in Cornwall. Max is still troubled by the death of his first wife, Rebecca, in a boating accident the year before. The second Mrs. de Winter (Joan Fontaine) clashes with the housekeeper, Mrs. Danvers (Dame Judith Anderson), and discovers that Rebecca still has a strange hold on everyone at Manderley. _ IMDb by Col Needham TRIVIA : Top Rated Movies #229 | Won 2 Oscars. Another 5 wins & 10 nominations. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh ** *** (Merci '' CINEMO' ' channel. An .. '' edge of my seat' ' movie!!)***",
      "id": "rebecca-1940-film-noir-thirller-hitchcock"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:08:46.557Z"
}