{
  "imdbId": "archive-grandmas-reading-glass-1900-directed-by-george-albert-smith",
  "title": "Grandma’s Reading Glass ( 1900) Directed By George Albert Smith",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/grandmas-reading-glass-1900-directed-by-george-albert-smith",
      "title": "Grandma’s Reading Glass ( 1900) Directed By George Albert Smith",
      "description": "Grandma’s Reading Glass (1900) Director: George Albert Smith Grandma's Reading Glass is a 1900 British silent trick film, directed by George Albert Smith, featuring a young boy who borrows a huge magnifying glass to focus on various objects. The film was shot to demonstrate the new technique of close-up. According to Michael Brooke of BFI Screenonline, it \"was one of the first films to cut between medium shot and point-of-view close-up.\" It was destroyed in a fire at Warwick Trading Company's studio facility in 1912 and was long thought lost. The film was discovered in 1960 in the collection of Danish court photographer and film pioneer Peter Elfelt. \"The close-ups themselves were simulated by photographing the relevant objects inside a black circular mask fixed in front of the camera lens,\" according to Brooke, \"which also had the effect of creating a circular image that helped them stand out from the rest of the film... Smith would develop these techniques in the more narrative-based As Seen Through a Telescope (1900), made the same year.\" Brooke states that, \"There is very little narrative to speak of besides the boy looking around for further objects to examine... but at the time it was released, that would in itself have been sufficient novelty to maintain the audience's interest.\" Authorship dispute: Grandma's Reading Glass is one of several films which Dutch journalist Tjitte de Vries claims have been wrongly attributed. This claim is based on the identification of family and friends of film-pioneer Arthur Melbourne-Cooper in the film by his daughter Audrey Wadowska, who concludes that the film must therefore have been made by her father. According to the claim, the film was made by Melbourne-Cooper in his father's photographic studio in St Albans, the grandmother is played by his youngest sister Bertha, the close up of the eye is that of his mother Catherine, the young boy was played by his neighbour's son Bert Massey and the cat is one of the family's Manx kittens. The counterclaim by film historian Frank Gray is that the film was made by Smith at his studio in St. Anne's Well Gardens, Hove, the grandmother is played by his wife Laura Bayley, the close up of the eye is that of character actor Tom Green, the young boy was played by his son Harold and the cat is the family's tabby, which clearly has a tail. The claim by de Vries is further supported by the lack of any mention of payments to Tom Green at the time of production in Smith's cash book, while the counterclaim by Gray is supported by evidence showing that surviving prints were produced on the same step printer as the undisputed Let Me Dream Again. Campaigning by Wadowska resulted in the film being re-attributed to Melbourne-Cooper by New York's Museum of Modern Art Film Archive, but other archives, including the BFI National Film and Television Archive, have not done the same.",
      "fileSize": 4914611,
      "id": "grandmas-reading-glass-1900-directed-by-george-albert-smith"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.342Z"
}