{
  "imdbId": "archive-la-noche-de-los-lapices-1986",
  "title": "La Noche De Los Lapices (1986)",
  "year": 1986,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-noche-de-los-lapices-1986",
      "title": "La Noche De Los Lapices (1986)",
      "description": "La Noche de los Lápices  es una  película argentina   dramática - histórica  dirigida por  Héctor Olivera  y protagonizada por  Alejo García Pintos ,  Vita Escardó ,  Pablo Novak ,  Pepe Monje  y  Leonardo Sbaraglia . Escrita por Olivera y  Daniel Kon  y basada en el libro homónimo de  María Seoane  y  Héctor Ruiz Núñez , se estrenó el 4 de septiembre de 1986. La película recrea el  suceso real conocido por el mismo nombre : en septiembre de 1976, durante los primeros meses de la  última dictadura militar argentina ,  siete   adolescentes  de la ciudad de  La Plata  fueron  secuestrados ,  torturados  y  asesinados  por pedir un  boleto   estudiantil . La película recrea la historia desde el comienzo de las  protestas estudiantiles  de 1975 hasta 1980, cuando el único sobreviviente del grupo secuestrado fue liberado. La primera parte de la película relata la actividad de los adolescentes y la ominosa  razzia  en la que fueron secuestrados y encarcelados; la segunda narra las circunstancias de la prisión y tortura de los jóvenes, siguiendo paralelamente la situación de las familias de los cautivos y la de sus captores. [ 1 ] ​ La película se centra más en la experiencia física y psicológica de los personajes que en el contexto político y social imperante en la dictadura, desarrollando la historia de una manera que ésta se vea como universal y capaz de suceder en cualquier  régimen autoritario , concentrándose en la situación de los seres humanos bajo extrema presión. [ 2 ] ​ Fue seleccionada en la competición oficial del  Festival Internacional de Cine de Moscú  de 1987, y nominada para su máximo galardón, el premio San Jorge de Oro. [ 3 ] ​(Wikipedia) Argumento Corre el año 1975 en  Argentina , y a los  estudiantes  de diferentes colegios se les quita el boleto estudiantil —con el que obtenían un importante descuento en la tarifa del viaje en  colectivo — durante el gobierno de  Isabel Martínez de Perón . El mismo suponía un alivio esencial en sus economías, por lo que los estudiantes de la ciudad de  La Plata  deciden realizar una marcha de protesta en la que puedan participar miles de jóvenes acuciados por el mismo problema. Diferentes delegados de agrupaciones de estudiantes se congregan en uno de los colegios secundarios con el fin de organizarse y marchar hasta el edificio de Obras Públicas con el fin de presentar un petitorio para la adjudicación del Boleto Estudiantil Secundario (BES). Entre ellos, se encontraban alumnos del  Colegio Nacional ,  Bellas Artes  y de la Escuela Normal N.º 3, entre otros. La policía había previsto la protesta y estaba esperando para reprimirla. A la llegada de los estudiantes la policía ataca y hiere a muchos de los manifestantes. Seis de los jóvenes que acudieron a la marcha —María Clara Ciocchinii ( Adriana Salonia ),  Claudia Falcone  ( Vita Escardó ), Claudio de Acha ( Pablo Machado ), Daniel Racero ( Leonardo Sbaraglia ), Horacio Húngaro ( Pablo Novak ) y Francisco López Muntaner ( Pepe Monje ) — se encontraban en diferentes grupos de  militancia  política. Dedicaban varias de sus horas libres a enseñar a niños de barrios pobres de La Plata, a la recuperación de viviendas y a la lucha por el BES, entre otras cosas, lo cual los pone en la mira directa de la inminente  dictadura de Videla . Pocos meses después  del golpe de Estado en marzo de 1976 , en la madrugada del 16 de septiembre de ese año, entre las 0:30 y las 5:00 h, llega una \"comisión\" militar a cada una de las casas de los estudiantes que pertenecían al grupo político. Los secuestradores del  grupo de tareas  se presentan como policías de La Plata, y sacan violentamente de sus casas a los jóvenes, mientras maltratan y amenazan con armas a los padres de estos. Con el secuestro de los seis estudiantes se da inicio al hecho histórico conocido como la  Noche de los Lápices .  Pablo Díaz  ( Alejo García Pintos ), al enterarse lo que le había ocurrido a sus compañeros, se ausenta de su domicilio por unos días hasta que su padre le pide que regrese. La misma noche del regreso, el 21 de septiembre de 1976, es secuestrado en su domicilio por la dictadura con el mismo  modus operandi  que sus amigos y compañeros. Los jóvenes son amordazados y encerrados en un centro de detención clandestino conocido como \" Pozo de Arana \" junto a otros estudiantes que habían participado en las protestas del boleto estudiantil. Allí son torturados con  picanas  (pringues eléctricos) o se les arrancan las uñas para averiguar así más información sobre los grupos políticos a los que pertenecían y sobre el movimiento de protesta. A las jóvenes, dos de las cuales se encontraban embarazadas, son torturadas y manoseadas o  violadas  en reiteradas oportunidades. A los varones les sacan toda su ropa, y los obligan a quedarse en calzones todo su cautiverio. Los amigos luego son traspasados a cuartos pequeños e individuales, amordazados, y con los ojos vendados. Se les alimenta con agua y pan únicamente. Cuando Pablo Díaz llega al primer centro de detención, en el cual los represores buscan obtener información torturando a los cautivos, este se entera por otros detenidos que sus compañeros estuvieron en el mismo lugar que él, pero fueron trasladados. A los pocos días, Pablo es trasladado al centro de detención clandestino \" Pozo de Banfield \" lo colocan dentro de una pequeña celda, con los ojos cegados, las manos atadas y, al igual que a sus compañeros, lo desnudan y lo dejan en calzoncillos. Allí descubre que sus amigos y compañeros están en celdas aledañas a las de él y se comunican por medio de los techos, que están enrejados. De esta manera, tratan de sobrellevar el día a día del horror que les toca vivir, charlando o alzando sus voces para cantar los himnos de la época:  Rasguña las piedras  y  Canción para mi muerte , ambas de  Sui Generis . Mientras tanto, los familiares de los detenidos luchan en pos de encontrarlos, hablando con oficiales del Ejército y funcionarios del Estado. Casi todos los estudiantes secuestrados son asesinados y sus cadáveres hechos desaparecer. Pablo Díaz es liberado en 1980, luego de ser trasladado al  Poder Ejecutivo Nacional  (PEN). Esto significaba pasar a ser un detenido legal y no clandestino. Mientras Pablo es liberado sus compañeros se despiden a los gritos de él, y Pablo les pide que no pierdan la esperanza, asegurándoles que ellos también saldrán de su encierro. Un texto final señala que Díaz fue uno de los pocos sobrevivientes del  terrorismo de Estado  que ejerció la última dictadura militar, y gracias a su testimonio, brindado en el  Juicio de las Juntas  en 1985, y su participación en el guion de esta película, esta historia pudo ser contada. El resto de sus 6 compañeros secuestrados el 16 de septiembre de 1976 continúan desaparecidos. Reparto Actor Personaje Alejo García Pintos Pablo Díaz Vita Escardó María Claudia Falcone Pablo Novak Horacio Ángel Ungaro Adriana Salonia María Clara Ciocchini Pablo Machado Claudio de Acha Pepe Monje Panchito López Muntaner Leonardo Sbaraglia Daniel Alberto Racero Héctor Bidonde el Sr. Jorge Falcone Humberto Serrano supuesto capitán Tina Serrano la Sra. Nelva Falcone Lorenzo Quinteros Raúl Alfonso De Grazia el falso cura Manuel Callau Osvaldo, guerrillero del  ERP Francisco Cocuzza comisario Juan Manuel Tenuta rector del colegio 'La Legión' Andrea Bonelli Moni Ángela Ragno Sra. Olga de Ungaro Rubens Correa Doctor Rossi José Andrada guardia Ricardo Alanis montonero Isabel Quinteros Teresa Felisa Rocha profesora de inglés José María López secretario del obispo Alberto Busaid el Gordo, represor Luis Minces judío María Visconti profesora de Bellas Artes Miguel Habud represor 'Kung-Fu' Martín Coria el Negro Felipe Méndez médico Humberto Serrano capitán David Gerber estudiante Rusito Marcelo Serré estudiante Corchito Diego Korol estudiante Crivelli Walter Peña estudiante Carozo Shunk Mariana Cedrón estudiante Luisa Pisani Demián Celentano estudiante Diamanti Samuel San Joaquín estudiante Chirom Gustavo Tieffenberg estudiante María Celina Bedini estudiante Carlos Lazarini estudiante Cecilia Liebana estudiante Ana Celentano estudiante Gabriel Meyer estudiante Jorge Mastropiero estudiante Matías Ruiz estudiante de 1 año Matías Coleff estudiante de 1 año Esteban Student Jorge Falcone Maruja Pibernat la tía Rosa Mario Alberto Rolla Benito Díaz Alejandro Galluccio Daniel Díaz Juan Palomino policía uniformado 1 Carlos Weber Lobo Miguel Dedovich teniente coronel Ricardo Fasán oficial de comisaría Pablo Moretti funcionario en la TV Juan Carlos Gianuzzi capitán de regimiento Antonio Lorenzo policía de civil 2 Guillermo Sosa católico Pochi Ducasse Hedda de Díaz Guillermina Celay Marisa Díaz Héctor Ezcurra rector del Colegio Nacional Hebe Vardino profesora de colegio normal Enrique Riestra policía de civil 1 Fredy Magliaro policía de civil 2 Alejandra Sirlin muchacha secuestrada Octavio Gaspar muchacho secuestrado Néstor Jorge represor rubio Ricardo Ibarlín represor chófer María Nidia Ursi Eugenia Miguel Ángel Porro Cárdenas Rossana Bignasco periodista TV 2 Marcelo Demarchi periodista TV 1 Lucio Rubinacci locutor TV 1 Adolfo Vázquez Gamboa locutor TV 2 Daniel Kargieman cura de Arzobispado Fernando Gonzales alumno Mario Lombard extra Chicha Duffau extra Morena Villacorta extra",
      "fileSize": 1301715251,
      "id": "la-noche-de-los-lapices-1986"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}