{
  "imdbId": "archive-i-eat-your-skin-1964",
  "title": "I Eat Your Skin 1964 Horror Restored BluRay [1:21:20]",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/i-eat-your-skin-1964",
      "title": "I Eat Your Skin 1964 Horror Restored BluRay [1:21:20]",
      "description": "I Eat Your Skin is a 1971 film about a cancer researcher who discovers he can turn the natives of a Caribbean island into zombies by treating them with snake venom. His evil employer forces him to create an army of the creatures to take over the world. The film is about a playboy novelist who travels to Voodoo Island to research a new book and encounters a voodoo cult with plans to take over the world with an army of zombies.  The film has a 1960s vibe with a playboy hero and flirtatious dialogue. Some say the film has one significant gore scene and no skin eating. Others say the film is not great and that Cinemation's marketing department didn't include any footage from it in the trailers for the double feature.  I Eat Your Skin was originally shelved until 1971 when distributor Jerry Gross bought it and retitled it as part of the double feature I Drink Your Blood and I Eat Your Skin.  Credits: Directed by Del Tenney  Writing Credits Del Tenney   William Joyce as Tom Harris Heather Hewitt as Jeannie Biladeau Walter Coy as Charles Bentley Dan Stapleton as Duncan Fairchild Betty Hyatt Linton as Coral Fairchild Robert Stanton as Dr. Auguste Biladeau Vanoye Aikens as Robey Rebecca Oliver as Juarita Matt King (as Matthew King) George-Ann Williamson as Fontainebleau Wife Don Strawn as Calypso Bandleader (as Don Strawn's Calypso Band) Produced by Jesse Hartman associate producer Dan Stapleton associate producer Del Tenney producer Music by Lon E. Norman  Cinematography by François Farkas director of photography Editing by Lawrence C. Keating (as Larry Keating) Casting By Doris Bernhardt Art Direction by Robert Verberkmoes Makeup Department Guy Del Russo  makeup artist Production Management Mel Pape production manager Second Unit Director or Assistant Director William Grefé second unit director Sound Department Ed Wright sound (as Edmund Wright) Stunts Del Tenney stunts (uncredited) Camera and Electrical Department Leonard De Munde assistant camera (as Leonard DeMunde) Edmund Gibson camera operator (as Ed Gibson) Costume and Wardrobe Department Jane Hagerty costume supervisor Editorial Department Monte Schwartz assistant editor (as Monty Swartz) Music Department Lon E. Norman conductor Additional Crew  Jerry Gross presenter Frances Hidden production secretary Thanks  Bill Haast grateful acknowledgment (as William Haast) Diane Reese-Poodles grateful acknowledgment (as Mrs. Diane Reese-Poodles) Distributed by Cinemation Industries",
      "fileSize": 2229605456,
      "id": "i-eat-your-skin-1964"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.615Z"
}