{
  "imdbId": "archive-1992ZehnKleineStckeJoernHintzerMitFilmklasseAnl.SpektakelImAaltoTheaterEssen92mov",
  "title": "1992 Zehn Kleine Stücke (10 little Pieces)",
  "year": 1992,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1992ZehnKleineStckeJoernHintzerMitFilmklasseAnl.SpektakelImAaltoTheaterEssen92mov",
      "title": "1992 Zehn Kleine Stücke (10 little Pieces)",
      "description": "Community performance with guests. Drama on the stage of the Aalto Theatre in Essen / Germany with simultaneous film projections on the canvas in the foreground of the stage at the festival SPEKTAKEL 92 of the Art- and Musicschools in NRW / Germany. Stage and film director: Jörn Hintzer The success of this performance has helped that the Department of Arts educators Münster of the Kunstakademie Düsseldorf became an independent Art Academy. (Lutz Mommartz) The Art Academy Münster / Germany is a University of Fine Arts. In terms of liberal arts here artists and art educators are studying in joint classes in the fields of painting, sculpture, installation art, performance, photography, film and new media. Besides history, criticism, theory and didactics of art form the scientific priorities. The principle of the studio studying under the direction of each artist professor goes back to the artistic education at the classical art academies and is fundamentally different from rate regimes as they were introduced about in Anglo-Saxon countries. Founded in 1971 as the Institute of Art Educator as part of the Art Academy Dusseldorf, the Art Academy Münster in 1987 became independent. Since 2001, all areas of the Art Academy Münster are gathered together with a separate library in a new building, which was designed specifically for its purposes. Over the past 25 years, the Art Academy Münster developed to a place with an international reputation. The Filmklasse was founded by Lutz Mommartz and since then always had a special role inside the Art Academy Münster reflecting about new media, far more than only film.",
      "id": "1992ZehnKleineStckeJoernHintzerMitFilmklasseAnl.SpektakelImAaltoTheaterEssen92mov"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:06.564Z"
}