{
  "imdbId": "archive-LieutenantKizheEnhanced",
  "title": "Lieutenant Kizhe Restored then Enhanced",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LieutenantKizheEnhanced",
      "id": "LieutenantKizheEnhanced",
      "title": "Lieutenant Kizhe Restored then Enhanced",
      "description": "1934 directed by Aleksandr Faintsimmer starring Mikhail Yanshin, Boris Gorin-Goryainov, Nina Shaternikova, Sofiya Magarill, Erast Garin and Mikhail Rostovtsev.  A truly odd, Soviet-era comedy from a story by Yuri Tynyanov.  A lady of the palace and an attendant of the Czar meet for love during the Czar's royal nap and accidentally awake him with their love-play. An enraged Czar demands to know who the culprit is and the incident is blamed on one Lieutenant Kizhe, who only exists as an accidental entry in the Scribe's official log. The Czar orders this non-existant Lieutenant whipped then marched to Siberia. He then has him re-called and promoted all the way to General. Considered a satire on the Soviet bureaucracy. The music (what little there is) is by Serge Prokofiev. He used this music later for his Lieutenant Kizhe suite. I downloaded the \"Restored\" version created by J. Clement and did a little enhancing using Final Cut Pro which has Sound Track Pro incorporated into it.  For the video I added a sharpener which increases the definition then adjusted the lighting from scene to scene, primarily turning down the white light that was up too high throughout the film.  For the volume I did a slight noise reduction then added two effects to amplify the volume then went through the video a couple of times adjusting the volume so that the peaks wouldn't be too high.  I left on the excellent closing credits but slowed that portion of the video down so the credits scroll more slowly and can be more easily read.  Then I tapped on a closing credit for myself. The subtitle file already available works fine with this.",
      "fileSize": 2111151705,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LieutenantKizheEnhanced",
      "language": "rus",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 3287
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.750Z"
}