{
  "imdbId": "archive-bert-i-gordon-complete-collection",
  "title": "Filmography: Bert I. Gordon",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bert-i-gordon-complete-collection",
      "title": "Filmography: Bert I. Gordon",
      "description": "Bert Ira Gordon (September 24, 1922 — March 8, 2023) began making short films in 1935 after his aunt gifted him a camera for his thirteenth birthday. After serving in the Army Air Forces during WWII, Gordon married Flora Lang, and the duo produced TV commercials. Gordon went on to edit British feature-length films into half-hour timeslots, and was a production assistant on the long-running CBS crime drama Racket Squad . Following camera, editing and co-directing duties on Tom Gries' 1954 adventure horror Serpent Island , King Dinosaur was his first solo directorial outing. Two years later, he began an association with American International Pictures (AIP), whom he sued in 1960 for fraud regarding four collaborations. Gordon continued making features until 1990, with one final venture in 2015. By the late 1990s, Gordon's work on giant creature movies, which earned him the nickname 'Mr. B.I.G.' by sci-fi writer Forrest J. Ackerman, were well-known among the cult community thanks to the comedy series Mystery Science Theater 3000 , which featured eight of his films. In 2011, Gordon won the Life Career Award from the Academy of Science Fiction, Fantasy and Horror Films. Serpent Island (1954) A Scranton office secretary sets out to find her great-grandfather's hidden treasure. She enlists the aid of a former Marine Engineer turned harbor bum and a greedy sea captain. They find the gold on an island near Haiti, but it's guarded by a voodoo cult and a boa constrictor. King Dinosaur (1955) A quartet of American scientists travel to a planet that has just entered the solar system to see if it’s able to support an Earth colony. Beginning of the End (1957) A government researcher experimenting with radioactive materials to boost crop production accidentally creates a hungry army of giant grasshoppers, which the military must stop before they reach Chicago. The Cyclops (1957) A Mexico expedition finds and battles a mutated 25-foot man with one big eye. The Amazing Colossal Man (1957) Military officer Glenn Manning is accidentally exposed to the blast of an experimental plutonium bomb while trying to rescue a downed pilot, turning him into a giant who ultimately goes on a rampage. War of the Colossal Beast  (1958) Glenn Manning, now disfigured and deranged, is found ravaging bread trucks in Mexico. He is captured and brought back to the United States, where his worried sister tries to get him to remember his former life. Attack of the Puppet People (1958) A lonely, deranged dollmaker designs a machine that shrinks people. Earth vs. the Spider  (1958) A teenage girl, along with her boyfriend, their science teacher, and the local sheriff, discovers that her father has been eaten by a giant spider, which rampages through her small town. Tormented (1960) A jazz pianist lets a former flame fall to her death rather than let her interfere with his new relationship, but her ghost returns to disrupt his impending nuptials. The Boy and the Pirates (1960) A young boy is magically transported back in time to Blackbeard's ship on the high seas. Famous Ghost Stories (1961) An unsold anthology pilot hosted by Vincent Price, which turns out to be an edited version of Tormented . The Magic Sword (1962) A knight tries to save a princess from an evil sorcerer with the aid of his magical foster mother. Village of the Giants (1965) Child prodigy Genius accidentally creates an experimental chemical which turns anything that eats it into a giant. When a band of delinquent teens eat the chemical and become the capricious rulers of his small town, it's up to Genius' older sister and her boyfriend to stop them while Genius himself tries to recreate the chemical. Picture Mommy Dead  (1966) Released from an asylum where she's been confined after the shock of her glamorous socialite mother Jessica's fiery death, Susan continues to be plagued by her mother's memory. Her father has a gold-digging new wife, who's conspiring with her lover to trick the troubled girl into leading them to Jessica's missing diamond necklace. How to Succeed with Sex (1970) A man having trouble scoring with his girlfriend consults a book about sex and seduction for some pointers. NEC'RO•MAN'CY (1972) After Lori suffers a stillbirth, her husband Frank obtains a job with a northern California toy company. His new boss, the mysterious Mr. Cato, explains that Frank's position involves magic. Cato, who seemingly holds enormous influence over the town, pursues the power of necromancy and believes that Lori holds the key that will help him resurrect his own dead son. The Witching (1983) A re-edit of NEC'RO•MAN'CY, with brand new scenes (mostly to up the exploitation factor) filmed and added by Gordon himself. It also features a brand new score and other changes, so the whole thing differs greatly from the original theatrical cut. The Mad Bomber  (1972) Two Los Angeles detectives must track down a serial rapist who may know the identity of a mentally disturbed bomber. The Food of the Gods (1976) A group of friends travel to a remote Canadian island to hunt, only to be attacked by giant killer animals which have populated the place. Empire of the Ants (1977) A Florida real estate developer and her captain lure investors to an Everglades property under false pretenses that the swampland will soon be developed. Upon arrival, they find it has been overrun by giant mutated ants, brought on by the dumping of toxic waste. The Coming / Burned at the Stake  (1981) In 1692 Salem, Ann Putnam accuses those who have angered her of witchcraft; they are tried and put to death. In 1980, Loreen Graham is on a school outing to the Salem Witch Museum when a wax figure of a man from 1692 comes to life and accosts her. It seems that she may be the reincarnation of Ann, who had accused the man's 5-year-old daughter of witchcraft and the girl is scheduled to be burned at the stake. Loreen must fight against Ann's possession and confront the corrupt 17th century minister consorting with Ann to falsely accuse people of witchcraft. Let's Do It! (1982) Haunted by his mother’s overbearing presence, reluctant young virgin Freddie embarks on a hilarious journey of self-discovery in order to please his girlfriend Melody. With the help of his eccentric buddies and an assortment of others, Freddie hilariously navigates romance, confronting fears and finding love along the way. The Big Bet (1985) An older woman shows a high schooler how to woo a girl and win a bet with a bully. Satan's Princess (1989) A down-on-his-luck cop runs into harder times while searching for a missing woman. Secrets of a Psychopath (2015) Psychopathic siblings use dating sites to lure unsuspecting people to their home for sadistic games and inevitable slaughter.",
      "fileSize": 12640948590,
      "id": "bert-i-gordon-complete-collection"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.715Z"
}