{
  "movieId": "archive-de-oldify-stadsgezichten-van-stavoren-in-1924-in-kleur-beautiful-stavoren-in-192",
  "title": "Cityviews of beautiful Stavoren in 1924 in color! [Enhanced & colorized]",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-stadsgezichten-van-stavoren-in-1924-in-kleur-beautiful-stavoren-in-192",
      "id": "de-oldify-stadsgezichten-van-stavoren-in-1924-in-kleur-beautiful-stavoren-in-192",
      "title": "Cityviews of beautiful Stavoren in 1924 in color! [Enhanced & colorized]",
      "description": "Stavoren is a picturesq town on the shores of the old Zuiderzee. After the Zuiderzee was closed-off from the sea in 1932 it became the \"IJsselmeer\". Among other, the film shows the beautiful old town and the ferry that still runs between Stavoren and Enkhuizen (on the other side of the IJsselmeer). Also a unique rail ferry can be seen that moved goods trains back and forth across the Zuiderzee. Stavoren lies in the Dutch province of Friesland. It is the first town that obtained city-rights in the 11th centure by Count Egbert with permission from German emperor Hendrik V. It has only about 1000 inhabitants and is an old \"Hanzestad\" trading city. Also it is one of the 11 cities of the famous \"Elfstedentocht\". This is a world-famous skating event which can only be held during harsch winters to ensure an ice thickness of at least 15 cm on all the canals of the route. There is also a well know legend about the \"Vrouwtje of Stavoren\" about a rich silly woman who eventually became poor due to her strange behaviour. More about this legend can be found on Wikipedia. This film has been motion-stabilized, speed-corrected, enhanced and colorized with modern video software. Source B&W film: Beeld En Geluid.",
      "fileSize": 335645977,
      "addedAt": "2026-01-07T00:07:59.605Z",
      "thumbnail": "https://archive.org/services/img/de-oldify-stadsgezichten-van-stavoren-in-1924-in-kleur-beautiful-stavoren-in-192",
      "language": "eng",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 30
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.605Z"
}