{
  "imdbId": "archive-first-spaceship-on-venus-1960",
  "title": "First Spaceship On Venus 1960 ★★½ CC: Sci-Fi [1:18:10] U.S. Version",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/first-spaceship-on-venus-1960",
      "id": "first-spaceship-on-venus-1960",
      "title": "First Spaceship On Venus 1960 ★★½ CC: Sci-Fi [1:18:10] U.S. Version",
      "description": "In 1962 the shortened 79-minute dubbed release from Crown International Pictures substituted the title First Spaceship on Venus for the English-speaking market. The film was released theatrically in the U.S. as a double feature with the re-edited version of the 1958 Japanese Kaiju film Varan the Unbelievable. All references to the atomic bombing of Hiroshima were edited out. The American character Hawling became a Russian named Orloff. The Russian character Arsenjew became the American Herringway, while the Polish character Soltyk became the Frenchman Durand. The spacecraft used for the journey was referred to and spelled as Cosmostrator. First Spaceship On venus, is a 1960 East German/Polish color science fiction film based on the 1951 science fiction novel The Astronauts by Polish science fiction writer Stanisław Lem. It was directed by Kurt Maetzig, and stars Günther Simon, Julius Ongewe and Yoko Tani. The film was first released by Progress Film in East Germany, running 93 min. Variously dubbed and cut versions were also released in English under other titles: First Spaceship on Venus, Planet of the Dead, and Spaceship Venus Does Not Reply. Plot/Spoiler: In 1985, engineers involved in an industrial project to irrigate the Gobi Desert accidentally unearth a mysterious and apparently artificial \"spool\". When found to be made of a material unknown on Earth, the spool is circumstantially linked to the Tunguska explosion of 1908. The spool is seized on as evidence that the explosion, originally blamed on a meteor, was actually caused by an alien spaceship. Professor Harringway deduces the craft must have come from Venus. The spool itself is determined to be a flight recorder and is partially decoded by an international team of scientists led by Professor Sikarna and Dr. Tschen Yü. When radio greetings sent to Venus go unanswered, Harringway announces that a journey to Venus is the only alternative. The recently completed Soviet spaceship Kosmoskrator, intended to voyage to Mars, is now redirected to Venus, a 30-to-31-day journey. During the voyage, Sikarna works diligently to translate the alien message using the spaceship's computer. Sikarna's efforts lead to a stunning discovery: The spool describes a Venusian plan to irradiate the Earth's surface, with the extermination of mankind being the prelude to their invasion. Rather than containing a \"cosmic document\", as had been expected, the spool bears a cold-blooded message of destruction. With this new information the crew decides to transmit this information to Earth, believing that the information would be of service to mankind. Harringway, however, convinces the crew to press on towards Venus rather than return to Earth with revelations that could panic mankind, leading to unknown consequences. With the ship's robot, Omega, German astronaut Brinkman pilots a one-man landing craft through the Venusian atmosphere. On the surface, he comes upon an industrial complex and finds small information storage devices that look like insects. Brinkmann's landing craft is destroyed in an explosion when it accidentally lands on high-tension power lines. The rest of the crew lands Kosmoskrator to investigate the explosion. The crew splits up, some staying near Kosmoskrator to study the storage devices. The others follow the power line to try and find the Venusians, but they find no life forms. Instead, they discover a large golf ball-like structure that Arsenjew suggests may be a giant transformer or a force-field generator. Following the power lines in the other direction, they find the remains of a deserted and blasted city centered around a huge crater. There are clear signs of a catastrophic explosion so intense that the shadowy forms of the humanoid Venusians are permanently burned onto the walls of the surviving structures. The Venusians are gone, but their machines remain functioning, including the radiation-bombardment machine intended for use against the Earth. One of the scientists accidentally triggers the weapon, leading to a frantic effort by the team to disarm it. Tschen Yü lowers Talua, the ship's communication officer, into the Venusian command center. When Tschen Yü's spacesuit is punctured, Brinkmann ventures out to save him. Before he can reach Yü, Talua succeeds in reversing the weapon. Unfortunately, this also reverses Venus' gravitational field, flinging Kosmoskrator out into space. Brinkmann is also repelled off-planet, beyond the reach of the spaceship to save him, while Talua and Tschen Yü remain marooned on the devastated Venus. The surviving crew members must return to Earth, where they warn humanity about the dangers of atomic weapons.",
      "fileSize": 1579659907,
      "addedAt": "2026-01-07T00:08:24.395Z",
      "thumbnail": "https://archive.org/services/img/first-spaceship-on-venus-1960",
      "language": "eng",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 649
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.395Z"
}