{
  "imdbId": "archive-moonlight-moovies-9-loused-up-in-space_202009",
  "title": "MOONLIGHT MOOVIES # 9 LOUSED UP IN SPACE",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/moonlight-moovies-9-loused-up-in-space_202009",
      "title": "MOONLIGHT MOOVIES # 9 LOUSED UP IN SPACE",
      "description": "\"Moonlight Moovies\" are complete virtual drive-in presentations. This edition's theme is “Loused Up in Space.” He’s not actually Calvin, but the little star of  “Comics Trip” certainly has some Spaceman Spiff-like adventures on his way to a birthday party. Strap in for the thrills and excitement of the classic parody \"Hardware Wars.\" Complete with flashlight-sabers, flying irons and electric-drill rayguns. Our first feature, “Star Wreck: In the Pirkinning,” is one of a series of Finnish “Star Trek” parodies. Basically, the future looks bleak for Captain Pirk. Originally from the far future, he traveled back in time to save the world, but was shipwrecked in the 21st century. The world of the past is a dangerous place, and he has trouble convincing the ladies that he is, in fact, an intergalactic space hero from the future. To make things right, Pirk comes up with a questionable plan to save mankind's future. (Finnish-language with English subtitles) During intermission, feel free to stock up on Tang and Space Food Sticks at the virtual snack bar. (Eat and drink all you want -- you're weightless in space, remember?) Feature #2 is a low-budget obscurity, “The Phantom Planet.” After an invisible asteroid draws an astronaut and his ship to its surface, he is miniaturized by the phantom planet's exotic atmosphere.  “See!! A 6 ft. astronaut shrink to 6 inches before your very eyes! See!! The Moon Maidens! See!! The attack of the Fire People! Starring DOLORES FAITH the Girl from Outer Space!” Management reminds you to replace the speaker properly, exit the parking area at less than escape velocity, and have a soft landing at your home base. **THIS VERSION'S AUDIO IS IN SYNC.**",
      "id": "moonlight-moovies-9-loused-up-in-space_202009"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:54.330Z"
}