{
  "imdbId": "archive-2018InternationalEmmyBestPerformancebyanActorWinnerLarsMikkelseninHerrensVeje",
  "title": "2018 International Emmy Best Performancebyan Actor Winner Lars Mikkelsenin Herrens Veje",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/2018InternationalEmmyBestPerformancebyanActorWinnerLarsMikkelseninHerrensVeje",
      "title": "2018 International Emmy Best Performancebyan Actor Winner Lars Mikkelsenin Herrens Veje",
      "description": "2018 International Emmy Best Performancebyan Actor Winner Lars Mikkelsenin Herrens Veje Lars Mikkelsen wins international Emmy award Acting gong is Denmark’s first   November 20th, 2018 8:33 am| by Ben Hamilton Facebooktwittergoogle_pluspinterestmail  Lars Mikkelsen last night became the first ever Danish actor to win an international Emmy, picking up the gong at a lavish ceremony in New York. The 54-year-old won the award for best male actor in an international drama series for his role as priest Johannes Krogh in the DR drama ‘Herrens Veje’ (‘Ride upon the Storm’). Well done President Petrov (photo: Camilla Hammerich,/DR) Given his international clout – most notably for being the brother of Mads and playing the Russian president in ‘House of Cards’ – it was no surprise he triumphed against a field that included no other household names. Frontrunners in drama “It’s completely surreal; there were so many strong performances from the other nominees,” Mikkelsen graciously told DR. “In Denmark, for many years we have been frontrunners in drama, and this prize underlines that one can still count on us. I’m so happy and honoured.” Danish productions have won international Emmys before – including five best international drama series – but never an acting award before.",
      "fileSize": 17353628,
      "id": "2018InternationalEmmyBestPerformancebyanActorWinnerLarsMikkelseninHerrensVeje"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.565Z"
}