{
  "imdbId": "archive-let-it-be-me-1995-5-star-drama-rom-musical",
  "title": "Let It Be Me (1995 5 Star DramaRomMusical)",
  "year": 1995,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/let-it-be-me-1995-5-star-drama-rom-musical",
      "id": "let-it-be-me-1995-5-star-drama-rom-musical",
      "title": "Let It Be Me (1995 5 Star DramaRomMusical)",
      "description": "PLOT : After becoming engaged to Emily, Gabe finds himself watching a graceful pair of dancers in a dance studio window. Hoping to learn to dance for his upcoming wedding, Gabe enters the studio to take lessons. While interested in his dance teacher, he finds that he is still looking forward to his wedding, but things change when he has Emily come in for her lessons ._ IMDb by:Tony Fontana IMDb User Review : A sweet film (waldorfsalad Mar 09 2000): If you like dancing, you'll like this film in general but you might find it a little boring in places. Patrick Stewart is charming and he has a really good chemistry with Leslie Caron. It's really nice to see Jennifer Beals again, she's a fine actress and one of the great beauties of Hollywood, though she doesn't flaunt it like so many others. I saw on the credits that Elliott Gould (a great dancer) was in this film, but for the life of me, I could not find him in this movie. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed watching and have, therefore, uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. I do receive a huge amount of joy in sharing with you, these many 100s of free-to-you items I have uploaded, however, I have no wish to infringe on any existing copyright laws. DEF.gp ddh **",
      "fileSize": 279427228,
      "addedAt": "2026-01-07T00:09:38.889Z",
      "thumbnail": "https://archive.org/services/img/let-it-be-me-1995-5-star-drama-rom-musical",
      "language": "eng",
      "year": 1995,
      "collection": "feature_films",
      "downloads": 579
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.889Z"
}