{
  "imdbId": "archive-profiles-in-courage-colorized",
  "title": "Profiles in Courage - Governor John M. Slaton - Leo Frank Case - Colorized 2021",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/profiles-in-courage-colorized",
      "id": "profiles-in-courage-colorized",
      "title": "Profiles in Courage - Governor John M. Slaton - Leo Frank Case - Colorized 2021",
      "description": "Hollywood's JFK Profiles in Courage (1964) is about Georgia's very corrupt 60th Governor John M. Slaton (1913-1915) and his relation to the rape-murder trial of Leo Frank. This crooked politician is rehabilitated in this odious drama, while the White Gentile Southerners are smeared as a hideous mob of torch wielding yahoos. Leo Frank was calmly hanged August 17th, 1915 at a former Sheriff's farming estate, William Frey. Leo Frank the toilet strangler was a Jewish supremacist and habitual pedophile born at Cuero Texas in 1884 and he ran a pencil producing sweatshop in Atlanta Georgia from 1908 to 1913. He was arrested, indicted by a Coroner's jury, Indicted and convicted for the molestation-murder of one of his child laborites Mary Phagan. 20 factory girl's at his Mary Phagan murder trial, testified about his pedophilic character for lasciviousness, saying it was bad. The drama is an anti-Gentile Hollywood film written and produced by the Jewish Supremacists in the media of the 1960s who falsify the facts and evidence of the Leo Frank case to smear the Southerners who convicted the homicidal Jewish serial pedophile Leo Frank for the rape and murder of 13-year-old Mary Phagan. This 1964 Profiles in Courage agitprop, is a Hollywood drama that rehabilitates the corrupt 60th governor of Georgia, John Slaton, who commuted the death sentence of his law firm's criminal defense client Leo Frank to life in prison over his 1913 conviction for the rape-murder of 13-year old Mary Phagan.",
      "fileSize": 1225316801,
      "addedAt": "2026-01-07T00:10:21.539Z",
      "thumbnail": "https://archive.org/services/img/profiles-in-courage-colorized",
      "collection": "feature_films",
      "downloads": 44
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.539Z"
}