{
  "imdbId": "archive-the-man-with-the-rubber-head-1901-directed-by-georges-melies",
  "title": "The Man With The Rubber Head ( 1901) Directed By Georges Méliès",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-man-with-the-rubber-head-1901-directed-by-georges-melies",
      "title": "The Man With The Rubber Head ( 1901) Directed By Georges Méliès",
      "description": "The Man with the Rubber Head (1901) 'L'Homme à la tête en caoutchouc' Director: Georges Méliès he Man with the Rubber Head (French: L'Homme à la tête en caoutchouc), also known as A Swelled Head, is a 1901 French silent trick film by Georges Méliès. The film stars Méliès himself as an apothecary who blows a copy of his own head up to enormous dimensions, but who is unable to get his assistant to perform the stunt as expertly. The special effect of the inflated head, made with a novel combination of purpose-built moving equipment and multiple exposures, evokes the modern close-up and enjoys an iconic place among Méliès's works. Production: Méliès appears in the film as both the apothecary and his duplicate head. To create the illusion of the expanding head, Méliès first filmed the surrounding action on the laboratory set. Then he surrounded his head with a black background and used a specially built ramp to move himself, sitting in a pulley-controlled chair, gradually closer to the stationary camera. Using distance calculations made in advance, an assistant refocused the camera lens in real time as the head moved, so that Méliès's face would remain in focus throughout. Méliès chose to move himself toward the camera, rather than the other way around (as in the technique later named the tracking shot), to ensure that his head would appear to be sitting on the tabletop and would stay aligned with it throughout the growing process. Méliès's camera recorded the expanding head directly onto the same piece of film negative on which the laboratory action was shot, creating a multiple exposure in which the head was superimposed on the blank area of the set. The movement of the chair back and forth on the ramp was carefully timed to match the pre-recorded action. The other special effects used in the film are substitution splices and pyrotechnics.",
      "fileSize": 16302801,
      "id": "the-man-with-the-rubber-head-1901-directed-by-georges-melies"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}