{
  "imdbId": "archive-darkman-trilogy-1990",
  "title": "Darkman Trilogy 1990",
  "year": 1990,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/darkman-trilogy-1990",
      "title": "Darkman Trilogy",
      "description": "Darkman  is a 1990 American  superhero   horror film  directed and co-written by  Sam Raimi . The film stars  Liam Neeson  as scientist  Peyton Westlake , who is brutally attacked, disfigured, and left for dead by ruthless mobster Robert Durant ( Larry Drake ), after his girlfriend, attorney Julie Hastings ( Frances McDormand ), runs afoul of corrupt developer Louis Strack Jr. ( Colin Friels ). An experimental treatment gives Westlake super-human strength and resilience, with the unintended side-effect of rendering him mentally unstable and borderline psychotic. Consumed with vengeance, Westlake continues his research with the new goal of hunting down those who disfigured him. Based on a  short story  Raimi wrote that paid  homage  to  Universal 's  horror films of the 1930s , and influenced by his desire to adapt  The Shadow , Raimi struck a deal with Universal Studios to make his first  Hollywood  studio film. It was produced by  Robert Tapert , and was written by Raimi, his brother  Ivan ,  Chuck Pfarrer , and brothers Daniel and Joshua Goldin. Makeup effects artist  Tony Gardner  designed and created the elaborate makeup effects required to turn Neeson into Darkman. Neeson's first action film in the main role,  Darkman  received generally positive reviews by critics and was commercially successful, grossing $48 million, above its $14 million budget. This financial success spawned two direct-to-video  sequels  (sans Neeson or Raimi) –  The Return of Durant  and  Die Darkman Die  – as well as adaptations including novels, comic books, and video games. Darkman 1990 Dr. Peyton Westlake  is a  scientist  developing a prototype for a new \"synthetic skin\" to help burn victims, but cannot overcome a flaw that causes the skin to disintegrate after 99 minutes. His girlfriend Julie Hastings discovers an incriminating document called the  \"Belisarius Memorandum\"  which proves her boss,  real estate developer  Louis Strack Jr., has been bribing members of the zoning commission. When she confronts Strack, he confesses to the bribery because it aided in his plans for designing a new city and creating countless jobs. He also warns her that the document could potentially be sought after by  high-ranking criminals  for its value. Following a breakthrough, Westlake realizes that the synthetic skin is  photosensitive , and that light causes the material to break down. However, vicious crime-boss Robert G. Durant and his armed thugs suddenly invade Westlake's lab searching for the  \"Belisarius Memorandum\" , which Julie had left behind. Westlake is brutally tortured, while his lab-assistant Yakitito is murdered. Durant rigs the lab to explode and escapes with the document; Westlake is horrifyingly disfigured by the blast and thrown from the building. As a  John Doe , Westlake is brought to a hospital and subjected to an experimental  nerve  procedure to eliminate the physical pain from his burns. However, as a side effect of the procedure, his emotions are amplified, also triggering an  adrenal  overload that gives him  enhanced strength . Westlake awakens from a coma, escapes from the hospital and discovers his plight. Realizing Julie believes he's dead, he re-establishes his lab in an abandoned building, hoping to perfect his synthetic skin to fix his scarred face and body. Overcome with anger at his circumstances, Westlake decides to seek revenge against Durant and his thugs. Westlake finds and tortures Durant's associate Rick for information before murdering him. Westlake begins using his synthetic skin to create masks of Durant's associates, while also developing a talent for  impressionism . He is successfully able to pose as the various criminals, creating distrust amongst one-another that eventually leads them to killing one of their own, Pauley. Westlake is eventually able to recreate his own face as a mask and goes to Julie. He convinces her that he was in a coma, and keeps his disfigurement from her, making up excuses to leave before the synthetic skin breaks down. However, during a date at a carnival with Julie, Westlake loses his temper and assaults a worker before fleeing. Julie follows him to the abandoned building and realizes that his face was only a mask. After tearfully confessing that she still loves him, she leaves. While later talking to Strack, Julie reveals to him that Westlake is still alive. She then discovers the  \"Belisarius Memorandum\"  on his desk and realizes he was in-league with Durant the entire time. When Julie leaves, Strack tells Durant to deal with both her and Westlake. Durant kidnaps Julie and has his remaining cohorts storm Westlake's new laboratory. Westlake manages to take them out, blowing up his own lab to murder the final thug. Durant flees in a helicopter with Westlake dangling from an attached cable. Westlake manages to attach the cable to a  semi-trailer , which pulls the helicopter into an explosive collision,  seemingly killing Durant. Impersonating Durant, Westlake meets up with Strack and a captive Julie at the top of an unfinished building. Strack sees through Westlake's ruse and pulls his mask off, revealing his disfigured face to Julie. A brawl breaks out, and though injured during the fight, Westlake gains the upper hand and drops Strack to his death. Julie tries to convince Westlake that he can still return to his old life, but he refuses, having been changed by his quest for revenge and new vicious nature. He slips away from Julie, pulling on a mask and running into a crowd of pedestrians. As Julie searches for him, a disguised Westlake watches her for a moment before walking away. In his mind, he declares himself to be \"Darkman\". Darkman II - The Return of Durant Darkman II: The Return of Durant  is a 1995 Canadian-American  superhero film  directed by Bradford May. It is a  direct-to-video   sequel  to the film  Darkman , with series creator  Sam Raimi  serving as  executive producer .  Arnold Vosloo  succeeds  Liam Neeson  as the titular character, who attempts to recover an experimental  superweapon  from his nemesis Robert G. Durant, once again played by  Larry Drake . It was followed by the third installment in the trilogy,  Darkman III: Die Darkman Die . Sometime after  taking down crime-boss Robert G. Durant and his associates , brutally-scarred scientist Peyton Westlake continues to work on perfecting his synthetic skin formula, funding his research by stealing from criminals as the  vigilante   \"Darkman\".  His synthetic skin is still limited by  photosensitivity , only able to last 99 minutes in light before breaking down. Durant,  left in a coma  by his previous encounter with Westlake, suddenly awakens. He quickly assembles some of his former associates and has them break a brilliant criminal named Dr. Alfred Hathaway out of  prison . Hathaway had previously begun designing highly-experimental  particle-beam weaponry ; Durant wants him to complete the design so they can sell the futuristic weapons on the black market. Westlake, wearing a disguise and using a false name, meets and befriends a scientist named David Brinkman, who is also working on a similar synthetic skin formula. Brinkman has been able to break past the 99-minute photosensitivity barrier of Westlake's synthetic skin, though his formula similarly is not permanent. Westlake suggests the two form a partnership to finally crack the code to creating permanent skin; Brinkman happily agrees. Westlake also briefly meets Brinkman's sister Laurie, who is on shaky terms with her brother. Durant realizes that Brinkman's lab is one of the only buildings in the city that has the power requirements needed for his plans. After Brinkman firmly refuses his offers to buy the building, Durant has his men torture and murder Brinkman in retaliation. Westlake discovers Brinkman's body and notices that one of his fingers has been cut off, matching Durant's  calling card  of collecting a finger from his victims. Realizing that his old nemesis is still alive, Westlake vows revenge. Hathaway completes his particle-beam weapons, which hold devastating power and are able to blow up small buildings with a single blast. Durant lines up his first buyers, a group of  white supremacists. After seeing a news story on Durant, Westlake meets with hot-shot  television reporter  Jill Randall to get more information from her. She runs his fingerprints after becoming suspicious with his secret behavior. She tracks him down and deduces his true identity. She reveals that she is investigating Durant's possible return, and Westlake begins to begrudgingly work alongside and befriend her. However, when Randall runs a last-minute news-report on Durant's return, he has her killed with a  car bomb , further infuriating Westlake. Westlake learns that Durant is again seeking to purchase Brinkman's building, this time from the grieving Laurie. He sets out to protect her, but is unable to stop Durant from kidnapping her after she refuses to sell. Westlake uses his synthetic skin to disguise himself as Durant's thugs and infiltrate their base of operations. In an ensuing battle, Durant's men, Dr. Hathaway, and the white supremacists are all killed. Westlake saves Laurie while Durant attempts to flee in his car. However, Durant doesn't realize until it's too late that Westlake has taken a page from his own book and rigged his car with a bomb; he is finally killed once and for all in the blast. Westlake bids Laurie farewell, and later sees a news report on Randall's death. Tipping his hat to the memory of his friends, Westlake vows to continue his lone fight against crime and injustice. Darkman III - Die Darkman Die Darkman III: Die Darkman Die  is a 1996 Canadian-American  superhero film  directed by Bradford May, starring  Arnold Vosloo ,  Jeff Fahey ,  Darlanne Fluegel  and  Roxann Dawson . It is the second sequel to 1990's  Darkman , whose director  Sam Raimi  serves as  executive producer . [ 1 ]  Vosloo once again stars as Darkman, who stands against power-hungry entrepreneur Peter Rooker (Fahey), and forges a strange emotional bond with his enemy's neglected wife and daughter. Scientist  Peyton Westlake is still searching for the key to creating a permanent liquid-skin formula to mend his burned face and body, and continues to operate as the  vigilante   \"Darkman.\"  He interrupts a criminal exchange spearheaded by power-hungry businessman and  crime boss  Peter Rooker, who becomes fascinated by Westlake's  superhuman strength and agility . Westlake is later approached by Dr. Bridget Thorne, one of the physicians who saved his life after  the brutal attack that scarred him years earlier . She offers to help him complete his liquid-skin formula, while also theorizing she can surgically repair his nervous system, restoring some of the  sensory loss  he has experienced since the attack. They travel to a laboratory Thorne has set up in an abandoned  industrial complex , where she completes the surgery, seemingly restoring Westlake's ability to perceive sensation. Using her cutting-edge equipment, Westlake manages to create a small amount of permanent liquid skin, which does not  break down in sunlight  as his other samples have. However, Rooker suddenly arrives and reveals that Thorne is his  mistress . Rooker explains that he desires the enhanced strength that Westlake has at his disposal. The two plan to use Westlake as a guinea pig to try and replicate the perpetual  adrenal overload  that gives him his power. Thorn also reveals that she implanted an  electrical shock-device  into the back of his neck to control him. They steal Westlake's skin sample and a  computer disk  containing his research, and put him through a series of strenuous physical tests. Westlake later finds a pair of  pliers  and manages to rip the shock-device from his neck before escaping. Westlake, trying to learn more about Rooker, encounters his neglected wife Angela and their young daughter, Jenny. At first concerned, he eventually develops feelings for the two upon realizing how lonely and empty his life is. He uses his liquid skin to assume Rooker's identity and pours his energy into being a loving father and husband, including seeing Jenny perform in her school's production of  Beauty and the Beast . Rooker uses the data from Westlake's tests to create a  super-strength formula . He gives it to his men, and orders them to assassinate an idealistic  district attorney  at a public gathering. Westlake arrives in the nick of time and is able to stop the assassination attempt. Rooker next learns that Westlake had stolen his identity to spend time with his family. He murders Thorne and  psychopathically declares  his intention to be a better husband and father to a horrified Angela. Rooker takes his family back to Thorne's lab, holding them hostage. Westlake follows them. Upon arrival, he learns that Rooker has injected himself with the last of the super-strength formula, which has not only increased his physical strength, but also seemingly amplified his insanity. The two engage in a brutal brawl throughout the building. Westlake manages to reclaim the sample of permanent liquid skin during the fight, but his research disk is destroyed. He finally gets the upper hand and is able to trick Rooker into falling into an  industrial shredding machine , killing him. A gas-line in the building catches fire, causing a massive explosion; Westlake is able to save Angela and Jenny, but Jenny's face is terribly burned. Westlake decides to use the liquid skin to repair Jenny's face rather than his own. After Angela thanks Westlake for saving her daughter, he leaves them, vowing to continue his work on the formula while fighting crime and injustice.",
      "id": "darkman-trilogy-1990"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:31.468Z"
}