{
  "imdbId": "archive-vampyr-1932-colorized-movie-720p-hd",
  "title": "Vampyr (restored, colorized) (1932, horror, fantasy, imdb score: 7.5)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/vampyr-1932-colorized-movie-720p-hd",
      "id": "vampyr-1932-colorized-movie-720p-hd",
      "title": "Vampyr (restored, colorized) (1932, horror, fantasy, imdb score: 7.5)",
      "description": "Vampyr ( German : Vampyr – Der Traum des Allan Gray , lit.   'Vampyr: The Dream of Allan Gray') is a 1932 gothic horror film directed by Danish director Carl Theodor Dreyer . The film was written by Dreyer and Christen Jul based on elements from J. Sheridan Le Fanu 's 1872 collection of supernatural stories In a Glass Darkly . Vampyr was funded by Nicolas de Gunzburg who starred in the film under the name of Julian West among a mostly non-professional cast. Gunzburg plays the role of Allan Gray, a student of the occult who enters the village of Courtempierre, which is under the curse of a vampire . Vampyr was challenging for Dreyer to make as it was his first sound film and was required to be recorded in three languages. To overcome this, very little dialogue was used in the film and much of the story is told with title cards like a silent film . The film was shot entirely on location and to enhance the atmospheric content, Dreyer opted for a washed out, soft focus photographic technique. The soundtrack was created in Berlin where the characters’ voices, sound effects, and score were recorded. Vampyr had a delayed release in Germany and opened to a generally negative reception from audiences and critics. Dreyer edited the film after its German premiere and it opened to more mixed opinions at its French debut. The film was long considered a low point in Dreyer's career, but modern critical reception to the film has become much more favorable with critics praising the film's disorienting visual effects and atmosphere.",
      "fileSize": 1032672587,
      "addedAt": "2026-01-07T00:12:55.133Z",
      "thumbnail": "https://archive.org/services/img/vampyr-1932-colorized-movie-720p-hd",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 584
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.133Z"
}