{
  "imdbId": "archive-johnny-cool-1963",
  "title": "Johnny Cool 1963 ★★★ (HD) Crime/Neo-Noir: CC [1:41:29]",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/johnny-cool-1963",
      "title": "Johnny Cool",
      "description": "Johnny Cool is a 1963 American neo-noir crime film, directed by William Asher and based on the novel The Kingdom of Johnny Cool by John McPartland, which stars Henry Silva and Elizabeth Montgomery Produced in part by Peter Lawford. Johnny Cool features a cast that also includes Mort Sahl, Telly Savalas, Jim Backus, Joey Bishop, and Sammy Davis Jr., who also sings the theme song. Johnny Colini, an exiled American living in Rome, rescues Salvatore Giordano, a young Sicilian outlaw, from the police. After Giordano is groomed, polished, and renamed \"Johnny Cool\", Colini sends him on a mission of vengeance to the United States to assassinate the men who plotted his downfall and enforced exile. Johnny arrives in New York and quickly kills several of the underworld figures on Colini's list. Meanwhile, he picks up Dare Guinness {Elizabeth Montgomery}, a wealthy divorcée who becomes his accomplice, and she is severely beaten by the gangsters as a warning against the vendetta. The film score was composed, arranged and conducted by Billy May, and the soundtrack album was released on the United Artists label in 1963. Soundtracks: All compositions by Billy May except as indicated \"The Lizard\" – 2:38 \"Window Washer\" – 2:37 \"Dare's Affair\" – 2:40 \"Borrow a Knife\" – 1:47 \"Johnny Cool Theme\" – 2:19 \"Morning in Balboa\" – 2:14 \"Nice Quiet Saloon\" – 2:35 \"Green Tables Blues\" – 3:16 \"The Coolest Pad\" – 3:18 \"Juan Coolisto\" – 2:19 \"Bee Bom\" (Les Vandyke) – 2:14 \"The Ballad of Johnny Cool\" (Jimmy Van Heusen, Sammy Cahn) – 2:58",
      "id": "johnny-cool-1963"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:06:48.116Z"
}