{
  "movieId": "archive-occultForces1943--NationalSocialistAnti-freemasonryFilm",
  "title": "\"Occult Forces\" (1943) -- National Socialist Anti-Freemasonry Film",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/occultForces1943--NationalSocialistAnti-freemasonryFilm",
      "id": "occultForces1943--NationalSocialistAnti-freemasonryFilm",
      "title": "\"Occult Forces\" (1943) -- National Socialist Anti-Freemasonry Film",
      "description": "One of the most unique and uniquely odd film I have seen. Considering when and where it was made, the production values are almost unbelievably high. It seems to have been made in occupied France, with the clear intent to blame the Freemasons as dupes and/or masterminds in engineering the outbreak of war. While proving the premise seems like it would be an uphill battle, the film demonstrates great care in citing historical events within France to back this up. Citing Freemason infiltration into the German government as well (i.e., Nazi establishment), for a supposedly \"National Socialist\" (read NAZI) film, it does a really good job of making the German Freemason agitator look like a bad guy! A last minute attempt by the Nazi collaborators to shuffle blame to the Freemasons for the war not going so well? I wonder... Prescott Bush (yes the ancestor of the American presidents) did funnel cash to the Nazis to get them started... member of Skull and Bones, subsidiary of Freemasons. Obviously there is a real-life tie in here somewhere! So one cannot dismiss the film's premise out of hand. Students of freemasonry and NWO detectives will find here the most lavish and detailed expositions of secretive Masonic ritual I have ever seen. Others more knowledgeable than I say it is stunningly accurate. This alone made it worth watching. For more info on current relevance of the movie, may I suggest; Endgame: Blueprint for Global Enslavement The EndgamE Movie - Companion Free Library v1 Click Invisible Empire - A New World Order Defined",
      "fileSize": 667460054,
      "addedAt": "2026-01-07T00:10:02.900Z",
      "thumbnail": "https://archive.org/services/img/occultForces1943--NationalSocialistAnti-freemasonryFilm",
      "collection": "feature_films",
      "downloads": 57294
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.900Z"
}