{
  "imdbId": "archive-last-woman-on-earth-1960-time-travel-drama-mys",
  "title": "Last Woman On Earth (1960 Time Travel, Drama, Mys)",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/last-woman-on-earth-1960-time-travel-drama-mys",
      "title": "Last Woman On Earth (1960 Time Travel, Drama, Mys)",
      "description": "MOVIE TAGLINE : They fought for the Ultimate Prize! PLOT : Ev, along with her husband, Harold, and their lawyer friend Martin, are scuba diving while on vacation in Puerto Rico. When they resurface, they gradually conclude that an unexplained, temporary interruption of oxygen has killed everyone on the island... maybe even the world! —IMDb by Kim Williams IMDb User Reviews : Moves along at a steady clip . (May 11 2004 by CelluloidTime): \"Last Woman On Earth\" moves along at a steady clip and has an exciting ending (with a disappointing conclusion).  It is a film that benefits from smart writing, an on location shoot, and an interesting meshing of script with Jazzy soundtrack. There is an underwater scene that was quite excellently filmed. For that matter, the whole film was quite excellently filmed.  Even though this film predates the first James Bond film, it has a bit of a \"Dr. No\" feel to it.  No, it is no \"Dr. No\", but neither was its budget a Bond budget. You're not missing much if you never see \"Last Woman On Earth\", but if you do see it you won't feel like you wasted 71 minutes of your life. It's a pretty good film -- a sad little tale about good and evil. mostly cerebral action (Apr 26 2003 by KDWms): A setting resulting from sci-fi; but heavy philosophizing in the vast majority of the film: Ev becomes the last woman on earth - well, at least, in Puerto Rico, where she is vacationing with her gambling-addicted, workaholic, material-oriented, not-quite-above-board husband, Harold; and their free-spirited lawyer friend, Martin. They emerge from a scuba-diving session and gradually realize that everyone else on the island - perhaps globally - has suffocated from a mysterious (but impermanent) breach of the oxygen supply. From this point, it is a psychological study of the differing priorities of the three characters. Viewers who are interested in interpreting some varieties of human behavior will find THAT in this movie. Others, however, may prefer more of the type of action which will NOT be found here. Yet Another Underrated Corman Film (June 17 2003 by Space_Mafune): This very underrated low budget end of the world movie focuses on what drives men against one another. When the world's oxygen supply is inexplicably cut off for a short time, a trio of divers using oxygen tanks, a married couple named Harold (Anthony Carbone) & Evelyn Gern (Betsy Jones-Moreland) and their friend Martin Joyce(Robert Towne), suddenly find they are from all appearances the only 3 people left alive. But 2 men and 1 woman don't make for a very good mix we soon discover. This is absolute fascinating to watch unfold. Jones-Moreland gives one of her finest performances and the final showdown between Harold and Martin in the Church is an unforgettable moment. One problem the film has is it never really explains things enough...they just happen but maybe that's not such a bad thing after all come to think of it. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "fileSize": 232576841,
      "id": "last-woman-on-earth-1960-time-travel-drama-mys"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}