{
  "imdbId": "archive-childrenOfHiroshima1952",
  "title": "\"Children of Hiroshima\" [1952]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/childrenOfHiroshima1952",
      "title": "ChildrenOfHiroshima1952",
      "description": "Anti-war films are out numbered by war films but that doesn't mean that their few numbers are irrelevant in the analysis of the philosophy of human aggression. Recall Lewis Milestone's \"All Quiet on the Western Front\", Dalton Trumbo's \"Johnny Got His Gun\", Stanley Kubrick's \"Paths of Glory\", or Kon Ichikawa's \"The Burmese Harp\". Here are some thoughts by \"The New York Times'\" writer A. O. Scott on the re-release of \"Children of Hiroshima\" \"Japanese Survivors Shaded by Puzzlement and Sorrow\" April 21st, 2011 Kaneto Shindo's \"Children of Hiroshima\" was released in Japan in 1952, when the memories of World War II and the dropping of atomic bombs on Hiroshima and Nagasaki were still fresh and painful. A sense of immediacy, or working through recent and almost unfathomable trauma, is palpable in the film, much of which was shot in Hiroshima itself. That it is only now opening in the United States --as part of a welcome and revelatory retrospective devoted to Mr. Shindo at the Brooklyn Academy of Music--heightens that uncanny sense of present-tense witness, even as Japan's more recent disasters impart a somber feeling of renewed relevance. Mr. Shindo, who turns 99 on Friday (and whose brand-new feature, \"Postcard,\" will be shown in the 11-film program), has been overshadowed, at least in the West, by some of his predecessors, peers and successors: filmmakers like Kenzo Mizoguchi, Akira Kurosawa and Shohei Imamura. \"Children of Hiroshima\" is of interest partly because it is among the first films to address a subject that would preoccupy, both directly and obliquely, so much of postwar Japanese cinema. But it is also the first important work of a distinctive and protean visual storyteller, whose films--ghost stories, violent allegories, quiet neo-realist fables--balance ethical seriousness with an almost voluptuous appetite for natural beauty and pictorial elegance. The Brooklyn Academy retrospective, Friday through May 5..., is subtitled \"The Urge for Survival,\" and while that certainly captures an elemental drive prevalent among Mr. Shindo's hard-pressed, resilient characters, \"Children of Hiroshima\" is more obviously concerned with the sorrow and puzzlement that shadow the lives of those who managed to live through the cataclysm of the atomic bomb. At its center is Takako Ishikawa, a young schoolteacher (Nobuko Otowa, Mr. Shindo's wife, who died in 1994, and the frequent star of his films). Takako returns to her hometown four years after the bombing, having spent the intervening years in rustic exile in an island fishing village. The rough simplicity of existence there stands in pointed contrast to the complicated, self-conscious, class-divided urban life she once knew. On her return she finds illness and desperation, but also signs of hope and recovery, a combination epitomized by an old friend, rendered infertile by radiation and married to a man she considers her social inferior, who plans to adopt an orphan. Another young woman is preparing for marriage, in spite of her still-raw grief at the death of her beloved brother during the war. \"Children of Hiroshima,\" commissioned by the Japan Teachers Union and based on a compilation of testimonies by a university professor, Arata Osada, combines documentary naturalism with lyrical and frankly sentimental passages. The bombing is recalled through a horrific, surreal montage that anticipates some of the wild imagery Mr. Shindo would bring to later, horror-inflected movies like \"Onibaba\" (1964) and \"Kuroneko\" (1968). But the overall tone is heartfelt and determined, as Takako, visiting the small handful of her former kindergarten students who survived, encounters both unbearable sadness and fragile optimism. Mr. Shindo combines austerity and sensuality to stirring, sometimes mesmerizing effect. The beauty of the compositions in \"Children of Hiroshima\"--the clarity of focus, the graceful balance within the frames--provides some relief from the grimness of his subject, though the film's aesthetic texture also undermines the political message that Mr. Shindo's sponsors hoped would come through. He contemplates Japan's wartime experience with regret, rather than indignation. .... ---------- Kaneto Shindo [Wikipedia] http://en.wikipedia.org/wiki/Kaneto_Shind%C5%8D [RQ-1/31/12-2/2/12]",
      "id": "childrenOfHiroshima1952"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:23.579Z"
}