{
  "movieId": "archive-Mommartz_Als_wars_von_Beckett_1976",
  "title": "1976 Als wär’s von Beckett (As if it was a Beckett)",
  "year": 1976,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mommartz_Als_wars_von_Beckett_1976",
      "id": "Mommartz_Als_wars_von_Beckett_1976",
      "title": "1976 Als wär’s von Beckett (As if it was a Beckett)",
      "description": "Bundesfilmpreis: Filmband in Silber With Ila Goldstern u. Günter Wolf. An authentic marriage dispute that looks like a play. KLAUS ULRICH REINKE, WESTDEUTSCHE KURZFILMTAGE OBERHAUSEN, REPORT, 1976 This could be the kind the absolute amateurism that we should proclaim furthermore; Amateurism as a concept, a mental substance! Because at the moment only the causalistic perfectionism is claimed as a mistake of universal consequence. This amateuristic climax in the form of \"As if it was a Beckett\" has with its author, Lutz Mommartz, one organically grown starting position. After the Experimentalsilmfestival in Knokke/Belgium in the middle of the 60's, that had served to new American Cinema as a \"bridgehead\" for re-conquest of the old world by the not telling film, Lutz Mommartz was decorated there at the end of the 60's with the second price and with this mentioned to be the most prominent representative of the \"other cinema\" in Europe. He is a direct descendant of the German film avant-garde in the 20's - Victor Eggeling, Hans Richter, Walter Ruttmann among others - thus, amateurs all together, whose intention was not to transform dramatic samples of the spoken theatre to the medium film in an imperceptible way. They rather wanted to experience the medium film in its permanent extension and make others experience the same as a completely independent form. An additional lure for assotiation of this newest film of LutzMommartz is however, his expressly reflection of the speech theatre, by quoting in the title the entire absurd theatre with the name of the Nobelprice owner Samuel Beckett; Here particularly: Becketts \"lucky days\", one of those everyday marriage tragedies - alone and exclusively delivered between a man and a woman and of tragic dimensions. The two Protagonists are the artist Ila goldstern and her husband, who live together in Duesseldorf and who have two children. \"As if it was from Beckett\" starts - like a american shortstory - suddenly with a word- and gesture-rich attempt of locating the two actors. In a Rretrospective way it should be clarified, where the reasons for the definite failure of the marriage constellation can be found. And how in this way - a clarifying process of consciousness - the problem can be resolved. The woman asks the man for a last, new chance. At least for the good of the common children. She is not even afraid of usingshrink self exposing and self humiliating. The man remains irrefutably hard in his rhetorik of blank irreconcilability. He states that he cannot expose himself to \"force, which claims itself as love\". GENERAL ANZEIGER BONN, 28.4.76 \"As if it was a Beckett\" is the evil in the idea of Strindberg, a documentary recorded portrait of a marriage, of that kind that one hopes in vain, it was 'only' a fiction. KLAUS ULRICH REINKE From these points of view the film \"As if it was a Beckett\" from Lutz Mommartz is a binding example of today's proven creative consciousness: The most private will always be the most general!",
      "fileSize": 3318998665,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/Mommartz_Als_wars_von_Beckett_1976",
      "year": 1976,
      "collection": "feature_films",
      "downloads": 3029
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}