{
  "movieId": "archive-week-120",
  "title": "Shocker Internet Drive In Week 120: \"More Mantan\" Multi-Feature",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/week-120",
      "id": "week-120",
      "title": "Shocker Internet Drive In Week 120: \"More Mantan\" Multi-Feature",
      "description": "Hello and welcome back to your phone or tablet's favorite film fest. So, while the world continues to hold its breath amid the Corona Crisis, we began to clean out our \"projection\" room and found a forgotten feature!  Actually, this four film treat was going to be our 2019 Christmas release, but as you may remember, real life got in the way and we took some time off, and sadly, this collection sat on our hard drive until we began clearing out some dead files. Irregardless, not wanting to waste some good fun, we are happy to bring you four more \"classic\" Mantan Moreland movie treats. In addition to Moreland, these comic mysteries also feature his one time partner Frankie Darro, who most people find more annoying than funny, but Mantan, as usual, saves the day and the films. In order of appearance, we present \"Irish Luck\", \"On The Spot\", \"Up In The Air\", and \"You're Out Of Luck\". Even though these films were made by Monogram Studios, we feel they rise above that company's reputation thanks to Mr. Moreland. So, sit back and enjoy our \"lost\" Christmas quadruple treat. and don't forget w e also have an APP. It's not much, but you can check it out here: http://shockerdrivein.dx.am/appPage.html  or here: https://archive.org/details/app-debug_202002 Web Page:  http://shockerdrivein.dx.am Facebook:  https://www.facebook.com/shockerdrivein.dx.am",
      "fileSize": 6320146240,
      "addedAt": "2026-01-07T00:13:06.702Z",
      "thumbnail": "https://archive.org/services/img/week-120",
      "collection": "feature_films",
      "downloads": 3831
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.702Z"
}