{
  "movieId": "archive-1971-dvd-...-505",
  "title": "Τι έκανες στον πόλεμο Θανάση; (1971)",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1971-dvd-...-505",
      "id": "1971-dvd-...-505",
      "title": "Τι έκανες στον πόλεμο Θανάση; (1971)",
      "description": "Η ταινία ξεκινά στο εργοστάσιο όπου δουλεύει ο Θανάσης, το οποίο είναι των Γερμανών. Κατά την επιστροφή του στο σπίτι του, περνά από την ταβέρνα που προμηθεύεται φαγητό. Εκεί του μυρίζει κρέας. Ο ταβερνιάρης το αρνείται και ο Θανάσης φεύγει. Στον δρόμο οι ναζί κυνηγάγανε έναν Έλληνα πατριώτη. Ο Θανάσης τρομοκρατημένος αρχίζει να τρέχει κι αυτός, ως που κάποια στιγμή το φαγητό που πήρε από την ταβέρνα πέφτει όλο κάτω. Κάτι παιδιά του το τρώνε και ένας άνθρωπος του παίρνει και το κατσαρολάκι. Ο Θανάσης πάει ξανά στην ταβέρνα να πάρει φαγητό. Αυτή τη φορά όμως βλέπει κρέας στην οδοντογλυφίδα του πελάτη της ταβέρνας. Μαινόμενος ο Θανάσης μπαίνει στην ταβέρνα και αρχίζει να γλείφει τα πιάτα. Εκείνη τη στιγμή μία κυρία εισβάλλει με έναν αστυνομικό και κατηγορεί τον ταβερνιάρη ότι μαγείρεψε τη γάτα της. Κατόπιν, η αδελφή του Θανάση τον πειθει να πάει στο δικαστήριο να ψευδομαρτυρήσει, καθότι χρειάζονται τον ταβερνιάρη. Αφού καταδικάζεται για ψευδομαρτυρία, ο Θανάσης, οδηγείται από λάθος στις φυλακές πολιτικών κρατουμένων. Εκεί γνωρίζει Έλληνες αντιστασιακούς, οι οποίοι του μιλούν για τον περιβόητο Ιβάν, έναν ήρωα της αντίστασης. Σε λίγη ώρα, οι Ιταλοί φέρνουν και τον Ιβάν. Αυτός βοηθά τους πατριώτες να δραπετεύσουν, με τον Θανάση να μένει πίσω. Οι Ιταλοί που περίμεναν έναν ναζί αξιωματικό για να ανακρίνει τον Ιβάν, τελικά, του δίνουν τον Θανάση λέγοντας ότι αυτός είναι ο Ιβάν. Ο Θανάσης βασανίζεται σκληρά. Κατόπιν, καταφέρνει και δραπετεύει με τη βοήθεια κάποιων ιερόδουλων, οι οποίες τον ντύνουν γυναίκα, και τις ακολουθεί, στο νοσοκομείο Συγγρού. Εκεί ο ιατρός τον αφήνει να φύγει, μετά από παρέμβαση της Δανάης, μιας από τις ιερόδουλες. Ο Θανάσης αρχίζει να έχει αισθήματα για αυτήν την κοπέλα. Ωστόσο η αδελφή του Θανάση, που συμμετείχε στην αντίσταση χωρίς να το ξέρει ο αδελφός της, του βάζει μέσα στο κατσαρολάκι του, την εφημερίδα της αντίστασης Ελευθερωτής και συνεννοούνται με έναν αντιστασιακό να πηγαίνει να τις παίρνει από εκεί που το αφήνει ο Θανάσης. Μιαν ημέρα ο εργάτης αυτός συλλαμβάνεται και ο Ελευθερωτής μένει μέσα στο κατσαρολάκι του Θανάση. Η Δανάη, που τον είχε βοηθήσει στην απόδραση, τον βοηθά ξανά, προειδοποιώντας τον για το περιεχόμενο του κατσαρολιού. Ο Θανάσης τα χάνει, και με κάθε τρόπο, προσπαθεί να ξεφορτωθεί τις εφημερίδες. Στην προσπάθειά του, τα πετάει σε ένα καφάσι και κατόπιν, ο Γερμανός αξιωματικός Χανς μοιράζει σαρδέλες με το χαρτί αυτής της εφημερίδας. Ο αξιωματικός Γερμανός τους κυνηγά και τους δύο. Τελικά τους πιάνουν. Τον Θανάση τον συλλαμβάνουν ξανά ως Ιβάν. Στη φυλακή οι Γερμανοί σκοτώνουν τον Χανς και ο Θανάσης που προσπαθεί να αποδράσει βρίσκει μία στολή Γερμανών και τη φοράει. Κατόπιν, χωρίς να τον καταλάβουν, πάνε όλοι μαζί στο σπίτι του Θανάση, για να πιάσουν ξανά τον Ιβάν. Ο Θανάσης τρέχει να μπει πρώτος να ειδοποιήσει την αδελφή του, που άκουγε ραδιόφωνο. Κατόπιν το παίρνει, το τυλίγει με μια κουβέρτα και φεύγει. Στα σκαλιά, όμως, πέφτει και το ραδιόφωνο ανοίγει. Η ταινία τελειώνει με τον Θανάση να περνά ανάμεσα από τους Γερμανούς στρατιώτες, ενώ από τα ηχεία του ραδιοφώνου ακούγεται ο εθνικός ύμνος της Ελλάδας. Διανομή     Θανάσης Βέγγος - Θανάσης Καραθανάσης     Έφη Ροδίτη - Δανάη     Αντώνης Παπαδόπουλος - Χανς     Καίτη Λαμπροπούλου - Κλεοπάτρα     Κατερίνα Γώγου - Φρόσω Καραθανάση     Νικήτας Πλατής - Θόδωρος     Μανώλης Δεστούνης - Γερμανός διοικητής     Χρήστος Καλαβρούζος - Μιχάλης     Μιχάλης Γιαννάτος - ιταλός αξιωματικός     Στέλιος Λιονάκης - Ιβάν     Γιάννης Φύριος - δικαστής     Κώστας Σταυρινουδάκης - εργάτης",
      "fileSize": 1015339218,
      "addedAt": "2026-01-07T00:06:06.564Z",
      "thumbnail": "https://archive.org/services/img/1971-dvd-...-505",
      "language": "gre",
      "year": 1971,
      "collection": "feature_films",
      "downloads": 2201
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.564Z"
}