{
  "movieId": "archive-decision-at-sundown-1957-color-western-romance",
  "title": "Decision At Sundown (1957 Color Western Romance)",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/decision-at-sundown-1957-color-western-romance",
      "id": "decision-at-sundown-1957-color-western-romance",
      "title": "Decision At Sundown (1957 Color Western Romance)",
      "description": "MOVIE TAGLINES: 01) At last the search was over ... now he was face-to-face with the killers who had dishonored his wife ! 02) Somebody will die for this ! 03) Big showdown coming up ! PLOT : Bart Allison and sidekick Sam arrive in the town of Sundown on the wedding day of town boss Tate Kimbrough, whom Allison blames for his wife's death years earlier.--I MDb STORYLINE : Bart Allison arrives in Sundown planning to kill Tate Kimbrough. Three years earlier he believed Kimbrough was responsible for the death of his wife. He finds Kimbrough and warns him he is going to kill him but gets pinned down in the livery stable with his friend Sam by Kimbrough's stooge Sheriff and his men. When Sam is shot in the back after being told he could leave safely, some of the townsmen change sides and disarm the Sheriff's men forcing him to face Allison alone. Taking care of the Sheriff, Allison injures his gun hand and must now face Kimbrough left-handed. —IMDb by Maurice VanAuken IMDb User Review : Unusual Western (July 05 2007 by whpratt1): Randolph Scott, (Bart Allison) heads off for a town along with his sidekick, Noah Berry Jr.,(Sam) for a town where he knew he could find Tate Kimbrough, (John Carroll). Bart Allison was seeking revenge for what Tate Kimbrough did to his wife; this Tate fellow was in charge of the town and the people were really not too happy with his leadership. It just so happens that Tate is going to married a local gal in town named Lucy Summerton, (Karen Steele) and while the ceremony is about to begin and the preacher says, \"Is there anyone here who objects to this Wedding\" and of course Bart Allison says, \"I DO\" and this is when the entire town is turned upside down. This Western is like a sermon through out the entire picture and all kinds of moral issues are involved even though the preacher likes to hit the bottle. If you look real close you will see a very old time veteran actor playing a bad dude, Bob Steele. You really will not believe how this picture ENDS. Striking , complex western   (Oct 25 2012 by runamokprods): A far more interesting and morally complex film than I expected after the first 15 minutes. Randolph Scott stars as a cowboy come to take revenge on a man who wronged him, a man who is now the kingpin of the town of Sundown. But all the characters reveal more layers than our first introductions lead us to expect, and issues of right and wrong end up as more subjective and complex than we think of in most westerns. Not quite a great movie – there are flaws; weak supporting performances, a misogynistic attitude, some unsuccessful comic relief, some stretching of credulity, etc. But a movie that was much more striking than I had any expectation of. Spectacular ! (June 6 2021 by deexsocalygal): Now THIS is a Randolf Scott western worth at least a 9 rating ! The color is breathtaking, picture crisp, & sound clear as a bell. The story kept me hanging on every word, just great suspense. The ending was better than usual because Randolf Scott becomes a hero to every person in Sundown. Guns are drawn & it's on from there. Randolf gets holed up in a stable & is waiting to have a shot out with the snake. All the men gather in the salon & start talking. Slowly as they drink their shots of whiskey and talk, they realize they've let their morals drop over the years & allowed their town to become corrupt. They see Randolf & think they ought to be like him & stand up for what's right. They decide to take back their town. Randolf Scott has his show down. The men regain their courage & end the career of the corrupt Sheriff. The bad snake is run out of Sundown & Randolf rides off into the sunset as the Hero who saved Sundown! ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "fileSize": 411790321,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/decision-at-sundown-1957-color-western-romance",
      "language": "eng",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 3911
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.606Z"
}