{
  "imdbId": "archive-anatomy.of.a.-psycho.-1961.720p.-blu-ray.x-264-reel-videos.eng",
  "title": "Anatomy Of A Psycho 1961 Crime/Thriller [1:16:48]",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/anatomy.of.a.-psycho.-1961.720p.-blu-ray.x-264-reel-videos.eng",
      "title": "Anatomy.Of.A. Psycho. 1961.720p. Blu Ray.X 264 Reel Videos.Eng",
      "description": "Anatomy of a Psycho is a 1961 American crime thriller film directed by Boris Petroff (as Brooke L. Peters). Ed Wood reportedly contributed to Jane Mann's screenplay as Larry Lee. Ronnie Burns, adopted son of George Burns and Gracie Allen, plays the romantic lead. The film was shot at the Alexander Film Company studios in Colorado Springs in 1959. It was the only feature film produced by the company. The film had the working title of Young Scarface; by the time film the film received a distributor it was retitled to exploit Anatomy of a Murder (1959) and Psycho (1960). Duke Marco has raised his kid brother Chet and his sister like a father. When Duke is sentenced to death after a trial for murder, Chet increasingly experiences paranoia and psychosis, which not even his sister, best friend or girlfriend can relieve. Ultimately losing touch with surrounding reality, he assaults the son of the prosecuting attorney, beats up the judge's son and sets his house on fire then attempts to get the son of the judge on a murder charge. However, Lieutenant Mac, a local police officer, discovers Chet's involvement and hunts him down. Cast: Ronnie Burns as Mickey Pamela Lincoln as Pat Darrell Howe as Chet Judy Howard as Sandy Michael Granger as Lt. Mac Frank Killmond as Bobbie Russ Bender as Frank Don Devlin as Moe William Salzwedel as Duke Robert Stabler as Defense Attorney John B. Lee as District Attorney Pat McMahon as Arthur (uncredited) Directed by Boris Petroff (as Brooke L. Peters) Screenplay by Jane Mann, Don Devlin Story by Jane Mann, Edward D. Wood, Jr. (as Larry Lee) Produced by Boris Petroff (producer) Cinematography Joel Colman Edited by Ed Spiegel Music by Michael Terr Production company Alexander Film Company Distributed by Unitel The film uses public domain music originally used for Wood's Plan 9 from Outer Space (1959).",
      "id": "anatomy.of.a.-psycho.-1961.720p.-blu-ray.x-264-reel-videos.eng"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:02.557Z"
}