{
  "movieId": "archive-theApeMan1943OriginaltonMitDeutschenUntertiteln",
  "title": "\"The Ape Man\" Originalton mit deutschen Untertiteln",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theApeMan1943OriginaltonMitDeutschenUntertiteln",
      "id": "theApeMan1943OriginaltonMitDeutschenUntertiteln",
      "title": "\"The Ape Man\" Originalton mit deutschen Untertiteln",
      "description": "Nach einem Hinweis von einem seltsamen Mann begeben sich der hartgesottene Berichterstatter Jeff Carter und die beherzte Fotografin Billie Mason auf die Suche nach dem unter rätselhaften Umständen verschwundenen Drüsenfacharzt Dr. James Brewster. In der Zwischenzeit versetzt ein mörderischer Affenmann die Stadt in Angst und Schrecken … 1942 in nur 19 Tagen fertig gestellt, war „The Ape Man“ („Der Affenmann“) der sechste von insgesamt neun Monogram-Filmen mit Bela Lugosi. Die hier angebotene Fassung entspricht der 1949 von Favorite Films vertriebenen Wiederaufführung in den US-amerikanischen Kinos. Schnickschnack Der seltsame Mann, der immer wieder nur kurz im Film auftaucht, ist der Schauspieler Ralph Littlefield (im Vorspann „Zippo“). Nur wenige der ca. 40 Produktionen, in denen er meistens nur eine kleine Sprech- bzw. Statistenrolle spielte, wurden inzwischen auf Deutsch synchronisiert, darunter: „Das verflixte 7. Jahr“ (1955, als Statist im Restaurant) und die US-Fernsehserie „Der Lone Ranger“ (1949, als Jim Blane in der Folge „Jagd auf die Cavendish-Bande“). Bela Lugosi (Dr. James Brewster) und Minerva Urecal (Agatha Brewster) sind auch zusammen in zwei weiteren Filmen zu sehen: „The Corpse Vanishes“ (1942) und „Ghosts on the Loose“ (1943), beide von Monogram Pictures. Auch beim Letzteren führte William Beaudine Regie. Emil Van Horn (der Affe) trat in weiteren Werken auf, doch ausschließlich als Affe!",
      "fileSize": 2003115676,
      "addedAt": "2026-01-07T00:12:44.280Z",
      "thumbnail": "https://archive.org/services/img/theApeMan1943OriginaltonMitDeutschenUntertiteln",
      "language": "English with German subtitles",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 11639
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.280Z"
}