{
  "imdbId": "archive-little-tich-big-boot-dance-et-ses-big-boots-1900-directed-by-clement-maurice",
  "title": "Little Tich Big Boot Dance (1900) Directed By Clément Maurice",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/little-tich-big-boot-dance-et-ses-big-boots-1900-directed-by-clement-maurice",
      "id": "little-tich-big-boot-dance-et-ses-big-boots-1900-directed-by-clement-maurice",
      "title": "Little Tich Big Boot Dance (1900) Directed By Clément Maurice",
      "description": "Little Tich Big-Boot Dance 'Little Tich et ses Big Boots' Director: Clément Maurice Harry Relph (21 July 1867 – 10 February 1928),[1] professionally known as Little Tich, was a 4-foot-6-inch-tall (137 cm) English music hall comedian and dancer during the late 19th and early 20th centuries. He was best known for his acrobatic and comedic \"Big-Boot Dance\", which he performed in Europe and for which he wore boots with soles 28 inches (71 cm) long. Aside from his music hall appearances, he was also a popular performer in Christmas pantomimes and appeared in them annually at theatres throughout the English provinces. He repeated this success in London, where he appeared in three pantomimes at the Theatre Royal, Drury Lane, between 1891 and 1893 alongside Dan Leno and Marie Lloyd. Born in Cudham, Kent, Little Tich began performing aged ten when he developed a dance and tin-whistle act which he showcased at public houses in Sevenoaks. In the early 1880s he formed a blackface act and gained popularity with performances at the nearby Rosherville Pleasure Gardens and Barnard's Music Hall in Chatham. He travelled to London and appeared at the Forester's Music Hall in 1884. Later that year, he adopted the stage name \"Little Tich\", which he based on his childhood nickname of \"Tichborne\", acquired through his portly stature and physical likeness to the suspected Tichborne Claimant Arthur Orton. The terms \"titchy\" or \"titch\" were later derived from \"Little Tich\" and are used to describe things that are small. Little Tich's act further developed during a tour of the United States between 1887 and 1889 where he established the Big-Boot Dance and impressed audiences with his ability to stand on the tips of the shoes and to lean at extraordinary angles. In the 1890s he developed the Serpentine Dance and had a major success with the Christmas pantomime Babes in the Wood in Manchester during the 1889–90 season. In 1891, he was recruited by the impresario Augustus Harris to appear in that year's spectacular Theatre Royal, Drury Lane, Christmas pantomime Humpty Dumpty. He starred in a further two productions at the theatre including Little Bo Peep (1892) and Robinson Crusoe (1893). Between 1896 and 1902 Little Tich performed in his own musical theatre company, and spent much of his time in Paris, where he became a popular variety artist. For his music hall acts, he created characters based on everyday observations. The characterisations used were \"The Gas Inspector\", \"The Spanish Señora\" and \"The Waiter\"; all three were later recorded onto shellac discs, of which he made twenty in total. He was married three times and fathered two children. In 1927 he suffered a stroke, which was partly triggered by a blow to the head which he had accidentally received during an evening performance at the Alhambra Theatre. He never recovered fully from the injury, and died the following year at his house in Hendon, aged 60.",
      "fileSize": 38872264,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/little-tich-big-boot-dance-et-ses-big-boots-1900-directed-by-clement-maurice",
      "year": 1900,
      "collection": "feature_films",
      "downloads": 203
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.891Z"
}