{
  "imdbId": "archive-rock-a-bye-baby-1958-comedy-jerry-lewis",
  "title": "Rock A Bye Baby (1958 Comedy, Jerry Lewis)",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rock-a-bye-baby-1958-comedy-jerry-lewis",
      "title": "Rock A Bye Baby (1958 Comedy, Jerry Lewis)",
      "description": "TAGLINES: 01) He's The \"Mother\" of The Year! 02) Loaded with SONGS! Loaded with LAUGHS! Loaded with TECHNICOLOR! 03) Three times the fun of every picture ever...as Jerry plays babysitter to triplets! PLOT: A TV repair man must care for the newborn triplets of his former hometown sweetheart, now a famous movie star, so her career will not suffer. --IMDb STORYLINE : Reworking of Preston Sturges' original story, The Miracle of Morgan's Creek. Clayton Poole's a small town TV repairman in a small town, who's still in love with his former hometown sweetheart, Carla Naples - who's now a famous movie star. When Carla becomes pregnant after a hasty marriage, the studio tells her a baby will ruin her career. She turns to the only peraon she can trust; Clayton,who sagrees to care for the baby. —IMDb by Les Adams TRIVIA : 01) When young Clayton is singing to the girl, the actor who plays young Clayton is Gary Lewis, Jerry Lewis' real-life son. 02) Filmed at Universal's back lot, Mrs Van Cleeve's House was the one used for The Munsters a few years later. 03) Carla's deceased husband, Carlos, the bull fighter, doesn't appear in the film. When a picture of the character appears towards the end of the film in a newspaper clipping, it's Jack Benny in a matador suit. 04) Was re-released on a double bill with Don't Give Up the Ship (1959) in 1963. 05) Final film of actress Ida Moore. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. I do receive a huge amount of joy in sharing with you, these many 100s of free-to-you items I have uploaded, however, I have no wish to infringe on any existing copyright laws. DEF.gp ddh ** The following statement is written from my heart . .. t hese are my words and not to be in any way, considered a form letter from archive.org, as the two cents' worth comes from this volunteer , IA member - user - uploader. Thank you in advance for keeping in mind, my t hought process . :)   (ed note from Doreen.) * Although it's quite true that all uploaded material found at archive.org is free for you to watch or download , t he space needed to store it, is not. As you can well imagine, IA grows in leaps and bounds each and every day, the daily cost to keep this wonderful address we so much enjoy, running at proper capacity, is tremendous . This fact is the one and ONLY reason a yearly fundraiser is necessary .... to raise extra dollars to keep this free-for-viewing/downloading and available for today's generations as well as for all future generations ! Each of we worldwide family of members & viewers of archive.org , can help to support this rare, free, and most importantly of all, non-profit organization, because wi th as little as $1 to $5 , you too can make a difference. Small donation, you say? Yes, maybe so .. but stop and think of the huge difference that donation can make, if every single one of we archive.org. members/users j ust say: ''I can do that, and I WILL do that!'' Please consider making that very important donation. Sincerely, I thank you . Doreen. (DEF.gp ddh) *",
      "fileSize": 393383357,
      "id": "rock-a-bye-baby-1958-comedy-jerry-lewis"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.755Z"
}