{
  "imdbId": "archive-la-casa-del-angel-1957",
  "title": "La Casa Del Angel (1957)",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-casa-del-angel-1957",
      "title": "La Casa Del Angel",
      "description": "La casa del ángel  es una película  argentina  en blanco y negro que se estrenó el 11 de julio de 1957, basada en la novela homónima ganadora de un  Premio Emecé  de  Beatriz Guido , publicada en 1954 y que sirvió como trampolín a una fructífera carrera literaria. Llevada al cine por su esposo, el director de cine  Leopoldo Torre Nilsson , pronto se convirtió un éxito de taquilla, tanto por su estética como por lo novedoso de la forma en que había sido filmada. La película supuso el inicio de una manera de filmar que Nilsson continuó utilizando durante muchos años, estrechamente vinculada con el estilo de la  nouvelle vague  francesa, y lanzó al estrellato a la pareja  Elsa Daniel  y  Lautaro Murúa . Además, contó con las actuaciones de  Jordana Fain ,  Guillermo Battaglia ,  Berta Ortegosa  y  Bárbara Mújica . La casa del ángel  fue seleccionada como la  segunda mejor película del cine argentino de todos los tiempos  en la encuesta realizada por el  Museo del Cine Pablo Ducrós Hicken  en 1977, mientras que ocupó el puesto 6 en la edición de 1984 y el 10 en la de 2000. 1 ​ En una nueva versión de la encuesta organizada en 2022 por las revistas especializadas  La vida útil ,  Taipei  y  La tierra quema , presentada en el  Festival Internacional de Cine de Mar del Plata , la película alcanzó el puesto 22. 2 ​ (Wikipedia) Argumento Ambientada en los  años veinte , la historia se centra en Ana Castro, una adolescente de catorce años que vive con una madre muy religiosa y un padre —el Dr. Castro— interesado en la política y en el gobierno. Ana vive también con sus hermanas: Julieta —quien desobedece abiertamente las enseñanzas religiosas de su madre— e Isabel, siempre ausente y a veces muy estricta y vanidosa. Ana comienza a experimentar nuevos cambios en su vida, que la dejarán totalmente confundida. En las vacaciones de verano su prima Vicenta llega a visitar a la familia y siempre tiene intenciones de fastidiar a Ana con los muchachos, e incluso hablan de sexo y asuntos que ella no está acostumbrada a escuchar. En el transcurso de los días, Ana comienza a perturbarse con las obsesiones religiosas de su madre, pensamientos acerca del sexo y la imagen del infierno y el apocalipsis que le inculca su nana. Pero su vida cambiará al conocer al diputado Pablo Aguirre, un hombre mujeriego que mató a varios oponentes en los duelos. Aguirre reta a un duelo de pistola al diputado Esquivel, un opositor que lo acusa de fraudulento. El duelo se va a hacer en la casa de Ana, dónde pensando que puede ser su último baile la invita a bailar en una fiesta. La noche en que se realiza el duelo, Ana se acerca al cuarto de Aguirre para desearle suerte y le da su rosario. Allí, Aguirre termina violándola y Ana se dirige a su cuarto. Luego, esta le desea la muerte en el duelo pero Aguirre sobrevive y se hace amigo de su padre. Pasan los años, Aguirre sigue yendo a casa de Ana a visitar a su padre y se quedan horas platicando. La violación nunca se devela y Ana termina triste deambulando por las calles. Ella menciona que ve a Aguirre en todas partes e incluso aparece hasta en los momentos más críticos. Comentarios En 1998,  Pablo Torre , hijo de Torre Nilson, dirigió una película con un título muy similar,  La cara del ángel , en su recuerdo. El nombre se debe a que fue rodada en una mansión del  barrio de Belgrano  demolida en 1974 que ostentaba como singular detalle la escultura de un ángel, por lo que era oficialmente conocida como  Palacio Delcasse . 3 ​ Elsa Daniel ya había sido dirigida por Torre Nilsson en  Graciela  y volvió a serlo en  La mano en la trampa  (donde volvió a trabajar con Lautaro Murúa) y  La caída . Reparto Elsa Daniel  interpreta al personaje de Ana Castro, una joven adolescente que vive perturbada por su madre, quien es muy religiosa y su nana quien le habla del infierno. Su comportamiento es tímido y aislador ya que su única compañía es su prima Vicenta. Lautaro Murúa  interpreta al personaje de Pablo Aguirre, un diputado mujeriego que vive con su prometida, Cristina. Este próximamente tendrá varios enfrentamientos en la política y llega a un duelo de muerte con su rival, el diputado Esquivel. Berta Ortegosa  interpreta a la Sra. de Castro, madre de Ana, Isabel y Julieta. Siempre está al tanto de sus hijas, y es capaz de percibir el pecado en tan solo una mirada. Bárbara Mujica  interpreta a Vicenta, una joven que visita a la familia Castro los fines de semanas y en las vacaciones. Ella fastidia a Ana hablándole del sexo y le pide un reto de besar a una estatua de un hombre desnudo que se encontraba en el jardín. Yordana Fain  interpreta a Nana, una mujer religiosa que mortifica a Ana hablándole del infierno y sobre la venida de Cristo. Además, se encarga de la enseñanza de hábitos religiosos de las hermanas Castro. Guillermo Battaglia  interpreta al Dr. Castro, un hombre interesado en la política, es padre de Ana y sus hermanas. Este ofrece su casa para que se lleve a cabo el duelo entre los diputados Esquivel y Aguirre. Lilí Gacel  interpreta a Julieta Castro, hermana de Isabel y Ana. Es una joven que no respeta el hábito y reglas espirituales que su madre le enseña y es sorprendida cuando se niega a bañarse con la ropa puesta. Nora Massi  interpreta al personaje de Isabel Castro, hermana de Julieta y Ana. De apariencia ausente y aislada, le gusta la moda en los vestidos y es sorprendida por su madre mientras se probaba un vestido descubierto frente al espejo. Alejandro Rey  interpreta a Julián, el primo de Ana y sus hermanas. Éste se encontraba de visita en la casa de la familia Castro y es sorprendido por Ana, quien se dirige corriendo hacia el y lo besa sin motivo alguno. Paquita Vehil  interpreta a Cristina, novia de Pablo Aguirre.",
      "id": "la-casa-del-angel-1957"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:06:57.130Z"
}