{
  "imdbId": "archive-charlie-chaplin-.-mabels-strange-predicament-1914-restored-short-silent-film-noir-comedy",
  "title": "Charlie Chaplin . Mabel's Strange Predicament ( 1914 Restored Short Silent Film Noir Comedy)",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/charlie-chaplin-.-mabels-strange-predicament-1914-restored-short-silent-film-noir-comedy",
      "title": "Charlie Chaplin . Mabels Strange Predicament 1914 Restored Short Silent Film Noir Comedy",
      "description": "Mabel's Strange Predicament is a 1914 American film starring Mabel Normand and Charles Chaplin , notable for being the first film for which Chaplin donned the costume of The Tramp . The film was directed by Normand and produced by Mack Sennett.The Tramp was first presented to the public in Chaplin's second film Kid Auto Races at Venice (released February 7, 1914), though Mabel's Strange Predicament, his third film in order of release (released February 9, 1914), was produced a few days earlier. It was for this film that Chaplin first conceived of and played The Tramp. REVIEW : A reviewer for Exhibitors' Mail saw the genius of Charles Chaplin in what was only his third film , and predicted great things for the former English stage comedian, writing: \"The Keystone Company never made a better contract than when they signed on Chas. Chaplin, the Karno performer. It is not every variety artiste who possesses the ability to act before the camera. Chaplin not only shows that talent, he shows it in a degree which raises him at once to the status of star performer. We do not often indulge in prophecy, but we do not think we are taking a great risk in prophesying that in six months Chaplin will rank as one of the most popular screen performers in the world. Certainly there has never been before quite so successful a first appearance.\" --Wikipedia ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "id": "charlie-chaplin-.-mabels-strange-predicament-1914-restored-short-silent-film-noir-comedy"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:23.561Z"
}