{
  "imdbId": "archive-EISENBAHN",
  "title": "1967 Eisenbahn (Railway)",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/EISENBAHN",
      "title": "EISENBAHN",
      "description": "Finally and infinitely brought to the point. (L.M.) The spectator hears that the train is coasting, but he sees that the train goes nowhere, a common view is mounted to a magical journey. (UWE NETTELBECK, DIE ZEIT, 5.1.68) The viewer pases, while the film rolls, different phases of experience: 1. He is confused and looks for an order 2. He discovered the two recurring cutting points at which use the same landscape pieces appear 3. He is pleased with his discovery and observes the neighbor 4. He gives up his rational effort and surrenders to the film (H.P. KOCHENTATH, FILM, JAN. 68) We see a train window and the outside passing monotonous flat landscape of a fixed camera, we hear the driving noise of the train, the chatter on the rails, nothing else. But the quarter hour journey does not end as it should in a train station, but there where it started, somewhere between Duisburg and Dusseldorf. This is due to the rails in the film that can be seen twice. One does not sit in a train but in a loop. (FILM, FEBR. 68) \"Railway\" by Lutz Mommartz shows up with a irrevocable setting on the compartment window of a train and the passing scenery as a documentation of time, of temporal progressions, revealing the manipulation of time the documentary movies: Time can only be documented (see Vukotic), by presenting itself uncutted. (PETER W. JANSEN, FILMKRITIK, MAI 68) The virtually endless film appears first as a joke, then as an appeal for inspection and analysis, eventually as a medium of suggestion that leads to meditation. (ENNO PATALAS, FILMKRITIK, MAI 68)",
      "id": "EISENBAHN"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:01.884Z"
}