{
  "movieId": "archive-ItsWinter-Zemastan2006",
  "title": "It's winter - Zemastan (2006)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ItsWinter-Zemastan2006",
      "id": "ItsWinter-Zemastan2006",
      "title": "It's winter - Zemastan (2006)",
      "description": "It's winter - Zemastan (2006) Golden Bear, nominated, Berlin Film Festival, 2006. Synopsis A man is fired from his job. Having no more options, he decides to go find work abroad, leaving behind his wife and daughter. Months pass and his family hear no word from him. A stranger, a mechanic, arrives in town in search of work. His eyes wander to the beautiful young woman whom he hears no longer has a husband. The struggle to survive of a generation torn between wanting to leave its country yet bound by blood to home. Cast: Said Orkani, Hashem Abdi, Mitra Hadjar, Ali Nicksolat, Zahra Jafari Berlinale (Competition) A small town in winter, and as one man leaves his wife, mother and young daughter behind to look for work abroad, another arrives by train - also looking for work. Charismatic and conÙdent, Marhab has what can only be called a roving eye, and before long, begins moving in on the other man's wife. With its unconventional anti-hero (a swaggering, ruthless bad boy, right down to his rock-and-roll haircut), its intimations of film noir, and its deÙnite sexual undertones, this is one of the most quietly subversive Iranian flms made since the Revolution - and also one of the most visually superb: its scenes of landscapes shrouded in snow, and its painterly sense of lighting and composition, render this tale of forbidden passion (imagine, if you will, an Islamic The Postman Always Rings Twice) both stirring and unforgettable. -- Edinburgh-festivals",
      "fileSize": 28338193,
      "addedAt": "2026-01-07T00:06:30.621Z",
      "thumbnail": "https://archive.org/services/img/ItsWinter-Zemastan2006",
      "collection": "feature_films",
      "downloads": 485
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.621Z"
}