{
  "movieId": "archive-el-circulo-rojo-vose-sellada",
  "title": "EL CÍRCULO ROJO – (1970) [VOSE]",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-circulo-rojo-vose-sellada",
      "id": "el-circulo-rojo-vose-sellada",
      "title": "EL CÍRCULO ROJO – (1970) [VOSE]",
      "description": "Título original: Le cercle rouge En México, España y Argentina: El círculo rojo Estrenos: Francia, 20 de octubre de 1970; México, el estreno para todo el público se dio el 16 de septiembre de 1971 en el cine Tlatelolco del D.F. (CDMX) dónde se mantuvo por 4 semanas consecutivas; En España el 2 de diciembre de 1971. En Argentina el 1 de abril de 1971. Duración: 140 min. País de origen: Francia Dirección: Jean-Pierre Melville Guion: Jean-Pierre Melville Reparto: Alain Delon ,  Bourvil ,  Gian Maria Volonté ,  Yves Montand ,  Paul Crauchet ,  François Perier ,  Jean Pignol ,  Paul Amiot ,  Pierre Collet ,  André Ekyan ,  Jean-Pierre Posier ,  Yves Arcanel ,  René Berthier Música: Eric Demarsan Fotografía: Henri Decaë Género: Cine negro ,  Intriga ,  Policíaco ,  Crimen ,  Robos & Atracos ,  Neo-noir , Film-Noir,  Polar francés (Cine Negro francés), Sinopsis Mientras Corey, sale de prisión tras cumplir condena en una cárcel francesa, Vogel, un criminal custodiado por el temible comisario Mattei, escapa del tren en el que viajan. Después de robar a un antiguo socio, Corey se encuentra con Vogel y le propone formar equipo para realizar un meticuloso robo de joyas. ( FILMAFFINITY ) Posición en rankings FILMAFFINITY 51   Mejores películas francesas de todos los tiempos 59   Mejores películas de cine negro 61   Mejores películas de los años 70 Mostrar los 5 rankings  Críticas : \"Este noir asombroso tiene incluso mejor aspecto ahora (...) Una joya (…) Puntuación: ★★★★★ (sobre 5)\"   Peter Bradshaw :  The Guardian   \"Uno puede seguir saboreando la narración calmada de Melville, su estilo visual magistralmente simplificado y sus actuaciones sutiles (…) Puntuación: ★★★★ (sobre 5)\"   Tom Dawson :  BBC   \"Los aspectos clave de la acción están bien editados, pero la conclusión, con sus tiroteos de rigor, no tiene alma y es mecánica\"  Bill Stamets :  Chicago Reader   \"Un hito del género de robos hecho por un maestro de la nouvelle vague (…) Puntuación: ★★★★ (sobre 5)\"   David Parkinson :  Empire   \"Interesará principalmente a los que ya conocen el trabajo de Melville. Irritará a los que dan con él por primera vez\"  Vincent Canby :  The New York Times   \"Tiene infinidad de escenas seductoras y sutiles (…) Puntuación: ★★★★ (sobre 4)\"   Roger Ebert :  rogerebert.com   \"Una obra trascendental para la evolución del cine negro (…) Puntuación: ★★★★ (sobre 5)\"   Chris Cabin :  Slant   \"Ese clímax se convertirá en una de las escenas de robo más extraordinarias jamás filmadas. Una de las razones por las que 'El círculo rojo' pasaría a la historia como una obra maestra.\"  Marcelo Stiletano :  Diario La Nación",
      "fileSize": 9447663265,
      "addedAt": "2026-01-07T00:08:15.377Z",
      "thumbnail": "https://archive.org/services/img/el-circulo-rojo-vose-sellada",
      "language": "fre",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 859
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.377Z"
}