{
  "imdbId": "archive-de-oldify-rotterdam-verwoest-audio-stadsarchief-1080p-s-1940",
  "title": "The sad remains of Rotterdam after the destructive German bombardement on 14 May 1940 [AI enhanced]",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-rotterdam-verwoest-audio-stadsarchief-1080p-s-1940",
      "id": "de-oldify-rotterdam-verwoest-audio-stadsarchief-1080p-s-1940",
      "title": "The sad remains of Rotterdam after the destructive German bombardement on 14 May 1940 [AI enhanced]",
      "description": "On the 10th of May 1940 the German army invaded The Netherlands. During four days the Dutch military heavy resisted the onslaught. A German ultimatum to surrender was ignored by the Dutch government after which Hitler decided to heavily bombard Rotterdam. Almost the entire old city was destroyed and more than 800 people lost their lives. Tens of thousands of residents became homeless. The attack only lasted just over 15 minutes. The German deliberately used incendiary bombs to create as much damage as possible. Tradition bomb blasts would only have caused far less damage and fires. The Rotterdam fire department simply could not cope. This film shows the sad aftermath of the attack. I was able to find three almost identical shots of Rotterdam from the 1930s as well as after the attack which are shown side-by-side for comparison at the end of this film. After the war, the city council of Rotterdam in its \"wisdom\" decided to construct an entire new city. What had not been destroyed by the bombardement was torn down by bulldozers. Even remarkable historic buildings, like the Stadsschouwburg, were demolished although some had only suffered relatively minor damage. As a result, Rotterdam has one of the most modern city centers in Europe. Till this day, the decision to completely modernize Rotterdam is controversial. Especially many older Rotterdam residents still resent what was done by their council. The original poorer quality B&W footage has been motion-stabilized, speed-corrected, enhanced and colorized by means of modern Artificial Intelligence software. The relatively sad music has been deliberately chosen to enhance the atmosphere as a result of the cruel German attack. Special attention has been paid to the side-by-side comparison footage that shows Rotterdam before and after the attack. Music: Johannes Bornlof, Trevor Kowalski a.o. Source B&W footage: Stadsarchief Rotterdam, Beeld En Geluid and other. Timeline (draft! Please help to complete this!) 00:00 Rotterdam still ablaze in the evening op 14 May 1940: Plan-C building between the Oude Haven and the Kolk 00:24 The devastation filmed from a German Heinkel H111 bomber 00:27 Bridge over the river Maas (\"Maasbrug\") top-left 00:40 Noorder eiland 01:20 Buildings still on fire, a day later 02:09 The tower of the totally collapsed Laurenskerk; rebuilt in recent years 02:35 Laurens kerk and surroundings 02:56 Erasmushuis/Hollandsche Bank-Unie (HBU) building on the Coolsingle at the Bulgersteijn 03:00 Location (?) 03:08 The Laurenskerk behind the remains of the destroyed Hoogstraat. 03:18 The back, destroyed middle and front sections of De Bijenkorf on the Coolsingel 03:31 Location (?) 03:42 Near the Delftsche Poort 03:52 The beautiful \"Delftsche Poort\" destroyed 03:55 Top left: Townhall \"Stadhuis\" on the Coolsingel. 04:10 Top left: the Laurenskerk behind the railroad with the viaduct at the Binnen Rotte. 04:42 C&A Hoogstraat - Korte Hoogstraat 05:13 Top: the Koninginnekerk in Crooswijk, just outside of the bombardment zone 05:43 Back of the Postkantoor (Post Office) on the Coolsingel 06:08 Destroyed interior of the Laurens kerk 06:21 Location (?) 06:54 Plan-C building between the Oude Haven and the Kolk 07:32 Tearing down the last walls still standing of Fa.Jungerhans; The building on the right is the Gemeenteziekenhuis on the Coolsingel 08:12 The beginning of the (re)construction of new, modern Rotterdam 08:45 Laurens kerk and surroundings, cleared from most of the rubble 09:02 Windmill \"De Noord\" at the Oostplein; burnt down in 1954. 09:13 The \"Witte Huis\", Rotterdam's first skyscraper, in the distance; The black building is the Station Blaak 09:17 Side-by-side: 1930s and 1940s, probably filmed from the Laurens kerk 10:00 Ditto, Delftsche Poort and surroundings With special thanks to Henk van Dongen and Dwaveryn Note: Part of this video was hosted during the past half year on my other \"Ricks Film Restoration\" channel for reasons of an unjust copyright claim. The 1,5 minute part that was deemed copyrighted has now been replaced by the side-by-side comparison. Thus this video has now been moved back to my main channel. It is a much too important historic document to remain almost hidden!",
      "fileSize": 1059150786,
      "addedAt": "2026-01-07T00:07:59.604Z",
      "thumbnail": "https://archive.org/services/img/de-oldify-rotterdam-verwoest-audio-stadsarchief-1080p-s-1940",
      "language": "eng",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 97
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.604Z"
}