{
  "imdbId": "archive-youre-never-too-young-1955-comedy-jerry-lewis-dean-martin",
  "title": "You're Never Too Young (1955 Comedy Jerry Lewis Dean Martin)",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/youre-never-too-young-1955-comedy-jerry-lewis-dean-martin",
      "title": "You're Never Too Young (1955 Comedy Jerry Lewis Dean Martin)",
      "description": "TAGLINES : 01) Dino's the singing dean of a girl's school, Jerry - a wolf in kid's clothing - in a class by himself with 503 coeds. 02) BACK TOGETHER! The Wildest! The Nuttyest! The Zanyest! The Funnyest PLOT : When an aspiring barber becomes inadvertently involved in the theft of a valuable diamond, necessity forces him to masquerade as a 12 year-old child - with humorous consequences. —IMDB by Gabe Taverney STORYLINE : Wilbur is a young man whose dream is to become a great barber, but for now, he's working just as an assistant, at a hotel's barber shop. When one day he gets involved (by mistake) in some big robbery, he is forced to disguise himself as a 12 year old boy, so that he can get away from his persecutor. —IMDb by Chris Makrozahopoulos IMDb User Review : Pinnacle of their Partnership . (Aug 01 1999 SanDiego): Considered the best of the Martin and Lewis comedies, this remake of \"The Major and The Minor\" (with Lewis in the Ginger Rogers role as an adult disguised as a child to qualify for a half-fare train ticket) improves on the original with a never ending romp of slap-stick humor, musical comedy numbers, and color. Diana Lynn, who plays a teacher, played the teenage roommate to Ginger Rogers in the original. Diana Lynn also starred in Martin and Lewis' debut films \"My Friend Irma\" and \"My Friend Irma Goes To New York.\" Lewis as a boy is never really believable, but that's okay, it's meant as a spoof of anyone who has tried to pass off an older child as younger for half fare tickets. Most important, the humor is very, very fast and funny. Despite some nice musical moments between Dean and Jerry, there is no mistaking this is Jerry's tour-de-farce, and the reason for their split up obvious. Enjoy the pinnacle of their partnership. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "fileSize": 373625116,
      "id": "youre-never-too-young-1955-comedy-jerry-lewis-dean-martin"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:17.038Z"
}