{
  "movieId": "archive-power-in-the-wind-pathe-1932-balaklava-copied-and-colorized",
  "title": "Power In The Wind Pathe 1932 Balaklava Copied And Colorized",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/power-in-the-wind-pathe-1932-balaklava-copied-and-colorized",
      "id": "power-in-the-wind-pathe-1932-balaklava-copied-and-colorized",
      "title": "Power In The Wind Pathe 1932 Balaklava Copied And Colorized",
      "description": "Power in the Wind 1932 Balaklava Wind Turbine Film   In 1932 British Pathé filmed a newsreel of the Soviet Union’s recently installed wind turbine at Balaklava near Yalta on the Crimea Peninsula. [1] The black & white newsreel is 1 minute 23 seconds long, giving a rare glimpse of the unique wind turbine in operation.   This colorized version can be found at https://www.youtube.com/watch?v=O644wG_aBwI   The Cyrillic explanation as translated by Google is “The first modern wind power station in the world. Balaklava. Crimea 1931.”   At 0.37 seconds there are relatively clear images of the design’s control ailerons, one of the wind turbines more unusual features.   The 30-meter (98-foot) diameter wind turbine used a three-blade rotor upwind of the tower. It yawed about a circular track on a tripod tower. The turbine, variously described as WIME-D-30, VIME D-30, or TsVEI D-30 depending upon translation, was rated at 100 kW. It was in operation from 1931 until 1942 when it was destroyed by the Wehrmacht in the battle for Sevastopol.     [1] Power from the Wind British Pathé , Newsreel (British Pathé, 1932), https://www.britishpathe.com/asset/188494/ .",
      "fileSize": 60146297,
      "addedAt": "2026-01-07T00:10:21.539Z",
      "thumbnail": "https://archive.org/services/img/power-in-the-wind-pathe-1932-balaklava-copied-and-colorized",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 673
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.539Z"
}