{
  "movieId": "archive-seductionerotikon1929",
  "title": "\"Seduction\" [\"Erotikon\"] [1929]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/seductionerotikon1929",
      "id": "seductionerotikon1929",
      "title": "\"Seduction\" [\"Erotikon\"] [1929]",
      "description": "Four years before Czech director Gustav Machaty produced \"Ecstasy\" [\"Ekstase\"] [1933] [ http://www.archive.org/details/Ekstase1933 ], \"Seduction\" [\"Erotikon\"] hit the screens. IMDb reviewer ackstasis wrote... 'Erotikon (1929)' was released just as the arrival of \"talkies\" was stifling (at least temporarily) the artistry out of cinema, and it's one of the most lusciously-photographed films of its era. Czech director Gustav Machaty blends melodrama with unexpectedly graceful visual flourishes that communicate emotions as well as actions. In moments of stress, and particularly when photographing the vigorous movement of trains (symbolising a fast-paced society that values fleeting sexual encounters over long-term commitments), he uses a frenetic hand-held camera to marvellous effect. Just watch how Machaty contrasts the slow, sensual bliss of the heroine's first sexual encounter with the grotesque prolonged agony of child-birth. In both sequences, the camera is moving, capturing the numbing euphoria of the moment, but the overall emotional mood of each scene is quite disparate. Following this beautifully-emotive opening act, 'Erotikon' begins to more closely resemble a romantic melodrama in the vein of, say, Milestone's 'The Garden of Eden (1928).' There's not only a romantic triangle, but a veritable polygon of competing affections: Andrea (Ita Rina) shuns a noble gentleman in favour of the man who (presumably) took her virginity, who himself is juggling a married mistress. Machaty, like F.W. Murnau, places particular emphasis on the human face, beautifully capturing the subtle inflections of suspicion, anger and desire that so unmistakably speak louder than words. Andrea finds herself in the upper- class social scene, which carries the faint stench of sleaze; it's an environment that encourages disloyalty by its own shallowness and superficiality. The corruptive sexual indiscretion of Machaty's upper- class reminded me of Jean Renoir, particularly 'The Rules of the Game (1939)' and 'Elena and Her Men (1956).'",
      "fileSize": 1231584671,
      "addedAt": "2026-01-07T00:10:40.955Z",
      "thumbnail": "https://archive.org/services/img/seductionerotikon1929",
      "collection": "feature_films",
      "downloads": 133143
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.955Z"
}