{
  "imdbId": "archive-The_Night_of_Counting_the_Years",
  "title": "The Night of Counting the Years",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Night_of_Counting_the_Years",
      "title": "The Night of Counting the Years",
      "description": "Egyptian critics consistently list \"The Night of Counting the Years\" (also known as \"The Mummy\") as one of the most important Egyptian films, and perhaps the most important one, but it remains largely unknown, both within Egypt and elsewhere, despite winning a number of awards at European film festivals. Set in 1881, on the eve of British colonial rule, it is based on a true story: an Upper Egyptian clan had been robbing a cache of mummies near the village of Qurna, and selling the artifacts on the black market. After a conflict within the clan, one of its members went to the police, helping the Antiquities Service find the cache. The film casts this story in terms of the search for an authentic, lost Egyptian national identity (represented by the neglected and misunderstood artifacts of ancient Egyptian civilization), but the conflict between city and countryside suggests questions that are not resolved in the film, making it an ambiguous, unsettling reflection on the price of identity. Unusual camera angles, striking colours and slow editing give the film a dreamlike quality, reinforced by Mario Nascimbene's eerie music. For those who know Arabic, the dialogue is entirely in classical Arabic, which adds to the sense of unreality. This release includes separate files containing subtitles in English and Arabic (the latter are for those who are learning the language). To watch the film with subtitles, first click on the \"All Files: HTTP\" link on the left side of this page. You will see a long list of files. Download the two video files, whose names end in AVI, and the four subtitle files, whose names end in SRT, by right-clicking on each one and choosing \"Save Link As...\". You can then watch them with a media player that supports subtitle files, such as VideoLAN . (The Arabic subtitles are in UTF-8 encoding.) There is also a higher-quality DVD version , available as two DVD ISO files, without subtitles.",
      "id": "The_Night_of_Counting_the_Years"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}