{
  "movieId": "archive-fuera-de-la-ley-1937",
  "title": "Fuera De La Ley (1937)",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/fuera-de-la-ley-1937",
      "id": "fuera-de-la-ley-1937",
      "title": "Fuera De La Ley (1937)",
      "description": "Fuera de la ley   es una película argentina filmada en blanco y negro dirigida por Manuel Romero sobre un guion propio, cuyos principales protagonistas fueron Luis Arata , José Gola e Irma Córdoba que se estrenó el 14 de julio de 1937. Es un drama policial que fue considerada una de las mejores películas del director y que influyó en las películas argentinas posteriores del mismo género.                   Fue reconocida como la décima mejor película del cine argentino de todos los tiempos en la encuesta realizada por el Museo del Cine Pablo Ducrós Hicken en 1977.        (Wikipedia) Sinopsis La película se estrenó a menos de cinco meses del secuestro y en ella José Gola protagonizaba el delincuente, hijo de un comisario encarnado por Luis Arata, que al salir de la cárcel pretende seducir a quien debía ser como una hermana para él, una muchacha representada. por Irma Córdoba criada y amada por sus padres. Para forzarla a ceder a su obsesión secuestrar a su hijita (Rayito de sol) y la lleva al escondite de unos compinches. Su padre, cuando sospecha la verdad, pide quedar al frente de la investigación, persigue y cerca a su hijo, se convence de que es un malvado irrescatable y finalmente no vacila en ejecutarlo. Reparto Luis Arata   ... Pedro Robles José Gola   ...Juan Robles Irma Córdoba   ...Emilia Susy Derqui   ... Flora María Esther Buschiazzo   ... Madre de Juan Robles Marcos Caplan   ... Agapito Pedro Maratea   ...Enrique Varela Marcelo Ruggero   ... Chichilo Martín Zabalúa (padre)   ... Jefe de Policía María Vitalani   ... Mujer de Chichilo Pedro Laxalt   ... Roberto Achával Roberto Blanco   ... Ñato Rayito de Sol... Susana Achával Gerardo Rodríguez   ... El Turco Jorge Lanza   ... Giménez Malisa Zini   ...Niñera.",
      "fileSize": 1203954336,
      "addedAt": "2026-01-07T00:08:32.016Z",
      "thumbnail": "https://archive.org/services/img/fuera-de-la-ley-1937",
      "language": "spa",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 103
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.016Z"
}