{
  "imdbId": "archive-the-naked-kiss-1964_202406",
  "title": "The Naked Kiss 1964 ★★★ CC: Neo-Noir/Melodrama [1:30:52]",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-naked-kiss-1964_202406",
      "title": "The Naked Kiss 1964 ★★★ CC: Neo-Noir/Melodrama [1:30:52]",
      "description": "The Naked Kiss is a 1964 American neo-noir melodrama film written and directed by Samuel Fuller and starring Constance Towers, Anthony Eisley, Michael Dante and Virginia Grey. It was Fuller's second film for Allied Artists after his 1963 film Shock Corridor. Kelly is a prostitute who arrives by bus in the small town of Grantville after being chased out of the big city by her former pimp. She engages in a quick tryst with local police captain Griff, who then commands her to leave town and refers her to a cathouse just across the state line that is operated by a madam named Candy. Kelly instead abandons her illicit lifestyle, renting a room from an old spinster and becoming a nurse at a hospital for disabled children. Griff, who does not trust reformed prostitutes, continues trying to force her from the town. Cast: Constance Towers as Kelly Anthony Eisley as Capt. Griff Michael Dante as J.L. Grant Virginia Grey as Candy Patsy Kelly as Mac, Head Nurse Marie Devereux as Buff Karen Conrad as Dusty Linda Francis as Rembrandt Bill Sampson as Jerry Jean-Michel Michenaud as Kip George Spell as Tim Christopher Barry as Peanuts Patty Robinson as Angel Face Edy Williams as Hatrack Betty Bronson as Miss Josephine, the Seamstress Neyle Morrow as Officer Sam Production: Directed by Samuel Fuller Written by Samuel Fuller Produced by Samuel Fuller Cinematography Stanley Cortez Edited by Jerome Thoms Music by Paul Dunlap Distributed by Allied Artists Pictures Corporation Music: Santa Lucia: Music by Teodoro Cottrau The Little Boy and the Old Man: Music by Wayne Shanklin, lyrics by Wayne Shanklin, performed by Constance Towers Main and End Title: Music by Paul Dunlap ",
      "id": "the-naked-kiss-1964_202406"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}