{
  "imdbId": "archive-la-flor-de-irupe-1962",
  "title": "La Flor De Irupe (1962)",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-flor-de-irupe-1962",
      "title": "La Flor De Irupe (1962)",
      "description": "La Flor de Irupé  es una película en blanco y negro de  Argentina  dirigida por  Alberto Dubois . El nombre alude a la doncella protagonista de una leyenda guaraní relacionada con  esa flor . Fue el primer trabajo protagónico de la actriz  Libertad Leblanc , con  Luis Alarcón  y  Héctor Pellegrini  en roles estelares. Filmada en blanco y negro, fue estrenada en Argentina el 4 de octubre de 1962. La audacia de los desnudos que presenta la película, inesperada para la época, y la evidente belleza física de la protagonista, hicieron de  La flor de irupé  un éxito de taquilla, instalando a Libertad Leblanc (por entonces de 24 años) como un gran  sex symbol  de la época, sobre todo en Argentina. (Wikipedia) Sinopsis Tres delincuentes que robaron un banco y asesinaron a un guardia huyen con el botín. Buscando dónde ocultarse encuentran una choza solitaria entre los  esteros del Iberá , a orillas del  río Paraná , habitada por un anciano trampero, ermitaño y excéntrico. Los fugitivos se apoderan de la choza y deciden ocultarse allí por un tiempo. Los días pasan lentamente y el tedio, el aburrimiento y la falta de mujeres, torna a los prófugos inquietos e irritables. Un atardecer, uno de ellos, Roberto (Luis Alarcón), mientras deambulan por los alrededores, se topa con una bella muchacha, de cabello rubio y piel blanquísima, bañándose desnuda en el río. Cuando él intenta acercarse y entablar conversación, ella se aleja y se pierde en la espesura. ¿Es real o ha sido sólo un espejismo? Al regresar a la choza, Roberto relata lo sucedido a sus dos secuaces. El anciano trampero les narra entonces la extraña y trágica historia de \"la flor de  irupé \", leyenda que anda circulando por la zona desde hace algunos años. Se trata de un espectro femenino, una bella muchacha a la que es posible ver bañándose desnuda en las aguas del río, las noches de luna llena. Según la leyenda, la joven, única hija de una aristocrática familia del lugar, halló la muerte en esas aguas luego de una horrible tragedia. Durante su luna de miel, un jardinero demente atacó al flamante esposo y lo mató, para luego violar a la joven esposa. Loca de dolor, la muchacha corrió hacia los esteros, internándose en las aguas, donde halló la muerte. Desde aquel trágico día, el fantasma de la hermosa joven regresa cada luna llena, esperando reencontrase con su marido muerto. Aunque es una inquietante historia, los delincuentes no creen en ella. Pero algunos días después, Roberto vuelve a encontrarse con la muchacha. Se llama Marta y resulta ser de carne y hueso. Allí mismo, el hombre y la mujer hacen el amor, y pronto se enamoran. Pero las cosas no serán tan fáciles para Roberto y Marta, \"la Flor de Irupé\". 1 ​ Reparto Libertad Leblanc  ... Marta Luis Alarcón  ... Roberto Héctor Pellegrini  ... El ladrón Mario Amaya  ... Indio Alberto Barcel Héctor Carrión  ... El Sapo Alberto Barcel  ... Don Lucas Mario Casado Amelia Folcini Jorge L. Fossati Carlos García",
      "id": "la-flor-de-irupe-1962"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:24.701Z"
}