{
  "imdbId": "archive-2017SteuererklrungLutzMommartz",
  "title": "2017 Steuererklaerung Lutz Mommartz",
  "year": 2017,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/2017SteuererklrungLutzMommartz",
      "title": "2017 Steuererklaerung Lutz Mommartz",
      "description": "Liebe Leute, ich arbeite an einem filmischen Bild: ‚Der durchsichtige Mensch’.                              Der lebt im 22. Jahrhundert und kontrolliert seine Steuererklärung nach dem neuen globalen Grundgesetzt. Der Staat, verteilt die Mittel aufgrund eines Verfahrens, in das alle Menschen einbezogen sind. Die Not der Zeit und die Erweiterung des Bewußtseins der Mehrheit erlaubten und verlangen es, alle Menschen auf ihre Fähigkeiten und Bedürfnisse zu durchleuchten. Daraus ergibt sich ein Schlüssel für jeden einzelnen, der eine neue Form der Gerechtigkeit darstellt: Jeder nach seinen Fähigkeiten und jedem nach seinen Bedürfnissen in Bezug aufs Ganze. Diese Idee wurde bereits im 19. Jahrhundert entworfen. Sie konnte aber neuerdings mithilfe der digitalen Datenermittlung aller menschlichen Eigenschaften und persönlichen Unterschiede gegen den Willen der ehemals Mächtigen verwirklicht werden. Die Grundrechte waren in ihrer Bedeutung und Rangfolge neu zu sortieren. Gleichheit - so unscheinbar sie ist – steht jetzt vor allen anderen Grundrechten.  Da sie ohne Frieden nicht herstellbar waren, steht sie weit vor Freiheit, die erst hinter Gerechtigkeit ihren Platz bekommt. Da ich lieber in einer solchen Welt leben möchte als in der jetzigen, warte ich auf das Absterben der gegenwärtigen Epoche. Aber das passende Filmbild dazu fällt mir noch nicht ein. 1964 habe ich meine Schwester und ihren Mann in Nyarushanje Uganda besucht, wo er im Entwicklungsdienst der Kirche eine Landwirtschaftsfarm gründete. Ich nahm seine 8mm Kamera und drehte damit meinen ersten Film: ein Tischtuch, das zum Trocknen auf der Leine hing, formatfüllend. Nur wenn der Wind einen Zipfel aufwehte, konnte man ein kleines Stück von Afrika sehen.  Solch einen einfachen Film möchte ich nochmal können. Jetzt ist der Sohn meines Schwagers für ein paar Jahre in Kampala und macht Entwicklungshilfe für Stromgewinnung aus Mist. Jetzt sitze ich im Jahr 2017 noch in Deutschland und muß erst noch verlangen, daß unser Grundgesetz geändert wird, bevor es sich global entwickelt. Gleichheit vor dem Gesetz kann es aber nur geben, wenn jeder Mensch in seinem Sein und Handeln vor den anderen Menschen, also auch dem Staat, durchsichtig ist.  Lutz Mommartz",
      "id": "2017SteuererklrungLutzMommartz"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:06.565Z"
}