{
  "imdbId": "archive-la-otra-1946-hd",
  "title": "LA OTRA – (1946)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-otra-1946-hd",
      "id": "la-otra-1946-hd",
      "title": "LA OTRA – (1946)",
      "description": "¡Una de las mejores del cine mexicano! Una película de intriga y suspenso a la altura del mejor cine del mundo. Actuada por una Dolores del Río en un doble papel y dirigida magistralmente por “ El ogro ” Roberto Gavaldón. País de origen: México Filmada a partir del 27 de mayo de 1946 en los estudios Churubusco y se estrenó el 26 de noviembre de ese 1946 en el cine Olimpia de la Cd. de México en dónde se proyectó con éxito por cinco semanas. Duración: 98 min. Dirección: Roberto Gavaldón Guion: José Revueltas, Roberto Gavaldón. Sobre el cuento de Rian James Música: Raúl Lavista Fotografía: Alex Phillips (B&W) Reparto: Dolores del Rio , Agustín Irusta , Víctor Junco ,  José Baviera ,  Manuel Dondé ,  Conchita Carracedo ,  Carlos Villarías ,  Rafael Icardo ,  Daniel Pastor ,  Lidia Franco ,  Maruja Grifell ,  Elodia Hernández ,  Enedina Díaz de León ,  Bertha Lehar Productora: Producciones Mercurio Géneros: Cine negro , Film Noir,  Thriller ,  Intriga , Drama ,  Crimen ,  Policíaco , Sinopsis \" LA OTRA \", una película mexicana dirigida por Roberto Gavaldón en 1946, con la presencia estelar de Dolores del Río en un doble papel, nos cuenta la historia de María y de Magdalena, dos hermanas gemelas, una millonaria, la otra pobre y de cómo María la hermana pobre asesina a su gemela para suplantarla. Paradójicamente, la asesina no sólo recibirá la fortuna de la muerta sino también el pesado fardo de un delito que ésta cometió. (FILMAFFINITY)",
      "fileSize": 2034794452,
      "addedAt": "2026-01-07T00:09:24.702Z",
      "thumbnail": "https://archive.org/services/img/la-otra-1946-hd",
      "language": "spa",
      "collection": "feature_films",
      "downloads": 3742
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}