{
  "movieId": "archive-rio-lobo-1970-john-wayne-western-civil-war",
  "title": "Rio Lobo (1970 John Wayne Western Civil War)",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rio-lobo-1970-john-wayne-western-civil-war",
      "id": "rio-lobo-1970-john-wayne-western-civil-war",
      "title": "Rio Lobo (1970 John Wayne Western Civil War)",
      "description": "PLOT : 01) After the Civil War, Cord McNally searches for the traitor whose treachery caused the defeat of McNally's unit and the loss of a close friend._ IMDb 02) Colonel Cord McNally, an ex-Union Officer teams up with a couple of ex-Confederate Rebels to search for the traitor who sold information to the South during the Civil War. Their quest brings them to the town of Rio Lobo, where they help recover this little Texas town from ruthless outlaws who are led by the traitor, for whom they were looking. —IMDb by Christopher D. Ryan STORYLINE : Bent on unearthing the cynical traitor who sold information to the enemy and caused the death of a dear brother-in-arms, the battle-tested former Union cavalry officer, Colonel Cord McNally, teams up with a pair of ex-Confederates after the Civil War. Now, as honest friends, the three companions ride into Rio Lobo--a dusty town in the middle of the desert overcome by corruption--to bring to justice the one who sold McNally out; however, the town is rife with the betrayer's murderous cut-throats. Can McNally avenge his bosom buddy and clean up Rio Lobo? —IMDb by Nick Riganas IMDb User Review : Much maligned, better than you're told (June 20 2004 by maxbrand): OK, put down the film criticism texts and just watch this fun movie for what it is. Feels like a TV movie, but several cuts above one. The opening train robbery sequence is pretty damn breathtaking for a \"bad\" movie. Bet some action directors have studied that one. \"Lobo\" is collection of a lot of good Hawks-ian moments recycled, sort of like a retrospective of his bag of tricks ie. \"Yer necks broken,\" etc. The Duke aging, beat up, but still The Duke. Sherry Lansing pretty hot looking in her one role. Jack Elam the scene stealer. Too bad they didn't have the money to cast the other parts better--Mitchum or Martin would have helped a lot. Duke looks a little lonely.Plot sorta strung together, but Hawks was concentrating more on characters in his Bravo/Dorado/Lobo \"trilogy.\" \"Smart\" dialog, while not up to 30s & 40s banter, still has clever moments by today's standards. Clever rifle bit at the end shows old timers' practical knowledge of things, like weapons. If you like old westerns, you'll like this one. Not among his greatest, but low end Hawks is better than no Hawks. I've seen much thinner stuff win awards. My favorite John Wayne movie (Uly 28 2001 by eddie261): Hey, it's a great western with lots of action, nice scenery, and lots of great laughs (I love Jack Elam's character, Mr. Phillips). Never a dull moment in this one, as the story moves along very well. Get this one on video if you haven't already! Acting is almost painful to watch  (Sep 26 2017 by twiss54): Of course, the Duke delivers, albeit as a caricature of, himself, but the rest of the cast, except Jack Elam and David Huddleston, is a pain to watch. I believe the piece of trivia that said Wayne felt Elam was a scene-stealer. He chewed up the scenery and spit it out. Jennifer O'Neill got a lot better between this film and 'Summer of '42.' I think Howard Hawks was wise to write her out of the last part of this film.// Just watch the movie and decide for yourself. Truly a classic (Mar 29 2014 by bucinaus): See IMDb for review - (SPOILER ALERT) It's John Wayne (Jul 10 2020 by nenms11): A typical John Wayne film, filled with many of his friends from other movies. This isn't a spoiler good guys win. It was fun to watch for the 8th time. I'll always be a Wayne fan. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "fileSize": 432377529,
      "addedAt": "2026-01-07T00:10:30.755Z",
      "thumbnail": "https://archive.org/services/img/rio-lobo-1970-john-wayne-western-civil-war",
      "language": "eng",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 19342
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.755Z"
}