{
  "movieId": "archive-el-pobre-perez-1937",
  "title": "El Pobre Perez (1937)",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-pobre-perez-1937",
      "id": "el-pobre-perez-1937",
      "title": "El Pobre Perez (1937)",
      "description": "El pobre Pérez  es una película  argentina  dirigida por  Luis César Amadori  sobre el guion que escribiera en colaboración con  Antonio Botta  y Francisco Oyarzábal que se estrenó el 10 de febrero de 1937 y que tuvo como protagonistas a  Pepe Arias ,  Alicia Barrié ,  Orestes Caviglia ,  Margarita Corbani ,  José Gola ,  Miguel Gómez Bao ,  Lalo Malcolm ,  Tania ,  Alicia Vignoli  y  Martín Zabalúa (padre) . Es una comedia plena de enredos cómicos y sentimentales que tuvo excelentes críticas. (Wikipedia) Sinopsis El protagonista Juan Pérez, encarnado por Pepe Arias, es camarero en un lujoso local donde se realiza la despedida de soltero del personaje actuado por José Gola, quien va a casarse por conveniencia con una rica heredera (Alicia Barrié) urgido por su tío y administrador protagonizado por Orestes Caviglia. Cuando una bailarina y cantante encarnada por Alicia Vignola, con quien estaba enredado, lo persigue, usa a Pérez para sacársela de encima pero este para ayudarla la lleva a su casa y allí, tratando de esconderse cae por una ventana y se rompe una pierna. Más adelante Pérez pone un restaurante en sociedad con un amigo, contrata a la muchacha y le gira dinero haciéndole creer que lo enviaba Gola desde Europa hasta que este regresa y todo se descubre. Reparto Pepe Arias  ... Juan Pérez Alicia Barrié  ... Sara Orestes Caviglia  ... Dr. Guzmán (tío de Mario) Margarita Corbani José Gola  ... Mario Guzmán Miguel Gómez Bao  ... Rotario Lalo Malcolm  ... Hombre 1 en fiesta (amigo de Mario) Tania  ... Magnolia Alicia Vignoli  ... Lucía Medina Martín Zabalúa Juan Mangiante  ... Maitre Mario Faig  ... Hombre 2 en fiesta (amigo de Mario) Bernardo Perrone  ... Médico Arturo Arcari",
      "fileSize": 1183863018,
      "addedAt": "2026-01-07T00:08:15.379Z",
      "thumbnail": "https://archive.org/services/img/el-pobre-perez-1937",
      "language": "spa",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 56
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.379Z"
}