{
  "imdbId": "archive-MyMovie_201812",
  "title": "\"Thomas Graal's Best Film\" (1917)",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MyMovie_201812",
      "title": "\"Thomas Graal's Best Film\" (1917)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Thomas Graal's Best Film\" is a Swedish comedy starring Victor Sjöström (Seastrom), a star of Silent Hall of Fame. A screenwriter creates a play and demands that the star role be given to a particular actress. The film is a prequel to \"Thomas Graal's Best Child\" (1918), which is also a part of our Silent Gems Collection. The film is directed by Finnish-born director Mauritz Stiller, who had distinguished careers both in Sweden and in the USA, where he was recognized with a star on the Hollywood Walk of Fame for his contributions. The male star in the film Victor Sjöström was also building a successful directing career at the time, and it was in this capacity that he excelled in later years, including a stellar career in the USA.   Directed by                          Mauritz Stiller Produced by                        Swedish Biograpg Co. Scenario by                          Gustaf Molander Cinematography                Henrik Jaenzon Starring                                Victor Sjöström, Karin Molander, Albin Lavén, Jenny Tschernichin-Larsson, Axel Nilsson Release date                         August 13, 1917 Running time                       58 min. Country                                Sweden Language                              Silent, Swedish intertitles, English subtitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "id": "MyMovie_201812"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:38.753Z"
}