{
  "imdbId": "archive-les-novices-libertines",
  "title": "Les Novices libertines",
  "year": 1980,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/les-novices-libertines",
      "title": "Les Novices Libertines",
      "description": "Les Novices libertines Tourné en même temps que L'Autre enfer du même Bruno Mattei, Les Novices libertines est tiré de faits réels s'étant déroulés dans l'Italie de la Renaissance (l’histoire de la religieuse de Monza). Véritable film d'exploitation lié au genre communément appelé  « nonnesploitation » (nunsploitation), Les Novices libertines peut se targuer d'en être l'un des fleurons.  Les novices libertines propose également une vision radicale et sans concession de l’histoire de la religieuse de Monza. A découvrir pour son ambiance particulière et déviante. En Lombardie, au début du XVIIème siècle, la jeune Virginia de Leyva entre au couvent de Monza. Issue de la noblesse locale, son ambition lui permet rapidement d'accéder au rang de mère supérieure, s'attirant en contrepartie haine et jalousie, au point de devenir la cible d'un tueur. Au sein de ce couvent où des passions coupables se nouent, où des complots s'ourdissent et où le pouvoir de l'Inquisition peut se manifester à tout instant, Virginia sera-t-elle capable de lutter contre la tentation de la chair et d’empêcher que ce lieu dédié à Dieu ne devienne celui de débauches infernales ? Réalisateur : Bruno Mattei Scénariste : Claudio Fragasso Casting : Zora Kerova - Sœur Virginia de Leyva Mario Cutini - Giampaolo Osio Paola Corazzi - Sœur Candida Tom Felleghy - Franco Garofalo - Don Paolo Arrigone Annie Carol Edel - Aurelia Paola Montenero - Sœur Benedetta Mario Novelli - Molteno Ornella Picozzi - Nonne aimant l'homme aux yeux bandés Leda Simonetti - Margherita Classification : Interdit aux moins de 18 ans à sa sortie",
      "id": "les-novices-libertines"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:07:06.049Z"
}