{
  "imdbId": "archive-he-walked-by-night-1948_202405",
  "title": "He Walked By Night 1948: Film-Noir [1:18:55] BluRay",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/he-walked-by-night-1948_202405",
      "title": "He Walked By Night 1948 202405",
      "description": "He Walked by Night is a 1948 American police procedural film-noir, directed by Alfred L. Werker and an uncredited Anthony Mann. The film, shot in a semi-documentary tone, is loosely based on the real-life actions of Erwin \"Machine-Gun\" Walker, a former Glendale, California police department employee and World War II veteran who unleashed a crime spree of burglaries, robberies and shootouts in the Los Angeles area between 1945 and 1946. Roy Morgan (Richard Basehart) is a burglar who listens in to radio police calls, allowing him to stay one step ahead of the cops. After Morgan kills a police officer, Sergeants Brennan (Scott Brady) and Jones (James Cardwell) have little success in putting the clues of the case together. But when Jones is wounded in a shoot-out with Morgan, Brennan employs all facets of detective work, including forensics and informants, to find the elusive and clever criminal. During production, actor Jack Webb met the film's police technical advisor Marty Wynn and was inspired by a conversation with Wynn to create the radio program Dragnet, which later became the first modern police television drama. Goofs: A revolver ejects its spent casings only if the shooter does so manually, which Richard Baseheart didn't do, therefore the police could not have even had them to compare with the fired casings from the automatic. An even bigger blunder was the photo comparing the two fired shells, they were clearly marked .380 auto, an entirely different round than the .38 special or .45 auto that the police claimed were fired from the same gun. So now there were three different guns used to create this technical error. In addition, when Jack Webb shows his blow-up photos, all three ejector markings are in the precise same location on the cartridge head, a statistical impossibility. In fact, all three are blow-ups of one photograph. Cast: Richard Basehart as Roy Martin/Roy Morgan Scott Brady as Sgt. Marty Brennan Roy Roberts as Captain Breen Whit Bissell as Paul Reeves, electronics dealer James Cardwell as Sgt. Chuck Jones Jack Webb as Lee Whitey Byron Foulger as Freddie (uncredited) John Dehner as Assistant Bureau Chief (uncredited) Kenneth Tobey as Detective (uncredited) John McGuire as Officer Robert Rawlins (uncredited) Reed Hadley as Narrator Dorothy Adams as Paranoid Housewife (uncredited)",
      "id": "he-walked-by-night-1948_202405"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:06:08.299Z"
}