{
  "imdbId": "archive-st-louis-blues-1929",
  "title": "St. Louis Blues, 1929, Film",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/st-louis-blues-1929",
      "id": "st-louis-blues-1929",
      "title": "St. Louis Blues, 1929, Film",
      "description": "St. Louis Blues is a 1929 American negro movie film in black and white, colorized, using google colab and GitHub deoldify.  Appendix: St. Louis Blues  is a 1929 American two-reel  short film  starring  Bessie Smith . The early  sound film  features Smith in an  African-American   speakeasy  of the  prohibition  era singing the  W. C. Handy  standard, \" St. Louis Blues \". Directed by  Dudley Murphy , it is the only known film of Bessie Smith, and the soundtrack is her only recording not controlled by  Columbia Records . Bessie Smith had a hit on the song in 1925 and Handy himself asked Bessie Smith to appear in the movie. Handy co-authored the film and was the musical director. The film was a dramatization of the song, a woman left alone by her roving man. It features a band that included  James P. Johnson  on piano,  Thomas Morris  and  Joe Smith  on cornet,  Bernard Addison  on guitar and banjo, as well as the  Hall Johnson Choir  with some thrilling harmonies at the end. The film has an all  African-American  cast. Bessie Smith co-stars with Jimmy Mordecai as the boyfriend and Isabel Washington as the other woman. [1] It was filmed in June 1929 in  Astoria, Queens . [1]  The film is about 16 minutes long. In 2006, this version was selected for preservation in the United States  National Film Registry  by the  Library of Congress  as being \"culturally, historically, or aesthetically significant\". [2] [3] The film was rumored for a long time to have been banned as demeaning and to have become  lost . [1]  Neither rumor was true, but when a print was found in Mexico in the mid-1940s, the event was treated as a significant development, even though copies had, in fact, been available elsewhere. [1]  \"In 1950, a group of white liberals petitioned the NAACP to buy and destroy the print found in Mexico, which they believed to be the only copy extant.\" [1] St. Louis Blues (1929 film) - Wikipedia",
      "fileSize": 2277514702,
      "addedAt": "2026-01-07T00:11:35.627Z",
      "thumbnail": "https://archive.org/services/img/st-louis-blues-1929",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 744
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.627Z"
}