{
  "imdbId": "archive-PTBarnumSpeachToTheFuture1890",
  "title": "PT Barnum Speach To The Future 1890",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PTBarnumSpeachToTheFuture1890",
      "title": "PT Barnum Speach To The Future 1890",
      "description": "Phineas Taylor \"P. T.\" Barnum (July 5, 1810 – April 7, 1891) was an American showman and businessman remembered for promoting celebrated hoaxes and for founding the Barnum & Bailey Circus. Although Barnum was also an author, publisher, philanthropist, and for some time a politician, he said of himself, \"I am a showman by profession...and all the gilding shall make nothing else of me\", and his personal aim was \"to put money in his own coffers\". Barnum is widely, but erroneously, credited with coining the phrase \"There's a sucker born every minute\". Born in Bethel, Connecticut, Barnum became a small-business owner in his early twenties, and founded a weekly newspaper, before moving to New York City in 1834. He embarked on an entertainment career, first with a variety troupe called \"Barnum's Grand Scientific and Musical Theater\", and soon after by purchasing Scudder's American Museum, which he renamed after himself. Barnum used the museum as a platform to promote hoaxes and human curiosities such as the Feejee mermaid and General Tom Thumb.[5] In 1850 he promoted the American tour of singer Jenny Lind, paying her an unprecedented $1,000 a night for 150 nights. After economic reversals due to bad investments in the 1850s, and years of litigation and public humiliation, he used a lecture tour, mostly as a temperance speaker, to emerge from debt. His museum added America's first aquarium and expanded the wax-figure department. Barnum served two terms in the Connecticut legislature in 1865 as a Republican for Fairfield. With the ratification of the Thirteenth Amendment to the United States Constitution over slavery and African-American suffrage, Barnum spoke before the legislature and said, \"A human soul, ‘that God has created and Christ died for,’ is not to be trifled with. It may tenant the body of a Chinaman, a Turk, an Arab or a Hottentot – it is still an immortal spirit\". Elected in 1875 as Mayor of Bridgeport, Connecticut, he worked to improve the water supply, bring gas lighting to streets, and enforce liquor and prostitution laws. Barnum was instrumental in starting Bridgeport Hospital, founded in 1878, and was its first president. The circus business was the source of much of his enduring fame. He established \"P. T. Barnum's Grand Traveling Museum, Menagerie, Caravan & Hippodrome\", a traveling circus, menagerie and museum of \"freaks\", which adopted many names over the years. Barnum died in his sleep at home in 1891, and was buried in Mountain Grove Cemetery, Bridgeport, which he designed himself.",
      "fileSize": 5586431,
      "id": "PTBarnumSpeachToTheFuture1890"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.466Z"
}