{
  "movieId": "archive-der-blaue-engel-1930",
  "title": "Der Blaue Engel (1930)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/der-blaue-engel-1930",
      "id": "der-blaue-engel-1930",
      "title": "Der Blaue Engel (1930)",
      "description": "O ANJO AZUL  (  Der blaue Engel , Alemanha - 1930 ) ( Filme Completo / Legendado em Português ) Data de Lançamento:  1 de janeiro de 1930 » SOBRE O FILME: Alunos de ensino médio trocando figurinhas durante a aula. É com este cenário que começa a lenta, porém crescente, degradação da vida do professor de artes e ciência, Immanuel Rath. Quando este descobre serem as figurinhas fotos de mulheres semi-nuas conseguidas na casa de espetáculos Anjo Azul, que seus alunos frequentam, Rath vai lá tirar satisfações com os garotos, e acaba conhecendo a cantora de cabaré Lola Lola. . Tecnicamente, o filme permanece até hoje surpreendente, com uma triste fotografia em chiaroscuro, e com uma ótima utilização do som, ainda mais por ter sido feito no começo do cinema falado. A atmosfera escura e mórbida que o filme apresenta reflete, curiosamente, um momento peculiar da história alemã: a administração Weimar, logo antes da ascensão do nazismo, quando as consequências da quebra na bolsa de valores de Nova York tiveram um impacto claustrofóbico no país, deixando seis milhões de desempregados e uma inflação de 32400% ao mês. A estória de Rath reflete bem o clima de desespero e frustração da época. » » DIREÇÃO: Josef von Sternberg GÊNERO: Drama ORIGEM: Alemanha DURAÇÃO: 104 minutos » » ELENCO PRINCIPAL: Emil Jannings: Prof. Immanuel Rath Marlene Dietrich: Lola Lola Carl Balhaus: Gymnasiast Ertzum / Pupil Charles Puffy: Karl Huszar-Puffy Eduard von Winterstein: Eduard V. Winterstein",
      "fileSize": 3863987250,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/der-blaue-engel-1930",
      "language": "ger",
      "collection": "feature_films",
      "downloads": 4814
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.606Z"
}