{
  "movieId": "archive-rock-rock-rock-1956_202509",
  "title": "Rock, Rock, Rock! 1956 ★★½ Musical Drama (CC) [1:25:31] Tuesday Weld, Chuck Berry, Connie Francis",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rock-rock-rock-1956_202509",
      "id": "rock-rock-rock-1956_202509",
      "title": "Rock, Rock, Rock! 1956 ★★½ Musical Drama (CC) [1:25:31] Tuesday Weld, Chuck Berry, Connie Francis",
      "description": "Rock, Rock, Rock! is a 1956 musical drama film conceived, co-written and co-produced by Milton Subotsky and directed by Will Price. The film is an early jukebox musical featuring performances by established rock and roll singers of the era, including Chuck Berry, LaVern Baker, Teddy Randazzo, the Moonglows, the Flamingos, and the Teenagers with Frankie Lymon as lead singer. Later West Side Story cast member David Winters is also featured. Famed disc jockey Alan Freed made an appearance as himself.  Valerie Harper made her debut in a brief appearance as an extra seated at the center table during the performance of \"Ever Since I Can Remember\" by Cirino and the Bowties and can be seen after the performance of Frankie Lymon & the Teenagers. This was also Frankie Lymon & the Teenagers' film debut.  Almost every member of the cast was signed to a record label at the time, which was credited along with each star.  Plot: A young teenage girl (Tuesday Weld) desperately tries to earn enough money to buy a dress for a school rock and roll dance. This early rock and roll feature, the 3rd in a series of 5 starring Disc Jockey and Rock N Roll impresario Alan Freed, includes performances by artist Chuck Berry, La Vern Baker, Frankie Lymon and the Teenagers, The Flamingos, The Moonglows and The Johnny Burnette Trio",
      "fileSize": 1592152780,
      "addedAt": "2026-01-07T00:10:30.755Z",
      "thumbnail": "https://archive.org/services/img/rock-rock-rock-1956_202509",
      "language": "eng",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 359
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.755Z"
}