{
  "imdbId": "archive-charlie-chaplin-.-a-night-in-the-show-1915-classic-short-colourized-bw-mix",
  "title": "Charlie Chaplin . A Night In The Show (1915, Classic, Silent, Short, Colorized Film noir)",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/charlie-chaplin-.-a-night-in-the-show-1915-classic-short-colourized-bw-mix",
      "title": "Charlie Chaplin . A Night In The Show 1915 Classic Short Colourized Bw Mix",
      "description": "AKA: Charlie at the Show PLOT : Mr. Pest tries several theatre seats before winding up in front in a fight with the conductor. He is thrown out. In the lobby he pushes a fat lady into a fountain and returns to sit down by Edna. Mr. Rowdy, in the gallery, pours beer down on Mr. Pest and Edna. He attacks patrons, a harem dancer, the singers Dot and Dash, and a fire-eater. _IMDb by Ed Stephan SYNOPSIS : Charles Chaplin decides to go to the show for an evening's entertainment. He wants to see it so badly that he appears in a double role, that of a \"swell\" in evening clothes in the dress circle and a rowdy in the gallery. He visits many cafés on the way and arrives in a super-critical mood. His seat in the second row doesn't satisfy him and he moves to the front, mussing up other people on the way. The orchestra leader strikes him with his baton and a free-for-all fight is started. Chaplin is hurled into the lobby, where he bumps into a fat woman and knocks her into a fountain. Chaplin drops asleep and several snakes, from the \"charmer's\" basket, nest in his lap. He brushes them into the orchestra and the audience stampedes. In the gallery, Chaplin, the rowdy, bombards a couple of singers with ice cream and tomatoes. Chaplin, in the box, assists by besmirching the singers with the cakes a fat boy is eating. When a fire-eater makes his bow, Chaplin, the rowdy, turns the hose on him. Chaplin, the \"swell\" in the box, gets a ducking, as does most of the audience, and the show is broken up.  _IMDb by Moving Picture World Synopsis ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes . I have uploaded each movie for posterity, with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws. DEF gp ddh **",
      "id": "charlie-chaplin-.-a-night-in-the-show-1915-classic-short-colourized-bw-mix"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:23.560Z"
}