{
  "imdbId": "archive-rosaura-a-las-diez-1958",
  "title": "Rosaura A Las Diez (1958)",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rosaura-a-las-diez-1958",
      "title": "Rosaura A Las Diez (1958)",
      "description": "Rosaura a las diez  es una película argentina  dramática  y  de misterio  coescrita y dirigida por  Mario Soffici  y basada en la  novela homónima  de  Marco Denevi . Fue filmada en blanco y negro y estrenada el 6 de marzo de 1958. Fue reconocida como la  cuarta mejor película del cine argentino de todos los tiempos  en la encuesta realizada por el  Museo del Cine Pablo Ducrós Hicken  en 2000. [ 1 ] ​ En una nueva versión de la encuesta organizada en 2022 por las revistas especializadas  La vida útil ,  Taipei  y  La tierra quema , presentada en el  Festival Internacional de Cine de Mar del Plata , la película alcanzó el puesto 21. [ 2 ] ​(Wikipedia) Sinopsis La historia se estructura alrededor de los personajes que habitan en la pensión La Madrileña, que se encuentra en la  ciudad de Buenos Aires . La Sra. Milagros es la dueña de la pensión donde viven sus tres hijas, Camilo Canegato (un tímido pintor), David Réguel (un estudiante de abogacía) y la señora Eufrasia, entre otros personajes. Durante seis meses, Camilo recibe cartas misteriosas de amor de una mujer que se identifica como Rosaura. También Camilo tiene escondido en su cuarto una pintura de Rosaura que los otros descubren. Un día, una mujer joven que luce igualita a Rosaura aparece en la pensión procurando a Camilo pero cuando Camilo la ve, la trata con frialdad y David sospecha algo feo entre Camilo y Rosaura después llegar a conocer a ella. A pesar de eso, Rosaura se queda en la pensión y pronto Camilo y ella se casan. En la noche de la boda, Rosaura es encontrada muerta en el hotel donde ella y Camilo alquilaron un cuarto. La policía interroga cada personaje y dan su versión de la historia incluso a Camilo. La investigación revela que las cartas que recibió Camilo los escribieron Camilo mismo y que Rosaura en realidad, se llama Maria y es una prostituta que Camilo pagó para tener sexo años atrás. Maria solo fue a la pensión para pedir dinero a Camilo porque estaba pobre y sin hogar. Camilo usó una foto antigua para crear la pintura de Rosaura. Así que las cartas falsas y la llegada de Rosaura (Maria) fueron una conicidencia. Además, en el hotel, María se burló de Camilo y le recordó que tendrá que pagarle la pensión alimentaria si se divorcia de ella. Camilo, lleno de enojo, comenzó a estrangularla, pero no se atrevo a matarla. Corrió del hotel a la calle aturdido. En ese momento, dos hombres que querían obligar a María a ejercer la prostitución entraron al cuarto y la mataron. Esta información absuelve Camilo. Produccion Rosaura a la diez , publicada en 1955, fue la primera novela de Marco Denevi y un gran éxito de críticas y ventas. Mario Soffici se vio interesado en trasladarla al cine desde el momento en que la leyó. Sin embargo, sus intenciones eran las de crear un film diferente al texto literario, y de continuar con los elementos creativos que había incorporado en  Barrio gris . Para esto trabajó en conjunto con Denevi para desarrollar el guion, pero este no quedó contento con el resultado. Este film está formado por episodios, cada uno está narrado por diferentes personajes. Llama la atención que dentro del episodio narrado por la propietaria, pase a narrar el señor Camilo ( flashback  de por medio). Declaración de la Señora Milagros, propietaria de la hospedería  La Madrileña Declaración de David Reguel Declaración de Camilo Canegato Declaración de la señora Eufrasia Episodio de la carta Reparto Juan Verdaguer  ... Camilo Canegato Susana Campos  ... Rosaura / Marta Córrega / María Correa María Luisa Robledo  ... Doña Milagros Ramoneda, viuda de Perales Alberto Dalbes  ... David Réguel Amalia Bernabé  ... Srta. Eufrasia Morales Héctor Calcaño  ... Sr. Coretti María Concepción César  ... Matilde Nina Briand  ... Clotilde Lili Gacel  ... Elsa Beto Gianola  ... Alicio Miguel Ligero  ... Sr. Hernández Enrique Kossi  ... Policía Nelly Beltrán  ... La gorda Julián Bourges  ... Inspector Baigorri Rodolfo Crespi  ... Lustrabotas Carlos Escobares Maruja Lopetegui  ... Tía de Rosaura Onofre Lovero Milo Quesada  ... Primo/novio de Rosaura Sarita Rudoy  ... Enilde Rafael Salvatore  ... El turco Mario Savino  ... Pensionista Mario Soffici  ... Padre de Rosaura Carlos Cotto Rita Montesi  ... Pensionista buscona",
      "id": "rosaura-a-las-diez-1958"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:40.950Z"
}