{
  "imdbId": "archive-7Fires4UKitchiManitou",
  "title": "7 Fires 4 U Kitchi Manitou",
  "year": 2004,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/7Fires4UKitchiManitou",
      "title": "7 Fires 4 U Kitchi Manitou",
      "description": "B Y : D O N A L D M O R I N DVD & VHS CREATION CANADA 2004, Running Time: 88 MIN 16 sec. V.O. ORIGINAL ENGLISH DIRECTOR, PRODUCER, EDITOR, MIX RERECORDING: Donald Morin PRODUCTION, DISTRIBUTION: TLMC Creation, Edmonton, AB, T5H3K8, Tel: (780)5875212249, donaldmorin@gmail.com UBCP Performers: Gunargie O'Sullivan, Glen Gould, Mark Prior, Principal Actors: Donald Morin, Eric Schweig, James Nicholas SCREENPLAY: Donald Morin, additonal writing by Gunargie O'Sullivan DIRECTOR OF CINEMATOGRAPHY: Don Miernecki SOUND RECORDING/VIDEOGRAPHY: Darryl Bird & Many Others ORIGINAL MUSIC: Donald Morin, Jimy Sidlar, Gunargie O'Sullivan, Tippy Agogo, Late Brenda Haggard. Since the Oka Crisis that shook Canada in 1990, WILLY FRENCHEATER has traveled throughout the world looking for support for the Indigenous Resistance. He has produced a wide range of work; a video setting forth his challenges to the excesses of capitalism. He explores Aboriginals' place and identity in North America; cultural diversity, the forms resistance and the struggle for sovereignty should take. LISA BELL WALKING has devised a disconcerting sound and visual collage. A feature-length experimental film from Donald Morin, which examines the dichotomy of surveillance and resistance in Capitalist Societies and the notion of terrorism since September 11th. 2001. \"1\" 1: Above Text partially from: 2003 La Terre En Vue First Peopleâs Film and Video Festival in Montreal. 7 Fires 4 U..Kitchi Manitou was shown at the 2003 Montreal La terre en Vue Indigenous FIlm Festival, the 2002 Vancouver Imagenation Aboriginal Film and Video Festival, and as well shown as an abbreviated 45 minute version of the experimental film at the 2004 Atlanta Georgia SCMS conference of Cinema and Media Studies and at the University of Georgia School of Art and Design for one of their Post Graduate programs. He also presented his academic paper NDNS In The Age of Terror. for both US Cultural events. Lower resolutions of the finished DVD film can be found at: Isuma TV: http://www.isuma.tv/hi/en/dammedia/7-fires-4-ukitchi-manitou His MySpace Site: http://vids.myspace.com/index.cfm?fuseaction=vids.individual&videoid=50928902 Metis Filmmaker, Musician, Actor and teacher (Donald Morin) currently resides in Edmonton after 29 years in Vancouver working as a film technician, filmmaker, radio producer, performer, media artist and educator. Donald just completed Music performance work for the Alberta Aboriginal Arts Society's Rubaboo Festival, and supporting special needs children as a school bus driver. He completed principal photography for Barry J. Gillis's film The Killing Games September 2010, where he performed the role of Riel, a Metis Preacher who sang songs of the Great Spirit and prays to defend the people who were being threaten in the Horror film by evil forces. HE was also acting coach, dramaturge and 3rd AD. Some of his work, CV and resume can be found on the Isuma TV website and more of his media on his youtube site. Previous work also involved a reading of Arvus for Andrea Fox from Gordon Fox's novel Arvus Excelsus and as well work for the Alberta Aboriginal Arts Collective Rubaboo Arts Festival. He is also known for the performance of the LEAD ROLE of Eddy LaRoche in the 35mm feature film Windigo, directed by Robert Morin and his early work as a STAND-IN for Richard Crenna of the First Blood Film (82) with Sylvester Stallone. He worked again with Richard Crenna in Seattle, (94) on the NBC MOW Johnathan Stone, Threat of Innocence and many years as a modern dancer for The Karen Jamieson Dance Company. He can be contacted at info below regarding collaborations, performing work , media work or teaching contracts.",
      "id": "7Fires4UKitchiManitou"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:09.632Z"
}