{
  "imdbId": "archive-ten-gentlemen-from-west-point-1942",
  "title": "Ten Gentlemen from West Point 1942 colorized (George Montgomery)",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ten-gentlemen-from-west-point-1942",
      "id": "ten-gentlemen-from-west-point-1942",
      "title": "Ten Gentlemen from West Point 1942 colorized (George Montgomery)",
      "description": "The West Point military academy, which trained officers for the American Revolutionary War, is re-established in the early 19th century on a trial basis, prompted by the efforts of a young Washington socialite (Maureen O'Hara). The new commandant (Laird Cregar), who doesn't believe a college can produce real fighting men, is determined to enforce strict discipline on the small band of cadets, which include the socialite's fiancée (John Sutton) and a Kentucky frontiersman (George Montgomery), who compete for her affections. Many of the cadets drop out under the discouraging conditions, until only ten are left when they have to fight an Indian uprising. George Montgomery as Joe Dawson Maureen O'Hara as Carolyn Bainbridge John Sutton as Howard Shelton Laird Cregar as Maj. Sam Carter Shepperd Strudwick as Henry Clay Victor Francen as Florimond Massey Harry Davenport as Bane Ward Bond as Sgt. Scully Douglass Dumbrille as Gen. William Henry Harrison Ralph Byrd as Maloney If you have a request or a comment for me, please go to the Colorized Movies Forum at https://archive.org/details/colorized-movies?tab=forum Icolorized this to the best of my ability using the best quality black & white copy I could find, using AI software that doesn't always get the colors right, but I think it looks fairly natural. Hopefully. someday it will be remastered and a more professional colorizing job will be done.",
      "fileSize": 938494831,
      "addedAt": "2026-01-07T00:11:46.530Z",
      "thumbnail": "https://archive.org/services/img/ten-gentlemen-from-west-point-1942",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 7033
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.530Z"
}