{
  "movieId": "archive-2017TaxdeclarationLutzMommartz",
  "title": "2017 Tax Declaration Lutz Mommartz",
  "year": 2017,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/2017TaxdeclarationLutzMommartz",
      "id": "2017TaxdeclarationLutzMommartz",
      "title": "2017 Tax Declaration Lutz Mommartz",
      "description": "Dear people, I am working on a cinematic image: 'The Transparent Man'. He lives in the 22nd century and controls his tax declaration according to the new global principles. The state, distributes the funds through a process in which all people are involved. The need of time and the expansion of the consciousness of the majority allowed and required all people to be aware of their abilities and needs. This is the key to each individual, who represents a new form of justice: each according to his abilities and each according to his needs in relation to the whole. This idea was already designed in the 19th century. However, by means of the digital data collection of all human characteristics and personal differences, it could now be realized against the will of the formerly powerful ones. The fundamental rights were to be re-sorted in their importance and ranking. Equality - as inconspicuous as it is - now stands before all other fundamental rights. Since they could not be made without peace, they are far from freedom, which only takes their place behind justice. Since I would prefer to live in a world like this, I am waiting for the death of the present epoch. But the appropriate film picture to me is not yet. In 1964 I visited my sister and her husband in Nyarushanje Uganda, where he founded an agricultural farm in the development service of the church. I took his 8mm camera and turned my first film: a tablecloth, which hung on the line to dry, filling up the format. It was only when the wind blew a corner that one could see a small piece of Africa. Such a simple film I would like again. Now the son of my brother-in-law for a few years in Kampala and makes development aid for electricity from crap. Now I am still sitting in Germany in 2017 and still have to demand that our basic law be changed before it develops globally. Equality before the law can only exist if every human being is transparent in his being and action before the other people, and therefore also the state. Lutz Mommartz",
      "fileSize": 484275916,
      "addedAt": "2026-01-07T00:06:06.565Z",
      "thumbnail": "https://archive.org/services/img/2017TaxdeclarationLutzMommartz",
      "language": "eng",
      "year": 2017,
      "collection": "feature_films",
      "downloads": 8876
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.565Z"
}