{
  "imdbId": "archive-japanese-air-force-in-china-1940-rare-propaganda",
  "title": "Japanese Air Force In China (1940) Rare Propaganda",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/japanese-air-force-in-china-1940-rare-propaganda",
      "id": "japanese-air-force-in-china-1940-rare-propaganda",
      "title": "Japanese Air Force In China (1940) Rare Propaganda",
      "description": "It is a very RARE Imperial Japanese propaganda film from 1940. This film shows the Japanese Air Force in action on mainland China. It was intended to be shown to the Japanese public on the virtues of their fighting men in their crusade against the Chinese. I am sorry that there are no subtitles. I did some research and the main bomber you see here is the Mitsubishi G3M Rikko (Nell) Medium bomber. The Mitsubishi G3M \"Rikko\" (codenamed \"Nell\" by the Allies) was a frontline, twin-engine medium bomber utilized primarily by the Imperial Japanese Navy (IJN) during World War 2. She was fielded in many useful combat and non-combat roles during her operational tenure, these being centered on maritime sorties, patrol, VIP transport, conventional bombing, torpedo bombing, passenger transport (armed and unarmed) and training of aircrews and paratroopers alike. In Japanese service, the G3M served exclusively with the Imperial Japanese Navy Air Service as a land-based component and was utilized to deadly effect against American forces at Wake Island and the British battleships HMS Prince of Wales and HMS Repulse. Production was originally handled by Mitsubishi but later split to include the firms of Nakajima and Yokosuka. By 1935, the Imperial Japanese Navy had put forth a requirement for a twin-engine, land-based reconnaissance platform. Mitsubishi answered by delivering their promising Ka-15 prototype, the design credited to engineer Kiro Honjo. First flight was recorded in July of 1935 and the prototype met expectations, now being further realized as a long-range bomber platform by Japanese authorities. As such, Mitsubishi reworked portions of their prototype to deliver a revised form of which testing and trials occurred throughout 1936. Content with the results, the IJN accepted the bomber into inventory as the \"Navy Type 96 Attack Bomber Model 11\" - or, the Mitsubishi G3M1. Production was ordered in June of 1936 and operational units were delivered their new mounts later that year. Thirty-four of this initial production form - essentially preproduction service aircraft - were ultimately produced and fielded with Mitsubishi Kinsei 3 series radial engines of 910 horsepower each. By 1937, a newer, more powerful form of the Kinsei had become available. Appropriately, Mitsubishi fitted these to their G3M airframe and produced the G3M2 production model designation. The G3M2 mark would go on to become the definitive production model of the G3M series. A further improved version, the G3M3 fitting Kinsei 51 radials of 1,300 horsepower each, was revealed beginning in 1941 with deliveries handled by the Nakajima firm. As soon as the aircraft was made ready and operational, it was placed into combat actions for the IJN. G3M2 models were first utilized by the IJN Kanoya Kokutai group in August of 1937. These bombers were charged with destruction of targets in Hangchow and Kwangteh, China. After gaining ground against China, at least four squadrons of G3M2s were in service numbering some 130 aircraft in all. By the time of the Japanese surprise attack against the American port at Pearl Harbor, Hawaii, some 204 examples were in circulation despite their generally-regarded status as \"obsolete\". G3M2s were further utilized in successful upcoming actions at Wake Island, the Philippines (from bases in Formosa) and the Marianas. G3M bombers, originating from bases in Vietnam, hit Singapore City on December 8th, 1941 resulting in thousands of enemy casualties including Britains. A combined group of G4M1 \"Betty\" and G3M2 \"Nell\" bombers were responsible for the sinking of the British battleships HMS Prince of Wales and HMS Repulse on December 10th, 1941, this occurring off of the Malayan coast. These Nells operated from forward bases in Indochina and netted the first-ever recorded sinking of warships exclusively through an air strike. Additionally, on December 25th, 1941, a G3M crew successfully engaged - and subsequently shot down - a large US Navy PBY Catalina flying boat in a dogfight of \"heavies\". By 1943, the Nell has effectively run her course. The war progressed as such a pace that technology quickly outdid the impressive developments and performance stats originating in the mid-to-late 1930s. As such, surviving G3Ms were placed into second-line duties as transports for VIPs, crew trainers for bombing, pilot and navigation practice and as training platforms for Japanese paratroopers. She was officially retired in 1945 but served through to the end of the war - proving her design as nothing less than excellent.",
      "fileSize": 1634244547,
      "addedAt": "2026-01-07T00:08:54.188Z",
      "thumbnail": "https://archive.org/services/img/japanese-air-force-in-china-1940-rare-propaganda",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 1472
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.188Z"
}