{
  "imdbId": "archive-el-ocaso-de-una-vida-1950",
  "title": "EL OCASO DE UNA VIDA – (1950)",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-ocaso-de-una-vida-1950",
      "id": "el-ocaso-de-una-vida-1950",
      "title": "EL OCASO DE UNA VIDA – (1950)",
      "description": "Título original: Sunset Boulevard Estrenos: En los Estados Unidos el 10 de agosto de 1950 (Premiere en New York City, Nueva York). En México: el 22 de marzo de 1951 en el cine ALAMEDA del DF (Hoy Ciudad de México) en dónde se exhibió por tres semanas. En España se le conoce como “ El crepúsculo de los dioses ” y se estrenó hasta el 14 de febrero de 1974. Duración: 110 min. País de origen: Los Estados Unidos Dirección: Billy Wilder Guion: Charles Brackett ,  Billy Wilder ,  D.M. Marshman Jr. Fotografía: John F. Seitz  (B&W) | Música: Franz Waxman Reparto: William Holden  como Joe Gillis  (Joseph C. Gillis) Gloria Swanson  como Norma Desmond Erich von Stroheim  como Max von Mayerling Nancy Olson  como Betty Schaefer Fred Clark  como Sheldrake, productor de cine Género: Film Noir, Cine negro ,  Drama ,  Cine dentro del cine ,  Literatura ,  Vejez / Madurez ,  Nochevieja / Año nuevo ,  Película de culto , Sinopsis Joe Gillis es un joven escritor de segunda fila que, acosado por sus acreedores, se refugia casualmente en la mansión de Norma Desmond, antigua estrella del cine mudo, que vive fuera de la realidad, acompañada únicamente de su fiel criado Max. A partir de ese momento, la actriz pretende que Joe corrija un guion que ella ha escrito y que va a significar su regreso al cine. ( FILMAFFINITY ) Rodaje El rodaje de preproducción comenzó el 26 de marzo de 1949, en la morgue del condado de Los Ángeles (para la escena inicial de la película, que no formaría parte del montaje final), y continuó hasta el 16 de abril, en diferentes localizaciones (Sunset Strip, los apartamentos Alto Nido y otros lugares de Hollywood y Beverly Hills).   El 18 de abril, con el guion todavía inacabado, dio comienzo oficialmente la producción de la película. Por la mañana se rodaron escenas de Joe Gillis (William Holden) en el interior de su apartamento (reconstruido en el estudio), y por la tarde planos de la escena en que Max von Meyerling (Erich von Stroheim) recibe a Gillis a su llegada a la mansión. Swanson no empezó a rodar hasta el día siguiente. ​ El 19 de junio se dio oficialmente por terminado el rodaje; sin embargo, se reanudó poco después por la necesidad de repetir algunas tomas y rodar escenas añadidas. Volvió a darse por acabado el proceso de filmación a mediados de julio, quedando los meses de verano para el montaje. Wilder, sin embargo, no quedó del todo satisfecho con lo rodado, por lo cual hubo que volver a rodar algunas escenas más en octubre. Todavía el 5 de enero hubo que volver a rodar una de las escenas finales de Norma Desmond. ​ El presupuesto original de la película era de 1.572.000 dólares. Las demoras en la producción hicieron que dicho presupuesto se sobrepasara en unos 180.000. Exteriores La mansión de Norma Desmond no se encontraba realmente en la dirección indicada en la película, el número 10.000 de Sunset Boulevard. Su localización exacta varía según las fuentes: según Staggs, Sam, \"estaba en el 4201 de Wilshire, entre los bulevares Irving y Lorraine en el cruce con Crenshaw\", ​ mientras que otras fuentes dan como dirección correcta el 641 de Irving Boulevard, en la esquina entre los bulevares Wilshire y Crenshaw. ​ o el 3.800 de Wilshire Boulevard. La casa había sido construida entre 1919 y 1924 para William O. Jenkins, antiguo cónsul de México en Estados Unidos, pero había permanecido abandonada durante años hasta ser adquirida por el magnate del petróleo  J. Paul Getty . En el momento del rodaje, era propiedad de una exesposa de Getty, que la alquiló a la Paramount.",
      "fileSize": 4802755154,
      "addedAt": "2026-01-07T00:08:15.379Z",
      "thumbnail": "https://archive.org/services/img/el-ocaso-de-una-vida-1950",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 177
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.379Z"
}