{
  "imdbId": "archive-ben-10-feature-films-pop-up-trivia-edition",
  "title": "Ben 10 Secret of the Omnitrix + Race Against Time Pop Up Trivia Edition",
  "year": 2010,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ben-10-feature-films-pop-up-trivia-edition",
      "title": "Ben 10 Feature Films Pop Up Trivia Edition",
      "description": "A couple of days ago I posted Vol. 2 of the Ben 10 Pop-Up Trivia DVD that was exclusively made in Australia, these enhanced episodes would introduce pop-up bubbles that provided behind-the-scenes and in-universe info regarding each episode. As I said before, Vol. 2 was the last special edition DVD they would do for the original Ben 10 series; as it is reported that there are other episodes with pop-up trivia facts that have yet to resurface. In 2010, Madman Entertainment released the Ben 10 Feature Films Pop Up Power Pack, which contained Secret of the Omnitrix & Race Against Time enhanced with pop-up trivia facts. It was released a year after the first two pop-up DVDs and at the tail end of Alien Force 's run. Secret of the Omnitrix was once considered to be the series finale of the original cartoon, however, it aired several months before the final episodes of the show. Chronologically it originally takes place after the Negative 10 two-parter & before Race Against Time. The movie would introduce important characters like Azmuth & Myaxx, the always lovable Gluto, and one of Ben's most powerful aliens, Way Big. Race Against Time was the first live-action Ben 10 movie, with a 5 million-dollar budget. The movie was directed by Alex Winter aka Bill from Bill & Ted , and was written by Mitch Watson. The movie originally takes place sometime after Secret of the Omnitrix , as we see Ben back in his hometown trying to adjust to a normal life while being hunted by a mysterious new villain called Eon. Unlike SOTO, the movie is limited to 4 aliens as Alex Winter would explain:  We don't have all the aliens because it was important not to spread ourselves too thin, I didn't want to have 10-15 crummy-looking aliens. I would rather have four fantastic-looking aliens .  Race Against Time was originally canon to the Ben 10 timeframe, however, it would later be retconned in the episode Ben 10,000 Returns . It is revealed that Eon is an evil version of Ben & that the movie takes place in an alternate timeline. Later Destroy All Aliens would take RAT's place as the continuation of SOTO. The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org, are for educational purposes. I have uploaded each movie for posterity, with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws.",
      "id": "ben-10-feature-films-pop-up-trivia-edition"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:08.221Z"
}