{
  "imdbId": "archive-EtienneJulesMareyMaximeGuerinCatelainChevalOdette18951898",
  "title": "Étienne Jules Marey & Maxime Guérin Catelain Cheval ( Odette) ( 1895 1898)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/EtienneJulesMareyMaximeGuerinCatelainChevalOdette18951898",
      "id": "EtienneJulesMareyMaximeGuerinCatelainChevalOdette18951898",
      "title": "Étienne Jules Marey & Maxime Guérin Catelain Cheval ( Odette) ( 1895 1898)",
      "description": "Étienne-Jules Marey (March 5, 1830 – May 21, 1904) was a French scientist, physiologist and chronophotographer. His work was significant in the development of cardiology, physical instrumentation, aviation, cinematography and the science of laboratory photography. He is widely considered to be a pioneer of photography and an influential pioneer of the history of cinema. He was also a pioneer in establishing a variety of graphical techniques for the display and interpretation of quantitative data from physiological measurement. Marey started by studying blood circulation in the human body. Then he shifted to analyzing heart beats, respiration, muscles (myography), and movement of the body. To aid his studies he developed many instruments for precise measurements. For example, in 1859, in collaboration with the physiologist Auguste Chauveau and the watch manufacturer Breguet, he developed a wearable Sphygmograph to measure the pulse.  This sphygmograph was an improvement on an earlier and more cumbersome design by the German physiologist Karl von Vierordt.In 1869 Marey constructed a very delicate artificial insect to show how an insect flies and to demonstrate the figure-8 shape it produced during movement of its wings. Then he became fascinated by movements of air and started to study bigger flying animals, like birds. He adopted and further developed animated photography into a separate field of chronophotography in the 1880s. His revolutionary idea was to record several phases of movement on one photographic surface. In 1890 he published a substantial volume entitled Le Vol des Oiseaux (The Flight of Birds), richly illustrated with photographs, drawings, and diagrams. He also created stunningly precise sculptures of various flying birds. Marey studied other animals too. He published La Machine animale in 1873 (translated as \"Animal Mechanism\"). The English photographer Eadweard Muybridge carried out his \"Photographic Investigation\" in Palo Alto, California, to prove that Marey was right when he wrote that a galloping horse for a brief moment had all four hooves off the ground. Muybridge published his photos in 1879 and received some public attention. Marey hoped to merge anatomy and physiology. To better understand his chronophotographic images, he compared them with images of the anatomy, skeleton, joints, and muscles of the same species. Marey produced a series of drawings showing a horse trotting and galloping, first in the flesh and then as a skeleton.",
      "fileSize": 5768054,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/EtienneJulesMareyMaximeGuerinCatelainChevalOdette18951898",
      "collection": "feature_films",
      "downloads": 1007
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.398Z"
}