{
  "imdbId": "archive-de-oldify-nederland-verwoest-deel-2-1080p-s-aip-3-1945",
  "title": "The destruction of the Netherlands during WW-II in color, Part-2: The Hague (Den Haag) (1945)",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-nederland-verwoest-deel-2-1080p-s-aip-3-1945",
      "id": "de-oldify-nederland-verwoest-deel-2-1080p-s-aip-3-1945",
      "title": "The destruction of the Netherlands during WW-II in color, Part-2: The Hague (Den Haag) (1945)",
      "description": "In this part-2 of our AI enhanced and colorized series about the devastation of the Netherlands after WWII we focus on the city of The Hague (Den Haag in Dutch) and its neighboring coastal village Scheveningen. For centuries The Hague has been and still is the residence of the Dutch government, but it is not the capital of the country which is Amsterdam. On 29 May 1940, just two weeks after the Dutch captulation, The Hague became the HQ of German rule over the Netherlands under the Leadership of Reichscommissar Seyss Inquart. He took residence at the Clingendaal estate. After the war he was condemned to death during the Neurenberg trials. The Hague suffered badly from the spoils of war. Two major events can be named: 1. The destruction of a large part of the city in order to become a fortification as part of the AtlantikWall that stretched from the North of France to Norway. This defence line was 2685 km long. 2. The accidental bombing of the Bezuidenhout quarters by the RAF. 1. The Atlantikwall was built with the aim to halt a potential invasion by the allied forces. The section in The Hague also had as purpose to protect the residence of Seys Inquart that lied not far from the Dutch coast. In december 1941 the Germans started with the construction of the fortifications. However, the main part of the work was done in the autumn a year later. Approximately 138.000 people, nearly a third of the The Hague population, were forced to leave their homes which were destined to be demolished in order to construct a 27 meter wide tank ditch, bunkers and many other fortifications. Thousands of homes, three churches, a school and a hospital were demolished. Large parts of the The Hague's woods were chopped down to the ground. Most refugees were housed in other parts of The Hagua and surrounding towns and villages. About 1000 Scheveningers found residence in De Achterhoek, in the East of the country near the German border. Others spent the rest of the war in Eelde, Zuid-Laren, Culemborg and Ermelo. Dutch firms collaborated with the Germans to construct the AtlantikWall. We see many residents leaving their homes with their most important belongings. From 1943 onwards nearly all men in the age group of 17 to 40 were called up to perform compulsary labour duties in Germany, the so called Arbeidseinsatz. Soon after the German surrender on 4th of May 1945 these forced labourers started to return home. It involved approximately 270.000 men. Most of them were welcomed with open arms as seen here. However, not all experienced a warm welcome and felt that some people were treating them as collaborators and looked at with disrespect and mistrust. 2. The second major catastrophy for The Hague was the accidental bombing of the Bezuidenhout quarters. On the 3rd of March 1945, just two months before the war ended, 61 bombers (49 Mitchels and 12 Bostons) of the RAF took off from Melsbroek near Brussel and from Vitry-en-Artois in liberated Northern-France to bomb German V2 rocket launch pads in the woods of The Hague. However, due to a navigation miscalculation they dropped their bombs by mistake on this residential area. In total 550 residents died and 350 were wounded. Thousands became homeless. Many homes were lost because of the inexperience of the local firebrigade with putting out home fires of this magnitude. This statue of Juliana van Stolberg and her 5 sons, erected in 1930 can still be seen at the Koningin Marialaan. As already mentioned, Scheveningen was converted by the Germans into a fortress. The entire beach was mined and around the famous Kurhaus many concrete bunkers were constructed. This footage of the Kurhaus is very rare and will probably bring back dear memories to those who recall what the Gevers Deynoot plein and the street leading to the beach (with on the right the Sea aquarium) was like before the massive re-development changes in the 1960s. Scheveningen's prison is notorious for its roles during and after WW-II. During WW-II it served as prison for many captured Dutch resistance fighters, Engelandvaarders and secret agents. It was nick named the \"Oranje hotel\". In total in retained approximately 25.000 prisoners. Many of these prisoners did not survive as they were executed in the dunes of the nearby Waalsdorper vlakte. Immediately after the war the prison's inhabitants changed to retain high ranking German collaborators. It was here that people like NSB leader Anton Mussert, NSB-ers Robert van Genechten, Max Blokzijl en Carel Huygen as well as the Hague's NSB mayor Harmen Westra were held, awaiting their execution or sentencing. Shortly after the war Scheveningen started with the clearing of the mined beaches and the destruction of the bunkers and other fortifications. For the first time in 5 years people could start to spend nice days on the beach again. Source: Beeld En Geluid & Gemeente Archief Den Haag Music: Trevor Kowalski.",
      "fileSize": 1662840510,
      "addedAt": "2026-01-07T00:07:59.604Z",
      "thumbnail": "https://archive.org/services/img/de-oldify-nederland-verwoest-deel-2-1080p-s-aip-3-1945",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 147
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.604Z"
}