{
  "movieId": "archive-05-lile-mysterieuse-le-drapeau-noir",
  "title": "L'île Mysterieuse - 05 - Le Drapeau Noir",
  "year": 1973,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/05-lile-mysterieuse-le-drapeau-noir",
      "id": "05-lile-mysterieuse-le-drapeau-noir",
      "title": "L'île Mysterieuse - 05 - Le Drapeau Noir",
      "description": "L'Île mystérieuse L’Île mystérieuse est une mini-série italo-hispano-française en six épisodes de 52 minutes réalisée par Juan Antonio Bardem et Henri Colpi d'après le roman homonyme de Jules Verne, et diffusée à partir du 17 décembre 1973 sur la première chaîne de l'ORTF. L'Île mystérieuse raconte l'histoire de cinq personnages et un chien : l'ingénieur Cyrus Smith, son domestique Nab, le journaliste Gédéon Spilett, le marin Pencroff, l'adolescent Harbert et le chien Top. Pour échapper au siège de Richmond où ils sont retenus prisonniers par les sudistes pendant la guerre de Sécession, ils décident de fuir à l'aide d'un ballon. Pris dans un ouragan, ils échouent sur une île déserte, qu'ils baptiseront l'île Lincoln en référence au président américain Abraham Lincoln. Après avoir mené une exploration de l'île, ils s'y installent en colons et commencent à la civiliser. Une présence semble veiller sur eux et les aider dans toutes les circonstances difficiles, voire tragiques. Réalisation : Juan Antonio Bardem, Henri Colpi Scénario : Jacques Champreux et Juan Antonio Bardem, d'après le roman homonyme de Jules Verne (1875) Musique : Gianni Ferrio Générique : L'Île bleue, interprétée par Monique Pianéa sur des paroles de Christine Fontane, avec trois interventions parlées de Philippe Nicaud Omar Sharif : le capitaine Nemo Gérard Tichy : Cyrus Smith Philippe Nicaud : Gédéon Spilett Ambroise Mbia : Nab (Nabuchodonosor dit) Jess Hahn : Bonaventure Pencroff Rafael Bardem Jr. : Harbert Brown Gabriele Tinti : Ayrton Mariano Vidal Molina : Bob Harvey Rik Battaglia : Finch Voix française du colonel LaRochette (Président du Tribunal militaire de Richmond) : Jean-Pierre Darras",
      "fileSize": 742668627,
      "addedAt": "2026-01-07T00:06:00.050Z",
      "thumbnail": "https://archive.org/services/img/05-lile-mysterieuse-le-drapeau-noir",
      "language": "fre",
      "year": 1973,
      "collection": "feature_films",
      "downloads": 303
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.050Z"
}