{
  "imdbId": "archive-10-on-a-tue-le-mort.-1959",
  "title": "Les Cinq Dernières Minutes - On a tué le mort (1959)",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/10-on-a-tue-le-mort.-1959",
      "title": "Les Cinq Dernières Minutes - On a tué le mort (1959)",
      "description": "On a tué le mort (première diffusion : 10 mars 1959) Avec Raymond Souplex (l'inspecteur principal Antoine Bourrel) et Jean Daurand (l'inspecteur Dupuy) Les Cinq Dernières Minutes est une série télévisée française créée par Claude Loursais en 149 épisodes répartis sur trois générations. La première série comprend 56 épisodes, dont 51 en noir et blanc, diffusés du 1er janvier 1958 au 7 novembre 1973 sur RTF Télévision puis la Première chaîne de l'ORTF. Après une période transitoire comprenant 4 épisodes de 90 minutes, diffusés du 19 juillet 1974 au 16 janvier 1975 sur la Première chaîne de l'ORTF, une deuxième série en 72 épisodes de 90 minutes en couleurs a été diffusée de 1975 à 1992 sur Antenne 2, puis une troisième de 17 épisodes de 1992 à 1996 sur France 2. La première série a été rediffusée sur La Cinq de 1987 à 1990. C'est la première longue série d'enquêtes policières de la télévision française. Elle est fondée sur l'exposition d'une enquête où le spectateur doit, en compagnie de l'inspecteur puis commissaire Antoine Bourrel et de son adjoint Dupuy, rechercher les indices qui permettront à la fin de découvrir le coupable. L'émission intègre rapidement chaque épisode dans un milieu professionnel ou social nouveau, étranger à Bourrel : les champs de courses hippiques (L'Avoine et l'Oseille), les agences d'intérim (Meurtre par intérim), le monde de la Tour Eiffel (La Rose de fer), celui du disque (45 tours et puis s'en vont), des Halles (Un mort sur le carreau), de la halle au vin (Quand le vin est tiré), l'imprimerie de labeur, les ferrailleurs, les artisans du Village suisse, etc. À ses débuts, la série était une émission-jeu, qui, tournée en studio, était diffusée en direct. Deux téléspectateurs sélectionnés assistaient au tournage et devaient deviner qui était le coupable de l'intrigue, au moment du célèbre : « Bon Dieu ! Mais c'est… Bien sûr ! » de l'inspecteur Bourrel. Chacun des deux candidats avait le droit de se faire repasser deux scènes de son choix, que revoyaient aussi les téléspectateurs ; ce fut le cas de la fameuse séquence de l'échange de verres de champagne dans le premier épisode, diffusé pendant les fêtes, intitulé lors de sa diffusion Qui a tué Mona ?. Les magnétoscopes en 819 lignes n'existant pas, et le télécinéma représentant une dépense jugée excessive, les acteurs rejouaient aussi précisément que possible les scènes redemandées. Dans certains des premiers épisodes, l'inspecteur Bourrel prend également à témoin les téléspectateurs de son action et de ses doutes. Ce concept original fut abandonné après quelques épisodes. Distribution de la première série Raymond Souplex : l'inspecteur principal puis commissaire Antoine Bourrel (1958-1973) (à l'épisode 36 Des fleurs pour l'inspecteur) Jean Daurand : l'inspecteur Dupuy Pierre Collet : le brigadier Coulomb, planton en faction devant le bureau de Bourrel.",
      "id": "10-on-a-tue-le-mort.-1959"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:00.050Z"
}