{
  "imdbId": "archive-battle-in-outer-space-1959_202505",
  "title": "Battle In Outer Space 1959",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/battle-in-outer-space-1959_202505",
      "id": "battle-in-outer-space-1959_202505",
      "title": "Battle In Outer Space 1959",
      "description": "Battle in Outer Space  ( 宇宙大戦争 ,  Uchū Daisensō ,  lit.   ' The Great Space War ' )  is a 1959 Japanese  science fiction action film  directed by  Ishirō Honda , with special effects by  Eiji Tsuburaya . In 1965, a series of mysterious and devastating incidents are happening on Earth. These incidents range from a railroad bridge levitated off the ground causing a train wreck in Japan; an ocean liner lifted out of the  Panama Canal  by a waterspout, destroying it; severe flooding in  Venice , Italy; and the destruction of the J-SS3 space station. A  UN -connected international meeting is called at the Space Research Center in Japan. Major Ichiro Katsumiya, Professor Adachi and Dr. Richardson open the conference and describe the disasters, adding that the survivors suffered from extreme  frostbite . Dr. Richardson theorizes that some unknown force lowered the temperatures of the objects so as to lower the Earth's  gravitational pull , thus making the objects easier to lift, regardless of their size and weight. Katsumiya determines that such an action could only be accomplished by a force beyond the Earth. Dr. Ahmed, an Iranian delegate at the meeting, reacts as though suffering from a severe headache and slips away. Ahmed walks outside to a courtyard in a daze. Etsuko Shiraishi sees him and watches in horror as he is enveloped in a red light coming from the sky. Astronaut Iwamura comes in and Etsuko tells him what happened but Ahmed is nowhere to be seen. Back at the conference, it is believed that aliens might be behind the disasters and it is suggested that the Earth be prepared militarily. Dr. Ahmed appears and tries to sabotage the heat ray experiments held at the meeting. He is caught before completing his mission. He briefly takes Etsuko hostage and warns that the Earth will soon become a colony of the planet Natal. Ahmed's hand is injured and he makes a run for it. However, a Natal saucer appears near the center and vaporizes him, but forensics find a tiny  radio transmitter  that was put in him. The transmissions locate the suspect aliens on the Moon. The UN decides to launch two rocket ships, called SPIPs, to the Moon on a reconnaissance mission. En route, both ships are attacked by remotely controlled meteors called 'space torpedoes'. Iwamura, the navigator of SPIP-1, is also under mind control by the aliens. He is caught trying to disable the rocket's weapons and is tied up. Both SPIPs avoid the meteors and are given a warning by the Natal not to land on the Moon, but it is ignored. Once the rockets land on the Moon, the two teams look for the alien base in  lunar rovers . Meanwhile, Iwamura has untied himself and blown up SPIP-1. They find a cave on foot and locate the Natal base in a deep crater. Etsuko is temporarily captured by the Natal but is rescued by Katsumiya. A beam weapon battle erupts as the teams attack the base. The Natal base is destroyed, freeing Iwamura from the aliens' mind control. Feeling guilty, Iwamura stays behind to give covering fire, allowing the SPIP-2 to escape. Back on Earth, the world prepares for a final conflict against the Natal. Rocket Fighter Planes (based on the  North American X-15  experimental rocket plane) and Atomic Heat Cannons are built to counter the invasion fleet. Eventually, the Natal saucers and their mothership approach Earth. Squadrons of Scout Ships (converted into Space Fighters) are sent up into space and engage in a massive dogfight with the saucers. The Natal mothership launches Space Torpedoes that hit New York and  San Francisco . The mothership descends upon Tokyo and lays the metropolis to waste with its anti-gravity ray. The remaining saucers and mothership advance on the Space Research Center. But the Atomic Heat Cannons finally destroy the mothership and Earth is saved. The War in Space , released in Japan as  Great Planet War  ( 惑星大戦争 ,  Wakusei Daisensō ), is a  tokusatsu   science fiction   film  produced and released by  Toho Studios  in 1977. In Autumn of the year 1988, contact with Space Station Terra is lost while sightings of UFOs are being reported all over America. A follow-up investigation headed by UN scientist Professor Schmidt (William Ross) and his men is started to look into the strange reports. The space station crew manage to report to the Japanese branch of the UN Space Federation that a large \"roman galleon\" has appeared and all communication with Terra is cut. UN team member Miyoshi (Kensaku Morita) visits world-renowned Professor Takigawa ( Ryō Ikebe ) and tells him that the UN is ordering him to complete construction of the space defense unit he created, Gohten, so that they use it to fight back the invaders, but he refuses saying that the project was disbanded three years ago when there were fears of an alien invasion of Earth. Miyoshi asks him why the UN-ordered space defense unit was forcefully disbanded. He tells him that it became unimportant. Professor Takigawa then gets a call from the Japanese branch that Professor Schmidt was killed by something when he was in the mountains investigating the UFO landings. Takigawa still refuses and Miyoshi leaves. Additionally, Miyoshi is in love with Takigawa's daughter June Takigawa ( Yuko Asano ), who is engaged with fellow UN team member Muroi ( Masaya Oki ). While leaving, Miyoshi and Muroi along with Fuyuki ( Hiroshi Miyauchi ) see Professor Schmidt drive up to Takigawa's house, when he was reported dead. Takigawa lets him in and Schmidt tells him that his death was a rumor. He too tells Takigawa to complete the Gohten as soon as possible, but Takigawa recognizes that Schmidt was an imposter (the real Schmidt was left handed). Miyoshi and his friends chase after the alien Schmidt but he blows himself up before they could get him. They discover the alien was wearing a latex mask of the dead Schmidt. After hearing of the incident, the UN puts Commander Oshi ( Akihiko Hirata ) in charge of the defense forces. Takigawa is then ordered to complete construction of Gohten. It is also discovered that the aliens have set up a base on the planet  Venus . Meanwhile, the UFOs launch a full-scale attack on earth's cites, including New York City, London, Paris, Moscow, and San Francisco. While the attack was happening, the Gohten team take a submarine and makes it to the island where the spaceship is housed. One of the Gohten's crew, NASA scientist Jimmy ( David Palen ) makes it to the island but not before getting shot down by one of the many UFOs attacking the island. The Gohten is completed, however aliens infiltrate that base and try to take Takigawa away with them. Murrei, Jimmy and Miyoshi kill the aliens before they can kidnap Takigawa. They launch the Gohten to do battle with the UFOs and the space warship takes them all out with little trouble. The Gohten then heads into space towards Venus where the alien HQ is located. During the journey, Muroi asks Miyoshi to take care of June if something should happen to him. They come across the wreckage of space station Terra and Muroi goes out to investigate it. There, he finds the body of one of Terra's crew, Mikasa, which is brought abroad the Gohten, but it is discovered that Mikasa is an alien in disguise. The alien kidnaps June and escapes with her on a UFO. While the crew of the Gohten chase after the UFO they receive a message from Venus. The message is a warning from Commander Hell ( Goro Mutsumi ) the self-proclaimed Emperor of the Galaxy. He tells them that he and his race hail from the third planet of the Yomi system in the  Messier 13  nebula, 22,000 light years from the  Solar System . Takigawa then asks him why they want to take over Earth. Commander Hell tells him that their planet has died and that they need a new planet to live on. He then warns them that if they attack they will all die. The Gohten makes it to Venus and Miyoshi, Muroi and Jimmy use a small lander to find the alien spaceship. They find the enemy spaceship (later named the Daimakan) in a large cave with a force field around it. They take pictures of it, but are nearly killed by the Daimakan's lasers. Back on the Gohten, it is discovered that there is an air duct in the alien base that they can sneak into. Miyoshi, Fuyuki and several crewmen go out in the lander to get on board the Daimakan, while Muroi, Jimmy and other pilots try to destroy the spaceship's force field with their space fighters while also fending off UFOs. Jimmy sacrifices himself by destroying the force field. Miyoshi and the others sneak inside the base and suffer heavy losses. Miyoshi is successful in rescuing June, but not before battling and defeating the Space Beastman (most likely an animal from the alien homeworld). They make it back to the Gohten, but Muroi does not. The Gohten and the Daimakan go head-to-head in a mid-air showdown. Just when it seems the Gohten has the superior firepower, the Daimakan fires a large energy beam it had hidden under its frontal cannons. The Gohten becomes crippled by the energy beam and crashes on the Venusian surface. While crew members repair the ship, Takigawa goes into the ship's drill-bow. When Miyoshi and June return to the control room they find a tape recording made by Takigawa. He tells them that while building the Gohten, he discovered how to make a bomb so powerful, that it could blow up a planet. That was why he didn't want to launch the Gohten and why the aliens wanted him. He detached the drill from the Gohten with him inside and launched it into the Daimakan, causing it to crash into an active volcano. That in turn causes a chain reaction all over Venus. The rest of the Gohten, piloted by Miyoshi and June head back to Earth just before Venus is destroyed.",
      "fileSize": 1969145164,
      "addedAt": "2026-01-07T00:07:31.713Z",
      "thumbnail": "https://archive.org/services/img/battle-in-outer-space-1959_202505",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 2835
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.713Z"
}