{
  "movieId": "archive-BackStageOurGangSilent1923",
  "title": "Back Stage Our Gang Silent 1923",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BackStageOurGangSilent1923",
      "id": "BackStageOurGangSilent1923",
      "title": "Back Stage Our Gang Silent 1923",
      "description": "Plot: The gang has created a donkey-powered double-decker bus over the foundation of an old car. Ernie rides the donkey inside the conveyance and signals to Farina to open a feedbox to get the thing going. A feather duster is used to get it to sound off as the horn, and to go into reverse, a strap pulls its tail to walk backward. Whenever Farina falls asleep, Ernie turns a crack to wake him up. Mickey is the tour guide with soda-bottle binoculars, and Jackie Condon si the conductor. They drive around in it when they meet up with the head of a second-rate vaudeville touring show who encourages them to join him in his act at the Greenpoint Theater. Without even trying, the gang manages to wreck the entire show, having a good time in the process. Farina innocently wanders on stage to carry off The Great Bicepto's fake weights, and in the magic act, Jackie and Mickey's timing is off as their hands reveal objects moving magically from table to table. Farina accidentally serves water laced with liquor to the horses in one act, resulting in them moving across the stage in slow motion. The audience loves the humor, and thinks it's part of the act, but a balcony of kids accidentally lose their bug collection to the seats below, resulting in several audience members itching and scratching as the show rallies to its end. http://ourgang.wikia.com/wiki/Back_Stage",
      "fileSize": 459201165,
      "addedAt": "2026-01-07T00:06:14.038Z",
      "thumbnail": "https://archive.org/services/img/BackStageOurGangSilent1923",
      "collection": "feature_films",
      "downloads": 17041
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.038Z"
}