{
  "movieId": "archive-madness-of-the-heart-1949-faith-drama-film-noir",
  "title": "Madness Of The Heart (1949 Faith Drama Film Noir)",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/madness-of-the-heart-1949-faith-drama-film-noir",
      "id": "madness-of-the-heart-1949-faith-drama-film-noir",
      "title": "Madness Of The Heart (1949 Faith Drama Film Noir)",
      "description": "TAGLINE : The love of a man and woman is as FIRE! STORYLINE : Lydia Garth meets Paul de Vandiere, a French nobleman, but their romance is plagued by Lydia's complaint of recurring spells of blurred vision. Paul leaves for France, promising to return and marry Lydia, but she loses her sight while he is gone. Given no hope of recovery, she enters a convent, but the Abbess decides that she has no vocation for life in a nunnery. She finally marries Paul, but encounters strong opposition from Verite Faimont, a neighbour who is very fond of Paul. The latter constantly plots against Lydia and is successful in temporarily breaking up the marriage, but can a miracle of restored vision be seen? IMDb by Les Adams IMDB User Reviews (read full reviews at IMDb): 1) Splendid Margaret Lockwood thriller (May 28 2002 by calvertfan) 2) Edge-of-the-seat excitement ! (Sep 30, 2017 by JohnHowardReid) 3) Very exciting and well worth seeing . (May 24, 2020 byMartinHafer ) ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh ** * Thank you, Harvey McHugh channel ... great film! *",
      "fileSize": 472158670,
      "addedAt": "2026-01-07T00:09:46.421Z",
      "thumbnail": "https://archive.org/services/img/madness-of-the-heart-1949-faith-drama-film-noir",
      "language": "eng",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 3183
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.421Z"
}