{
  "imdbId": "archive-TakeOff10CinemaiFilm",
  "title": "Take Off 10 Cinemai Film",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TakeOff10CinemaiFilm",
      "title": "TakeOff10CinemaiFilm",
      "description": "ifilm exclusive report on Iranian film 'Take Off' Seek % buffered 00:00Current time00:00 Volume Watch ifilm exclusive report on Iranian film 'Take Off' directed by Ehsan Abdipour, starring Mostafa Zamani. Below are the highlights of the report. ifilm: ‘Take Off’ is directed by Ehsan Abdipour and we managed to catch him in the location of his new movie and ask him about his inspiration for making ‘Take Off’. Ehsan Abdipour, director: I was asked how it was formed many times. I can’t point to something specific and say that I saw this and it inspired me to make the movie. I can’t recall vividly but deep inside ... you know I’m a very calm person and I treat people nicely. I respect all. But deep inside, an aggressive creature lives within me, a sort of a monster. He’s more powerful than I am. Because it exists inside me I can’t mention a special point and say that it leads me to making the film.‌ ifilm: The film crew wasn’t supposed to be what you see now, and Ehsan Abdipour wanted to work with an amateur group, but... Abdipour: I had already chosen the cast and we began rehearsing with them but when it comes to money for making a movie, that is different from other movies, you have to choose. Considering the features, of the movie, we predict how much the movie is going to sell at the box office. Those who want to make the movie say they don’t want to follow the mainstream; they want a story which is different from the common stories in the cinema industry; not as a special film, but as a movie that we can’t guarantee how successful it will be at the box office. When it comes to the financial sponsors, the problem is how much the movie will make. They’re not businessmen and you cannot say well they are doing business and I’m making my film.‌ No, they have come and invest in a movie that not many will invest in, and my duty as a filmmaker is to return their money to them so they will sponsor such kinds of films again and again in the future. So when the issue of casting came up, at first I didn’t oppose them due to this same reason. Second, the screenplay itself was highly dependent on how it performed. I was worried that I wouldn’t be able to shoot the scenes according to the schedule and with the cast. It would be really bad. Mostafa Zamani, actor: Most of the reviews that I read are positive. Only a few of them have said that we had memorized the lines. That was the only criticism. Abdipour: You record the dialogues, listen and repeat them and then you manage to say them. It’s a burden on your shoulder but it is not impossible to do. Zamani: But I think I liked it a lot. When I saw the film I realized that I had been successful. When in some parts, I don’t know whether the audience realized them or not, they were recorded on the first four or five days of the work. It’s very difficult. I know which dialogues they are. Those from Bushehr might understand too. The critic who said that it’s obvious that I have learnt the dialect was very interesting to me. ifilm: There’s a singer acting in this movie, Amir Reza Yazdani, because one of the outstanding features of this movie is music. It’s a combination of traditional and Rock music. Abdipour: The first one, who I added to the non-famous cast without considering the opinion of the producer and production team, was Reza Yazdani. I had gone to the Eco Hall to see a play about three years ago and at the end of the play, he came and played an instrument. He played the guitar and sang a song. When I saw him, I thought to myself that he’s a very humble artist. Later I told him how I had seen him first and how much I liked him; he told me that he had gone there just for one night. He performed only one night and I saw him and I liked him. FM/AI",
      "id": "TakeOff10CinemaiFilm"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:36.218Z"
}