{
  "imdbId": "archive-nipper-runs-amok-1900",
  "title": "Nipper Runs Amok! (1900)",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nipper-runs-amok-1900",
      "title": "Nipper Runs Amok",
      "description": "Nipper runs amok!(1900) Nipper (1884 – September 1895), also known as the RCA Victor dog, was a dog from Bristol, England. Bred as a terrier mix, he served as the model for a 1898 painting by British painter Francis Barraud titled His Master's Voice. This image became one of the world's best known trademarks, the famous dog-and-gramophone pairing that was used by several record companies and their associated company brands. Biography: Nipper was born in 1884 in Bristol, England, and died in September 1895. He was likely a mixed-breed dog, although most early sources suggest that he was a Smooth Fox Terrier, or perhaps a Jack Russell Terrier,or possibly \"part Bull Terrier\".He was named Nipper because he would often \"nip\" at the backs of visitors' legs. Nipper originally lived with his owner, Mark Henry Barraud, in the Prince's Theatre where Barraud was a scenery designer. When Barraud died in 1887, his brothers Philip and Francis took care of the dog, then Francis took Nipper to Liverpool, and later to Mark's widow in Kingston upon Thames, Surrey. Nipper died of natural causes in 1895 and was buried in Kingston upon Thames at Clarence Street, in a small park surrounded by magnolia trees. As time progressed, the area was built upon, and a branch of Lloyds Bank now occupies the site. On the wall of the bank, just inside the entrance, a brass plaque commemorates the terrier that lies beneath the building. On 10 March 2010, a small road near to the dog's final resting place in Kingston upon Thames was officially named Nipper Alley in commemoration of this well-known resident. Advertising icon: In 1898, three years after Nipper's death, Francis Barraud, the brother of Nipper's original owner, painted a picture of the dog listening intently to an Edison-Bell cylinder phonograph. Thinking the Edison-Bell Company located in New Jersey, United States, might be interested in the painting, he offered it to James E. Hough, Edison-Bell's British representative, who promptly replied, \"Dogs don't listen to phonographs\". On 31 May 1899, Barraud visited the Maiden Lane offices of The Gramophone Company to inquire about borrowing a brass horn to replace the original black horn in order to brighten up the painting. When Gramophone Company founder and manager William Barry Owen was shown the painting, he suggested that if the artist painted out the cylinder machine and replaced it with a Berliner disc gramophone, he would buy the painting. Barraud obliged, and the image soon became the successful trademark of the Victor Talking Machine Company and the affiliated Gramophone Company Ltd. record labels, and eventually the Radio Corporation of America (RCA), after the acquisition of the Victor company in 1929, Electric and Musical Industries Limited in 1931, and HMV. Emile Berliner registered the trademark for use in the United States on 10 July 1900.     It is difficult to say how the idea came to me beyond the fact that it suddenly occurred to me that to have my dog listening to the phonograph, with an intelligent and rather puzzled expression, and call it 'His Master's Voice' would make an excellent subject. We had a phonograph and I often noticed how puzzled he was to make out where the voice came from. It certainly was the happiest thought I ever had.     — Francis Barraud The slogan \"His Master's Voice\", along with the painting, was sold to The Gramophone Company for £100 (equivalent to £13,667 in 2023) – half for the copyright and half for the physical painting itself. The original oil painting hung in the EMI boardroom in Hayes, Middlesex, for many years. It appears that after the image was copyrighted, two employees of the Gramophone Company, William Sinkler Darby and Theodore Bernard Birnbaum, recorded a Mutoscope in 1900 entitled 'Nipper runs amok!'. Since the real Nipper had died in 1895, another dog was used.",
      "id": "nipper-runs-amok-1900"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:07:34.662Z"
}