{
  "imdbId": "archive-the-wasp-woman-1959_202503",
  "title": "The Wasp Woman 1959 (HD) ★★½ CC: Horror/Sci-Fi [1:01:05]",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-wasp-woman-1959_202503",
      "title": "The Wasp Woman 1959 (HD) ★★½ CC: Horror/Sci-Fi [1:01:05]",
      "description": "The Wasp Woman (also known as The Bee Girl and Insect Woman) is a 1959 American independent science-fiction horror film produced and directed by Roger Corman. Filmed in black-and-white, it stars Susan Cabot, Anthony Eisley, Michael Mark, and Barboura Morris. The film was originally released by Filmgroup as a double feature with Beast from Haunted Cave. To pad out the film's running time when it was released to television two years later, a new prologue was added by director Jack Hill. Plot: Janice Starlin, the owner of a cosmetics firm, sees that her fading beauty is not only causing waves in her personal life but causing some prestige problems for her also-fading business. She becomes an easy mark for a pseudo-scientist, Eric Zinthrop, who claims to have developed a serum from the enzymes of wasps that will turn aging skin to youthful-looking skin. The second-best thing to a time machine. She, without any hesitation, agrees to be the first human to try the Zinthrop injections. But, as her beauty returns, her secretary, Mary Dennison, and her advertising executive, Bill Lane, notices she is also having a personality change and it isn't for the better, albeit she was no Miss Congeniality to begin with. Then, Zinthrop gets hit by an automobile, for plot-development purposes, and is somewhat incapacitated and not in any shape to be whipping up any new batches of Zinthrop's Wasp Enzyme Injection Serum and, without her enzyme injections, Janice turns into a wasp-like woman and meaner that a yellow-jacket hornet. Several people don't live to regret coming into contact with her, and this is not good for the business, either.",
      "id": "the-wasp-woman-1959_202503"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:33.206Z"
}