{
  "imdbId": "archive-Mommartz_Die_Windmuhle_und_Zweileinwandkino_1968",
  "title": "1968 Zweileinwandkino (Two Screen Cinema)",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mommartz_Die_Windmuhle_und_Zweileinwandkino_1968",
      "title": "Mommartz Die Windmuhle Und Zweileinwandkino",
      "description": "Space / Film installation: At a distance of about 10 m two large screens are mounted, for synchronous Vis a Vis movies like Counterpart and Left / Right The most beautiful moment of the two-screen cinema, is when it is not in operation. And now the always restless Lutz Mommartz has a new project: the windmill! Eight at specific angles to one another established projection screens are immersed by the use of eight film or slide projectors in a permanent image vortex, and above all a floating fan provides the right wind. During a demonstration of his films at the Kunsthalle Bern Lutz Mommartz wrote: \"Assuming that the moral cinema is already an anachronism, that beyond the aesthetic cinema has no immediate right to exist, so the project \"windmill\" understandstands itself in a simplified form of the two-screen cinema as a meeting place of people who indeed like to be stimulated in a certain way, but do not want to be patronized on the other hand.\" Not the assessment of a particular film or an idol is made possible, but their relativity view of the prevailing context. Consequently, no special films but more stimulating material shall be presented. The programming of the material is the actual act of design of each situation. How much the individual film looses in importance (\"I almost want to say you should not make more finished films, but using footage for specific situations or to produce certain situations\") and on the other side its presentation wins, what was recently demonstrated at a Lutz Mommartz performance at the Düsseldorf Kunsthalle: With seven projectors Lutz Mommartz shot his films through the audience. With seven film projections he created a total interior design. Here Lutz Mommartz let his \"railroad\" thunder seven times while he wildly mixed other films including negative material. Sometimes he moved the projectors, so that the images distorted or projections came over each other. At the beginning of 1968 in Kassel Documenta Lutz Mommartz launched attempts to work with two screens in the \"Cream Cheese\", that was established as a temporarly branch office during the exhibition. At a distance of ten meters he mounted two opposite screens (inbetween there was a dance floor). In every canvas he had cuted a hole (\"The destruction of the screen is important. One must have no reverence for the image.\", Lutz Mommartz quoted), behind each of which a projector was positioned to throw his picture thru the hole to the oposite canvas. (H.P. KOCHENRATH, FILM, JAN. 69)",
      "id": "Mommartz_Die_Windmuhle_und_Zweileinwandkino_1968"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:18.077Z"
}