{
  "imdbId": "archive-PreviewBruteForce",
  "title": "\"Brute Force\" (1914) director D. W. Griffith starring Robert Harron",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewBruteForce",
      "title": "\"Brute Force\" (1914) director D. W. Griffith starring Robert Harron",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Brute Force\" is a short prehistoric drama, included in our program to illustrate the work of Robert Harron and Billy Bitzer, stars of Silent Hall of Fame. The film is a sequel to \"Man's Genesis\" (1912), also directed by D. W. Griffith.  Weakhands (Robert Harron) and Lilywhite (Mae Marsh) raise a happy family when disaster strikes.  A woman-less tribe led by Bruteforce (Wilfred Lucas) assaults them in pursuit of wives.  The invaders are initially repelled, but subsequently become victorious and enslave all women. After his muscles fail, Weakhands again must use his brain.  Will he be able to produce another more powerful weapon and turn the tide?   Directed by               D. W. Griffith Produced by             Biograph Company Scenario by               D. W. Griffith and Frank E. Woods (?)         Starring                     Robert Harron, Mae Marsh, Wilfred Lucas Cinematography        Billy Bitzer Distributed by           The General Film Company, Incorporated Release date               April 25, 1914 Running time             23 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 16912803,
      "id": "PreviewBruteForce"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}