{
  "imdbId": "archive-one-a.-m.-1916-directed-by-charlie-chaplin",
  "title": "One A. M. (1916) Directed By Charlie Chaplin",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/one-a.-m.-1916-directed-by-charlie-chaplin",
      "title": "One A. M. 1916 Directed By Charlie Chaplin",
      "description": "Directed by Charlie Chaplin Edward Brewer (technical director) Written by Charlie Chaplin (scenario) Vincent Bryan (scenario) Maverick Terrell (scenario) Produced by Henry P. Caulfield Starring Charlie Chaplin Cinematography William C. Foster Roland Totheroh Edited by Charlie Chaplin Distributed by Mutual Film Corporation Release date August 7, 1916 Running time 2 reels (full length unknown) c. 34 mins. Country United States Languages Silent film English intertitles One A.M. is a unique Charlie Chaplin silent film created for Mutual Film in 1916 . It was the first film he starred in alone, and also one of the very few films in which he did not play the Tramp character. Plot The film opens with a scene of a wealthy young man (Chaplin) arriving at his house in a taxi in the morning after a night of heavy drinking. He tries in vain to grasp the handle on the outside. He thinks, \"They really need to place the handles near the door.\" When he finally does find it after some searching, he gets out, with his hand on the open taxi window. However, in his drunkenness, he thinks his hand is stuck, and tries to pull it out. \"I never did like taxis,\" he remarks. He then takes out his handkerchief, blows his nose on it, and wipes the mucus onto the taxi door, in an attempt to free his hand. However, his handkerchief falls, and Charlie, in his drunkenness, never thinks of the fact that he has to just withdraw his hand and walk from the side to retrieve his handkerchief, almost wrecks the taxi and very nearly kills himself in trying to retrieve his handkerchief the hard way. All this while, the taxi driver ( Albert Austin ) never reacts. Thanks to a big miracle (well, according to the drunk, anyway!), Charlie withdraws his hand, and headbutts the taxi door so hard he knocks himself back inside. Fortunately, though, he'd grabbed his hanky by then. This is what has been questioned by critics—how a drunk man can have better reflexes than the average sober man. He looks at the money he has to pay to the taxi driver. However, the numbers are moving fast—too fast for Charlie. He stares at it for some seconds, then looks back at the scenery, and then stares back at it again, when the numbers are still moving. He thinks the numbers have gone nuts and just puts on his top hat. He then lights up his cigar and, accidentally, burns the taxi driver's hand with the lit end. He hastily pays and decides to leave. However, he does not observe the fact that his jacket is trapped in the closed door. His hat falls off as he's jerked back towards the taxi. He almost punctures a wheel in his attempt to free the jacket, and the door, unexpectedly, opens with a jolt. Of course, he's knocked back out. He walks up to his front door. When he reaches it, however, another problem faces him. He thinks that he has forgotten the key and has to enter through the window. He knocks it out and climbs in. In the process, he steps into a fishbowl placed underneath it, and then slips on a mat. He finds his key was in his coat pocket all along, and decides to enter the \"proper\" way, that is, via the door. However, when he enters, he slips on a mat, and for 10 seconds of some heart-in-mouth slipping and standing, the door becomes Charlie's only lean-on. Of course, the door is the worst possible option for a lean-on, and Charlie pays the price. He struggles to balance, and wonders whether he's wearing skates. He finally slips when he lets go of the door, regains his balance but soon loses it, considering he has to balance against the jacket-hanger, and then slips again, landing on his jaw. He retrieves himself, and walks surprisingly steadily for a few steps, until another mat approaches him, and his legs slide out from below him, causing him to fall on his back. He lands between a tiger rug and a stuffed Eurasian lynx , which terrify him as he thinks they are real. He tries edging away from each other, only resulting in more hilarity as Charlie tries kicking the tiger rug away and then later thinks his foot is being eaten by the tiger. However, it doesn't end there. He tries to lure the lynx by giving it an air-kiss, and then walks up to it and kicks it away. That, however, ends when he proceeds onto the table. There, he tries to pour himself a drink, but his jacket accidentally gets stuck onto a hole in the table, and the table top spins around. Unaware of the jacket that is stuck on the table, he keeps chasing the drinks and never gives up. He tries swatting his hands over to the drinks, but they elude him. Charlie's willpower increases minute-by-minute, and his running gets faster as it does—and so does the table top. \"That's the fastest round of drinks I ever saw!\" he remarks when the drink keeps eluding him. By and by, Charlie tires, and stops for a second. However, he sees the drinks have stopped, too, and thinks he can get to them by just walking up to them. But alas! When he does, the table top starts spinning again, and the wild goose-chase resumes. Charlie staggers backwards, and the drinks come within his reach. However, when he tries getting them, the goose-chase resumes and Charlie continues the run. And then, of all the times, does he realize the jacket was the cause for the spinning table top. He takes it off, and walks towards the drinks, but the table keeps spinning. This is because Charlie's foot is on the jacket, and he resumes running after it. He finally falls down out of sheer exhaustion, and, lo and behold, the table top stops spinning. He looks at the drinks in wonder as they've stopped. \"What detained you?\" he asks. He takes the drink—and as fate would have it, poured it on the table. Seeing the glass still empty, he takes another glass and pours the drink on the table again. He then attempts to pour it directly onto the glass, and he found a way to mess that up as well—carelessly, he sloshed it everywhere around the floor and on his shoes. He then attempts to light a cigarette, but messes that up too. He cannot light it, and dumps it in his hat, that is, thanks to his goose-chase, on the floor, thinking of it as a dustbin, and then burns his hand with the lit end. He walks over to his hat and takes the cigar out, then dumps it on the large pool of beer he's got. \"This has been done,\" he remarks, and throws it in the hat. He takes out another cigarette from his cigar-pouch, slips on a carpet, unsuccessfully attempts to hang his hat against the peg, puts it on anyway, and then slips on another carpet, his head landing on the bottom of the stairs. He dumps his jacket and hat, and heads towards his drinks. Paranoid that he's in for another goose-chase, he leaps onto them. Of course, he gets them, pours them and chugs them. He then walks on the lynx, and thinks his leg is trapped between its legs. Of course, instead of just withdrawing his legs, he instead kicks its mouth from his left leg. As a bad element, however, his feet slide out from under him, and he lands flat on his back. Charlie Chaplin was the sole person in this movie, apart from a brief period where Albert Austin plays the taxi driver All this has drained him. \"Good night! I'm off!\" he declares, and tries to head up the stairs to his bedroom. But at the last step, he falters, losing his balance, and, of course, slides all the 13 stairs down. He tries again, and gets knocked back down, nearly slipping on the carpet. He walks up to the drinks, drinks another glass, and staggers, falling flat on his back. Cigarette in mouth, he tries again—and fails again. He proceeds to fail several times in climbing the stairs, and a large cuckoo clock on the upstairs landing also poses a problem, due to its pendulum's implausibly wide swing. He becomes increasingly creative with his attempts to climb the stairs, using mountain gear, for instance, in his next attempt. This does not go down well. The rope is not lengthy, which means Charlie can only use it for a limited length. When he reaches the top, the rope gives in, and Charlie slides down helplessly. \"If I knew how to yodel, I'd make it!\" he remarks, upon sliding down. He tries climbing again, and, miraculously, reaches upstairs. However, the pendulum knocks into his jaw, and Charlie staggers back towards the stairs—back to where he started. \"I'll try another route.\" He tries going up the second staircase, walks all the way back down, and then wonders how he got knocked down again. He climbs up the table top, and he's already run a marathon before he can gain his balance. And he's still running the marathon as he looks determinedly to his room. \"Light exercise,\" he thinks—and falls off the next minute. He tries climbing via the first staircase again, and falls all the way back down again—only this time, he drags the carpet with him. Wrapped up in this carpet, he takes another shot and then tries climbing via the jacket-hanger. It is very dangerous, and Charlie's life hangs in balance for a second, until Charlie grasps hold of the staircase and manages to get to the door of his room. Alas! The pendulum interferes again. The next thing he knows, Charlie is sliding all the way down. He re-attempts going to his room via the same route, and this time is successful. The pendulum smashes into his jaw again, but Charlie isn't knocked down the stairs, and enters like a four-legged animal into his room. He searches for his Murphy bed . Soon, the hilarity ensues again, which ends with Charlie wrecking his bed and tearing his hat. He gives up on the idea of sleeping in his bed and goes to bathroom for further inspiration. He enters the shower and, of course, in his drunken state, turns it on. He wets himself, and, soaked, he gets into the bathtub and then falls asleep under a towel. Review A reviewer for the Louisville Herald wrote, \"Chaplin, by himself, creates all the action that is necessary to produce the laughs for which he has become noted, and there is no doubt that this is the most exacting role the comedian has ever essayed.\" Miscellany Edna Purviance 's absence from the cast was a rarity. Apart from His New Job , One A.M. was the only Chaplin film from 1915 to 1923 not to feature Purviance in some role. Cast Charlie Chaplin - Drunk Albert Austin - Taxi driver Sound version In 1932, Amedee Van Beuren of Van Beuren Studios, purchased Chaplin's Mutual comedies for $10,000 each, added music by Gene Rodemich and Winston Sharples and sound effects, and re-released them through RKO Radio Pictures . Chaplin had no legal recourse to stop the RKO release. Many Chaplin fans consider this version of ‘One A.M.’ to be a brilliant combination of music and sound effects with the action. [ 1 ] References 1 SilentComedians entry Archived 2014-01-12 at the Wayback Machine",
      "id": "one-a.-m.-1916-directed-by-charlie-chaplin"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:07:34.775Z"
}