{
  "movieId": "archive-Hollywood_Without_Makeup",
  "title": "Hollywood Without Makeup",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Hollywood_Without_Makeup",
      "id": "Hollywood_Without_Makeup",
      "title": "Hollywood Without Makeup",
      "description": "A collection of behind the scenes and home movies from the golden age of Hollywood. Hosted by Ken Murray with a Special appearance by Kirk Douglas. Features footage of: Eddie Albert, June Allyson, George K. Arthur, Mary Astor, Lew Ayres, Max Baer, Lucille Ball, Richard Barthelmess, Rex Bell, Edgar Bergen, Sally Blane, Humphrey Bogart, John Boles, Pat Boone, Eddie Borden, Hobart Bosworth, Clara Bow, William Boyd, Fanny Brice, Paul Brooks, Joe E. Brown, Johnny Mack Brown, Virginia Bruce, Rory Calhoun, Leo Carrillo, Charles Chaplin, Lew Cody, William Collier Jr., Russ Columbo, Gary Cooper, Jackie Cooper, Jeanne Crain, Robert Cummings, Linda Darnell, Marion Davies, Joan Davis, Olivia de Havilland, Dolores del Rio, Cecil B. DeMille, Jack Dempsey, Walt Disney, Kirk Douglas, Marie Dressler, Irene Dunne, Josephine Dunn, Stuart Erwin, Ruth Etting, Douglas Fairbanks, Douglas Fairbanks Jr., Charles Farrell, Todd Fisher, Errol Flynn, Joan Fontaine, Glenn Ford, Clark Gable, Greta Garbo, Reginald Gardiner, Cary Grant, Alan Hale, Oliver Hardy, William Randolph Hearst, Jean Hersholt, William Holden, Bob Hope, Hedda Hopper, Walter Huston, Sam Jaffe, Van Johnson, Buck Jones, Hope Lange, Charles Laughton, Stan Laurel, Gertrude Lawrence, Mervyn LeRoy, Charles Lindbergh, Carole Lombard, William Lundigan, Fred MacMurray, Jayne Mansfield, George Marshall, Herbert Marshall, Chico Marx, Groucho Marx, Harpo Marx, Joel McCrea, Victor McLaglen, Adolphe Menjou, Mayo Methot, Marilyn Monroe, Frank Morgan, Wayne Morris, Jean Parker, Louella Parsons, Mary Pickford, Dick Powell, Tyrone Power, George Raft, Gregory Ratoff, Donna Reed, Debbie Reynolds, Buddy Rogers, Charles Ruggles, Albert Schweitzer, George Seaton, Norma Shearer, George Stevens, Lewis Stone, Margaret Sullavan, Robert Taylor, William T. Tilden, George Tobias, Spencer Tracy, Lupe Velez, Jimmy Walker, John Wayne, Johnny Weissmuller, Mae West, Claire Windsor, Robert Woolsey, Jane Wyman and others",
      "fileSize": 665137546,
      "addedAt": "2026-01-07T00:06:30.619Z",
      "thumbnail": "https://archive.org/services/img/Hollywood_Without_Makeup",
      "language": "English",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 46541
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.619Z"
}