{
  "movieId": "archive-ShockerInternetDriveIn-Week53halloweenNuclearHorrorsDoubleFeature",
  "title": "Shocker Internet Drive In - Week 53: \"Halloween Nuclear Horrors\" Double Feature",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ShockerInternetDriveIn-Week53halloweenNuclearHorrorsDoubleFeature",
      "id": "ShockerInternetDriveIn-Week53halloweenNuclearHorrorsDoubleFeature",
      "title": "Shocker Internet Drive In - Week 53: \"Halloween Nuclear Horrors\" Double Feature",
      "description": "Boooo! Well it looks as though we have survived another spooky summer here at the haunted drive in, but now - it's everyone's favorite scary time of year - Halloween! And, in an effort to be a little different, we are not presenting your traditional horror fest. We thought that this year we would bring you the horrors and fears of a bygone era - the 1950's atomic threat. First up, after the usual coming attractions, we bring you that classic school house short subject, \"Duck And Cover\" (pay attention kiddies so you too can survive a nuclear blast). Then we bring you \"Invasion USA\" an action filled cautionary tale about the good 'ol USA being taking over by those nasty commies(?). Finally, following a brief intermission featuring another atomic short, \"Target You\", we conclude our nuclear horrors with \"Unknown World\", a more traditional flick about a group of scientist who journey to the center of the Earth to escape a pending nuclear war. All in all, we promise you a hot time as long as you stand close by the microwave ovens located at the snack bar. Just don't forget to replace the speakers when you fallout. http://shockerdrivein.freeoda.com/ or http://www.shockerredirect.tk/",
      "fileSize": 3414984456,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/ShockerInternetDriveIn-Week53halloweenNuclearHorrorsDoubleFeature",
      "collection": "feature_films",
      "downloads": 8136
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.869Z"
}