{
  "imdbId": "archive-berlin-alexanderplatz-pt-iii-a-hammer-blow-to-the-head-can-injure-the-soul",
  "title": "Berlin Alexanderplatz Pt III ( A Hammer Blow To The Head Can Injure The Soul)",
  "year": 1980,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/berlin-alexanderplatz-pt-iii-a-hammer-blow-to-the-head-can-injure-the-soul",
      "title": "Berlin Alexanderplatz Pt Iii A Hammer Blow To The Head Can Injure The Soul",
      "description": "Lina is now troubled by the dubious nature of the job Franz is fulfilling. She introduces him to a family friend, Otto Lüders, who turns out to be an ex-con he knows from prison, but Franz thinks Otto is a good man. With him, Franz begins selling shoelaces door-to-door. In the first apartment, Franz spends time with a widow whose deceased husband he closely resembles. Later, to Otto, he reports having sex with the widow. The next day, Otto goes to the widow's home and expects the same, but she feels threatened and rejects him. Otto demands money and steals from her. When Franz goes back to the widow, happily expecting another tryst, she slams the door on him. Franz vanishes. Lina distraught, searches for him with Meck. They wake Otto in the early morning, but Meck recognizes that his account is full of lies and hits him. Franz is found in a flophouse by Otto, who is immediately threatened with a chair. Otto offers him a share of the money Franz realizes has been extorted from the widow, but wanting to go straight, he pours the contents of a chamber pot over Otto. Meck gets Franz's location out of Otto, but Franz had left soon after the earlier incident. Meck persuades Lina that Franz wishes to be left alone, and suggests she live with him.",
      "id": "berlin-alexanderplatz-pt-iii-a-hammer-blow-to-the-head-can-injure-the-soul"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:08.232Z"
}