{
  "imdbId": "archive-puerta-cerrada-1939",
  "title": "Puerta Cerrada (1939)",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/puerta-cerrada-1939",
      "title": "Puerta Cerrada (1939)",
      "description": "Puerta cerrada  es una película  argentina  dirigida por  John Alton  y  Luis Saslavsky  sobre el libreto escrito por este último en colaboración con  Carlos Adén  que se estrenó el 1 de febrero de 1939 y tuvo como protagonistas a  Sebastián Chiola ,  Pablo Cumo ,  Agustín Irusta ,  Libertad Lamarque ,  Ángel Magaña ,  Margarita Padín ,  Angelina Pagano ,  Ilde Pirovano  y  Elvira Quiroga . (Wikipedia) Sinopsis Nina Miranda, el personaje de Libertad Lamarque, sale después de pasar 20 años encarcelada por un asesinato que ella insiste que no cometió y rememora la época de su juventud. Recuerda al novio que eligió su amor (Agustín Irusta) pese a la amenaza de sus tías millonarias (Ilde Pirovano y Angelina Pagano) de desheredarlo si se casaba con la artista. Su vividor hermano (Sebastián Chiola), la presionaba para que siguiera actuando pero su novio era terminante: el teatro o yo, y ella acepta dejar su profesión. Ya casados, Nina se cree abandonada a raíz de un malentendido provocado por su hermano y vuelve al teatro, donde canta el tango,  La morocha , aun sabiendo que puede provocar un escándalo. Hay una pelea entre su esposo y su hermano durante la cual este último esgrime un revólver y ella por accidente mata a su esposo y es condenada porque no creen su versión. Ya libre, cuando un delincuente balea a su hijo (Ángel Magaña), que ignora que es su madre, para robarlo, ella se interpone y recibe el disparo. Su hijo la alza en brazos y ordena que se abra la puerta de la mansión familiar que siempre le estuvo cerrada y allí muere feliz. 1 ​ Reparto Participaron del filme los siguientes intérpretes: 1 ​ Sebastián Chiola  ...Antonio Pablo Cumo  ...Policía Agustín Irusta  ...Raúl Libertad Lamarque  ...Nina Miranda Ángel Magaña  ...Daniel Margarita Padín  ...Adela Angelina Pagano  ...Rosario Olmos Ilde Pirovano  ...Josefa Olmos Elvira Quiroga Marino Seré Warly Ceriani ...Dr. William Héctor Ferraro Sebastián Terranova Amelia Lamarque Lucía Barause  ...Partera José A. Paonessa Jesús Pampín Esther Bence Fausto Etchegoin Roberto Torres  ... Abogado defensor de Nina Miranda Raimundo Pastore",
      "id": "puerta-cerrada-1939"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:21.540Z"
}