{
  "imdbId": "archive-LadislasStarevichTheAntAndTheGrasshopper1911",
  "title": "Ladislas Starevich The Ant And The Grasshopper ( 1911)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LadislasStarevichTheAntAndTheGrasshopper1911",
      "title": "Ladislas Starevich The Ant And The Grasshopper ( 1911)",
      "description": "Vladislav Starevich (August 8, 1882 – February 26, 1965), was a Russian and French stop-motion animator notable as the author of the first puppet-animated film (i.e. The Beautiful Lukanida (1912)). He also used insects and other animals as protagonists of his films. His name can also be spelled Starevitch, Starewich and Starewitch. Vladislav Starewicz was born in Moscow, Russia to Polish parents(father Aleksander Starewicz from Surviliškis near K?dainiai and mother Antonina Leg?cka from Kaunas, both from \"neighbourhood nobility\", in hiding after the failed Insurrection of 1863 against the Tsarist Russian domination), and had lived in Lithuania which at that time was a part of the Russian Empire. The boy was raised by his grandmother in Kaunas, then the capital of Kaunas Governorate. He attended Gymnasium in Dorpat (today Tartu, Estonia). Starewicz had interests in a number of different areas; by 1910 he was named Director of the Museum of Natural History in Kaunas, Lithuania. There he made four short live-action documentaries for the museum. For the fifth film, Starewicz wished to record the battle of two stag beetles, but was stymied by the fact that the nocturnal creatures inevitably die whenever the stage lighting was turned on. Inspired by a viewing of Les allumettes animées [Animated Matches] (1908) by Émile Cohl, Starewicz decided to re-create the fight through stop-motion animation: by replacing the beetles' legs with wire, attached with sealing wax to their thorax, he is able to create articulated insect puppets. The result was the short film Lucanus Cervus (1910), apparently the first animated puppet film and the natal hour of Russian animation. In 1911, Starewicz moved to Moscow and began work with the film company of Aleksandr Khanzhonkov. There he made two dozen films, most of them puppet animations using dead animals. Of these, The Beautiful Leukanida (premiere - 1912), first puppet film with a plot inspired in the story of Agamenon and Menelas, earned international acclaim (one British reviewer was tricked into thinking the stars were live trained insects), while The Grasshopper and the Ant (1911) got Starewicz decorated by the czar. But the best-known film of this period, was Mest' kinematograficheskogo operatora (Revenge of the Kinematograph Cameraman, aka The Cameraman's Revenge) (1912), a cynical work about infidelity and jealousy among the insects. Some of the films made for Khanzhonkov feature live-action/animation interaction. In some cases, the live action consisted of footage of Starewicz's daughter Irina. Particularly worthy of note is Starevich's 41-minute 1913 film The Night Before Christmas, an adaptation of the Nikolai Gogol story of the same name. The 1913 film Terrible Vengeance won the Gold Medal at an international festival in Milan in 1914, being just one of five films which won awards among 1005 contestants. ",
      "id": "LadislasStarevichTheAntAndTheGrasshopper1911"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:30.622Z"
}