{
  "imdbId": "archive-the.-naked.-city.-1948.1080p.-blu-ray.x-264-mrs.lintons.husband-eng",
  "title": "The Naked City 1948 ★★★★ CC: Crime/Film-Noir [1:35:38] HD",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-naked.-city.-1948.1080p.-blu-ray.x-264-mrs.lintons.husband-eng",
      "id": "the.-naked.-city.-1948.1080p.-blu-ray.x-264-mrs.lintons.husband-eng",
      "title": "The Naked City 1948 ★★★★ CC: Crime/Film-Noir [1:35:38] HD",
      "description": "The Naked City (a.k.a. Naked City) is a 1948 American crime procedural produced by Mark Hellinger, directed by Jules Dassin, written by Albert Maltz and Malvin Wald. Starring Barry Fitzgerald, with Howard Duff, Dorothy Hart and Don Taylor. Amid a semi-documentary portrait of New York and its people, Jean Dexter, an attractive blonde model, is murdered in her apartment. Homicide detectives Dan Muldoon and Jimmy Halloran investigate and start to fill in the details of the victim's past, they find that she had a lively social life, filled with many suitors, and the mystery becomes even more complex. A friend of the victim mentions \"Mr. Henderson,\" and the police also find the actions of Frank Niles (Howard Duff) peculiar. Suspicion falls on various shifty characters who all prove to have some connection with a string of apartment burglaries. Then a burglar is found dead who once had an elusive partner named Willie. The climax is a very rapid manhunt sequence. Filmed entirely on location in New York City. Most of the street scenes were shot on location in New York without the public's knowledge. Photographer William H. Daniels and his uncredited assistant Roy Tripp filmed people on the streets using a hidden camera from the back of an old moving van. Occasionally, a fake newsstand with a hidden camera inside was also set up on the sidewalk to secretly film the actors. Director Jules Dassin hired a juggler to distract the crowds and also hired a man to occasionally climb up on a light post and give a patriotic speech, while waving an American flag to get the crowd's attention.",
      "fileSize": 2257868103,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-naked.-city.-1948.1080p.-blu-ray.x-264-mrs.lintons.husband-eng",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 1636
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}