{
  "imdbId": "archive-The_Devils_Feast",
  "title": "The Devils Feast",
  "year": 1999,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Devils_Feast",
      "title": "The Devils Feast",
      "description": "The Devils Feast is the first feature film shot on digital video to be made in the UK. It was shot in 1998 and was premiered at the Phoenix Picturehouse in Oxford on 26th November 1999. The film follows Chloe Mason is an up-and-coming conceptual artist whose controversial exhibition The Devils Feast has opened both to rave reviews and condemnation. Her work is sexual, political, provocative and blasphemous - and open to a wide range of interpretations. To some critics, she’s the new Picasso, to others her entire exhibition is a load of meaningless crap. But whether Chloe Mason is any good or not is almost immaterial. The question is: what sort of person produces work like this? Through a series of flashbacks, we learn about Chloe and the series of events that have led up to The Devils Feast. We also meet the characters whose lives interact with Chloe, inspiring her artistic output. There’s her best friend, Janet, a single mother who is constantly searching for the right man in all the wrong places, and Sticks, the idealistic editor of a local anarchist magazine who becomes Chloe’s boyfriend. And then there’s Paul the leader of a mysterious religious cult: just what is he up to? Like the exhibition of the title, The Devils Feast tackles head-on such weighty topics as religion, sex and politics, throwing in drugs and violence for good measure. And like Chloe Mason’s work, audiences can interpret this film in different ways: is it a psychological drama or a black comedy? The Devils Feast has an anarchic energy always keeps the viewer guessing! With its complex, multi-stranded story structure, an improvised script, and a gritty realism achieved through the use of hand-held cameras, The Devils Feast straddles the rarely explored middle-ground between Ken Loach and Quentin Tarantino. http://go.to/devilsfeast",
      "fileSize": 1610165942,
      "id": "The_Devils_Feast"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}