{
  "imdbId": "archive-project-kill-1976",
  "title": "Project: Kill 1976 Action/Crime ★★½ [1:29:10] Leslie Nielsen, Gary Lockwood",
  "year": 1976,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/project-kill-1976",
      "id": "project-kill-1976",
      "title": "Project: Kill 1976 Action/Crime ★★½ [1:29:10] Leslie Nielsen, Gary Lockwood",
      "description": "Project: Kill is a 1976 American action film directed by William Girdler and starring Leslie Nielsen before he began doing comedies. John Trevor (Leslie Nielsen) escapes from the military base where he commanded Project: Kill, a mind control experiment that used drugs to create bodyguards and assassins for the United States and makes his way to the Philippines. Soon Trevor finds himself in love with Lee Su and feeling the withdrawal symptoms from the drugs for the mind control that makes him very dangerous not only to himself but everyone around him. His former second in command Project: Kill agent Frank Lassiter (Gary Lockwood) has been ordered to find him before the with drawl effects become too violent and before he sells out the program. Asian mobster Alok Lee is also after Trevor in the hopes of getting the secrets of Project: Kill. Time is running out for Trevor as the with drawl becomes worse, Lassiter, the Philippine police, and Lee's men close in on him. Cast: Leslie Nielsen as John Trevor Gary Lockwood as Frank Lassiter Nancy Kwan as Lee Su Vic Silayan as Chief Insp. Cruz Vic Diaz as Alok Lee Galen Thompson as Carl Wagner Maurice Downs as Hook Pamela Parsons as Lynn Walker Carlos Salazar as Insp. Ortiz Franco Zarrate as Lung Set Leslie Nielsen's career began in dramatic roles on television during \"Television's Golden Age\", appearing in 46 live programs in 1950 alone. He said there \"was very little gold, we only got $75 or $100 per show\". He narrated documentaries and commercials and most of his early work as a dramatic actor was uneventful. Hal Erickson of Allmovie noted that \"much of Nielsen's early work was undistinguished; he was merely a handsome leading man in an industry overstocked with handsome leading men\". In 1956, he made his feature-film debut in the Michael Curtiz-directed musical film The Vagabond King. Though the film was not a success, producer Nicholas Nayfack offered him an audition for the science-fiction film Forbidden Planet, resulting in Nielsen's taking a long contract with Metro-Goldwyn-Mayer (MGM).  His television appearances include Justice, Alfred Hitchcock Presents, Voyage to the Bottom of the Sea, Wagon Train, Gunsmoke, The Virginian, and The Wild Wild West. In 1961, he was the lead in a Los Angeles police drama called The New Breed. He guest-starred in a 1964 episode of Daniel Boone with Fess Parker in a minor but credited role. In 1968, he had a major role in the pilot for the police series Hawaii Five-O, and appeared in one of the seventh-season episodes. In 1969, he had the leading role as a police officer in The Bold Ones: The Protectors. In an early comedic appearance, Nielsen appeared on M*A*S*H in 1973 as the title character in \"The Ringbanger\". Nielsen's supporting role of Dr. Rumack in Zucker, Abrahams, and Zucker's 1980's Airplane! was a turning point in his career. The film, a parody of disaster films such as Zero Hour! and Airport, was based on building a comedy around actors known for dramatic roles. Other stars included Robert Stack, Peter Graves, and Lloyd Bridges. Nielsen's deadpan delivery contrasted with the absurdity surrounding him. When asked, \"Surely you can't be serious?\", he responded with a curt, \"I am serious. And don't call me Shirley.\" In several interviews, he reflected on the line: \"I thought it was amusing, but it never occurred to me that it was going to become a trademark. It's such a surprise ... the thing comes out, people say, 'What did he say?!'.\" Nielsen said he was \"pleased and honoured that [he] had a chance to deliver that line\". The American Film Institute included the film in its list of the top-10 comedy films of all time in 2008, and a 2007 survey in the United Kingdom judged it the second-greatest comedy film of all time after Monty Python's Life of Brian. In 2012, Empire voted it number one in the 50 Funniest Comedies Ever poll. Critics praised the film, which also proved a long-term success with audiences. In 2010, Airplane! was selected for preservation in the National Film Registry by the Library of Congress. Nielsen appeared in more than 100 films and 1,500 television episodes, portraying more than 220 characters. From at least the early 1970s, he was a television commercial spokesperson for the Bank of Montreal, Ford, Shell and Dollar Rent-A-Car, among many others; his earlier spots took advantage of his serious and authoritative persona, while later commercials were more humorous, mirroring his transition to comedic acting roles. In November 2010, Nielsen was admitted to Holy Cross Hospital, Fort Lauderdale, Florida, with pneumonia. On November 28, 2010, 84-year-old Nielsen had died in his sleep from pneumonia surrounded by family and friends. As a final bit of humour, Nielsen chose \"Let 'er rip\" as his epitaph. On  December 7 2010, Nielsen's funeral was held in Fort Lauderdale, during which the Naked Gun theme was played.",
      "fileSize": 862666984,
      "addedAt": "2026-01-07T00:10:21.539Z",
      "thumbnail": "https://archive.org/services/img/project-kill-1976",
      "language": "eng",
      "year": 1976,
      "collection": "feature_films",
      "downloads": 520
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.539Z"
}