{
  "movieId": "archive-the-bigamist-1953_202406",
  "title": "The Bigamist 1953 ★★★½ CC: Drama/Film-Noir [1:19:31] Joan Fontaine , Edmond O'Brien, Ida Lupino",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-bigamist-1953_202406",
      "id": "the-bigamist-1953_202406",
      "title": "The Bigamist 1953 ★★★½ CC: Drama/Film-Noir [1:19:31] Joan Fontaine , Edmond O'Brien, Ida Lupino",
      "description": "The Bigamist is a 1953 American drama film noir directed by Ida Lupino starring Joan Fontaine, Ida Lupino, Edmund Gwenn and Edmond O'Brien. Producer/Screenwriter Collier Young was married to Fontaine at the time and had previously been married to Lupino. The Bigamist has been cited as the first American feature film made in the sound era in which the female star of a film directed herself. San Francisco businessman Harry Graham (Edmond O'Brien) and his wife and business partner, Eve (Joan Fontaine), are in the process of adopting a child. When private investigator Jordan (Edmund Gwenn) uncovers the fact that Graham has another wife, Phyllis (Ida Lupino), and a small child in Los Angeles, he confesses everything. In flashback, Graham tells of the strains in his marriage with Eve and how he found himself falling for the kind-hearted waitress Phyllis while on a business trip. Cast: Joan Fontaine as Eve Graham Ida Lupino as Phyllis Martin Edmund Gwenn as Mr. Jordan Edmond O'Brien as Harry Graham / Harrison Graham Kenneth Tobey as Tom Morgan, Defense Attorney Jane Darwell as Mrs. Connelley Peggy Maley as Phone Operator Lilian Fontaine as Miss Higgins, Landlady Soundtracks: It Wasn't the Stars That Thrilled Me Written by Matt Dennis and Dave Gillam Performed by Matt Dennis (uncredited)",
      "fileSize": 1425125271,
      "addedAt": "2026-01-07T00:11:46.533Z",
      "thumbnail": "https://archive.org/services/img/the-bigamist-1953_202406",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 854
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}