{
  "imdbId": "archive-de-oldify-the-history-of-ukraine-in-the-first-half-of-the-20th-century-2-alles-1080p-s",
  "title": "Life in turbulent Ukraine between 1900 and 1950 in color! [A.I. enhanced & colorized]",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-the-history-of-ukraine-in-the-first-half-of-the-20th-century-2-alles-1080p-s",
      "title": "Life in turbulent Ukraine between 1900 and 1950 in color! [A.I. enhanced & colorized]",
      "description": "This film gives a glimpse into what life was like in Ukraine in the first half of the 20th century, to be precise between 1917 and 1954. By no means does it provide a profound historic analysis of how the state of Ukraine came into existence, especially considering that it is impossible to capture this in just a few sentences. What can be summarized is that the emergence of Ukraine was the direct result of the Russian revolution in 1917 which lead to the formation of the Peoples Republic of Ukraine followed by a four year struggle for indepence that ended with the formation of the Soviet Union in 1922. In 1921 the East of Ukraine fell into the hands of the Russian Red Army and in 1922 Ukraine became the Ukraïnean Socialistic Sovjet Republic. The Soviet Union stretched from the Baltic sea in the West to the Sea of Japan in the East and from the Arctic Ocean in the North to the Black Sea and Caspian Sea in the South, covering an area about 4 times the size of the United States. Many peoples were part of the Soviet Union: in the South West the inhabibants of Little Russia otherwise called the Ukraineans, The Moldovans and besarabians in Moldavia, slightly more to the East the Armenians and the Georgians, the Ingush, the Cherkas, the Caucasians in their mountanous territory, further East, the Uzbeks and Turkmen, the Kirgizians, in the South East the Mongolians who border China, Basjkiers and Turko Tartarians in the South, Oeriacs, The Jacus in the North far behind the Oeral mountains, people from the ice regions like Zhang hunters, Nomads like the people from Lapland and not to forget the Kozaks that live in the central part of Ukraine. People that live in the large cities like Saint Petersburg and Moscow, where the old civilisation meets with the new and for example the Troyka has to compete with the motorcar. All over the Ukraine and in the USSR people go about their daily lives, either as factory workers, soldiers, masons, policemen, sailors, metal workers, school children, farmers, nurses, engineers, window cleaners, sales people, house wives or postoffice employees, radio commentators or stewardesses, scientists or typists, musicians or ballet dancers, Whatever their profession and daily occupation, all they have in common is the love for their place of birth. The Ukraine is a country that is rich in natural resources. In the mountains are rich gold and silver veins. Other metals like copper, tin, manganese, nickle, chromium and radium are plentiful in under ground mines. Ukraine was and is an important supplier of wood and coal. Natural gas and oil are also important contributors to the economy as well as iron and steel. But Ukraine's most important role is to serve as a major source of food for the whole world. Its vast plains are extremely fertile and thus millions of farmers produce wheat, sunflower oil and other agricultural produce. Cotton is another produce of Ukraine as well as some tobacco, although on a small scale. Sugar is also produced and exported. But the most important produce is wheat. The fields of wheat extend as far as the eye can reach. Already in the 1930s the Ukraine was the bread basket for Russia and many other parts of the World. In all Ukraine has supplied around 10% of the World's best quality wheat. Not only wheat is produced but also oats, rye, hops and much more. Under the Sovjet Union Ukraine experienced many turbulent periods. WW-I was almost immediately followed by the Polish-Ukrainean War that lasted from November 1918 till juli 1919. In this period Cities like Lviv fell under Polish rule. After Jozeph Stalin came to power following Lenin's death in 1924, Ukraine underwent important industrial developments. From 1932 to 1933 a terrible manmade famine, called the Holodomor, caused between 5 and 10 million Ukraineans, one fifth of all Ukrainean farmers, to die of starvation. It was the result of a forced collectivization of agricultural companies. In 1939 also the Western part of the Ukraine came under Sovjet control. Two years later, in 1941, the Germans started their attacks on the Sovjet Union. They proceeded to large-scale to persecute of the Jews and the recruitment of 'Ostarbeiter'. Ukraine lost a sixth of its population. After World War II, from 1945 onwards, Ukraine developed into one of the most important and prosperous Soviet Socialist Republics. To close off this brief impression of the Ukraine in the first half of the 20th century, it is worth observing that in 1954, during the reign of Stalin's successor Nikita Khrushchev, the Crimea was handed over to the Ukrainian Soviet Socialist Republic as a gesture of friendship between the Russian and Ukrainian peoples. This film is only submitted for informational historic purposes and not intended to enable discussion of the current conflict between Russia and Ukraine. Music: Ukraine National Anthem & national folk songs. Source: Beeld & Geluid and archive.org E-mail: ricksfilmrestoration@gmail.com",
      "fileSize": 1055042296,
      "id": "de-oldify-the-history-of-ukraine-in-the-first-half-of-the-20th-century-2-alles-1080p-s"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.605Z"
}