{
  "movieId": "archive-the-upturned-glass",
  "title": "The Upturned Glass 1947★★★½ CC: Film noir/Psychological Thriller [1:22:52]",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-upturned-glass",
      "id": "the-upturned-glass",
      "title": "The Upturned Glass 1947★★★½ CC: Film noir/Psychological Thriller [1:22:52]",
      "description": "The Upturned Glass is a 1947 British film noir psychological thriller directed by Lawrence Huntington and starring James Mason, Rosamund John and Pamela Kellino. Plot: A prominent neurosurgeon relates to his students in medical school a story about an affair he had with a married woman and how, after the affair was over, the woman one day fell out a window and died. The surgeon, suspecting that she was murdered, set out to find her killer--but, instead of turning the suspect over to the police, he planned to take his own revenge on the murderer. Cast: James Mason as Michael Joyce Rosamund John as Emma Wright Pamela Kellino as Kate Howard Ann Stephens as Ann Wright Morland Graham as Clay Brefni O'Rorke as Dr. Farrell Henry Oscar as coroner Jane Hylton as Miss Marsh Sheila Huntington as 1st girl student Susan Shaw as 2nd girl student Peter Cotes as male student Nuna Davey as Mrs. Deva Judith Carol as Joan Scott-Trotter Jno. P. Monaghan as U.S. driver Maurice Denham as mobile policeman Janet Burnell as Sylvia Margaret Withers as party guest Beatrice Varley as injured girl's mother Hélène Burls as farm labourer's wife Howard Douglas as lorry driver Richard Afton as lorry driver 's Mate Lyn Evans as county policeman Directed by Lawrence Huntington Written by Pamela Kellino, Jno. P. Monaghan Produced by Betty E. Box, Sydney Box & James Mason Cinematography Reginald H. Wyer Edited by Alan Osbiston Music by Bernard Stevens",
      "fileSize": 2575061041,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-upturned-glass",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 607
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}