{
  "imdbId": "archive-le-testament-dorphee-jean-cocteau-1960",
  "title": "Le Testament d'Orphée ☆ Jean Cocteau ☆ 1960",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/le-testament-dorphee-jean-cocteau-1960",
      "title": "Le Testament d'Orphée ☆ Jean Cocteau ☆ 1960",
      "description": "Le Testament d'Orphée ☆ Jean Cocteau ☆ 1960 Le Testament d’Orphée ou ne me demandez pas pourquoi est un film français réalisé par Jean Cocteau en 1959 et sorti en 1960. Synopsis Le film narre la mort et la résurrection du poète. Frappé par une balle, Jean Cocteau rebondit dans un autre temps. Vie et mort, présent et avenir, créatures mythologiques et imaginaires, angoisses et fantasmes se mêlent sans ordre chronologique pour composer le testament du poète-cinéaste. Jean Cocteau y tient le rôle principal. Résumé En préambule, pendant qu’une craie magique dessine sur un tableau noir le visage du poète Orphée , on entend la voix de Jean Cocteau déclarer : « le privilège du cinématographe, c'est qu'il permet à un grand nombre de personnes de rêver ensemble le même rêve et de montrer en outre, avec la rigueur du réalisme, les fantasmes de l'irréalité, bref c'est un admirable véhicule de poésie. Mon film n'est pas autre chose qu'une séance de strip-tease consistant à ôter peu à peu mon corps et à montrer mon âme toute nue. Car il existe un considérable public de l'ombre, affamé de ce plus vrai que le vrai qui sera un jour le signe de notre époque. Voici le legs d'un poète aux jeunesses successives qui l'ont toujours soutenu ». Venu d'un autre temps, le poète apparaît en costume du XVIII e  siècle à un écolier de treize ans assis à son pupitre, stupéfait par cette vision, puis à une femme effrayée qui laisse tomber le bébé qu'elle tient dans ses bras. « Ce fut ma deuxième rencontre avec un personnage dont je venais d'embrouiller l'existence contre toute logique », affirme le poète qui croise ensuite une infirmière poussant le fauteuil roulant d’un vieux professeur infirme, rendu sourd par une chute dans sa petite enfance. Le vieillard meurt et laisse tomber une boîte dont s'empare le poète, heureux de la détenir enfin car elle va lui rendre grand service. Le poète se présente une quatrième fois au professeur, âgé cette fois-ci d'une cinquantaine d'années. Le savant se souvint d’avoir été effrayé, enfant, par cette apparition dont il aimerait comprendre le sens. Le poète lui déclare : « professeur, vous êtes sans doute la seule personne au monde capable de ne pas chercher à comprendre et capable aussi de comprendre l'incompréhensible ». Il est une sorte de voyageur perdu dans l'espace-temps, qui vient de l’année 1770. Le poète remet au professeur la boîte de son invention future : elle contient des balles de revolver capables d’anéantir le temps. Frappé par une balle tirée à sa demande par le professeur, le poète tombe puis rebondit à notre époque, en 1959. Vêtu désormais d'un habit moderne, il tente désespérément de regagner son époque. Il croise un homme à tête de cheval qui le conduit dans une « zone intermédiaire » intemporelle, dans un campement de gitans. Il ne s’y attarde pas et part retrouver ses propres créations. Il rencontre le jeune poète Cégeste, revenu à la vie, qui lui remet une fleur immortelle d’ hibiscus et l’invite à le suivre. Il comparaît devant un tribunal composé de la belle et lointaine Princesse et de son serviteur Heurtebise. Accusé du crime d'innocence, il se défend de son mieux et est condamné à la « peine de vie ». Accompagné de Cégeste, le poète reprend la route, à la recherche de la déesse grecque de la sagesse Pallas- Athéna ( Minerve pour les romains). En chemin, il croise tour à tour une dame qui, s’étant trompée d’époque, lit un livre qui ne paraîtra que dans 70 ans ; Iseut , qui cherche à rejoindre Tristan  ; puis son propre double, qui va d’où il vient et vice-versa. Cégeste disparaît, laissant seul le poète explorer la \"zone intermédiaire\" où vivent les symboles et personnages qui le hantent, issus de son imagination. Enfin, le poète arrive au palais en ruines de Pallas-Athéna. Un huissier en habit le fait longuement patienter puis le conduit à la déesse, à laquelle il désire offrir son hibiscus. Mais elle le transperce de sa lance et le fait déposer au sol par deux hommes à tête de cheval. La troupe de gitans le pleure en chantant. Il commente : « faites semblant de pleurer, mes amis, puisque les poètes font semblant d’être morts ». Il se relève avec les yeux grands ouverts de l'initié. Dédaignant la tentation du sphinx ailé aux seins nus, croisant sans le voir Œdipe aveugle s'appuyant sur sa fille Antigone , il chemine dans la campagne ensoleillée. Deux policiers à moto l’arrêtent pour vérifier son identité. Cégeste surgit ; affirmant que la terre n’est pas sa patrie, il le fait disparaître devant les policiers stupéfaits. La carte d'identité du poète se transforme en fleur d'hibiscus. Distribution Jean Cocteau  : le poète Jean Cocteau/ Orphée Jean Marais  : Œdipe Maria Casarès  : la princesse François Périer  : Heurtebise Édouard Dermit  : Cégeste Et par ordre alphabétique : Claudine Auger  : Minerve Charles Aznavour  : le curieux Lucia Bosè  : une amie d’Orphée Yul Brynner  : l’huissier des enfers Françoise Christophe  : l’infirmière Gérard Chatelain  : l'amoureux Michèle Comte : la petite fille Nicole Courcel  : la mère maladroite Henri Crémieux  : le professeur Luis Miguel Dominguín  : un ami d'Orphée Guy Dute  ; un homme-chien Daniel Gélin  : l’interne Philippe Juzau  : un homme-cheval Jean-Pierre Léaud  : Dargelos, l'écolier Michèle Lemoigne  : l'amoureuse Serge Lifar  : un ami d'Orphée Daniel Moosmann  : un homme-cheval Brigitte Morisan  : Antigone Pablo Picasso  : un ami d'Orphée Jacqueline Roque  : une amie d'Orphée Françoise Sagan  : une amie d'Orphée Alice Sapritch  : la reine des gitanes Henri Torrès  : le speaker Annette Vadim / Roger Vadim : des amis d’Orphée Francine Weisweiller  : la dame qui s'est trompée d'époque Marie-Josèphe Yoyotte  : une gitane Production Tournage Période prises de vue : du 7 septembre à novembre 1959 . Intérieurs : studios de la Victorine ( Nice ), studios Francœur (Paris). Extérieurs : Alpes-Maritimes  : Saint-Jean-Cap-Ferrat (certaines scènes ont pour décor la villa Santo Sospir dont les murs sont peints de fresques par Jean Cocteau), Villefranche-sur-Mer (on aperçoit dans une scène la façade de la chapelle Saint-Pierre décorée par Cocteau et une autre scène a été tournée sous les voutes de la rue Obscure où l'on voit Cocteau s'appuyant sur un angle de mur). Bouches-du-Rhône  : Les Baux-de-Provence (tournage facilité grâce à François Truffaut , notamment pour les scènes dans les sites du Val d'Enfer et des Carrières de Lumières ). Jean Cocteau accepta qu’une équipe radiophonique, conduite par Roger Pillaudin , suive le tournage du film. Des gitans installés près des Baux de Provence sont appelés à participer au tournage du film. Parmi eux, le guitariste Manitas de Plata qui deviendra ensuite immensément connu 3 . Musique Musiques additionnelles : Christoph Willibald Gluck , Georg Friedrich Haendel , Johann Sebastian Bach (BWV 1067, Menuet et Badinerie ), Richard Wagner . Accueil et commentaires « Ce film est beau parce que c'est le film d'un homme qui sait qu'il va mourir et qui ne parvient pas, quelque désir qu'il en ait, à prendre la mort au sérieux. » ( Cahiers du cinéma ). C'est en premier lieu le testament de Cocteau puisque, jouant lui-même son propre rôle, le poète se promène dans le film et à travers le temps où il retrouve ses propres créations dont les personnages de son film Orphée ( 1950 ) : le jeune poète Cégeste ( Édouard Dermit ), la Princesse ( Maria Casarès ), le fidèle Heurtebise ( François Périer ). Dans sa biographie sur l’acteur Marais, Carole Weisweiller (fille de Francine Weisweiller ) raconte que Cocteau avait demandé à Jean Marais de jouer Œdipe. Celui-ci, vêtu de sa toge blanche tachée de sang, le visage douloureux avec des yeux crevés peints sur des paupières, remuant doucement les lèvres comme le lui avait demandé Cocteau, avançant lentement sur un chemin de pierres, un lourd bâton à la main en guise de canne et s’appuyant sur sa fille Antigone, croisait le poète qui s’éloignait sans le voir. « Ce qu’on a tant voulu voir, quand cela arrive enfin, on ne le voit plus », expliquait Cocteau à des journalistes venus l’interroger sur la signification de cette scène. Christian Soleil, dans sa biographie sur Marais, révèle qu’à sa sortie à Paris en février 1960, Le Testament d’Orphée reçut de la presse critique des louanges, encensements, admirations, le plaçant d’emblée au Panthéon du cinéma français. Mais le public ne fut guère au rendez-vous, sans doute à cause du caractère très étrange du film, de sa construction décousue mais en réalité cousue comme un rêve, que les spectateurs ordinaires pouvaient considérer comme l’hermétisme de l’univers de Cocteau. « Ils ont en fait du mal à admettre qu’il ne faut pas chercher un sens derrière chaque signe, trouver une symbolique derrière chaque objet et chaque geste, mais simplement admettre les choses comme elles sont, à la manière des enfants dont Cocteau veut nous faire retrouver l’âme. » Tourné en noir et blanc, le film montre, au moment où le poète est transpercé par la lance de la déesse, la fleur d’hibiscus et la tache de sang de couleur rouge, signifiant l’immortalité du poète. Titre original: Le Testament d'Orphée ou ne me demandez pas pourquoi ! Réalisation: Jean Cocteau Scénario: Jean Cocteau Acteurs principaux: Jean Cocteau, Jean Marais, Maria Casarès, François Périer, Édouard Dermit Sociétés de production: Les Éditions Cinégraphiques Pays de production: France Genre: Film biographique, Manifeste poétique Durée: 81 minutes Sortie: 1960 Note : Afin que vous puissiez lui exprimer votre infinie gratitude pour ses années de bénévolat, l’archiviste Dionysus Vorax  a mis à votre disposition un lien fort pratique.:  Paypal  ~  Donate  ~  Don en €, $ ou £  …",
      "fileSize": 1141485560,
      "id": "le-testament-dorphee-jean-cocteau-1960"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.889Z"
}