{
  "imdbId": "archive-esperame-mucho-1983",
  "title": "Esperame Mucho (1983)",
  "year": 1983,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/esperame-mucho-1983",
      "id": "esperame-mucho-1983",
      "title": "Esperame Mucho (1983)",
      "description": "Espérame mucho  es una película de  Argentina  dirigida por  Juan José Jusid  sobre su propio guion escrito en colaboración con  Isidoro Blaisten  que se estrenó el 11 de agosto de 1983 y tuvo como protagonistas a  Víctor Laplace ,  Alicia Bruzzo ,  Arturo Bonín ,  Alberto Segado  y  Villanueva Cosse .(Wikipedia) Sinopsis Juan José Jusid realizó este filme, con una fuerte carga autobiográfica, en 1983. El realizador es quien relata, en voz over y en primera persona, las peripecias de un niño de once años, Juancito (Federico Olivera), durante los primeros años cincuenta en la ciudad de Buenos Aires. El filme contiene alusiones tanto a las contingencias políticas de la época como al descubrimiento de la sexualidad por el protagonista. [ 1 ] ​ Produccion Jusid presentó su guion el 2 de abril de 1982 al  Instituto Nacional de Cine y Artes Audiovisuales  para solicitar se le otorgara un crédito para filmarla, si bien tenía además la intención oculta de saber qué pasaría con el filme cuyas referencias políticas hacían que muchos le auguraran que no iba a poder realizarlo. Las autoridades del Instituto no se animaron a resolver solas el tema y enviaron el pedido a la Secretaría de Cultura, de quien dependían, la que a su vez lo envió en consulta al Ministerio del Interior. El trámite llevó ocho meses y, mientras tanto, Jusid y un grupo de colaboradores recopiló material de la década de 1950 en archivos gráficos y fílmicos y comenzó a filmar antes de tener acordado el crédito que finalmente le fue aprobado por aproximadamente el 20 % del costo y, una vez terminada, la película fue seleccionada por el Instituto para representar al país en el  Festival Internacional de Cine de San Sebastián . [ 2 ] ​ Problemas con la censura Jusid entregó copias del filme al Ente de Calificación Cinematográfica, quien además de calificarla como prohibida para menores de 18 años dispuso cortes que totalizaban un minuto 43 segundos en dos escenas: en una, Mimí Pons inicia a Juancito en el reconocimiento del cuerpo y hace que toque sus senos y en la otra el mismo personaje, en las duchas de una colonia de vacaciones, se opone a que dos niños violen a un tercero. Jusid en lugar de hacer un recurso de apelación administrativo como era lo usual, se negó a los cortes, requirió que se la calificara como prohibida para menores de 14 años y presentó un recurso de amparo ante el juez al tiempo que denunciaba lo sucedido en una conferencia de prensa. Paradójicamnte, días después el Instituto declaraba el filme \"de interés especial\". El Ente de calificación contraatacó denunciando a Jusid por presunta corrupción de menores y finalmente llegó a un acuerdo con Jusid que permitió el estreno de la película con la calificación de prohibida para menores de 18 años y el Ente la autorizó en su versión completa. [ 3 ] ​ Gobernaba una  dictadura militar  que estaba en su última etapa pues había convocado a elecciones para el 30 de octubre de 1983 y entregaba el poder el 10 de diciembre. No obstante la autorización, la película fue comercializada sin las escenas censuradas que sí fueron incluidas años después al ser pasada en televisión. [ 1 ] ​ Reparto Víctor Laplace  ... Claudio Elizalde Alicia Bruzzo  ... Clarita Arturo Bonín …Tío Miguel Alberto Segado  ... Marcial Villanueva Cosse  ... Don Carlos Catalina Speroni  ... La Modista Alicia Zanca  ... La hermana de Titina Marzenka Nowak  …Tía Berta Lucrecia Capello  ... La Francesa Mario Luciani ... Don Natalio Miguel Alberto Clementin  ... El Petitero Susana Latou  ... La Tana Roberto Catarineu  ... Don Pascual Guaragnone Federico Olivera  ... Juancito Ximena Díaz Alarcón  ... Margarita Mimí Pons  ... La dama del perrito Daniel Rabinovich  ... Rissatti David Tonelli  ... El abuelo Salvador Saúl Jarlip  ... El Francis Héctor Biuchet  ... Jean Romani Michiyo Ohino  ... Juanita Oscar Redondo  ... Lalo Marcelo Berardi  ... Barco Erica Ohashi  ... Martita Vanesa Regueira  ... Titina Ximena Díaz Alarcón Alberto Bonez Leonardo Teixido  …Extra Alberto Benegas Juan Antonio Alani Carlos De Mateis Alberto Bonez Osvaldo Santoro Bertha Dreschler Nora Sajaroff Pacheco Fernández Pedro Asquini María Visconti Gabriela Rubinstein Gabriel Fojo Aito Peleschi Martín Coria",
      "fileSize": 1239224373,
      "addedAt": "2026-01-07T00:08:24.392Z",
      "thumbnail": "https://archive.org/services/img/esperame-mucho-1983",
      "language": "spa",
      "year": 1983,
      "collection": "feature_films",
      "downloads": 61
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.392Z"
}