{
  "imdbId": "archive-dr.-christian-4-remedy-for-riches-1940-drama",
  "title": "Dr. Christian # 4 Remedy For Riches (1940 +++++ Drama)",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dr.-christian-4-remedy-for-riches-1940-drama",
      "title": "Dr. Christian # 4 Remedy For Riches (1940 +++++ Drama)",
      "description": "STORYLINE : A college friend of the local soda-jerk comes to town and lets it be known that he's looking for property on which to build a resort. When he buys some land and suddenly \"discovers\" there's oil underneath it--and generously offers to sell the townspeople shares in his newly found oil reserves--Dr. Christian suspects a swindle and sets out to prove it. --IMDb by frankfob2 IMDb User Review : Dr. Christian - a unique old time radio show with movie spin-offs (April 13, 2006 by Wtrussosr): Dr. Christian was a staple of network radio from 1937 to the mid fifties and along the way, the series spawned six films. As a radio show it stood alone as the only program to use listener submitted scripts. Each week one story would be broadcast from among thousands submitted. The stories were surprisingly good and kept listeners tuning in even after television has pretty much destroyed dramatic radio. The Dr. Christian movies were written by professionals. Perhaps the film-goers would have been better served if the amateurs had also been invited to write the movie scripts. \"Remedy for Riches\" is the fourth of the six \"Dr. Christian\" films. It's pleasant and predictable. The \"Doc\" saves the whole town--not using his medical skills, but rather by doing a bit of detecting-or \"rat smelling\" to be more precise. Included in the cast is Edgar Kennedy who starred in a bunch of short comedies in the 40's. Warren Hull is the male romantic lead. He gained fame as a radio announcer on a program called \"Stike it Rich\" and later took it to television where it was a top hit into the late 1950's. If you're an old radio buff, you will love \"Remedy for Riches.\" ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes . I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws. DEF gp ddh ** (Ty, PizzaFlix! Dr. Christian will forever be a radio & big screen treasure.)",
      "fileSize": 241040094,
      "id": "dr.-christian-4-remedy-for-riches-1940-drama"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.375Z"
}