{
  "imdbId": "archive-th-manster-1959",
  "title": "The Manster 1959: ★★ CC: Sci-Fi/Horror HD [1:12:57]",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/th-manster-1959",
      "title": "The Manster 1959: ★★ CC: Sci-Fi/Horror HD [1:12:57]",
      "description": "The Manster/The Two-Headed Killer is a 1959 American science-fiction horror film. Shot in Japan, it was produced by George P. Breakston and directed by Breakston and Kenneth G. Crane from a screenplay by Walter J. Sheldon. Sheldon's script was based on Breakston's story which he originally titled The Split. The film Starred Peter Dyneley as a foreign correspondent in Japan who is given an experimental drug which causes an eye and eventually, a second head to grow from his shoulder. Tetsu Nakamura played the mad scientist, Dr. Suzuki, and Terri Zimmern his assistant, Tara. Jane Hylton also starred as Dyneley's wife. An American reporter in Japan is sent to interview an eccentric Japanese scientist working on bizarre experiments in his mountain laboratory. When the doctor realizes that the hapless correspondent is the perfect subject for his next experiment, he drugs the unfortunate man and injects him with a serum that gradually transforms him into a hideous, two-headed monster. Directed by George P. Breakston, Kenneth G. Crane Screenplay by Walter J. Sheldon Story by George P. Breakston Produced by George P. Breakston Starring:  Peter Dyneley Jane Hylton Tetsu Nakamura Terri Zimmern Norman Van Hawley Toyoko Takechi Jerry Ito Cinematography David Mason Edited by Kenneth G. Crane Music by Hiroki Ogawa Production companies United Artists of Japan, Shaw-Breakston Enterprises Distributed by Lopert Pictures Release dates  10 July 1959 (Tokyo) 28 March 1962 (United States)",
      "id": "th-manster-1959"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}