{
  "imdbId": "archive-heidi-1968-family-drama-adventure",
  "title": "Heidi (1968 Family Drama Adventure)",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/heidi-1968-family-drama-adventure",
      "title": "Heidi (1968 Family Drama Adventure)",
      "description": "TAGLINES : A Classic Children's Tale. PLOT : Swiss orphan Heidi's (Jennifer Edwards') Aunt Dete (Miriam Spoerri) leaves her in her grumpy grandfather's (Sir Michael Redgrave's) care up in the Alps, where she also meets young goatherd Peter (John Moulder-Brown). —IMDb by nufs68 STORYLINE : Young orphan Heidi (Jennifer Edwards) is left to live with her estranged grandfather (Sir Michael Redgrave), who lives like a hermit in the Swiss Alps. While he is cold and distant at first, he grows to love and cherish her, until he's faced with choosing her well-being over his own hear. —IMDb by Scott Jarreau IMDb User Review : Good job of dramatizing Heidi . (Apr  25 2006 by leachle): This is a good dramatization of Johanna Spyri's \"Heidi. \" It stays closer to the original plot line than some others (i.e.--Shirley Temple's). All of the actors and actresses (young and old) do a very good job with the material. Of course, one must expect a certain amount of one-sidedness of characters such as Grandfather. His character is too deep to explore in such a short movie, but his characterization is certainly adequate. This is doubtlessly a movie for kids. If you're looking for something deeper, go elsewhere. It is fun: the kids enjoyed it, and mom did too. (Maximilian Schell is VERY handsome as Herr Sessemann). I borrowed this movie but will definitely buy a copy for our family. Well put together family film . (Feb 21 2021by CinemaSerf): There have been plenty of on-screen adaptations of this story - it lends itself well to a screen. The eponymous lass (Jennifer Edwards) is palmed off on her reclusive grandfather (Sir Michael Redgrave) atop a mountain, with only him, some goats and the young \"Peter\" (John Moulder-Brown) for company. She is a charming young girl who soon manages to crack the erstwhile impervious shield of the old man before her wealthy uncle \"Richard\" (Maximilian Schell) sends word that he will care for her at his Frankfurt home. Once there she quickly befriends his housekeeper \"Frauline Rottenmeir\" (Jean Simmons) and his bedridden young daughter \"Klara\" (Zuleika Robson) and slowly a family starts to emerge and to thrive - culminating in a perfect holiday on their mountain. Simmons is gorgeous, Edwards has a charm and Redgrave a loving manner about him that sets this made for television (NBC) movie up nicely. A simple story, told with a sympathetic eye to the detail of the story amidst some pretty (Californian as well as Alpine) scenery. ** Infamous for interrupting an American football game that was broadcast the same day. There was a huge outrage from the public and from the advertising sponsors! To this very day, ALL broadcasted games are played to game ending! ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "id": "heidi-1968-family-drama-adventure"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}