{
  "imdbId": "archive-farzanehtaidieighthdayoftheweek",
  "title": "Farzaneh Taidi Eighth Day Of The Week",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/farzanehtaidieighthdayoftheweek",
      "title": "Farzanehtaidieighthdayoftheweek",
      "description": "Farzaneh Taidi A Prominent Iranian Actress Dies at 75 Some close relatives of Farzaneh Taidi, an Iranian movie and theater actress, announced her death in London at age 75 following lung cancer. Farzaneh Taidi was a well-known and popular actress in pre-revolutionary cinema and theater, and is often remembered for her role as Azar in Sirus Alvand 's \" A Cry Under Water \". However, she had also starred in a number of other iconic films in the 1980s, including Massoud Kimia's \" The Soil \" and \" The Journey of the Stone \", \" The Eighth Day of the Week \" by Hossein Rajaian, Saeed Motlabi's \" Salat-e Zohr \" and \"The Dealers\" by Hassan Mohammadzadeh. Farzaneh Taidi , an award-winning yet controversial actress of Iranian cinema from the 1970's,  started her career by studying theater and acting in Los Angeles. She then debuted in the famed \" The Eighth Day of the Week \"  to center on a female protagonist. For her role in this successful film she won a Sepaas for 'Best Actress' at the Tehran International Film Festival, which was quite a big honor. Soon after the award, Farzaneh inundated with commercial offers by producers and filmmakers who wanted to showoff this beautiful talent. In 1994 the British newspaper \"The Independent\" wrote in a separate report that the Iranian Ministry of Intelligence had decided to assassinate Farzaneh Taidi , the exiled former prime minister Bani-Sadr and Javad Dabiran by hiring a terrorist member of the \"Irish Republican Army\". The assassination did not take place, and Islamic Republic officials did not respond to the Independent's report. During her stay in the United Kingdom, Farzaneh lived with Behrouz Behnezhad , another longtime actor of Iranian cinema and theater.",
      "id": "farzanehtaidieighthdayoftheweek"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:52.991Z"
}