{
  "imdbId": "archive-the-man-with-the-golden-arm-1955_202405",
  "title": "The Man With The Golden Arm 1955 Drama/Film-noir Frank Sinatra [1:59:19]",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-man-with-the-golden-arm-1955_202405",
      "title": "The Man With The Golden Arm 1955 Drama/Film-noir Frank Sinatra [1:59:19]",
      "description": "The Man with the Golden Arm is a 1955 American independent drama film noir directed by Otto Preminger, based on the novel of the same name by Nelson Algren.  Because the film dealt with the then taboo subject of illicit drug use, the Motion Picture Association of America (MPAA) refused to grant it their seal of approval. The film’s acclaim, however, contributed to the loosening of the MPAA’s restrictions on subject matter the following year. Sinatra received an Academy Award nomination for his performance, and Darren McGavin also earned praise for his portrayal of a drug dealer. The movie’s riveting jazz score by Elmer Bernstein and striking graphics by Saul Bass—especially the latter’s animated paper cutout of a heroin addict’s arm in the opening sequence—were highly innovative and were influential in the movie industry. When illegal card dealer and recovering heroin addict Frankie Machine (Frank Sinatra) gets out of prison, he decides to straighten up. Armed with nothing but an old drum set, Frankie tries to get honest work as a drummer. But when his former employer, small-time con man Schwiefka (Robert Strauss), and Frankie's old drug dealer, Louis (Darren McGavin), re-enter his life, Frankie finds it hard to stay clean and eventually finds himself succumbing to his old habits Cast: Frank Sinatra as Frankie \"Dealer\" Machine Eleanor Parker as Sophia \"Zosh\" Machine Kim Novak as Molly Novotny Arnold Stang as Sparrow Darren McGavin as \"Nifty Louie\" Fomorowski Robert Strauss as Zero Schwiefka John Conte as Drunkie John Doro Merande as Vi George E. Stone as Sam Markette George Mathews as Williams Leonid Kinskey as Dominowski Emile Meyer as Captain Bednar Shorty Rogers as himself (bandleader at audition) Ralph Peña as himself (bassist at audition) Shelly Manne as himself (drummer at audition) The film score was composed, arranged and conducted by Elmer Bernstein: Track listing All compositions by Elmer Bernstein: \"Clark Street: (a) The Top; (b) Homecoming; (c) Antek's\" - 4:58 \"Zosh\" - 4:28 \"Frankie Machine\" - 4:57 \"The Fix\" - 3:30 \"Molly\" - 4:53 \"Breakup: (a) Flight; (b) Louie's; (c) Burlesque\" - 3:42 \"Sunday Morning\" - 2:49 \"Desperation\" - 2:47 \"Audition\" - 2:42 \"The Cure: (a) Withdraw; (b) Cold; (c) Morning\" - 5:57 \"Finale\" - 4:13",
      "id": "the-man-with-the-golden-arm-1955_202405"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}