{
  "imdbId": "archive-a-railway-collision-1900-directed-by-walter-r.-booth",
  "title": "A Railway Collision (1900) Directed By Walter R. Booth",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-railway-collision-1900-directed-by-walter-r.-booth",
      "id": "a-railway-collision-1900-directed-by-walter-r.-booth",
      "title": "A Railway Collision (1900) Directed By Walter R. Booth",
      "description": "A Railway Collision (1900) Director: Walter R. Booth Railway Collision (also known as A Railroad Wreck) is a 1900 British short silent drama film, directed by Walter R. Booth and produced by Robert W. Paul. It was one of a number of sensationalist \"trick films\" made at Paul's Animatograph Works, his studio in Muswell Hill in north London, and represents one of only a very small number of surviving films by Paul. Production and premise: Frederick A. Talbot, writing in 1912, records that \"the scene of the accident was a field, in which the scenery was erected with considerable care, and a long length of model railway track was laid down, while the trains were good toy models.\" According to Michael Brooke of BFI Screenonline, it \"is one of the earliest examples of this technique in practice\". Brooke notes that \"unlike some of his other films of the period, Booth does not attempt to enhance the effect by intercutting obviously full-scale material, though his successors would undoubtedly have added a shot inside a carriage full of screaming passengers.\" Despite the contrived nature of the scenario and the basic nature of the model work, viewers appear to have found its depiction convincing. Talbot comments that \"many people marvelled at Paul's good fortune in being the first on the scene to photograph such a disaster. They were convinced that it was genuine.\" He calls the film \"forty of the most thrilling seconds it is possible to conceive\" and praises it for rendering a disaster that was \"perfect in its swiftness and wreckage; and the cinematograph film images being less sharp and decisive than those obtained by a hand camera, the illusion was conveyed very convincingly.\" Special effects: A Railway Collision is one of the first examples of implementing the technique of recreating large-scale disasters into a much smaller one using miniature scale models. It served as an important base from which more impressive special effects could be integrated into a story. In spite of the artificial and basic aspect of the nature of the scenario of the model work, the spectators of that time seem to have found it convincing. Reception: The film was a commercial success and was widely pirated in the United States. It was only 40 feet (12 m) long, as it was designed to be played with a Kinetoscope, a type of early motion picture exhibition device designed to enable one individual at a time to view a film through a peephole viewer window. However, A Railway Collision proved so popular that it was adopted for the cinematograph, allowing larger audiences to view it. It had a lasting influence, attracting numerous imitators, and the technique of using model trains to represent real ones was used in many subsequent British films.",
      "fileSize": 4244586,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-railway-collision-1900-directed-by-walter-r.-booth",
      "year": 1900,
      "collection": "feature_films",
      "downloads": 108
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}