{
  "imdbId": "archive-the-rajahs-dream-or-the-bewitched-wood-1900-le-reve-du-radjah-ou-la-foret-enchan",
  "title": "The Rajah’s Dream (1900) Directed By Georges Méliès",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-rajahs-dream-or-the-bewitched-wood-1900-le-reve-du-radjah-ou-la-foret-enchan",
      "title": "The Rajah’s Dream (1900) Directed By Georges Méliès",
      "description": "The Rajah’s Dream (1900) 'Le rêve du radjah ou La forêt enchantée' Director: Georges Méliès The Rajah's Dream (French: Le rêve du radjah ou La forêt enchantée) is a silent trick film created and released in 1900 and directed by Georges Méliès. Plot: A Rajah grows tired and falls asleep. A large butterfly disturbs him and flies around his room. He tries to capture it with a large net, but no avail. Frustrated, he tosses the net aside and tries to go back to sleep, but his room disappears and he is now in a park. Puzzled, he goes to sit on a nearby chair, but it goes to the other side of the area. He then goes to sit on it again, but then it moves once more to the other side, further angering him. The chair becomes a dead tree. The Rajah tries to uproot it, but he is not strong enough. The tree becomes a monster with a wicked grin on its face, scaring the Rajah. He swings his sword at it, but then it becomes a demon and chases him around the area. The frightened Rajah grabs the demon but it disappears in a cloud of smoke before he can do anything else. A beautiful woman suddenly appears, and approaches the Rajah. He is enthralled in love, and kneels down in want for her. As he takes her on his knee, several more women appear around him. They begin to dance around him, knocking him down every time they get close to him. After he finally gets up they chase after him. As they do so many more women join in, making a long line. Then they all appear again, wearing bits of armor and bearing axes, and begin to beat him. He gets pulled up to a podium where an executioner is about to behead him, but the Rajah grabs him and starts beating him up. However, he awakes to find this was all but a dream, and he was beating up his pillow. Confused and weary from all these things that transpired, he goes back to sleep.",
      "id": "the-rajahs-dream-or-the-bewitched-wood-1900-le-reve-du-radjah-ou-la-foret-enchan"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:15:47.853Z"
}