{
  "movieId": "archive-The_Night_of_Counting_the_Years_DVD",
  "title": "The Night of Counting the Years (DVD)",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Night_of_Counting_the_Years_DVD",
      "id": "The_Night_of_Counting_the_Years_DVD",
      "title": "The Night of Counting the Years (DVD)",
      "description": "Egyptian critics consistently list \"The Night of Counting the Years\" (also known as \"The Mummy\") as one of the most important Egyptian films, and perhaps the most important one, but it remains largely unknown, both within Egypt and elsewhere, despite winning a number of awards at European film festivals. Set in 1881, on the eve of British colonial rule, it is based on a true story: an Upper Egyptian clan had been robbing a cache of mummies near the village of Qurna, and selling the artefacts on the black market. After a conflict within the clan, one of its members went to the police, helping the Antiquities Service find the cache. The film casts this story in terms of the search for an authentic, lost Egyptian national identity (represented by the neglected and misunderstood artefacts of ancient Egyptian civilisation), but the conflict between city and countryside suggests questions that are not resolved in the film, making it an ambiguous, unsettling reflection on the price of identity. Unusual camera angles, striking colours and slow editing give the film a dreamlike quality, reinforced by Mario Nascimbene's eerie music. For those who know Arabic, the dialogue is entirely in classical Arabic, which adds to the sense of unreality. From this page, you can download the film in the form of two DVD ISO images, which can be recorded on blank DVDs and viewed with a DVD player. These DVDs contain no subtitles. To download the film with subtitles (at a somewhat lower image quality), see the subtitled version .",
      "fileSize": 7365125531,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Night_of_Counting_the_Years_DVD",
      "language": "Arabic",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 24391
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}