{
  "imdbId": "archive-murder-a-la-mod-1968-film-noir-dramady-crime-murcer-mystery",
  "title": "Murder à la Mod (1968 Film Noir, Crime, Murder, Mystery, Dramady)",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/murder-a-la-mod-1968-film-noir-dramady-crime-murcer-mystery",
      "title": "Murder à la Mod (1968 Film Noir, Crime, Murder, Mystery, Dramady)",
      "description": "PLOT : Naive young lady Karen wants to help her struggling amateur filmmaker boyfriend Christopher raise enough money so he can divorce his wife. Meanwhile, jolly psycho prankster Otto stalks the building where Christopher is shooting a low-grade adult movie in order to keep himself afloat. — IMDb by Woodyanders IMDb User Review : worth seeing; Peeping Tom, meets Psycho, meets Pulp Fiction (Sep 26 2006 by maccauleyjoseph): Just finished watching this early De Palma, and I am glad that I was finally able to see it. I have seen almost all his early films and this one certainly was not boring, in fact there were a few thrills and chills. I found the story confusing but it still kept my attention. It featured some good DePalma stylish moments,as well as clumsy comedy. I was reminded of some of his later works, and when you watch this film it is apparent that DePalma really knew how to get the right thriller feel, even way back in his black and white days.....this film, in its own way is about as good as \" The black dahila \" , but you gotta be a DePalma fan....... Stylish nonsense from Brian De Palma (Jul 20 2008 by The_Void): Brian De Palma would go on to become the number one Hitchcock imitator with the release of films such as Sisters , Body Double and Dressed to Kill . It's his style that he is most famous for; so as you would expect, his first feature is absolutely full of style and various experiments...the result is a mixed bag really. First of all, the stylish flourishes and experiments are all at the expense of the story, although some of it is interesting to watch. The plot itself focuses on a maker of very strange films and a girl who falls in love with him. The plot is clearly not the most important thing about the film, however, and really nothing in it makes a great deal of sense. The picture is a stark black and white and this gives the film a distinctive look which is to its credit. The majority of the movie is taken up by sequences that see the film's pivotal event (an ice pick murder) from the perspective of several different characters. I would not really say that this film is entertaining or even fun to watch really; but it is interesting to see the film that De Palma made before he got famous and the film is worth seeing for that reason. Soundtrack Credits : ''Murder à la Mod'' written and performed by William Finley (as W.F. Finley). ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "fileSize": 281637062,
      "id": "murder-a-la-mod-1968-film-noir-dramady-crime-murcer-mystery"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.332Z"
}