{
  "imdbId": "archive-la-cancion-de-buenos-aires-1939",
  "title": "La Cancion De Buenos Aires ( 1939)",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-cancion-de-buenos-aires-1939",
      "title": "La Cancion De Buenos Aires",
      "description": "La modelo de la calle Florida  es una película de  Argentina  en blanco y negro dirigida por  Julio Irigoyen  y producida en 1939 (Wikipedia) Sinopsis Historia de un joven acomodado que intenta seducir con malas artes a una muchacha buena, que sólo quiere vivir dedicada a su madrecita. Pero antes de comenzar a narrar ese tema, un cartel anuncia que Buenos Aires “tiene un aspecto escondido por cuyas vértebras ruedan las perdiciones”, y los siguientes quince minutos registran de manera documental los números vivos de un café. Reparto Laura Nelson Arturo Sánchez Enrique Vico Carré Yaya Palau Aurelia Musto Produccion El filme fue producido por  Buenos Aires Film , una empresa dirigida por Julio Irigoyen que se caracterizaba por producir filmes clase “C” de muy bajo presupuesto y poca calidad artística, que en general eran historias con los personajes característicos de la ciudad: guapos prostitutas, cantores de  tango , jugadores en oscuros cafetines, hipódromos y salones aristocráticos. La mayoría eran películas de gauchos o típicamente porteñas, con tango o con canciones de tierra adentro. Es dificultoso acceder a información sobre esas películas, en primer lugar porque una parte no se estrenó en Buenos Aires sino en las provincias del interior de Argentina y también en otros países de  América Latina , en segundo término porque Irigoyen no conservaba los negativos y en tercer lugar por el escaso interés que tenía por ellas la prensa especializada.",
      "id": "la-cancion-de-buenos-aires-1939"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:06:57.128Z"
}