{
  "imdbId": "archive-puerto-nuevo-1936",
  "title": "Puerto Nuevo (1936)",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/puerto-nuevo-1936",
      "title": "Puerto Nuevo (1936)",
      "description": "Puerto Nuevo  es una película  argentina  en blanco y negro codirigida por  Mario Soffici  y  Luis César Amadori  sobre guion de este último escrito en colaboración con  Antonio Botta  que se estrenó el 12 de febrero de 1936 y que tuvo como protagonistas a  Pepe Arias ,  Alicia Vignoli ,  Charlo ,  Sofía Bozán  y  José Gola . (Wikipedia) Origen del film Vista del rodaje del film en los estudios de  Argentina Sono Film , 1935. Sobre el origen del filme cuenta  Domingo Di Núbila  que  Enrique Santos Discépolo  había compuesto el tango  Cambalache  y lo había dado en exclusividad a  Ángel Mentasti  para su filme  El alma del bandoneón  pero  Luis César Amadori  iba a estrenar una nueva  revista  en la que anunciaba que Sofía Bozán cantaría dicho tango por primera vez. Mentasti fue al teatro para intimar que no se ejecutara el tango y Amadori lo convenció para ir a hablar a un café cercano, ello con la intención de persuadirlo sobre la conveniencia de levantar su objeción o, en todo caso, demorarlo allá hasta que el tango se hubiera ejecutado. Mientras hablaban en el café Mentasti le preguntó a Amadori si no tenía algún libreto para  Pepe Arias  y aquel, sobre la base de un viejo monólogo que el actor había dicho en el  Teatro Maipo  comenzó a inventar el argumento injertando situaciones y personajes hasta que estuvo seguro de que la función de teatro había terminado. Lo cierto es que al día siguiente estaban firmando contrato. [ Sinopsis Con la ayuda de una joven rica, un cantor que vive en la zona de viviendas precarias que existía en  Puerto Nuevo  llega a la fama. Reparto Pepe Arias Alicia Vignoli Charlo Sofía Bozán José Gola Juan Siches de Alarcón Haydée Bozán Miguel Gómez Bao Carlos Rodríguez",
      "id": "puerto-nuevo-1936"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:08:35.008Z"
}