{
  "imdbId": "archive-de-oldify-nederland-verwoest-deel-1-1080p-s-aip-3-1945",
  "title": "Unique footage of the destruction of the Netherlands during WW-II in color, Part-1 (1945)",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-nederland-verwoest-deel-1-1080p-s-aip-3-1945",
      "title": "De Oldify Nederland Verwoest Deel 1 1080p S Aip 3",
      "description": "This is part-1 of my four part series about the devastation of the Netherlands during WW-II. The footage has been meticulously restored, enhanced and colorized with the latest video software, based on A.I. (Artificial Intelligence). Before the second World War the Netherlands were a proporous state that was undergoing intensive economic growth. Amsterdam as it capital was at the heart of these developments. The country was ruled by Queen Wilhelmina who played an active roll in its further development. Her daughter Princes Juliana was being prepared to take over as Queen in the coming decade. The harbour facilities in Rotterdam and Amsterdam were further extended in order to fulfil their important roles of being and remaining the gateways to Europe as regards international trade. Many wharfes were engaged in building large sea and ocean going ships, not only for Dutch companies but also for a large contingient of international companies. One of the most modern ships, the MS Oranje, served during the war as hospital ship. Dutch ships sailed all the oceans. The Netherlands was and still is a beautiful country with its great old cities many dating from before the middle ages, its many waterways, canals and rural, agricultural areas. The countries has a centuries old culture. Its drawbridges, windmills, cloggs, tulip fields were already well known the world over. Many buildings are witness to the Netherlands' glorious history. Amsterdam is the jewel in the crown and has always had huge attraction on local and foreign visitors. Not only agriculture, internatinal trade and tourism but also technology and industrialisation have been the pillars on which the Dutch economy resided and stil resides. Anthonie Fokker was one of the world's aviation pioneers and KLM has taken on an important place in internation air travel. From the 1930s onwards, the Dutch railways were one of the first to embrace electrification and were decades ahead compared to countries like Britain where steamtrains remained in service until the late sixties. As early as the 1920s the Netherlands decided to increase the land by regaining the Zuiderzee from the sea with the construction of the Afsluitdijk. Although it brough drastic change to especially the villages surrounding this body of water, the Dutch tradition including the use of tradional dress, still largely remained. Most of its inhabitants were unaware of the drastic change of life they were about to experience. On the 10th of May Hitler invaded the Netherlands. Only four days later the Netherlands had to capitulate as the direct result of the bombing of Rotterdam. Almost the entire old city center was bombed to the ground. About 800 people died, 25.000 homes were destroyed and 80.000 people became homeless. Huge numbers of Rotterdammers needed to find residence elsewhere. In parts 2 to 4 far more rare footage and information will be provided about how badly the Netherlands suffered under the German occupation. Music: Trevor Kowalski Source: Beeld En Geluid",
      "id": "de-oldify-nederland-verwoest-deel-1-1080p-s-aip-3-1945"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:31.599Z"
}