{
  "movieId": "archive-de-oldify-broken-dikes-acte-1-2-1080p-s-1945",
  "title": "Broken Dykes: The Netherlands flooded during WWII in 1944 in color! [AI enhanced & colorized]",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-broken-dikes-acte-1-2-1080p-s-1945",
      "id": "de-oldify-broken-dikes-acte-1-2-1080p-s-1945",
      "title": "Broken Dykes: The Netherlands flooded during WWII in 1944 in color! [AI enhanced & colorized]",
      "description": "A highly interesting and also emotional film about the hardships of the Dutch population in the province of Zeeland towards the end of WWII. In an attempt to weaken the German positions, the allied forces bombarded the dykes of the island of Walcheren on 3 and 7 October 1944. Huge areas were flooded, many people lost their homes; cattle and poultry drowned and very fertile farmland was destroyed for many years to come. This film shows the very sad aftermath of this allied attack. This film should not be confused with the \"Watersnoodramp\" of 1953 when the province of Zeeland and also Zuid-Holland was floaded again due to a severe winter storm, with the loss of 1836 lives. A film about that other disaster can be viewed here on my other channel: https://www.youtube.com/watch?v=ePSbjXuCBQo The original B&W film has been motion-stabilized, slightly speed-corrected, restored, enhanced and colorized with modern A.I. video software. Source: archive.org Music: original soundtrack with Dutch commentary. Draft time line: 01:19 Centre of Middelburg 04:20 Town of Oostkapelle 11:55 Bombs fall near the town of Veere 12:10 Destroyed homes in Westkapelle 12:55 Driving poles into the ground by hand",
      "fileSize": 1922825699,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/de-oldify-broken-dikes-acte-1-2-1080p-s-1945",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 47
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.604Z"
}