{
  "imdbId": "archive-de-oldify-the-burning-of-the-normandie-temporal-smoother-6-render-16-1080p-s-1939",
  "title": "The Burning Of The SS Normandie in 1942 in color! [A.I. enhanced & colorized]",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-the-burning-of-the-normandie-temporal-smoother-6-render-16-1080p-s-1939",
      "title": "De Oldify The Burning Of The Normandie Temporal Smoother 6 Render 16 1080p S",
      "description": "In 1939 the famous French Ocean liner SS Normandie made its last voyage to New York. Due to the start of WWII in Europe the Normandie was confiscated by the US Navy and a couple of years later converted to become a troops transportation ship. During this conversion a welder unintentionally ignited a pile of life jackets which sparked a huge fire. This happened on the 9th of February 1942. Largely due to incompetence of the vice-admiral in charge, far too much water was pumped into the ship which eventually caused it to list and capsize in the harbour during the night (while moured at pier 88). The designer of the ship who was in New York at the time had made proposals how to save the ship before it capsized but was refused entry to the pier by the US Navy. In 1944 the ship was salvaged but repairs were deemed too costly so eventually the burnt-out hull was sold as scrap. The sad end of one of the most beautiful liners of the 1930's. This is a colorization experiment with DeOldify software. The results are most certainly interesting but also reveal that the \"Deep learning\" Artificial Intelligence software still needs to learn a lot. A very prominent mistake is that DeOldify does not yet know that liner funnels are often red. This also applies to the fire engines. Also it cannot yet recognize car brands and thus colors all vehicles black with a touch of purple. It would be great if we as users of DeOldify could add colored pictures as a color scheme reference to help teach DeOldify. In the near future programs like DeOldify are expected to make much more progress.",
      "id": "de-oldify-the-burning-of-the-normandie-temporal-smoother-6-render-16-1080p-s-1939"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:37.766Z"
}