{
  "imdbId": "archive-Asphalt1929",
  "title": "\"Asphalt \"[1929]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Asphalt1929",
      "title": "Asphalt1929",
      "description": "IMDb synopsis... Else, played by Betty Amann, becomes the tragic hero of Asphalt as her character transcends her unhappy criminal life to redeem herself in an unfolding confession of true love. As fitting with the harsh urban landscape of Berlin, Else begins as a gorgeous trickster when the story begins. Her high fashion clothes and perfectly ornamented makeup make her deserving to be peering over diamond cases while batting her eyes in want at the jeweler. We immediately experience the power of her female persuasion between the cuts between the almost possessed jeweler and her. She is good at what she does- seducing men- not stealing diamonds parse. She lies as she gets caught professing it was the first time, that she needed the money. Even when she meets Albert, played by Gustav Frohlich, she insists her luxurious apartment and belongings are not hers. She maintains her story and pristine female fatal composure until she flings herself into his arms and confesses to him, I like you. A close-up captures the couples passionate embrace. Yet, it is the rare moments when Else thinks about Albert that we begin to see her character evolve. With most of her expression transcending from her sad eyes throughout the film. Her first smile in the film comes after she finds the passport photo of Albert in her apartment. Gazing at the photo she smiles comparing him to her criminal older and uglier boyfriend in a photo beside her. This is the first soft moment with this character and the smile is very contrast as well. She will stare and smile at his picture again in the nightclub, when she becomes compelled to return his passport and give him a gift of cigars, a scene that results to a confession of love from both Else and Albert. It is when Albert is at Elses feet, begging for her to be his wife when she can no longer stand the differences between them. As he looks up to her in her white elegant dress and she runs away. She breaks away and exposes all her stolen goods from her criminal past. Her confession becomes a conduit metaphor for the criminal underworld of the city as she pleads with him, Dont go, dont let me go down. She is looking for mercy and seeking to be redeemed. She believes he can save her and this is motivation enough for her to confess. In the closing scene, the director portrays Else in a dark suit voluntarily turning herself into the police. Her once flashy, teary eyes are humbled and filled with tears of compassion and love. This confession becomes an expression of her love and she rescues her lover from being accused of murder. She is able to smile once again as Albert follows her and professes he will wait for her. The gorgeous closing shot shows Albert watching Else through a barred doorway as she goes off to jail or some dark underworld in the city. And reviewer Z.elkowo wrote... A chart of what makes me giggle with excitement about this movie would consist of 25% Betty Amann's eyes, 25% Joe May's expressionist masterdom and attention to light, 25% that title sequence, and 25% everything else. It's full of lovely attention to its surroundings, little images like a bird in a cage, and some really stunning montages, making lots of use out of overlays and superimposition. And as mentioned, I could watch Betty Amann turn her head back, grin, blink her eyes, and toss her head back laughing about 40 times in a row. She sometimes has a Louise Brooks effect on the viewer, one where she sucks up everything around her with her loveliness, though Joe May certainly keeps the movie more than afloat without her presence. http://i53.tinypic.com/aaavkm.png",
      "id": "Asphalt1929"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:03:23.841Z"
}