{
  "imdbId": "archive-funny-girl.-1968",
  "title": "Barbra Streisand 🄰🄳🄳🄴🄳 🅅🄸🄳🄴🄾🅂",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/funny-girl.-1968",
      "id": "funny-girl.-1968",
      "title": "Barbra Streisand 🄰🄳🄳🄴🄳 🅅🄸🄳🄴🄾🅂",
      "description": "Barbra Streisand One of the world's most popular singers, an award-winning, versatile actress of stage, feature film, and television, a distinguished filmmaker, and a major producer, Barbra Streisand reigns as the grande dame of American entertainment. Born on April 24th, 1942, Streisand was raised in a middle-class Brooklyn household, the daughter of a high school teacher father who died when Streisand was a baby, and a mother who dreamed of the stage, she graduated from high school two years ahead of her classmates. As a young woman, Streisand attended acting classes and worked various odd jobs and in nightclubs, until she won a Greenwich Village talent contest. She landed her first major acting job in the 1962 Broadway musical I Can Get It for Your Wholesale and stole the show with her portrayal of frowsy secretary Miss Marmelstein. The 21-year-old subsequently debuted on Judy Garland's television show, opposite Garland's daughter Liza Minnelli and Broadway institution Ethel Merman. Streisand's powerful, clear soprano, charisma, and unusual looks made her the perfect choice in Jule Styne's and Bob Merrill's musical Funny Girl in 1964. Essaying the life of another great performer, comedienne/singer/actress Fanny Brice, the young performer became the hottest actress on the Great White Way and a bona fide star, after a highly rated television special, My Name Is Barbra (1965), for which she received two Emmy awards. Streisand's Oscar-winning performance in the film version of Funny Girl assured her a prominent place in the Hollywood heavens. As previously mentioned, the plain-looking Streisand seemed an unlikely candidate for movie stardom, but as her character Fanny blossomed onscreen from an awkward girl from a poor Jewish neighborhood to a self-assured national star, so did Streisand successfully grow to possess a certain womanly loveliness, although hers has always been an interesting rather than a classical beauty. In 1969, she played the irrepressible Dolly Levi in the film version of Jerry Herman's smash hit musical Hello Dolly! (1969). Superficially, Streisand was too young to play the middle-aged matchmaker, but with her strong comedic abilities and powerful voice, she carried the role off with aplomb. Unfortunately, the film didn't click with audiences and neither did her third film, the romantic musical On a Clear Day You Can See Forever (1970). In film, she had greater success when she starred opposite George Segal in the romantic comedy The Owl and the Pussycat (1970) and Ryan O'Neal in Peter Bogdonavich's classic screwball comedy What's Up Doc? (1972). The latter was a huge success and led to a far less successful re-pairing with O'Neal in The Main Event (1979). In 1972, Streisand showed her dramatic side in the complex story of a troubled housewife, Up the Sandbox, following it with the smash hit romantic melodrama, The Way We Were (1973), in which Streisand starred opposite another 1970s icon, Robert Redford. The film was named one of the year's top ten by the National Board of Review of Motion Pictures and the title song, written by Marvin Hamlisch, provided Streisand with a major hit and earned Hamlisch an Oscar for Best Song. In 1975, Streisand reprised the role of Fanny Brice in Funny Lady, an uneven chronicle of Brice's later years that had far fewer sparkling moments than the original, but still produced a memorable soundtrack, filled with classic Billy Rose songs. Streisand, who for years had been controlling almost every aspect of her recordings, decided to take the reigns as an executive producer for her 1976 remake and update of A Star Is Born. Co-starring Kris Kristofferson and sparing no expense, the musical drama received decidedly mixed reviews; the subsequent soundtrack album was a much bigger hit. In 1983, Streisand caused a controversy when she announced that she would direct, produce, write, and star in her own feature, Yentl. The brouhaha centered around the notoriously egotistical 40-year-old Streisand's plan to play a teenage girl who masquerades as a Yeshiva student and it would also be a musical. The actress struggled valiantly to pull off the difficult task, audiences were not impressed, and the film was widely panned. Once again, however, the soundtrack provided her with another hit. Still, she would not make another movie until 1987, when she produced and starred in the self-indulgent Nuts. As with her previous few films, she also penned the soundtrack. In 1991, she had her first hit movie in a decade, directing, producing, and starring in a tragic drama opposite Nick Nolte, Prince of Tides. She followed it up in 1996 with the touching comedy-drama The Mirror Has Two Faces. Streisand then took a break from appearing before the camera until 2004's sequel to Meet the Parents, Meet the Fockers. She and Dustin Hoffman shared the screen as a pair of touchy-feely retirees and the two were noted for their chemistry and seemingly genuine enjoyment of their screwball antics. She reprised her role in another sequel, Little Fockers, in 2010. Streisand later took a starring role opposite Seth Rogen in The Guilt Trip (2012). Even during her break from on-camera work, Streisand continued her involvement behind the scenes, spending the first years of the 21st century extensively exploring the medium of television. She served as executive producer for such TV projects as The Long Island Incident, Frankie & Hazel, What Makes A Family, and Varian's War. Streisand's successes as a singer include 38 albums, 30 charting singles, and seven Grammys, one of which is a special Legend award. Throughout her career, her romantic travails have provided fans with hours of entertainment. Early in her career, a marriage to actor Elliot Gould produced son Jason Gould, who has also become an actor. During the 1970s, Streisand had a tempestuous, long-term relationship with hairdresser turned producer Jon Peters. In the late '90s, she quietly married longtime beau, actor James Brolin. A Star Is Born (1976) The third remake of the 1932 drama What Price Hollywood?, this adaptation of A Star Is Born moved the story into the mid-1970's and changed the milieu from the movie business to pop music. John Norman Howard (Kris Kristofferson) is a rock star whose career has peaked; he is numbed by booze and cocaine, his music has lost its edge, and his performances have become painfully haphazard. One night, after a concert, he stumbles into a club where he sees a singing group fronted by Esther Hoffman (Barbra Streisand). John likes what he hears and loves what he sees; he tries picking her up, but soon realizes if he wants to see her, he'll have to ask her out on an actual date. He does, and before long the two become involved, although Esther has trouble with John's rock star lifestyle. One night, a typically burned-out John lets Esther sing a few songs at one of his shows; before long she's the talk of the record business. While Esther's star begins to rise, John's continues to sink, and while she desperately tries get John to clean up and focus on his music, it may be too late to save him. The song \"Evergreen\" earned this film an Academy Award for Best Song; the credits contain the amusing notice, \"Ms. Streisand's Clothes from ... Her Closet.\"",
      "fileSize": 71622447489,
      "addedAt": "2026-01-07T00:08:32.016Z",
      "thumbnail": "https://archive.org/services/img/funny-girl.-1968",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 39201
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.016Z"
}