{
  "movieId": "archive-el-ojo-de-la-cerradura-1966",
  "title": "El Ojo De La Cerradura ( 1966)",
  "year": 1966,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-ojo-de-la-cerradura-1966",
      "id": "el-ojo-de-la-cerradura-1966",
      "title": "El Ojo De La Cerradura ( 1966)",
      "description": "El ojo que espía  es una  película   argentina  de 1966, dirigida por  Leopoldo Torre Nilsson  y protagonizada por Janet Margolin, Stathis Giallelis,  Lautaro Murúa  y  Leonardo Favio . Estrenada en Buenos Aires el 1 de septiembre de 1966. Ganadora de seis premios, entre ellos el  Cóndor de Plata  de 1967 al mejor director. La película tuvo el título alternativo de  El ojo de la cerradura . (Wikipedia) Sinopsis Cuando un joven nacionalista fanático (Stathis Gialellis) sospecha que sus compañeros de pensión –inmigrantes y actores de zarzuela- planean un atentado contra el presidente, los denuncia a la policía. En su aventura, deja atrás una novia (Marilina Ross) y una amante (Nelly Meden) y acaba compartiendo su vida con una joven desorientada (Janet Margolin). (FILMAFFINITY) Reparto Janet Margolin  (Inés) Stathis Giallelis  (Martín Casal) Lautaro Murúa  (Hernán Ramallo) Leonardo Favio  (Santos) Nelly Meden  (Lola) Ignacio de Soroa Helena Cortesina Marilina Ross  (Novia de Martín) Miguel Ligero Jorge Barreiro Oscar Pedemonti Antonio Martiánez Amadeo Sáenz Valiente Carlos Luzietti Juan Valunas Sergio Vanders (Legarace) Oscar Caballero Olga O'Farrell Eugenio Marcot José Levantini Luis Henneman Jacques Arndt Cipe Lincovsky Miguel Caiazzo Enrique Liporace Linda Peretz Enrique San Miguel Orlando Bor Paquita Barreta Virginia Ameztoy Felice D'Amore Marina de Gregorio Pedro del Río Héctor Pellegrini  (Doblaje de Stathis Giallelis) Adriana Bianco  (Doblaje de Janet Margolin) Gilberto Rey Franco Balestrieri",
      "fileSize": 1752593202,
      "addedAt": "2026-01-07T00:08:15.379Z",
      "thumbnail": "https://archive.org/services/img/el-ojo-de-la-cerradura-1966",
      "language": "spa",
      "year": 1966,
      "collection": "feature_films",
      "downloads": 134
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.379Z"
}