{
  "imdbId": "archive-JederMenschIsteinTisch",
  "title": "1983 Jeder Mensch ist ein Tisch, nur, ich bin ein Stuhl (Every Human is a Table, only I am a chair)",
  "year": 1983,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JederMenschIsteinTisch",
      "id": "JederMenschIsteinTisch",
      "title": "1983 Jeder Mensch ist ein Tisch, nur, ich bin ein Stuhl (Every Human is a Table, only I am a chair)",
      "description": "With Berni Woschek, Boris Jacobi, Michael, Angelika, Jimmy Cording, Tony Morgan, Cecile Bauer, Wolf Dosch, Anna Plakinger, Thomas Heinser and Hans Illner The people before the camera expose themself to the question: What do I have to tell the audience . SEBASTIAN FELDMANN, RP, 28.9.1983 Mommartz converses with Interlocutors of his acquaintance or presents interesting and funny contemporaries. During the conversations he wants to break down barriers of various kind, improvising in front of the camera. This he achieves in different quality. His black and white camera he handles mostly rigidly (often one hears the running noise), sometimes in old school experimental way. In the sequence with Tony Morgan and and his friend, wherein Tony denies the clearly understood oppressive claim of Mommartz by presenting him simply and logical dead, the filmmaker tries to compensate Tonys silence by moving the camera around. This does not fit the scene. A very great scene, however, is associated with \"Berni\", who developes along with Mommartz basics of a possible film aesthetic using subscription and image constellations in a clever, funny and striking way. Sometimes we do not want to be so close to the privacy of the people. So Mommartz' efforts are not enough this time . Above all, the result does not come close to Mommartz' otherwise undeniable film makers rank, which allows for example to take the Warhol comparison at all. In the prologue Mommartz asks cryptically: \"How does the cow come from the ice ?\" The butcher knows. But maybe I did not get rifght the whole movie. However, this is not necesarily the observers fault.",
      "fileSize": 19079136016,
      "addedAt": "2026-01-07T00:06:30.621Z",
      "thumbnail": "https://archive.org/services/img/JederMenschIsteinTisch",
      "language": "ger",
      "year": 1983,
      "collection": "feature_films",
      "downloads": 8333
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.621Z"
}