{
  "movieId": "archive-the-secrets-of-jonathan-sperry-2008-family-drama",
  "title": "The Secrets of Jonathan Sperry (2008 5 star Family Drama)",
  "year": 2008,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-secrets-of-jonathan-sperry-2008-family-drama",
      "id": "the-secrets-of-jonathan-sperry-2008-family-drama",
      "title": "The Secrets of Jonathan Sperry (2008 5 star Family Drama)",
      "description": "MOVIE TAGLINE : What he teaches you...will last forever. PLOT : A wise old Christian man imparts Biblical truths to three boys during the summer of 1970.—IMDb by Jeffrey Lee Hollis STORYLINE : In 1970 a 75-year-old man named Jonathan Sperry starts mentoring three boys - Dustin, Albert, and Mark - to follow the Lord. —IMDb [Anonymous] SYNOPSIS : Best buddies Dustin, Albert, and Mark, are twelve year old boys looking forward to a summer of fun in 1970./ Dustin has a crush on Tanya and wants to ask her out on a date, something he has never done before. His main obstacle, though, is the town bully, Nick, who also likes Tanya. When Dustin mows the lawn of seventy-five year old Jonathan Sperry (Gavin MacLeod), a man he has seen at church, a unique friendship develops./ What happens the rest of the summer is something Dustin and his friends will never forget . IMDb User Review : The Secrets of Jonathan Sperry (May 29 2010 by radioflyer68): Here you're going to read a lot of unfair commentary on this film that is largely based on hatred of basic Christian values. That's come to be expected and that point is even made in the film. If you want to be entertained by a family friendly comedy about a kid who learns a valuable life lesson(in an unexpected way) without having to worry about the obligatory negatives of the average theatrical release then you won't be disappointed. I think you'll find as I did a great story and surprisingly professional grade acting among the young cast members and outstanding performances among the senior members. I was surprised by the quality of this film and I expect you will be too. A beautiful little film that sadly few will see (Oct 09 2009 by dtucker86) An unexpected gem ! (Aug 29 2010 by allemania_ak): Our family watched The Secrets of Jonathan Sperry last night and each one of us thought it was an absolutely wonderful movie. We have had this film in our Netflix Watch Instantly queue ever since Netflix acquired it, but had never taken time to watch it. When we decided to watch it as a family last night, my 11-year-old son balked and said it looked like it would be \"boring\", but even he was brought to unexpected tears and smiles here and there throughout (as were the rest of us); and at the end he was the first to say what a great movie this was and that \"we really need to buy this\". The main theme that stood out to me in this film was the impact that one person could have on so many other people's lives, especially if they truly live what they profess to believe. I highly recommend this heart-felt, family-friendly, thought-provoking film. Life as it should be (Apr 22 2011 by dadpass): When this movie was released, the radio ads I heard led me to believe it was a 19th century mystery with Christian overtones. In reality, it was like the picture of your favorite DJ, who looks nothing like you envisioned him. My wife and I watched the DVD last night. I found it to be a well-done, well-acted movie about sharing the Gospel. Mr. McLeod is superb as the lead, with Robert Guillaume complimenting the nicely chosen cast. The props and settings are accurate and nostalgic. It made me long for the innocence of that time. With Easter approaching, we should all reconsider the claims of Jesus on our lives. This movie will cause you to do that. Amazing (Oct 1 2009 by RNHunter): This movie is amazing. In many ways today it is more scary than the saw movie series and I for one cannot believe it was even made. It is a wholesome movie that sometime focuses on people being nice to each other s. It should sometimes surprise us that a wholesome movie with some religious content makes us more uncomfortable at least in the movie beginnings than the slasher movies or saw movies or the like. We have been programmed I believe to think that movies like this are square or out of date, or just not cool or with it. So there is a tendency to want to hide your face at the start of the movie and slink to the door hoping no one will see you. But if you brave it out, and yes, you can even hold hands in the scary parts, you might find something unique. You might find the movie touching, and you might even want to cry a little, yes, even if you are a male. And at the end you might ask, why is it again that we are so afraid to be nice to other humans or watch movies that show that? Maybe if we give it a chance, and this movie a chance, being nice to each other might just catch on. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "fileSize": 401281601,
      "addedAt": "2026-01-07T00:12:22.159Z",
      "thumbnail": "https://archive.org/services/img/the-secrets-of-jonathan-sperry-2008-family-drama",
      "language": "eng",
      "year": 2008,
      "collection": "feature_films",
      "downloads": 1433
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.159Z"
}