{
  "imdbId": "archive-la-historia-oficial-1985_202410",
  "title": "La Historia Oficial ( 1985)",
  "year": 1985,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-historia-oficial-1985_202410",
      "id": "la-historia-oficial-1985_202410",
      "title": "La Historia Oficial ( 1985)",
      "description": "La historia oficial  es una  película argentina   dramática - histórica  dirigida por  Luis Puenzo . Fue escrita por Puenzo y  Aída Bortnik . Es protagonizada por  Héctor Alterio  y  Norma Aleandro , y coprotagonizada por  Hugo Arana ,  Guillermo Battaglia ,  Chela Ruiz ,  Patricio Contreras  y  Chunchuna Villafañe . También contó con la actuación especial de  María Luisa Robledo . Se estrenó el 3 de abril de 1985. El rodaje de la película comenzó en 1983, cuando todavía regía la  última dictadura cívico-militar  (1976-1983); debido a esto, inicialmente Aleandro se había negado a protagonizar el film, por temor a las amenazas que ella, el reparto y el equipo de producción podían recibir por parte de las autoridades militares del país. A pesar de la situación política se continuó con el rodaje, que se llevó a cabo principalmente en 1984.  La historia oficial  se estrenó un año después. La película fue ganadora de muchos premios nacionales e internacionales, entre ellos el  Óscar a la mejor película de habla no inglesa  en 1986, un año después de ser estrenada, convirtiéndose en la primera vez en la historia para  América Latina  -la segunda fue con  El secreto de sus ojos -, y el segundo premio  Globo de Oro a la mejor película en lengua no inglesa  para Argentina después del obtenido por  La mujer de las camelias  (1953). Es la única película argentina que obtuvo ambos galardones. Contó con 1.720.000 espectadores (890.000 en su estreno, y 820.000 en su reestreno tras ganar el  Óscar ). El film fue reestrenado el 24 de marzo de 2016 en cines, presentando una versión restaurada de la película por motivo del aniversario 40 del  golpe de Estado de 1976  que inició la última dictadura cívico-militar argentina. Fue reconocida como la  octava mejor película del cine argentino de todos los tiempos  en la encuesta realizada por el  Museo del Cine Pablo Ducrós Hicken  en 2000. 3 ​ En una nueva versión de la encuesta organizada en 2022 por las revistas especializadas  La vida útil ,  Taipei  y  La tierra quema , presentada en el  Festival Internacional de Cine de Mar del Plata , la película alcanzó el puesto 28. 4 ​(Wikipedia) Argumento La historia transcurre en 1983, en el ocaso de la  última dictadura cívico-militar   argentina  autodenominada \" Proceso de Reorganización Nacional \" (1976-1983). Alicia Marnet de Ibáñez ( Norma Aleandro ), una profesora de Historia, vive en  Buenos Aires  con su marido Roberto Ibáñez ( Héctor Alterio ), un empresario que se ha enriquecido recientemente haciendo negocios con la dictadura, y su hija adoptiva, Gaby. Alicia, como otros tantos argentinos, no parece ser del todo consciente del  terrorismo de Estado y las desapariciones  que se han estado cometiendo en el país, e ingenuamente cree que solo se arresta a personas culpables. Las opiniones de Alicia son cuestionadas por un compañero profesor, Benítez ( Patricio Contreras ), y algunos de sus alumnos. Durante una discusión sobre la muerte del padre fundador argentino  Mariano Moreno , un estudiante, Costa, argumenta que los libros de texto de historia emitidos por el gobierno están «escritos por asesinos». Una amiga de toda la vida de Alicia, Ana, que se encontraba en el exilio, retorna a la Argentina después de haber abandonado al país en los primeros años de la dictadura y, luego de una incómoda cena en casa de Alicia y Roberto, le revela a la primera por qué se marchó. Entre sollozos y risas nerviosas, Ana describe que la mantuvieron cautiva y la torturaron por haber vivido con un hombre etiquetado como subversivo, a pesar de que no lo había visto en dos años, y se burla con ironías ante la ingenua respuesta de Alicia de que debería haber «denunciado» este hecho a la policía. Ella dice que mientras estuvo cautiva, fue testigo de cómo las mujeres embarazadas se iban para dar a luz pero regresaban sin sus bebés, afirmando que cree que fueron vendidos a parejas ricas. Tomada por sorpresa por esta última declaración, Alicia comienza a dudar sobre el origen de Gaby, sospechando que pueda ser  menor apropiada de padres desaparecidos . Los intentos de Alicia de obtener información de parte de Roberto fracasan. Su marido insiste en que se trató de una adopción legal y normal, pero su actitud cortante al respecto y sus intentos de convencer a Alicia de que «no debe pensar» en eso solo incrementan su curiosidad. Entretanto, Costa continúa provocando a sus compañeros de clase, y un día Alicia llega para ver las noticias de los  desaparecidos  pegadas en el pizarrón. Cuando Alicia intenta amonestarlo, Benítez interviene para protegerlo, explicándole a Alicia que la vida de Costa podría correr peligro si su actitud rebelde es dada a conocer a las autoridades escolares. Alicia gradualmente se hace amiga de Benítez a medida que su investigación la acerca a la verdad. Mientras busca los registros de nacimiento del hospital de Gaby, Alicia se entera de una organización que busca niños desaparecidos, las  Abuelas de Plaza de Mayo . Ella conoce a Sara, cuya hija embarazada fue secuestrada por las fuerzas armadas, y cree que Gaby puede ser su nieta. Sara tiene una foto de su hija a la misma edad que Gaby, viéndose idéntica a ella. Por su parte, Roberto enfrenta estrés en el trabajo debido a las maquinaciones de sus colegas, varios de los cuales sufren progresivamente el mismo estrés hasta que van desapareciendo en el transcurso de la película. Ana lo confronta y lo acusa de denunciarla y causar su detención años atrás. También entra en fricción con su padre y hermano izquierdistas, quienes desaprueban sus lazos con la élite militar conservadora gobernante y argumentan a favor de la justicia social. Cerca del final de la película, Alicia trae a Sara a casa cuando Gaby no está y trata de presentársela a Roberto, provocando que este se enfurezca y la obligue a irse. Ya solos, Alicia trata de interrogar a Roberto nuevamente, preguntándole si Gaby puede ser hija de desaparecidos. Su actitud nerviosa, sus reiteradas preguntas sobre la aparición de Sara y su insistencia en justificar que «si fuera cierto» quizás «fuera lo mejor» que ellos se quedaran a cargo de la niña, hacen que las sospechas de Alicia se vean confirmadas, mostrándose dolida ante el daño que Roberto fue capaz de hacerle a Gaby. Horas más tarde, Roberto se da cuenta de la ausencia de la niña y le pregunta a su mujer. Alicia se limita a responder, con ironía, sobre lo doloroso que es no saber donde está un hijo. Ciego de ira, Roberto responde golpeándola salvajemente y rompiéndole los dedos contra una puerta (dando a entender implícitamente en el proceso que está versado en técnicas de tortura), a pesar de las súplicas de Alicia de que Gaby está bien, y que simplemente la envió a casa de su madre para que pudieran hablar en paz. La violencia termina cuando el teléfono suena y es la madre de Roberto revelando que Alicia no mintió, para que Gaby pueda hablar con él. Mientras Gaby le canta una canción de cuna a Roberto (\"El país del nomeacuerdo\", de  María Elena Walsh ), Alicia toma su bolso y sale por la puerta, dejando atrás las llaves. Luego, Gaby se encuentra sentada en una mecedora de mimbre en la casa de sus abuelos adoptivos, meciéndose mientras sigue cantando la misma canción de cuna. Reparto Héctor Alterio  como Roberto Ibáñez Norma Aleandro  como Alicia Marnet de Ibáñez Chunchuna Villafañe  como Ana Hugo Arana  como Enrique Guillermo Battaglia  como José Chela Ruiz  como Sara Patricio Contreras  como el Profesor Benítez María Luisa Robledo  como Nata Aníbal Morixe  como Miller Jorge Petraglia  como Macci Analía Castro  como Gabriela \"Gaby\" Ibáñez Daniel Lago  como Dante Augusto Larreta  como General Laura Palmucci  como Rosa Leal Rey  como el Cura Floria Bloise  como Abuela Lidia Catalano  como Dora Deborah Kors Carlos Weber  como Andrada José María López  como Médico Secundarios [ editar ] Susana Behocaray Cecilia Blanche Angélica Bogué Zulema Caldas Eduardo Camacho Paula Canals Jorge Chernov Diego Cosín Alicia Dolinski Horacio Erman Mónica Escudero Oscar Ferrigno Luis Gianneo Eduardo Gondell Gabriel González Ricardo Hamlin Fernando Hoffman Amparo Ibarlucia Virginia Innocenti Tony Middleton Luisa Onetto Fabián Pandolfi Gastón Presas Fabián Rendo Maximiliano Reussi Adrián Schiavelli Jorge Sorvik Silvia Suárez Beatriz Thibaudin Gustavo Tieffenberg Marcos Woinsky Horacio Yervé",
      "fileSize": 10082594753,
      "addedAt": "2026-01-07T00:09:24.702Z",
      "thumbnail": "https://archive.org/services/img/la-historia-oficial-1985_202410",
      "language": "spa",
      "year": 1985,
      "collection": "feature_films",
      "downloads": 570
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}