{
  "imdbId": "archive-20-000-leagues-under-the-sea-1954_20251111",
  "title": "20, 000 Leagues Under the Sea (1954)",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/20-000-leagues-under-the-sea-1954_20251111",
      "title": "20, 000 Leagues Under the Sea (1954)",
      "description": "\"20,000 Leagues Under the Sea\" is a classic science fiction film released in 1954 , produced by Walt Disney. It is based on Jules Verne's 1870 novel of the same name. The movie features a blend of adventure, technology, and underwater exploration, showcasing remarkable visual effects for its time. The film opens with reports of a sea monster that has been sinking ships in the Pacific Ocean. A United States Navy ship is commissioned to investigate these strange events.Professor Aronnax, his assistant Conseil, and Canadian whaler Ned Land are enlisted for the expedition. They soon discover that the \"monster\" is actually the advanced submarine, the Nautilus, captained by the enigmatic Captain Nemo. The crew is taken aboard the Nautilus, where they experience marvels of underwater life, technology, and adventure. Nemo reveals his disdain for the surface world and his intentions to fight against oppression.As they delve deeper into their oceanic journey, the trio grapples with the consequences of Nemo's radical views and their own moral compasses, leading to tensions aboard the submarine.The film culminates in a thrilling battle against a giant squid, showcasing both the beauty and dangers of the ocean. The conflict also highlights the stark differences in ideology between Captain Nemo and the others.Ultimately, Aronnax, Conseil, and Ned Land flee the Nautilus, choosing to return to the surface rather than remain with Nemo, who chooses to continue his solitary crusade.",
      "id": "20-000-leagues-under-the-sea-1954_20251111"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:06.564Z"
}