{
  "imdbId": "archive-AugusteLouisLumiereDemolitionDunMur1896Xvid",
  "title": "Auguste & Louis Lumière Démolition D'un Mur ( 1896) Xvid",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AugusteLouisLumiereDemolitionDunMur1896Xvid",
      "id": "AugusteLouisLumiereDemolitionDunMur1896Xvid",
      "title": "Auguste & Louis Lumière Démolition D'un Mur ( 1896) Xvid",
      "description": "The Lumière brothers, Auguste Marie Louis Nicolas (October 19, 1862 – April 10, 1954) and Louis Jean (October 5, 1864 – June 6, 1948)  were the first filmmakers in history. They patented the cinematograph, which in contrast to Edison's \"peepshow\" kinetoscope allowed simultaneous viewing by multiple parties. Their first film, Sortie de l'usine Lumière de Lyon, shot in 1894, is considered the first true motion picture. The Lumière brothers were born in Besançon, France to Claude-Antoine Lumière and Jeanne Joséphine Costille Lumière. They moved to Lyon in 1870, where both attended La Martiniere, the largest technical school in Lyon. Their father, Claude-Antoine Lumière (1840–1911), ran a photographic firm where both brothers worked for him: Louis as a physicist and Auguste as a manager. Louis had made some improvements to the still-photograph process, the most notable being the dry-plate process, which was a major step towards moving images. It was not until their father retired in 1892 that the brothers began to create moving pictures. They patented a number of significant processes leading up to their film camera, most notably film perforations (originally implemented by Emile Reynaud) as a means of advancing the film through the camera and projector. The original cinématographe had been patented by Léon Guillaume Bouly on 12 February 1892. The brothers patented their own version on 13 February 1895. The first footage ever to be recorded using it was recorded on March 19, 1895. This first film shows workers leaving the Lumière factory. The Lumières held their first private screening of projected motion pictures in 1895.Their first public screening of films at which admission was charged was held on December 28, 1895, at Salon Indien du Grand Café in Paris. This history-making presentation featured ten short films, including their first film, Sortie des Usines Lumière à Lyon (Workers Leaving the Lumière Factory). Each film is 17 meters long, which, when hand cranked through a projector, runs approximately 50 seconds. It is believed their first film was actually recorded that same year (1895) with Léon Bouly's cinématographe device, which was patented the previous year. The cinématographe — a three-in-one device that could record, develop, and project motion pictures — was further developed by the Lumières",
      "fileSize": 172177354,
      "addedAt": "2026-01-07T00:06:14.037Z",
      "thumbnail": "https://archive.org/services/img/AugusteLouisLumiereDemolitionDunMur1896Xvid",
      "collection": "feature_films",
      "downloads": 3432
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.037Z"
}