{
  "imdbId": "archive-jailBait1954OriginaltonMitDeutschenUntertiteln",
  "title": "\"Jail Bait\" Originalton mit deutschen Untertiteln",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jailBait1954OriginaltonMitDeutschenUntertiteln",
      "id": "jailBait1954OriginaltonMitDeutschenUntertiteln",
      "title": "\"Jail Bait\" Originalton mit deutschen Untertiteln",
      "description": "Aufgrund seiner Waffensucht schlittert Don Gregor, Sohn eines weltberühmten Wiederherstellungschirurgen, immer tiefer ins Verbrechen. Als es zum unausweichlichen Abschluss kommt, übt der Vater teuflische Rache an dem Spießgesellen, der Verderbnis über seinen Sohn gebracht hat … Seine sechste Regiearbeit und die zweite in Spielfilmlänge nach „Glen or Glenda“ (1953) greift dieses Werk als einziges von Edward D. Wood, Jr. Elemente des Film noir auf und bietet trotz der gewohnten Regie- und Schauspielschwächen eher wenig Anlass zur unfreiwilligen Komik. Der ursprüngliche Titel des Films, der bereits 1953 abgedreht wurde, war „The Hidden Face“ (hier: „Das verborgene Gesicht“). In den Kinos lief er allerdings ein Jahr später unter dem gewagteren, Aufsehen erregenden Titel „Jail Bait“ („Knastköder“). Als Rechtfertigung wurde alsdann ein Satz mit „jailbait“ nachträglich, aber achtlos in die Tonspur eingearbeitet. Schnickschnack Die Rolle des Dr. Boris Gregor war ursprünglich Bela Lugosi zugedacht, der sich aber wegen seiner Opiatensucht in Behandlung befand. Die Rolle übernahm der sterbenskranke Herbert Rawlinson, der laut Wood am Morgen nach seinem letzten Drehtag seinem Lungenkrebs erlegen sei. Für diesen, seinen vierten Auftritt vor der Kamera bekam Steve Reeves (Bob Lawrence) nicht nur seine erste größere Sprechrolle, in der seine eigene Stimme zu hören ist, sondern auch unerwartete Starthilfe in eine Kinokarriere als Herkules – dessen Stimme aber dann von einem anderen Sprecher nachsynchronisiert wurde. Wood spielte auch eine kleine Rolle, als die Stimme des Nachrichtensprechers. Clancy Malone (Don Gregor) war ein aufstrebender Schauspieler und Woods Lebensmittellieferant. Neben seiner einzigen Filmrolle in „Jail Bait“ arbeitete er auch – unter dem Namen Scott McCloud – als Hilfsregisseur an Woods „Glen or Glenda“ (1953). Eine der größeren Überraschungen, die dieser Film zu bieten hat, ist der völlig deplatzierte Zwischenschnitt einer Blackface-Vorstellung mit Cotton und Chick Watts. Diese Liveaufnahme stammte ursprünglich aus dem Film „Yes Sir, Mr. Bones“ (1951) und sollte als eine Art Einleitung zu dem überfallenen Theater dienen. Auch die Vertonung stammt größtenteils aus einem anderen Film: „Mesa of Lost Women“ (1953), ebenfalls mit Lyle Talbot und Dolores Fuller. Einen Höhepunkt des Films stellt die Verfolgungsjagd zwischen dem Polizeiwagen und den flüchtigen Tätern dar, mit einer errechneten Geschwindigkeit von teilweise acht (!) Stundenkilometer. Wood hatte für diese Straßenszenen keine Dreherlaubnis und wollte daher unliebsame Aufmerksamkeit vermeiden.",
      "fileSize": 2203924243,
      "addedAt": "2026-01-07T00:08:54.188Z",
      "thumbnail": "https://archive.org/services/img/jailBait1954OriginaltonMitDeutschenUntertiteln",
      "language": "English with German subtitles",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 5473
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.188Z"
}