{
  "imdbId": "archive-the-spirit-of-the-beehive-1973",
  "title": "El Espíritu de la Colmena (1973)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-spirit-of-the-beehive-1973",
      "title": "El Espíritu de la Colmena (1973)",
      "description": "O ESPÍRITO DA COLMÉIA ( El Espíritu de la Colmena ) ( Filme Completo / Legendado em Português ) Data de Lançamento: 08 de outubro de 1973 » Em um isolado povoado no interior da Espanha, logo após a Guerra Civil que assolou o país, vivem as pequenas irmãs Ana (Ana Torrent) e Isabel (Isabel Telleria). Depois de assistirem a uma projeção do clássico filme Frankenstein, de James Whale, a menina Ana se depara com temas que aguçam sua curiosidade. Afinal, o que é real? O que é a morte? O que existe para além do que pode s er visto? Ana passa a acreditar que pode encontrar Frankenstein em forma de espírito, e Isabel vê nisso uma possibilidade de brincar com a inocência da irmã. Na busca pelo monstro, Ana encara cada pequena descoberta como uma grande lição. . A cada dez anos de muita maturação, uma obra-prima. Eis o saldo da enxuta filmografia de Víctor Erice, formada pelos três longas-metragens O Espírito da Colmeia (1973), O Sul (1983) e O Sol de Marmelo (1992). O filme de estreia é ainda nos dias de hoje considerado um clássico do cinema espanhol, fazendo um retrato lúdico da Espanha pós guerra civil, num registro que envolve tanto a tristeza das vidas adultas quanto o maravilhoso que irrompe a partir do filtro infantil que transforma tudo em novidade. » » DIREÇÃO: Víctor Erice GÊNERO: Drama,  Fantasia ORIGEM: Espanha DURAÇÃO:  1h 37m » » ELENCO PRINCIPAL: Fernando Fernán Gómez ... Fernando Teresa Gimpera ... Teresa Ana Torrent ... Ana Isabel Tellería ... Isabel Ketty de la Cámara ... Milagros, la criada Estanis González ... Guardia civil José Villasante ... Frankenstein Juan Margallo ... Fugitivo Laly Soldevila ... Doña Lucía Miguel Picazo ... Doctor",
      "id": "the-spirit-of-the-beehive-1973"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:22.160Z"
}