{
  "imdbId": "archive-TheSongOfBernadette_964",
  "title": "The Song Of Bernadette Part 1",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheSongOfBernadette_964",
      "id": "TheSongOfBernadette_964",
      "title": "The Song Of Bernadette Part 1",
      "description": "Bernadette Soubirous is the saint of Lourdes, France. Visionary and messenger of the Immaculate Conception, she told us the very words of the Virgin Mary, spoken in the native Basque tongue of Southern France and Northern Spain. She spoke words teaching of the merits of prayer, penance, poverty and church. In the first and most widely recognized Marian apparition of modern times, a personal message was delivered also to BernadetteShe would not find happiness in this world, but only in the next. She was to die twentyone years later in 1879 after a prolonged and painful illness. She remained hidden in a convent about 300 miles from home, a refuge from the interrogations and the pilgrims that never ceased seeking her. At thirtyfive, her strongwilled manner gave way to her frail body, and she finally entered into her eternal happiness. While she took with her the knowledge of certain secrets the Virgin gave her, one secret remained hidden in our presence. The most spectacular of all the incorruptibles, Bernadette's miraculously preserved body remained buried in a damp grave for thirty years until the cause for beatification was taken up. To this day, the body of Bernadette is a profound source of inspiration and of mystery surrounding the ways of the Lord. The face of Bernadette is one of surreal beauty, and will remain for us always the face that gazed into the eyes of the Mother of God. الإخوة الأحباء أضع بين أيديكم اليوم فيلماً رائعاً بكل ما تحمله من معاني كلمة رائع أكتب كلامي هذا وأنا احمل دموعي على خدي بعد أن أجهشت بالبكاء بعد مشاهدة هذا الفيلم الرائع الذي أثر في نفسي كثيراً لم أكن أدري أننا يجب أن نعاني لدخول ملكوت السموات وأدركت الآن أن رئيس العالم يحاول أن ينسيني أنني بضيقات كثيرة ينبغي أن أمر لكي أرث ملكوت السموات أذهلني كَم الألم والمعاناة التي عانتها هذه القديسة وكم الاتهامات والتشكيك من جانب الناس التي يحرّكها رئيس هذا العالم وبالمقابل الحب والبذل والهدوء والعلاقة السرية بينها وبين الإله الخالق. كم أشتاق أن يكون لي نفس هذه العلاقة الرائعة مع إلهي ومخلصي ، ولكن خطاياي التي أكتمها في قلبي خطاياي المحبوبة لنفسي مثل محبة إبراهيم لاسحق ولكن إبراهيم ضحى باسحق ولكني أرفض أن أضحي باسحاقي ، ارفض أن اضحي بخطيئتي لأني أجد فيها لذة ولم أجد في الله لذة سريعة. عندما شاهدت الفيلم وقصة هذا السيدة أدركت قيمة الله أو بالحري طلبت من الله أن يعطيني أن أدرك قيمته وغلاوته وحلاوة عشرته التي جعلت هذه المرأة تحتمل الأمراض الجسدية والاتهامات والهزء والتعيير بل وبعد كل هذا ترى نفسها لا تستحق الملكوت بل وأنها لم تفعل شيئاً أخجلني اتضاعها وفضح كبرياء المستتر بحلل الاتضاع الزائف أضع بين أيديكم صورة حية لقديسة عاشت وسطنا واضطهدها أناس ليسوا من الشارع وليسوا كفاراً بل رجال من الكنيسة لتكون لنا مثالاً أن نركِّز في شخص المسيح ولا نتأثر بأي شخص لا يسلك كما سلك المسيح بل نصلي من أجله ونثق أن كل أمورنا في يد الله نفسه وهو يهتم بنا كما يهتم الانسان بنفسه وبجسده يارب ارجوك بارك كل مَن يحضر هذا الفيلم ببركة روحية وافتح أذهاننا لأن الوقت المتاح لنا في هذه الحياة قصير جداً وهيئة هذا العالم ستزول ستزول ستزول أرجوك يارب افتح اعيننا لنرى ونصدق ونؤمن أننا سنغادر هذا العالم ولا نؤجل التوبة وأن نفضح أنفسنا بالاعتراف بخطايانا بدلاً من ننفضح أمام الخليقة كلها ونندم حيث لا ينفع الندم ونسكب الدموع الآن قبل أن يأتي وقت لا نجدها أصلي من أجلي نفسي بالدموع ومن أجل كل شخص يقرأ هذا الموضوع لنصلي جميعاً من أجل بعض ومن أجل العالم كله أن يعطينا الرب أذان صاغية لهمساته وقيرعه على قلوبنا جميعاً صلوا جميعاً من أجلي فيلم القديسة برناديت هاتان الصورتان هما للقديسة برناديت التي توفيت قبل 122 سنة ودفنت في لورد بفرنسا. لم يكتشف الجثمان الا قبل 30 سنة بعد ان قرر مسؤولو الكنيسة هناك معاينة الجثمان. لا يزال جثمان هذه القديسة البارة ناضرا كما لو ان صاحبته لم تمت. وان حدث وزرت لورد يوما فانك سترى الجثمان في الكنيسة. الجثمان لم يتفسخ لانه في حياتها كانت مريم العذراء تظهر لها دائما معطية لها رسائل ونصائح الى بني البشر حول الطريقة الصحيحة للعيش على الارض. حدثت العديد من المعجزات في هذا المكان ولا تزال تحدث. http://www.baqofa.com/forum/upload/Lamoosa/2006-10-14_144813_ShowLetter.jpg http://www.baqofa.com/forum/upload/Lamoosa/2006-10-14_144841_ShowLetter.jpg خلفية عنها http://www.latinseminary.org/saints/bern.jpg ولدت برناديت في يوم الأحد الموافق السابع من يناير عام 1844 في لورد وهي مدينة صغيرة على جبال البيرينيه في فرنسا الجنوبية، من أبوين فقيرين: فرنسيس سوبيرو وزوجته لويزا كاستيرو. وسُجّلت باسم برناديت – ماري سوبيروس. وخلال السنوات اللاحقة لمولدها رزق والداها بست أطفال أيضاً، مات ثلاثةً منهم. أُصيبت برناديت وهي بعد طفلة بسعال أليم (الربو) ولم تتمتّع برناديت بصحّة جيّدة وكانت قريبةً جداً من والديها وأخواتها واخوتها. وكان أهلها يحاولون مساعدتها بشتى الطرق. كانت لطيفة المعشر، دائمة الابتسامة بالرغم من ألمها والكل يحبها. عملت راعية غنم وهناك في قلب الطبيعة كانت تُصعد أجمل الصلوات للرب وللعذراء. وعاشت في مطحنة لكن بسبب الظروف الصعبة التي واجهت العائلة في هذه المطحنة والتي أدّت الى انخفاض كميّة وجودة الطحين وبالتالي عدد الزبائن، أُجبرت عائلة سوبيروس على ترك المطحنة والانتقال للعيش في منزل أكثر تواضعاً. وقام فرانسوا كلّ يوم بالبحث عن عمل وكانت أجرته ضئيلة جداً ما أدى الى عدم اعتنائه الصحيح بعائلته. وبسبب ذلك اضطرّت لويس سوبيروس الى مساعدة زوجها فذهبت الى العمل في حين قامت الابنة الكبرى برناديت بالاعتناء بالأطفال. صورة عائلة برناديت http://www.bakhdida.net/munaiso/lord_files/image001.jpg صورة عديدة لبروفيل لبرناديت http://iraq8.com/up/uploads/2cf2b3f3a5.jpg ضعف ذاكرتها جعلها تتعذب كثيراً لتتلقن مبادئ التعليم الديني المسيحي على الرغم من أن الناس حاولوا اعطاء برناديت دروساً في الانجيل لكن كان من الصعب حدوث ذلك نظراً لعدم توفّر الوقت الكافي لها. تمتّعت هذه الفتاة بالإيمان العميق وصلاتها الدائمة البسيطة التي كانت بحوزتها باستمرار عادت برناديت إلى أهلها بعد أن أمضت سنين عديدة لدى مربيتها في مدينة برتريس وهناك في لورد تلقت التعليم المسيحي مع رفيقاتها وتناولت سرّ الشركة (التناول). يا له من شعور رائع الرب الإله دخل فعلياً إلى قلبها!. يوم الثلاثاء، في الحادي عشر من شهر شباط 1858 ذهبت برناديت برفقة أختها وصديقتها لجمع الحطب قرب مغارة وهناك كانت المفاجأة الكبرى حيث ظهرت لها السيدة العذراء بينما كانت تستعد لعبور نهر صغير وراء رفيقاتها، أولاً بشكل ريح ثم بشكل امرأة جميلة تسحر القلوب بجمالها الفتّان. صلّت برناديت مسبحتها وهي مذهولة بجمال المرأة وعند آخر إشارة صليب اختفت المرأة، علمت أم برناديت بالأمر وحاولت إقناع ابنتها أنها لم تكن سوى تخيلات وطلبت منها عدم الذهاب الى المغارة ولكن برناديت كانت تصّر أنها لم تكذب وعادت إلى المغارة لأن المرأة طلبت منها العودة بعد خمسة عشرة يوماً. صورة للمغارة http://iraq8.com/up/uploads/a273681d2c.jpg وهكذا توالت ظهورات المرأة الجميلة لبرناديت وكان الناس يتقاطرون إليها من كل صوب منهم بدافع الفضول ومنهم للصلاة. كانت سذاجة برناديت وصدقها وحرارة صلاتها تؤثر كثيراً في من هم حولها وقد وعدتها العذراء بالراحة والسلام في الحياة الأبدية مع يسوع فقط ولم تعدها بالراحة هنا على الأرض. كان الناس يتزايدون حول المغارة يوماً بعد يوم مما خلق قلقاً واضطراباً لدى رجال الشرطة فبدءوا يستجوبون برناديت ويحاولون أن يشوهوا كلامها ولكن الناس كانوا يصدقون كلامها فدافعوا عنها بشدة. اضطهدها رجال السلطة كثيراً وعانت منهم كثيراً لدرجة أن بعضهم حاول تلفيق تهمة الجنون لها وإيداعها المصحة النفسية وكان هذا بدافع من الشيطان الذي يحاول أن يعطل عمل الله وسعيه لتبكيت الناس للتوبة. كانت العذراء وفي ظهوراتها لبرناديت تطلب منها دعوة الخطاة إلى التوبة والصلاة من أجلهم. وفي إحدى الظهورات وبينما كانت برناديت تصلي بحرارة مرت يدها فوق لهيب شمعة مضاءة وبقيت كذلك ربع ساعة ولم تحترق كما أفاد بذلك شاهد عيان. حفرت برناديت في الأرض بجانب المغارة بناءً لطلب السيدة وللحال خرج ماء حيث شربت منه برناديت وقد أصبح هذا النبع الصغير نبع نِعَم شفى الكثير من المرضى بالنفس والجسد ولم يزل حتى يومنا هذا. ومن الذين شفوا: طفل ابن سنتين كانت أمه قد قطعت الأمل بشفائه فلجأت إلى معونة العذراء، ورجل كان يعاني من عمى في عينيه وفتاة عمياء أُعيد لها البصر. صورة نبع المياه http://iraq8.com/up/uploads/e8a87fdfdc.jpg وكانت الجموع تحتشد في ذلك المكان مصلّية من أعماق قلوبها الألوف من السلام الملائكي. بناءً لطلب كاهن الرعية الذي كان قد قال لبرناديت أن تسأل عن اسمها أجابت: \"أنا الحبل بلا دنس\". أي أنها النقية الطاهرة التي حضّرها الآب لتكون يوماً أماً لإبنه وقد طلبت العذراء بناء كنيسة في ذلك المكان وبالفعل بُنيت الكنيسة حيث يحتفل آلاف المؤمنين بالصلاة والافخارستيا في كل مرة. لقد تمّ فحص مياه النبع مرات عديدة ولكن لم يستطع أحد اكتشاف سر قوتها، إنها قدرة العذراء الكلية القداسة. قدمت برناديت ذاتها بكليتها إلى الله ودخلت دير راهبات المحبة حيث عملت في خدمة المرضى والأطفال وكانت راهبة متفانية في بذل ذاتها بمحبة وتقوى. وفي آخر حياتها بقيت مريضة لمدة خمس سنوات، تناجي حبيبها يسوع وأمها العذراء بحب وفرح وسلام داخلي إلى أن انتقلت إلى لقائهما الأبدي في السادس عشر من نيسان سنة 1879 وقد منحها الله نعمة كبيرة بأن قد بقي جسدها سالماً طرياً وكأنها ماتت منذ يوم وهو معروض في نعش زجاجي داخل كنيسة دير راهبات المحبة. وفي كانون الأول 1933 أُعلِن قداستها وأصبحت مدينة لورد مكاناً مقدساً يقصده المؤمنون من كافة العالم لينالوا النعم ويصلّوا للعذراء البريئة من الدنس ويطلبون شفاعة برناديت، تلك الفتاة التي كانت مطيعة لكلمة الرب في حياتها وقد انتقتها العذراء لتنقل إلينا رسالتها وتدعونا من خلالها للتوبة والقداسة. الله يختار الضعفاء والمتواضعين ليُظهر قدرته وحبّه وعظمته. لنكن متواضعين كبرناديت ونتشبّه بالقديسين في اتضاعهم، حتى نصل إلى القداسة صورة للمغارة وتمثال العذراء http://iraq8.com/up/uploads/e6d0993500.jpg تواريخ الظهورات التي حدثت في لورد لبرناديت سوبيروس الظهور الأول في لورد – يوم الخميس الموافق الحادي عشر من فبراير عام 1858 خرجت برناديت سوبيروس البالغة من العمر 14 سنة، وأختها تيونيت 12 سنة، وصديقتهم الصغيرة جانّيه أبادي 13 سنة لجمع الأخشاب. فمشوا الى مازابييل ورأوا هناك كهفاً أمامه جدول مياه. وبينما كانت تهمّ برناديت سوبيروس بخلع حذائها وجواربها لتعبر الجدول، سمعت صوت عصفة ريح. وتكرّر هذا الصوت مرة أخرى، عندها نظرت الى الكهف فرأت سيدة جميلة مكتسية بفستان أبيض وحزام أزرق وزهرتين على قدميها. وأشارت السيدة الى برناديت بإصبعها للاقتراب منها. تجمّدت برناديت في مكانها وحاولت بشكل تلقائي سحب المسبحة والركوع ورسم إشارة الصليب على وجهها. إلا أنّها لم تستطع القيام بذلك حتّى قامت السيدة التي تحمل مسبحة ذات صليب كبير ومُشع بعمل إشارة صليب. وفي أثناء صلاتها رأت برناديت السيدة وهي تُفلت خرزات المسبحة الواحدة تلو الأخرى لكن دون أن تحرّك شفتيها. دامت هذه الرؤية نحو 15 دقيقة. ولم تلحظ الفتيات الأخريات أي شيء من هذه الرؤية لكن برناديت أخبرتهم بما حدث كما أطلعت والدتها على ذلك. الظهور الثاني في لورد – يوم الأحد الموافق الرابع عشر من فبراير عام 1858 يوافق هذا اليوم عيد كنسي ، وقد انتاب برناديت شعورٌ يحتّم عليها الذهاب الى الكهف بالرغم من معارضة والدتها لهذا الأمر. وبعد محاولات عديدة لإقناع أمّها، نجحت برناديت وهمّت بالذهاب إليه مع صديقتيها وأخذت معها زجاجة مليئة بالماء المقدّس لرشّه على العذراء إذا رأتها مرة أخرى هناك. وعند وصولهنّ الى الموقع ركعن وصلّين المسبحة. رأت برناديت السيدة العذراء وبيدها السبحة فقامت برشّ الماء المقدّس باتّجاهها وقالت لها: \"إن جئت من عند الله، فابقي. وإن لم تكوني من عنده فاذهبي بعيداً\". وحينما كانت ترش برناديت الماء المقدس أكثر كانت السيدة العذراء تبتسم أكثر فأكثر. وحينما فرغت الزجاجة من الماء واصلت برناديت الصلاة واختفت السيدة العذراء. الظهور الثالث في لورد- يوم الثلاثاء الموافق الثامن عشر من فبراير عام 1858 في الصباح الباكر ركعت برناديت في الكهف. وذهب معها بعضٌ من البالغين من القرية وأعطوها قلماً وورقة. دخلت برناديت الى الكهف وطلبت من السيدة التالي: \"اكتبي لي اسمك على هذه الورقة لو سمحتي\". وكان ذلك ما طلبه منها الناس. وقد سمعت برناديت الإجابة: \"ذلك ليس ضروريّاً\". ثم قالت لها السيدة: \"هل ستكونين صالحة بما فيه الكفاية لتأتي الى الكهف على مدى خمسة عشر يوماً؟\". فأجابت برناديت: \"نعم، أعدك\". ووعدتها العذراء بالتالي: ثم قالت لها السيدة: \"أرغب برؤية الكثير من الناس هنا\". وكانت هذه المرة الأولى التي تسمع بها برناديت وبوضوح صوت العذراء المقدّسة العذب. وقد دام هذا الظهور أقل من نصف ساعة. الظهور الرابع في لورد – يوم الجمعة الموافق التاسع عشر من فبراير عام 1858 لم تعد برناديت سوبيروس خائفةً من الذهاب الى كهف مازابييل وشعرت بانجذاب روحيّ يحثّها على التوجّه إليه. كما ذهب معها ست أو سبع نساء من بينهنّ خالة برناديت. وبعد تلاوتهنّ للسلام المريميّ لثلاثة مرّات ظهرت العذراء ودام ذلك لنصف ساعة. وفي ذلك اليوم أخذت برناديت معها شمعة مباركة وهو شيء اعتادت القيام به كل يوم على مدى الأربعة عشر يوماً التي ظهرت فيهم العذراء والذي وافق الأخير فيه الثالث من مارس من عام 1858. الظهور الخامس في لورد – يوم السبت الموافق العشرين من فبراير عام 1858 اجتمع مع برناديت في هذا اليوم ما يقارب الثلاثين شخصاً. تكرّرت الرؤية وعند انتهائها قالت برناديت بنفسها المطمئنّة القليل عن الرؤية. قالت وبوضوح أنها ولمرّة أخرى شاهدت \"السيدة الجميلة\"، التي ابتسمت لها وهي داخل الكهف. الظهور السادس في لورد- يوم الأحد الموافق الواحد والعشرين من فبراير عام 1858 حضر في هذا اليوم ما يقارب المئة شخص الى الكهف مع برناديت وقد أدركوا تماماً مدى التأني في حركات برناديت. ظهرت العذراء لتنظر الى الجمع بعينيها المتلألئتين وقالت: \"صلّوا الى الخطاة\". وكان على برناديت تحمّل المقابلة الطويلة التي حدثت بعد ظهر ذلك اليوم مع مفوّض الشرطة جاكومي. وبقيت مع ذلك هادئة وجعلها أباها تعده بأن لا تذهب الى ذلك الكهف مرة أخرى. الظهور السابع في لورد – يوم الثلاثاء الموافق الثالث والعشرين من فبراير عام 1858 قال الأب بوميان أن لا حقّ لأي أحد أن يمنعها من الذهاب الى الكهف. وفي ذلك اليوم كان هناك ما يقارب المئة شخص على الأقل من بينهم الدكتور دوزوس والكثير من الشخصيّات المهمّة في المدينة الصغيرة. وقد علّمت السيدة المقدّسة برناديت صلاة قصيرة ومميّزة والتي احتفظت بها لنفسها وقامت بصلاتها كل يوم الى أخر حياتها. كما وأملت عليها العذراء بعض التعليمات مفادها: \"اذهبي الى القساوسة وقولي لهم أنني أريد أن تُبنى كنيسة هنا\". الظهور الثامن في لورد – يوم الأربعاء الموافق الرابع والعشرين من فبراير عام 1858 حضر الى الكهف نحو مئتين أو ثلاثمئة شخص ورأوا وجه برناديت والحزن بادٍ عليه وقد زحفت بركبتيها على الأرض وتوقّفت عدّة مرات لتتمتم؛ الكفّارة...الكفّارة... الكفّارة.... وقد قالت بعد ذلك، أنّ السيدة طلبت منها القيام بذلك كتكفير عن الخطأة. يا قديسة مريم.. صلّي لأجلنا نحن الخطأة الظهور التاسع في لورد – يوم الخميس الموافق الخامس والعشرين من فبراير عام 1858 امتلأ الكهف ولمرّة أخرى بالناس. وقد بدى مظهر برناديت في هذا الظهور غريباً نظراً لما قالته لها العذراء: \"ابنتي، أريد أن أخبرك بسرّ أخير يخصّك، لا يجب أن تبوحي به لأحد. والآن اذهبي اشربي واغتسلي من النبع وكلي العشب النابت بجانبه. وأشارت العذراء مريم الى الكهف. ورأت برناديت ماءً قذرة موحلة لم تستطع الشرب منها. حاولت لثلاثة مرات أن تحفر بعمق أكثر فأكثر. وفي المحاولة الرابعة استطاعت أن تشرب من الماء وغسلت نفسها ثم أكلت من العشب. قال بعض الحاضرين أنها مجنونة لكن بعد أن حفرت برناديت في ذلك المكان انبثقت مياه غزيرة. وأصبح يسع ذلك النبع لمئة ألف لتر من الماء يومياً. وأطلق عليه الكثير من الناس \"ماء المعجزة\". وفي ذلك اليوم خضعت برناديت للاستجواب من قبل القائد الملكي ام. دوتور. لكن لم يحصد المحقّقون أي معلومات من هذا الاستجواب. صورة نبع المياه http://iraq8.com/up/uploads/743b205ebe.jpg الظهور العاشر في لورد – يوم السبت الموافق السابع والعشرين من فبراير عام 1858 حضرالظهور العاشر ما يقارب 800 شخص. وقامت برناديت لمرة أخرى بشرب مياه النبع المتدفّقة وأكلت من العشب القريب منه. الظهور الحادي عشر في لورد – يوم الأحد الموافق الثامن والعشرين من فبراير عام 1858 تبع ما يقارب الألف ومئة وخمسون شخصاً برناديت الى الكهف. وحضر رئيس ضباط العسكر مع سكرتيرته من تارب. تأثّرت برناديت بذلك وقالت أن الرؤية قد دامت لمدة أطول. وبعد الظهر تم استجوابها مرة أخرى من قبل الضابط الملكي ورئيس الشرطة. كما وحضر مدير المدرسة العليا المحليّة لطرح الأسئلة عليها بشكل انفراديّ. وقد اعتقد أنها كانت تعاني من الجُمدّة قبل أن يطرح عليها الأسئلة وبعدها أصبح متيقّناً أنّ الظهورات قد حدثت لها فعلاً. الظهور الثاني عشر في لورد – يوم الاثنين الموافق الأول من مارس عام 1858 تبعاً لإحصاءات الشرطة حضر في ذلك اليوم ما يقارب الألف وخمسمائة شخص. قامت برناديت مرة أخري بشرب الماء والاغتسال من النبع. وكان اليوم الأول الذي يحضر فيه القسّيس آبي ديزيرات الذي رسم كاهناً حديثاً والآتي من بلدة أوميكس الصغيرة القريبة من مازابييل. راقب هذا الكاهن برناديت بدقّة وعن قرب ثم قال بعد ذلك:\"ما هذا السلام التي تتحلّى به هذه الفتاة، ما هذه السكينة! وما هذه القداسة الرائعة! إن ذلك مستحيل بالنسبة الى طفلة لتقوم بذلك كلّه؛ إنها نقيّة وطاهرة، وجميلة أيضاً. لقد شعرت وكأنّني واقفٌ على عتبة السماء\". الظهور الثالث عشر في لورد – يوم الثلاثاء الموافق الثاني من مارس عام 1858 حضر في هذا اليوم ألفٌ وستمائة وخمسون مشاهداً. وسمعت برناديت العذراء تقول: \"اذهبي واطلبي من القسّيسين بناء كنيسة. أريد من الناس أن يأتوا الى هنا \". وعندما رأت برناديت الأب بيرامال كانت معاملته فظّة جداً ونسيت أمر الكنيسة تماماً. وعند عودتها الى القسّيس في المساء لتقول له ولثلاثة أخرين بقيّة الرسالة كانت ترتجف. وطلب منها قسّيس الأبرشية أن تسأل السيدة أولاً عن اسمها. الظهور الرابع عشر في لورد – يوم الأربعاء الموافق الثالث من مارس عام 1858 في صباح ذاك اليوم حضر الى الكهف ما يقارب الثلاثة آلاف الى الأربعة آلاف شخص، لكن لم يحدث أي شيء. عادت برناديت الى المكان بعد الظهر وبوجود مئة شخص رأت العذراء. وكما طلب منها قسّيس الأبرشيّة قامت بسؤال السيدة عن اسمها. ابتسمت السيدة دون أن تتفوّه بأي كلمة. فعادت برناديت لرؤية قسّيس الأبرشيّة، والذي بدوره قال لها بأنها ضعيفة وطلب منها مرة أخرى أن تسأل السيدة عن اسمها. الظهور الخامس عشر في لورد – يوم الخميس الموافق الرابع من مارس عام 1858 يوافق هذا اليوم يوم التسوّق في لورد كما أنه اليوم الأخير في الأيّام الخمسة عشر المذكورة في الظهور الثالث. توجّه ما يقارب العشرون ألف شخص نحو الكهف. وقد ساندت الشرطة قوّات أخرى من القرى المجاورة للمحافظة على الأمن. وظلّت برناديت سوبيروس ثلاثة أرباع الساعة داخل الكهف وحين خروجها توجّهت لرؤية قسّيس الأبرشيّة وقالت له أن السيدة ابتسمت ما أن سألتها عن اسمها، لكنها ما زالت تريد أن تُبنى كنيسة هنا. لكن بيرامال كرّر ما طلبه سابقاً وحتّم على برناديت سؤال السيدة عن اسمها. تبع ذلك توقّف في الظهورات، دام عشرين يوماً. وخلال ذلك لم تذهب برناديت الى الكهف ولم تشعر بشيء يقودها الى الذهاب الى هناك. وكانت هذه الفترة وقفة محبّبة لها من أجل استعادة الطمأنينة داخلها. كما وعادت الى المدرسة وهيّأت نفسها للمناولة الأولى. الظهور السادس عشر في لورد – يوم الخميس الموافق الخامس والعشرين من مارس عام 1858 يوافق هذا اليوم عيد البشارة. لم تستطع برناديت الذهاب الى الكهف لثلاثة أسابيع. وقد انتابها في ليل الرابع والعشرين والخامس والعشرين من شهر مارس شعور قويّ يحتم عليها الذهاب الى كهف مازابييل. وفي الساعة الخامسة صباحاً، حضر عدّة أشخاص من بينهم رئيس الشرطة الى الكهف. وما أن وصلت برناديت رأت السيّدة. وسألتها عن اسمها مكرّرةً هذا السؤال ثلاث مرّات. ابتسمت لها السيدة ثم تملّكت برناديت الشجاعة لسؤالها عن اسمها للمرة الرابعة! بعد ذلك كان هناك أيضاً توقّف في الظهورات الظهور السابع عشر في لورد – يوم الأربعاء الموافق السابع من أبريل عام 1858 ذهبت برناديت سوبيروس للاعتراف فتوقّع الناس منها الذهاب الى الكهف. وقامت بذلك كعادتها حاملةً معها شمعة مضاءة في يدها اليسرى، وبيدها اليمنى قامت بحماية الشعلة من الرياح. وأثناء انجذابها الروحيّ الذي دام خمس عشرة دقيقة. اتّجه اللهب نحو أصابعها لم يلحظ الدكتور دوزوس أي حرق على يدها وآمن بأن برناديت رأت حقاً العذراء. تبع ذلك أطول توقّف حدث بين الظهورات. الظهور الثامن عشر في لورد – يوم الجمعة الموافق السادس عشر من يوليو عام 1858 في يوم عيد تجلّي العذراء الكرمليّ، شعرت برناديت بحافز يحثّها على الذهاب الى الكهف. فذهبت في الثامنة مساءً الى هناك. حيث قامت السلطات في الظهور السابق بإغلاق الكهف اتباعاً للمرسوم الصادر في العاشر من يونيو عام 1585 والذي ينصّ على إغلاق المكان. ركعت برناديت على الضفة الأخرى من نهر غايف مع خالتها لوسيل. وبفترة قصيرة انجذبت روحيّاً بعمق كما حدث لها من شهور قليلة سابقة. وحينما سُئِلَت بعدها عن الذي قالته لها العذراء، أجابت: \"لا شيء\"، لكنّها قالت أنها لم تشاهد العذراء بهذا القدر من الجمال من قبل كالذي شاهدته في هذه المرة. وبعد هذا الظهور، عادت برناديت الى حياتها الطبيعيّة المؤمنة المتمثّلة بالإخلاص الكامل الى الرب لبقية حياتها. وقع الظهور الأول لهذه الظهورات الثمانية عشر للسيدة العذراء في لورد في الحادي عشر من فبراير من عام 1858. وخلال هذه الظهورات وبعدها أصبحت برناديت محطّ إعجاب الكثيرين كشخص مهم كما وابتعد أيضاً الناس عنها! ووجد أهلها صعوبةً في ذلك فكيف لهؤلاء الناس الفقراء الدفاع عن أنفسهم أمام ضغوطات العامّة المهدّدة لهم! لكن برناديت ومع ذلك بقيت محافظةً على طبيعتها المتّسمة بالبساطة والأمانة والمكرّسة لله. بقيت هادئة ومتقبّلة للاستهزاء الظاهر على وجوه المحقّقين الآتين من الكنيسة والسلطات، مقدّمةً مقاومة واضحة في وجه محاولاتهم وإصرارهم الفظ على تكرار ما حدث أثناء الظهورات. زاد ذلك كلّه من رغبة برناديت بأن تصبح راهبة فقرّرت الدخول الى دير نيفيرس. ونظراً لضعف صحّتها التي لا تخوّلها الى اتّباع القوانين الصارمة، أحبّت برناديت الاعتناء بالمرضى كما أنها قالت: \"لا أحد حاول إجباري على الذهاب الى الدير\". برناديت سوبيروس في نيفيرس في يوليو عام 1866، قامت برناديت بالالتحاق بدير أخوات محبة نيفيرس في سان غيلدارد، وهو مقرّ الأبرشيّة، آملةً في إشباع رغبتها المتمثّلة في تكريس حياتها الى الله. وقبل أن تترك لورد وعائلتها الحبيبة ذهبت برناديت الى الكهف في الرابع عشر من يوليو عام 1866. أخبرت الأخت ماري- برناديت في بداية حياتها الرهبانية جميع الراهبات بقصة الظهورات بكاملها والتي لم يُسمح لها بعد ذلك بذكر شيء عنها. أعطت بعض الراهبات الأرفع مقاماً برناديت أعمالاً وضيعة وعانت كثيراً من الإذلالات إلا أنها قبلت ذلك كلّه بصدر رحب. وقد أُعطيت مهام غرفة مشفى الدير، حيث أصبحت ممرضة ممتازة لكنها كانت تعاني من الربو كما أصيبت بالسل وفقدت الكالسيوم من عظامها وامتلأ جسمها بالجروح، واجتمعت معاناة المرض مع المعانات العقليّة لتعيش بذلك كل يوم. وما ذلك إلا تحقيق لطلبت السيدة العذراء السابق في لورد: \"صلّي للخطأة وكفّري عن الخطايا\". \"أعد أن أجعلكِ سعيدة، ليس في هذا العالم، بل في العالم الآخر\" توفيت برناديت يوم الأربعاء الموافق 16 أبريل عام 1879 عن عمر يناهز الخامسة والثلاثين. وقد زادت قوّتها الإيمانية وهي على فراش الموت وبعد عملية طويلة مضنية وبأمر من الكنيسة أٌعلنت الأخت ماري برناديت قديسة في الثامن من ديسمبر عام 1933. وقد بقي جسدها سليماً وحفظ في ضريح زجاجيّ في كنيسة الدير في نيفيرس. ملاحظتي الشخصية عن لورد وعلاقتها القوية مع الأخت ماري-برناديت: لم تكن برناديت تعرف معنى بعض العبارات التي قالتها السيدة العذراء . فقد كانت مجرّد فتاة صغيرة أمينة وصادقة. ومن الرائع أن تختارها السيدة العذراء. ومع أن الظهورات لم تجلب لها سوى المعاناة! إلا أن العالم في لورد قد بورك من جراء ذلك. كما يتدفّق أكثر من خمسة ملايين شخص كل سنة وهو شيء ليس بغريب. فعندما أقفل محافظ البلدية الكهف طلب منه مطران تاربي إعادة فتحه وقال: \"فقط الامبراطور يستطيع إعادة فتح الكهف. دعنا نرى من هو الأقوى، السيدة العذراء أم الإمبراطور؟\". وقد قام الامبراطور نابوليون الثالث بإعادة فتح الكهف، بطلب مكرّر وملح من الامبراطورة أوجين. صورة كاتدرائية لورد http://www.bakhdida.net/munaiso/lord_files/image009.jpg مذبح الكنيسة في لورد http://www.bakhdida.net/munaiso/lord_files/image019.jpg",
      "fileSize": 793065252,
      "addedAt": "2026-01-07T00:07:05.036Z",
      "thumbnail": "https://archive.org/services/img/TheSongOfBernadette_964",
      "language": "English, Arabic subtitles",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 14337
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.036Z"
}