{
  "imdbId": "archive-guerra-los-primeros-10000-anos",
  "title": "Guerra: Los primeros 10,000 años",
  "year": 2020,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/guerra-los-primeros-10000-anos",
      "title": "Guerra: Los primeros 10,000 años",
      "description": "Original:  https://youtu.be/rmNix6IdR28 La descripción decía:  ¿La guerra es un invento humano o una parte inevitable de la vida? Yo te prometí una maravillosa plática de Ray Bradbury y aquí está: https://www.youtube.com/watch?v=R1Q0k... Si te interesa donar a esta locura, entra aquí: https://www.patreon.com/MIGALA Si quieres apoyar y leer libros (casi) gratis, entra aquí: https://es.bookmate.com/code?promo=Mi... ¿Quieres vernos jugar videojuegos? https://www.youtube.com/channel/UCriz... ¿Quieres poesía? https://www.youtube.com/channel/UC-is... Licencia Licencia de atribución de Creative Commons (permite reutilización) El comentario fijado decía:  Y como debe ser, sus fuentes. Algunas de las obras consultadas están en Bookmate, que es como el Netflix de los libros, pero más barato y más chido. Si quieres probarlo un mes gratis, puedes activar el siguiente código que tenemos para ti y además ayudarías mucho a este canal: https://es.bookmate.com/code?promo=Migala Puedes llevarlo en tu celular, para que todos los días, al despertar, en lugar de leer Twitter, leas algo que te levante el espíritu. Yo recomiendo mucho este libro: https://es.bookmate.com/books/Vko6UqbE?dscvr=top_result Y ahora sí las fuentes: Una de las principales obras consultadas para este video y los otros dos de política es El Manual del Dictador, de Bruce Bueno de Mezquita: https://es.bookmate.com/books/UD9isks2 Para la parte antropológica del video, nos inspiramos muy fuertemente en Spark, un libro sobre la imaginación humana, de Agustín Fuentes: https://www.penguinrandomhouse.com/books/531544/the-creative-spark-by-agustin-fuentes-phd/ Para la parte biológica y evolutiva leímos Our Political Nature, de Avi Tuschman. Una novedosa perspectiva científica y humanista del mundo de la política: https://www.amazon.com/Our-Political-Nature-Evolutionary-Origins/dp/1616148233 La novela de vaqueros de Cormac Mc Carthy se llama Meridiano de Sangre y es IM-PER-DI-BLE: https://es.bookmate.com/books/fvoxr5aS Sobre el origen de la propiedad privada y la desigualdad, es fundamental leer este ensayo de Rousseau: https://es.bookmate.com/books/pXUFeE8q Sobre la física y la biología de la batalla, encontré este libro de Dave Grossman, que es un coronel del ejército de los EEUU y está inaugurando una ciencia a la que él llama “killology”, en la que trata de entender el combate desde la biología, la psicología y desde su experiencia personal. La verdad es una lectura imperdible: https://es.bookmate.com/books/Ztg5OzDD Los testimonios de las mujeres soldado de Stalin las encuentras en “El rostro no tiene rostro de mujer”, de Svetlana Alexievich: https://es.bookmate.com/books/YWa6kF7J La ciudad perfecta de Sócrates te la encuentras en los diálogos de Platón: https://es.bookmate.com/books/xWPcC3zS?dscvr=top_result Por supuesto, también leímos y citamos el arte de la guerra, de Sun Tzu: https://es.bookmate.com/books/Fv4kJoQq?dscvr=top_result Sobre la lógica política del genocidio, está Why not kill them all?, de Daniel Chirot. No es una lectura fácil, pero creo que es muy necesaria: https://www.amazon.com/Why-Not-Kill-Them-All/dp/0691145946 El testimonio del saqueo de Cremona y mucho más, lo encuentras en las Historias, de Tácito: https://es.bookmate.com/books/SfJJ8kS3 La plática de Ray Brádbury donde encontré ese diálogo con la estudiante es esta mera: https://www.youtube.com/watch?v=R1Q0k1k43-Y Y cerramos con Epístola a los poetas que vendrán, de Manuel Scorza: https://migala.mx/epistola-de-los-poetas-que-vendran/ Ahora sí, la música: Abrimos con la Opertura del Festival Ruso de Pascua, de Rimsky Korsakov: https://www.youtube.com/watch?v=hbDYtAHTQoE Seguimos, por supuesto, con Marte, el que trae la guerra, de los Planetas, de Holzt: https://www.youtube.com/watch?v=Jmk5frp6-3Q Durante la entrevista con Jane Goodall suena la Partita III para Violín en E Mayor, de Bach: https://www.youtube.com/watch?v=5tjl07RmEQg Al hablar de antropología se escucha el cuarteto de cuerdas No. 10, de Antonin Dvorak: https://www.youtube.com/watch?v=ZRiWmF505Ho Y durante el recuento de los últimos 5,000 años de guerra, suena el poderoso Dies Irae de Verdi: https://www.youtube.com/watch?v=ZDFFHaz9GsY Luego nos seguimos con su sinfonía No. 9: https://www.youtube.com/watch?v=dfW8jgnoUkI Al hablar de las mujeres soldado de Stalin suena Scherezada, de Rimsky Korsakov: https://www.youtube.com/watch?v=SQNymNaTr-Y Durante el diálogo de Sócrates y casi al final del video, suena Venus, el que trae la paz, de los Planetas de Holzt: https://www.youtube.com/watch?v=5Hpb2gp4mtc A la hora de hablar de la organización política de la guerra, suena la Sinfonía No. 4 de Mendelssohn: https://www.youtube.com/watch?v=XMLyJNgd6LA Durante la guerra de los 6 días suena El Barbero de Sevilla, de Rossini, porque la neta sí parece un episodio de Bugs Bunny: https://www.youtube.com/watch?v=qlrqdMXM0u0 Durante el recuento de los democráticos Davides venciendo a los goliaths autoritarios, suena la Sinfonía No. 38 en D Mayor de Mozart, porque no me aguanté las ganas de escuchar a Mozart: https://www.youtube.com/watch?v=ot3g41rHFqU Cuando exploramos qué se siente matar, se escucha Carmina Burana, porque pinche cursi: https://www.youtube.com/watch?v=dLOk8nHimlA Y luego el Dies Irae de Mozart, porque si vamos a ser cursis, vamos a serlo en serio: https://www.youtube.com/watch?v=RKJur8wpfYM Al hablar de la Biblia, suena el Nocturno No. 2 de Chopin, porque quería envolverte en un falso sentimiento de seguridad: https://www.youtube.com/watch?v=9E6b3swbnWg Y luego, al hablar de genocidio, suena la Noche en la Montaña Pelona, de Mussorgsky: https://www.youtube.com/watch?v=iCEDfZgDPS8 Y claro que sí, cómo de que no, cerramos con el Verano (Presto) de Vivaldi porque me pinches encanta más que la vida misma y mira que la vida me gusta un chingo porque puedo escuchar a Vivaldi. Mira el video. Mira sus dedos, la coordinación, la disciplina. De esto se trata estar vivos, chingadamadre: https://www.youtube.com/watch?v=-SUvnM3nqfU",
      "id": "guerra-los-primeros-10000-anos"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:39.343Z"
}