{
  "imdbId": "archive-the-runaway-bus-1954",
  "title": "The Runaway Bus (1954): Frankie Howerd film comedy",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-runaway-bus-1954",
      "title": "The Runaway Bus (1954): Frankie Howerd film comedy",
      "description": "The Runaway Bus (1954) British film comedy, starring Frankie Howerd and Margaret Rutherford. The feature film debut of comedian Frankie Howerd . This is the complete release of the film, as restored by me. It includes the cut scene of Frankie in the telephone kiosk, ringing up Granny, which was omitted from the VHS and DVD releases. The film has been corrected to run at its original frame rate of 24fps. Synopsis :  When heavy fog prevents all aircraft from leaving London, a group of passengers take an airline bus to an alternative airport.  However, one among their number is the mastermind behind a bullion robbery, and is particularly keen to escape under cover of the fog!  Starring Frankie Howerd, Margaret Rutherford and Petula Clark. Frankie Howerd made his feature film debut in this 1954 comedy directed by Val Guest , in which he co-stars with Margaret Rutherford and Petula Clark . In an interview, Val Guest explained that the reason for the fog was simply cost. It reduced the money needed to make the film, and speeded up production to about a week in the studio. He got away with this twice, also using fog in a section of The Day the Earth Caught Fire , to save building expensive sets. The script was rush-altered on Runaway Bus for all outdoor scenes. Val Guest wanted radio star Frankie Howerd for the comedy lead, but Howerd would not appear unless Margaret Rutherford was also contracted. As the budget was tight, Guest could afford either decent sets or a film star; so, to save money in order to pay her, he decided to film in fog in order to avoid building anything but the most basic sets. Color:  Black and White Sound Mix:  Mono ( RCA Sound System ) Screen:  622 x 360 px Frame rate:  24fps Format:  mp4",
      "id": "the-runaway-bus-1954"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:22.158Z"
}