{
  "imdbId": "archive-our-town-1940-pulitzer-prize-winning-story-of-small-town-life",
  "title": "Our Town (1940 Pulitzer Prize Winning Story Of Small Town Life)",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/our-town-1940-pulitzer-prize-winning-story-of-small-town-life",
      "title": "Our Town (1940 Pulitzer Prize Winning Story Of Small Town Life)",
      "description": "Plot : Change comes slowly to a small New Hampshire town in the early 20th century. People grow up, get married, live, and die. Milk and the newspaper get delivered every morning, and nobody locks their front doors. --IMDb (by John Oswalt) Grover's Corners is a small town nestled somewhere in New Hampshire in the early 20th century, as explained by the Stage Manager (Frank Craven). The focus is on high school students Emily Webb (Martha Scott) and her next door neighbor George Gibbs (William Holden). As they grow up, Emily and George fall in love and marry,til... Our Town i s based on the 1938 three-act play, 'Our Town' by American playwright Thornton Wilder. The play won a Pulitzer Prize for Drama. Thornton himself adapted his play for the film, aided by American screenwriters Frank Craven and Harry Chandlee. A TV remake, also titled Our Town (2003), was released in 2003. IMDb User Reviews: You have to have life to love life. ( May 18. 2002 by michaelRokeefe ): Thornton Wilder's play put to the screen, well almost. A laid back look at the lives, trials and tribulations of the citizens of a small New England town. Of course, the point is that each life tells a story. The acting seems a little wooden and most of the dialogue monotone. Still yet this is an oldie that will pull at your heart strings. You also examine how important it is to live your life everyday. The cast includes William Holden, Martha Scott, Thomas Mitchell, Beulah Bondi and narrated by Frank Craven. Grab a cup of coffee and prop your feet up...and enjoy a classic. A film I dont want to watch..but I cant stop watching... ( Sep. 11, 2003 by olddiscs ): Why is this a film I dont wanna watch...because it moves me to uncontrollable tears everytime...It hits home...Thornton Wilder must have known my family ,understood my psyche..It hits home... Americana at the turn of the century.. my parents born... not in samll town america but Mid size city... still the thought the virtues the principals, the ideals were the same the happiness of a a home in America.. Mom & Dad providing a home, warm morning breakfasts on a cold winter day.. family members irrelevant yet unforgettable... the birthdays the graduations & the weddings the changes & the phases of life... and death are simply adequately & beautifully presented by Thornton Wilder & his play & screen play.. Emily portrayed by Marhta Scott is superb... if this doesnt bring a tear to your eye, you are not human... & George layed by William Holden perfectly & the best supporting cast ever assembled.. Fay Bainter, Beulah Bondi, Thomas Mitchel, Guy Kibee,Dora Merande etc etc...non stop emotions.. non stop truth.. and the score ,all so memorable... i shouldnt watch this film..becsause its non stop tears everytime... but to me its an American Classic,,, maybe underrated...watch it absorb every line & cry your eyes out.. Quotes : 1) Mrs. Julia Hersey Gibbs : It seems to me, once in your life, before you die, you ought to see a country where they don't speak any English and they don't even want to. 2) Mr. Morgan : [ Opening ] The name of our town is Grover's Corners, New Hampshire. It's just cross the line from Massachusetts. Latitude is 42 degrees, 40 minutes. Longitude is 70 degrees, 37 minutes. Running right through the middle of the town is Main Street. Cutting across Main Street on the left is the railroad tracks. Beyond the railroad tracks is Polish Town. You know, foreign folks who come here to work in the mills or a couple of Canuck families, and the Catholic church. You can see the steeple on the Congregational church. Presbyterian is just across the street. The Methodist and the Unitarian are up a block. The Baptist church is down in the holla' [Coughs] 3) Mr. Morgan: by the river. Next to the post office is the town hall; Jail's in the basement. Bryan once made a speech right from those very steps. It's a nice town, y'know what I mean? Nobody very wonderful ever come out of it, so far as we know. The earliest dates on the tombstones up in the cemetery say 1670. They're Grovers and Cartwrights and Gibbses and Herseys. Same names as you find around here now. First, we'll show you a day in our town.Not as it is today in the year 1940, but as it used to be in the year 1901. All right, Operator, let's start. Yes sir, that's the way our town looked back in the year 1901. Along Main Street is a row of stores with hitching posts and blocks in front of them. The first autoobile is going to come along in about five years. The date is June 7, 1901. It's just before dawn. [ Rooster crows ] 4) Mr. Morgan : Yeah, just about. The sky's 0already beginning to show some streaks of light over there in the east, back of our mountain. The morning star gets wonderful bright the moment before it has to go. The only lights on in the town are in a cottage over in Polish Town where a mother is just giving birth to twins and down in the depot where Johnny Hawkins is just getting ready to flag the 5:45 to Boston. [Train Whistle] 5) Mr. Morgan : There she is now. Of course, naturally, out in the country and around they've been up for some time, what with milking and so on. But town folks sleep late.",
      "id": "our-town-1940-pulitzer-prize-winning-story-of-small-town-life"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:07:46.049Z"
}