{
  "movieId": "archive-la-mascara-de-fuego-1941-vose-sellada",
  "title": "LA MÁSCARA DE FUEGO – (1941) VOSE",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-mascara-de-fuego-1941-vose-sellada",
      "id": "la-mascara-de-fuego-1941-vose-sellada",
      "title": "LA MÁSCARA DE FUEGO – (1941) VOSE",
      "description": "Título original: The Face Behind the Mask Estreno general en los Estados Unidos: 16 de enero de 1941. En México se estrenó el 4 de julio de 1941 en el enorme cine Orfeón (3,942 butacas) del D.F. (Ciudad de México). Con esta película fue inaugurado el cine BERNARDO REYES en la ciudad de Monterrey, NL, México el viernes 24 de julio de 1942. Duración: 69 min. País de origen: Los Estados Unidos Dirección: Robert Florey Guion: Paul Jarrico ,  Allen Vincent Reparto: Peter Lorre  como Janos 'Johnny' Szabo; Evelyn Keyes  como Helen Williams; Don Beddoe  como el teniente Jim O'Hara; George E. Stone  como Dinky; John Tyrrell  como Watts; Stanley Brown  como Harry   Sinopsis Janos Szabo, un oscuro inmigrante húngaro usa una máscara porque su rostro ha quedado desfigurado por terribles quemaduras. En tal circunstancia, le resulta imposible conseguir un trabajo. Solo y desamparado, poco a poco se irá hundiendo en el mundo del hampa, del cual únicamente lo podrá sacar el amor que siente por una joven ciega.   Producción La película está basada en la obra de radio  Interim  de Thomas Edward O'Connell. ​ Florey previamente hizo contribuciones a la película  Frankenstein  de  Universal Studios  de 1931 antes de que  James Whale  fuera contratado como director, y había dirigido  Murders in the Rue Morgue . ​ El guion de la película fue escrito pensando específicamente en Peter Lorre para el papel principal de la película, con paralelismos con la propia vida de Lorre, ​ como recordó el coguionista Jarrico: «El guion estaba 'a la medida', según recuerdo, en cierto sentido, Lorre ya había sido elegido.» ​ Lorre fue elegido para el papel principal de la película de Janos 'Johnny' Szabo como la primera de un acuerdo de dos películas que fue contratado para hacer para Columbia Pictures.   Evelyn Keyes, que había actuado en  Lo que el viento se llevó  de  Victor Fleming , fue elegida como el interés amoroso de Janos, Helen Williams. La fotografía principal se realizó del 6 al 26 de noviembre de 1940 y duró 20 días. Recepción Las críticas contemporáneas de la película han sido más positivas. La  Guide to Movies and Videos  de  Blockbuster  calificó la película con tres de cuatro estrellas, elogiando la dirección, la premisa y las actuaciones de la película. Leonard Maltin otorgó a la película tres de las cuatro estrellas posibles y calificó la película como «extremadamente bien hecha con un presupuesto reducido.» ​ Dennis Schwartz de  Ozus' World Movie Reviews  le dio a la película una B+ en una escala de A+ a F, calificándola de «una historia de terror que ofrece una visión del  sueño americano  que se vuelve fea y equivocada.» ​   TV Guide  calificó la película con dos de cuatro estrellas describiéndola como «una película elegante sobre el sufrimiento humano.» Géneros: Film Noir, Cine Negro, Ciencia Ficción, Thriller, Horror, Fantástico, Romance, Crimen, misterio, suspense, Drama,",
      "fileSize": 4190907388,
      "addedAt": "2026-01-07T00:09:24.702Z",
      "thumbnail": "https://archive.org/services/img/la-mascara-de-fuego-1941-vose-sellada",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 290
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}