{
  "imdbId": "archive-charlie-chaplin-.-the-cure-1917-classic-siletnt-film-noir-comedy",
  "title": "Charlie Chaplin . The Cure (1917 Classic, Silent, Film Noir, Comedy)",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/charlie-chaplin-.-the-cure-1917-classic-siletnt-film-noir-comedy",
      "title": "Charlie Chaplin . The Cure 1917 Classic Siletnt Film Noir Comedy",
      "description": "PLOT : The Cure evolves around alcohol, being made just prior to prohibition but during a period where the politicians were debating the evils of alcohol. _Wikipedia STORYLINE : Chaplin plays a drunkard who is attending a hydropathic hotel, presumably to dry out, but brings along a big suitcase full of alcohol. He gets trapped in a spinning revolving door then traps the foot of a large man with a bandaged foot, suffering from gout. _Wikipedia PRESERVATION STATUS : On September 4, 2013 a missing part of the end of the film was found and will be released on a future DVD. A restored version of The Cure was presented at the San Francisco Silent Film Festival on January 11, 2014._Wikipedia ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh ** (Great Silent Pix, iconauta )",
      "id": "charlie-chaplin-.-the-cure-1917-classic-siletnt-film-noir-comedy"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:23.562Z"
}