{
  "imdbId": "archive-crossing-the-north-sea-on-the-luxury-liner-ss-colombia-from-amsterdam-to-dover-in-1930-in-color",
  "title": "Crossing The North Sea On The Luxury Liner SS Colombia From Amsterdam To Dover In 1930 In Color!",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/crossing-the-north-sea-on-the-luxury-liner-ss-colombia-from-amsterdam-to-dover-in-1930-in-color",
      "title": "Crossing The North Sea On The Luxury Liner SS Colombia From Amsterdam To Dover In 1930 In Color!",
      "description": "A highly interesting film about a trip from Amsterdam's harbor to Dover on the luxury liner \"SS Colombia\" almost a century ago. The Colombia starts its journey through the Noordzee kanaal with its sea locks at IJmuiden and then follows the Dutch coast across the North Sea to enter the Channel for its final leg of the journey to Dover. Apparently this must have been a business excursion for the top brass of Dutch (?) companies to the UK. The passengers consist mainly of well-dressed men who enjoy the many facilities on board, including a luxurious diner. However, a group of nuns can also be seen boarding the ship. The freight and passenger vessel SS Colombia was put into service in 1930. It was the flag ship of the Koninklijke Nederlandse Stoomboot-Maatschappij until it was requisitioned at the beginning of WWII by the Dutch Navy on 8 November 1940. It then became the Hr.Ms. Colombia to serve as submarine mother ship. Subsequently the Colombia was sent to the Dutch East Indies. Eventually it was taken out of service in 1943. The original B&W film has been speed-corrected, motion stabilized, enhanced and colorized by means of Artificial Intelligence software. Music: Rand Aldo. Source B&W footage: Beeld En Geluid.",
      "id": "crossing-the-north-sea-on-the-luxury-liner-ss-colombia-from-amsterdam-to-dover-in-1930-in-color"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:51.626Z"
}