{
  "movieId": "archive-dresden-then-and-now-1080p-s-2024",
  "title": "Wonderful Dresden - Then and Now (1930's - 2024)",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dresden-then-and-now-1080p-s-2024",
      "id": "dresden-then-and-now-1080p-s-2024",
      "title": "Wonderful Dresden - Then and Now (1930's - 2024)",
      "description": "Welcome to Dresden! You may have seen our restored colorized footage about Dresden before World War II. In September 2024 my wife and I visited Dresden to see it with our own eyes. The first part of this video shows comparison shots of Dresden in the mid 1930s and now. It is remarkable how much of the old city has been restored since the devastating bombing of the city in February 1945 by the allied forces. The second part of this film shows Dresden how it is now. Please enjoy the images of in particular the old city with the Frauenkirche, the Zwinger Palace complex and the area near the Elbe river. The Frauenkirche remained a pile of rubble between 1945 and the German unification in 1989. The DDR government left it as a reminder to the war. In 1993 reconstruction commenced which cost around 130 million Euros and was completed in 2005. The reconstruction is truly remarkable. The dark stones among the new sand stones are from the old bombed church. The interior of the church is a splended mix of stunning craftmanship but also gives a somewhat kitsch impression. It resembles more a theater, including balconies than a church, probably due to the church's octagonal shape (not built in the shape of a cross). The huge inner court of the Zwinger Palast is currently under reconstruction and should be beautiful once re-instated to its original glory with the many fountains. Remarkably enough we filmed the Carola Brucke hours before it collapsed into the Elbe river at 03:00h during the night. A tram passed over the bridge a quarter of an hour before it collapsed. Nobody was injured, but the city's heating system that ran along the bridge was destroyed and shipping on the river Elbe has become impossible. Please read the CC captions (still to be added). Thanks for watching! Music: Howard Harper Barnes. Source 1930s footage: Archive.org. Source 2024 footage: Personal 4K video camera recording.",
      "fileSize": 2804299109,
      "addedAt": "2026-01-07T00:08:15.375Z",
      "thumbnail": "https://archive.org/services/img/dresden-then-and-now-1080p-s-2024",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 89
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.375Z"
}