{
  "imdbId": "archive-AssignmentOuterspace16x9",
  "title": "Assignment Outerspace 16x9",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AssignmentOuterspace16x9",
      "title": "AssignmentOuterspace16x9",
      "description": "A much improved, widescreen copy of Antonio Margheriti's first Italian space opera, \"Assignment  Outer Space,\" also known as \"Spacemen.\" The claim made in the Wikipedia article below that this film was released on a triple bill with \"First Spaceship on Venus\" and \"The Mysterians\" is a fantasy. It was originally released with \"Phantom Planet,\" and was (arguably) the better film on that double bill. This film is interesting for having a black protagonist, American choreographer, Archie Savage, in a pivotal role. Space Men From Wikipedia, the free encyclopedia   (Redirected from  Assignment Outer Space ) Assignment Outer Space Directed by Antonio Margheriti Produced by Samuel Z. Arkoff Hugo Grimaldi Written by Ennio De Concini Jack Wallace Starring Rik Van Nutter Gabriella Farinon David Montresor Music by Lelio Luttazzi  (as J.K. Broady) Gordon Zahler Carlo Savina  (uncredited) Cinematography Marcello Masciocchi Distributed by American International Pictures Release dates 25 August 1960 Running time 73 minutes Country Italy Language Italian Space Men  (released in the USA as  Assignment Outer Space ) is a 1960  science fiction film  starring  Rik Van Nutter  and directed by  Antonio Margheriti . It follows an assignment by  Interplanetary News  reporter Ray Peterson aboard a  space station  in the 21st century. Despite problems with the base commander, he is eventually responsible for stopping a space ship which threatens to destroy the  Earth . The film was released in the  United States  as part of a triple bill with the  East German  film  First Spaceship on Venus  and the Japanese  film  The Mysterians . It was director Antonio Margheriti's first assignment, and this film showed what quality he could deliver while working with a minuscule budget.",
      "id": "AssignmentOuterspace16x9"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:03:23.954Z"
}