{
  "imdbId": "archive-facundo-la-sombra-del-tigre-1994",
  "title": "Facundo, La Sombra Del Tigre (1994)",
  "year": 1994,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/facundo-la-sombra-del-tigre-1994",
      "title": "Facundo La Sombra Del Tigre",
      "description": "Facundo, la sombra del tigre  es una película de  Argentina  filmada en colores dirigida por  Nicolás Sarquís  sobre su propio guion escrito en colaboración con el guion de  José Pablo Feinmann ,  Eduardo Scheuer ,  Eduardo Saglul  y  Daniel Moyano  que se estrenó el 31 de marzo de 1995 y tuvo como actores principales a  Lito Cruz ,  Norma Aleandro ,  Dora Baret  y  Víctor Manso . Tuvo el título alternativo de  El general Quiroga va en coche al muere . Es la primera película realizada en el país por el sistema de Super 16 que utiliza película de menor costo. Sarquis había intentado en 1976 realizar este proyecto, sin éxito. En forma paralela y mediante convenio con la Subsecretaría de Cultura de la Nación,  Argentina Televisora Color  e  Instituto Nacional de Cine y Artes Audiovisuales  se realizó una miniserie de 4 capítulos declara de interés nacional en junio de 1996. La extensión del filme provocó demoras en su estreno comercial hasta que el propio director alquiló una sala al efecto. Fue filmada en las  provincias de Córdoba  y  La Rioja  y en  San Antonio de Areco  y  San Andrés de Giles  en la  provincia de Buenos Aires .  (Wikipedia) Sinopsis Mientras viaja al norte para intervenir en un conflicto entre las provincias de Salta y Tucumán, el general  Juan Facundo Quiroga  rememora algunos acontecimientos políticos y militares y es asesinado a manos de un oscuro capitán antes de llegar a su destino. [ 1 ] Reparto Participaron del filme los siguientes intérpretes: [ 1 ] ​ Lito Cruz  … Facundo Quiroga Norma Aleandro Dora Baret Víctor Manso Claudio García Satur Andrea Politti Martín Adjemián Cristina Fernández Oscar Ferrigno (hijo) Juan Carlos Puppo Héctor Malamud María Bufano Ricardo Alanis  …Escolta de Quiroga Carlos Portaluppi Miguel Dedovich Roberto Cesán Adriana Pérez Gianny  …La loca de la teta Déborah Vidret Sergio Corona",
      "id": "facundo-la-sombra-del-tigre-1994"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:52.954Z"
}