{
  "imdbId": "archive-the-haunted-palace-1963",
  "title": "The Haunted Palace 1963",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-haunted-palace-1963",
      "id": "the-haunted-palace-1963",
      "title": "The Haunted Palace 1963",
      "description": "The Haunted Palace  is a 1963  Gothic   fantasy   horror film  released by  American International Pictures , starring  Vincent Price ,  Lon Chaney Jr.  and  Debra Paget  (in her final film), in a story about a village held in the grip of a dead  necromancer . Directed by  Roger Corman , it is one of  his series of eight films  based largely on the works of American author  Edgar Allan Poe . Although marketed as \"Edgar Allan Poe's  The Haunted Palace \", the film actually derives its plot from  The Case of Charles Dexter Ward , a novella by  H. P. Lovecraft . [ 4 ]  The film's title is derived from a  6-stanza poem by Poe , published in 1839 (which was later incorporated into Poe's horror short story \" The Fall of the House of Usher \"), and the film uses eight lines from the poem within the framing of the story. In 1765, the inhabitants of  Arkham ,  Massachusetts , are suspicious of the strange phenomena surrounding the grand \"palace\" that overlooks the town. They suspect the palace's owner, Joseph Curwen, is a  warlock . A young girl wanders up to the palace in a trance-like state. She is led by Curwen and his mistress, Hester, down into the dungeons. The girl is subjected to a strange ritual, in which an unseen creature rises up from a covered pit. The townspeople observe the girl wandering off, and they storm the palace to confront its owner. Though the girl appears unharmed, the townspeople surmise that she has been bewitched to forget what happened to her. They drag Curwen out to a tree where they intend to burn him. The mob leader, Ezra Weeden, insists that they do not harm Hester (to whom he had been previously engaged to marry). Before being burned alive, Curwen puts a  curse  on Arkham and its inhabitants and their descendants, promising to rise from the grave to take his revenge. In 1875, 110 years later, Curwen's great-great-grandson, Charles Dexter Ward, and his wife Anne arrive in Arkham after inheriting the palace. They find the townsfolk hostile towards them and are disturbed by the horrific  deformities  that afflict many of Arkham's inhabitants. Charles is surprised by how well he seems to know the palace and struck by his strong resemblance to a portrait of Curwen. He and Anne meet Simon, the palace caretaker, who persuades them to stay at the palace and to forget the townspeople's hostility. Charles becomes more and more obsessed with the portrait of Curwen, and at times seems to change in his personality. Charles and Anne befriend the local doctor, Marinus Willet. He explains the circumstances surrounding Curwen's death, and that the townspeople blame the deformities on the curse. He tells them of a  black magic  book, the  Necronomicon , believed to have been in Curwen's possession, and which Curwen used to summon the  Elder Gods   Cthulhu  and  Yog-Sothoth . Curwen's plan was to mate  mortal  women with these beings in order to create a race of super-humans, which led to the deformities. The townspeople are terrified that Curwen has come back in the form of Charles to seek his revenge. Dr. Willet advises Charles and Anne to leave the town. Charles seems to be falling under the control of something and insists that they stay in Arkham. One night, Charles is  possessed  by the spirit of Joseph Curwen. Curwen reunites with two other warlocks, Simon and Jabez, who also have possessed their descendants. They make plans to continue their work and resurrect Hester. Curwen's hold on Charles is limited, and he tells Simon and Jabez that Charles is fighting him. Curwen begins his revenge on the descendants. He kills Ezra Weeden's descendant Edgar by releasing Weeden's monstrously deformed son from his locked room and attacks Micah Smith's descendant Peter with fire. Curwen takes complete control of Charles and he attempts to rape Anne. Anne seeks help from Dr. Willet, whom Curwen then attempts to persuade that Anne is insane. Curwen and his associates succeed in resurrecting Hester. The townspeople discover Peter Smith's charred corpse and storm the palace. Dr. Willet and Anne try to rescue Charles and discover a secret entrance to the dungeons. They are ambushed by Curwen, Simon, Jabez, and Hester. Anne is offered as a mate to the creature in the pit, while the residents break in and begin to raze the palace. The portrait of Curwen is destroyed, breaking Curwen's hold over Charles. Charles releases Anne, then urges Dr. Willet to take her away from the palace. While Curwen's associates seize Charles, Dr. Willet shepherds Anne from the burning palace. He returns to rescue Charles, and finds that Simon, Jabez, and Hester have escaped and left him to die. Charles and Willet barely escape the flames. Charles and Anne fervently thank Willet for saving their lives. However, it is apparent that Joseph Curwen still inhabits Charles' body.",
      "fileSize": 1000701151,
      "addedAt": "2026-01-07T00:12:10.587Z",
      "thumbnail": "https://archive.org/services/img/the-haunted-palace-1963",
      "language": "eng",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 1939
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.587Z"
}