{
  "imdbId": "archive-louise-tobin-with-emil-colemans-orchestra",
  "title": "Louise Tobin with Emil Coleman's Orchestra",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/louise-tobin-with-emil-colemans-orchestra",
      "title": "Louise Tobin with Emil Coleman's Orchestra",
      "description": "Two short films featuring Louise Tobin with Emil Coleman and His Orchestra . The songs and film titles are identical. The source file was inexplicably flipped horizontally, so I corrected that and also slightly adjusted the sync between the video and audio. It still isn't entirely perfect, but this was a low budget short film and I don't think much effort was made post production to perfectly align Tobin's lip syncing with the pre-recorded soundtrack, but I did my best with what I have (I'm not a professional). Hope you all enjoy it. November 12, 1945 Just One of Those Things November 26, 1945 June Comes Around Every Year Reference : The Soundies Distributing Corporation of America : a history and filmography of their \"jukebox\" musical films of the 1940s  (pp. 150, 152) **FAIR USE NOTICE** This content may contain Copyrighted (©) Material. The use of which has not always been specifically authorized by the Copyright Owner(s). Such material is being made available to advance greater understanding of Human Rights, Ecological, Psychological, Economic, Democratic, Scientific, Ethical, Anthropological, Egalitarian, Socio-Political, Historical, Cultural, Academic, or various other socially-beneficial, humanitarian and educationally-valid research topics or scholarly endeavors. It is asserted that use of such material constitutes a ''Fair Use'' of any such Copyrighted Material as provided for in Section 107 of the US Copyright Law. In accordance with Title - 17 U.S.C. Section 107 , this Material is distributed without profit, or motivation for commercial profit, to those who have expressed a prior general interest in receiving similar information for research and educational purposes.",
      "fileSize": 43908717,
      "id": "louise-tobin-with-emil-colemans-orchestra"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.893Z"
}