{
  "imdbId": "archive-TheCenturyOfTheSelf3AdamCurtis360p25fpsH264128kbitAAC",
  "title": "The Century of the Self - Episode 3 of 4 (Spanish subtitles)",
  "year": 2002,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheCenturyOfTheSelf3AdamCurtis360p25fpsH264128kbitAAC",
      "title": "TheCenturyOfTheSelf3AdamCurtis360p25fpsH264128kbitAAC",
      "description": "Episode 3 In the 1960s, a radical group of psychotherapists challenged the influence of Freudian ideas in America. They were inspired by the ideas of Wilhelm Reich, a pupil of Freud's, who had turned against him and was hated by the Freud family. He believed that the inner self did not need to be repressed and controlled. It should be encouraged to express itself. Out of this came a political movement that sought to create new beings free of the psychological conformity that had been implanted in people's minds by business and politics. This programme shows how this rapidly developed in America through self-help movements like Werber Erhard's Erhard Seminar Training - into the irresistible rise of the expressive self: the Me Generation. But the American corporations soon realised that this new self was not a threat but their greatest opportunity. It was in their interest to encourage people to feel they were unique individuals and then sell them ways to express that individuality. To do this they turned to techniques developed by Freudian psychoanalysts to read the inner desires of the new self. **FAIR USE NOTICE** This video may contain Copyrighted (©) Material. The use of which has not always been specifically authorized by the Copyright Owner(s). Such material is being made available to advance greater understanding of Human Rights, Ecological, Psychological, Economic, Democratic, Scientific, Ethical, Anthropological, Egalitarian, Socio-Political, Academic, and various other socially-beneficial and educationally-valid research topics and scholarly endeavors. It is asserted that use of such material constitutes a ''Fair Use'' of any such Copyrighted Material as provided for in Section 107 of the US Copyright Law. In accordance with Title - 17 U.S.C. Section 107, this Material is distributed without profit, or motivation for commercial profit, to those who have expressed a prior general interest in receiving similar information for research and educational purposes. See also: Title - 17 U.S.C. Section 107 Propaganda (1928) by Edward Bernays Wikipedia Go to: Episode 1 Episode 2 Episode 4",
      "id": "TheCenturyOfTheSelf3AdamCurtis360p25fpsH264128kbitAAC"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:36.387Z"
}