{
  "imdbId": "archive-AirForceSpecialFilmProject416powerOfDecision",
  "title": "Air Force Special Film Project 416,\"Power of Decision\"",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AirForceSpecialFilmProject416powerOfDecision",
      "id": "AirForceSpecialFilmProject416powerOfDecision",
      "title": "Air Force Special Film Project 416,\"Power of Decision\"",
      "description": "This item was obtained and uploaded by the National Security Archive - http://www.nsarchive.org - an independent non-governmental research institute and library located at The George Washington University. Use is authorized in accordance with Creative Commons license and with credit to the National Security Archive. For more information see the complete posting at the National Security Archive's Nuclear Vault - http://www.nsarchive.org/nukevault/ebb336 The following description of the film is from the U.S. Air Force Motion Picture Film Depository index card: 6 Reels, 35mm, color, sound, edited, 5600 feet, quality: Good (Basic: Orig color) Coverage of simulated war plan action, in the event of an attack, which was executed at the Operation Control Roomm, Offutt AFB, Nebraska, and at the underground control room (location SECRET), by Strategic Air Command. Footage includes pilots and ground crewmen scrambling; pilots boarding aircraft; B-47's, B-52's, and B-58's taxiing, taking off, maneuvering, and landing; and a KC-135 refueling a B-52. Also included are scenes of the launching of the Bull Goose, Rascal, Snark, and Thor missiles.",
      "fileSize": 4411344258,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AirForceSpecialFilmProject416powerOfDecision",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 24312
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}