{
  "imdbId": "archive-LE_ORME",
  "title": "LE ORME",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LE_ORME",
      "id": "LE_ORME",
      "title": "LE ORME",
      "description": "“Le Orme” (a/k/a “Footprints on the Moon” and “Primal Impulse”) has been described variously as an Italian giallo, a sci-fi film, a mystery, or a psychological thriller. Ultimately, it defies pigeonholing. It stars Florinda Bolkan as Alice Cespi, a professional translator, who is tormented by a recurring nightmare; in it, a lunar-landing team deliberately abandons a colleague on the moon’s surface as part of a scientific experiment. Alice arrives for work one day and is summarily canned. The reason? She’d walked out of an international astronomy conference and disappeared for three days, incommunicado. Those three days are a complete blank for her. Alice finds a few vague clues -- a torn postcard from Garma, a resort she’s never visited; an earring, a unfamiliar bloody yellow dress that fits her perfectly -- and sets out to learn what has happened. When she arrives in Garma, all of the strangers are delighted to see her “again” -- but claim that she's another person entirely. And that’s just the beginning… Although the storytelling in “Le Orme” is fairly linear, it's also disorienting -- so you’ll have to pay attention to it. There are blind alleys, red herrings and (possibly) misleading implications throughout. Cast includes Bolkan, Peter McEnery, Nicoletta Elmi, and a cameo by Klaus Kinski. Titles and credits are in Italian, but all dialogue is in English. (In an earlier forum post, oldbones noted that “For [Primal Impulse]...check for a missing or invalid notice. That is the ONLY way they would be pd.” The movie has no copyright notice at all.)",
      "fileSize": 1811026812,
      "addedAt": "2026-01-07T00:06:30.622Z",
      "thumbnail": "https://archive.org/services/img/LE_ORME",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 34293
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.622Z"
}