{
  "imdbId": "archive-el-alma-del-bandoneon-1935",
  "title": "El Alma Del Bandoneon ( 1935)",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-alma-del-bandoneon-1935",
      "title": "El Alma Del Bandoneon",
      "description": "El alma de bandoneón  es una película  argentina  en blanco y negro dirigida por  Mario Soffici  que fue estrenada el 20 de febrero de 1935. Sus principales protagonistas fueron  Libertad Lamarque ,  Santiago Arrieta ,  Domingo Sapelli  y  Dora Davis . En su transcurso se ejecuta por vez primera en el cine el tango  Cambalache  de  Enrique Santos Discépolo . (Wikipedia) Sinopsis Un hombre rico de campo envía a su hijo a la ciudad para estudiar y el muchacho se dedica a otra cosa, segura influencia de  M´hijo el dotor , de  Florencio Sánchez . El estanciero se opone a que el hijo tenga relaciones con el tango y con sus cultores a pesar de que su mayor aspiración es ser compositor. Nace entonces su relación romántica con una muchacha que quiere triunfar en el canto. La pareja pasa por enormes sacrificios y renunciamiento y debe atravesar, entre otros trances dramáticos, la muerte de una hijita de dos años y medio y el asedio de un exnovio de la protagonista, un villano que quiere ponerse serio pero no puede, al menos visto desde las perspectiva actual. Escenas a destacar La radio y sus figuras populares así como sus oyentes son uno de los temas de este filme. Una de sus más logradas secuencias se desarrolla cuando el cantor interpreta el tango  Cambalache  y el objetivo recorre las paredes y los sillones colmados del estudio de radio desde donde se transmite, para encontrarse finalmente con las caras absortas de quienes en sus casas, frente al receptor, parecen ilustrar la letra de Discèpolo. Gogó Andreu hace una fugaz aparición en el papel de botones Reparto Libertad Lamarque  ...Elda Santiago Arrieta  ...Fabián Domingo Sapelli  ...don Julián Dora Davis  ...Calandria Pepita Muñoz  ...doña Marta Enrique Serrano  ...Enrique Ernesto Famá Charlo  ...cantante Héctor Calcaño  ...Meneco Francisco Lomuto Miguel Gómez Bao Gogó Andreu  ...botones Dringue Farías  ...Chofer de Fabián Reparto",
      "id": "el-alma-del-bandoneon-1935"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:52.657Z"
}