{
  "imdbId": "archive-NightShiftAFilmByNikiKarimiQALosAnglesCalifornia",
  "title": "Night Shift A Film By Niki Karimi Q A Los Angles California",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NightShiftAFilmByNikiKarimiQALosAnglesCalifornia",
      "title": "Night Shift A Film By Niki Karimi Q A Los Angles California",
      "description": "Nahid (Leila Zare) is approached by a family friend who is concerned about Nahid's husband Farhad (Mohammad Reza Foroutan), who apparently has been saying things that sound dangerous for Nahid, as well as taking to sleeping in his car, and the neighbour fears for Nahid's life. Nahid suddenly notices his strange, withdrawn behaviour, and starts following him. As she discovers secrets he has been keeping about their financial situation and his new job, her life begins to spiral out of control. The films begins, as stated, as a domestic drama: Nahid gets her daughter off to school, she is frustrated with her husband who barely speaks to her, and she is aware that her life hasn't turned out exactly as she had planned. Her family is in debt and her relationship with her critical mother is strained. As a woman, Nahid has little recourse to take a stand against her husband. But Karimi adds to this the thriller element, which takes the film to a much darker place. When Nahid is first told of her husband's problems, music reminiscent of thriller films comes in softly but distinctly. This scene happens in a medical office, and at first seems out of place, but as the neighbour tells her story and the camera fixes on Nahid's face, the sinister mood emerges. Nahid then starts to follow Farhad, learning first of his change in job, then of their precarious financial situation. She might be an amateur at detecting, but the need to keep her family together overrides hesitation. Nahid has no idea of the kind of people she is dealing with, and as a woman, her ability to act is limited, but try she must. The film takes something of a noir mood, as the electricity in their apartment is turned off and they start to live partially in shadow. Farhad moves from a moody, depressed man to something far more sinister, almost becoming the villain who might, indeed, harm his family rather than admit his shame. This is a world neither of them cares to inhabit, and their navigation is framed by handheld camera and Karimi's attention to the human factors and social ramifications that come with impending poverty. The combination of this kind of domestic drama with the thriller mode is unusual, but Karimi finds an interesting middle ground that allows for the passage of violence and crime into the lives of ordinary people, as oppose to those more adept are dealing with these situations. Karimi has introduced an different perspective on Iranian cinema, one that I hope she will continue.",
      "fileSize": 155244882,
      "id": "NightShiftAFilmByNikiKarimiQALosAnglesCalifornia"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.464Z"
}