{
  "movieId": "archive-sonic-the-hedgehog-the-movie-1996-99",
  "title": "Sonic the Hedgehog: The Movie (1996)",
  "year": 1996,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sonic-the-hedgehog-the-movie-1996-99",
      "id": "sonic-the-hedgehog-the-movie-1996-99",
      "title": "Sonic the Hedgehog: The Movie (1996)",
      "description": "Part 1 Sonic the Hedgehog is relaxing on the beach of South Island with Miles \"Tails\" Prower, when Old Man Owl arrives with a message from the President asking Sonic to come to his office. Once there, they discover Dr. Robotnik has taken the President and his daughter Sara prisoner. After giving exposition of how Planet Freedom works (explaining the two \"dimensions\" of the planet, The Land of the Sky, and The Land of Darkness), Robotnik explains that a giant mecha named Metal Robotnik (\"Black Eggman\" in the original Japanese release) has exiled him from his utopian city of Robotropolis (\"Eggmanland\" in the original) and sabotaged the Robot Generator, which will explode by sunrise the next day. He asks Sonic to head to the Land of Darkness to stop it in exchange for the President and Sara's lives. Once there, Metal Robotnik tries to stop them from reaching the generator. Knuckles the Echidna arrives and rescues them, and all three team up to destroy the mecha. Unbeknownst to them, Metal Robotnik is revealed to have been controlled by Robotnik, with Sara unwillingly in tow. The episode ends with Sonic, Tails, and Knuckles heading to Robotropolis. Part 2 After entering Robotropolis, Knuckles distracts the enemy robots while Sonic and Tails try to stop the generator in the heart of the city. They arrive just in time, but when Sonic pulls the lever, the machine traps him and scans his body. Knuckles frees Sonic just as the machine crumbles to the ground, revealing Dr. Robotnik's newest robot, Hyper Metal Sonic. Dr. Robotnik appears in Metal Robotnik's remains and reveals he lured Sonic to copy his mind, personality, and abilities for Hyper Metal Sonic. Sonic and Metal battle, but Metal easily overpowers Sonic. Tails and Knuckles return to the Land of the Sky, where Tails learns that Metal is out to destroy the planet by digging into the ice caps that hold the Land of the Sky together, allowing lava to emerge and melt the ice. Sonic wakes up in Green Lake City and returns to the Presidential Palace, learning of Metal's goal from the President. Sonic, Tails, and Knuckles go to the ice caps, where Sara is being held hostage by Robotnik, planning to marry her so the two will rule over Planet Freedom after the Land of the Sky's decimation. Sonic encounters Metal and the two have a lengthy battle. Tails manage to corrupt Metal's data, and Sonic severely damages him. During the altercation, the President and Old Man arrive and are trapped in their aircraft, but Metal saves them. Sonic realizes that Metal does have emotions, as he was programmed with Sonic's persona and instincts. Metal gets blown into a crack and falls into a subglacial volcano. Sonic reaches out his hand to help him, but Metal rejects it, telling him \"there is only one Sonic\" before being destroyed by the rising magma. Robotnik states he still has Sonic's DNA and can re-build Metal Sonic, but one of his missiles from the fight inadvertently blows up the disc containing Sonic's DNA. Knuckles then punches Sonic as revenge for Sonic accidentally stepping on him during the brawl, and the two get into a chase, with all the others following behind, ending the episode.",
      "fileSize": 1243530342,
      "addedAt": "2026-01-07T00:11:35.624Z",
      "thumbnail": "https://archive.org/services/img/sonic-the-hedgehog-the-movie-1996-99",
      "language": "eng",
      "year": 1996,
      "collection": "feature_films",
      "downloads": 176
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.624Z"
}