{
  "imdbId": "archive-johnny-stool-pigeon-1949",
  "title": "Johnny Stool Pigeon 1949 ★★★ Crime/Film-Noir [1:15:13] HD",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/johnny-stool-pigeon-1949",
      "title": "Johnny Stool Pigeon 1949 ★★★ Crime/Film-Noir [1:15:13] HD",
      "description": "Johnny Stool Pigeon is a 1949 American film-noir/crime film, directed by William Castle and starring Howard Duff, Shelley Winters,Tony Curtis and Dan Duryea. In San Francisco, during the 1940s, US Treasury agents interrupt an illicit exchange between a sailor and a drug dealer. During the shootout, the sailor is killed but the drug dealer escapes. Later on, the agents pick up the trail of the fugitive drug dealer but arrive at his apartment too late. The dealer lays dead, permanently silenced by a hired hit-man. The only thing the agents have is an address book found on the dead drug dealer's body. Among the clues there is one that seems to be promising: the address of a shady Canadian trading company based in Vancouver. Treasury agent George Morton decides to visit a convict in Alcatraz and solicit his help in infiltrating the underworld. Morton knows that convincing the imprisoned criminal Johnny Evans to become a stool pigeon for the Feds won't be easy. But Evans is Morton's only hope to infiltrate the underworld and crack the case. When the film was released, the film critic for The New York Times, gave the film a tepid review. \"Despite a serious attempt at authenticity it is merely a brisk cops-and-smugglers melodrama, which follows an obvious pattern and is fairly strong on suspense and short on originality and impressive histrionics\". Howard Duff who has had plenty of experience as a gumshoe both on the radio and in films, is appropriately self-effacing, hard and handsome as the intrepid agent. Dan Duryea adds a surprising twist to his usual characterizations of tough hombres as the convict who turns on his own kind, and Shelley Winters gives a credible performance as the blonde moll who also gives the law a much-needed assist. But aside from a few variations their crime and punishment adventures are cast in a familiar mold. Trivia: The old plane seen outside the airport hangar at the end, was a captured Japanese Nakajima B5N (\"Kate\") Torpedo Bomber from World War II. It had been shot down at the attack on Pearl Harbor on December 7, 1941. The plane had been sent to Arizona and stored at the Davis-Monthan Air Force Base, in Tucson, Arizona for warfare aeronautical studies during the beginning of the war. It was lent to the movie producers.",
      "fileSize": 1349270337,
      "id": "johnny-stool-pigeon-1949"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.997Z"
}