{
  "imdbId": "archive-Mommartz_Die_Treppe_1967",
  "title": "1967 Die Treppe (The Stairs)",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mommartz_Die_Treppe_1967",
      "id": "Mommartz_Die_Treppe_1967",
      "title": "1967 Die Treppe (The Stairs)",
      "description": "The author uses the camera as the eye, moves so one-handed through home and welcomes after peeing with his free hand, people at a party. I've seen \"The Stairs\", which was not shown in Knokke at the Cream Cheese, a Beat-Restaurant in the historic center of Düsseldorf, where films from Lutz Mommartz were projected on the wall. The film shows a man at home with the camera: A man who keeps a running camera in his hand, observing him making his household tasks. From a grotesque perspective can be seen: How the man with the camera descends stairs, operats light switches, passes to the loo and then welcomes people, shaking their hands with his free hand. (UWE NETTELBECK, FILMKRITIK, FEBR. 68) In two films Lutz Mommartz brings the camera into the game and forces the viewer to consider their activities: In \"The Stairs\" it has the function of the eye of the director - an often annoying eye - because it at has to be hold with one hand. (ENNO PATALAS, FILMKRITIK, MAI 68) Lutz Mommartz, holding the camera with one hand, filming various everyday activities, from puting on a hat to urinating, runs extensively the stairs of his apartment building and down. But unlike in \"Selfshots\" not his face, but his feet, hands and objects are filmed. (H.P. KOCHENRATH, FILM, JAN. 69)",
      "fileSize": 561107275,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/Mommartz_Die_Treppe_1967",
      "language": "international",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 7652
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}