{
  "imdbId": "archive-theManster1959OriginaltonMitDeutschenUntertiteln2.Versuch",
  "title": "\"The Manster\" Originalton mit deutschen Untertiteln",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theManster1959OriginaltonMitDeutschenUntertiteln2.Versuch",
      "title": "\"The Manster\" Originalton mit deutschen Untertiteln",
      "description": "Als der erste mit einem zweiköpfigen Monster in der Titelrolle genießt dieser Film einen gewissen Kultstatus unter den Science-Fiction- und Horrorfans, die besonders gern an die Szene mit dem dritten Auge erinnern – und die Huldigung in Sam Raimis „Armee der Finsternis“ (1992). Obwohl eine amerikanisch-japanische Koproduktion, waren es Briten, die Regie führten, das Drehbuch lieferten und die beiden Hauptrollen belegten – samt amerikanischem Akzent. Schnickschnack Die Briten Peter Dyneley (Larry) und Jane Hylton (Linda) waren auch im echten Leben Mann und Frau und traten in vielen ihrer Filme gemeinsam auf. Unter Dyneleys bekanntesten Sprechrollen war Jeff Tracey in der britischen Fernsehserie „Thunderbirds“ (1965–66) – auch mit amerikanischem Akzent! Kurosawa-Fans werden unter der Badekappe des Tempelpriesters Shinpei Takagi erkennen, der in den Filmen „Das Schloß im Spinnwebwald“ (1957) und „Die sieben Samurai“ (1954) mitwirkte. In „The Manster“ zeichnete Takagi übrigens auch für die Tricktechnik verantwortlich. Von den 26 Namen im Vorspann blieb „The Manster“ für sieben ihr einziges Werk, darunter die Schauspieler Terri Zimmern (Tara) und Van Hawley (Ian Matthews). Die Schauspieler Jerry Ito (Aida) und Tetsu Nakamura (Suzuki) sind auch später in einem Film zusammen aufgetreten: „Mothra bedroht die Welt“ (1961). Die Werbezeile „Half Man – Half Monster“ („Halb Mann, halb Monster“) lieferte den Originaltitel „The Manster“. Für diese Fassung mit deutschen Untertiteln wurde „Die Spaltung“ in Anlehnung an „The Split“ gewählt, unter dem der englischsprachige Film in den japanischen Kinos lief. Das Wort „split“ kommt übrigens nur zweimal vor: einmal sagt es Dr. Suzuki („He might separate completely! Split into two human beings!“) und einmal steht es auf Dr. Suzukis wissenschaftlicher Darstellung des Mutationsverlaufs.",
      "fileSize": 2200609165,
      "id": "theManster1959OriginaltonMitDeutschenUntertiteln2.Versuch"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.280Z"
}