{
  "movieId": "archive-StoneMill",
  "title": "Stone Mill (Жернова)",
  "year": 2008,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/StoneMill",
      "id": "StoneMill",
      "title": "Stone Mill (Жернова)",
      "description": "Свидетели правды. Альтернативный взгляд на события 1932-33 годов – фильм «МедиаПорта» «Жернова» Семнадцать часов отснятого видео, три с половиной тысячи километров по Харьковской области, тридцать героев-свидетелей. И - ни одного слова за кадром. Никаких комментариев, никаких версий о причинах или мнений исследователей-историков. Даже термин «Голодомор» в фильме не звучит. This movie \"Stone mill\" tell us the true stories about Holodomor. The Holodomor (Ukrainian: Голодомор; translation: murder by hunger) was a famine in the Ukrainian SSR from 1932–1933, during which millions of inhabitants died of starvation in a peacetime catastrophe unprecedented in the history of Ukraine. Estimates on the total number of casualties within Soviet Ukraine range mostly from 2.6 million to 10 million. Primarily as a result of the economic and trade policies instituted by Joseph Stalin, millions of Ukrainians starved to death over the course of a single year. The causes of the famine are a controversial issue and scholars disagree on the relative importance of natural factors, bad economic policies or engineered measures towards Ukrainian peasants. People who worked on this film: Anna Gin, Maks. Holovachev, Ihor Lukashev, Sergei Kozlov, Mysko Barbara, Vlad Aksenov, Zurab Alasania. Subtitles: Myroslav Shkandrij, with assistance from Denys Volkov and Alexei Oukleine. Uploader Alexei Oukleine / Алексей Уклеин - http://uklein.narod.ru",
      "fileSize": 2066324796,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/StoneMill",
      "language": [
        "Ukrainian",
        "English subtitles"
      ],
      "year": 2008,
      "collection": "feature_films",
      "downloads": 3246
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.269Z"
}