{
  "imdbId": "archive-VidaGhahremaniDeath",
  "title": "Vida Ghahremani The legendary Iranian-American actress leaves our world",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/VidaGhahremaniDeath",
      "title": "VidaGhahremaniDeath",
      "description": "Vida Ghahremani The legendary Iranian-American actress leaves our world By Bijan Tehrani, Cinema Without Borders on 06/02/2018 News Today the legendary Iranian-American actress Vida Ghahremani passed away after battling cancer for many years. She went beyond taboos of her time to have the very first on-screen kiss in Iranian film history. \"One day on a park bench he strikes up a conversation with Madame ( Vida Ghahremani ). She is about his age, is from Iran, which she thinks of as Persia, and is living with her Iranian- American daughter. Her English is a little better than Mr.\" (Roger Ebert's Movie Yearbook 2011 0740797697 2010) She was born on May 27, 1937 in Tehran, Iran.  Miss Ghahramani began acting in films as a teenager. She has a long list of credits as an actress and producer. She is known for films such as “ Love and Vengeance ” (1965), “ Storm in Our Town ” ( Toofan dar shahre ma , 1958) and “ The Midnight Terror ” ( Faryade nimeshab , 1961). She went beyond taboos of her time to have the first on-screen kiss in Iranian film history. After leaving Iran, Miss Ghahramani moved to California, became a Screen Actors Guild (SAG) member, and continued her career as an actress in films and on theater stage. Vida Ghahremani together with Golshifteh Farahani Vida is the mother of three and recently finished a film with director Wayne Wang called A Thousand Years of Good Prayers as supporting actress. At Cinema Without Borders were horned to interview her for her American film “ A Thousand Years of Good Prayers ”. Vida Ghahremani , L. Peter Callender and Sofia Ahmad star in Isfahan Blues. (Photo: Alessandra Mello) Filmography  2012 Party USA (Short)  2012 Threshold (Short)   2008 The Stoning of Soraya M.  2007 A Thousand Years of Good Prayers  2002 Hysteria (Video)  1991 Before the Storm (TV Movie)  1989 Dark Holiday (TV Movie)   1989 Guests of Hotel Astoria  1965 Eshq va entegham  1965 Sayyadane namakzar  1962 Khodadad  1962 Sad kilo damad  1962 Postchi  1961 Gorge sahra  1961  The Midnight Terror - Faryade nimeshab   1961 Fire and Ashes - Atash o khakestar  1961 Bachehaye mahal  1961 Dokhtarane hava  1960 Bache naneh  1960 Farda rowshan ast  1959 Afsanehe shemal  1959 Yeki boud yeki naboud   1958 Toofan dar shahre ma",
      "id": "VidaGhahremaniDeath"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:51.108Z"
}