{
  "imdbId": "archive-de-oldify-apeldoorn-parel-der-veluwe-deel-1-en-2-audio-1080p-s-1920",
  "title": "Mooi Apeldoorn, Parel der Veluwe in 1920 in kleur! Town of Apeldoorn in 1920 in color! [AI enhanced]",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-apeldoorn-parel-der-veluwe-deel-1-en-2-audio-1080p-s-1920",
      "id": "de-oldify-apeldoorn-parel-der-veluwe-deel-1-en-2-audio-1080p-s-1920",
      "title": "Mooi Apeldoorn, Parel der Veluwe in 1920 in kleur! Town of Apeldoorn in 1920 in color! [AI enhanced]",
      "description": "Apeldoorn is a beautiful town in the Dutch province of Gelderland. It borders one The Netherlands' most popular nature reserves called \"De Veluwe\". One of the most important buildings on the edge of Apeldoorn is \"Paleis het Loo\", which has been the summer residence of the Dutch royal family for at least three centuries. Its surrounding woods are open to the public for hiking and cycling, but in autumn it is closed to allow the Dutch King to go hunting. This closure and the hunting are becoming more and more controversial by the year. This 20 minute film shows many scenes of the town itself and the surroundings. The motor car had started its entrance into Dutch society, but nevertheless, horse and cart or horse and buggy were still the most important means to get around. This film has been motion-stabilized, speed-corrected, enhanced and artificially colorized by means of modern Artficial Intelligence software. Source: Beeld En Geluid Music: Trevor Kowalski, Johannes Bornlof and others.",
      "fileSize": 3503440817,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/de-oldify-apeldoorn-parel-der-veluwe-deel-1-en-2-audio-1080p-s-1920",
      "language": "eng",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 29
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.603Z"
}