{
  "imdbId": "archive-RogerCormansTheTerror720p",
  "title": "The Terror (Widescreen 720p HD)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RogerCormansTheTerror720p",
      "title": "RogerCormansTheTerror720p",
      "description": "From IMDB : France, 18th century. Lieutenant Andre Duvalier (Jack Nicholson) has been accidentally separated from his regiment. He is wandering near the coast when he sees a young woman (Sandra Knight) and asks her for directions to Coldon, where he hopes to rejoin his regiment. But the woman doesn't answer, doesn't even greet him and walks away. Eventually she takes him towards the sea, where she disappears in rough water. Andre loses consciousness while trying to follow her, and is attacked by a bird and awakes in a house where an old woman (Dorothy Neumann) claims never to have seen the woman. After he leaves, he sees the woman again, and while trying to follow her, is saved by a man from certain death. Andre learns that in order to help the girl, he must go to castle of Baron Von Leppe (Boris Karloff), and when he arrives, Andre sees the woman looking out of a window. However, Baron Von Leppe is old and seems reluctant to let Andre in. He claims there's no woman in the castle, but shows Andre a painting which does indeed portray her. Andre learns that she is the Baroness, who died twenty years ago. What is the baron's secret? Written by Arnoud Tiele (imdb@tiele.nl) and subs111 Archive.org's Flowplayer above shows you the video in about 240p, you can watch the full movie here in it's full 720p resolution. The MKV File provided is 720p and can be played in VLC Media Player The AVI File provided is Standard Definition (640x360; High Quality 2:1 reduction of the MKV) is encoded with the xvid codec here If there is any problem with the files provided or any other derivations you need just comment in the review section below.",
      "id": "RogerCormansTheTerror720p"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:29.470Z"
}