{
  "imdbId": "archive-angel-cop-episode-6-1080p-eng-sub-best-quality",
  "title": "Angel Cop all OVA's 1989-1994",
  "year": 1989,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/angel-cop-episode-6-1080p-eng-sub-best-quality",
      "id": "angel-cop-episode-6-1080p-eng-sub-best-quality",
      "title": "Angel Cop all OVA's 1989-1994",
      "description": "WARNING: GRAPHIC VIOLENCE, DEPICTIONS OF TORTURE AND BRIEF NUDITY  NOT FOR CHILDREN! DISCRETION: THIS SERIES IS ANTI SEMITIC! I DO NOT CONDONE ANTI SEMITISM, I DO NOT CONDONE NATIONALISM AND THE VIDEO DOES NOT REFLECT MY VIEWS! TAKE THIS AS A LESSON AS TO WHY IT'S NOT OK TO MAKE CONTENT LIKE THIS AND WHY THIS TYPE OF MEDIA IS HARMFUL! PLOT: An elite anti-terrorist agent battles terrorists threatening Japan, but a mysterious third player is involved in their own way. EPISODE 1 SPECIAL SECURITY FORCE PLOT:   In the future, terrorism in Japan has become commonplace, and the police have become as brutal as the criminals. A member of the Special Security Force, known as Angel, is the best of the best and will stop at nothing in her fight for justice.  ORIGINAL RELEASE DATE: 09/01/1989 EPISODE 2 THE DISFIGURED CITY PLOT: Psychic hunters and a covert government group stalk the security force.  ORIGINAL RELEASE DATE: 12/21/1989 EPISODE 3 THE DEATH WARRANT PLOT:  With the leader of the Red May in the custody of the SSF, details begin to emerge of a sinister high-level, governmental conspiracy that threatens the future of Japan from within. ORIGINAL RELEASE DATE: 02/11/1990 EPISODE 4 PAIN PLOT:  The actions of Lucifer and the psychic hunters plague the SSF. ORIGINAL RELEASE DATE: 05/20/1994 EPISODE 5 WRATH OF THE EMPIRE PLOT:  With Angel and the SSF trapped, Lucifer plots to destroy cyborg Raiden with her psychic powers ORIGINAL RELEASE DATE: 5/20/1994 EPISODE 6: DOOMSDAY PLOT:  With most of the SSF destroyed, Angel must face Lucifer alone. ORIGINAL RELEASE DATE: 05/20/1994",
      "fileSize": 5362169704,
      "addedAt": "2026-01-07T00:07:24.999Z",
      "thumbnail": "https://archive.org/services/img/angel-cop-episode-6-1080p-eng-sub-best-quality",
      "language": "jpn",
      "year": 1989,
      "collection": "feature_films",
      "downloads": 21081
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.999Z"
}