{
  "imdbId": "archive-gullivers-travels-among-the-lilliputians-and-the-giants-1902-nw-1ko-yu-lp-4",
  "title": "Gulliver's Travels Among the Lilliputians and the Giants (1902) Directed by Georges Méliès",
  "year": 1902,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gullivers-travels-among-the-lilliputians-and-the-giants-1902-nw-1ko-yu-lp-4",
      "title": "Gulliver's Travels Among the Lilliputians and the Giants (1902) Directed by Georges Méliès",
      "description": "Gulliver's Travels Among the Lilliputians and the Giants (1902) 'Le voyage de Gulliver à Lilliput et chez les géants' Director: Georges Méliès Le Voyage de Gulliver à Lilliput et chez les Géants, released in the United States as Gulliver's Travels Among the Lilliputians and the Giants and in the United Kingdom as Gulliver's Travels—In the land of the Lilliputians and the Giants, is a 1902 French silent trick film directed by Georges Méliès, based on Jonathan Swift's 1726 novel Gulliver's Travels. Production: Méliès himself plays Gulliver in the film.[2] The visual differences of scale between Gulliver and the countries he visits were created using multiple exposures and miniature models; Méliès uses substitution splices and careful exposure design to merge the various elements and give them a sense of apparently seamless action.[3] Some scenes were filmed outdoors, in Méliès's garden in Montreuil, Seine-Saint-Denis, so that the camera could be far away enough from the Lilliputians to make them look small. Release and legacy: Gulliver's Travels Among the Lilliputians and the Giants was released by Méliès's Star Film Company and is numbered 426–429 in its catalogues. In early 1903, the Edison Manufacturing Company sold duplicated prints of Gulliver's Travels Among the Lilliputians and the Giants, as well as of Méliès's other films Joan of Arc and Robinson Crusoe, in the United States. Siegmund Lubin also advertised a Gulliver's Travels film in 1903; this may have been an attempt by Lubin to ride on the popularity of Méliès's version. -From Wikipedia",
      "fileSize": 20259070,
      "id": "gullivers-travels-among-the-lilliputians-and-the-giants-1902-nw-1ko-yu-lp-4"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.343Z"
}