{
  "imdbId": "archive-KasiAzGorbehayeIraniKhabarNadareh",
  "title": "Kasi Az Gorbehaye Irani Khabar Nadareh",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/KasiAzGorbehayeIraniKhabarNadareh",
      "id": "KasiAzGorbehayeIraniKhabarNadareh",
      "title": "Kasi Az Gorbehaye Irani Khabar Nadareh",
      "description": "Kasi Az Gorbehaye Irani Khabar Nadareh - No One Knows About Persian Cats ( Kimse Iran Kedilerinden Bahsetmiyor ) Director: Bahman Ghobadi Writers: Bahman Ghobadi (screenplay) Hossein Mortezaeiyan (screenplay) Release Date: 23 December 2009 (France) Cast: Negar Shaghaghi ... Negar Ashkan Koshanejad ... Ashkan Hamed Behdad ... Nader Hichkas ... Himself Hamed Seyyed Javadi ... Himself Ash Koosha ... Ashkan Synopsis: Iranian musicians Negar and Ashkan look for band members to play at a London concert ... and the visa that allows them to leave Tehran to do so... http://www.imdb.com/title/tt1426378/ Konusu: “Kasi Az Gorbehaye Irani Khabar Nadareh” (Kimse Iran kedilerinden bahsetmiyor) filminde Tahran’da kaçak olarak rock, rap ve metal gibi bati müzikleri yapan gençlerin müzik serüvenleri ile Iran’da yasayan gençligin macerasini beyazperdeye tasiyan Kürt yönetmen, son derece çarpici ve etkileyici anlatim yakaliyor. Çünkü Islam’da müzik, zevk ve mutluluk uyandirdigi için günah kabul edilerek yasaklaniyor. Cannes Film Festivali’nin ‘Un certain regard’ bölümünün açilis filmi olarak seyirci ile bulusan ünlü Kürt Yönetmen Bahman Ghobadi’nin “Kasi Az Gorbehaye Irani Khabar Nadareh” (Kimse Iran kedilerinden bahsetmiyor) isimli filmi festivalde yogun ilgi ile karsilandi. Uluslararasi Cannes Film Festivali’nde 2000 yilinda “Sarhos Atlar Zamani” isimli ilk uzun metrajli filmi ile “altin kamera” ile “uluslararasi elestiri” ödüllerini almis olan Bahman Ghobadi’nin bu yil “Un certain regard” bölümünün açilis filmi olan “Kimse Iran kedilerinden bahsetmiyor” isimli filmi ayakta alkislandi. Bu filminde Tahran’da kaçak olarak rock, rap ve metal gibi bati müzikleri yapan gençlerin müzik serüvenleri ile Iran’da yasayan gençligin macerasini beyazperdeye tasiyan Ghobadi, Iran’daki son derece çarpici ve etkileyici anlatim yakaliyor. Çünkü Islam’da müzik zevk ve mutluluk uyandirdigi için günah kabul edilerek yasaklaniyor. Kadin sesi de insani duygulandirdigi için günah sayiliyor. Bu yüzden Iran’da kadinlarin kamu alaninda sarki söylemesi ve gençlerin batili enstrümanlarla müzik yapmalari “Islam’a ve toplumun ahlakina aykiri oldugu” gerekçesiyle yasaklanmis. Batili enstrümanlarla veya politik içerikli ve toplumsal degerleri sorgulayici müzik yapmalarinin yasak oldugu Iran’da yüzlerce müzisyen tutuklanarak hapse atiliyor. Ancak tutuklamalar ve hapis cezalarina ragmen gençler ve kadinlar büyük bedeller ödeyerek müzik yapmaya devam ediyorlar. AHIRDA INEKLERLE BIRLIKTE ROCK MÜZIGI Ama nerede, nasil ve hangi kosullarda? Iste internet ve teknoloji çaginda, bütün yasaklara ragmen Islamci yasalarin sanat yapilmasini engelleyemedigini gözler önüne seren “Kasi Az Gorbehaye Irani Khabar Nadareh”, gençlerin yasaklar yüzünden ahirlarda hayvanlarin içerisinde, bodrumlarda ve insaatlarda müziklerini yapmaya çalistiklarini çarpici bir sekilde perdeye yansitiyor. En büyük hayalleri müzik gruplari ile konserler vermek olan genç çift Askin ve Nager’in (Nigar) tanistiklari Nader (Nadir) ile Tahran’da yer altinda yapilan müzige dogru bizi heyecanli bir yolculuga çikaran yönetmen, Islamci yasaklarin egemenligi altindaki Tahran’da son derece ilginç bir yolculuga çikariyor. Bu yolculuk boyunca akan hareketli müzik adeta Dogu’nun kalbinde Iran kiyafetleri içerisinde Bati enstrümanlari ve söylem biçimleri ile olusmus rock, rap ve metal gibi müziklerle bir isyan çigligina dönüsüyor. Müziklerin ritim ve melodilerinin yani sira içerik açisindan da son derece özgün olusu, edebi yapilari ve felsefeleri ile sarsici bir etki yaratmasi dikkat çekiyor. Bu müziklerle birlikte yansiyan görüntüler de çarpici bir kontrast yaratarak son derece hareketli bir mizah ile orijinal bir anlatim yakaliyor. Daha önce altin kamera ödülü alan Ghobadi’nin kendine özgü anlatiminda imajin dili ve estetigi ile Dogu’nun en özgün yönetmenleri arasinda yerini aldigi artik kusku götürmüyor. Ayrica yönetmenin mizahindaki derinlik de anlatima eklenince unutulmayacak bir Dogu-Bati sentezi filmi ortaya çikiyor. KÜÇÜK KAMERA ILE MUCIZELER YARATMAK Iran’da 35 milimetrelik kamera kullanimi için özel izin gerektigi için ve böyle bir film için de izin alamadigi için çekimlerini bir “S12K” kamera alarak yapan yönetmen, burada küçük bir kamera ve küçük bütçeler ile de mucizeler yapilabilecegini kanitliyor. Tahran’da çekilecek bir filmi için 2 yil çalistigini ancak izin alamadigini belirten yönetmen, bu yüzden iki yil kaybettigini ve sonuçta bu filmi küçük kamera ile izinsiz bir sekilde çekmek zorunda kaldigini dile getiriyor. Simdiye kadar filmlerini Kürdistan’da çektigi için Iran hükümeti ve bazilari tarafindan “bölücü bir Kürt” olarak suçlandigini belirten Ghobadi, bu suçlamalarin “son derece aptalca” oldugunu vurguluyor. Bu filmi Tahran’da çekmek gerektigi için Tahran’da çektigini belirten yönetmen, Iran hükümetinin birçok filmine sansür uyguladigini ve bu filminin de Iran’da gösterileceginden emin olmadigini bildiriyor. Ayrica filmde oynayan müzisyenlerin yasamlari için de endiselendigini belirten yönetmen, filmde oynayan gençlerin bütün tehlikeleri göze alarak filmde yer aldigini kaydediyor, ancak endiselendiginin de altini çiziyor. BU FILMI KAÇIRMAYIN Iran’da yasaklara maruz kalanlarin sadece müzisyenler olmadigini bazi hayvanlara yönelik yasaklar oldugunu da filmde yansitan yönetmen, “Iran’da insanlar ne bir kedi ne de bir köpekle çikip seyahat edemez. Buna ragmen birçok insanin evinde kedi ve köpek bulunuyor ama bunlarin disari çikarilmasi yasak. Üstelik Iran kedileri de çok pahali kediler. Filmde görüldügü gibi yasaklar yüzünden gençler müziklerini yer altina çekilerek yapmak zorunda kalmalarini kedilerin de disari çikarilamamalari ile karsilastiriyorum. Bir de bu müzisyenlerle görüsmeye gittigimde kedilerin de isiga çikarak müzik dinlediklerini fark ettim” diyerek filmin isminin bu yasaklardan geldigini belirtiyor. Molla kepleri veya ilginç sakal ve kiyafetleri ile Batili enstrümanlarla müzik yapan gençleri Iran Islam rejiminin bu internet ve teknoloji çaginda nereye kadar engelleyecegi merak edile dursun, siz hiçbir yerde duyamayacaginiz ve ömrünüz boyunca bir daha unutamayacaginiz müzikler dinlemek istiyorsaniz bu filmi kaçirmayin.",
      "fileSize": 2504042941,
      "addedAt": "2026-01-07T00:06:30.621Z",
      "thumbnail": "https://archive.org/services/img/KasiAzGorbehayeIraniKhabarNadareh",
      "collection": "feature_films",
      "downloads": 16460
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.621Z"
}