{
  "imdbId": "archive-earth-vs.-the-spider-1958",
  "title": "Earth Vs. The Spider 1958 ★★ CC: Sci-Fi/Horror [1:12:39]",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/earth-vs.-the-spider-1958",
      "title": "Earth Vs. The Spider 1958 ★★ CC: Sci-Fi/Horror [1:12:39]",
      "description": "Earth vs. the Spider (a.k.a. The Spider) is an independently made 1958 American black-and-white science fiction horror film produced and directed by Bert I. Gordon, and stars Ed Kemmer, June Kenney and Eugene Persson. In this giant-creature feature, a man drives into town to buy a birthday present for his teenage daughter Carol, and meets a horrific catastrophe. The next day, Carol enlists the help of her boyfriend Mike, to track down her dad. The kids trace his path to an eerie cave containing a super-sized spider and barely escape with their lives. Naturally, the sheriff doubts their story until it's too late, and the tarantula has taken over the town. FYI: The film's original on-screen title was Earth vs. the Spider, but when The Fly (also released in 1958) became a blockbuster, the title was shortened to just The Spider on all of the advertising material. The original screen title, however, was never changed, so the film is frequently referred to by the title Earth vs. the Spider. The city block that Carol and Mike walk down at the beginning of the movie is part of the famous Universal Courthouse Square backlot, seen in countless films over seven decades. The street this block runs along is the very same one that Marty McFly [Back To The Future] uses to catch the lightning bolt charge and return to 1985 in his DeLorean. Some of the cave interiors were filmed using stills from  Carlsbad Caverns National Park  in New Mexico, with live action scenes filmed at  Bronson Caves  in  Griffith Park  near Los Angeles.  Special effects expert  Paul Blaisdell   created a life-size giant spider leg to use in the film, as well as a desiccated, mummy-like corpse that was used to represent the Spider's victims in several scenes. The same dummy was used to film both the dead truck driver from the beginning of the film as well as a deputy sheriff; all that was required was a change of clothes on the mannequin. DDT. The use of this product is banned in the US, it is used in other countries still today, even with the endorsement of the World Health Organization, which recommends it for use indoors in countries where malaria is considered a major health problem.",
      "id": "earth-vs.-the-spider-1958"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:15.376Z"
}