{
  "imdbId": "archive-Crossroads_french_documentary_on_Robert_Johnson",
  "title": "Crossroads Blues",
  "year": 2010,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Crossroads_french_documentary_on_Robert_Johnson",
      "title": "Crossroads French Documentary On Robert Johnson",
      "description": "\"CROSSROADS\" is a musical movie based on the legends of the black guitarist Robert Johnson, died mysteriously in 1938. It's a PACT WITH THE DEVIL there. One night, at the crossroads, a man forces the fate and sells his soul to the Devil in exchange for glory. The fame arrives fast, but it contains a curse. Robert Johnson dies after the recording of 29 songs. The legend says that there would be a thirtieth piece. Whoever will find it will become immensely rich and will release Johnson of his pact. Robert \" Bud \" Johnson is a homonym of famous Bluesman. He is white, lives in Missouri and follows a strange dream : be the one who will find the thirtieth track. Shot in the Delta of the Blues, between Memphis and Greenwood in Mississipi, CROSSROADS tells Robert's trip \" Bud \" Johnson on the old abandoned roads and the cotton fields. Twenty five musical clips filmed with two cameras to understand the Blues of the origins. The legend of \"Crossroads\" where Robert Johnson would have sold his soul to the Devil is handled within sequences of reconstruction where \" Bud \" Johnson meets the Devil who try repeatedly to prevent him from continuing his quest. Robert Johnson is not only a mythical blues guitarist with his 29 pieces recorded in two days. The legends on his life and its disappearance are known from every guitarists. So much that there would be three graves known for the Bluesman. No blackman, died in the 30s, had such a fame and such a fate. John Doe CROSSROADS, the Road of BLUES - 1 h 30 min. English original version with french subtitles. (Produced by VERSION INTÉGRALE, a french documentary companie). VISIT JOHN DOE WEBSITE for other films : http://filmsjohndoe.wordpress.com/ (french here) « CROSSROADS » est un film musical basé sur les légendes du guitariste noir Robert Johnson, mort mystérieusement en 1938. Il y est question d’un PACTE AVEC LE DIABLE. Une nuit, à la croisée des chemins, un homme force le destin et vend son âme au Diable en échange de la gloire. La renommée arrive vite, mais elle comporte une malédiction. Robert Johnson meurt peu après l’enregistrement de 29 chansons. La légende dit qu’il existerait un trentième morceau. Celui qui le trouvera deviendra immensément riche et libèrera Johnson de son pacte. Robert « Bud » Johnson est un homonyme du Bluesman célèbre. Il est blanc, vit dans le Missouri et poursuit un rêve étrange : être celui qui trouvera le trentième morceau. Tourné dans le Delta du Blues, entre Memphis et Greenwood dans le Mississipi, CROSSROADS raconte le périple de Robert « Bud » Johnson sur les vieilles routes abandonnées et les champs de coton. Vingt cinq clips musicaux filmés à deux caméras font voir et entendre le Blues des origines, acoustique ou électrique. La légende du « Crossroads » où Robert Johnson aurait vendu son âme au Diable est traitée lors de séquences de reconstitution où « Bud » Johnson rencontre des émissaires du Diable qui tentent à plusieurs reprises de l’empêcher de continuer sa quête. Robert Johnson n’est pas seulement un guitariste mythique du Blues avec ses 29 morceaux enregistrés en deux jours. Les légendes sur sa vie et sa disparition sont connues de nombreux guitaristes. A tel point qu’il existerait trois tombes connues du Bluesman. Jamais aucun noir, mort dans les années 30 n’eut une telle renommée et un tel destin. John Doe CROSSROADS, la Route du BLUES – 1 h 30. VO Anglais sous-titres FR",
      "id": "Crossroads_french_documentary_on_Robert_Johnson"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:03:56.432Z"
}