{
  "imdbId": "archive-le-depart-d-arlequin-et-de-pierrette-1900-directed-by-alice-guy-blache",
  "title": "Pierrette’s Escapades (1900) Directed by Alice Guy-Blaché",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/le-depart-d-arlequin-et-de-pierrette-1900-directed-by-alice-guy-blache",
      "title": "Le Depart D Arlequin Et De Pierrette 1900 Directed By Alice Guy Blache",
      "description": "Les Fredaines de Pierrette theatrical poster Directed by Alice Guy Produced by Gaumont Film Company Release date 1900 (France) [ 1 ] Running time 2 minutes Country France Les Fredaines de Pierrette [ Pierrette's Escapades ], or Arrivée de Pierrette et Pierrot , is a 1900 French silent film directed by Alice Guy . [ 1 ] The film was produced by the Gaumont Film Company . Synopsis The film opens with a woman in a pink dress taking off a fluffy white hat and coat. She sits to powder herself. An all-white Pierrot edges into the frame from the right. The woman stands up to gesture to the camera. Pierrot intervenes. They gesture at each other. Pierrot tries to dance and kiss the woman, but she mocks and rebuffs Pierrot. More gestures ensue, then Pierrot leaves. [ 2 ] The woman faces and gestures more towards the camera, then primps herself in front of the mirror. She then mimes looking and listening for someone or something to the right of the frame, then pulls up the sides of her dress to dance. There is a jump cut in which a female Harlequin in a green body suit with a fluffy collar and a yellow bicorne hat and boots appears. The woman and Harlequin perform a pas de deux and end the dance and the film with a kiss. [ 2 ] Description This is a fragment of an unidentified music hall number or ballet. Part of the film is hand colored using stencils. References 1 Miscuglio, Annabella; Daopoulo, Rony; Hribar, Judita (1980). \"Kinomata : la donna nel cinema\" (in Italian). Dealo libri. p. 172. OCLC   613118741 . 2 \"Pierrette's Escapades (1900)\" . Century Film Project . 2016-05-11 . Retrieved 2021-03-14 . From Wikipedia, the free encyclopedia",
      "id": "le-depart-d-arlequin-et-de-pierrette-1900-directed-by-alice-guy-blache"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:07:06.035Z"
}