{
  "imdbId": "archive-de-oldify-nederland-verwoest-deel-3-1080p-s-aip-3-1945",
  "title": "The destruction of the Netherlands during WW-II in color, Part-3: Rotterdam and its harbour (1945)",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-nederland-verwoest-deel-3-1080p-s-aip-3-1945",
      "title": "The destruction of the Netherlands during WW-II in color, Part-3: Rotterdam and its harbour (1945)",
      "description": "In contrast to Rotterdam's city center, Europe's largest port had fallen into German hands with limited damage. The shipyards also suffered virtually no damage and were soon visited by German specialists. Most shipyard managers anticipated that the Germans would win the war and expeditiously concluded contracts with them. These contracts included building and converting ships and dismantling Dutch naval vessels that had not been able to escape to England. All this was done at German expense. Also important suppliers to the yards decided to side with the German forces. Rotterdam's harbour in fact became a German naval base. Germany would pay all bills properly in the coming years and stated they would honour the contracts. However, the Netherlands had to pay occupation tax to the Germans, so in effect the Dutch taxpayer indirectly paid for the military and maritime acquisitions of the occupier. During the course of the war, Rotterdam and the region functioned as an ore transshipment port for the German arms industry in the Ruhr area, as a base for the Kriegsmarine and especially as a supplier of warships. More than 800 ships were built in the Netherlands on German behalf. Furthermore, another 2,000 existing ships were converted for war purposes. Rotterdam made a significant contribution to this. In the first years of the war, Rotterdam's economy revived. Good money was made from the occupier. Especially by the shipyards, which were not just in survival mode. As early as in October 1941 the RAF started bombing the harbour. In the second half of the occupation period, Rotterdam more intensively started to pay the tolls for cooperating with the occupying forces. as it increasingly became the target of Allied bombings, resulting in civilian casualties and damage to residential areas. In that respect the so called \"Forgotten bombing\" should be mentioned, whereby on 31 maart 1943 allied American bombers left Britain to bomb Rotterdam's harbour. Similar to the accidental bombing of The Hague's Bezuidenhout quarters, the American airforce misjudged the bombing target and in stead dropped 70 heavy bombs on the Bospolder-Tussendijken quarters in West Rotterdam, killing 325 people and destroying many homes. The work on the shipyards and in the port became increasingly risky and was also paid less. Working hours were extended and the threat of being put to work in Germany continued to hang over the workers' heads. The port of Rotterdam increasingly became a fortress due to German defenses, which limited the freedom of movement of the residents. In addition, more and more public buildings such as schools and hospitals were requisitioned and put into use by the occupying forces. From September 1944, as the allies were starting to approach, there were tactical air raids by Spitfires and Typhoon fighter-bombers. These were aimed, among other things, at ship targets and launchers for V-weapons in Vlaardingen, Pernis and Hoek van Holland. A number of bombings were spectacular successes, but there were also large-scale bombings with little effect. When the Allies continued to advance towards the Netherlands in 1944, the Germans in Rotterdam and the surrounding area began to requisition material and transport it to the east. This happened on such a large scale that it could safely be called robbery. Later that year, much of the port was destroyed by the Germans to prevent the Allies from using the facilities. The destruction seen in this film is actually the collective result of the allied attacks and the German sabottage as well as merchant ships having been taken out of service at the beginning of the war and subsequently left to rust. Some damage was also caused by small scale sabotage by the Dutch resistance during the war, but its impact was insignificant. Rotterdam harbour's WW-II history ends on May 5, 1945 when the first English ships with food moored at the Lloydkade. After the war the Dutch proactively started to restore the damage of the Rotterdam harbour. It took less than 5 years before the harbour was back to its pre-war strength and efficiency. After afore mentioned bombing on 14th of May 1940, the demolition of the center was a temporary low point for Rotterdam, which found itself in a deep economic dip due to the absence of the pre war merchant navy and passenger ships. On top of the already high unemployment, there were now 80,000 homeless people and many hundreds of destroyed businesses. About two years later Rotterdam's economy started to flourish again. These images give an idea of what Rotterdam looked like during the war as seen from the water. Here on the right in the distance you can see the famous Witte Huis, one of Rotterdam's first high rise buildings that survived the bombing. This part-3 ends with rare, stunningly enhanced and colorized footage of one of Rotterdam's destroyed stations: Delftsche Poort. Music: Trevor Kowalski Source: Beeld En Geluid & Gemeente Archief Den Haag.",
      "id": "de-oldify-nederland-verwoest-deel-3-1080p-s-aip-3-1945"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:59.604Z"
}