{
  "imdbId": "archive-the-unholy-three-1925-colorized-movie-576p-sd",
  "title": "The Unholy Three (restored, colorized, silent version) (1925, crime, imdb score: 6.7)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-unholy-three-1925-colorized-movie-576p-sd",
      "id": "the-unholy-three-1925-colorized-movie-576p-sd",
      "title": "The Unholy Three (restored, colorized, silent version) (1925, crime, imdb score: 6.7)",
      "description": "The Unholy Three is a 1925 American silent crime melodrama film involving a trio of circus conmen, directed by Tod Browning and starring Lon Chaney . The supporting cast features Mae Busch , Matt Moore , Victor McLaglen , and Harry Earles . The Unholy Three marks the establishment of the notable artistic alliance between director Browning and actor Chaney that would deliver eight films to M-G-M studios during the late silent film era. Principal photography went from December 1924 through January 20, 1925. The film had a premiere on May 30, 1925 in San Francisco. It went into release in New York at the Capitol Theatre on August 16, 1925. The film's budget was $114,000, and the worldwide box office gross was $704,000. Stills exist showing Chaney's two makeups in the film, his ventiloquist act, as well as a group shot of the Unholy Three plotting together. The film was remade in 1930 as a talkie directed by Jack Conway . Chaney and Earles repeated their performances as Professor Echo and Tweedledee. Chaney died shortly after filming the 1930 remake, the only film to feature the actor’s voice.",
      "fileSize": 1052678138,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-unholy-three-1925-colorized-movie-576p-sd",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 133
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}