{
  "movieId": "archive-TheCenturyOfTheSelf2TheEngineeringOfConsentAdamCurtis360p25fpsH264128kbitAAC",
  "title": "The Century of the Self - Episode 2 of 4 (Spanish subtitles)",
  "year": 2002,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheCenturyOfTheSelf2TheEngineeringOfConsentAdamCurtis360p25fpsH264128kbitAAC",
      "id": "TheCenturyOfTheSelf2TheEngineeringOfConsentAdamCurtis360p25fpsH264128kbitAAC",
      "title": "The Century of the Self - Episode 2 of 4 (Spanish subtitles)",
      "description": "Episode 2 The programme explores how those in power in post-war America used Freud's ideas about the unconscious mind to try and control the masses. Politicians and planners came to believe Freud's underlying premise - that deep within all human beings were dangerous and irrational desires and fears. They were convinced that it was the unleashing of these instincts that had led to the barbarism of Nazi Germany. To stop it ever happening again they set out to find ways to control this hidden enemy within the human mind. Sigmund Freud's daughter, Anna, and his nephew, Edward Bernays, provided the centrepiece philosophy. The US government, big business, and the CIA used their ideas to develop techniques to manage and control the minds of the American people. But this was not a cynical exercise in manipulation. Those in power believed that the only way to make democracy work and create a stable society was to repress the savage barbarism that lurked just under the surface of normal American life. **FAIR USE NOTICE** This video may contain Copyrighted (©) Material. The use of which has not always been specifically authorized by the Copyright Owner(s). Such material is being made available to advance greater understanding of Human Rights, Ecological, Psychological, Economic, Democratic, Scientific, Ethical, Anthropological, Egalitarian, Socio-Political, Academic, and various other socially-beneficial and educationally-valid research topics and scholarly endeavors. It is asserted that use of such material constitutes a ''Fair Use'' of any such Copyrighted Material as provided for in Section 107 of the US Copyright Law. In accordance with Title - 17 U.S.C. Section 107, this Material is distributed without profit, or motivation for commercial profit, to those who have expressed a prior general interest in receiving similar information for research and educational purposes. See also: Title - 17 U.S.C. Section 107 Propaganda (1928) by Edward Bernays Wikipedia Go to: Episode 1 Episode 3 Episode 4",
      "fileSize": 443880311,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheCenturyOfTheSelf2TheEngineeringOfConsentAdamCurtis360p25fpsH264128kbitAAC",
      "language": "eng",
      "year": 2002,
      "collection": "feature_films",
      "downloads": 1648
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.273Z"
}