{
  "imdbId": "archive-theSultansWife1917",
  "title": "\"The Sultan's Wife\" [1917]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theSultansWife1917",
      "id": "theSultansWife1917",
      "title": "\"The Sultan's Wife\" [1917]",
      "description": "This two reel comedy is not a great film but does feature a young Gloria Swanson, Teddy the Keystone Dog and historically significant \"being the very last comedy produced under the Keystone banner.\" An IMDb reviewer, drednm, wrote... Typical no-plot comedy short from 1917 boasts the great Gloria Swanson as a teenager yachting to India with her family and beau, Bobby Vernon. While ashore they run into trouble and Gloria is kidnapped by the Rajah. Hilarious doings as La Swanson is expected to dress up in a harem outfit while the other \"wives\" don 1917 bathing suits (it's a Mack Sennett film) and go swimming in a pool. Things really start to pop when Bobby calls on the yacht crew to help him form a human ladder so that he and Teddy (dog star of the teens) can broach the palace walls to save Gloria. Much physical comedy with Swanson scolding everyone in sight and batting the Rajah with anything she can find. At one point the kids switch clothes and while Gloria tries to escape Bobby does a belly dance to distract the Rajah. As they are about to lop Gloria's head off, the dog and marines arrive to save the day. Fast and funny. Swanson was, even in her teens, a terrific actress and natural comic. She and Vernon made 9 short films together and are a memorable team. ---------- \"That Danger Girl\" [1916] is here at the Internet Archive http://www.archive.org/details/GloriaSwanson1916",
      "fileSize": 365958487,
      "addedAt": "2026-01-07T00:12:44.280Z",
      "thumbnail": "https://archive.org/services/img/theSultansWife1917",
      "collection": "feature_films",
      "downloads": 27326
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.280Z"
}