{
  "imdbId": "archive-mn-5132-navy-german-and-italian-sneak-craft-1945",
  "title": "German And Italian Sneak Craft (1945)",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mn-5132-navy-german-and-italian-sneak-craft-1945",
      "title": "German And Italian Sneak Craft (1945)",
      "description": "MN5132 Navy // Titles. Pt. 1 of 2 Small submarine through water; three frogmen; human torpedo, midget submarine, explosive boat, torpedo boat. Underwater view of human torpedo. View of ship sinking stern first. Various Mediterranean ports w/ naval ships & description of tonnage sunk. Man in wet suit sanding on beach showing swim fins, breathing apparatus. Many men in water showing technique w/ camouflage head-net, w/ breathing apparatus went under to place delayed mine on ship hull. 04:03:30 Italian version of human torpedo shown lowered by crane onto beach, two warheads clamped on to nose. Function of rudder, wheel, gages & controls shown in CU. Lowered into water. Torpedomen shown in gear, mounting onto vessel then sinking underwater & slowly moving ahead w/ only heads above water. Diagram of approach to ship, planting of charges on each side under the keel. 04:06:24 CU setting timer; diagram of leaving vessel in torpedo. View surfacing and slowly moving. 04:07:12 German frogmen; lowering of one-man human torpedo slightly larger than torpedo it carried. Trailer w/ it mounted pulled under camouflage netting behind truck. Man entering compartment. Allies looking at one, in LS & CU, found on Anzio beach unexploded. 04:08:14 One shown in operation low in water w/ only dome visible as used at night. Torpedo fired, then craft diving and underwater views of moving ahead both with & without torpedo. Leaping craft above water. View of ship from torpedo carrier and operation of firing mechanism. 04:09:58 German all-electric midget submarine lowered by crane. Pulled by truck on camouflaged trailer. Lowered into water, moving on surface; underwater views of it passing w/ propeller working. Periscope above water. This first one was succeeded by The Beaver, one w/ gas auxiliary engine which is shown. Two torpedoes mounted. Operator inside shown. View of craft thru water. POV. WWII Underwater Vehicles; WW2 Axis Naval Weapons; Oddities; Sneak Craft; Oct45; 1945;",
      "fileSize": 401062850,
      "id": "mn-5132-navy-german-and-italian-sneak-craft-1945"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.328Z"
}