{
  "imdbId": "archive-WarningFromSpaceImproved1",
  "title": "Warning From Space (AIP-TV version 1963)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WarningFromSpaceImproved1",
      "title": "WarningFromSpaceImproved1",
      "description": "This is the AIP-TV version of \"Warning from Space\" with the Titra soundtrack and greatly improved color and detail, plus no annoying frameline as seen in other public domain versions. From Wikipedia, the free encyclopedia Warning from Space Japanese film poster Directed by Koji Shima Produced by Masaichi Nagata Written by Hideo Oguni  (screenplay) Gentaro Nakajima  (novel) Jay Cipes  (English dialogue) Edward Palmer  (English dialogue) Starring Keizo Kawasaki Toyomi Karita Bin Yagasawa Shozo Nanbu Bontarô Miyake Mieko Nagai Kiyoko Hirai Isao Yamagata Music by Seitaro Omori Cinematography Kimio Watanabe Editing by Toy Suzuki Studio Daiei Film Distributed by Daiei  (Japan) AIP-TV  (USA) Release dates January 29, 1956  (Japan) October 21, 1957  (UK) 1963  (US) Running time 87 minutes (Japan) 88 minutes (US) Country Japan Language Japanese Warning from Space  or  Mysterious Satellite  ( 宇宙人東京に現わる   Uchūjin Tokyo ni arawaru ? , Spacemen Appear in Tokyo) is a  Japanese science fiction   tokusatsu   film  released in January 1956 by  Daiei , and was the first  Japanese   science fiction film  to be produced in color. In the film's plot,  starfish -like  aliens  disguised as humans travel to Earth to warn of the imminent collision of a  rogue planet  and Earth. As the planet rapidly accelerates toward Earth, a  nuclear device  is created at the last minute and destroys the approaching world. The film, directed by  Koji Shima , was one of many early Japanese monster films quickly produced after the success of  Toho 's  Godzilla  in 1954. The film was loosely based on a novel by Gentaro Nakajima. After release, the film was met with negative reviews, with critics calling it \"bizarre\" and accusing it of using  science fiction   clichés .  Warning from Space  influenced many other Japanese science fiction films, such as  Gorath .",
      "id": "WarningFromSpaceImproved1"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:51.160Z"
}