{
  "imdbId": "archive-RudolphTheRedNosedReindeer1964_201812",
  "title": "Rudolph The Red Nosed Reindeer",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RudolphTheRedNosedReindeer1964_201812",
      "title": "Rudolph The Red Nosed Reindeer",
      "description": "Rudolph the Red-Nosed Reindeer is a 1964 Christmas stop motion animated television special produced by Videocraft International, Ltd. (later known as Rankin/Bass Productions) and currently distributed by Universal Television. It first aired Sunday, December 6, 1964, on the NBC television network in the United States, and was sponsored by General Electric under the umbrella title of The General Electric Fantasy Hour. The special was based on the Johnny Marks song \"Rudolph the Red-Nosed Reindeer\" which was itself based on the poem of the same name written in 1939 by Marks' brother-in-law, Robert L. May. Since 1972, the special has aired on CBS; the network unveiled a high-definition, digitally remastered version of the program in 2005. As with A Charlie Brown Christmas and How the Grinch Stole Christmas, Rudolph no longer airs just once annually, but several times during the Christmas and holiday season on CBS. Unlike other holiday specials that also air on several cable channels (including Freeform), Rudolph airs only on CBS. It has been telecast every year since 1964, making it the longest continuously running Christmas TV special in history. 2014 marked the 50th anniversary of the television special and a series of postage stamps featuring Rudolph were issued by the United States Postal Service on November 6, 2014. The TV special, with the teleplay by Romeo Muller, introduced several new characters inspired by the song's lyrics. Muller told an interviewer shortly before his death that he would have preferred to base the teleplay on May's original book, but could not find a copy. Other than Burl Ives, all characters were portrayed by Canadian actors recorded at RCA studios in Toronto under the supervision of Bernard Cowan. After the script, concept designs and storyboards for Rudolph were done by Arthur Rankin, Jr. and his staff of artists at Rankin/Bass in New York City. The company's trademark stop motion animation process, known as \"Animagic\", was filmed at MOM Productions in Tokyo with supervision by Tadahito Mochinaga and associate direction by Kizo Nagashima. Besides Rudolph, Mochinaga and the rest of the Japanese puppet animation staff are also known for their partnership with Rankin/Bass on their other Animagic productions almost throughout the 1960s, from The New Adventures of Pinocchio, to Willy McBean and his Magic Machine, to The Daydreamer and Mad Monster Party.",
      "id": "RudolphTheRedNosedReindeer1964_201812"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}