{
  "imdbId": "archive-1958-dvd-...-760",
  "title": "Διακοπές στην Αίγινα (1958)",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1958-dvd-...-760",
      "id": "1958-dvd-...-760",
      "title": "Διακοπές στην Αίγινα (1958)",
      "description": "Σκηνοθεσία Λαμπρινος Ανδρεας Σενάριο Λαμπρινος Ανδρεας Ηθοποιοί Κωνστανταρας Λαμπρος Βεγγος Θανασης Ιατριδης Σταυρος Μπαρκουλης Ανδρεας Στρατηγου Αλεκα Τσιρκας Μιλτος Βουγιουκλακη Αλικη Βρασιβανοπουλος Γιωργος Καββαδια Τασσω Μοσχιδης Γιωργος Στραντζαλης Κωστας Χαλκουση Ελενη Καλογιαννης Μιχαλης Στραντζαλη Μαρια Ποταμιανος Παρις Χατζης Γιαννης Δρυμαιος Νικος Σύνοψη Ένας χήρος δημοσιογράφος και δεινός γυναικοθήρας, ο Τζώνης, και η παραχαϊδεμένη κόρη του Αλίκη πηγαίνουν για παραθερισμό στην Αίγινα. Στο λιμάνι, η Αλίκη νομίζει πως ο Ζαν –ένας γοητευτικός νεαρός, γόνος αρχοντικής οικογένειας του νησιού– είναι αχθοφόρος και το λάθος αυτό στέκεται αφορμή να ανοίξει μια απρόσμενη παρτίδα ερωτικών παιχνιδιών. Ο Ζαν παίζει μαζί της ένα αλλόκοτο παιχνιδάκι, παριστάνοντας τον μπεκρή του νησιού. Αλλά και ο Τζώνης ξετρελαίνεται με την τροφαντή Νένε, η οποία επίσης παραθερίζει με τον σύζυγό της Θόδωρο. Για να ξεμοναχιάσει τη Νένε, ο Τζώνης τηλεγραφεί στον Θόδωρο και του λέει ότι αρρώστησε ο αδελφός του Ανάργυρος. Πρέπει λοιπόν να επιστρέψει τάχιστα στην Αθήνα. Ο Ανάργυρος, όμως, φτάνει ξαφνικά στο νησί και τα δύο αδέλφια, μαζί μ’ ένα νησιώτη, συλλαμβάνουν επ’ αυτοφώρω τον Τζώνη με τη Νένε ενώ απιστούν. Το σκάνδαλο αναγκάζει πατέρα και κόρη να επισπεύσουν την αναχώρησή τους, αλλά ο έρωτας του Ζαν και της Αλίκης τούς κρατά για πάντα στο νησί. Ο Τζώνης θα συνεχίσει τα τσιλημπουρδίσματά του.",
      "fileSize": 1312660306,
      "addedAt": "2026-01-07T00:06:06.564Z",
      "thumbnail": "https://archive.org/services/img/1958-dvd-...-760",
      "language": "gre",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 408
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.564Z"
}