{
  "imdbId": "archive-the-inventor-crazybrains-and-his-wonderful-airship-1905-directed-by-georges-melies",
  "title": "The Inventor Crazybrains And His Wonderful Airship (1905) Directed By Georges Méliès",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-inventor-crazybrains-and-his-wonderful-airship-1905-directed-by-georges-melies",
      "id": "the-inventor-crazybrains-and-his-wonderful-airship-1905-directed-by-georges-melies",
      "title": "The Inventor Crazybrains And His Wonderful Airship (1905) Directed By Georges Méliès",
      "description": "The Inventor Crazybrains and His Wonderful Airship (1905) 'Le dirigeable fantastique' Director: Georges Méliès Le Dirigeable fantastique ou le Cauchemar d'un inventeur, released in the US as The Inventor Crazybrains and His Wonderful Airship and in the UK as Fantastical Air Ship, is a 1905 French short silent film directed by Georges Méliès. The film was released by Méliès's Star Film Company and is numbered 786–788 in its catalogues. Plot: In his ramshackle lodgings, decorated with designs of famous airships of the past, the inventor Crazybrains dances with glee at having designed a new dirigible. When he takes a nap, impish figures appear in his room, gleefully wreaking havoc with his papers before giving way to a vision of Crazybrains's new airship rising aloft above the rooftops. The airship travels through the clouds, and women reclining in painterly positions appear in the sky. Suddenly a fireball strikes the airship, and it explodes with much fire and smoke as the impish figures reappear. Crazybrains, waking up from his nightmare, tears around his room in a frenzy, knocking the plans for the airship down to the floor. Themes: Le Dirigeable fantastique is one of numerous Méliès films, like A Trip to the Moon and The Impossible Voyage, featuring a comically eccentric scientist. As featured by Méliès, the character is connected both to the Faust legend (a favourite theme of the filmmaker's) as well as to the long-lasting film tradition of the mad scientist figure. Similarly parodic depictions of scientific practitioners also feature in other early films, such as the Edison Manufacturing Company's 1910 A Trip to Mars. Release and survival: A hand-coloured print of the film, probably from Elisabeth Thuillier's colouring laboratory, survives at the EYE Film Institute Netherlands. It was given a restoration in 1991 -From Wikipedia",
      "fileSize": 76073691,
      "addedAt": "2026-01-07T00:12:10.589Z",
      "thumbnail": "https://archive.org/services/img/the-inventor-crazybrains-and-his-wonderful-airship-1905-directed-by-georges-melies",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 124
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.589Z"
}