{
  "imdbId": "archive-his-trysting-places-1914-directed-by-charles-chaplin",
  "title": "His Trysting Places (1914) Directed By Charles Chaplin",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his-trysting-places-1914-directed-by-charles-chaplin",
      "title": "His Trysting Places (1914) Directed By Charles Chaplin",
      "description": "His Trysting Place Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Mack Sennett Starring Charlie Chaplin Mabel Normand Mack Swain Phyllis Allen Cinematography Frank D. Williams Production company Keystone Studios Distributed by Mutual Film Release date November 9, 1914 Running time 32 minutes Country United States Languages Silent film English (Original titles) His Trysting Place is a 1914 American short silent comedy film written and directed by Charlie Chaplin and starring Chaplin and Mabel Normand . [ 1 ] [ 2 ] Plot Charlie and his friend Ambrose meet in a restaurant and accidentally leave with each other's coats. Charlie was going to pick up a baby bottle and Ambrose was going to mail a love letter that was in his coat pocket. Charlie's wife finds the letter and thinks he has a secret lover and Ambrose's wife believes he has an illegitimate child. Controversy arises in the park between Charlie and his wife and Ambrose and his wife. It is resolved at the end, but Charlie sparks another fight between the other couple by showing his friend's wife the love letter that was in his pocket. Reviews Louis Reeves Harrison of the Montgomery Journal wrote this positive review about His Trysting Place : \"The comic spirit is entirely too deep and subtle for me to define. It defies analysis. The human aspect is certainly dominant. It is funniest when it is rich in defects of character. The incongruity of Chaplin's portrayals, his extreme seriousness, his sober attention to trivialities, his constant errands and as constant resentment of what happens to him, all this has to be seen to be enjoyed. He merely sits down in the kitchen to read the war news, while Mabel tries to tend baby on the kitchen table and make bread at the same time. He leans back and puts one foot on the stove, upsetting the boiling kettle, when a flame leaps up and burns his leg, then trouble begins.\" Motion Picture Review provided this review: \"Chaplin does some particularly amusing stunts in this [film] and the fun runs high through the entire two reels.\" Cast Charlie Chaplin - Mabel's husband Mabel Normand - Mabel Mack Swain - Ambrose Phyllis Allen - Ambrose's wife References 1 \"Charlie Chaplin : His Trysting Place\" . www.charliechaplin.com . Retrieved 2023-10-16 . 2 His Trysting Place (S) (1914) , retrieved 2023-10-16 From Wikipedia, the free encyclopedia",
      "id": "his-trysting-places-1914-directed-by-charles-chaplin"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:39.346Z"
}