{
  "movieId": "archive-texas-brooklyn-heaven-1948-comedy-romance",
  "title": "Texas, Brooklyn & Heaven (1948 +++++ Comedy Romance)",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/texas-brooklyn-heaven-1948-comedy-romance",
      "id": "texas-brooklyn-heaven-1948-comedy-romance",
      "title": "Texas, Brooklyn & Heaven (1948 +++++ Comedy Romance)",
      "description": "Plot : A would-be playwright and a young woman escaping from a job at a gas station meet cute and fall in love. Storyline : Eddie Tayloe's grandfather leaves him six thousand dollars and the money belt it came in, freeing Tayloe to leave his dull newspaper job in Texas and move to New York to become a playwright. Along the way, his car breaks down and a girl walking along the highway asks for a lift. It turns out she's a nice girl, named Perry, running away from a job at a gasoline station. Soon they're off to New York together, but part ways once they arrive. Time passes and Eddie is failing to sell his play; Perry is failing to find a job. Odd circumstances, involving an old pickpocket named Mandy, bring them together again. Three starchy sisters renting a room, a bartender named Mike, and a sleepy old immigrant running a mechanical menagerie all play parts in this romantic comedy. --IMDb (by J. Spurlin) --IMDb User Review: Lynn looks great and oh that supporting cast! ( Oct. 29, 2000 by SanDiego ): Secretary Diana Lynn and playwright Guy Madison (both from Texas) meet on their way to New York. Due to a misunderstanding Lynn mistakes Madison for a bank robber and tries to keep him from being found out by the police. Posing as his sister she finds a pick pocket in the subway and enlists her as their mother. Plot device shifts quickly to Lynn finding a job at a riding academy (mechanical animals) and Madison failing as a playwright (mechanical acting). An unfunny script, confusing scenes, terrible direction and an annoying soundtrack hinder this below-average B-film despite the likeability of a stellar cast of character actors: William Frawley (\"I Love You\"), Margaret Hamilton (\"The Wizard of Oz\"), Lionel Stander (\"Hart to Hart\"), Irene Ryan (\"The Beverly Hillbillies\"), and Jesse White (the original \"Maytag Repairman\") to name just a few. Even Audie Murphy appears in a bit part! Diana Lynn is her usual perky self (looking terrific) and some of the situations are wacky, (just not very funny). For Lynn fans and nostalgic value (though the film looks and sounds like 1930 instead of 1948!) the film can grow on you after a while. Trivia : On Wednesday 23 March 1949 , the Balboa Theatre in San Francisco's Richmond District, a sub-run venue, offered this one, paired with Winter Meeting (1948) for one day as \"The Year's Two Worst Pictures\" and did a sellout business . Truth in advertising pays (sometimes). **The non-profit streaming of the commercial free, quality films I have uploaded to archive.org, are for educational purposes only . I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them , as much as I have. I own zero rights to this film nor any other I have uploaded, and have no wish to infringe on existing copyright laws. DEF gp ddh**",
      "fileSize": 274395640,
      "addedAt": "2026-01-07T00:11:46.531Z",
      "thumbnail": "https://archive.org/services/img/texas-brooklyn-heaven-1948-comedy-romance",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 1859
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}