{
  "movieId": "archive-woman-on-the-run-1950_202406",
  "title": "Woman On The Run 1950 ★★★★ (CC) Film/Noir [1:18:34] Ann Sheridan, Dennis O'Keefe",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/woman-on-the-run-1950_202406",
      "id": "woman-on-the-run-1950_202406",
      "title": "Woman On The Run 1950 ★★★★ (CC) Film/Noir [1:18:34] Ann Sheridan, Dennis O'Keefe",
      "description": "Woman on the Run is a 1950 American crime film noir directed by Norman Foster and starring Ann Sheridan and Dennis O'Keefe. The film was based on the April 1948 short story \"Man on the Run\" by Sylvia Tate and filmed on location in San Francisco. After witnessing a murder, Frank Johnson goes on the run to avoid being killed himself. His wife, Eleanor (Ann Sheridan), seems almost apathetic about finding him when questioned by Investigator Harris (Robert Keith), due to a marriage on the rocks. However, after learning that Frank has a grave heart condition, Eleanor recruits reporter Dan Leggett (Dennis O'Keefe) to help track down Frank. Discovering new love for her husband along the way, Eleanor must get to Frank before the killer does. The film, which lies in the public domain, was restored and preserved by the UCLA Film & Television Archive. The only known print of this film was destroyed in a fire in June of 2008, leaving only a few very low-quality--basically unwatchable--prints in the public domain. Eddie Muller, host of Turner Classic's \"Noir Alley\", did a bit of detective work and found a 35mm print at the British Film Institute. He had it shipped to UCLA Film and Television Archive where, with financial help from Muller's own organization, the Film Noir Foundation and the Hollywood Foreign Press Association's Charitable Trust, the film was preserved for future generations. This is one of Muller's favorite noir films for a number of reasons, including the pairing of two great actors, Ann Sheridan and Dennis O'Keefe , who wrote their own dialogue, but mostly because of its use of San Francisco, Eddie's home town, while it was still a bustling, growing, blue-collar seaport.",
      "fileSize": 1268970091,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/woman-on-the-run-1950_202406",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 2059
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}