{
  "imdbId": "archive-el-esqueleto-de-la-senora-morales-1960",
  "title": "EL ESQUELETO DE LA SEÑORA MORALES – (1960) [VOE]",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-esqueleto-de-la-senora-morales-1960",
      "title": "EL ESQUELETO DE LA SEÑORA MORALES – (1960) [VOE]",
      "description": "El esqueleto de la señora Morales es una película de comedia negra y suspenso psicológico mexicana de 1960, dirigida por Rogelio A. González .  Está protagonizada por Arturo de Córdova y Amparo Rivelles . Basándose en The Islington Mystery , un cuento del escritor Arthur Machen , la historia sigue la miserable vida de un matrimonio disfuncional en continúa disputa por sus diferentes creencias, gustos y personalidades, lo que lleva a uno de los miembros a cometer un acto desesperado para acabar con los problemas y llevar una vida tranquila. Filmada a partir del 1 de junio de 1959 en los estudios Churubusco de la Ciudad de México (DF) Estrenada el 26 de mayo de 1960 en el cine CHAPULTEPEC en el DF. Duración: 1:32 Hrs.   Sinopsis La vida conyugal de Gloria y Pablo Morales es un infierno. La mujer atormenta a su marido con sus celos, sus quejas y un puritanismo enfermizo. Como Gloria no quiere separarse, la situación es cada día peor. Un día, Pablo anuncia a sus conocidos que Gloria se ha ido a Guadalajara a visitar a una tía. Sin embargo, en su laboratorio de taxidermista, Pablo conserva un esqueleto al que trata como si fuese su mujer.   Reparto Arturo de Córdova como Dr. Pablo Morales Amparo Rivelles como Gloria Morales Elda Peralta como señorita Castro Guillermo Orea como profesor de historia Rosenda Monteros como Meche, la sirvienta de Pablo y Gloria Luis Aragón como Elodio el cuñado Mercedes Pascual como Lourditas Mendiolea Antonio Bravo como Padre Artemio Familiar Angelines Fernández como Clara, hermana de Gloria Armando Arreola como don Amado Paz Villegas como la otra Sra. Mendiolea Roberto Meyer como historiador Pepita González como amiga de Gloria, testiga contra Pablo León Barroso como Dr. Quiñones Sin acreditar Manuel Alvarado como cantinero Humberto Dupeyrón como niño Armando Gutiérrez como maestro Roger López como abogado defensor Jorge Mondragón como fiscal Mario Sevilla como juez   Género: Comedia, Terror, Crimen, Comedia negra, Film Noir, Cine Negro, matrimonio disfuncional,   Crítica El esqueleto de la señora Morales ocupa el lugar 19 en la lista de las 100 mejores películas del cine mexicano , publicada en julio de 1994 por la revista Somos .",
      "id": "el-esqueleto-de-la-senora-morales-1960"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:15.378Z"
}