{
  "imdbId": "archive-de-oldify-wwi-amazing-footage-of-wwi-tanks-topaz-1080p-s",
  "title": "Amazing enhanced and colorized footage of British, French, German & American tanks during WW-I [HD]",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-wwi-amazing-footage-of-wwi-tanks-topaz-1080p-s",
      "title": "Amazing enhanced and colorized footage of British, French, German & American tanks during WW-I [HD]",
      "description": "This is amazingly enhanced and colorized footage of British, French, German and American tanks during WW-I. Tanks during WWI had four purposes: fire power, shielding foot soldiers, crossing trench obstacles and breaking through barbed wire. The first tanks were based on caterpillar traction originally developed for farmland tractors. British tanks were based on the \"Little Willie\" prototype succeeded by a tank called \"mother\" which led to the production of the Mark I to Mark X heavy tanks series, first introduces to the battle field in 1916. Characteristic for the Mark I were the two wheels that it dragged along to assist in the steering through muddy terrain and to cross trenches. In 1917 the Mark IV tank was put into service of which over 1200 were built. By then the steering wheels were abandoned. These heavy 28 tons tanks moved slow at only 6 kmh. There were so called \"female\" and \"male\" versions respectively equiped with only machine guns or heavy guns. The British Medium Mark A Whippet was a medium size tank. It weighed 14 tons and had a maximum speed of 13 kmh, thus being faster and more manouverable than the Mark IV and V heavy tanks. The first French tank was the Schneider CA1 13 ton heavy tank which had a max speed of 8kmh. It was of poor design and thus was replaced in 1917 by the FT-17 built by car maker Renault.  The Renault FT was an agile, 7 tons two man vehicle armed with a machine gun or light 37mm gun. It revolutionized the WWI battle field and stayed into service until well after WW-II. The Saint-Chamond was another French tank that entered the war from mid 1917. It was classed as a heavy tank weighing 23 tons and had a maximum speed of 12 kmh. The Germans were late when introducing The Sturmpanzerwagen A7V to the battle field in 1918. It was a heavy 31 tons tank with a max. speed of 15 kmh of which only 20 were built. The \"Mephisto\" was the only one to survive WW-1. The Ford Model 1918 (M1918) was one of the first indigenous American tanks. It was a small two-man, one-gun tank and was agile and fast at a max. speed of 13 kmh and weighed only 3 tons. This video is too short to tell far more about these tanks. Check out the Wikipedia links in the description. Thanks for watching! Source: National Archive (USA) Music: Experia.",
      "id": "de-oldify-wwi-amazing-footage-of-wwi-tanks-topaz-1080p-s"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:59.605Z"
}