{
  "imdbId": "archive-the-black-abbot-1963-film-noir-thriller-crime",
  "title": "The Black Abbot (1963 Film Noir THRILLER! Crime)",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-black-abbot-1963-film-noir-thriller-crime",
      "title": "The Black Abbot (1963 Film Noir THRILLER! Crime)",
      "description": "PLOT : Several employees on a nobleman's estate show up at a former abbey, reputed to be haunted, to search for a hidden treasure. Howver, a mysterious hooded figure begins killing off those who may have figured out where the treasure is hidden. —IMDb by frankfob2@yahoo.com IMDb User Review : Atmospheric Edgar Wallace thriller ! (Jan 03, 2004 by copycat1025): Atmospheric Edgar Wallace thriller, about a large treasure hidden in an old country estate. Several persons show up, who happen to be employed by the lord of the estate, but only to get their hands on the treasure. However, a black-hooded killer soon makes his entrance, and begins killing those who know the secret. This is one of the better Edgar Wallace thrillers I've seen to date, and features some really spooky scenarios. Confusing, but stick with it  (Nov 9 2013 by Joseph_Gillis): This one is closer to the straight drama of the British Edgar Wallace series, despite the presence of the ubiquitous Eddi Aren't, whose presence serves to lighten the tone; on this occasion he's the assistant to the investigating police officer, and displays an unexpected talent for wrestling. It features so many characters and subplots - swindlers and forgers, gold-diggers and blackmailers; to name just four - that it's quite easy to get lost in the plot, or sub-plots, but as long as you concentrate on the main plot thread that treasure is buried in the grounds of Lord Chelford's estate; that it is being protected by a mysterious 'Black Abbott' figure ; and that literally everybody wants to get their hands on it, you can settle back and let the proceedings unfold. It helps,also, that the investigating officer seems to have an uncanny knack of getting to the heart of the matter - without seemingly doing much investigating - and thus does all the figuring out for you. Aren't aside, it boasts wonderful ensemble playing from actors, many of whom I've come to know and love as staples of the series, including Joachim Fuchsberger, as Dick Alford; Werner Peters, as Fabian Gilder, and a young Klaus Kinski, as an ex-con butler. The film has a number of good nocturnal chase scenes, excitingly filmed. It also boasts a wonderfully kitschy soundtrack./Ratings-wise, I'd probably say 7/10: the first-third of the film where too many characters are introduced causes it to drag, unduly - the final third more than makes up for it in my book - as does the ensemble playing, the chase and fight scenes - the music, and the nocturnal cinematography. TRIVIA: 01) The first cut of the film was given a \"FSK 16\" rating. To achieve a commercially more attractive \"12\" rating, two shots of violence depicting the kidnapping of Leslie Gine and the death of Lord Harry Chelford under masses of stones, were removed. Both scenes were re-edited into the film for the 2004 German DVD-Release by Universum Film. 02) This film marks the first in Rialto's Edgar Wallace Series that the director, in this case Franz Josef Gottlieb, was officially credited as a co-writer of the screenplay. He also received a screen credit for The Curse of the Hidden Vault. (1964) 03) Heinz Drache was considered for the part of Dick Alford and Richard Münch for the part of Lord Harry Chelford. 04) Featured in: Aweful Movies with Deadly Earnest: The Black Abbot ( 1971 TV Episode ) IMDb ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. I do receive a huge amount of joy in sharing with you, these many 100s of free-to-you items I have uploaded, however, I have no wish to infringe on any existing copyright laws. DEF.gp ddh ** The following statement is written from my heart ... t hese are my words and not to be in any way, considered a form letter from archive.org, as the two cents' worth comes from this volunteer , IA member - user - uploader. Thank you in advance for keeping in mind, my t hought process . :)   (ed note from Doreen.) * Although it's quite true that all uploaded material found at archive.org is free for you to watch or download , t he space needed to store it, is not. As you can well imagine, IA grows in leaps and bounds each and every day, the daily cost to keep this wonderful address we so much enjoy, running at proper capacity, is tremendous . This fact is the one and ONLY reason a yearly fundraiser is necessary .... to raise extra dollars to keep this free-for-viewing/downloading and available for today's generations as well as for all future generations ! Each of we worldwide family of members & users of archive.org , can help to support this rare, free, and most importantly of all, non-profit organization , because wi th as little as $1 to $5 , you too can make a difference. Small donation, you say? Yes, maybe so .. but stop and think of the huge difference that donation can make, if every single one of we archive.org. members/users j ust say: ''I can do that, and I WILL do that!'' Please consider making that very important donation. Sincerely, I thank you . Doreen. (DEF.gp ddh) * imagine, IA grows in leaps and bounds each and every day, the daily cost to keep this wonderful address we so much enjoy, running at proper capacity, is tremendous . This fact is the one and ONLY reason a yearly fundraiser is necessary .... to raise extra dollars to keep this free-for-viewing/downloading and available for today's generations as well as for all future generations !",
      "fileSize": 221235765,
      "id": "the-black-abbot-1963-film-noir-thriller-crime"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}