{
  "imdbId": "archive-the-bat-whispers-1930",
  "title": "The Bat Whispers 1930 Mystery: ★★★½ pre-Code Mystery [1:23:57] HD",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-bat-whispers-1930",
      "title": "The Bat Whispers 1930 Mystery: ★★★½ pre-Code Mystery [1:23:57] HD",
      "description": "The Bat Whispers is a 1930 American pre-Code mystery film directed by Roland West, produced by Joseph M. Schenck, and released by United Artists. The film is based on the 1920 mystery play The Bat, written by Mary Roberts Rinehart and Avery Hopwood, and is the second film version by the same director, previously adapted in 1926. An early talkie and one of the first widescreen films, West financed the cinematography, which required two cameramen and several techniques. Despite advance warning to the police, who seal off the area, The Bat, a master criminal, steals a necklace from the safe in the house of a rich socialite. He leaves a note saying he is going to the country to give the police a rest. Pausing only to rob a bank at Oakdale, he proceeds to terrorise the occupants of a lonely country mansion, in a mixture of thrills, chills and laughs. At the end, an actor steps forward through a proscenium arch and asks the viewers not to reveal the Bat's identity to their friends. A film noir shot in black and white, mainly at night in dimly lit scenes. This is allegedly the film that inspired Bob Kane to create Batman. Long thought to be lost, a nitrate print of the film was discovered in the Mary Pickford Estate in 1987 and restored by the UCLA Film and Television Archive in 1988. Her role as Lizzie was the first film role in over a decade for Maude Eburne. As one of the early sound films, this was the first in which her distinctive voice could be heard. Her voice, and her flair for comedy, made her in demand for character roles. The following year (1931) she was seen in no less than nine features (eight credited). Her prolific career continued until her retirement from the screen in 1951. Cast: Chance Ward as Police Lieutenant Richard Tucker as Mr Bell Wilson Benge as The Butler DeWitt Jennings as Police Captain Sidney D'Albrook as Police Sergeant S.E. Jennings as The Man in Black Mask Grayce Hampton as Cornelia Van Gorder Maude Eburne as Lizzie Allen Spencer Charters as The Caretaker Una Merkel as Dale Van Gorder William Bakewell as Brook Gustav von Seyffertitz as Dr Venrees Chester Morris as Detective Anderson Hugh Huntley as Richard Fleming Charles Dow Clark as Detective Jones Ben Bard as The Unknown",
      "id": "the-bat-whispers-1930"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:14:12.244Z"
}