{
  "movieId": "archive-gow-the-head-hunter-1928",
  "title": "Gow The Head Hunter 1928 Documentary ★★★★ CC: [1:00:55] HD",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gow-the-head-hunter-1928",
      "id": "gow-the-head-hunter-1928",
      "title": "Gow The Head Hunter 1928 Documentary ★★★★ CC: [1:00:55] HD",
      "description": "Documentary producer Edward A. Salisbury headed a cinematic expedition into the south seas of the Pacific Ocean from October 1920 through February 1922. Aboard his sailing yacht utilized for the expedition, Salisbury had installed a small motion picture film processing laboratory. The footage that was shot by Thomas Middleton on that trip and that of a second expedition that started in September 1922 was later compiled into the Salisbury documentaries Black Shadows (1923) and the feature-length Gow the Head Hunter (1928), which was prepared for touring travelogue stage presentations with narration written by Salisbury and performed by William Peck. The documentary footage of South Sea native peoples included in Gow the Head Hunter was taken on the Fiji Islands, the Andaman Islands (including footage shot by future producers Merian C. Cooper and Edward B. Schoedsack), in New Guinea, the New Hebrides, and the Solomon Islands. Some shots document individuals while others document cultural practices and daily life. The film’s appeal to silent era audiences is attributable to a combination of salacious shots of bare-breasted native women and some brief footage of body parts displayed openly in headhunter villages. The closing section of the film leaps into a reenactment of reputed true events to tell a cinematic story that had been cooked up by Salisbury and other members of the expedition. The contrast between the staged documentary footage and the out-and-out fabricated drama is quite significant. The documentary footage is at times uncomfortable as the persons on-screen are obviously being coaxed to move in a particular way by the director off-screen, but much of it feels nonetheless to be a historical record. The dramatic reenactment, however, plays as if it were an amateur film which has little documentary credibility. The documentary footage of South Sea native peoples included in Gow the Head Hunter was taken on the Fiji Islands, the Andaman Islands (including footage shot by future producers Merian C. Cooper and Edward B. Schoedsack), in New Guinea, the New Hebrides, and the Solomon Islands. Some shots document individuals while others document cultural practices and daily life. The film’s appeal to silent era audiences is attributable to a combination of salacious shots of bare-breasted native women and some brief footage of body parts displayed openly in headhunter villages. The closing section of the film leaps into a reenactment of reputed true events to tell a cinematic story that had been cooked up by Salisbury and other members of the expedition. The contrast between the staged documentary footage and the out-and-out fabricated drama is quite significant. The documentary footage is at times uncomfortable as the persons on-screen are obviously being coaxed to move in a particular way by the director off-screen, but much of it feels nonetheless to be a historical record. The dramatic reenactment, however, plays as if it were an amateur film which has little documentary credibility.",
      "fileSize": 1091531187,
      "addedAt": "2026-01-07T00:08:32.019Z",
      "thumbnail": "https://archive.org/services/img/gow-the-head-hunter-1928",
      "language": "eng",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 432
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.019Z"
}