{
  "imdbId": "archive-la-quintrala-dona-catalina-de-los-rios-y-lisperguer-1955",
  "title": "La Quintrala, Doña Catalina De Los Rios Y Lisperguer (1955)",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-quintrala-dona-catalina-de-los-rios-y-lisperguer-1955",
      "title": "La Quintrala Dona Catalina De Los Rios Y Lisperguer",
      "description": "La Quintrala, doña Catalina de los Ríos y Lisperguer  es una película en blanco y negro de  Argentina  dirigida por  Hugo del Carril  sobre el guion de  Eduardo Borrás  que se estrenó el 26 de mayo de 1955 y que tuvo como protagonistas a  Antonio Vilar ,  Ana María Lynch ,  Francisco de Paula  y  Milagros de la Vega . Colaboraron  Jorge Inostroza  en la asesoría histórica y  Gustavo Franceschi  en la asesoría religiosa. El filme fue galardonado con el  Premio Cóndor de Plata  a la mejor película. 1 ​ En el filme aparecen Félix y Fulvio Galimi, dos destacados esgrimistas argentinos. (Wikipedia) Sinopsis Ambientada en el siglo  XVII  en Chile narra la historia de una dama de alta sociedad ( Catalina de los Ríos y Lisperguer , llamada la Quintrala) despiadada y sanguinaria que quiere conquistar a un sacerdote. Perida y recuperacion del filme Luego de años en que no se exhibiera por haberse perdido las copias, en 2002 la Asociación de Apoyo al Patrimonio Audiovisual recuperó negativos con los cuales se generó una copia nueva que se exhibió en julio y agosto de ese año en el  MALBA . 2 ​ Reparto Antonio Vilar  …Fray Pedro de Figueroa Ana María Lynch  … Catalina de los Ríos y Lisperguer , la Quintrala Francisco de Paula  … Enrique de Guzmán Milagros de la Vega  …Águeda Andrés Mejuto  …Pedro Lisperguer Manuel Perales  …Gonzalo de los Ríos Iván Grondona  …Rodrigo de Castro Francisco López Silva  …Obispo Ricardo Mendoza  …Ventura Félix Tortorelli Antonio Martiánez  …Padre Javier Enrique San Miguel María Esther Álvarez  …Rosa Roldán Cobos Domingo Garibotto  …Hombre en carreta Roberto Croharé Yamandú Romero Héctor Dávila Hernaldo Hamze José María Rossi Pedro Lamarque Amalia Britos  …Monja Oscar Guerrero  …Voz en off José Comellas  …Gobernador Osores / Doblaje de Antonio Vilar Roberto Germán  …Hombre en taberna María Ferez  …Mujer en plaza Pura Díaz  …Mujer en plaza Osvaldo Bruzzi Sara Arrieta Osvaldo Tempone Osvaldo Cala Aníbal Rodríguez Armando Moreno Ramón Marco Antonio Pascual Mario Díaz López Fernando Peliche Carlos Benso María Arrieta Harry Gainer Ricardo Larson Jaimito Cohen Félix Galimi Fulvio Galimi Juan Villarreal",
      "id": "la-quintrala-dona-catalina-de-los-rios-y-lisperguer-1955"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:06:57.159Z"
}