{
  "imdbId": "archive-196368ErsteInterwievs",
  "title": "1963-68 Early Interviews Lutz Mommartz",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/196368ErsteInterwievs",
      "title": "1963-68 Early Interviews Lutz Mommartz",
      "description": "MR. MOMMARTZ, PLEAS DESCRIBE YOUR RELATIONSHIP TO CINEMA? I rarely go to the cinema. I do not like Western, nor problem movies or comedies. Sometimes, out of curiosity I enter a movie theater, but then very carefully. Sometimes I'm even excited, but then I do not have an explanation. WHAT IS YOUR OPINION ABOUT THE \"JUNGE DEUTSCHE FILM\"? They are old-young, they did not understand anything. HOW DID YOU STARTED? I never wanted to become a filmmaker. In 1963 I was six weeks Uganda. As an 8-mm camera was around and because it is incredibly boring in Africa, filming could not be so bad. I recorded everything that is not typical for Africa. This has satisfied me deeply. For example I filmed a tablecloth hanging in the wind, long and full frame. For a few moments the wonderful landscape could be seen behind it - in color. This material unfortunately got lost. So I will give up filming only when I will have had recorded such a beautiful setting again. DID YOU MADE MORE 8MM FILMS? Yes, with friends and acquaintances as a game about behavioral control - without film ambitions. Besides, I thought about the possibility to construct a film by stringing together chosen example situations from the visible reality in the camera without post production. This process required that each sequence becomes incorporated memory. The selection of each image was based on my personal notions of plausibility. The more pictures were in the box, the more the film pointed to something. After a relatively arbitrary start less possibilities become plausible. This requires tremendous concentration.  (This was from an interview of 1968) FROM AN INTERVIEW OF 1968 AND FROM A LECTURE BY LUTZ MOMMARTZ 1969 ON THE GERMAN RADIO (HESSISCHER RUNDFUNK) ABOUT \"ART IS DEAD, LONG LIVE ART\" At that time I had a circle of friends, composed of people who came from different professions. Although I had good contact with each of them, the understanding between them did not work out well. This situation seemed to me a classic example to ​​be the whole society. I wanted to see how far one can go with the communication of not closely associated people and what kind of social problems would appear here. We did not wanted to give a specific theme to the joint meetings. We agreed, that we will expose us to situations of no one knew what they were about. Perhaps the whole issue can be described by experimental coexistence or consciousness acquaintances games. Originally I wanted to carry out these games with each individual. I bought an old 8 mm camera to expose my counterparts to a situation, in which they could do nothing more than behave themselves towards the camera and me. This test was interesting for me because I wanted to find out which initiatives could develope from such situations. I decided however to apply the method to a group in which each individual had to cope with his presence of the others. It was clear that outsiders could not understand this process from the pictures. The acquisition of the camera therefore in the beginning had very little to do with film making. In this game of consciousness we had to admit that no clear common approach appeared. Despite the willingness to work to a common cause, everyone had his own interests. My interest in this matter turned out to be very different from that of the others. Provoking interest of the other with the group largely failed. For this reason we never formed a commune. Still i do not wanted to be a filmmaker. But the camera seduced me to try what else can be done with it. Since I do not wanted to be a loner, and I looked over my acquaintances as a social being, I decided to bring my vision of the world to the public. I bought in 1967, a 16 mm camera and shot the first films for the International Experimental Festival in Knokke / Belgium at the end of 1967.",
      "fileSize": 1110735489,
      "id": "196368ErsteInterwievs"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.564Z"
}