{
  "imdbId": "archive-aachi-ssipak-uncut-2006",
  "title": "Aachi & Ssipak [Original Korean Version) (2006)",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/aachi-ssipak-uncut-2006",
      "title": "Aachi Ssipak Uncut",
      "description": "Original full length Korean version with subtitles in english. Aachi & Ssipak  is a 2006 South Korean  adult animated   comic science fiction   action film  directed by Jo Beom-jin and features the  voices  of  Ryoo Seung-bum ,  Im Chang-jung , and  Hyun Young . The original story was proposed in 1998. To test different film techniques, demos using flash animation were made before attempting a theatrical version. In 2001, the flash animation versions of the film with four episodes were showcased in the 11th  Yubari International Fantastic Film Festival . [ 1 ]  All six episodes premiered in an online theatre called cine4m with Aachi played by Ryoo Seung-bum and Ssipak played by  Im Won-hee . The clip attracted three million  hits , and the film was originally scheduled for release at the end of 2002. [ 2 ]  Ryoo Seung-bum later revealed that it was hard to voice act in the film. [ 3 ]  There were also news reports that a game would be developed by teaming up with game company ziointeractive, expecting the film would be released in May 2005. [ 4 ]  The team eventually delayed the release date of the film to November 2005. [ 5 ]  3.5 billion won was spent to produce the film. [ 6 ] After animated films  My Beautiful Girl, Mari  and  Wonderful Days  flopped despite huge expectations, Jo's film ran into investor problems, and the production team halted working on the animation for almost a year. [ 7 ]  It would take a total of eight years for the feature-length film to be finished. [ 8 ] Aachi & Ssipak  opened in South Korean theaters on June 28, 2006. Like most of its predecessors in homegrown animation, it was well-reviewed, but a box office flop, with total ticket sales of 107,154. [ 12 ] [ 13 ]  The film was invited to the 2007 36th  International Film Festival Rotterdam . [ 14 ] In November 2020, the film was rereleased on theaters at Seoul Lotte cinema world tower joined by  Nancy Lang . [ 15 ]",
      "id": "aachi-ssipak-uncut-2006"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:56.855Z"
}