{
  "imdbId": "archive-UNDERELECTRICCLOUDS2015ByAlexeyGermanJrexcerptHD",
  "title": "UNDER ELECTRIC CLOUDS ( 2015) By Alexey German Jr [excerpt] HD",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/UNDERELECTRICCLOUDS2015ByAlexeyGermanJrexcerptHD",
      "title": "UNDERELECTRICCLOUDS2015ByAlexeyGermanJrexcerptHD",
      "description": "Berlin 2015: “Under Electric Clouds (2015)” Under Electric Clouds wins Berlinale award: an interview with director Alexei German Jr 16 February 2015 “[A global war] is happening and it will continue to happen. But for me, cinema is not a newspaper. It is not a mouthpiece of perestroika. This is not a concert on Police Day. For me, this is an attempt to tell you about some important things.” Russian film Under Electric Clouds won the award for cinematography and art direction at the Berlinale film festival. It is the sixth film by director Alexei German Jr , the son of eminent filmmaker Alexei German S r , who emerged during the perestroika period of the 1980s and became a defining figure of late Soviet and new Russian cinema. German Jr's eight-part film, which centres around an unfinished skyscraper, features an eccentric collection of protagonists, including the skyscraper’s architect, a poor intellectual and a Kyrgyz drifter. Together they explore a motif familiar to German Jr film buffs: the tension between freedom and its absence which lies at the centre of life among Russia’s intelligentsia. Alexei German Jr Set in 2017, on the hundredth anniversary of the Russian Revolution, Under Electric Clouds sees German Jr eschew the mould of Soviet filmmaking to focus on the existential crises of Russia’s urbanites. In an interview with The Calvert Journal, German Jr said: “We decided to start breaking the trend, which dictates that the successful Russian arthouse film should made in a particular way, talking about a world only in a particular way, all of which should be done in the tradition of the dull Soviet cinema of the 1980s. I'm grateful to all those who have supported me taking this path, in particular Rushan Nasibulin and Alexei Kudrin” . The skyscraper at the heart of the film, left unfinished due to the death of the oligarch who paid for the building, is not a metaphor for modern Russia, according to German Jr, but a story “about an architect who just wanted to build a house”. Concerned with capturing the issues of a privileged middle class, Under Electric Clouds stands in contrast to Andrey Zvyagintsev ’s Leviathan , Russia’s foreign-language entry for the Oscars this year, which deals with corruption and powerlessness in a small town far away from the trendy metropolitan centre.   “We live in big cities but for some reason we pretend that they don’t exist,” German Jr told The Calvert Journal. “For some reason we isolate part of our lives from the connotations of reality. There are particular situations that exist as part of a certain kind of life in Moscow, with clubs and girls in sparkly evening dresses — this life lends itself to aestheticisation, but nobody has noticed this.”   Nevertheless, while there has recently been a marked push from officials to produce films favourable to Russia and its history, German Jr’s decision to focus on Russia’s better off and socially mobile was not “bowing to the general line of the government [to produce more positive films]”. Rather, the film was made in a bid to wrest modern filmmaking “from of the dreary Soviet aesthetics of arthouse cinema, which exactly replicates the exact same Polish and eastern European movie”. Commenting on the importance of “talking about bright people”, German Jr noted that such a film is important for the generation it depicts. “It’s important for me, as well”, he added. However, in light of recent events which have brought politics increasingly into Russia’s cultural sphere, German Jr has been vocal about the importance of political independence in cinema. “[A global war] is happening and it will continue to happen. But for me, cinema is not a newspaper. It is not a mouthpiece of perestroika. This is not a concert on Police Day. For me, this is an attempt to tell you about some important things.”",
      "id": "UNDERELECTRICCLOUDS2015ByAlexeyGermanJrexcerptHD"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:51.089Z"
}