{
  "imdbId": "archive-MyTehranForSale-TehraneManHaraj2009",
  "title": "My Tehran for Sale - Tehrane Man Haraj (2009)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MyTehranForSale-TehraneManHaraj2009",
      "title": "MyTehranForSale TehraneManHaraj2009",
      "description": "My Tehran for Sale - Tehrane Man Haraj (2009) Directed by: Granaz Moussavi Date of birth: 26 January 1974, Tehran, Iran Writing credits: Granaz Moussavi Music by: Mohsen Namjou Country: Australia | Iran Language: Farsi | English Color: Color Runtime: 96 min. Released: 2009 Genre: Drama Synopsis Debut film by the Iranian female poet Granaz Moussavi is about the secret double life that many young people lead in repressive Iran. They can only be themselves and express themselves behind closed doors. The film shows an underground scene in Teheran that is never reflected in the media. -- IFFR Marzieh is a young female actress living in Tehran. The authorities ban her theatre work and, like all young people in Iran, she is forced to lead a secret life in order to express herself artistically. At an underground rave, she meets Iranian born Saman, now an Australian citizen, who offers her a way out of her country and the possibility of living without fear. Shot entirely on location in Tehran, MY TEHRAN FOR SALE tells the story of modern day Iranian youth struggling for cultural freedom. It brings to the screen never before seen images of modern urban Iran, and reveals how young Iranian people live behind closed doors. My Tehran for Sale is the first Iranian/Australian feature film collaboration and is the directorial debut of contemporary poet Granaz Moussavi. -- Cyan Films Cast: Marzieh Vafamehr, Amir Chegini, Asha Mehrabi, Mobina Karimi, Mitra Mehraban, Sandy Cameron, Hadi Mansouri, Seyedd Mehdi Heydari Crew Director: Granaz Moussavi Writer: Granaz Moussavi Producers: Julie Ryan, Kate Croser, Granaz Moussavi Cinematograher: Bonnie Elliott Editor: Bryan Mason Sound: Tom Heuzenroeder, Yadollah Najafi Music: Mohsen Namjou Filming Locations: Tehran, Iran ***** In this riveting, insiderâs perspective on life in Iranâs capital city, Marziehâa terminally ill actressâwearily relates her desperate quest for political asylum through a series of interviews with an unsympathetic government official. Beginning with details of her doomed relationship with an Iranian-born Australian and their plan to relocate to Adelaide, she recounts her struggle to work as an actress under Iranâs current regime, her hope for a future ultimately dashed by the devastating discovery of her illness, and her need to âescapeâ the only home she has ever known. Set against the backdrop of Tehranâs thriving arts culture, and framed through a series of artful and dramatic flashback sequences, poet-turned-filmmaker Granaz Moussavi boldly registers the trials of a modern woman struggling to flourish in Iranâs contemporary political climate. -- globalfilm",
      "id": "MyTehranForSale-TehraneManHaraj2009"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:18.122Z"
}