{
  "movieId": "archive-TheStreetFighterTrilogy",
  "title": "The Street Fighter Trilogy Triple Feature",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheStreetFighterTrilogy",
      "id": "TheStreetFighterTrilogy",
      "title": "The Street Fighter Trilogy Triple Feature",
      "description": "This is all 3 of The Street Fighter movies starring Sonny Chiba. Included is a DVD5 image (iso) and the files for the VIDEO_TS folder of the DVD5. Included in this DVD are the widescreen Japanese with English subtitle versions of The Street Fighter, Return of The Street Fighter, and The Street Fighter's Last Revenge. The copies of the films are the same ones that can be found here: http://www.archive.org/details/GekitotsuSatsujinKentheStreetFighter http://www.archive.org/details/SatsujinKen2returnOfTheStreetFighter http://www.archive.org/details/GyakushuSatsujinKentheStreetfightersLastRevenge When this DVD is burned, use your remote to navigate to the \"Select Title\" button to choose which movie to watch. This DVD when burned should have an anamorphic widescreen picture and yellow English forced soft-subs. I would ignore most of the derived files down there. If you want to view the movie on your computer, your best bet is going to be to go to one of the links above. However, if you do want to download a derived file from here, here is a short guide: Download SRT Subs here Download The Street Fighter Trilogy DVD ISO here Download all the VIDEO_TS files here Download The Street Fighter as OGV or 512kb MP4 (Use the SRT Subs provided) Download Return of The Street Fighter as OGV or 512kb MP4 (Use the SRT Subs provided) Download The Street Fighter's Last Revenge as OGV or 512kb MP4 (Use the SRT Subs provided)",
      "fileSize": 17028554125,
      "addedAt": "2026-01-07T00:07:05.037Z",
      "thumbnail": "https://archive.org/services/img/TheStreetFighterTrilogy",
      "collection": "feature_films",
      "downloads": 56853
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.037Z"
}