{
  "imdbId": "archive-de-oldify-japanese-surrender-part-2-2-sept-1080p-s-1945",
  "title": "The Japanese Surrender aboard the USS Missouri in 1945 in color! [HD restored & AI colorized]",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-japanese-surrender-part-2-2-sept-1080p-s-1945",
      "title": "The Japanese Surrender aboard the USS Missouri in 1945 in color! [HD restored & AI colorized]",
      "description": "On 2 September 1945 Japan signs the surrender papers on board of the USS Missouri in the presence of General McArthur. The surrender of Imperial Japan was announced by Japanese Emperor Hirohito on August 15 and formally signed on September 2, 1945, bringing the hostilities of World War II to a close. The Japanese Instrument of Surrender was the written agreement that formalized the surrender of the Empire of Japan, marking the end of hostilities in World War II. It was signed by representatives from the Empire of Japan, the USA, the Republic of China, the United Kingdom, the Union of Soviet Socialist Republics, the Commonwealth of Australia, the Dominion of Canada, the Provisional Government of the French Republic, the Kingdom of the Netherlands, and the Dominion of New Zealand. The signing ceremony took place on the deck of USS Missouri in Tokyo Bay on September 2, 1945. General MacArthur lead the ceremony. General MacArthur's staff headed by Col. LeGrande A. Diller were tasked to prepare the draft of the Instrument of Surrender. The ceremony aboard the deck of the Missouri lasted 23 minutes and was broadcast throughout the world. The instrument was first signed by the Japanese foreign minister Mamoru Shigemitsu \"By Command and on behalf of the Emperor of Japan and the Japanese Government\". General Yoshijirō Umezu, Chief of the Army General Staff, then signed the document \"By Command and on behalf of the Japanese Imperial General Headquarters\" [Ref: Wikipedia] The original film has been motion-stabilized, enhanced and artifically colorized using DeOldify software. This enhanced film is submitted for historic purposes, no copyright infringement intended.",
      "id": "de-oldify-japanese-surrender-part-2-2-sept-1080p-s-1945"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:59.604Z"
}