{
  "imdbId": "archive-computer-wore-tennis-shoes",
  "title": "The Computer Wore Tennis Shoes - And TV Remake",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/computer-wore-tennis-shoes",
      "title": "The Computer Wore Tennis Shoes - And TV Remake",
      "description": "The Computer Wore Tennis Shoes - and it's TV remake from 15 years later. From Wikipedia, the free encyclopedia:  https://en.wikipedia.org/wiki/The_Computer_Wore_Tennis_Shoes The Computer Wore Tennis Shoes is a 1969 American science fiction comedy film starring Kurt Russell, Cesar Romero, Joe Flynn and William Schallert. It was produced by Walt Disney Productions and distributed by Buena Vista Distribution Company. It was one of several films made by Disney using the setting of Medfield College, first used in the 1961 Disney film The Absent-Minded Professor and its sequel Son of Flubber. The Computer Wore Tennis Shoes is the first film for the series Dexter Riley. I already found a better copy of this video on the Archive - in 1080p High Def: https://archive.org/details/the.-computer.-wore.-tennis.-shoes.-1969.1080p.-blu-ray.x-264.-yify     &lt;----------  Over Here! Watch that one instead!! Plot Dexter Riley (Kurt Russell) and his friends attend a small, private college known as Medfield College, which cannot afford to buy a computer. The students persuade wealthy businessman A. J. Arno (Cesar Romero) to donate an old computer to the college. Arno is secretly the head of a large illegal gambling ring which used the computer for its operations. While installing a replacement computer part during a thunderstorm, Riley receives an electric shock and becomes a human computer. He now has superhuman mathematical talent, can read and remember the contents of an encyclopedia volume in a few minutes, and can speak a language fluently after reading one textbook. His new abilities make him a worldwide celebrity and Medfield's best chance to win a televised quiz tournament with a $100,000 prize. Riley single-handedly leads Medfield's team in victories against other colleges. During the tournament, on live television, a trigger word (\"applejack\") causes him to unknowingly recite details of Arno's gambling ring. Arno's henchmen kidnap Riley and plan to kill him, but his friends help him escape by locating the house in which he is being kept, posing as house painters to gain access, and sneaking him out in a large trunk. During the escape, he suffers a concussion which, during the tournament final against rival Springfield State, gradually returns his mental abilities to normal; however, one of his friends, Schuyler, is able to answer the final question (\"A small Midwest city is located exactly on an area designated as the geographic center of the United States. For 10 points and $100,000, can you tell us the name of that city?\" with the answer \"Lebanon, Kansas\"). Medfield wins the $100,000 prize. Arno and his henchmen are arrested when they attempt to escape the TV studio and crash head-on into a police car. From Wikipedia, the free encyclopedia:  https://en.wikipedia.org/wiki/The_Computer_Wore_Tennis_Shoes_(1995_film)   The Computer Wore Tennis Shoes is a 1995 American made-for-television science fiction comedy film directed by Peyton Reed (in his feature directorial debut) and written by Joseph L. McEveety and Ryan Rowe.  The film is a remake of the 1969 film of the same name . It premiered on ABC as an ABC Family Movie on February 18, 1995. It is the second in a series of four remakes of Disney live-action films produced for broadcast on the network during the 1994–95 television season, the other three being The Shaggy Dog, Escape to Witch Mountain, and Freaky Friday.   The film stars Kirk Cameron in the lead role of Dexter Riley, a boy who becomes an instant genius, with encyclopedic knowledge. The film also co-stars Larry Miller and Dean Jones plays the role of an evil dean from a competing school.  Plot:  Dexter, a once lazy and underachieving student at Medfield College, becomes an instant genius when a freak computer lab accident transfers an entire online encyclopedia to his brain. He uses his newfound intellect to ace a physics midterm in under ten minutes. The dean of Medfield College wishes to capitalize on Dexter’s superb intelligence by placing him on the school's quiz bowl team and allowing him to recruit his friends as teammates.   Medfield College wins several quiz bowls matches with Dexter exclusively answering every question. He receives national recognition and generates positive publicity for Medfield College. Dexter's success also has a negative impact. His friends believe he is becoming too conceited and contemplate leaving the quiz bowl team. Norwood Gill, a child prodigy and computer hacker from a rival school, develops an obsession with Dexter, and probes into his background. Government agents also investigate Dexter as a potential computer hacker known as \"Viper\".  Norwood ultimately uncovers the origin of Dexter's intellect. He exposes the information during a quiz bowl broadcast, but the revelation is largely dismissed by the audience. As Norwood prepares to compete against Dexter in the quiz bowl championship, he infects him with a computer virus that negates his encyclopedic knowledge. The virus takes full-effect midway through the championship, forcing Dexter to rely on his teammates for support. Medfield College ultimately wins the championship and celebrates. Norwood is apprehended by government agents for committing several cybercrimes. You may download ★ both movies ★ all at once, HERE (1.9 GB): https://archive.org/compress/computer-wore-tennis-shoes/formats=MPEG4&file=/computer-wore-tennis-shoes.zip   ____________________________________________________________________________________ Copyright Disclaimer: Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use. These videos are all to be used only for free, personal, educational purposes. ___________________________________________________________________________________ A video Time Capsule back to 1969!!",
      "fileSize": 2340170499,
      "id": "computer-wore-tennis-shoes"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.624Z"
}