{
  "movieId": "archive-1970-vhs-...-583",
  "title": "Δώστε τα χέρια (1971)",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1970-vhs-...-583",
      "id": "1970-vhs-...-583",
      "title": "Δώστε τα χέρια (1971)",
      "description": "Σκηνοθεσία Ανδρεου Ερρικος Σενάριο Μανουσακης Βασιλης Ηθοποιοί Πλατης Νικητας Νικολαϊδης Δημητρης Μποζωνης Κωστας Μπισλανης Δημητρης Μασαλας Γρηγορης Ιωακειμιδης Δημητρης Κοπελουσης Γιωργος Γρηγοριου Γρηγορης Κρουσκα Βερα Βαφιας Γρηγορης Κωνσταντινιδης Θωμας Παπαδοπουλος Γιωργος Ζαϊφιδης Γιωργος Πολιτης Χρηστος Θεοφιλου Ελενη Μητσακης Βασιλης Μποκαλας Παναγιωτης Κοκαλης Γιωργος Νεγκας Χρηστος Βουτσινος Γιωργος Λιακατος Γιαννης Κυριακιδης Στεφανος Τζουροπανος Θεμος Γιαννακουλακης Π. Σύνοψη Ένας ευσταλής και γενναίος νέος, ο Γιώργος Δουμάκης, είναι αποφασισμένος να πολεμήσει τους Γερμανούς. Αγαπάει την αδελφή του παιδικού του φίλου Χρήστου Αποστόλου, τη Φιλιώ, η οποία εγκαταλείπει τους δικούς της και τον ακολουθεί στο βουνό. Μαζί περνούν στην Αντίσταση και πολεμούν τον κατακτητή, μέχρι που η Φιλιώ συλλαμβάνεται και πεθαίνει από βασανιστήρια στη φυλακή. Μετά την Απελευθέρωση, οι δύο παλιοί φίλοι θα βρεθούν σε αντίπαλα στρατόπεδα. Ο Γιώργος ξαναβγαίνει αντάρτης στο βουνό κι ο Χρήστος, ως αξιωματικός του ελληνικού στρατού, τίθεται επικεφαλής του αποσπάσματος που τον καταδιώκει. Ο Γιώργος συλλαμβάνεται και περνάει από στρατοδικείο. Στη διάρκεια της δίκης, οι δύο παλιοί φίλοι βλέπουν πολλά από τα πιστεύω τους να καταρρέουν, και συνειδητοποιούν έντονα τη ματαιότητα του αδελφοκτόνου πολέμου.",
      "fileSize": 1106646150,
      "addedAt": "2026-01-07T00:06:06.564Z",
      "thumbnail": "https://archive.org/services/img/1970-vhs-...-583",
      "language": "gre",
      "year": 1971,
      "collection": "feature_films",
      "downloads": 2526
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.564Z"
}