{
  "imdbId": "archive-CreatureFromTheHauntedSea16x9",
  "title": "Creature From The Haunted Sea 16x 9",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CreatureFromTheHauntedSea16x9",
      "title": "CreatureFromTheHauntedSea16x9",
      "description": "This is the 75 minute TV version of Roger Corman's (and Charles Griffin's) goofy self-parody \"Creature from the Haunted Sea.\" For television, Monte Hellman wrote, produced and directed about 15 minutes of new footage to get the film up to a marketable length including an absurd theme song as performed by the wonderful Betsy Jones-Moreland. These scenes, presumably shot in 16mm, were never intended for theatrical release, but crop to a 16 x 9 aspect ratio (along with the rest of the film) as though that had been a possibility. This is just about as good an image as you'll find on this title, but the beginning is a little rough. Creature from the Haunted Sea From Wikipedia, the free encyclopedia Creature from the Haunted Sea Theatrical release poster Directed by Roger Corman Produced by Roger Corman Charles Hannawalt Written by Charles B. Griffith Starring Antony Carbone Betsy Jones-Moreland Edward Wain Narrated by Robert Towne Music by Fred Katz Cinematography Jacques R. Marquette Editing by Angela Scellars Distributed by Filmgroup Release dates June 1961 Running time 75 minutes Country United States Language English Creature from the Haunted Sea  is a 1961  comedy horror  film directed by  Roger Corman . Written by  Charles B. Griffith , the film is a  parody  of  spy ,  gangster , and  monster movies  (mostly  The Creature from the Black Lagoon ), concerning a secret agent, XK150 (played by  Robert Towne  under the pseudonym \"Edward Wain\"), who goes under the code name \"Sparks Moran\" in order to infiltrate a criminal gang led by Renzo Capetto ( Antony Carbone ), who is trying to transport a colonel, a group of exiled Cuban nationals, and a large portion of the  Cuban  treasury out of the country.",
      "id": "CreatureFromTheHauntedSea16x9"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:03:55.982Z"
}