{
  "imdbId": "archive-esperando-la-carroza-1985",
  "title": "Esperando La Carroza (1985)",
  "year": 1985,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/esperando-la-carroza-1985",
      "title": "Esperando La Carroza (1985)",
      "description": "Esperando la carroza  es una  película argentina   cómica  de 1985 dirigida por  Alejandro Doria . Está basada en la  obra de teatro homónima  del  uruguayo   Jacobo Langsner , quien escribió el guion de la adaptación al cine junto a Doria. [ 3 ] ​ [ 4 ] ​ Es protagonizada por  Luis Brandoni ,  China Zorrilla ,  Antonio Gasalla ,  Julio De Grazia ,  Betiana Blum ,  Mónica Villa ,  Juan Manuel Tenuta ,  Andrea Tenuta  y  Lidia Catalano . También contó con las actuaciones especiales de  Cecilia Rosetto  y  Enrique Pinti  y la presentación (debut cinematográfico) de  Darío Grandinetti . Fue estrenada el 6 de mayo de 1985 en el  Cine Atlas Lavalle  y simultáneos. La historia pertenece al género del  grotesco criollo  ( costumbrista ). Es ampliamente considerada como un clásico del cine de su país y una de las más importantes obras del cine argentino del siglo  XX . [ 5 ] ​ [ 6 ] ​ [ 7 ] ​(Wikipedia) Argumento La octogenaria  Mamá Cora  ( Antonio Gasalla ) tiene cuatro hijos:  Antonio  ( Luis Brandoni ),  Sergio  ( Juan Manuel Tenuta ),  Emilia  ( Lidia Catalano ) y  Jorge  ( Julio De Grazia ). Vive con este último, que atraviesa una angustiante situación económica. La tensión financiera sumada a la falta de espacio y constantes conflictos generacionales con la anciana llevan a su joven esposa Susana ( Mónica Villa ) a pedir desesperadamente a su cuñado Sergio que se la lleve a vivir con él y su esposa por un tiempo. Susana, que ha tenido un drama doméstico con Mamá Cora (Susana estaba preparando mayonesa, y fue a atender a su hija, dejando la preparación fuera. Cuando vino la Mamá Cora, ella, basándose en una conversación anterior, pensó que eran flancitos sin elevar, entonces arruinó la preparación inocentemente con azúcar y leche, cosa que causó el enojo de Susana, sacándola de quicio. Susana llega furiosa a casa de Sergio, quien en ese momento se prepara con su esposa, la pérfida Elvira ( China Zorrilla ), [ 8 ] ​ y su caprichosa hija adolescente, Matilde ( Andrea Tenuta ), para agasajar con el clásico almuerzo dominical a los nuevos ricos de la familia, Antonio ( Luis Brandoni ) y Nora, su esposa ( Betiana Blum ), quienes han ascendido económica y socialmente en circunstancias turbias durante la  última dictadura cívico-militar argentina  (1976-1983). El destino de Mamá Cora se debate mientras se cocina el almuerzo, que son \"los  ravioles  del domingo\" y el  tuco  preparados por Elvira; nadie quiere responsabilizarse por la anciana, siendo «ellas» las que imponen su opinión, mientras «ellos» tratan de que se respete el nombre de su madre. Por su parte, Mamá Cora, —que debido al altercado con Susana ha decidido salir para dejar de estorbar unas horas― termina en la casa de enfrente de Sergio, haciendo el favor de cuidar al pequeño hijo de Dominga, la vecina ( Cecilia Rossetto ). Nadie encuentra a Mamá Cora. Ante la \"desaparición\" tras la pelea con su nuera, sumada a la noticia de que se ha encontrado el cadáver desfigurado de una anciana bajo un tren, la compungida parentela llega a la conclusión que no es otra que Mamá Cora, debido a que vieron en la  morgue  que el cadáver tenía los mismos zapatos que solía usar esta última, y asumen que se ha suicidado para no causar más problemas. Elvira hace sentir culpable de la muerte a Susana, ya que considera que la salida de la anciana de la casa de su nuera fue consecuencia directa del altercado de la mayonesa al inicio. Previa consulta con la policía gracias a los « contactos » de Antonio, se informa de la tragedia a la familia lejana y a la paupérrima Emilia ( Lidia Catalano ) quien llega desesperada tras escuchar la noticia del suicidio de su madre. Mientras tanto, desde la terraza de Dominga, Mamá Cora observa las idas y venidas que se suceden enfrente en casa de Sergio y Elvira, sin entender que está sucediendo realmente. Años de problemas, resentimientos e intrigas surgen entre los miembros de la familia mientras preparan el velorio de los restos de la supuesta Mamá Cora. Se suceden equívocos y salen a relucir graves verdades de familia \"poco convenientes\". En medio de su propio velorio, Mamá Cora reaparece ante el asombro de todos. La familia recapacita, revalorando la presencia de su miembro más antiguo, y mientras Mamá Cora, parientes y conocidos se van al velorio de la anciana que creían era ella (y en realidad era una mujer  húngara ), Susana se burla a carcajadas frente a sus desconcertados parientes, riéndose de ellos y de sí misma, porque ya nada volverá a ser como antes. Reparto Actor Personaje Descripción Luis Brandoni Antonio Musicardi Hijo de Mamá Cora. Junto con su esposa  Nora  son los “nuevos ricos” de la familia gracias al  tráfico de influencias , la  extorsión   mafiosa  y la  especulación financiera . Al ver como él es famoso y progresa económicamente, despierta desconcierto y recelos en la familia. China Zorrilla Elvira Romero de Musicardi Esposa de Sergio y madre de Matilde. Una mujer de clase media con mal genio que se comporta amablemente únicamente por las apariencias, importándole sólo complacer a sus parientes ricos,  Nora  y  Antonio , y que se lleva mal con su concuñada pobre,  Susana . Antonio Gasalla Mamá Cora Su nombre completo es  Ana María de los Dolores Buscarolli de Musicardi . Una mujer mayor que sufre de  alzheimer . Julio de Grazia Jorge Musicardi Hijo mayor de Mamá Cora y esposo de Susana. Siempre se siente desdichado y miserable. Betiana Blum Nora de Musicardi Esposa de  Antonio , que sólo se lleva bien con su propia familia, ya que no le agrada la de su marido. Es hipócrita y fue amante de  Sergio , su cuñado. Mónica Villa Susana de Musicardi Esposa de Jorge y madre de una bebé. Constantemente nerviosa y agobiada por tener que hacerse cargo de su suegra sin ayuda familiar. Juan Manuel Tenuta Sergio Musicardi Hijo de Mamá Cora, esposo de Elvira y padre de Matilde. Perezoso y de carácter irascible. Tuvo un « affaire » con su cuñada Nora. Andrea Tenuta Matilde Musicardi Hija de Sergio y Elvira. Lidia Catalano Emilia Musicardi Hija de Mamá Cora y madre de Cacho. Mujer muy humilde de carácter hosco y dramático. Darío Grandinetti Cacho Hijo de Emilia. Aparenta retraso mental y pelea con otros chicos más jóvenes cuando juegan a la pelota. Clotilde Borella Doña Elisa Vecina siempre criticada por Elvira. Madre de Pocha. Enrique Pinti Felipe Primo alcohólico de los hermanos Musicardi y sobrino de Mamá Cora. Angelita Pardo Rosaura (anciana sorda) Amiga y cuñada de Mamá Cora, madre de Felipe y tía de los hermanos Musicardi. Cecilia Rossetto Dominga Vecina de Mamá Cora. Se va a un encuentro amoroso secreto y con engaños le encarga su hijo a la anciana. Mónica Alessandría Pocha Hija de Doña Elisa. Vecina y amiga de Matilde. Pina Criscuolo Doña Gertrudis Profesora de  francés  de Matilde. Gofredo Colombo Don Genaro Esposo de doña Gertrudis. Rafael Rodríguez Funcionario de la morgue Trabajador de la morgue que les muestra a los hermanos Musicardi el cuerpo desfigurado de la mujer húngara. Gloria Necon Hija de la húngara Hija de la anciana húngara que se suicidó tirándose a un tren en  Villa Luro . Juan Acosta . Peralta Oficial de policía. José Andrada Policía Compañero de Peralta. Miguel Ángel Porro Colectivero Colectivero que casi atropella a Mamá Cora. Matías Puelles Hijo de Dominga Niño que Mama Cora cuida en la ausencia de su madre. Jorge Santos Delivery de la florería Niño que lleva una corona de flores al funeral de la supuesta Mamá Cora. Produccion El filme se originó en la pieza teatral  Esperando la carroza , del uruguayo Jacobo Langsner, especialista en el género teatral denominado «grotesco rioplatense», la cual fue estrenada en Montevideo por la  Comedia Nacional  de  Uruguay  en 1962 y dirigida por  Sergio Otermin . La obra ya había tenido una adaptación televisiva para el prestigioso ciclo  Alta comedia  de  Canal 9  en los años 1970, interpretada por China Zorrilla,  Pepe Soriano ,  Raúl Rossi ,  Dora Baret ,  Alberto Argibay ,  Lita Soriano ,  Alicia Berdaxagar ,  Marta Gam  y la participación de la maestra de teatro austríaca  Hedy Crilla  como Mamá Cora. [ 9 ] ​ Para el largometraje el guion fue reelaborado para aumentar la participación del personaje de Mamá Cora, que en el original era mucho menor. Este personaje para el que Alejandro Doria imaginó en un principio a la gran  Niní Marshall  (para luego arrepentirse por el trato que se le daba a la anciana en el argumento) fue interpretado finalmente por Gasalla con la ayuda de un logrado maquillaje creado por Alex Mathews. Así las cosas, la película se puede ver como un guiño a otro film clásico argentino,  La nona  (1979), donde también un hombre (otra vez Pepe Soriano) interpreta a una anciana abuelita que, en este caso, simboliza lo peor de la sociedad del momento. Juan Manuel Tenuta es el único actor de la película que participó del elenco original (interpretando además al mismo personaje, Sergio) que estrenó la obra en Buenos Aires con dirección de  Villanueva Cosse  en el año 1975 en el Teatro del Centro, ubicado en la calle Sarmiento al 1249. La obra contaba además con la actuación de la mujer de Tenuta en la vida real,  Adela Gleijer  -padres ambos de Andrea Tenuta, la Matilde de esta versión cinematográfica-. El lugar donde transcurren las principales escenas es una típica  casa chorizo  que se encuentra en la calle Echenagucía 1232, muy cerca de la plaza Ciudad de Banff, en el barrio de  Versalles  de la ciudad de  Buenos Aires , y cercana al  Estadio José Amalfitani  del  Club Atlético Vélez Sarsfield . La misma fue declarada Patrimonio Cultural de la Ciudad de Buenos Aires en 2011. Los habitantes del barrio y las dueñas de la casa participaron del film en escenas como la del velatorio o la del final en la que intervinieron ancianos que acostumbraban pasar sus horas en la plaza anteriormente citada. La bebé de Jorge (de Grazia) y Susana (Villa) es también una vecina de la misma calle, quien años después siguió viviendo en el barrio de Versalles. La escena donde aparecen Darío Grandinetti, Manuel Tenuta y Luis Brandoni se filmó en un baldío ubicado en la intersección de las calles Somellera y Timoteo Gordillo, en el barrio porteño de Villa Lugano. El solar es hoy un estacionamiento de colectivos.",
      "fileSize": 1264915460,
      "id": "esperando-la-carroza-1985"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.392Z"
}