{
  "imdbId": "archive-ova-1986-1990",
  "title": "Violence Jack ALL OVA'S 1986-1990",
  "year": 1986,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ova-1986-1990",
      "title": "Violence Jack ALL OVA'S 1986-1990",
      "description": "WARNING: THIS SERIES CONTAINS GRAPHIC SEXUAL VIOLENCE, GRAPHIC VIOLENCE, GRAPHIC SEXUAL ABUSE, TORTURE AND DISTURBING SCENES AND IMAGERY! VIEWER DISCRETION IS STRONGLY ADVISED! FOR ADULT AUDIENCES ONLY! 18+ ONLY! THIS MOVIE SERIES MAY CONTAIN TRANSPHOBIC PORTRAYALS OF TRANS FEMME PEOPLE!   Sorry for the lack of subs, it's the only high quality version I could find. VIOLENCE JACK OVA 1: HARLEM BOMBER PLOT:  Kanto Hell Earthquake has demolished the metropolitan completely. After the earthquake, Slum King is kidnapping girls and sell them as sex slaves. Mari is wandering on the devastated field looking for her lover, Ken. But she is also kidnapped by them. While she is tortured and trained as a sex slave, Ken saves her. Ken has become the member of Slum King. The king offers condition to him; in return for releasing her, he has to kill Violence Jack. ORIGINAL RELEASE DATE: 06/5/1986 VIOLENCE JACK OVA 2:  EVIL TOWN PLOT: The World as we know it has been torn apart shattered by a series of natural disasters that have turned civilization into a brutish nightmare of survival and has left whole cities buried beneath the Earth. It's now a lethal and chaotic place, a place where only the strongest and most savage remain alive. The strongest of them all is a giant warrior known as Violence Jack… Violence Jack tries to avert a civil war brewing among the wretched inhabitants of a subterranean metropolis called Evil Town. Based on a character created by manga horror specialist, Go Nagai. ORIGINAL RELEASE DATE: 12/6/1988 VIOLENCE JACK OVA 3: HELL'S WIND PLOT; The survivors of Kanto's Hell Earthquake built a new city and christened it \"Hope Town\". However, this peaceful town becomes a nightmare when it's raided by the motorcycle gang, \"Hell's Wind\". They abduct the women while the remaining townsfolk are left helpless against them. Meanwhile, a boy, Subaro, meets Jun. Jun's lover was previously murdered, and the duo help one another to fight against Hell's Wind. The battles are getting more and more difficult, but with the appearance of Violence Jack, the citizens seem to gain the upper hand against Hell's Wind. ORGINAL RELEASE DATE: 11/9/1990",
      "id": "ova-1986-1990"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:07:47.472Z"
}