{
  "imdbId": "archive-dios-se-lo-pague-1948",
  "title": "Dios Se Lo Pague (1948)",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dios-se-lo-pague-1948",
      "title": "Dios Se Lo Pague (1948)",
      "description": "Dios se lo pague  es una legendaria  película   argentina  de 1947 dirigida por  Luis César Amadori , protagonizada por  Zully Moreno  y  Arturo de Córdova . Es una adaptación de la obra teatral  \"Dios se lo pague\"  de  Joracy Camargo . Fue la primera película que Argentina envió para los premios Oscars, pero no quedó seleccionada (hasta 1956 no existieron nominaciones a mejor película internacional, la Academia distinguía a una película del mundo). 1 ​ Se estrenó el 16 de marzo de 1948 en  Mar del Plata , inaugurando el Primer Festival de Cine Argentino, organizado por el gobierno de la provincia de Buenos Aires. En 1981 se realizó en  Argentina  una  versión televisiva en formato de telenovela  con libro de  Vicente Sesso  y traducción de  Elisa Cambaceres de Serra  por A.T.C. Argentina Televisora Color ( Canal 7 ), protagonizada por  Víctor Hugo Vieyra  y  Leonor Benedetto . En 1998 se realizó la  versión colombiana de  Dios se lo pague ; se trata de la  telenovela  que inaugura el  Canal Caracol , protagonizada por  Margarita Ortega  y  Jairo Camargo  y realizada por  DFL Televisión . En una encuesta de las  100 mejores películas del cine argentino  llevada a cabo por el  Museo del Cine Pablo Ducrós Hicken  en el año 2000, la película alcanzó el puesto 14. 2 ​ (Wikipedia) Sinopsis Una mujer jugadora que frecuenta casinos clandestinos, Nancy, que ostenta su elegancia para disimular su pobreza mientras espera que un hombre adinerado aparezca y se ocupe de ella, conversa con el viejo que mendiga en la puerta de un casino. Poco después, un pretendiente rico y misterioso le ofrece una vida de lujos, aunque alejada de las convenciones sociales. Este no desea casarse ni contarle nada de su vida; a cambio le ofrece lujos y todo lo que ella soñó toda la vida. Pero también conoce al hijo de un empresario textil muy importante que se obsesiona con ella y comienza a perseguirla. Le propone que escapen juntos y hasta roba para financiar su huida a Estados Unidos. Pero el día que debían irse Mario no deja la casa en el horario habitual y Nancy se asusta. El mendigo y Mario resultan ser la misma persona. Ella decide no dejar a Mario y en cambio va a la iglesia donde el mendigo pide limosna. Ambos entrar a casarse. Reparto Arturo de Córdova  ... Mario Álvarez / Juca Zully Moreno  ... Nancy Enrique Chaico  ... Barata Florindo Ferrario  ... Richarson hijo Federico Mansilla  ... Richarson padre Zoe Ducós  ... María José Comellas Demelo Rensahm José Paonessa Tito Grassi Mercedes Perdiguero Ramón Garay  ... Gerente del Gran Hotel Amadora Gerbolés Eloísa Martínez Adolfo Linvel  ... Tomás Roberto Bordoni Aída Villadeamigo Nicolás Taricano Enrique de Pedro Raúl Deval Warly Ceriani  ... Médico",
      "id": "dios-se-lo-pague-1948"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:07.356Z"
}