{
  "imdbId": "archive-Hg-wells-the-shape-of-things-to-come-1979",
  "title": "HG Wells - The Shape Of Things To Come 1979",
  "year": 1979,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Hg-wells-the-shape-of-things-to-come-1979",
      "title": "Hg Wells The Shape Of Things To Come",
      "description": ". G. Wells' The Shape of Things to Come  is a 1979 Canadian  science fiction film  directed by  George McCowan , and starring  Jack Palance ,  Barry Morse ,  Nicholas Campbell ,  Anne-Marie Martin ,  Carol Lynley  and  John Ireland . [ 1 ] Although credited as an adaptation of  H. G. Wells '  novel of the same name , the film takes only its title and some character names from the 1933 novel. The film's plot has no relationship to the events of the book. The book and its 1936 film adaptation  Things to Come  predict events such as a  Second World War  and the collapse of social order until a  world state  is formed, whereas the 1979 film involves a high-tech future involving robots and spaceships. The film was an attempt to capitalize on the popularity of such recent successes as  Star Wars , and TV series such as  Space: 1999  (also starring Morse),  Battlestar Galactica , and  Star Trek  although the film had only a fraction of the production budget of any of these. In the future, Earth is recovering from the devastating Robot Wars. Most of humanity lives on the  Moon  in a  domed city  called New Washington. They depend on the anti-radiation drug RADIC-Q-2 from the distant planet Delta 3. A cargo ship carrying the drug crashes into the dome with disastrous results. The colony leader, Senator Smedley, and science advisor Dr. John Caball, try to contact Nikki, the leader of Delta 3. They find that Omus, the Robot Master (also Caball's former apprentice), has declared himself emperor. Having crashed the cargo ship on purpose, Omus demands the colony's obedience or else he will invade with robots. Smedley refuses to comply. Caball suggests launching an armed advanced starship called the  Starstreak  against Omus. Smedley says that the ship has yet to be tested. Caball boards regardless and, before launch, exposes himself to deadly radiation from the ship's nuclear reactor room while making urgent repairs. With no time left to obtain radiation drugs and without telling anyone, Caball calls for his son Jason to help him pilot the ship. Tagging along are Smedley's daughter Kim, and Sparks, a teleporting pilot robot from the cargo ship. They steal the  Starstreak  and head to Delta 3. While in space, a malfunction forces the  Starstreak  to stop at Earth. While Caball conducts repairs, Jason and Kim explore in hopes of locating Caball's friend Charley. Small figures stalk them in the woods. Jason finds Charley dead. Kim has disappeared. Jason and Sparks find her with a group of harmless children who survived the Robot Wars, who are in dire need of RADIC-Q-2. The group leave the kids behind with food, but promises to return once their mission is complete. On Delta 3, Nikki has formed a resistance force. They will try to retake the planet's Citadel from Omus and his robots. The  Starstreak  enters a dangerous gravity vortex in space. The crew escape the storm. Delta 3 conveniently appears before them. On the planet, the crew finds Nikki and her people. Robots surround the heroes. A hologram of Omus appears. He has Caball brought before him. Jason and the others sneak inside the Citadel. Omus shows off his latest achievements to his old mentor. He turned the mining robots into shock troopers. Unimpressed, Caball tries to talk Omus into giving up his plan to control humanity. Omus refuses to listen. He dons a transparent helmet where he shows Caball another creation: a spinning  disco ball -like device that drives Caball mad with pain and then kills him. At Omus' chambers, Jason finds his father murdered. Nikki reveals that Caball had severe radiation sickness and was  terminally ill , but it was Omus' device that actually killed him. Furious, Jason confronts Omus, whose robots take him prisoner; thanks to Sparks, all the robots turn on their master and run out of control. Jason and the others flee the control room. Sparks has teleported to one of Omus' cargo ships and taken over the main computer system. The robot frenzy overloads critical systems and explosions rip through the Citadel. Sparks escapes in the cargo ship. The others make it back to the  Starstreak  and lift off. Omus sits in his control room as the Citadel explodes around him. The destruction of the Citadel causes the whole planet to explode. The last scene shows the two ships returning to Earth, with the cargo ship hauling a supply of RADIC-Q-2.",
      "id": "Hg-wells-the-shape-of-things-to-come-1979"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:07.110Z"
}