{
  "imdbId": "archive-le-prisonnier-patrick-mcgoohan-la-serie-v.f.-1967",
  "title": "Le Prisonnier ☆ Patrick McGoohan ☆ La Série V.F. ☆ 1967",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/le-prisonnier-patrick-mcgoohan-la-serie-v.f.-1967",
      "title": "Le Prisonnier ☆ Patrick McGoohan ☆ La Série V.F. ☆ 1967",
      "description": "Le Prisonnier ( The Prisoner ) ☆ Patrick McGoohan ☆ 1967                                                (Série en 17 épisodes ) Le Prisonnier ( The Prisoner ) est une série télévisée britannique en dix-sept épisodes de 52 minutes, créée par l'écrivain et ancien agent des services secret  George Markstein et Patrick McGoohan , acteur principal, scénariste et producteur délégué de la série. Un agent secret britannique démissionne brutalement de son poste et se dirige vers son appartement londonien au volant de sa Lotus Seven. Il est suivi et, alors qu'il fait ses valises pour quitter la ville, un gaz anesthésiant est diffusé par sa serrure. À son réveil, il se trouve dans un lieu étrange, le « Village ». L’endroit est excentrique avec une architecture baroque, il est dirigé par le Numéro 2 et habité par une communauté de villageois, tous vêtus d'habits colorés similaires. Un badge numéroté sur la poitrine les identifie. L'homme est désormais le Numéro 6 . Il réfute cette dénomination et se déclare libre envers et contre tout... Présentée initialement comme un thriller, du même moule que la série précédente avec Patrick McGoohan, Destination Danger (Danger Man en Angleterre ; Secret Agent en Amérique du Nord), Le Prisonnier utilise les « ficelles » du roman d'espionnage, teintées de science-fiction, d'allégorie et de drame psychologique. La combinaison des thèmes de la contre-culture des sixties et sa mise en scène surréaliste ont fait du Prisonnier une série qui a profondément influencé la production des programmes de science-fiction, de fantastique, et la culture populaire en général. En version originale, elle a d'abord été diffusée au Canada à partir du 5 septembre 1967 sur le réseau CTV, puis au Royaume-Uni du 29 septembre 1967 au 1er février 1968 sur le réseau ITV. Au Québec, elle a été diffusée à partir du 4 septembre 1967 à la Télévision de Radio-Canada.                            N° Épisode   - Titre – Réalisateur – Scénariste(s) Ép. 01 : L'Arrivée ( Arrival ) - Don Chaffey - George Markstein et David Tomblin Ép. 02 : Le Carillon de Big Ben ( The Chimes of Big Ben ) - Don Chaffey - Vincent Tilsley Ép. 03 : A, B et C ( A, B & C ) - Pat Jackson - Anthony Skene Ép. 04 : Liberté pour Tous ( Free for All ) - Patrick McGoohan - Paddy Fitz (pseudo de Patrick McGoohan) Ép. 05 : Double Personnalité ( The Schizoid Man ) - Pat Jackson - Terence Feely Ép. 06 : Le Général ( The General ) - Peter Graham Scott - Joshua Adam (pseudo de Lewis Greifer) Ép. 07 : Le Retour ( Many Happy Returns ) - Joseph Serf (pseudo de Patrick McGoohan) - Anthony Skene Ép. 08 : Danse de Mort ( Dance of the Dead ) - Don Chaffey - Anthony Skene Ép. 09 : Échec et Mat ( Checkmate ) - Don Chaffey - Gerald Kelsey Ép. 10 : Le Marteau et l'Enclume ( Hammer Into Anvil ) - Pat Jackson - Roger Woodis Ép. 11 : L'Enterremen t ( It's Your Funeral ) - Robert Asher - Michael Cramoy Ép. 12 : J'Ai Changé d'Avis ( A Change of Mind ) - Joseph Serf (pseudo de Patrick McGoohan) - Robert Parkes Ép. 13 : L'Impossible Pardon ( Do Not Forsake Me, Oh My Darling ) - Pat Jackson - Vincent Tilsley Ép. 14 : Musique Douce ( Living in Harmony ) - David Tomblin - David Tomblin et Ian Rakoff Ép. 15 : La Mort en Marche ( The Girl Who Was Death ) - David Tomblin - Terence Feely Ép. 16 : Il Était une Fois (Part#1) ( Once Upon a Time ) - Patrick McGoohan - Archibald Schwarz (pseudo de Patrick McGoohan) Ép. 17 : Le Dénouement (Part#2) ( Fall Out ) -  Patrik McGoohan -  Patrik McGoohan 18 -   Bonus Prisonnier du Village - 32:14 19 -   Bonus Une Histoire de Numéro - 14:03 20 -   Documentaire infos du Tournage - 1967 - 3:27 21 - Interview tel.-P. Mc Goohan 1997 - 5:55 22 - Générique Serie TV - 3:00 McGoohan a déclaré que l'essence de la série se trouvait dans les 7 épisodes suivants :     L'Arrivée (Arrival, épisode 1)     Le Carillon de Big Ben (The Chimes of Big Ben, épisode 2)     Liberté pour Tous (Free for All, épisode 4)     Danse de Mort (Dance of the Dead, épisode 8)     Échec et Mat (Checkmate, épisode 9)     Il Était une Fois (Once Upon a Time, épisode 16)     Le Dénouement (Fall Out, épisode 17) Type de Série: Série Télévisée Titre Original: The Prisoner Genre: Espionnage, Dystopie Création: George Markstein et Patrick McGoohan Production: Everyman Films Incorporated: Television Company (ITC) Acteurs Principal: Patrick McGoohan Musique: Ron Grainer (générique) Wilfred Josephs, Robert Farnon, Paul Bonneau, Albert Elms. Pays d'Origine: Royaume-Uni Chaîne d'Origine: ITV Nb. de Saisons: 1 Nb. d'Épisodes: 17 Durée: 52 minutes Diff. Originale: 29 septembre 1967 - 1er février 1968 Note : Afin que vous puissiez lui exprimer votre infinie gratitude pour ses années de bénévolat, l’archiviste cinéphile  Dionysus Vorax a mis à votre disposition un lien fort pratique, pour m'offrir des pop-corns et me saluer.:  Paypal  ~  Donate  ~  Don en €, $ ou £  … Détails  : Le Prisonnier (The Prisoner) Patrick McGoohan - 1967 Épisode 1 : L'Arrivée (Arrival)   Un agent secret démissionne de ses fonctions. Chez lui, alors qu'il prépare ses valises, il est gazé et se réveille dans un étrange village... il découvre qu'il est désormais appelé numéro 6. Rapidement, il va être présenté au dirigeant du village, le numéro 2, qui occupe un siège sphérique dans une salle de contrôle.     La date de naissance que donne le Prisonnier, 19 mars 1928, est celle de Patrick McGoohan. C'est un des nombreux éléments qui font que l'on confond le personnage et son auteur/acteur.     On y fait la connaissance d'un personnage secondaire, le numéro 66, un ex-amiral, joueur d'échecs invétéré. Épisode 2 : Le Carillon de Big Ben (The Chimes of Big Ben)   Numéro 6 s'allie à sa nouvelle voisine « N° 8 » pour fuir, de nuit par la mer... leur lieu de détention est censé être en Lituanie. Après une utilisation de plusieurs moyens de transports, ils se retrouvent prétendument à Londres, en fait toujours au village...   Cet épisode révèle que c'est apparemment son propre service secret britannique d'attache qui l'a fait emprisonner au village, étant donné que ses supérieurs hiérarchiques jouent la comédie pour le faire parler sur les causes de son départ des services.     Il existe une pré-version de cet épisode en VOst dont la musique est différente ainsi que certaines scènes. Épisode 3 : A, B et C (A, B & C)   Numéro 6 est drogué par le Numéro 14 et ses rêves sont manipulés et projetés sur un écran afin de permettre au Numéro 2 de connaître les véritables raisons de sa démission. Numéro 2 pense que Numéro 6 a trahi son gouvernement et il veut savoir au profit de qui. Trois suspects sont possibles, A, B et C. À la suite d'une erreur d'envoi d'un exemplaire de travail de l'épisode à Toronto à l'époque, comportant un montage différent, on peut en savoir plus sur la symbolique du Grand-bi : en effet, dans le générique final, la petite roue se révèle être la terre et la grande le système solaire, symbolisant un rapport macrocosme-microcosme. Épisode 4 : Liberté pour Tous (Free for All)   Il faut élire un nouveau Numéro 2 et le Numéro 2 actuel incite Numéro 6 à se présenter. Pour la première fois on peut voir la salle du conseil, réapparaissant dans l'épisode 6, Le Général ainsi que dans le 12e J'ai changé d'avis. Elle est surplombée d'une pyramide en 2 dimensions, surmontée d'un Œil de la Providence. Épisode 5 : Double Personnalité (The Schizoid Man) Après avoir subi un nouveau lavage de cerveau, numéro 6 devient N° 12 et doit faire parler le N° 6... Épisode 6 : Le Général (The General)   Le Village se convertit à un nouveau mode d'enseignement : l'enseignement accéléré, dispensé par « le professeur », et encouragé par un mystérieux « Général ». Cette méthode permettrait d'assimiler en 3 minutes l'équivalent de trois ans d'enseignement classique, avec un taux de fiabilité de 100 %. Il suffit pour cela aux habitants de regarder la télé pour apprendre instantanément les cours. Il est révélé que d'importantes installations souterraines se trouvent dans le village, au service de la recherche en intelligence artificielle. Patrick McGoohan a expliqué son intention concernant cet épisode : mettre le doigt sur le lavage de cerveau que représentait la publicité télévisée. Épisode 7 : Le Retour (Many Happy Returns) Numéro 6 se réveille dans le Village totalement désert. Il prend des photos du Village et embarque sur un radeau de fortune. Périlleux voyage, rencontre de contrebandiers, la terre ferme se rapproche… Il finit par aborder la Grande-Bretagne. Regagnant son ancien domicile de Londres, il découvre qu'il y a une nouvelle locataire... et qu'elle pilote sa Lotus Seven ! Aucune parole n'est prononcée avant 8 minute 42 (5 minutes 20, sans le générique). Épisode 8 : Danse de Mort (Dance of the Dead) Un carnaval au Village, tous les habitants se déguisent. Numéro 6 reçoit une invitation pour la fête... qui finit par se transformer en son procès. Au cours de l'épisode, il y retrouve Roland Walter Dutton, une de ses connaissances des services secrets, en N°42. Épisode 9 : Échec et Mat (Checkmate) Numéro 6 participe à un jeu d'échecs où les pièces sont les habitants du Village. La reine fait part au prisonnier de sa volonté de l'aider à s'enfuir... Celui-ci essaie de son côté de recruter des partisans en essayant de distinguer les gardiens des prisonniers parmi les habitants du Village en fonction de leur degré d'autorité ou de soumission. Épisode 10 : Le Marteau et l'Enclume (Hammer Into Anvil)   Numéro 6 se fait passer pour un employé du N° 1 pour espionner le N° 2. Il arrive peu à peu à développer une subversion contre l'autorité du Village en retournant ses méthodes d'intox contre elle. Le titre est une référence à Goethe, qui écrivit Du musst Amboss oder Hammer sein (« Vous devez être une enclume ou un marteau »). Épisode 11 : L'Enterrement (It's Your Funeral) Une tentative d'assassinat contre le no 2 serait en cours selon no 50, jeune femme qui demande l'aide du numéro 6. Ces propos provenant de personnes considérées comme des « brouilleurs », soit des mythomanes, n'est pas prise au sérieux par les autorités du Village. Épisode 12 : J'Ai Changé d'Avis (A Change of Mind)   Numéro 6 doit passer devant un comité qui jugera son manque d'intégration au Village. Il s'y présente mais fait de la résistance. En retour il subit un ostracisme de la population, qui ne fait qu'empirer quand il est qualifié officiellement d'individualiste. Une petite erreur s'est glissée dans le tournage : on voit à un certain moment une berline blanche passer au loin dans une rue du village. Sans doute une rue qui n'avait pas été bloquée et qui n'était pas supposée apparaître. Épisode 13 : L'Impossible Pardon (Do Not Forsake Me, Oh My Darling)   Le professeur Jacob Saltzman a inventé un appareil de transfert d'esprit entre deux personnes. Un certain Colonel arrive au Village. Numéro 6 et le Colonel échangent leurs esprits... Une partie de l'histoire se déroule dans le village de Kandersfeld, en Autriche. Le professeur Saltzman a conservé une lettre que lui a adressée numéro 6 alors qu'il habitait en Ecosse. L'adresse comporte la rue « Portmeirion Road », qui est le nom du village où est tournée la série. Épisode 14 : Musique Douce (Living in Harmony) Situé dans un village typique du Far West nommé Harmony, numéro 6 est shérif des lieux. Il rend son insigne et quitte la ville... On l'y ramène de force... Ce nouveau village est sous le contrôle d'un juge... Mais tout ce que vit numéro 6 dans cette nouvelle situation est-il réel ? Épisode 15 : La Mort en Marche (The Girl Who Was Death) Numéro 6 enquête sur le Dr Schnipps, savant fou déguisé en Napoléon qui veut détruire Londres au moyen d'un missile avec l'aide de sa fille... On comprend à la fin de l'épisode que tous les évènements qui se sont déroulés constituent une histoire racontée aux enfants du Village par Numéro 6. (Cela explique par ailleurs pourquoi on le voit en liberté, hors du Village, tout du long de l'histoire.) Le plan de Numéro 2 était d'éventuellement découvrir les renseignements par le biais de l'histoire, ce à quoi le héros répond par une aventure d'espionnage fictive dont l'antagoniste n'est nul autre qu'un fou ressemblant étrangement à Numéro 2... Épisode 16 : Il était une Fois (1/2) (Once Upon a Time)   N° 2 décide de faire subir le « degré absolu » au numéro 6. Une guerre psychologique s'engage... Numéro 6 est conduit dans la « chambre d'embryon » pour y subir une régression psychiatrique. La méthode utilisée, fort dangereuse, est susceptible d'entraîner la mort du N°2 ou du N°6... Le texte célèbre de Shakespeare All the World's a Stage est invoqué par le n°2 tout au long de l'épisode. Épisode 17 : Le Dénouement (2/2) (Fall Out) À la suite de la demande du numéro 6, le superviseur l'emmène voir le numéro 1, accompagnés du majordome nain. Une première salle révèle un mannequin avec un masque aux traits du numéro 6, portant un costume de ville à sa taille, qu'il enfile. Suit un couloir avec juke-box passant All You Need Is Love des Beatles. Il découvre une étrange assemblée représentant tout l'éventail de l'échiquier politique démocratique sous une robe blanche et un masque bicolore noir/blanc mi-triste, mi-souriant, rappelant ceux de la commedia dell'arte. Parmi les factions idéologiques représentées, on peut citer les tenants de l'État providence (Welfare state), les pacifistes, les activistes puis des représentants de valeurs ou d'actes comme l'identification, la sécurité, les défecteurs, l'éducation, la thérapie, les réactionnaires, les nationalistes, également les jeunistes (youngsters), le divertissement, la récréation, les anarchistes, les personnes âgées. Des gardes en armes sont disposés dans la salle. Les deux personnages familiers de la salle de contrôle du superviseur en rotation chacun à l'extrémité d'une tige se retrouvent ici mais n'ont pas d'outillage apparenté à une caméra de surveillance mais bien une mitrailleuse chacun. Il semble que la force persuasive ait fait place à une force plus brute. Ils gardent également l'accès par puits au repaire du numéro 1 ainsi qu'aux cellules Orbit, où sont enfermés les numéros 2 et 48. L'assemblée juge deux personnes, le numéro 48 (apparu dans l'épisode Musique douce sous le numéro 8) et le précédent numéro 2, sous le regard du numéro 6, que l'on a assis sur un trône. L'ordinateur géant de la salle arbore un numéro 1 peint en rouge vif, il dispose d'un œil-caméra semblable à celui se trouvant dans la salle habituelle du numéro 2. Lors de son procès, le numéro 2 fixe l'œil de la caméra, ce que le règlement interdit, et lui dit « qui que vous soyez, quoi que vous soyez, (...) vous ne m'hypnotisez plus, c'est trop tard ». La machine se met alors à chauffer et le juge fait évacuer le numéro 2. À la fin du Village, étant couplé avec une fusée, il décolle vers le ciel. Le juge qui mène le procès, vêtu comme dans une cour de justice britannique, prononce l'éloge du numéro 6 et lui indique qu'il peut à son choix retrouver la liberté ou devenir leur nouveau chef, car il est le seul à avoir surmonté sans dommages toutes les épreuves. Un discours lui est demandé, mais est interrompu systématiquement à chaque prise de parole par les bravos de la salle masquée et encapuchonnée, ce qui semble pour la première fois déstabiliser réellement le héros. L'audience, d'allure peu sérieuse, entonne même la chanson Dem Bones. Le « numéro 1 », lui, est alors présenté dans une autre salle, en fait la salle de contrôle de la fusée, où se trouvent plusieurs globes terrestres. Il porte la même robe à capuche blanche et le même masque grimaçant noir/blanc que les autres mais arbore un gros « numéro 1 » cerclé sur sa robe blanche. Numéro 6 lui arrache son masque grimaçant, derrière se trouve un masque de gorille, puis le propre visage de numéro 6 apparaìt. Le numéro 1 s'enfuit alors sans un mot d'explication. L'ex-numéro 62 s'allie alors avec le numéro 2, le numéro 48 et le majordome nain : ensemble, ils assomment des gardes, prennent leur armes, attaquent la salle principale et remportent la victoire. Ils regagnent alors dans un esprit bon enfant - qui surprend un automobiliste - Londres, où se séparent leurs chemins. Le majordome reste cependant en compagnie du héros. Numéro 2 regagne le Palais de Westminster où, peut-être, il occupe une fonction politique (il est en effet salué par le garde, et entre par la porte des membres du Parlement). Le nain majordome entre finalement dans la maison du n°6 et la porte s'ouvre de la même manière que celles du « village ». De plus, on peut voir que le numéro de sa demeure est à présent le ... n°1 ! Note : Afin que vous puissiez lui exprimer votre infinie gratitude pour ses années de bénévolat, l’archiviste cinéphile  Dionysus Vorax a mis à votre disposition un lien fort pratique, pour m'offrir des pop-corns et me saluer.:  Paypal  ~  Donate  ~  Don en €, $ ou £  …",
      "id": "le-prisonnier-patrick-mcgoohan-la-serie-v.f.-1967"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}