{
  "imdbId": "archive-1933SchleppzugM17WernerHochbaumWithEnglishSubtitles",
  "title": "1933 Schleppzug M 17 (Werner Hochbaum)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1933SchleppzugM17WernerHochbaumWithEnglishSubtitles",
      "title": "1933 Schleppzug M 17 (Werner Hochbaum)",
      "description": "If you download the Matroska link to the right, you will get a mkv-file with optional subtitles, which you can play with a vlc-player on your computer. Although the credits of the film only give Heinrich George as a director, the film was only started by the actor, but was finished by Werner Hochbaum. And it feels very much like the work of the man who directed \"Morgen beginnt das Leben\", I'd say. The story is simple: George plays Henner who lives with his wife and child on a tugboat, going on the river to Berlin. There he meets the attractive Gescha (Betty Amann, of \"Asphalt\" fame), and a story of love, betrayal and sadness ensues. While this is impressive in itself in spite or perhaps because of the acting being a little 'rougher' than in your usual UFA film, another layer of attraction is created by the film becoming almost a sort of city symphony in places. Wonderful to see the old Berlin at the end of the Weimar era: the Kurfürstendamm, the Potsdamer Platz, neon advertisements for Persil washing-powder - all photographed and edited gorgeously. A very lyrical film which makes great use of music and sound and shows all of Hochbaum's talent as an director and editor, too. In his mini-review over in the forum (link), Serdar has already called \"Schleppzug M 17\" a masterwork on the same level as \"Morgen beginnt das Leben\", and I fully agree with this statement. The print used for this upload is nicely sepia-tinted, and while a bit worn in places and with occasionally blown-out whites, it is surprisingly clear and detailed for the most part. The optical audio track is visible on the left hand side and couldn't be taken care of with AutoGK, but it at least preserves that elusive 1.19 ratio that these early German sound films were made in. The only real annoyance is that darn counter, but I'd say you'll forget about it very soon when watching the film.  Source unknown, but presumably from a VHS recording made for study purposes in some archive. ",
      "fileSize": 1846218194,
      "id": "1933SchleppzugM17WernerHochbaumWithEnglishSubtitles"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.053Z"
}