{
  "imdbId": "archive-TheMoralityOfFundamentalPhysicsNimaArkaniHamedCornellUniversity1080p30fpsH264128kbitAAC",
  "title": "The Morality of Fundamental Physics - Nima Arkani-Hamed Lecturing at Cornell University",
  "year": 2016,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMoralityOfFundamentalPhysicsNimaArkaniHamedCornellUniversity1080p30fpsH264128kbitAAC",
      "title": "The Morality of Fundamental Physics - Nima Arkani-Hamed Lecturing at Cornell University",
      "description": "In this lecture, physicist Nima Arkani-Hamed argues that there is an invariant quality in the structure of the laws of nature that should guide a physicist's behavior in the search for the truth. Arkani-Hamed describes this as the \"morality\" of fundamental physics.  Summary of main ideas: General morality: 1) Be honest with yourself and others. 2) It doesn't matter who you are, only the content of your ideas are relevant. 3) We are never in possession of the whole truth and should never pretend to have complete certainty; do the best you can and boldly extrapolate the ideas you have the most confidence in. 4) Be tolerant and keep an open mind, but reject dishonest and intellectually lazy ideas. Morality more relevant to scientific inquiry: 5) Even the provisional understanding of the truth we have at any given time has a large degree of \"local perfection\", i.e. it is difficult to modify. The deepest principles of physics, once uncovered, have a feeling of inevitability. We eventually learn deeper truths, often with radical changes from the past, while maintaining a certain continuity and balance with past truths. 6) The same truth can be described in seemingly radically different ways; different paths of progress give different views of the next horizon. 7) \"Morally correct\" explanations are ones that seem as close as possible to fundamental principles and have a similar sense of inevitability about them, reflecting the perfection of natural laws. 8) Truth is ennobling; the laws are perfect, but humans are imperfect. We are filled with unconscious assumptions and prejudices that obstruct our path to the truth. Acting morally allows us to better interact with the truth. It enhances our abilities and \"reels us in\" to find the higher truths. 9) Learn opposing views (things you hate); often it leads you to broader truths. 10) Instead of worshiping a vast and unknowable god, we should devote ourselves to the slow unveiling of the vastness of truth in all of its glory. It provides an invariant moral code; its perfection makes us better and allows us to transcend our mortality and touch something eternal.",
      "id": "TheMoralityOfFundamentalPhysicsNimaArkaniHamedCornellUniversity1080p30fpsH264128kbitAAC"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:05.034Z"
}