{
  "imdbId": "archive-theDoubleLottiedasDoppelteLottchen1950",
  "title": "\"The double Lottie\" [\"Das Doppelte Lottchen\"] [1950]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theDoubleLottiedasDoppelteLottchen1950",
      "id": "theDoubleLottiedasDoppelteLottchen1950",
      "title": "\"The double Lottie\" [\"Das Doppelte Lottchen\"] [1950]",
      "description": "This is a delightful film even if you cannot understand the language. Wikipedia's plot summary will provide the basic idea for this beautifully photographed film. Erich Kastner, the author of the 1949 novel, introduces the film and narrates. Wikipedia... Plot summary Two nine-year-old girls--rude Lisa Palfy (orig. Luise Palfy) from Vienna, and respectful shy Lottie Horn (orig. Lotte Korner) from Munich--meet on a summer camp in Bohrlaken on Lake Bohren (orig. 'Seebuhl am Buhlsee'). Lisa has curly hair; Lottie wears braids. Apart from that, they look alike. They have never seen each other before, but soon find out that they are identical twins. It turns out that their parents divorced, each keeping one of the girls. The two girls decide it is unfair that neither of them has ever been told that she is a twin, or that her other parent is still living. They decide to trade places at the end of the summer so that Lottie will have a chance to get to know her father and Lisa will get to meet her mother. Lottie curls her hair, Lisa braids hers, and both go off to where they have never been before. The adventure begins. While many adults are surprised at the changes in each of the girls after they return from camp (\"Lottie\" has suddenly forgotten how to cook, gets in a fight at school, and becomes a terrible student, while \"Lisa\" has begun to keep a close eye on the housekeeper's bookkeeping, will no longer eat her favorite food, and becomes a model student), no one suspects that the girls are not who they claim to be. When Lottie (pretending to be Lisa) finds out that her father is planning to remarry, she becomes very ill and stops writing to her sister in Munich. Meanwhile, Lottie's mother comes across a picture of the two girls that was taken while they were at summer camp. She quickly realizes what has happened and Lisa tells her the entire story. The discovery turns out to have come just in time. The girls' mother calls her ex-husband in Vienna to tell him what has happened and to find out why Lottie has stopped writing. When she hears that her daughter is ill, she and Lisa immediately travel to Vienna to be with her. The four of them (father, mother, Lisa and Lottie) are still in Vienna for the girls' birthday. The girls tell their parents that they don't need any presents on this birthday or ever again as long as they don't have to be separated again. The parents talk it over, realize that they are still in love and decide to get remarried. MargheritaDTorbiera, IMDb reviewer, wrote... There have been many remakes of this movie, mainly in the US and in Germany, but this is the one and only real one!!! Following the book line by line, even the authors comments (given by the author Erich Kastner himself in the movie!) on what is happening, the story is highly enjoyable and more than touching! Set in Austria/southern Germany in the beginning fifties, the story about the unhappy divorce of the famous musician and conductor Ludwig Palffy and the hardworking (at that time!!!) mother/journalist Louiselotte Korner is ever so realistic. Don't let yourself being prejudiced by it's old appearance; this movie is worth watching! Sentiments and misunderstandings, a laugh and a cry, everything comes up. Here, the switch is kept up for at least a couple of weeks, with all the difficult situations to master. In the later movies, like the latest Parent Trap, how funny and nice that one is, the exchange doesn't last more than a few days. But these original Lotte and Louise had a REALLY hard time, keeping it up so long! To me, all the main characters are sympathetic, and that's a must in a movie like this. You really want them to get together again, and are so happy when they finally manage! With, as a symbol, Palffy's atelier moved to the condo next door, instead of somewhere else in the city. The only real minus is the fact that the twins Louise and Lotte don't really look alike. It's quite easy to tell them apart, and therefore rather strange that nobody notices. Their acting isn't all that fantastic either, but on the whole this movie is - at least in my opinion - the best parenttrapmovie ever made.",
      "fileSize": 1470633310,
      "addedAt": "2026-01-07T00:12:44.280Z",
      "thumbnail": "https://archive.org/services/img/theDoubleLottiedasDoppelteLottchen1950",
      "collection": "feature_films",
      "downloads": 30250
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.280Z"
}