{
  "imdbId": "archive-getting-acquainted-1914-directed-by-charlie-chaplin-colorized",
  "title": "Getting Acquainted (1914) Directed By Charlie Chaplin",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/getting-acquainted-1914-directed-by-charlie-chaplin-colorized",
      "title": "Getting Acquainted 1914 Directed By Charlie Chaplin Colorized",
      "description": "Getting Acquainted Clockwise from top: Phyllis Allen , Mack Swain , Charlie Chaplin and Mabel Normand Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Mack Sennett Starring Charlie Chaplin Mabel Normand Phyllis Allen Mack Swain Harry McCoy Edgar Kennedy Cecile Arnold Cinematography Frank D. Williams Production company Keystone Studios Distributed by Mutual Film Release date December 5, 1914 Running time 16 minutes Country United States Languages Silent film English (Original titles) Getting Acquainted , subsequently retitled A Fair Exchange , is a 1914 American comedy silent film written and directed by Charlie Chaplin , starring Chaplin and Mabel Normand , and produced by Mack Sennett for Keystone Studios . [ 1 ] Plot In one of Chaplin's \"park comedies\" for Keystone Studios, Charlie and his domineering wife, Mrs. Sniffles, are walking in the greensward. When Mrs. Sniffles falls asleep on a park bench, Charlie takes the opportunity to walk away from her. He encounters pretty Mabel. At the moment, Mabel's husband, Ambrose, is occupied trying to help a stranger start his car. Charlie attempts to woo Mabel but is quickly rebuffed and a park policeman comes to her aid. Meanwhile, Ambrose encounters Charlie's wife and is attracted to her. He too is rebuffed. Ambrose and Charlie both run afoul of a pretty blonde woman and her fez-wearing escort. A park policeman pursues both Charlie and Ambrose for their unwanted attentions directed at strange women. Charlie is eventually caught by the policeman who brings him back to Mrs. Sniffles. She saves him from arrest but roughly begins to escort him home. Released on December 5, 1914, Getting Acquainted was the next-to-last movie that Chaplin made for Keystone Studios. It marked the final time he appeared in the same film as Mabel Normand. Reception A reviewer from Motion Picture World wrote, \"Mabel Normand, Charles Chaplin and the others are undeniably comical in this lively farce.\" A reviewer from The Cinema declared, \"Yet another fine Charles Chaplin number including the celebrated Mabel Normand.\" Cast Charlie Chaplin - Mr. Sniffles Mabel Normand - Ambrose's wife Phyllis Allen - Mrs. Sniffles Mack Swain - Ambrose Harry McCoy - Flirt in park Edgar Kennedy - Policeman Cecile Arnold - Mary References 1 Walker, Brent E. (2010). Mack Sennett's Fun Factory: A History and Filmography of His Studio and His Keystone and Mack Sennett Comedies, with Biographies of Players and Personnel . McFarland Inc. pp. 305–306. ISBN   9780786457076 . Retrieved 20 February 2024 . From Wikipedia, the free encyclopedia",
      "id": "getting-acquainted-1914-directed-by-charlie-chaplin-colorized"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:06:07.998Z"
}