{
  "movieId": "archive-01EastSideKids",
  "title": "01 East Side Kids",
  "year": 2015,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/01EastSideKids",
      "id": "01EastSideKids",
      "title": "01 East Side Kids",
      "description": "Officially, this is the first entry in the East Side Kids franchise. Made in 1940, this Monogram programmer doesn't yet have the familiar chemistry of Leo Gorcey, Huntz Hall, Bobby Jordan and Sammy Morrison, but it's an interesting and fun entry. I hope this new file represents an improvement over the other version available on the Archive. *  *  *  *  *  *  * from Wikipedia; In 1940 producer  Sam Katzman , noting the financial success of other tough-kid series, made the film  East Side Kids  using two of the 'Little Tough Guys', Hally Chester and Harris Berger. He added former  Our Gang  player  Donald Haines ,  Frankie Burke , radio actor Sam Edwards, and Eddie Brian to round out the new team. The film served as a kind of \"pilot\" for a possible series of films, which were eventually made possible by this film's success. Katzman hired former Dead End Kid Bobby Jordan to play the lead in the first film in the series proper,  Boys of the City  and he was soon joined in the series by Leo Gorcey. Gorcey's brother David was also added, as well as (Ernie)  'Sunshine' Sammy Morrison  as \"Scruno,\" the only African-American in the group and a former child actor from the very first cast of the  Our Gang comedy team. In the first few films,  Dave O'Brien  (familiar from low-budget westerns and serials, and as the accident-prone star of the  Pete Smith  comedies) played Jordan's older brother  Knuckles Dolan, who always seemed to be getting roped into chaperoning the kids from adventure to adventure. O'Brien appeared in different roles as well—continuity between films was often ignored. As with the Little Tough Guys, the membership of the team changed from film to film, until Huntz Hall joined in 1941, when the lineup was somewhat stabilized. In total, 20 actors were members of the team at one time or another.",
      "fileSize": 3027801749,
      "addedAt": "2026-01-07T00:06:00.049Z",
      "thumbnail": "https://archive.org/services/img/01EastSideKids",
      "language": "eng",
      "year": 2015,
      "collection": "feature_films",
      "downloads": 59618
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.049Z"
}