{
  "imdbId": "archive-sherlock-holmes-movies-colorized",
  "title": "Sherlock Holmes movies 1939-1944 colorized",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sherlock-holmes-movies-colorized",
      "title": "Sherlock Holmes movies 1939-1944 colorized",
      "description": "Basil Rathbone as Sherlock Holmes Nigel Bruce as Doctor Watson 1. The Hound of the Baskervilles 1939 colorized Holmes and Watson investigate the legend of a supernatural hound, a beast that may be stalking a young heir on the fog-shrouded moorland that makes up his estate. 2. The Adventures of Sherlock Holmes 1939 colorized The master sleuth hunts his archenemy, Professor Moriarty, who is planning the crime of the century. 3. Sherlock Holmes and the Voice of Terror 1942 colorized When a Nazi saboteur jeeringly predicts to the nation new depredations, via their radio 'Voice of Terror', the Intellegence Inner Council summons Sherlock Holmes to help in the crisis. 4. Sherlock Holmes and the Secret Weapon 1942 colorized Holmes and Watson must protect a Swiss inventor of an advanced bomb sight from falling into German hands. 5. Sherlock Holmes in Washington 1943 colorized Holmes and Watson travel to Washington D.C. in order to prevent a secret document from falling into enemy hands. 6. Sherlock Holmes Faces Death 1943 colorized During WWII several murders occur at a convalescent home where Dr. Watson has volunteered his services. He summons Holmes for help and the master detective proceeds to solve the crime from a long list of suspects including the owners of the home, the staff and the patients recovering there. 7. The Spider Woman 1943 colorized Holmes investigates a series of so-called \"pajama suicides\". He knows the female villain behind them is as cunning as Moriarty and as venomous as a spider. 8. The Scarlet Claw 1944 colorized When a gentlewoman is found dead with her throat torn out, the villagers blame a supernatural monster. But Sherlock Holmes, who gets drawn into the case from nearby Quebec, suspects a human murderer. 9. The Pearl of Death 1944 colorized When a valuable pearl with a sinister reputation is stolen, Sherlock Holmes must investigate its link to a series of brutal murders.",
      "id": "sherlock-holmes-movies-colorized"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:50.366Z"
}