{
  "imdbId": "archive-testigo-para-un-crimen-1963",
  "title": "Testigo Para Un Crimen (1963)",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/testigo-para-un-crimen-1963",
      "id": "testigo-para-un-crimen-1963",
      "title": "Testigo Para Un Crimen (1963)",
      "description": "Testigo para un crimen  es una película argentina de 1963 dirigida por  Emilio Vieyra . Fue la primera de dos colaboraciones entre este director y la actriz  Libertad Leblanc  (la segunda sería  María M. , al año siguiente). Se trata de un  thriller  policial.  Jorge Mobaied  fue asistente de dirección. Filmada en blanco y negro, fue estrenada en Argentina el 18 de septiembre de 1963. [ 1 ] ​(Wikipedia) Sinopsis Mauricio Peña ( José María Langlais ), un hombre adinerado, llega a Buenos Aires para vengar la muerte de su joven hermano Raúl ( Alfonso de Grazia ). Traba relación con una sugestiva rubia apodada Blondie (Libertad Leblanc), cantante de un club nocturno regenteado por Otero ( Carlos Carella ), un jefe mafioso. Tras ganarse la confianza de Otero, simulando estar dispuesto a financiar una operación de asalto, Mauricio lleva a Blondie a su apartamento. Después de hacer el amor, interroga a la muchacha sobre las actividades de Otero. Sin saber que la están usando como informante, Blondie provee información a Mauricio, información que lleva a éste a creer que el asesino que busca es un  gánster  llamado Ricci ( Amadeo Novoa ). Sin embargo, Mauricio no llega a ejecutar su plan de venganza contra Ricci. En un intento de violar a Blondie, Ricci es ultimado por un admirador de Blondie llamado Loco ( Mariano Bauzá ), un hombre con cierta torpeza mental. Otero manda a sus secuaces a que maten a Mauricio durante el asalto. Pero Mauricio consigue ultimarlos y salir con vida. Comprediendo que Blondie ha actuado como informante de Mauricio, Otero va a su apartamento y la golpea salvajemente. Entonces aparece Loco y mata a Otero. Llega entonces Mauricio, quien es arrestado como autor de la muerte de Otero, hasta que Loco es finalmente apresado. Pero Mauricio aún deberá averiguar ―con la ayuda del inspector Santoni ( Eduardo Muñoz )― quién ha asesinado a su hermano Raúl. [ 2 ] ​ Reparto Libertad Leblanc  ... Blondie José María Langlais  ... Martin Peña Amadeo Novoa  ... Ricci Alfonso De Grazia  ... Raúl Peña Carlos Carella  ... Otero Eduardo Muñoz  ... Inspector Santoni Mariano Bauzá  ... Loco Dora Baret  ... Matilde Julio De Grazia  ... Romero Raúl del Valle  ... Quinteros Michelle  ... Self Rey Charol  ... Barman Justo Martínez Raúl Szabó  ... Sereno",
      "fileSize": 1227552515,
      "addedAt": "2026-01-07T00:11:46.531Z",
      "thumbnail": "https://archive.org/services/img/testigo-para-un-crimen-1963",
      "language": "spa",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 323
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}