{
  "imdbId": "archive-SozialePlastik_767",
  "title": "1969 Soziale Plastik (Social Sculpture)",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SozialePlastik_767",
      "id": "SozialePlastik_767",
      "title": "1969 Soziale Plastik (Social Sculpture)",
      "description": "With Joseph Beuys. Joseph Beuys accepts the challenge to expose himself to the anonymous audience. \"Social Sculpture\" was filmed in 1969 subsequently after the filming of \"400 m IFF\". IFF is the name of the available film material, that was already expired, from which approximately 400 m were used for \"400 m IFF\" and the rest for \"Social Sculpture\". In \"400 m IFF\" three men appear in front of the filming camera in the apartment of the author. With Joseph Beuys this situation had been appointed, the other two visitors came by chance before him and played instinctively. \"They all noticed the exceptional situation, but could not count on the sovereignty to carry out their point. And even during the operations on the screen, the viewer becomes a participant who cannot avoid the question of how he would have behaved in the same situation.\" The Film with Joseph Beuys about the anonymous viewer that was made subsequently has the title: \"Social Sculpture\". In this film Joseph Beuys accepts the challenge to face the audience without speaking. So the film has no soundtrack. It was presented to the public in 1988 - after the death of Joseph Beuys – by Lutz Mommartz and comes as one might say from the beyond. (LUTZ MOMMARTZ)",
      "fileSize": 1005347937,
      "addedAt": "2026-01-07T00:06:51.870Z",
      "thumbnail": "https://archive.org/services/img/SozialePlastik_767",
      "language": "international",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 15743
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.870Z"
}