{
  "movieId": "archive-he-who-gets-slapped-1924-colorized-movie-576p-sd",
  "title": "He Who Gets Slapped (restored, colorized) (1924, thriller, imdb score: 7.8)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/he-who-gets-slapped-1924-colorized-movie-576p-sd",
      "id": "he-who-gets-slapped-1924-colorized-movie-576p-sd",
      "title": "He Who Gets Slapped (restored, colorized) (1924, thriller, imdb score: 7.8)",
      "description": "He Who Gets Slapped is a 1924 American silent psychological thriller film starring Lon Chaney , Norma Shearer , and John Gilbert , and directed by Victor Sjöström (credited as Victor Seastrom). The film was written by Victor Seastrom and Carey Wilson, based on the Russian play He Who Gets Slapped ( Тот, кто получает пощёчины ; Tot, kto polučájet poščóčiny ) by playwright Leonid Andreyev , which was completed by Andreyev in August 1915, two months before its world premiere at the Moscow Art Theatre on October 27, 1915. A critically successful Broadway production, using an English language translation of the original Russian by Gregory Zilboorg , was staged in 1922, premiering at the Garrick Theatre on January 9, 1922, with Richard Bennett (actor) playing the \"HE\" role on stage. [6] [7] The Russian original was made into a Russian movie in 1916. He Who Gets Slapped was the first film produced entirely by the newly formed Metro-Goldwyn-Mayer . It was not, however, MGM's first released movie, as the film was held until the Christmas season when higher attendance was expected. The movie was highly profitable and critically hailed. It was also the first film to feature a lion as the mascot for MGM . Created by Howard Dietz, the lion logo was first used for the Goldwyn Pictures Corporation film Polly of the Circus (1917 film) and passed on to MGM when Goldwyn merged with two other companies to form MGM. Coincidentally, a real lion plays a key plot point in the Chaney film's plotline. The film was important in the careers of Chaney, Shearer, Gilbert, and Seastrom. Victor Seastrom called Chaney \"the finest actor in the history of the screen or the stage\". George Davis, a popular European clown, coached Chaney in his clown role. The circus sequences took two weeks to film on the studio's largest stage. Stills exist showing details of Chaney's makeup as both Paul Beaumont and \"HE\".",
      "fileSize": 981473146,
      "addedAt": "2026-01-07T00:08:39.344Z",
      "thumbnail": "https://archive.org/services/img/he-who-gets-slapped-1924-colorized-movie-576p-sd",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 181
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.344Z"
}