{
  "movieId": "archive-moonlight-moovies-10-sex-n-drugs-n-rock-n-roll",
  "title": "MOONLIGHT MOOVIES # 10 SEX' N' DRUGS' N' ROCK' N' ROLL",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/moonlight-moovies-10-sex-n-drugs-n-rock-n-roll",
      "id": "moonlight-moovies-10-sex-n-drugs-n-rock-n-roll",
      "title": "MOONLIGHT MOOVIES # 10 SEX' N' DRUGS' N' ROCK' N' ROLL",
      "description": "Settle in, kids; it’s gonna be a long night: A triple-feature, with a “sex’n’drugs’n’rock’n’roll” theme. Our cartoon is an early crossover, in which Popeye, Bluto and Olive Oyl have a close encounter with Betty Boop. It’s Popeye’s first animated appearance, and the first performance of his theme song. Plus, he gets to hula with Miss Boop!  Feature #1 is the semi-classic “Glen or Glenda,” which deals with transvestism and sex reassignment, and includes some rather spacey dream sequences. Writer/director Ed Wood (a real-life transvestite himself) stars under the pseudonym “Daniel Davis.” Sortof narrated by Bela Lugosi, whose immortal lines include \"Bevare! Bevare! Bevare of the big, green dragon that sits on your doorstep! He eats little boys, puppy dog tails, and big, fat snails! Take care! Bevare!\" After a brief intermission, we present that ‘70s campus favorite “Reefer Madness,” in which a single toke leads to a hit-and-run accident, manslaughter, suicide, attempted rape, hallucinations, madness, and some really really fast piano playing.  Stretch your legs during the next break, and then come back for “Rock, Rock, Rock!,” a “jukebox musical” from 1956. Dori Graham (13-year-old Tuesday Weld) desperately wants a strapless dress for the prom, and needs to raise the money for it herself. That’s about it, plot-wise. But the film is crammed with performances by Chuck Berry, La Vern Baker, Teddy Randazzo (later the composer of  \"Goin' Out of My Head\", \"It's Gonna Take a Miracle\", \"Pretty Blue Eyes\", and \"Hurt So Bad\"), the Moonglows, the Flamingos, Frankie Lymon and the Teenagers, and others. Look fast for Valerie Harper’s screen debut as an extra in the Cirino and the Bow-ties segment, as well as after the Teenagers’ song. Remember to replace your speaker on the post, and observe all traffic laws as you drive home.",
      "fileSize": 13157616840,
      "addedAt": "2026-01-07T00:09:54.330Z",
      "thumbnail": "https://archive.org/services/img/moonlight-moovies-10-sex-n-drugs-n-rock-n-roll",
      "collection": "feature_films",
      "downloads": 5325
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.330Z"
}