{
  "imdbId": "archive-filmography-woody-allen",
  "title": "Filmography: Woody Allen",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/filmography-woody-allen",
      "title": "Filmography Woody Allen",
      "description": "Heywood Allen (born Allan Stewart Konigsberg; December 1, 1935) is an American filmmaker, actor, and comedian whose career spans eight decades (the 1950s to the 2020s). Allen began his career writing material for television in the 1950s, alongside Mel Brooks, Carl Reiner, Larry Gelbart, and Neil Simon. He also published several books of short stories and wrote humor pieces for The New Yorker . In the early 1960s, he performed as a stand-up comedian in Greenwich Village, where he developed a monologue style (rather than traditional jokes) and the persona of an insecure, intellectual, fretful nebbish. What's New Pussycat (1965) [ writer and actor ] A playboy who refuses to give up his hedonistic lifestyle to settle down and marry his true love seeks help from a demented psychoanalyst who is having romantic problems of his own. What's Up, Tiger Lily? (1966) Perhaps the first ever gag dub, one of the 1965 Japanese spy film Kokusai himitsu keisatsu: Kagi no kagi , turning it into a comedy about an agent pursuing the world's greatest egg salad recipe. Casino Royale (1967) [ actor only ] After M's death, Sir James Bond is called out of retirement to stop SMERSH. In order to trick SMERSH and Le Chiffre, Bond thinks up the ultimate plan: every agent shall be dubbed James Bond. One Bond, real name Evelyn Tremble, is sent to take on Le Chiffre in a game of baccarat, but all of the Bonds get more than they can handle. Take the Money and Run (1969) A mockumentary of inept petty criminal Virgil Starkwell. Don't Drink the Water (1969) [ writer only ] Based on Allen's play of the same name, the Hollanders' European vacation is interrupted when their plane is forced to land in Vulgaria. The Hollanders leave the plane to take pictures which results in accusations of spying. Chased by soldiers, they take refuge in the American Embassy under the protection of the absent ambassador's hapless son. Bananas (1971) A bumbling New Yorker is dumped by his activist girlfriend, so he travels to a tiny Latin American nation and becomes involved in its latest rebellion. Play It Again, Sam (1972) [ writer and actor ] A Casablanca obsessed film critic seeks to get over his wife leaving him by dating again with the help of a married couple and his illusory idol, Humphrey Bogart. Everything You Always Wanted to Know About Sex* (*But Were Afraid to Ask) (1972) Seven segments related to one another only in that they all purport to be based on sections of the book by David Reuben. The segments range from \" Do Aphrodisiacs Work? \" in which a court jester gives an aphrodisiac to the Queen and is, in the end, beheaded to \" What Happens During Ejaculation? \" in which we watch \"control central\" during a successful seduction. Sleeper (1973) Nerdy health food store owner Miles is revived out of cryostasis 200 years into the future to fight an oppressive government. Love and Death (1975) In czarist Russia, a neurotic soldier and his distant cousin formulate a plot to assassinate Napoleon. The Front (1976) [ actor only ] In 1953, a cashier poses as a writer for blacklisted talents to submit their work through, but the surrounding injustice motivates him to take a stand. Annie Hall (1977) A divorced Jewish comedian reflects on his relationship with his ex-lover, an aspiring nightclub singer, which ended abruptly just like his previous marriages. Interiors (1978) Three sisters find their lives spiraling out of control in the wake of their parents' sudden, unexpected divorce. Manhattan (1979) The life of a divorced television writer dating a teenage girl is further complicated when he becomes enamored with his best friend's mistress. Stardust Memories (1980) While attending a retrospective of his work, a filmmaker recounts his life and loves: the inspirations for his films. A Midsummer Night's Sex Comedy (1982) In the early 20th-century, wacky inventor Andrew Hobbs and his wife Adrian invite two other couples for a weekend party at their romantic summer house in the countryside. Zelig (1983) A 'documentary' about a man who can look and act like whoever he's around, and encounters various famous people. Broadway Danny Rose (1984) A hapless but devoted talent agent attempts to reconcile a lounge singer with his mistress. The Purple Rose of Cairo (1985) In 1935 New Jersey, a movie star exits the screen into the real world and the life of a waitress seeking an escape from her dreary surroundings. Hannah and Her Sisters (1986) Between two Thanksgivings two years apart, Hannah's husband falls in love with her sister Lee, while her hypochondriac ex-husband rekindles his relationship with her sister Holly. Radio Days  (1987) A nostalgic look at radio's golden age focusing on one ordinary family and the various performers in the medium. September  (1987) At a Vermont summer house, Howard falls in love with Lane, who's in a relationship with Peter, who's falling for Stephanie, who's married with children. Another Woman  (1988) Facing a midlife crisis, a fifty-year-old college dean goes on sabbatical and rents an apartment next to a psychiatrist's office to write a new book, then is drawn to the plight of a pregnant woman seeking that doctor's help. New York Stories (1989) A middle-aged artist obsessed with his pretty young assistant ( dir. Martin Scorsese ), a precocious 12-year-old living in a hotel ( dir. Francis Ford Coppola ), and a neurotic lawyer with a possessive mother make up three Gotham tales. Crimes and Misdemeanors (1989) An ophthalmologist's mistress threatens to reveal their affair to his wife while a married documentary filmmaker is infatuated with another woman. Alice (1990) A spoiled Manhattan housewife re-evaluates her life after visiting a Chinatown healer. Shadows and Fog  (1991) With a serial strangler on the loose, a bookkeeper wanders around town searching for the vigilante group intent on catching the killer. Husbands and Wives  (1992) When their best friends announce that they're separating, a professor and his wife discover the faults in their own marriage. Manhattan Murder Mystery  (1993) A middle-aged New York married couple suspect foul play when their neighbor's wife suddenly drops dead. Bullets Over Broadway  (1994) In 1928 New York, a struggling playwright is forced to cast a mobster's talentless girlfriend in his latest drama in order to get it produced. Don't Drink the Water (1994) Based on Allen's play of the same name (this TV adaptation directed by him as well as the earlier iteration left Allen dissatisfied), the Hollanders' European vacation is interrupted when their plane is forced to land in Vulgaria. The Hollanders leave the plane to take pictures which results in accusations of spying. Chased by soldiers, they take refuge in the American Embassy under the protection of the absent ambassador's hapless son. Mighty Aphrodite  (1995) When he discovers his adopted son is a genius, a New York sportswriter seeks out the boy's birth mother: a ditzy porn star and prostitute. Everyone Says I Love You  (1996) A New York girl sets her father up with a beautiful woman in a troubled marriage while her stepsister gets engaged. Deconstructing Harry  (1997) Suffering from writer's block and eagerly awaiting his writing award, Harry Block remembers events from his past and scenes from his best-selling books as characters, real and fictional, come back to haunt him. Celebrity  (1998) The fortunes of a husband and wife differ drastically after they divorce. Sweet and Lowdown (1999) In the 1930s, jazz guitarist Emmet Ray idolizes Django Reinhardt, faces gangsters, and falls in love with a mute woman. Small Time Crooks (2000) An incompetent crook and his wife strike it rich when a botched bank job's cover business becomes a spectacular success. The Curse of the Jade Scorpion (2001) An insurance investigator and an efficiency expert who hate each other are both hypnotized by a crooked hypnotist with a jade scorpion into stealing jewels. Hollywood Ending  (2002) A director is forced to work with his ex-wife, who left him for the boss of the studio bankrolling his new film. But the night before the first day of shooting, he develops a case of psychosomatic blindness. Anything Else  (2003) An aspiring New York writer falls in love at first sight with a free-spirited, spontaneous young woman. Melinda and Melinda (2004) Two alternating stories, one comedic, the other tragic, about Melinda's attempts to straighten out her life. Match Point (2005) At a turning point in his life, a former tennis pro falls for an actress who happens to be dating his friend and soon-to-be brother-in-law. Scoop (2006) An American journalism student in London scoops a big story, and begins an affair with an aristocrat as the incident unfurls. Cassandra's Dream (2007) London brothers Terry and Ian have serious financial woes. When their wealthy uncle proposes that they turn to crime to solve their problems, things go awry and the two become enemies. Vicky Cristina Barcelona (2008) Two friends on holiday in Spain become enamored with the same painter, unaware that his ex-wife, with whom he has a tempestuous relationship, is about to re-enter the picture. Whatever Works  (2009) A middle-aged, misanthropic NYC divorcé surprisingly enters a fulfilling, Pygmalion -type relationship with a much younger, unsophisticated Southern girl. You Will Meet a Tall Dark Stranger  (2010) As her own marriage begins to disintegrate, a young woman's parents' marriage breaks up when her father undergoes a mid-life crisis and impulsively weds a prostitute. Midnight in Paris  (2011) While on a trip to Paris with his fiancée's family, a nostalgic screenwriter finds himself mysteriously traveling back to the 1920s every day at midnight. To Rome with Love  (2012) Four tales unfold in the Eternal City: While vacationing in Rome, an architect encounters a young man whose romantic woes remind him of a painful incident from his own youth; a retired opera director discovers a mortician with an amazing voice, and he seizes the opportunity to rejuvenate his own flagging career; a young couple have separate romantic interludes; a spotlight shines on an ordinary man. Blue Jasmine  (2013) A New York socialite, deeply troubled and in denial, arrives in San Francisco to impose upon her sister. She looks like a million dollars but isn't bringing money, peace or love. Magic in the Moonlight  (2014) In the 1920s, magician Stanley enjoys widespread acclaim as Chinese conjurer Wei Ling Soo, his stage persona. As arrogant as he is talented, Stanley despises claims by phony spiritualists that they can perform real magic. At the behest of his friend, Stanley travels to the Côte d'Azur mansion of the Catledge family to expose a young medium, but he's left surprised and shaken by evidence that her gifts may be real. Irrational Man  (2015) On a small-town college campus, a philosophy professor in existential crisis gives his life new purpose when he enters into a relationship with his student. Café Society (2016) In the 1930s, a Bronx native moves to Hollywood and falls in love with a young woman who is seeing a married man. Wonder Wheel  (2017) In 1950s Coney Island, a a lifeguard tells the story of a middle-aged carousel operator, his beleaguered wife and the visitor who turns their lives upside-down. A Rainy Day in New York  (2019) A young couple arrives in New York for a weekend and meet with bad weather and a series of adventures. Rifkin's Festival  (2020) A married American couple attends the San Sebastian Festival and get caught up in the magic of the event, the beauty and charm of the city, and the fantasy of movies. Coup de chance  (2023) [ French audio w/o subs ] A young married woman runs into an old friend and is immediately smitten. The two friends grow increasingly close, eventually leading to infidelity and even a crime.",
      "id": "filmography-woody-allen"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:06:00.355Z"
}