{
  "imdbId": "archive-de-oldify-rondom-de-zuiderzee-1-en-2-smooth-68-1920s",
  "title": "Rondom de Zuiderzee in de jaren ''30 in kleur! Around the Zuiderzee in the 1930s in color [HD]",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-rondom-de-zuiderzee-1-en-2-smooth-68-1920s",
      "title": "De Oldify Rondom De Zuiderzee 1 En 2 Smooth 68 1920s",
      "description": "Prachtige beelden van de plaatsjes rond de voormalige Zuiderzee bijna een eeuw geleden in kleur. De beide (aan elkaar gemonteerde) oorspronkelijke Z/W films zijn gerestaureerd en ingekleurd door middel van kunstmatige intelligentie (A.I.) software. De film geeft een goede indruk van de grote bedrijvigheid rondom het huidige IJsselmeer in een tijd waarin dit water nog niet van de Noordzee was afgesloten door de afsluitdijk. We zien geweldig interessante beelden van havens, havenhoofden, vissers, vissersschepen, vuurtorens, kasteeltjes en dorpen. O.a. komen plaatsen als Harderwijk, Durgerdam, Urk, Marken en Volendam in beeld evenals diverse pontjes zoals die van Amsterdam naar Harderwijk. Voor meer informatie: zie de onderstaande tijdlijn. Beautiful glimpses of the villages and activities around the Zuiderzee in the Netherlands almost a century ago. The two (joined) original B&W films have been restored and colourized by means of contemporary A.I. software. The film provides a good insight into the very busy Dutch people that lived around the Zuiderzee in the period that this sea was not yet closed off from the North Sea by the 28km long \"Afsluitdijk\". We see highly interesting views of the many small ports, fishermen and -women, lighthouses, small castles and villages. Towns like Harderwijk, Durgerdam, Urk, Marken and Volendam come into view as well as the ferry between Amsterdam and Harderwijk. For more information, please read the timeline below and/or watch the CC captions while the film plays. Music: This film is silent (without sound). Source: Beeld En Geluid. Time Line (draft; please help to complete this): 00:00 Start in Stavoren 04.23 Haven Medemblik met kasteel Radboud 08:25 IJmuiden 09:19 Hindelopen 11:16 Durgerdam 12:25 Muiderslot 13:01 Muiden 18:36 Binnenvaren in de haven van Hoorn.",
      "id": "de-oldify-rondom-de-zuiderzee-1-en-2-smooth-68-1920s"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:37.730Z"
}