{
  "imdbId": "archive-lanneedesmeduses",
  "title": "L'Année des méduses",
  "year": 1984,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lanneedesmeduses",
      "title": "L'Année des méduses",
      "description": "L'Année des méduses est un film français réalisé par Christopher Frank, sorti en 1984. Chris, une jeune fille de 18 ans issue d'un milieu aisé, passe des vacances à Saint-Tropez avec sa mère, pendant que son père reste à Paris pour des raisons professionnelles. Chris est belle, sensuelle, dépourvue de scrupules et de pudeur. Le jour elle se prélasse à la plage souvent seins nus et le soir elle est soit en discothèque, soit au casino, enchaînant les relations sexuelles d'un soir. Elle aime interférer pour semer la zizanie entre les couples, voyant la plage comme un lieu de joute. Mais elle tombe sous le charme de Romain, un dandy qui fournit les riches plaisanciers en jeunes vacancières naïves. Elle tente vainement de le séduire, Romain n'ayant d'yeux que pour la mère de Chris ; Chris en développe une jalousie, ne supportant pas d'avoir été éconduite et voyant en sa propre mère une rivale. Lors d'une de ses baignades où elle nage seins nus, Chris est piquée à un sein (chose benigne pour elle), par une méduse. Les méduses sont nombreuses cette annee là et Chris apprend alors par une confidence que Romain est allergique aux piqûres de méduses. Elle décide alors d'utiliser ce phénomène pour se venger de l'affront que Romain, selon elle, lui a fait subir Réalisation : Christopher Frank Scénario : Christopher Frank, d'après son roman Bernard Giraudeau : Romain Kalides Valérie Kaprisky : Chris Rivaut Caroline Cellier : Claude Rivaut Jacques Perrin : Vic Lamotte Béatrice Agenin : Marianne Lamotte Barbara Nielsen : Barbara David Jalil : Jean-Paul Philippe Lemaire : Lamotte Pierre Vaneck : Pierre Rivaut Jean-Paul Dubarry : Guttaz Betty Assenza : Dorothée Serge Gaubardy Charlotte Kady : Miriam",
      "fileSize": 13652612110,
      "id": "lanneedesmeduses"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.887Z"
}