{
  "imdbId": "archive-riachuelo-1934",
  "title": "Riachuelo ( 1934)",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/riachuelo-1934",
      "title": "Riachuelo ( 1934)",
      "description": "Riachuelo  es una  película   argentina  estrenada el 4 de julio de 1934, dirigida por  Luis José Moglia Barth  sobre su propio guion escrito en colaboración con  José Bustamante y Ballivián  según el argumento de este y protagonizada por  Luis Sandrini ,  Maruja Pibernat ,  María Esther Gamas  y  Alfredo Camina  con música original de  Edgardo Donato  y  Máximo Orsi . Fue la tercera película de este director para la productora  Argentina Sono Film , que tuvo grandes dificultades para reunir el dinero necesario para terminarla pues los socios capitalistas se habían retirado de la empresa. Obtuvo buena recepción del público y de la crítica, costó menos de 80.000 pesos y solamente en el primer año le rindió a la productora un millón de pesos. (Wikipedia) Sinopsis Al comienzo de la película Berretín, interpretado por Luis Sandrini, sale del viejo remolcador anclado en el  Riachuelo  donde vive y comienza a caminar entre los marineros de distintas nacionalidades que cruzan por el lugar. Es un hábil carterista que lleva consigo un paraguas en cuyo interior va guardando lo que roba. Llega a un boliche donde toca una orquesta de señoritas cuya cantante, Rosa, le dedica el tango  Berretín . Un guapo cuyo apodo es El Carancho pretende llevarse a Rosa pero entre ésta y Berretin más la ayuda de Remanso, a quien recién conocen en ese incidente, se lo sacan de encima. Berretín le ofrece alojamiento en el remolcador y allí se entera de que Remanso acaba de salir de la cárcel, adonde fue a parar por culpa de una mujer. Remanso comienza a trabajar en un astillero y a interesarse románticamente por Rosa. Berretín sigue robando pero cuando le saca dinero a una pobre gente Remanso lo obliga a devolverlo y por ello recibe un beso de una muchacha agradecida. Eso lo transforma, decide hacerse honrado, dejar de robar y comenzar a trabajar en el astillero. Más adelante, y por azar, consigue descubrir y atrapar a la banda de El Carancho que había robado en el astillero y su dueño, agradecido por haber recobrado el dinero, le arregla el remolcador. Finalmente Berretín se casa con aquella muchacha y Remanso hace lo mismo con Rosa y se ve a los cuatro navegar por el Riachuelo. Reparto Luis Sandrini Maruja Pibernat Alfredo Camina Héctor Calcaño María Esther Gamas Joaquín Pérez Bilbao Juan Sarcione Margarita Solá Froilán Varela Vicente Forastieri",
      "id": "riachuelo-1934"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:09:00.595Z"
}