{
  "imdbId": "archive-TheBrokenSpringRose",
  "title": "\"The Broken Spring Rose\" (1912) director Victor Sjöström (Seastrom)",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBrokenSpringRose",
      "title": "\"The Broken Spring Rose\" (1912) director Victor Sjöström (Seastrom)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Broken Spring Rose\", a.k.a. \"The Gardener\" and \"The Cruelty of the World\", is a short Swedish drama, featuring director Victor Sjöström (Seastrom), a star of Silent Hall of Fame.  Victor Seastrom is both a star of the film and its director.  He was successful in his native Sweden before making a career in the USA in 1924-1930.  His Hollywood films are still copyrighted, this is why we show you films from his previous years. \"The Broken Spring Rose\" was banned in Sweden, where it was shown only in 1980 upon getting rediscovered in a US archive after being considered lost for decades. The censored US print that we have is missing some scenes. Apparently the plot is this: A wealthy gardener (Victor Seastrom) breaks up the possible engagement of his son to the daughter of a man who works for him. After the son is forced to leave the gardener rapes the girl and then drives her and her father away. The girl is temporarily cared for in the home of an elderly benefactor, but when he dies she is driven away yet again, and apparently turns to prostitution. In the end she returns to the place of that fateful encounter with the rapist that destroyed her life. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 20387389,
      "id": "TheBrokenSpringRose"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.273Z"
}