{
  "movieId": "archive-TheWhiteDevilderWeieTeufel1930",
  "title": "\"The White Devil\" [\"Der Weisse Teufel\"] [1930]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheWhiteDevilderWeieTeufel1930",
      "id": "TheWhiteDevilderWeieTeufel1930",
      "title": "\"The White Devil\" [\"Der Weisse Teufel\"] [1930]",
      "description": "One might want to label \"The White Devil\" [a German/Italian production] as a transitional film from silent to synchronized sound--sort of. There is no dialogue...only synchronized sound effects, singing, and a music score [Michael Lewin, Marc Roland & Willy Schmidt-Gentner]. Curt Courant was one of the cinematographers who did the immensely popular \"Berlin: Symphony of a Great City\" [ http://www.archive.org/details/BerlinSymphonyofaGreatCity ]. The other cinematographer was Nikolai Toporkoff noted for his work on Abel Gance's \"Napoleon\". Kenneth Rive [Murad's son] would become an important distributor of European Art Cinema in England, introducing the works of Bergman, Truffaut and Goddard. Interestingly, one source suggested that an uncredited Peter Lorre was in the film. That has not been confirmed. ---------- Ivan Mozzhukhin [\"Michel Strogoff\" and \"Casanova\"] and Lil Dagover star in an adaptation of Leo Tolstoy's \"Hajji Murad\" [his own account as a soldier during the Russian-Caucasian War]. [The free book is available at http://ebooks.adelaide.edu.au/t/tolstoy/leo/t65h/ .] Ivan Mozzhukhin is a \"...hot-headed Caucasian mountaineer leader whose irrational behavior comes to the attention of the Czar (Fritz Alberti). Hoping to use Hajji Murad as a go-between in his plans to conquer the Caucasus mountaineers, the Russian ruler finds that the hero is not so easily manipulated. Rescuing the beautiful Saira (Betty Amann) from the Czar's clutches, Hajji Murad leads the mountain people's revolt against the despotic regent.\" Needless to say, the film ends in tragedy.",
      "fileSize": 1627191642,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/TheWhiteDevilderWeieTeufel1930",
      "collection": "feature_films",
      "downloads": 5696
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}