{
  "imdbId": "archive-donde-mueren-las-palabras-1945",
  "title": "Donde Mueren Las Palabras (1945)",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/donde-mueren-las-palabras-1945",
      "title": "Donde Mueren Las Palabras (1945)",
      "description": "Donde mueren las palabras  es una película de  Argentina  en blanco y negro dirigida por  Hugo Fregonese  según el guion de  Homero Manzi  y  Ulyses Petit de Murat  que se estrenó el 25 de abril de 1946 y que tuvo como protagonistas a  Enrique Muiño ,  Darío Garzay ,  Héctor Méndez  e  Ítalo Bertini . La película tuvo además la colaboración de  Margarita Wallmann  en la coreografía, esculturas de  Mario Arrigutti  y  Germen Gelpi  y la supervisión de  Lucas Demare . Es el primer largometraje dirigido por Fregonese. En una encuesta de las  100 mejores películas del cine argentino  llevada a cabo por el  Museo del Cine Pablo Ducrós Hicken  en el año 2000, la película alcanzó el puesto 43. 1 ​(Wikipedia) Sinopsis y notas Un anciano huye de su propio pasado en este film. El film fue un éxito en su tiempo, y su eficacia formal permitió a Fregonese obtener un contrato en la Metro-Goldwyn-Mayer. La escena culminante de esta historia con ecos expresionistas es un extenso ballet, coreografiado por Margarita Wallman sobre música de Beethoven, cuya puesta en escena cinematográfica supuso un verdadero tour de force para el director. Un año antes, Fregonese había codirigido el film \"Pampa Bárbara\" con su mentor Lucas Demare, pero fue su trabajo en \"Donde mueren las palabras\" el que le permitió convertirse en el primer director argentino que hizo carrera en Hollywood. Reparto Enrique Muiño  ... Vittorio Darío Garzay  ... Darío Héctor Méndez  ... Rogelio Italo Bertini  ... Carlo Carletti Aurelia Ferrer María Ruanova  ... Bailarina René Mugica Pablo Cumo Linda Lorena  ... Fedora Lauzan María Hurtado José A. Vázquez Enrique Ferraro Vittorio Podrecca y sus Piccoli Milita Brandon Orestes Soriani",
      "fileSize": 2288318300,
      "id": "donde-mueren-las-palabras-1945"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.374Z"
}