{
  "imdbId": "archive-Sita_Sings_the_Blues_Files",
  "title": "Sita Sings the Blues Files",
  "year": 2008,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Sita_Sings_the_Blues_Files",
      "title": "Sita Sings The Blues Files",
      "description": "Flash Authoring Files for the feature-length animated film Sita Sings the Blues All the Flash authoring (.fla) files I used to make Sita Sings the Blues have just been posted on archive.org , under a Creative Commons Share Alike license. Want to know how I got a certain animated effect in Sita Sings the Blues ? Open up the .fla files and find out. Want to remix from the source? Now you can. Want to make a Sita Sings the Blues video game using all the assets? Go for it. (But I strongly suggest you negotiate my endorsement if you want to actually market the end product.) License: You may use these files any way you wish, as long as you 1. attribute the source to Nina Paley / Sita Sings the Blues ; 2. properly attribute any modifications so it’s clear those are NOT by Nina Paley ; 3. Release any resulting work under the same Creative Commons Share Alike license. DRM is prohibited on anything made with these source files. Certain musical works included in Sita Sings the Blues, listed here , are subject to restrictive licenses. As required by the respective copyright holders, these licenses only allow you to listen to these songs in the context of the original film. Here is a chart containing a full list of restricted songs and their composers, along with each song’s license holder today. File names: These files are very poorly named. We welcome any open re-naming and re-cataloguing projects. Asset libraries: Please note that every file has its own asset library. Although many assets have the same name, in many cases they are not exactly the same from file to file. Combining assets may yield strange results. Hanuman’s pupils, for example, may appear giant-sized when moved into other libraries. Yes, I know bad bad people can also use the .fla files for dastardly deeds (the dreaded hypothetical “Nazi Porn Version” that always comes up at Q&A’s). Bad bad people can use our shared Language and Technology for evil too, but I’m not going to constipate culture out of fear of imaginary worst-case scenarios. I’m confident much more good will come from this than bad, and that’s motivation enough for me. It’s Free Culture , baby. If programmers can tinker with the Free Software ’s source code , artists can tinker with Sita Sings the Blues ‘ source files .",
      "id": "Sita_Sings_the_Blues_Files"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:29.662Z"
}