{
  "imdbId": "archive-prelude-to-war",
  "title": "Frank Capra's Why We Fight #1 Prelude To War CC: [00:52:15]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/prelude-to-war",
      "title": "Frank Capra's Why We Fight #1 Prelude To War CC: [00:52:15]",
      "description": "https://en.wikipedia.org/wiki/Prelude_to_War Prelude to War  examines the difference between democratic and fascist states and covers the  Japanese invasion of Manchuria  and the  Italian invasion of Ethiopia .  Capra describes it as \"presenting a general picture of two worlds; the slave and the free, and the rise of totalitarian militarism from Japan's conquest of Manchuria to Mussolini's conquest of Ethiopia.\"  This film won the  Academy Award for Best Documentary Feature Film . The first film of  Frank Capra 's  Why We Fight  film series commissioned by the  Office of War Information  (OWI) and  George C. Marshall . It was made to educate American troops of the necessity of combating the  Axis powers  during  World War II  based on the idea that those in the service would fight more willingly and ably if they knew the background and the reason for their participation in the war. The film was later released to the general American public as a rallying cry for support of the war. In an edit added to the film before public release, a comment by  US Secretary of War   Henry L. Stimson , is quoted to create trust with the audience: \"the purpose of these films is to give factual information as to the causes, the events leading up to our entry into the war and the principles for which we are fighting.\" The purpose of the OWI was to use mass communication to appeal to both serving soldiers and later, the American population on the reasons for the war; and so it released  Prelude to War  to further those goals. The film starts by an explanation of how Americans were brought into the war through heroic motives to protect countries unable to protect themselves. The film expresses the view that America had this duty to righteousness and  Christian values  throughout history, according to the values and the beliefs set forth by the  Founding Fathers . The film makes use of compare and contrast methods throughout the film to transmit its  heroic  message. The primary images used within the film to portray the opponents of America are introduced by  Henry Wallace  as the \"free world,\" a brightly-illuminated planet of the  Allies , and a \"slave world,\" a planet deep in shadow of the Axis powers. These maps were animated by  Walt Disney Productions . The film examines the differences between the  United States  and the fascist  Axis  states of  Benito Mussolini ,  Adolf Hitler  and  Hirohito  by portraying the latter countries working together as  gangsters  to conquer the world. That is done by footage from Nazi's  Triumph des Willens (Triumph of the Will)  but with different narration designed to support the Allied cause. It is emphasized that after the  Nazis  smashed the opposing political parties and labor unions, they turned their attention to their last remaining obstacle, the church. In one scene, a stained glass window is shattered by several bricks to reveal a  \"Heil Hitler!\"  poster behind. To emphasize that depiction of Hitler as an  Antichrist  figure, a class of German schoolchildren is shown singing to the song  Frederick Rex : Adolf Hitler is our Saviour, our hero He is the noblest being in the whole wide world. For Hitler we live, For Hitler we die. Our Hitler is our Lord. Who rules a brave new world. In the two decades following  World War I  and the failure of the  League of Nations , a spirit of  isolationism  becomes prevalent throughout the United States and persists until the  attack on Pearl Harbor . That presented a major obstacle in garnering support for the war, as Americans did not feel a sense of unity with other nations of the world, most notably,  Europe . In an effort to dispel that isolationist way of thinking,  Prelude to War  was produced to raise the enthusiasm and interest of US troops for the international struggle. The film addresses the need for change in Americans' views on the war by interviews with civilians. In response to whether or not America should get involved in the war, Americans are depicted saying, \"I think we should stay out of it entirely\" and \"They mean nothing to us.\"  Protesters against the war  rally under slogans like \"No Foreign Entanglements.\" The film argues that contrary to the public opinion of the time, American problems \"were and always will be dependent upon the problems of the entire world and our peace is gained when there is peace for all.\" The film pointed to the  Japanese invasion of Manchuria  as the  beginning of World War II : \"remember that date: Sept 18, 1931 a date you should remember as well as Dec 7, 1941. For on that date in 1931 the war we are now fighting begun.\" It stated that it was known that the aggressors should be stopped but that it was impossible to convince ordinary people \"that they should go to war over a mud hut in  Manchuria .\" After going over the  Japanese invasion of China , the film asks about  Japan 's allies by stating that before Hitler was ready, Mussolini had to be ready since his government had not been able to produce what it had promised and \"so he pulled the old trick of a foreign war to divert from troubles at home.\" The film then describes just how outclassed Ethiopia was against Italy and how \"we hadn't realized that peace for us involves peace for all\" and that Hitler would be taken up in the  next film .",
      "id": "prelude-to-war"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:08:26.416Z"
}