{
  "movieId": "archive-senora-de-nadie-1982",
  "title": "Señora De Nadie (1982)",
  "year": 1982,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/senora-de-nadie-1982",
      "id": "senora-de-nadie-1982",
      "title": "Señora De Nadie (1982)",
      "description": "Señora de nadie  es una  película   argentina  de 1982, dirigida por  María Luisa Bemberg  y protagonizada por  Luisina Brando ,  Rodolfo Ranni ,  Julio Chávez ,  China Zorrilla ,  Susú Pecoraro  y  Gabriela Acher . Se estrenó el 1 de abril de 1982. (Wikipedia) Sinopsis Es la historia de Leonor, una buena ama de casa que vive con su marido, Fernando, y sus dos hijos. Ama profundamente a su marido y no pone en duda la reciprocidad de su amor y su fidelidad. Un día, circunstancialmente, descubre que su marido la engaña. Leonor se siente traicionada emocionalmente y comprende que su mundo, basado en una mentira, se ha desmoronado como un castillo de naipes. Con más miedo que convicción, abandona la casa, dejando cartelitos con instrucciones precisas para su marcha y confía a sus hijos al cuidado de su marido. Se refugia en lo de su tía Lola que tiene una casa transformada en un hogar para ancianos. Allí Fernando no podrá encontrarla. Espía a sus hijos saliendo de su casa para el colegio pero no puede acercarse ya que no quiere que la vean destrozada. Con una recomendación del marido de su madre, empieza a trabajar en una inmobiliaria como promotora y por primera vez en su vida gana su propio dinero. Conoce casualmente y se hace amiga de un joven homosexual, Pablo ( Julio Chávez ), que es tierno, sensible y tan desolado como ella. Poco a poco se reencontrará con sus hijos, a quienes verá diariamente, y comenzará un proceso de búsqueda de su propia identidad. Reparto Luisina Brando  como Leonor Vitali de Morales 1 ​ Rodolfo Ranni  como Fernando Morales Julio Chávez  como Pablo Toledo Gabriela Acher  como Isabel Susú Pecoraro  como Gloria China Zorrilla  como Madre de Leonor Berugo Carambula  como Amante con barba Gonzalo Palmes  como Miguel Damián Urquino  como Juan María Ibarreta  como Dolores Guillermo Rico  como Varela Villanueva Cosse  como Miguel João Ádeles  como Carlinho Lidia Catalano  como Nancy Pino Dangelo Maria Fournery Marisa Herrero Sara Krell Víctor Proncet Hugo Urquijo Joao Adeles Miguel Ángel Llovet como el analizado.  Ana Nisenson (1948-) como la mucama. 2 ​ Gonzalo Palmes Víctor Proncet 3 ​",
      "fileSize": 2480535422,
      "addedAt": "2026-01-07T00:10:50.364Z",
      "thumbnail": "https://archive.org/services/img/senora-de-nadie-1982",
      "language": "spa",
      "year": 1982,
      "collection": "feature_films",
      "downloads": 292
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.364Z"
}