{
  "imdbId": "archive-ed-gardners-duffy-s-tavern-1945-all-star-cast-tavern",
  "title": "Ed Gardner's DUFFY' S TAVERN (1945 All Star Cast, Tavern)",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ed-gardners-duffy-s-tavern-1945-all-star-cast-tavern",
      "title": "Ed Gardner's DUFFY' S TAVERN (1945 All Star Cast, Tavern)",
      "description": "TAGLINES : 01) Biggest Star Party in Hollywood History 02) Radio Riot Show Screened by Paramount 03) Meet Archie and the Gang at DUFFY'S TAVERN (print ad - Lubbock Evening Journal - Broadway Theatre - Lubbock, Texas - March 5, 1946) PLOT: The staff of a record factory drown their sorrows at Duffy's Tavern, while the company owner faces threats of bankruptcy. STORYLINE : Duffy’s Tavern was another of Paramount’s ‘all-star cast’ films, a large scale musical based upon characters created by Ed Gardner for his popular radio show, Duffy's Tavern. Archie [played by Ed Gardner] (with regulars Eddie (Eddie Green) and Finnegan (Charles Cantor)) was surrounded by many of Paramount Pictures stars playing themselves, including Robert Benchley, William Bendix, Eddie Bracken, Bing Crosby, Cass Daley, Brian Donlevy, Paulette Goddard, Betty Hutton, Alan Ladd, Veronica Lake and Dorothy Lamour. The film's plot involves a war-displaced record manufacturer whose staff—those not sent off to war—drown their sorrows at Duffy's on credit, while the company owner tries to find ways around the price controls and war attrition that threaten to put him out of business. Bing Crosby makes two appearances in the film, once to sing with a group, which includes Betty Hutton, Sonny Tufts, Diana Lynn, Billy De Wolfe, Cass Daley, Dorothy Lamour and Howard Da Silva, a parody of \"Swinging on a Star\", and again in a sketch where Robert Benchley tells a bed-time story about Bing to the four Crosby boys. He is also heard, but not seen, singing \"Learn to Croon\", \"Please\", and \"Love in Bloom\" when recordings are presented on an on-screen phonograph. It was the film debut of the four Crosby boys other than Gary Crosby’s walk-on part in Star Spangled Rhythm. - --Wikipedia CAST :     Ed Gardne r as Archie / Bing Crosby as himself / Betty Hutton as herself     Paulette Goddard as herself / Alan Ladd as himself / Dorothy Lamour as herself     Eddie Bracken as himself / Brian Donlevy as himself / Sonny Tufts as himself     Veronica Lake as herself / Arturo de Córdova as himself / Barry Fitzgerald as Bing Crosby's Father     Cass Daley as herself  / Diana Lynn as herself / Victor Moore as Michael O'Malley     Marjorie Reynolds as Peggy O'Malley / Barry Sullivan as Danny Murphy / Charles Cantor as Finnegan     Eddie Green as Eddie the Waiter / Ann Thomas as Miss Duffy / Robert Benchley as himself     William Demarest as himself / Howard Da Silva as Tough Guy / Billy De Wolf e as Doctor     Walter Abel as Director / Johnny Coy as Dancer/Waiter / Miriam Nelson as Dancer     Charles Quigley as Ronald / Olga San Juan as Gloria / Bobby Watson as Masseur / Gary Crosby as himself     Phillip Crosby as himself / Dennis Crosby as himself / Lindsay Crosby as himself / William Bendix as himself     James Brown as himself / Joan Caulfield as herself / Gail Russell as herself     Helen Walker as herself / Jean Heather as herself  and  Maurice Rocco as himself --Wikipedia TRIVIA : 01 ) The film was placed 15th in the list of highest-grossing movies in the US in 1945. 02) Bosley Crowther of The New York Times summarized it as \"Take it for what it is, a hodge-podge of spare-time clowning by the gang, including a large hunk of Archie, and you’ll find Duffy’s Tavern fair enough.\"[2] 03 ) Leonard Maltin's Movie Guide gave the film a BOMB rating. 04) Film Daily commented : \"There isn’t much to the story itself, which merely offers an excuse for bringing in such topflighters as Bing Crosby, Betty Hutton, Paulette Goddard, Dorothy Lamour, Eddie Bracken, Veronica Lake, to name but a handful, so that they may do their bit in the manner of guest stars. Most of the big names are introduced at the end in a benefit show staged to raise money to permit Victor Moore to reopen his record factory and put a lot of nice guys back to work.\"[3] --Wikipedia TRIVIA : 01) One of over 700 Paramount Productions, filmed between 1929 and 1949, which were sold to MCA/Universal in 1958 for television distribution, and have been owned and controlled by Universal ever since. 02) Joan Caufield's debut. 03) This movie was followed in 1958 with a TV show of same name. --IMDb ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. I do receive a huge amount of joy in sharing with you, these many 100s of free-to-you items I have uploaded, however, I have no wish to infringe on any existing copyright laws. DEF.gp ddh ** The following statement is written from my heart ... t hese are my words and not to be in any way, considered a form letter from archive.org, as the two cents' worth comes from this volunteer , IA member - user - uploader. Thank you in advance for keeping in mind, my t hought process . :)   (ed note from Doreen.) * Although it's quite true that all uploaded material found at archive.org is free for you to watch or download , t he space needed to store it, is not. As you can well imagine, IA grows in leaps and bounds each and every day, the daily cost to keep this wonderful address we so much enjoy, running at proper capacity, is tremendous . This fact is the one and ONLY reason a yearly fundraiser is necessary .... to raise extra dollars to keep this free-for-viewing/downloading and available for today's generations as well as for all future generations ! Each of we worldwide family of members & users of archive.org , can help to support this rare, free, and most importantly of all, non-profit organization, because wi th as little as $1 to $5 , you too can make a difference. Small donation, you say? Yes, maybe so .. but stop and think of the huge difference that donation can make, if every single one of we archive.org. members/users j ust say: ''I can do that, and I WILL do that!'' Please consider making that very important donation. Sincerely, I thank you . Doreen. (DEF.gp ddh) *",
      "fileSize": 245280180,
      "id": "ed-gardners-duffy-s-tavern-1945-all-star-cast-tavern"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.376Z"
}