{
  "movieId": "archive-le-samurai-vose-sellada",
  "title": "EL SAMURAI - [VOSE] Sellada",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/le-samurai-vose-sellada",
      "id": "le-samurai-vose-sellada",
      "title": "EL SAMURAI - [VOSE] Sellada",
      "description": "Título original: Le Samouraï   AKA: Le samourai, El samurái En México: El samurai. En España: El silencio de un hombre País de origen:  Francia Estreno: En Francia, 25 de octubre de 1967. En México: El 13 de junio de 1968 en los cines: Chapultepec y Rívoli del D.F. (Ciudad de México) ocupando la cartelera por 5 semanas. En España (Barcelona) el 25 de octubre de 1968. Duración: 105 min. Dirección: Jean-Pierre Melville Guion: Jean-Pierre Melville ,  Georges Pellegrin . Novela:  Joan McLeod Reparto: Alain Delon , François Périer , Nathalie Delon , Cathy Rosier , Jacques Leroy , Música: François de Roubaix Fotografía: Henri Decaë Género: Cine negro ,  Thriller ,  Crimen ,  Neo-noir ,  Policíaco ,  Polar francés , Film Noir, Sinopsis La historia de un hermético y frío asesino a sueldo. Jeff Costello es un perfeccionista que siempre planea cuidadosamente sus asesinatos y al que nunca han atrapado. Sin embargo una noche, tras liquidar al dueño de un club nocturno, queda a la vista de varios testigos. Sus esfuerzos por construir una coartada fallan y poco a poco es acorralado, tanto por la policía como los clientes que le han traicionado. ( FILMAFFINITY )   Esta es una de las películas más influyentes de la historia. Cineastas cómo: Martin Scorsese ,  Quentin Tarantino ,  Francis Ford Coppola ,  Jim Jarmusch ,  John Woo ,  Johnnie To ,  David Fincher ,  Bernardo Bertolucci ,  Aki Kaurismäki ,  Takeshi Kitano ,  Georges Lautner ,  Nicolas Winding Refn ,  Luc Besson ,  Joel Coen ,  Ethan Coen y otros han realizado películas fuertemente inspiradas en este filme.   CRÍTICAS: \"La cima de Jean Pierre Melville, un modelo de cine negro (...) de una desnudez formal llevada al límite que se traduce en una oleada de resonancias dramáticas.\" Miguel Ángel Palomo :  Diario El País   \"Una obra maestra con el alma helada; un thriller estilizado y profundo en el que el cine americano de gángsteres de los años 40 se cruza con el policíaco francés hasta convertirse en una pieza icónica de la cultura popular de los 60.\"  Luis Martínez :  Diario El Mundo   \"Es como si Melville, al centrarse con tranquilidad en los sucesos que tiene delante, diera con una mezcla perfecta entre lo realista y mundano y lo hipnóticamente etéreo (…) Puntuación: ★★★★ (sobre 4)\"   Nick Schager :  Slant   \"Perfectamente ejecutado (...) Podría ser visto como uno de los mejores thrillers psicológicos, tratando temas como el honor, la lealtad y la traición\"  Derek Malcolm :  The Guardian   \"Desde sus silenciosos momentos iniciales hasta su impresionante conclusión, 'Le Samourai' es obra de uno de los mejores directores de la historia que aquí ofrece su versión más expresiva (…) Puntuación: ★★★★ (sobre 5)\"   Marjorie Baumgarten :  Austin Chronicle   \"Se acerca a la perfección. Combina una dirección elegante, un guion inteligente, actuaciones de primer nivel y una atmósfera imponente (…) Puntuación: ★★★★ (sobre 4)\"   James Berardinelli :  ReelViews   Posición en rankings FILMAFFINITY 41   Mejores películas francesas de todos los tiempos 53   Mejores películas de cine negro 73   Mejores thrillers de la historia del cine 90   Mejores películas sobre el mundo criminal",
      "fileSize": 7088316186,
      "addedAt": "2026-01-07T00:09:38.888Z",
      "thumbnail": "https://archive.org/services/img/le-samurai-vose-sellada",
      "language": "fre",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 1289
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "samurai",
      "name": "Samurai"
    },
    {
      "id": "martial-arts",
      "name": "Martial Arts"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}