{
  "imdbId": "archive-moonlight-moovies-11-psychotronic-psantas",
  "title": "MOONLIGHT MOOVIES # 11 PSYCHOTRONIC PSANTAS",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/moonlight-moovies-11-psychotronic-psantas",
      "id": "moonlight-moovies-11-psychotronic-psantas",
      "title": "MOONLIGHT MOOVIES # 11 PSYCHOTRONIC PSANTAS",
      "description": "MOONLIGHT MOOVIES #11 is a complete drive-in program, and this edition’s theme is PSYCHOTRONIC SANTAS – which means our cinematic sack is overflowing with, uhh….stuff. We begin with 1936’s “Christmas Comes But Once a Year,” the only appearance of Prof. Grampy without Betty Boop. He becomes the hero of the local orphanage when his ingenious inventions give the kids a Christmas they’ll never forget. Next up is a short subject, “A Visit to Santa Claus,”   where we learn that Mr. Claus’s HQ looks suspiciously like a mid-‘60s suburban living room. He also employs some rather tall elves. Our first blockbuster is 1964's “Santa Claus Conquers the Martians,” in which the titular aliens abduct Santa and a pair of children and bring them to Mars; Martian kids have been whining for Santa since seeing him on Earth TV. There are subplots and countermeasures galore, including more kidnappings, mistaken identities,daring escapes, nefarious sabotage and lots more. Girmar is portrayed by 11-year-old Pia Zadora. Grab some candy canes and eggnog at the snack bar, and then return for our  straight-from-Mexico (via K. Gordon Murray), second feature, 1959’s “Santa Claus.” Mr. Claus has ditched the North Pole in favor of an outer space base of operations, and has a disturbing habit of kidnapping children from around the world to work in his toy factory. Eventually, he must battle Satan’s emissary Pitch, who has been sent to make Earth’s children evil. Merlin the magician is also involved somehow, and you’ll note that Santa’s HQ might have been designed by the crew from Pee-Wee’s Playhouse. This one’s also known as “Santa Claus vs. the Devil.”   Thanks for coming by, and remember to hang your speaker in its proper location. Drive safely, and watch out for reindeer droppings!",
      "fileSize": 12994870728,
      "addedAt": "2026-01-07T00:09:54.330Z",
      "thumbnail": "https://archive.org/services/img/moonlight-moovies-11-psychotronic-psantas",
      "collection": "feature_films",
      "downloads": 2492
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.330Z"
}