{
  "imdbId": "archive-joylessStreetdieFreudloseGasse1925",
  "title": "\"Joyless Street\" [\"Die Freudlose Gasse\"] [1925]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/joylessStreetdieFreudloseGasse1925",
      "id": "joylessStreetdieFreudloseGasse1925",
      "title": "\"Joyless Street\" [\"Die Freudlose Gasse\"] [1925]",
      "description": "Plot [Wikipedia]... In 1921 in the poor part of an Austrian town called Melchiorgasse there are only two wealthy people: the butcher Josef Geiringer and his wife. Mrs. Greifer runs a fashion boutique and a nightclub patronized by wealthy Viennese. Annexed to the nightclub is Merkl Hotel, a brothel to which the women of the nightclub bring their clients. The film follows the lives of two women from the same poor neighborhood as they try to better themselves during the period of Austrian postwar hyperinflation. They are Marie, who becomes a prostitute, and Grete who does not. At the finale Else kills the butcher because he will not give her meat. The poor of the neighborhood, hearing the sounds of the nightclub, revolt against the clients by throwing stones. The nightclub burns down killing two beggars. Only Grete seems to have any hope of leaving Melchiorgasse and this because of her relationship with an American Red Cross officer. ---------- Be advised that this version [a few seconds over 60 minutes] has been severely edited by the \"good\" censors. Wikipedia states... Shortly after its release, different versions of the film circulated because of censorship cuts. The Filmmuseum in Munich restored the film in 1999 to its original length. A digital version of this new film, 142 minutes in length, was then produced by Austrian Filmarchiv, from whom it is available. Nevertheless, it is a film worth watching for another reason besides Greta Garbo...it is an early representation the \"Objectivity\" movement from Germany. New Objectivity movement [German] http://en.wikipedia.org/wiki/New_Objectivity Georg Wilhelm Pabst [Wikipedia] http://en.wikipedia.org/wiki/Georg_Wilhelm_Pabst",
      "fileSize": 637818328,
      "addedAt": "2026-01-07T00:09:15.997Z",
      "thumbnail": "https://archive.org/services/img/joylessStreetdieFreudloseGasse1925",
      "collection": "feature_films",
      "downloads": 52170
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.997Z"
}