{
  "imdbId": "archive-Mommartz_DER_GARTEN_EDEN_2_1977",
  "title": "1977 Der Garten Eden (the garden Eden)",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mommartz_DER_GARTEN_EDEN_2_1977",
      "title": "Mommartz DER GARTEN EDEN 2",
      "description": "Bundesfilmpreis: Filmband in Silber Camera: Dieter Fietzke and Lutz Mommartz, Sound: Herbert Baumann, Important help: Ingrid Lutz, Henning Brandis, Franz van der Grinten, Fritz Gorrissen, Pastor Mühlhoff, Ernst Schönzeler, Ata Jansen, Frau Heukulum, Brigitte Groenewald, Familie van de Sandt, Familie Schmidt, Hennes Stelzer, Bauer Timpe, Hugo Bos and al inhabitants from Schanze / Germany. A utopian film about landscape and people from the Niederrhein / Germany. SEBASTIAN FELDMANN, RP, 20.12.1977 Where is the Garden of Eden, the paradise? At the Niederrhein /Germany, as old local legends will tell us; It is in ourselves, when we realize it on earth. so it is everywhere, or, as Ernst Bloch says, \"there where no one has been before\"? At home? About the Garden of Eden in the gap between utopian and forgotten draft Lutz Mommartz from Düsseldorf has made a three-hour movie. He seeks a conceptual way between the Archimedean idea-points \"home\", \"paradise\" and \"utopia\". Lutz Mommartz managed it to be an exceptional and thoughtful film. Even the first, dreamlike images show the high standards of the director. In a vaporous fantasy-air-water Tableaux the first day of creation is painted. The separation of dry land, wet and atmospheric shines in colors as from William Turner - until a stunning rubber lens rear movement from far away retracts us from a golden cloud hole, from the vision to our feet. All of a sudden the local Carnival from the Rhein appears: Masks, faces, therebetween the filmmaker wandering through the crowd, on a search. Of course, Lutz Mommartz does not intent to find that paradise at the mythological niederrhein place. He suggests in his film, that one must order his Earth- / Eden-garden himself; He digs with his cinematic work well in the Lower Rhine plaice and society; But the topos of the landscape it is only hook for Utopia. Utopia, in the greek meaning a logical placelessness, a perfect nowhere-land, here becomes a quite concrete place with its beauty, its customs, its traditions and its mental crustification. P.W. JANSEN, EPD, JULI 1978 And when Lutz Mommartz presents his stereotyped question: \"Do you know where the Garden of Eden is?\"\" - then that is not joking around with a hidden camera, but the invitation to look inside yourself and also the question comes up: Why did I not ask myself this before? Because that it is here, that it is still here, for a while, of the the camera while it goes through the village Schenkenschanz or pases the marquee of the Schützenverein or repeatedly explores the earth and the sky, the gardens and the vast land, the fog and the Rhine and the silence. Because the moment, become self-conscious through the film, calls for new moments, hunger in the long term, makes hunger for the time. GERTRUD KOCH, FRANKFURTER RUNDSCHAU, 15.MAI 1978 \"The Garden of Eden\", a two and a half hour expedition on the Lower Rhine Area, documents most impressively, to where such an experimental documentary approach may lead. Apart from some low \"Gag dramaturgy\" that tries to uphold the old days of Happenigs, the film draws its strength precisely from the fact that the filmmakers as the real subject of the film is not hidden behind the pseudo-objectivity of observation, but shows that he is the one, who makes the Portait of a landscape and its inhabitants here. A film full of disport from the perspective of jugglers who move around the country and put themself into the scene and get admired by the villagers in a well tempered way. Lutz Mommartz certainly is not one of these to representatives of experimental film that have produce great aesthetic innovations, but this the the retrospective makes very clear - what it shows and what encourages is a fresh point of view, the courage to attempt something unconventional not beeing afraid of failure. Movie as a sketchpad? sometimes like this; sometimes like that.",
      "id": "Mommartz_DER_GARTEN_EDEN_2_1977"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:18.075Z"
}