{
  "imdbId": "archive-la-mano-en-la-trampa-1961",
  "title": "La Mano En La Trampa (1961)",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-mano-en-la-trampa-1961",
      "id": "la-mano-en-la-trampa-1961",
      "title": "La Mano En La Trampa (1961)",
      "description": "La mano en la trampa  es una película de 1961 dirigida por  Leopoldo Torre Nilsson  según su propio guion escrito con la colaboración de  Ricardo Muñoz Suny ,  Ricardo Luna  y  Beatriz Guido  sobre la novela homónima de esta última. Se presentó en Cannes en mayo y se estrenó en Argentina el 8 de junio de 1961. En una encuesta de las  100 mejores películas del cine argentino  llevada a cabo por el  Museo del Cine Pablo Ducrós Hicken  en el año 2000, la película alcanzó el puesto 17. [ 1 ] ​ En una nueva versión de la encuesta organizada en 2022 por las revistas especializadas  La vida útil ,  Taipei  y  La tierra quema , presentada en el  Festival Internacional de Cine de Mar del Plata , la película alcanzó el puesto 47. [ 2 ] ​(Wikipedia) Sinopsis Laura vuelve a su casa a pasar las vacaciones. Ha estado pupila en un colegio de monjas todo el año. La esperan su madre y su tía, bordadoras de profesión que viven confinadas a una enorme y oscura mansión: todo pronostica un verano de aburrimiento y soledad. Pero este año Laura ha crecido y comenzará a preguntarse sobre los secretos que le esconde su familia. Ella sabe que en el segundo piso de la casa vive encerrado un “opa”, que ella no tiene permitido ver. Con la ayuda de su pretendiente Miguel, Laura intentará ver a la criatura con sus propios ojos. Sin embargo, esto no será suficiente para poder armar el rompecabezas, porque deberá además descubrir los misterios en torno a una tía desconocida que vive en Estados Unidos, su expareja, y la correspondencia entre ella y su madre. Esto la llevará a desenterrar viejas pasiones y vergüenzas, para finalmente, enterarse del horror que habita su casa. Reparto Elsa Daniel  - Laura Lavigne Francisco Rabal  - Cristóbal Achával Leonardo Favio  - Miguel María Rosa Gallo  - Inés Lavigne Berta Ortegosa  - Mama de Laura Hilda Suárez  - Lisa Lavigne Enrique Vilches Hugo Caprera Beatriz Matar Mirko Álvarez",
      "fileSize": 2390608748,
      "addedAt": "2026-01-07T00:09:24.702Z",
      "thumbnail": "https://archive.org/services/img/la-mano-en-la-trampa-1961",
      "language": "spa",
      "year": 1961,
      "collection": "feature_films",
      "downloads": 93
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}