{
  "imdbId": "archive-amante-para-dos-1981",
  "title": "Amante Para Dos (1981)",
  "year": 1981,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/amante-para-dos-1981",
      "id": "amante-para-dos-1981",
      "title": "Amante Para Dos (1981)",
      "description": "Amante para dos  es una  película   cómica   argentina , cuyos protagonistas principales son  Alberto Olmedo ,  Moria Casán  y  Tato Bores , estrenada el 13 de agosto de 1981 (Wikipedia) Argumento Mauricio y Alberto son amigos y trabajan en una compañía de seguros. Aparentemente tienen personalidades muy disímiles, ya que Alberto es un picaflor que vive cortejando a cuanta mujer puede y Mauricio es serio y amante de su esposa. En realidad, Mauricio mantiene una relación oculta con una vedette llamada Mónica, quien constantemente lo pone en apuros cuando le pide que se separe de su mujer y se vaya a vivir con ella. Alberto, enterado de esto, le propone a Mauricio que le pase su amante a él, y Mónica pasa a ser su amante estable. Las mujeres de Mauricio y Alberto comienzan a sospechar y todo se complica, y ellos llegan a la conclusión de que mantener a Mónica es muy peligroso para ambos. Reparto Alberto Olmedo  ... Alberto Fornari Moria Casán  ... Mónica Méndez Tato Bores  ... Mauricio Galperín Estela Molly  ... Betina Carlos del Burgo  ... Pocho Pianetti Luisa Albinoni  ... Gladys Cristina Allende  ... Felisa Valeria Pani  ... Silvia Arturo Satany Délfor Medina Jorge Porcel  ... Gordo en restaurante Gloria Ugarte Lía Fernández Jorgelina Aranda Alejandra Aquino  ... María Rosa Marisa Arbos Alejandra Barquín Juan Buryúa Rey Gabriela Fernández Gloria Gueddes Juan Carlos Iglesias Délfor Medina Raúl Monzo Oscar Roy León Sarthié Maritte Serrano Marta Spatola Petty Castillo  ... Petty",
      "fileSize": 1315163730,
      "addedAt": "2026-01-07T00:07:24.999Z",
      "thumbnail": "https://archive.org/services/img/amante-para-dos-1981",
      "language": "spa",
      "year": 1981,
      "collection": "feature_films",
      "downloads": 1322
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.999Z"
}