{
  "imdbId": "archive-TwoFistedLawWithTimMccoyAndJohnWayne1932",
  "title": "Two Fisted Law with Tim McCoy and John Wayne (1932)",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TwoFistedLawWithTimMccoyAndJohnWayne1932",
      "title": "Two Fisted Law with Tim McCoy and John Wayne (1932)",
      "description": "Two-Fisted Law (1932) Tim McCoy ... Tim Clark John Wayne ... Duke Walter Brennen - Sheriffâs Deputy Bendix Story by William Colt MacDonald (Creator of The Three Mesqueteers stories) Made by Columbia Studios Written by pulp writer William Colt MacDonald, this Tim McCoy Columbia Studios Western may have been the forerunner of McDonald's later so popular The Three Mesqueteers. John Wayne, whose character is named, appropriately, Duke, and Wallace MacDonald (no relation to William Colt) play McCoy's loyal ranch hands, and although they remain in the background for part of the action, the germ of the triad hero is there. Tim McCoy plays a rancher losing his property to a crooked money-lender turned cattle rustler (Wheeler Oakman). The villain is in league with a sheriff's deputy (Walter Brennan) and together they rob the Wells Fargo. There is a final shootout and the dying deputy confesses to both the Wells Fargo heist and to the fact that Tim's ranch was illegally obtained. John Wayne, who didn't get along with Tim McCoy and had several rows with studio czar Harry Cohn, swore that he would never again work for Columbia, a promise he kept. ========================================================================== For a Free Download of Western Movies starring: Roy Rogers, Gene Autry, Hopalong Cassidy, John Wayne, Johnny Mack Brown, Bill Steele, Rex Allen, Buster Crabbe, Cisco Kid, The Lone Ranger, Buck Jones, Tim McCoy, Ken Maynard, Tex Ritter, Zane Grey, etc. go to this URL: http://moviesfreedownload.googlepages.com/",
      "id": "TwoFistedLawWithTimMccoyAndJohnWayne1932"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:11.887Z"
}