{
  "imdbId": "archive-Mommartz_MARMOR_BLEIBT_IMMER_KUEHL_1985",
  "title": "1985 Marmor bleibt immer kühl (Marble always remains cool)",
  "year": 1985,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mommartz_MARMOR_BLEIBT_IMMER_KUEHL_1985",
      "title": "Mommartz MARMOR BLEIBT IMMER KUEHL",
      "description": "Gustaf Gründgens (Off), Peter Rübsam (Sculptor, On), Ingrid Lutz and Jürgen Kuhfuß (Sound) The film is a late payoff with a Genius, who took his job more important as the politics that led to total destruction. Actually only Alexander Kluge makes similarly complex, allusive films like Lutz Mommartz, although he always demands a much higher social- and world-entitlement. Mommartz himself remains modest. Here we have only Gustaf Gründgens and the emergence of the monument of Peter Rübsam standing on the edge of Düsseldorf Hofgarten - still the theme is a powerful block in the sense of the word. \"Marble always remains cool\" by Lutz Mommartz tells the story of two artists, the actor (and whatever else he was) and the sculptor who tries to sculpture the actor thoughtfully in marble. Actually it's about three persons, because Lutz Mommartz involves himself with his versatile cinematic methods. So in fact there is a triangular relationship. Because the opinion that Lutz Mommartz has of Gustav Gründgens is not necesarily the same as the opinion that Peter Rübsam has. In a kind of Open Letter Lutz Mommartz accuses Gustav Gründgens to have \"sold out art to power\" and quotes the statement (probably from the Günter Gaus - interview) \"I have not really lived.\" Yet he leaves the man his dignity in the conflict between art and politics. (SEBASTIAN FELDMANN, RP, 11.11.85) Gustav Gründgens appears as a comic character (Animation by Jürgen Kuhfuß), comedian, stage hero, primate of power, sitting at the cabinet table of the Nazis and his head appears before the Nüremberg parade field. In between Hitlers corresponding barking and an Italian male choir, to represent the menacing power of the Carrara Mountains. When Mommartz is not examining the chameleon Gustaf Gründgens, his images present themself in static serenity. A long shot rests on the mine with his toiling workers for than suddenly to immerse into the surface of the marble block. The camera close to the hammer, chisel and saw. (ANDREAS WILINK, DÜSSELDORF, HEFTE 16.12.85)",
      "id": "Mommartz_MARMOR_BLEIBT_IMMER_KUEHL_1985"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:18.079Z"
}