{
  "imdbId": "archive-flatland_a_film_by_ladd_ehlinger_jr",
  "title": "Flatland: A Film by Ladd Ehlinger Jr.",
  "year": 2007,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/flatland_a_film_by_ladd_ehlinger_jr",
      "title": "Flatland: A Film by Ladd Ehlinger Jr.",
      "description": "IMDb Page:  https://www.imdb.com/title/tt0972374/ Synopsis from IMDb: Flatland is a two-dimensional universe occupied by living geometric figures - squares, triangles, circles, etc. A Square, Attorney At Law, finds himself in the middle of two upheavals: the rise of martial law by the circular leadership of Flatland, and the arrival of A Sphere, CEO Of Messiah, Incorporated, a creature from a hitherto-unknown third dimensional world. The contents of this archive came from the Flatland DVD originally sold on Amazon ( https://www.amazon.com/gp/product/B000NJ60FM ) and the now defunct Flatland website (http://www.flatlandthefilm.com/). This archive contains the following: - A one-to-one copy of the DVD in ISO format, ready to be burned to a disc and played in a DVD player - A one-to-one copy of the film and trailer in the MKV container, ready to be downloaded and played in most video players - A copy of the film and trailer with the resolution cropped and doubled (720x480 -> 720x280 -> 1440x560) and encoded to H264 & AAC in the MP4 container, ready to be played directly in browser - Scanned Cover Art, DVD Art, and Thank You Letter EDIT 2021-12-24: It has come to my attention that apparently Archive.org has built-in mechanisms for ripping DVDs from inside an archive, leaving yet another copy of the film and trailer in an even more compressed and non-cropped format. I don't appear to be able to delete these files, but that's fine as the lower bitrate might work better for those with slower Internet connections. Also, for some reason this got mislabeled as being apart of the CD-ROM User Contributions collection despite it literally containing video files and a ISO formatted for DVD video. I can only assume it was the ISO that triggered it to be labeled as such, but you would think that because it also detected valid video data inside the ISO that it would change its assessment. Of course it also could've just trusted me when I initially labeled it as Community Movies. Archive.org should really look into this bug. UPDATE 2022-03-06: Finally took the time to figure out how to change the thumbnail to the front cover of the DVD. Also, thanks to whoever re-added this archive to the correct movie-related collections.",
      "fileSize": 7217354751,
      "id": "flatland_a_film_by_ladd_ehlinger_jr"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.396Z"
}