{
  "imdbId": "archive-new-orleans-uncensored-1955_202405",
  "title": "New Orleans Uncensored ★★★ CC: 1955 Crime/Film-noir [1:15:03] HD",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/new-orleans-uncensored-1955_202405",
      "title": "New Orleans Uncensored ★★★ CC: 1955 Crime/Film-noir [1:15:03] HD",
      "description": "New Orleans Uncensored is a 1955 American Film-Noir Crime film directed by William Castle and starring Arthur Franz and Beverly Garland. Plot... The docks of New Orleans, Louisiana are controlled by Zero Saxon, a notorious racketeer. When Navy veteran Dan Corbett arrives at the New Orleans shipping docks where he's looking for a job. Unknown to him is the fact that shipping docks owner Zero Saxon is a crooked businessman and a racketeer. Using a complex scheme, Saxon is stealing legitimate cargo and switches this cargo for phony cargo. This scheme involves his network of trucks, rail cars and ships. Most longshoremen make extra money by turning a blind eye to the racket and they're also afraid of Saxon's hired killers. Dan Corbett meets nice gal Alma Mae who invites him at the longshoremen picnic where he's introduced to Jack Petty, business agent for the longshoremen's union, and Joe Reilly, Saxon's dock manager. Dan Corbett befriends Joe Reilly, his wife Marie and her brother Scrappy Durant. Joe Reilly is a nice guy and offers Dan Corbett a job on the docks. Unfortunately, Joe is on the take and implicated in Saxon's racket. When he tries to quit the racket and go into a legitimate business, Joe is killed by Saxon's henchmen Deuce and Big Mike. That's when Dan Corbett starts suspecting that Saxon is heading a criminal enterprise. He summons the president of the Longshoremen Association and the Chief of Police to a secret meeting. At the meeting, a plan to expose Saxon's racket and to trap him is agreed upon. However, this plan involves the planting of a radio transmitter into Saxon's cargo crates and Dan Corbett is the only man available for this job. Dan is aware of the danger he's exposing himself to. The movie used real-life police and political figures playing themselves in key roles. Directed by William Castle Written by Orville H. Hampton, Lewis Meltzer Produced by Sam Katzman Cast: Arthur Franz as Dan Corbett Beverly Garland as Marie Reilly Helene Stanton as Alma Mae Michael Ansara as Zero Saxon Stacy Harris as Scrappy Durant Mike Mazurki as Big Mike William Henry as Joe Reilly Michael Granger as Jack Petty Frankie Ray as Deuce Ed Nelson as Charlie (as Edward Stafford Nelson) Al Chittenden as President, General Longshore Workers, Local 1418, ILA Joseph L. Scheuering as Superintendent of Police, City of New Orleans Victor Schiro as Senior Councilman, City of New Orleans Howard L. Dey as Fire Chief, City of New Orleans Pete Herman as himself Ralph Dupas as himself Judge Walter B. Hamlin as Wayne Brandon",
      "id": "new-orleans-uncensored-1955_202405"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:02.897Z"
}