{
  "imdbId": "archive-NeloRisiidillio",
  "title": "Nelo Risi, \"Idillio\"",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NeloRisiidillio",
      "title": "NeloRisiidillio",
      "description": "NOTA SUL LEOPARDI DI RISI Viene qui presentato, e reso disponibile per tutti gli studenti e gli studiosi, il film “Idillio” di Nelo Risi, poeta e regista. Un film realizzato nel 1980, quando ancora la Rai investiva in “programmi sperimentali”, spesso, come in questo caso, vòlti non alla provocazione gratuita, ma ad una seria ed assorta ricerca espressiva. Scene girate a Recanati, fra il Palazzo dei Conti Leopardi e il Monte Tabor, nell'ambiente reale, tangibile, ancora intatto, e fissato dalla celluloide in una sorta di istante eterno, di perenne presente, del “paterno ostello”, del “natio borgo selvaggio”: luoghi, certo, reali, storicamente e ormai anche turisticamente connotati, ma che prima il segno poetico di Leopardi, poi la visione del cineasta-poeta hanno trasmutato, quasi, in non-luoghi, in spazi rarefatti e simbolici, metafisici ed allusivi. Splendida, partecipe e insieme misurata, in bilico fra identificazione e straniamento, immune dal grottesco e dalla deformazione, l'interpretazione di Mattia Sbragia nel ruolo del poeta. Rare, rarissime volte, poi, credo, la musica (qui di Luca Lombardi) ha saputo, come in questo caso, fondersi, profondamente e totalmente, con la parola e l'immagine; e rare volte (forse solo in un altro dimenticato capolavoro custodito dalle Teche Rai, la Vita di Dante di Vittorio Cottafavi) l'immagine filmica è riuscita nell'arduo compito di mostrare il travaglio della creazione poetica. In sinergia con la musica, la parola restituisce qui (per frammenti caleidoscopicamente scomposti, mescolati e poi ricomposti) la simultaneità assoluta della creazione poetica, il nucleo essenziale del testo poetico che, nella sua coesione e nelle sue interne rispondenze, si snoda sì lungo il corso diacronico dei versi, ma nello stesso tempo è, quasi geometricamente, tutto racchiuso in un punto immateriale (qui l'idea dell'Infinito) che coincide, in definitiva, con la mente e il pensiero del poeta. Anche il Risi poeta è tutto attraversato da echi leopardiani, oltre ad avere dedicato esplicitamente a Leopardi alcuni versi, come questi: «La vita ... / è la corrente che come passa si riduce / fino a estinguersi, nel nulla ‒ e qui ti seguo / signor conte». Ecco, forse la chiave, la nota essenziale e dominante del Risi poeta e cineasta (endiadi per “poeta del cinema”, si potrebbe dire) è proprio questa: da un lato la fantasmagoria della vita, di una vita tenacemente amata, còlta (anche attraverso la temporalità, l'onda continua eppure franta, della versificazione) nel suo fluire, nel suo cangiare, nel suo divenire incessante; dall'altro, la consapevolezza del nulla sotteso, leopardianamente, all'esistente, e in cui l'esistente tende, ed è anzi destinato, a confluire. L'immagine filmica, spettro lieve, danza su quel nulla; la sua luce effimera, per quanto vitale, transitoria ed eterna, illusoria eppure essenziale, nasce dal buio, e al buio torna. Dal buio ultimo delle teche e degli archivi è stata ora tratta e liberata. «Non persuasa / la memoria dal tempo, piega a piega / svolge con crudeltà l'alfa e l'oméga». La memoria storica, e di conseguenza la parola letteraria, si collocano, come nel Leopardi del Cantico del Gallo Silvestre, entro un orizzonte apocalittico, nel quale si congiungono, egualmente necessari, figli del medesimo ordine, principio e fine. «In definitiva è solo l'opera / che conta». Come in Mallarmé, tutto esiste per far capo a un libro ‒ o a una pellicola, che in fondo si snoda e si svolve come un volumen, è, in certo modo, un libro figurato, parlante colorato e mobile. Lo spirito s'infiamma, al pari dell'immagine che si accende dal buio, dal buio dello schermo o della sala, e fa nascere un mondo. La sua «forza primigenia» si alza in volo per «compiere il disegno ... / latente nella parola e nel suono e nel gesto / e nel segno». La lingua verbale, come il segno filmico (si ricordino le riflessioni di Pasolini sulle rispondenze, le affinità e le differenze dei due linguaggi e delle loro «articolazioni»), nasce da una profondità interiore, e anteriore, prende via via forma come ascendendo da un fondo oscuro. «Ha un suo disegno / l'opera». Un disegno che trascende l'esistenza individuale ‒ allo stesso modo che Leopardi seppe tradurre in pensiero e poesia, in pensiero poetante e poesia pensante, l'abisso del suo dolore. La natura «assume l'antichissima quiete / col sole che dispensa luce e calore» (la leopardiana «profondissima quiete», che può rivelarsi nella piena luce del giorno non meno che nell'immaginazione del pensiero proteso oltre la siepe); e l'artista traduce «dal nulla quel nulla / in luce e colore». Proprio come fa il cinema, che riesce, qui (come ad esempio nel Banchetto di Platone di Marco Ferreri), a dare consistenza sensoriale al pensiero; e, dunque, ad infondere colore e luce, forma e moto, a tutto un vasto complesso e sofferto vissuto interiore, e alla potenza dolente del genio. Matteo Veronesi N. B. Questa pubblicazione, secondo la normativa vigente, non infrange il diritto d'autore poiché riguarda opera non reperibile sul mercato, non inclusa nei cataloghi, non ha scopo di lucro, ha finalità  esclusivamente culturali e didattiche ed è in formato degradato rispetto all'originale.",
      "id": "NeloRisiidillio"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:18.143Z"
}