{
  "imdbId": "archive-TheAdventureOfMarriedCoupleZanVaShohareKaregarOnV",
  "title": "The Adventure Of Married Couple, Zan Va Shohare Karegar",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheAdventureOfMarriedCoupleZanVaShohareKaregarOnV",
      "title": "The Adventure Of Married Couple, Zan Va Shohare Karegar",
      "description": "Participated in more than 40 Film Festival : 61th San Sebastian Film Festival, Spain, 23 Sep 2013 27th Friburgh Film Festival, Switzerland،15 March 2013 25th Media Wave Film Festival, Hungary, 25 April 2013 &...... AWARD : 2014 “The Adventure of Married couple” the special mention of the Jury prize at” 18th La Fila de Cortometrajes Film Festival, Spain, 9 May 2014 “The Adventure of Married couple” the Best short fiction Film at” 6th Iberoamericano De Cine Azul SURrealidades Film Festival, Colombia, 13 September &....... SUMMERY: (Based on a story written by Italo Calvino) Couples who are living together both work to make their ends meet. The man works night shifts from 8 p.m. to 6 a.m. and the woman works during the day from 8 a.m. to 6 p.m. they have to work all week even on weekends and whenever one of them comes home the other should get ready to leave home. DIRECTOR NOTE: Trapped in daily repetition, between the frenetic sound of a glass bottle factory and the guarding of a shed filled with naked mannequins, a young couple meets at evenings. They eat without looking at each other, not even speaking. The Adventure of the Married Couple is a poetic variation on the daily routine in black and white. Director and Script: Keywan Karimi Casting: Anahita Iravani Mohammad Akhari Camera: Keywan Karimi Behzad Soltan Mohammadi Editing: Siawash Afshar Sound and Music: Bamdad Afshar Project Manager: Fateme Hafezi Producer: Keywan Karim",
      "id": "TheAdventureOfMarriedCoupleZanVaShohareKaregarOnV"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:58.272Z"
}