{
  "movieId": "archive-LieutenantKizhe1934Restored",
  "title": "Lieutenant Kizhe restored",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LieutenantKizhe1934Restored",
      "id": "LieutenantKizhe1934Restored",
      "title": "Lieutenant Kizhe restored",
      "description": "Poruchik Kizhe - Пору́чик Киже́   ( Lieutenant Kijé ) (1934) Aka: The Czar Wants to Sleep With subtitles Revised 2018 – frames edited, better flicker removal To get subtitles, click on the second version, and then on the CC icon. This is a delightful comedy about a fictional Lt. Kizhe who came about because of a scribe’s copying mistake.  The officials were afraid to embarrass the Czar, so they created a fictional Kizhe who served as a convenient scapegoat.  After being whipped, exiled, returned, married, and promoted Kizhe finally had to die when the Czar wanted to meet him. This is the first movie with a Prokofiev film score, so it is an important historical document and should be considered a classic.  But it is also a very enjoyable comedy.  The music from the film was subsequently recycled by Prokofiev into the popular Lieutenant Kijé suite.  The story originated with a family story recounted in Vladimir Dahl's \"Rasskazy o vremenakh Pavla I\" (\"Stories of the time of Paul I\") in the journal Russkaya starina in 1870.  Iit was expanded by Yury Tynyanov into a novella and movie with added fictional events.  The score was provided by Prokofiev, while abroad, as segments that could be inserted and repeated as needed.  Later it was recycled by Prokofiev into the popular Lt. Kijé suite.  Kijé is the French transliteration, but Kizhe is correct for English. The story parodied Paul I, the son of Catherine the Great.  But there is a possible suspicion that the movie may have also been intended as a criticism of the current Soviet government, disguised as a historical story.  Paul was actually revered by many of his people and was idealistic and generous but also mercurial and sometimes vindictive.  The depiction in the movie of his paranoia is probably accurate.  His fear may not have been misplaced because shortly after he occupied his new “secure” palace he was assassinated.  It is unknown whether a mythical Kizhe was actually invented to prevent Czarist embarrassment.  So the movie is an amusing caricature of Paul which is not quite accurate. Watching this film, one gets a new view of the music in the Lieutenant Kijé suite.  The biggest surprise was the Troika.  In the usual concert notes it is depicted as a pleasant winter ride of  Kijé and his bride in a three horse sleigh.  In the movie it is a drunken manic ride of Count von Pahlen who is “escorting” Kijé back from Siberia, before the wedding.  The ride happens on a summer night in a three horse cart and the Count’s constant companion is a humongous jug of vodka.  The count kisses the Siberian commandant who accompanies him partway.  It was common in traditional Russia for men to kiss on the lips as a sign of friendship and it has no sexual connotation.   It is too bad that the concert Troika is not usually performed with the rollicking song used in the movie.  Most of the movie music is in the suite with the exception of the dissonant whipping music.  Notice when the scribe makes the mistake, Kiji’s birth is heralded by quiet music. Be warned that there is no sound during the credits, and the sound begins with a very faint trumpet call.  One of the credits is obviously missing, but the complete known credits are listed at the end of the film.  There are closed captioned English subtitles, enhanced for the deaf, on this video. This copy of this public domain movie was restored from sources on the web.  All of the sources on the web apparently came from the same original digitized source, but were probably recorded from different Russian TV broadcasts with different quality.  One source has slightly clearer picture, but missing pieces, more cropping, and badly compressed audio.  Another source was more complete and had uncompressed audio, but the video was poorly processed and overbrightened which washed out detail in some frames.  Unfortunately a high quality digital version is not available as this movie merits a Criterion edition.  All sources were apparently recorded using old technology and the film jittered a lot with changes in focus, brightness, and framing.  The automatic brightness circuit oscillated and caused fast flicker. The film sometimes moved during frame capture.  In addition the primitive automatic corrections produced unstable brightness at scene changes, smeared detail, and overexposed frames.  The poor handling of the film included finger prints, scratches, dirt, and one frame with a large squashed bug (removed).  The original inexact editing left a few orphan frames from previous scenes during a transition (retained).  The troika scenes sometimes use the same sequence more than once.  I spotted a bug in one corner of 2 separate identical distant frames during the troika.  See if you can find it.  This copy of the video is partially stabilized in both position and luminance and sharpened to produce a more watchable version.  Some very bad frames were fixed by duplicating a nearby frame, and some manual adjustments were made to intensity and positioning.  Video noise was partially removed by Virtualdub Spotremover and stabilization by Deshaker,.  Good motion stabilization requires a view of the film frame edges, and all sources have significant cropping.  At least 16% of the picture is missing on the top,  8% on the bottom and probably the same on the sides, so a large amount of the picture has been cropped. As a result there are frequent bloodless decapitations and scalpings.  Many spots were removed by hand from individual frames.  The final pass used filters to reduce the constant flickering.  The orignal copy did not exhibit extreme brightness compression, so the relative brightness of scenes is reasonable, but not absolutely like the original. A large effort went into fixing the audio portion.  A number of ticks and pops had to be removed by hand, and the overall noise was reduced.  Most of the sound effects were left intact, and the music is much clearer.  Some web versions of this film have very high noise which pumps up and down due to the severe compression that was standard when televising old movies.  The version chosen for restoration did not exhibit audio compression, but a short segment had to be spliced into the sound track from the compressed version.  Unfortunately there is little that can be done to reduce the distortion and flutter in the primitive 1930s Soviet era sound track.  Rerecording the music might be nice. The revised version has extra audio noise reduction with some increase in volume for the faint music and sounds.  It also has extensive frame editing with stronger deflickering, while the first version had only a few very bad frames edited.  In addition several poorly stabilized sequences were fixed.  Flickering has been reduced, but not eliminated.  Most obtrusive spots were removed, but only parts of the film were fully frame edited. The result is more watchable, and much more listenable. Hopefully the overall effect is now much closer to what the director intended.  A copy of the original before restoration is in an included zip file.  Until the time when a good copy is made available, this may have to suffice. J. Clement 2018",
      "fileSize": 2313116127,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LieutenantKizhe1934Restored",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 15661
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.750Z"
}