{
  "imdbId": "archive-LarsVonTrierInterviewThroughTheBlackForest",
  "title": "Lars Von Trier Interview Through The Black Forest",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LarsVonTrierInterviewThroughTheBlackForest",
      "title": "Lars Von Trier Interview Through The Black Forest",
      "description": "A rare new interview with Europe’s groundbreaking film creator, Danish film director Lars von Trier, who is the recipient of the prestigious Sonning Prize 2018. Here he looks back at his work, talks about his forthcoming movie, and reveals his idea for a new series of small films. Finally he makes a comment on his controversial statement about Hitler in 2011. When Lars von Trier makes his movies, he feels like an explorer, who has been dropped off on a deserted island, and who is told, that he must go east: “It doesn't’ make sense to change route because something looks more exciting. I have decided not to do that.” He wants to stick to his own path, his philosophy being that he makes movies that are otherwise never made: “They are missing, like when you have a constellation, and there is a star missing.” Making his most recent movie ‘The House That Jack Built’ (2018) was a hard-ship, and Trier found himself anxious and alcoholised, and thus decided that his next projects would be black and white ten-minute films called ‘etudes’, where he can test something, e.g. dramaturgy. By this, he is also attempting to reach complete sobriety, which is difficult “because alcohol is self-medicating, and, sadly, it’s insanely effective. The problem is that when the alcohol level drops, the anxiety hits you even harder.” “I still feel the best about ‘Dogville’ because I think it’s just damn well written. Tarantino said that if I’d made it for the theatre, I would have won a Pulitzer.” Through the years, Trier has come to realise that it is the director – or the writer – who decides and who guides: “I believe that all good art is created under dicta-torial conditions. So people must enjoy being led. I’ve said earlier that it’s a black forest that people must go through, and they are scared to. But if they have a friend who says ‘I know the forest’, they will happily fol-low. And then they enjoy this black forest. And that’s my principle.” “Of course I’m not a Nazi! ... I’d like to say absolutely unequivocally that I don’t approve of any of Hitler’s actions!” On the subject of ‘teasing’, Trier feels that he doesn't tease that much anymore due to “the whole Hitler affair.” He feels that the press conference, where he made his controversial remark about his admira-tion for Hitler, “was destroyed by the moderator because he didn’t let me clean up after myself.” When he said: “Well, okay then, I’m a Nazi” it had no more significance than when you are in a discussion with someone, who won’t give up and ultimately say: “I’ll let you be right if you leave me in peace.” Expanding on this, Trier continues by saying that it is, however, important that Hitler is humanized, because that means we can’t simply throw the case aside. Lars von Trier (b.1956) is a Danish film director and screenwriter, whose prolific career spans almost four decades. His pivotal work is known for its technical innovation and examination of existential, social and political issues in movies such as ‘The Element of Crime’ (1984), ‘Europa’ (1991), ‘Breaking the Waves’ (1996), ‘The Idiots’ (1998), ‘Dancer in the Dark’ (2000), ‘Dogville’ (2003), ‘Antichrist’ (2009), ‘Melancholia’ (2011), Nymphomaniac (2013) and ‘The House That Jack Built’ (2018). He is also the creator of the TV series ‘The Kingdom’ (1994-1997) and one of the creators of the innovative Dogma 95 style manifesto (along with e.g. Thomas Vinterberg), which has since marked Danish and European film alike. Among his numerous awards at film festivals worldwide, Trier has received the Palme d’Or, the Grand Prix, Prix du Jury and The Technical Grand Prize at the Cannes Film Festival, as well as The University of Copenhagen’s DKK 1 million Sonning Prize 2018. In 2018 Brandt Museum in Odense, Denmark presents a major exhibition providing a retrospective overview of the work of Trier: ‘Lars von Trier – The good with the evil’. Trier is also the founder and shareholder of the international film production company Zentropa Films. Lars von Trier was interviewed by Associate professor emeritus Peter Schepelern at the University of Copenhagen in April 2018 in connection with his reception of the Sonning Prize 2018 awarded by The University of Copenhagen – the biggest cultural award in Denmark given to an individual who has done commendable work for the benefit of European culture. Produced by: University of Copenhagen (Københavns Universitet), 2018. Supported by Nordea-fonden FOLLOW US HERE! Website: http://channel.louisiana.dk Facebook: https://www.facebook.com/LouisianaCha... Instagram: http://www.instagram.com/louisianacha... Twitter: http://www.twitter.com/LouisianaChann Category",
      "id": "LarsVonTrierInterviewThroughTheBlackForest"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [
    "interview"
  ],
  "qualityNotes": "Auto-detected issues: interview",
  "lastUpdated": "2026-01-07T00:06:30.622Z"
}