{
  "imdbId": "archive-cell-2455-death-row-1955",
  "title": "Cell 2455 Death Row 1955 ★★★ CC: Crime/Film-Noir [1:17:05]",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cell-2455-death-row-1955",
      "title": "Cell 2455 Death Row",
      "description": "While the Lindbergh law is no longer a issue. The death penalty is. For, or against it. Is it a deterrent? Is it not? Cruel and unjust punishment or just punishment. I don't agree with it being used in this particular case. Rape is a horrible crime. Kidnapping and robbery are traumatic but not crimes where someone should have their life taken. I posted this movie hoping to start a discussion about the death penalty. Do we need it? Do we abolish it? Is there a better way? Cell 2455, Death Row is a 1955 American crime film noir directed by Fred F. Sears and starring William Campbell and Robert Wright Campbell. It is based on the 1954 book of the same name. Caryl Whittier Chessman (May 27, 1921 – May 2, 1960) was a convicted robber, kidnapper and serial rapist who was sentenced to death for a series of crimes committed in January 1948 in the Los Angeles area. Chessman was charged with 17 counts and convicted under a loosely interpreted \"Little Lindbergh law\" later repealed, but not retroactively that defined kidnapping as a capital offense under certain circumstances. His case attracted worldwide attention, and helped propel the movement to end the use of capital punishment in the state of California. While in prison, Chessman was considered vexatious, with one judge writing in 1957, \"[Chessman is] playing a game with the courts, stalling for time while the facts of the case grow cold.\" Chessman wrote four books, including his 1954 memoir Cell 2455, Death Row. The book was adapted for the screen in 1955 and stars William Campbell as a character modelled after Chessman. Chessman was born Carol Whittier Chessman (CAROL was, at the time, a popular name for boys of Danish descent; Chessman himself later changed the spelling to CARYL) in St. Joseph, Michigan, the only child of Serl Whittier and Hallie Lillian (née Cottle) Chessman. Crimes and conviction: In the first three weeks of January 1948, a number of robberies and thefts were reported throughout the Greater Los Angeles Area. On January 3, two men robbed a haberdashery in Pasadena with a .45 caliber semi-automatic pistol. On January 13, a 1946 Ford coupe was stolen from a Pasadena street. On January 18, a man driving a car described as a 1947 Ford coupe fitted with a police red light stopped a vehicle near Malibu Beach, then used a .45 caliber pistol to rob the vehicle's occupants. Later that day a second couple were robbed in the same manner near the Rose Bowl. Police quickly began to suspect a common perpetrator, and Los Angeles newspapers dubbed the suspect \"The Red Light Bandit.\" On January 19, a third couple were robbed as they sat parked on a hill in West Pasadena, and the woman, Regina Johnson, was forced to perform oral sex on her assailant. On January 22, a fourth couple returning home from a church dance was pulled over on Mulholland Drive. The assailant dragged the girl, 17-year-old Mary Alice Meza, a short distance to his vehicle. Her boyfriend then drove away and was pursued by the assailant. After an unsuccessful attempt to force the male victim off the road, the perpetrator drove Meza to a secluded area where he forced her to engage in oral and anal sex, threatening to kill her boyfriend if she did not comply. The following day, police in North Hollywood attempted to stop a 1946 Ford coupe matching the description given by Meza and her boyfriend, and also by witnesses to a robbery at a clothing store in Redondo Beach earlier that day. After a high-speed chase, the vehicle's occupants, Chessman and David Knowles, were captured and arrested. After a 72-hour interrogation, during which Chessman later claimed he was beaten and tortured, Chessman confessed to the \"Red Light Bandit\" crimes. He was also positively identified by the rape victims, Johnson and Meza. In late January 1948, Chessman was indicted on 18 counts of robbery, kidnapping, and rape. After a three-week trial in May, he was convicted on 17 of the 18 counts, and was sentenced to death. Appeals and controversy Part of the controversy surrounding the Chessman case stemmed from the state's unusual application of the death penalty. At the time, under California's version of the \"Little Lindbergh Law,\" a crime that involved kidnapping with bodily harm could be considered a capital offense. Two of the counts against Chessman alleged that he dragged Johnson 22 feet from her car before demanding oral sex, and that he abducted Meza against her will, driving her a considerable distance before raping her. The court ruled that both actions fit the law's definition of kidnapping with bodily harm, thus making Chessman subject to the death penalty under the law. The law was repealed by the time his trial began but was in effect at the time of the crimes; the repeal was not applied retroactively. Chessman asserted his innocence from the outset, arguing throughout the trial and the appeals process that he was alternately the victim of mistaken identity, or of a conspiracy to frame him; he also claimed to know the identity of the real perpetrator, but refused to reveal it. He further alleged that the confession he signed during his initial police interrogation was coerced through force and intimidation. Over the course of nearly twelve years on death row Chessman filed dozens of appeals, acting as his own attorney, and successfully avoided eight execution deadlines, often by a few hours. Most appeals were based on assertions that he was forced to go to trial unprepared; that the trial itself was unfair; that confessions obtained by force and intimidation and promises of partial immunity were used in evidence against him; that California's \"Little Lindbergh Law\" was unconstitutional; and that the transcript of record forwarded upon appeal to the state supreme court was incomplete, and important parts of the proceedings were missing or incorrectly recorded. In 1957 the U.S. Supreme Court ordered the State of California to conduct a full review of the transcripts. The review concluded that the transcripts were substantially accurate. Chessman's books and public campaign ignited a worldwide movement to spare his life, while focusing attention on the larger question of the death penalty in the United States, at a time when most Western countries had abandoned it, or were in the process of doing so. The office of California Governor Pat Brown was flooded with appeals for clemency from noted authors and intellectuals from around the world, including Aldous Huxley, Ray Bradbury, Norman Mailer, Dwight Macdonald, and Robert Frost, and from such other public figures as former First Lady Eleanor Roosevelt, Marlon Brando, and Billy Graham. The Chessman affair put Brown, an opponent of the death penalty, in a difficult position. He was unable to grant Chessman executive clemency as the California Constitution required the commutation of a two-time felon's death sentence to be ratified by the California Supreme Court, which declined ratification by a vote of 4–3. After a long period of inaction Brown finally issued a 60-day stay a few hours before the February 19, 1960, scheduled execution. He issued the stay, he said, out of concern that the execution could threaten the safety of President Dwight D. Eisenhower during an official visit to South America, where the Chessman case had inflamed anti-American sentiment. Pat Brown's son and future Governor Edmund G. \"Jerry\" Brown unsuccessfully lobbied his father to spare Chessman. Execution Brown's stay of execution, along with Chessman's last appeals, ran out in April 1960, and Chessman finally went to the gas chamber at San Quentin Prison on May 2, twenty-five days before his 39th birthday. According to some sources, a last-minute attempt by a California Supreme Court justice to impose a new stay pending a habeas corpus motion failed when a court secretary misdialed the prison's phone number; by the time the call was routed to the execution chamber, the execution had begun and could not be halted. During the execution Chessman vigorously nodded his head, a pre‑arranged signal to reporters that he was experiencing pain. Chessman's body was cremated, as per his wishes, at the Mount Tamalpais Mortuary and Cemetery in San Rafael, California. He requested that his ashes be interred with his parents' at Forest Lawn Memorial Park in Glendale, but Forest Lawn refused the request on \"moral grounds.\" His ashes were buried at the Mount Tamalpais Cemetery, then disinterred in 1974 by Chessman's attorney Rosalie Asher and scattered off the coast of Santa Cruz Island. Information obtained from https://en.wikipedia.org/wiki/Caryl_Chessman",
      "id": "cell-2455-death-row-1955"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:23.536Z"
}