{
  "imdbId": "archive-de-oldify-the-atomic-bomb-attacks-on-hiroshima-nagasaki-in-1945-in-color-hersteld-van-yt",
  "title": "The Atomic Bomb Attacks On Hiroshima & Nagasaki In 1945 In Color!",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-the-atomic-bomb-attacks-on-hiroshima-nagasaki-in-1945-in-color-hersteld-van-yt",
      "title": "The Atomic Bomb Attacks On Hiroshima & Nagasaki In 1945 In Color!",
      "description": "Spectacular colorized footage of both atomic bomb attacks by the USA on the Japanese cities Hiroshima and Nagasaki on respectively 6 and 9 August 1945. About 250,000 persons lost their lives during these attacks and hundreds of thousands suffered from ill health due to the intense radiation, especially cancer and leukemia. Some people close to the epicentre simply evaporized. A military base was completely annihilated. The blasts and extreme intensity of the light flash and high levels of radiation caused permanent shadows that were burnt into structures and pavements. The bombs were dropped by the US airforce on the Enola Gay bomber. The bomb on Hiroshima was nick named \"Little Boy\" and on Hiroshima \"Fat Man\" both assembled as part of the Trinity project. The second bomb was not originally intended for Nagasaki but due to weather conditions became the alternative target. The film starts with colorized footage of president Truman who announces the first bomb attack. It also shows the Enola Gay bomber, the atomic blasts and the huge devastation after the attacks. Watching him present this announcement makes one wonder whether he consciousnessly realized the severety and crualty of the US's actions under his command against primarily civilian innocent Japanese targets. A number of times he smiles and clearly shows that the film was recorded many times to the point of his exhaution and almost boredom. The original video footage has been motion-stabilized, contrast & brightness enhanced, de-noised, upscaled to full-HD and artificially colorized using state-of-the-art video software.",
      "fileSize": 1203089494,
      "id": "de-oldify-the-atomic-bomb-attacks-on-hiroshima-nagasaki-in-1945-in-color-hersteld-van-yt"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.605Z"
}