{
  "imdbId": "archive-ZydereenOfNeptune",
  "title": "Zydereen Of Neptune",
  "year": 2015,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ZydereenOfNeptune",
      "title": "ZydereenOfNeptune",
      "description": "Following the example of  Davidgc  here on the archive, I have taken three episodes of the Flash Gordon TV show of the 1950s, and edited them into a feature-length movie which I've called \"Zydereen of Neptune.\" Unlike the episodes which  Davidgc  used for his compilation, these three actually form a single contiguous story. Unfortunately, the video quality of the epsiodes runs from poor to mediocre, with the first probably being the worst quality. This show seems to only exist in the most beat-up, splicey, dupey prints. The episodes I used were: 1. The Witch of Neptune 2. The Brain Machine 3. Struggle to the End Flash Gordon   (1954–55 live-action) Steve Holland  starred in a 1954–55 live-action  television series  which ran for 39 episodes. The first 26 episodes had the distinction of being filmed in  West Berlin ,  Germany  less than a decade after the end of  World War II . This is notable, given that some episodes show the real-life destruction still evident in Germany several years after the war. The final 13 episodes were filmed in  Marseille ,  France . In this series, Flash, Dale ( Irene Champlin ) and Dr. Zarkov (Joseph Nash) worked for the Galactic Bureau of Investigation in the year 3203. The actual timeline was established in one episode, \"Deadline at Noon\", in which Flash, Dale and Dr. Zarkov went back in time to Berlin in the year 1953. The GBI agents traveled in the Skyflash and Skyflash II spaceships. The series was syndicated, appearing on stations affiliated with the long-defunct  DuMont Network , and many other independent stations in the United States.",
      "id": "ZydereenOfNeptune"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:56.739Z"
}