{
  "imdbId": "archive-lavare-1980",
  "title": "L'avare ( 1980)",
  "year": 1980,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lavare-1980",
      "title": "L'avare ( 1980)",
      "description": "L'Avare (1980) Film français Réalisation : Jean Girault et Louis de Funès Scénario : Jean Girault, Louis de Funès et Jean Halain, d'après L'Avare de Molière Genre : comédie, théâtre Date de sortie : 5 mars 1980 Profondément avare, Harpagon enterre dans son jardin une cassette, qu'il protège d'un piège à loups caché par des feuilles. Riche mais dépensant le moins possible, il vit à Paris avec ses deux enfants Élise et Cléante dans une grande maison avec des domestiques, tous subissant l'avarice du vieillard. Un jour, Élise s'entretient longuement avec Valère, l'intendant de la maison. Valère, fou d'amoureux d'Élise, s'est fait engager comme intendant dans la maison de son père pour l'épouser. Pour gagner la confiance d'Harpagon, il approuve continuellement toutes ses idées, envies ou actions ; Élise est convaincue que son père s'opposera à cette union car, le connaissant bien, et Valère étant désargenté, elle imagine qu'il tentera à coup sûr, aveuglé par son avarice, de la marier à un homme riche. Ensuite, Cléante vient à son tour parler à Élise : il est fou amoureux de la belle Marianne, la fille d'une veuve du voisinage. Pour subsister et vivre son amour avec Marianne, Cléante se voit obligé de s'endetter de toutes parts, pour contrer la pingrerie de son père ; de plus, il redoute qu'il ne contrarie ses projets de mariage. Cléante et Élise sont excédés par cette situation. Pendant ce temps, Harpagon est à la messe, où il prie tranquillement. Sa prière est rapidement troublée par une femme vêtue de noir qui secoue sa sébile pour faire la quête. Discrètement, il s'éloigne vers une autre place dans l'église. Sa sérénité est courte puisque la quêteuse repasse près de lui. Après avoir mimé une profonde prière, s'avachissant sur son prie-Dieu, il finit par s'enfuir de l'église, poursuivi par la quêteuse. À travers les rues de Paris, la quêteuse pourchasse l'avare en secouant sa sébile, jusqu'à ce qu'il la sème et retourne chez lui, apeuré. Aussitôt, il va dans son jardin pour vérifier que sa chère cassette n'a pas disparue, puis monte dans les étages, où il découvre La Flèche, le valet de son fils Cléante. Il le chasse de sa maison, le soupçonnant de vouloir le voler. Désormais seul, il révèle au spectateur que sa cassette contient dix mille écus d'or qu'il veut absolument protéger des voleurs, mais son aparté est interrompu par l'arrivée de ses enfants Cléante et Élise, qui n'ont heureusement pas entendu son monologue. Ceux-ci se plaignent de l'avarice de leur père, qui à son tour critique toutes les dépenses de ses enfants qu'il juge somptueuses, avant d'avouer au spectateur qu'ils les soupçonne aussi de vouloir le voler. Harpagon annonce son projet de mariage avec la jeune Marianne, à un Cléante complètement désemparé ; de plus, il compte le marier à une veuve et destine Élise à Anselme, un riche vieillard de ses amis. Ce retournement final amène à une fin heureuse : Valère va s'unir à Élise et Cléante à Marianne. Harpagon accepte ces deux unions à condition qu'Anselme paye tous les frais, et même un bel habit de cérémonie pour lui. Le double mariage est célébré avec fastes dans la demeure d'Harpagon. La Flèche le conduit à l'endroit où était cachée sa cassette. Enfin heureux, Harpagon retrouve sa cassette et contemple les écus d'or qu'elle contient. Un portrait de Molière l'interpelle « Harpagon ?! », puis lui souhaite « Bonne chance, cher Harpagon ». L'avare s'en va avec sa lourde cassette dans les bras. On le voit ensuite traînant sa cassette au bout d'une chaîne, dans le sable d'un désert. C'est là que surgit la quêteuse habillée en noir, qui poursuit Harpagon en secouant sa sébile… Casting : Louis de Funès : Harpagon Frank David : Cléante, fils d'Harpagon, amoureux de Marianne Hervé Bellon : Valère, intendant d'Harpagon, amoureux d'Élise Michel Galabru : Maître Jacques, cuisinier et cocher d'Harpagon Claire Dupray : Élise, fille d'Harpagon Claude Gensac : Frosine, entremetteuse Anne Caudry : Marianne, jeune fille aimée de Cléante Bernard Ménez : La Flèche, valet de Cléante Georges Audoubert : Anselme, de son vrai nom Don Thomas d'Alburcy Henri Génès : le commissaire Guy Grosso : Brindavoine, serviteur d'Harpagon Michel Modo : La Merluche, serviteur d'Harpagon Max Montavon : Maître Simon, le courtier Micheline Bourday : Dame Claude, servante / la quêteuse Madeleine Barbulée : la mère de Marianne Pierre Aussedat : le clerc Gaëlle Legrand : la première servante Claire Favretto : la deuxième servante",
      "fileSize": 2746521229,
      "id": "lavare-1980"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}