{
  "imdbId": "archive-johnny-o-clock-1947_202406",
  "title": "Johnny O'Clock 1947 ★★★½ Crime/Film-Noir [1:35:44] HD",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/johnny-o-clock-1947_202406",
      "title": "Johnny O'Clock 1947 ★★★½ Crime/Film-Noir [1:35:44] HD",
      "description": "Johnny O'Clock is a 1947 American film-noir crime film directed by Robert Rossen and starring Dick Powell, Evelyn Keyes, Lee J. Cobb and Ellen Drew.It was distributed by Columbia Pictures. New York gambling house operator Johnny O'Clock is junior partner in a posh casino with Guido Marchettis and Chuck Blayden, a crooked cop. But Blayden is trying to cut into the casino's profits and warns Johnny not to interfere with his intention of becoming Marchettis' full partner. Blayden ends his relationship with coat check girl Harriet Hobson, then disappears. Later, Harriet is found dead in her apartment, apparently from suicide. Police Inspector Koch begins an investigation. He questions Johnny, Harriet's sister Nancy, who is infatuated with Johnny, and Johnny's associate, Charlie. When Blayden's body turns up in a nearby river, and when it is learned that Harriet death wasn't suicide but murder by poison, Johnny and Marchettis become prime suspects in both cases.To make matters worse, Pete Marchettis discovers that his wife Nelle may be having an affair with Johnny. Out of jealousy, he sends hired gunmen to kill Johnny in a drive-by shooting while Johnny is driving Nancy to the airport. Johnny, now certain that Marchettis has betrayed him, goes to the casino to end their business partnership. Cast: Dick Powell as Johnny O'Clock Evelyn Keyes as Nancy Hobson Lee J. Cobb as Inspector Koch Ellen Drew as Nelle Marchettis Nina Foch as Harriet Hobson Thomas Gomez as Guido Marchettis (as S. Thomas Gomez) John Kellogg as Charlie Jim Bannon as Chuck Blayden Mabel Paige as slatternly woman tenant Phil Brown as Phil, hotel clerk Jeff Chandler as Turk (uncredited) Robin Raymond as hatcheck girl (uncredited) Trivia: When Lee J. Cobb (Inspector Koch) was called before the Un American House Activities Committee in 1953 and given a chance to \"clear his name\" by naming communists he had known. Cobb named Shimen Ruskin who plays the dry cleaner in this film. Many of his fellow actors never forgave Cobb for this. Soundtracks Little White Lies (uncredited) Written by Walter Donaldson [Played by pianist in casino]",
      "id": "johnny-o-clock-1947_202406"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:15.997Z"
}