{
  "imdbId": "archive-LhommeOrchestre",
  "title": "L'Homme Orchestre",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LhommeOrchestre",
      "title": "LhommeOrchestre",
      "description": "L'Homme Orchestre, 1900, 1m21s Star Film Catalogue Nos. 262-263 In many ways a sequel to The Four Troublesome Heads (Un Homme de têtes, 1898), The One-Man Band ups the ante to a considerable degree by featuring no fewer than seven identically-dressed Georges Méliès playing musical instruments and interacting with one another in remarkably convincing synchronisation. Buster Keaton pulled off a similar trick in The Playhouse (1921) with greater technical polish, but Méliès beat him to the screen by over twenty years. Synopsis: A man lays out seven chairs in a row and counts and recounts them to make sure. He sits down in the one on the far right, and splits in two, his double moving to the seat next to him. This process is repeated until there are seven men, identical except for their differing musical instruments, occupying all the chairs. They chat amongst each other until the man in the middle stands up to conduct. The six instrumentalists perform, then sit back and relax. The conductor stands up again and indicates that they should come closer. They do so, blending into each other until only the conductor is left. He makes the chairs disappear and reappear en bloc, then individually. As he is bowing to the audience, a gigantic fan rises behind him, startling him when he turns round. He sits on the only remaining chair and sinks through the floor of the stage. He then reappears on the other side of the fan, jumping over it before disappearing in a puff of smoke. The fan descends to reveal him behind it. He bows to the audience. Director: Georges Méliès Stars: Georges Méliès Country: France Also Known As: The One Man Band Production Co: Star-Film Referenced in The Play House (1921)",
      "id": "LhommeOrchestre"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:12.889Z"
}