{
  "movieId": "archive-petete-y-trapito-1975",
  "title": "Petete Y Trapito (1975)",
  "year": 1975,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/petete-y-trapito-1975",
      "id": "petete-y-trapito-1975",
      "title": "Petete Y Trapito (1975)",
      "description": "Trapito [ 1 ] ​ es un  largometraje de animación   argentino  escrito y dirigido por el  dibujante   Manuel García Ferré . Fue estrenado por primera vez en cines el 17 de julio de 1975. (Wikipedia) Historia Trapito  es un espantapájaros con vida propia. Tiene un corazón de oro, así como también una singular tristeza emocional. Una noche tormentosa, Trapito salva la vida de Salapín, un simpático gorrión. Al parecer, la tristeza de Trapito se debe a que le estaba faltando algo. Finalmente, Salapín lo lleva hasta la casa del Patriarca de los Pájaros, un pájaro anciano que conoce muchas cosas de la vida del bosque y sus habitantes. Es así que al pesar a Trapito en la balanza de la vida, descubre que el motivo de su tristeza se debía a que carecía de ilusiones. A partir de ahí, el Patriarca de los Pájaros le encomienda a Salapín la misión de ser el guardián de las ilusiones de Trapito, y es así como surge una inseparable amistad y viven una historia llena de peligros, aventuras, risas pero también instantes muy emotivos, en la que aparecerán amigos como  Larguirucho , Espumita y Caballito de Mar, pero también malvados enemigos como el pirata Mala Pata y su secuaz El Cuervo Ataúlfo. Personal En el primer estreno del film se hizo una introducción con el pingüino  Petete , el célebre personaje de García Ferré, en la que se explica sobre los espantapájaros; curiosamente después de contar todo habla de un fragmento del film antes de que comience la película. Intérpretes Voces: Pelusa Suero Enrique Conlazo Marcelo Chimento Susana Sisto Norma Esteban Mario Gian Equipo Técnico Fotografía: Osvaldo A. Domínguez Música: Néstor D'Alessandro Dirección musical y orquestal Roberto Lar Efectos especiales: Osvaldo A. Domínguez Animación: Néstor Córdova, Horacio Colombo, Natalio Zirulnik Carlos Alberto Pérez Agüero Escenografía: Hugo Csecs Walter Canevaro Personajes Trapito Salapín El Patriarca de los Pájaros Larguirucho Mama Chancha Chanchito Cuervo Ataúlfo Espumita Mala Pata Pulpo Cruel Caballito de Mar",
      "fileSize": 1145162772,
      "addedAt": "2026-01-07T00:10:12.699Z",
      "thumbnail": "https://archive.org/services/img/petete-y-trapito-1975",
      "language": "spa",
      "year": 1975,
      "collection": "feature_films",
      "downloads": 787
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.699Z"
}