{
  "imdbId": "archive-popeye-colorized-collection",
  "title": "Popeye Colorized Collection (incomplete)",
  "year": 1987,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/popeye-colorized-collection",
      "title": "Popeye Colorized Collection (incomplete)",
      "description": "This is a collection of every Turner colorized popeye cartoon I could find on the internet. The majority of these were in another language and were remade into English using the origional audio from the black and whites and then synced to the audio by me to the best of my abilities. This is an incomplete collection and as far as I'm aware, the missing episodes are now considered lost media as they are nowhere to be found online, this does not mean that they aren't in someone's hands from years ago however. I am uploading these for preservation purposes as there is no way that I can find to watch these colorized versions of popeye the sailor. There were multiple episodes that were banned from television. These include the pilot episode \"Betty Boop With Popeye the Sailor\", \"Spinach Fer Britain\", \"Seein Red White N Blue\", \"Scrap The Japs\", \"You're A Sap, Mr. Jap\", and possibly others. Most have been captured on VHS and shared online. The missing episodes from this collection are \"Scrap the Japs\" and \"You're A Sap, Mr. Jap\". I am unsure if they've ever aired on television in color. The current location of the original colorized reels are known.  If you have these recorded or have any knowledge of where to watch either of these color versions of the episodes online (in literally any language is fine). Please share with a review and I will update this list to hopefully complete this collection.",
      "id": "popeye-colorized-collection"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:08:10.143Z"
}