{
  "imdbId": "archive-the-crooked-way-1949_202502",
  "title": "The Crooked Way 1949 ★★★½ CC: Film-Noir [1:29:27] John Payne",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-crooked-way-1949_202502",
      "title": "The Crooked Way 1949 ★★★½ CC: Film-Noir [1:29:27] John Payne",
      "description": "The Crooked Way is a 1949 American film noir starring John Payne, Sonny Tufts and Ellen Drew. Directed by Robert Florey and shot by John Alton. The film has a similar plot to another film noir, Somewhere in the Night 1946, (a war hero loses his memory from a combat wound). Plot: After sustaining a head wound in combat, decorated World War II veteran Eddie Rice (John Payne) is treated at a San Francisco military hospital for a permanent form of amnesia. This leaves him with no knowledge of his life, family and friends prior to his enlistment. Army intelligence is unable to fill this void, as all they know about his past is that he enlisted in Los Angeles. Doctors tell him that no medical cure exists for his condition, but suggest that returning to L.A. might allow him to run into people who know him and might help fill in the blanks. Rice does so, and promptly runs into some folks who recognize him. However, they know him as Eddie Riccardi, a dangerous gangster gone missing, whose past record generates mistrust both among the police and all those who formerly knew him. A woman, Nina Martin, appears to help him, but instead turns him over to ruthless crime boss Vince Alexander (Sonny Tufts), who was betrayed by Eddie before leaving town, and is now out for revenge. FYI: The television in Nina's house is a 1949 Philco model 49-1040. The suggested retail price for the set was around $375, which equates to nearly $5,000 in 2024. Vince Alexander (Sonny Tufts) drives a 1947 Cadillac Series 62 convertible; Nina Martin (Ellen Drew) drives a 1949 Ford Custom convertible coupe. The Letterman Army Hospital, where Dr. Kemble works, was established around 1898 and decommissioned in 1994. In World War II, it was an important hospital for treating sick and wounded soldiers from the Pacific Theater. In 1945 alone, the Hospital treated more than 73,000 patients. The building was demolished in 2002, and Lucasfilm Ltd. LLC now operates the Letterman Digital Arts Center on the site.",
      "id": "the-crooked-way-1949_202502"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:14:26.814Z"
}