{
  "imdbId": "archive-cronica-de-un-nino-solo-1965",
  "title": "Cronica De Un Niño Solo(1965)",
  "year": 1965,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cronica-de-un-nino-solo-1965",
      "title": "Cronica De Un Nino Solo",
      "description": "Crónica de un niño solo  es una  película argentina   dramática  de 1965 dirigida por  Leonardo Favio , en su debut cinematográfico como realizador, y protagonizada por Diego Puente en el papel protagónico. Fue escrita por Favio y su hermano Zuhair Jury. El filme es considerado como la primera parte de una  trilogía  sin nombre de películas dirigidas por Favio, que continúa con  Este es el romance del Aniceto y la Francisca, de cómo quedó trunco, comenzó la tristeza y unas pocas cosas más...  (1966) y termina con  El dependiente  (1969). Fue estrenada el 5 de mayo de 1965. Recibió el  Cóndor de Plata  como Mejor película en 1966. Fue reconocida como la  mejor película del cine argentino de todos los tiempos  en la encuesta realizada por el  Museo del Cine Pablo Ducrós Hicken  en 2000. 1 ​ En una nueva versión de la encuesta organizada en 2022 por las revistas especializadas  La vida útil ,  Taipei  y  La tierra quema , presentada en el  Festival Internacional de Cine de Mar del Plata , la película alcanzó el puesto 5. 2 ​ En julio de 2022 fue declarada Bien de Interés Artístico Nacional por el gobierno argentino para garantizar la conservación del soporte material (negativos, positivos y negativos de sonido) ya que, junto con otras películas de Favio, son consideradas un «testimonio de la producción cinematográfica nacional». 3 ​ (Wikipedia) Sinopsis La película trata sobre la vida de un niño pobre de la Argentina, que transcurre entre la  villa miseria  y el \"reformatorio\" (cárcel de menores) Reparto Diego Puente (Polín) Tino Pascali  (Oficial de justicia) Victoriano Moreira (Fiori) Beto Gianola  (Policía) Leonardo Favio  (Fabián) Carlos Lucero Mario Peña Juan Valunas Amadeo Sáenz Valiente María Vaner  (La chica) María Luisa Robledo Elcira Olivera Garcés Juan Castro Juan Delicio Carlos Medrano Miguel Medrano Jorge Puente Oscar Saraceni Néstor Tricarico Jorge Cabello Roberto Domínguez Carlos González Carlos Membrives",
      "id": "cronica-de-un-nino-solo-1965"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:31.215Z"
}