{
  "imdbId": "archive-extrana-invasion-1965",
  "title": "Extraña Invasion (1965)",
  "year": 1965,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/extrana-invasion-1965",
      "id": "extrana-invasion-1965",
      "title": "Extraña Invasion (1965)",
      "description": "Extraña invasión  ( Stay Tuned for Terror  en  Estados Unidos ) es una  película argentina - estadounidense  de  ciencia ficción  de 1965 coescrita y dirigida por  Emilio Vieyra  y protagonizada por  Richard Conte ,  Jorge Rivera López ,  Eddie Pequenino  y Anna Strasberg. La historia está ambientada en un pueblo del  Sur de los Estados Unidos . Con diálogo enteramente en inglés, la película fue rodada en  Ciudad Jardín Lomas del Palomar , Argentina. La coproducción fue una de las primeras películas argentinas filmadas en color. El reparto incluye actores norteamericanos como protagonistas y reconocidos actores y personalidades argentinas en los papeles secundarios, como  Edmundo Sanders ,  Susana Beltrán  y  Mónica Cahen D'Anvers . 1 ​ Fue estrenada en Estados Unidos en 1965 con el título  Stay Tuned for Terror . Luego fue doblada al español y estrenada en Argentina el 10 de octubre de 1974. 2 ​(Wikipedia) Sinopsis En Clearview, un pueblo en el sur de los Estados Unidos, unos niños juegan al aire libre y accidentalmente hacen caer unos tanques metálicos a un pantano. Poco después, extrañas imágenes de rayas y ondas aparecen en los televisores y producen un  hipnótico  efecto sobre ancianos y niños, que comienzan a deambular por las calles como  zombis . Steven Jameson (Richard Conte), supervisor del Ministerio de Comunicaciones, y la Dra. Conway (Anna Mizrahi Strasberg) viajan a Clearview para evaluar la epidemia y tratar de encontrar una cura. Cuando la señal se apaga, los niños producen una reacción colectiva violenta, y el ejército debe intervenir. Reparto Richard Conte  como Steven Jameson. Jorge Rivera López Eddie Pequenino Eduardo Muñoz Anna Strasberg  como la Dra. Conway Ignacio de Soroa Sergio Vandes Edmundo Sanders Susana Beltrán Emilio Vieyra Mónica Cahen D'Anvers",
      "fileSize": 1896724076,
      "addedAt": "2026-01-07T00:08:24.393Z",
      "thumbnail": "https://archive.org/services/img/extrana-invasion-1965",
      "language": "spa",
      "year": 1965,
      "collection": "feature_films",
      "downloads": 143
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.393Z"
}