{
  "imdbId": "archive-robinson-crusoe-1902-directed-by-georges-melies",
  "title": "Robinson Crusoe ( 1902) Directed By Georges Méliès",
  "year": 1902,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/robinson-crusoe-1902-directed-by-georges-melies",
      "title": "Robinson Crusoe ( 1902) Directed By Georges Méliès",
      "description": "Robinson Crusoe (1902) 'Les Aventures de Robinson Crusoé' Director: Georges Méliès Robinson Crusoe (French: Les aventures de Robinson Crusoë) is a 1902 French silent film directed by Georges Méliès, based on Daniel Defoe's 1719 book of the same name. Plot: Robinson Crusoe, a sailor, is shipwrecked on an island. He gathers what provisions he can from the wreck, including a dog and a cat, who are the only other survivors of the catastrophe. After signaling a passing ship to no avail, Crusoe builds a hut. Elsewhere on the island, at the base of a cliff, cannibal natives have taken prisoners, and have eaten all but one of them. They are about to kill the last prisoner when Crusoe appears and scares them off with gunfire. Crusoe takes charge of the prisoner, naming him Friday. The two of them scale the cliff, fighting off natives attacking them as they go. The fight works its way up the cliff and into the hut. Together, Friday and Crusoe manage to kill all the attacking natives. Safe at last, Crusoe makes friends with Friday and teaches him some skills. They set up home in their hut, along with the dog and the cat as well as a parrot and a goat. Together they build a canoe, brave a hurricane, hunt, and sail around the island. Twenty-five years after Crusoe’s shipwreck, some sailors land on the island; they have mutinied against, and imprisoned, the captain and officers of their ship. Friday and Crusoe attack the mutineers and set the prisoners free. The captain and officers let Crusoe and Friday onto their ship, and bring them to England. Landing in Southampton, Crusoe goes home and is reunited with his wife and children. Friday is adopted into the family. In a final \"apotheosis\" scene, Crusoe and Friday are shown once again after their fight with the natives, standing in glory on their island. Production: Méliès himself stars as the titular hero. The design of the film, also by Méliès, was inspired by J. J. Grandville's illustrations for the novel. The film was released by Méliès's Star Film Company and is numbered 430–443 in its catalogues. Survival: A short black-and-white fragment of the film was the only known remnant until 2011, when a hand-colored print on nitrate film was found among a collection donated to the Cinémathèque Française. This print, roughly twelve and a half minutes of the film's original fifteen-minute running time, was restored in 4k resolution by the Cinémathèque. The restoration, with a new score by Maud Nelissen and with an English translation of Méliès's original narration read live by Paul McGann, premiered on 35mm film at the Giornate del Cinema Muto in Pordenone in 2012. -From Wikipedia",
      "fileSize": 202894248,
      "id": "robinson-crusoe-1902-directed-by-georges-melies"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.755Z"
}