{
  "imdbId": "archive-why-dreams-is-akira-kurosawa-s-best-movie-titan-goji-movie-reviews",
  "title": "Why Dreams Is Akira Kurosawa S Best Movie Titan Goji Movie Reviews",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/why-dreams-is-akira-kurosawa-s-best-movie-titan-goji-movie-reviews",
      "title": "Why Dreams Is Akira Kurosawa S Best Movie Titan Goji Movie Reviews",
      "description": "Title: Dreams | 夢 | Yume | Akira Kurosawa's Dreams (1990) Directed by: Akira Kurosawa, Ishirô Honda Date of birth: 23 March 1910, Omori, Tokyo, Japan Date of death: 6 September 1998, Setagaya, Tokyo, Japan Writing credits: Akira Kurosawa Music: Shinichirô Ikebe Year: 1990 Country: Japan | USA Language: Japanese | French | English Color: Color (Eastmancolor) Runtime: 119 min. Synopsis Following up on his critically acclaimed, blood-splattered epic Ran, master director Akira Kurosawa looks inward with this collection of eight brightly colored dreams. The first section centers on a young boy (Mitsunori Izaki), who witnesses a forest wedding procession of fox spirits in spite of his mother’s (Mitsuko Baisho) warning. The second section concerns the same lad who converses with peach-tree spirits after the trees have been cruelly cut down. This is followed by a party of mountain climbers struggling to make it back to base camp in the midst of a terrible blizzard. The fourth dream deals with a man (Akira Terao) — a Kurosawa stand-in complete with the director’s trademark floppy white hat – who encounters ghosts of Japan’s militaristic past in a forlorn tunnel. In the following dream, the same man ventures into a Van Gogh painting called The Crows and meets the artist himself (Martin Scorsese). The sixth and seventh dreams venture into nightmare territory — one deals with a nuclear meltdown that threatens Japan while the other concerns post-nuclear mutants. In the final dream, Kurosawa meets a 103-year-old man (played by Ozu regular Chishu Ryu) in a utopian rural village. -- allmovie guide Cinematography:  Takao Saito Cast: Akira Terao, Mitsuko Baisho, Toshie Negishi, Martin Scorsese, Mitsunori Izaki, Chishu Ryu, Toshihiko Nakano, Yoshitaka Zushi, Hishashi Igawa, Chôsuke Ikariya, Mieko Harada",
      "fileSize": 115065004,
      "id": "why-dreams-is-akira-kurosawa-s-best-movie-titan-goji-movie-reviews"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}