{
  "imdbId": "archive-ramrod-1947-film-noir-western-action-romance",
  "title": "Ramrod (1947 Western, Film Noir, Action, Romance)",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ramrod-1947-film-noir-western-action-romance",
      "title": "Ramrod (1947 Western, Film Noir, Action, Romance)",
      "description": "PLOT : Violent feud between Connie Dickason, the owner of the Circle 66 ranch and rancher Frank Ivey, the self-proclaimed boss of an otherwise public grazing land. _IMD STORYLINE :  --IMDb / STORYLINE: A cattle-vs.-sheepman feud loses Connie Dickason her fiance, but gains her his ranch, which she determines to run alone in opposition to Frank Ivey, \"boss\" of the valley, whom her father Ben wanted her to marry. She hires recovering alcoholic Dave Nash as foreman and a crew of Ivey's enemies. Ivey fights back with violence and destruction, but Dave is determined to counter him legally... a feeling not shared by his associates. Connie's boast that, as a woman, she doesn't need guns proves justified, but plenty of gunplay results. _IMDb by Rod Crawford IMDb User Review : Ramrod review : (May 18,2020 by JoeytheBrit): Nice guy Joel McCrea is torn between pint-sized femme fatale Veronica Lake and decent seamstress Arleen Whelan in this serviceable Western from the under-valued Andre De Toth. McCrea looks a little lightweight compared to Don Defore and Preston Foster, who stand out as a free-wheeling gun for hire with ambiguous intent and a rancher's heavy with a town under his thumb in a film that's brimming with bad guys. The plot twists and turns, but never quite takes off. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh ** (Ty Gringo Western Movie s for a great show)",
      "fileSize": 520433520,
      "id": "ramrod-1947-film-noir-western-action-romance"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.542Z"
}