{
  "imdbId": "archive-mi-alazan-tostao-1923",
  "title": "Mi Alazan Tostao(1923)",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mi-alazan-tostao-1923",
      "id": "mi-alazan-tostao-1923",
      "title": "Mi Alazan Tostao(1923)",
      "description": "Sinopsis:  Amancio, el hijo de un juez, verdadero amo y señor de un pueblo, quiere imponer criterio de propiedad a los dueños de ranchos y caballos. Impide el desalojo del rancho familiar de Eulalia, pero con la intención de tener los favores amorosos de ella. Silvestre, un forastero que llega al pueblo, conoce a Eulalia de casualidad gracias al accidente que tiene ella con el zulky. Pero él también tendrá problemas, ya que su caballo no tiene marca de propiedad… Sinopsis Malba:  Nelo Cosimi fue uno de los pocos pioneros del cine mudo argentino que, pese a toda adversidad, lograron mantener una filmografía más o menos constante durante el período. Sin embargo, hasta el reciente hallazgo de Mi alazán tostao en el Museo del Cine “Pablo Ducrós Hicken”, se suponía que ninguna de sus películas mudas había sobrevivido. Mi alazán tostao combina elementos del western norteamericano y del melodrama campero, emblematizado en el ya clásico Nobleza gaucha (Martínez de la Pera, Cairo y Gunche, 1915). De este film tomó la polarización de caracteres, el personaje del inmigrante compinche, la autoridad inepta o corrupta pero siempre de parte de los poderosos, y hasta alguna situación precisa: el protagonista Silvestre conoce a la bella Eulalia al rescatarla luego de sufrir un accidente, de un modo semejante al primer encuentro de Juan y María en Nobleza gaucha. Del western convencional toma el arquetipo del forastero heroico y buen jinete, capaz de hacer justicia en un pueblo corrupto, el caballo como personaje que contribuye a resolver la acción, el tipo de amenaza que se cierne sobre los personajes buenos (en este caso, la perspectiva de un injusto desalojo). La resolución es, sin embargo, muy argentina: la autoridad sólo respeta los uniformes y la acción del héroe se ve siempre limitada por la tragedia. El film demuestra además que Cosimi, como el Negro Ferreyra, manejaba con fluidez y destreza los recursos narrativos propios del cine. La sencillez argumental de Mi alazán tostao no es obstáculo para que el realizador refuerce el relato con un montaje dinámico, acciones paralelas, sintéticos flashbacks y hasta la apelación a imágenes metafóricas sorprendentes, como el plano del cielo que se nubla mientras el villano procura seducir a la muchacha con malas artes. El film se encontró ligeramente incompleto, por lo que algunos textos suplementarios fueron redactados para dar cuenta de las escenas faltantes. Un ejemplar del afiche original del film fue conservado y restaurado este año por el Museo del Cine. Reparto Nelo Cosimi Raquel Garín Rafael de los Llanos Augusto Goncalvez Arturo Forte",
      "fileSize": 788588153,
      "addedAt": "2026-01-07T00:09:46.434Z",
      "thumbnail": "https://archive.org/services/img/mi-alazan-tostao-1923",
      "language": "spa",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 113
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.434Z"
}