{
  "imdbId": "archive-de-oldify-from-d-day-to-arnhem-spectacular-use-of-gliders-during-operation-market-garden-1944",
  "title": "De Oldify From D Day To Arnhem, Spectacular Use Of Gliders During Operation Market Garden (1944)",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-from-d-day-to-arnhem-spectacular-use-of-gliders-during-operation-market-garden-1944",
      "id": "de-oldify-from-d-day-to-arnhem-spectacular-use-of-gliders-during-operation-market-garden-1944",
      "title": "De Oldify From D Day To Arnhem, Spectacular Use Of Gliders During Operation Market Garden (1944)",
      "description": "On D-day, the 6th of June 1944 the allied forces commenced their invasion from the beaches of Normandy, under the code name Operation Overlord, in order to free Europe from the German occupation. The invasion was launched with large-scale mass amphibuous beach landings and airborne landings. The U.S. 82nd and 101st Airborne Divisions and the British 6th Airborne Division were tasked with the airborn landings. These landings consisted of parachute droppings as well as the use of glider planes for large scale troup transports. Heavy fighting took place on the Normandy beaches. Over 4400 troups were killed on D-day itself, followed by 73000 casualties and 153000 wounded in the follow weeks of trying to capture Normandy. It took until 25 August to liberate France with the capture and surrender of Paris. In this film we will focus on the period after D-day, especially how the allies went about advancing towards German with as main objective to get rid of the Nazi leadership by capturing Berlin. In particular the film shows how massive numbers of troups were transported to compat areas by means of glider planes. One of the main obstacles on route to Berlin was the Siegfried line, a difficult to capture German defence line that roughly followed the Eastern borders of Northern France, Luxemburg and the Netherlands.  British ground troups commander Marshall Bernard Montgomery devised a cunning strategic plan to circumvent the Siegfried line by preparing an more westerly advance via the south of The Netherlands via the route Eindhoven - Son - Veghel - Nijmegen and Arnhem on to the German Ruhr area. His plan had two components, operation \"market\" using airborn landings and operation \"garden\" consisting of the use of ground troups. Operation Market Garden (OMG) started on September 17, 1944 during daytime, mainly because from September 16 to 17 there was no moonlight. The aim was to advance from Belgium to the IJsselmeer with a combination of an airborne operation and a ground offensive, deploying 150,000 men. This maneuver was intended to isolate the German troops in the western Netherlands and to open the way to the German industrial heart, the Ruhr area. The course of OMG may be assumed to be fairly well known, but what did that air operation actually look like? \"Market\" is the largest airborne operation ever. The numbers of airborne troops, paratroopers and aircraft were enormous. Many sources contradict each other about the exact numbers, but a common denominator can be given. Nearly 35,000 soldiers from the American 82nd and 101st and the British 1st Airborne Division and the Polish 1st Independent Parachute Brigade were involved. More than 20,000 soldiers landed by parachute and a smaller contingient of 15,000 with gliders.  These gliders also transported more than 1,700 vehicles and about 300 pieces of artillery as well as an additional 3,000 tons of ammunition and other supporting resources. These glider transporations mainly involved smaller size less than 1000 kg weighing vehicles in particular jeeps and mobile guns. An enormous air fleet was needed to bring all battalions of airmobile infantry and their equipment to the Netherlands. Under the name 1st Airborne Army, the air troops would board no fewer than: 1750 tow planes and 3100 gliders. It is ironic that Operation Marget Garden has the abbreviation OMG, because \"Oh My God\" what a huge operation it was, but also \"Oh My God\" what a huge failure it turned out to be. The so called \"silent wings\" gliders were essential during OMG. The Allies developed them in WWII following the German example. In Blitzkrieg, gliders transported lightly armed units over short distances for surprise attacks. Hitler himself publicized it so that other nations quickly realized its possibilities. WWII gliders were largely made of wood and only had the most necessary instruments on board. They were primarily intended for one-time-only use, because the landings were often rough and these aircraft could not take-off to return to base. Almost all gliders were lost during operations. Let's take a closer look at the types of tow aircraft and gliders that were deployed.  The British used 916 \"Airspeed Horsa\" glider aircraft, manufactured in Britain. They were capable of transporting up to 28 soldiers including 2 pilots. The Horsa had an average tow speed of 160 km/h and a maximum of 240. In total about 3800 Horsa's were built. A second type was the much larger General Aircraft Limited Hamilcar, Types GAL-49 and GAL-50 that could transport more than double the weight of a Horsa.  It was used to even transport smaller tanks! The only drawback was that it could only be towed by the most powerful aircraft, being the three-engine British RAF Armstrong Whitworth Whitley medium bomber and later on the four engine Handley Page Halifax bomber. In total about 400 Hamiltons were built.  The glider instruments were crude, only consisting of an airspeed indicator, tow line indicator, altimeter and an artificial horizon. That is the most important thing landing, because there is obviously no engine power to correct. Wrong interpretation makes the difference between life and death. A tow rope and an intercom connects a glider with the tug. In addition to transport aircraft, the RAF also used redundant two- and four-engine bombers.  An attack does not proceed quickly.  The third type of glider deployed during OMG was the American Waco CG4A, also deployed by the British under the name \"Hadrian\". It was smaller than the Horsa and could only transport 13 soldiers and two pilots. Overall approximately 14000 Waco's were built. The gliders were considered to be flying death traps and were nick named the flying coffins. Plenty of gliders were damaged during training exercizes as well as crashed on landing during combat circumstances. This footage gives an idea of how precise pilots were able to land their aircraft, but also how landings could go terribly wrong!  Considering that the two pilots were mainly trained to land these craft and hardly received any actual combat training, they were somewhat looked upon as being fairly useless by their fellow soldiers once succesfully landed in enemy territory. It should be noted that the use of gliders had advantages over deploying paratroupers because they could bring troups with far more precision to the combat areas, compared to paratroupers being scattered over wide areas after landing. The main glider towing working horse during OMG was the American Douglas C-47, a military version of the civilian DC3, also deployed by the British and dubbed Dakota.They could reach an airspeed of over 350 km/h.  As already mentioned, converted bombers were used to tow the much heavier Hamilton gliders. After a week of planning, OMG's preparations were complete. Very short, considering the landings in Normandy and Sicily required months of planning. In preparation for the landings, about 1,700 Allied bombers and fighter planes attacked German positions in the Netherlands on the morning of September 17. This included the B-25 Mitchells of the Dutch 320 Squadron and Spitfires of the 322 Squadron. Also during the course of OMG both units became deployed. At 9:45 a.m. the first of more than 2,000 aircraft and gliders would take off from 25 airfields in England, carrying 20,000 troops, more than 500 vehicles, more than 300 guns and almost 600 tons of ammunition to bring to the Netherlands.  Between 1:00 PM and 2:00 PM, the 1st British Airborn Division landed west of Arnhem, the American 82nd Airborne Division near Nijmegen and Grave and the 101st Airborne Division at Son and Veghel.  It is hard to imagine, but this massive air fleet could 'only' take 60% of all airborne troops in one go. Almost all division commanders requested two flights on September 17. However, the general responsible for implementation decided otherwise. Half a day (!) of bombing was required prior to the first landing.  The anti-aircraft defense positions in particular needed to be addressed. In the following week, more than 200 aircraft and almost 150 gliders were lost, but at least the bridges at Nijmegen and Eindhoven were captured.  In Arnhem the problems were extensive. More than 1,000 British airborne troops were killed, about 6,500 injured and captured. On the night of September 25 to 26 the large-scale evacuation took place. In harsh conditions and under murderous fire, first more than 2,150 and later another 250 men managed to reach the southern bank of the Rhine.  After 8 days the battle ended with a total of 17,000 dead and wounded Allies. Trying to capture the Arnhem bridge turned out to be a \"bridge too far\". To end this documentary, it should be noted that not a single glider survived WWII. Many crashed caracusses were converted into temporary homes by bombed out Dutch residents or used for firewood. The gliders that can still be seen in various museums, e.g. in Oosterbeek NL and Saint Mere Eglise in Normandy FR are recreated replicas.",
      "fileSize": 3489023036,
      "addedAt": "2026-01-07T00:07:59.604Z",
      "thumbnail": "https://archive.org/services/img/de-oldify-from-d-day-to-arnhem-spectacular-use-of-gliders-during-operation-market-garden-1944",
      "language": "eng",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 347
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.604Z"
}