{
  "imdbId": "archive-prelude-to-war-1942",
  "title": "Prelude To War (1942)",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/prelude-to-war-1942",
      "title": "Prelude To War (1942)",
      "description": "This motion picture film explores the background of World War II. Reel 1 shows the bombing of Pearl Harbor, London air raids, cavalry and tank battles in Russia, and Panzer and Luftwaffe operations in western Europe. Footage also shows Fascists in Italy and Nazis in Germany as they riot and parade. In Reel 2, Emperor Hirohito inspects Japanese troops. Footage also shows military demonstrations in the Axis countries, their legislatures in session, German slave labor, Alfred Rosenberg's denunciation of the church in Germany and reenactments of political assassinations. In Reel 3, Axis school children receive political indoctrination, Secretary of State Frank Billings Kellogg hands the 1929 Peace Pact to President Hoover, and U.S. citizens state isolationist views. Footage also shows Civilian Conservation Corps (CCC) and Works Projects Administration (WPA) workers constructing a road. Reel 4 contrasts play of U.S. children with military games of Nazi children and diagrams territorial ambitions of the Axis. The reel contains footage of Adolf Hitler, Hermann Goring, Rudolph Hess, and Joseph Goebbels. In Reel 5, Admiral Isoroku Yamamoto speaks of Japanese desires, troops parade in Berlin, Japanese troops advance in Manchuria, Secretary of State Henry Stimson denounces the Manchurian action and Japanese delegates leave a League of Nations meeting. In Reel 6, Japanese troops land at Shanghai, Chiang Kai-shek leads a parade in China, the Italians invade Ethiopia, Haile Selassie asks the League of Nations to intervene in Ethiopia, and President Franklin Roosevelt denounces the Italian action.",
      "fileSize": 359105395,
      "id": "prelude-to-war-1942"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.539Z"
}