{
  "imdbId": "archive-the-devil-thumbs-a-ride-1947-a-morte-misteriosa-1947",
  "title": "The Devil Thumbs A Ride 1947 / A Morte Misteriosa 1947 (GeekJuiceMedia)",
  "year": 2025,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-devil-thumbs-a-ride-1947-a-morte-misteriosa-1947",
      "title": "The Devil Thumbs A Ride 1947 / A Morte Misteriosa 1947 (GeekJuiceMedia)",
      "description": "Hardcoded Spanish subtitles for some reason The Devil Thumbs a Ride  is a 1947 American  film noir  directed by  Felix E. Feist  and featuring  Lawrence Tierney ,  Ted North ,  Nan Leslie  and  Betty Lawford . [ 2 ]  It was produced and distributed by  RKO Pictures . Plot Steve Morgan (Tierney) is a charming  sociopath  who has just robbed and killed a cinema cashier. Seeking to escape, he hitches a ride to Los Angeles with unsuspecting Jimmy 'Fergie' Ferguson (North). Part way the pair stops at a gas station and pick up two women. Encountering a roadblock, Morgan persuades the party to spend the night at an unoccupied beach house. The police close in after Morgan killed one of the women. Cast Lawrence Tierney  as Steve Morgan Ted North  as Jimmy \"Fergie\" Ferguson Nan Leslie  as Beulah Zorn, alias Carol Demming Betty Lawford  as Agnes Smith Andrew Tombes  as Joe Brayden, Night Watchman Harry Shannon  as Detective Owens, San Diego Police Glen Vernon as Jack Kenny, Gas Station Attendant Marian Carr  as Diane Ferguson William Gould  as Police Capt. Martin, San Diego Police Josephine Whittell  as Diane's mother Dick Elliott  as Mack Wilkins, San Clemente Police (uncredited) Phil Warren as Pete, Roadblock Motorcycle Cop Robert Malcolm as Newport Deputy Sheriff Grover Reception Critical response When the film was released  The New York Times  film critic identified as BC ( Bosley Crowther ) dismissed the film: \" The Devil Thumbs a Ride , which came to the Rialto yesterday, is a distinctly pick-up affair ... In the role of the thug Lawrence Tierney, who played Dillinger a couple of years back, behaves with the customary arrogance of all gunmen in cheap Hollywood films. It is pictures like this which give the movies a black eye and give us a pain in the neck.\" [ 3 ] In 2007, film critic Dennis Schwartz was also critical of the film: \" Felix E. Feist  ( The Man Who Cheated Himself / Donovan's Brain / The Threat ) directs and writes this ugly hitchhiker crime drama that has little entertainment value, the characters other than the main protagonist are too incredibly dull to ring true and it has no redeeming social value. The low-budget programmer is helped only by its noir look, fast-pace, the manic performance by Lawrence Tierney and the offbeat nature of its story ... Feist fills both the police car and the hitcher's car with noir characters, but it ends up as a ride to nowhere.\" [ 4 ]",
      "fileSize": 730084544,
      "id": "the-devil-thumbs-a-ride-1947-a-morte-misteriosa-1947"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.684Z"
}