{
  "imdbId": "archive-shatteredscherben1921",
  "title": "\"Shattered\" [\"Scherben\"] [1921]",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shatteredscherben1921",
      "title": "\"Shattered\" [\"Scherben\"] [1921]",
      "description": "Criterion... One of the key films of the German kammerspiel movement, this silent work chronicles the tragic repercussions of a furtive love affair between a railway worker's daughter (Edith Posca) and her father's supervisor (Werner Krauss). ---------- Kammerspielfilm [Wikipedia]... Kammerspielfilm is a type of German film that offers an intimate, cinematic portrait of lower middle class life. The name derives from a theater, the Kammerspiele, opened in 1906 by a major stage director Max Reinhardt to stage intimate dramas for small audiences. Few Kammerspiel films were made, but nearly all are classics. Kammerspielfilme (the plural form) formed a German film movement of the 1920s silent film period that was developed around the same time as the more commonly known Expressionist movement in cinema. The Kammerspielfilm was known as the \"chamber drama\" as a result of the influence from the theatrical form of the chamber play. It is characterised by its focus on character psychology and its lack of intricate set design. Also, unlike Expressionist films, Kammerspielfilme seldom used intertitles to narrate the story. ---------- IMDb reviewer, rmh3283, wrote... This little picture is absolutely charming. There are few inconsistencies, and I would like to see a version where the \"I am a murderer\" scene is tinted red, as I understand it was in the original. Werner Krauss is spectacular as the bovine bourgeois, and Edith Posca, Lupu Pick's wife is extremely moving, especially in the scenes where she \"throws herself\" at the Paul Otto and when she vengefully confesses to her father (she reminds me of a cat in that scene). Too bad she didn't have many other acting roles (\"Sylvester\", also directed by Lupu Pick) is available only in Germany. ---------- The last comment is interesting in that it represent a similar case involving Jean Renoir's \"Swamp Water\" [1941]. This film has had regional restrictions for many years and not available in the United States, but I just discovered that a Blu-ray limited pressing [3,000 copies] will be released in February 2012. Maybe \"Sylvester\" will have a similar experience.",
      "id": "shatteredscherben1921"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:10:02.926Z"
}