{
  "imdbId": "archive-cyranodebergerac_sdrodrian",
  "title": "Cyrano De Bergerac Donat, Mason TV SDRodrian",
  "year": 1974,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cyranodebergerac_sdrodrian",
      "id": "cyranodebergerac_sdrodrian",
      "title": "Cyrano De Bergerac Donat, Mason TV SDRodrian",
      "description": "The American Conservatory Theatre of San Fancisco's 1974 Cyrano de Bergerac by Edmund Rostand Translation by Brian Hooker Directed by William Ball Cast, In Alphabetical Order= Orange Girl,Nun: Janie Atkins Poet,Capuchin: Andy Backer Meddler: Joseph Bird LeBret: Earl Boen Bellerose,Cadet: Roger Aaron Brown Lord,Poet: Robert Chapline Valvert: Patrick Crean Lise: Kathryn Crosby Cyrano deBergerac: Peter Donat Monfleury,Cadet: Charles Hallahan Cut Purse: John Hancock Ligniere,Cadet: Henry Hoffman Duenna: Elizabeth Huddle Mucisian,Page: Daniel Kern Roxane: Marsha Mason Rogueneau: Robert Mooney Chavigny: E. Kerrigan Prescott DeGuiche: Paul Shenar Jodelet,Cadet: Howard Sherman Christian: Marc Singer Mother Marguerite,Townswoman: Shirley Slater Cuigy,Musketeer: J. Steven White _________________________________________ I was bowled away then I saw this production on PBS in 1974 (I was familiar with Ferrer's movie version, and admired his performance, but) Peter Donat's Cyrano adds something quite unique and human that Ferrer's is hampered by too much disgust in his Cyrano. Donat, on the other hand, gives us a penetrating insight into the very painful cross that Cyrano has borne all his life because of his rather unique nose (the end-all of his self-imposed exile from most of humanity, especially its female half). And he does not for the most part blame & despise the world as thoroughly as Ferrer's Cyrano seems to. This is a masterful translation by Brian Hooker and a matching achievement by director William Ball and his company. Language can sometimes/oftentimes actually become an impediment to the appreciation of older or foreign works, but in this instance Brain Hooker created a sense of contemporary immediacy with brilliant uses of our American idioms and William Bell matched this with equally apropos contemporary idiosyncrasies and everyday ordinary comportments. All in all, this performance is a practical study on how old and foreign literary works ought to be recreated for the American audiences of today. Brilliant acting throughout, especially in Peter Donat. Cyrano is a twisted superhero, maybe the first of them all, and his often over-the-top behavior is right-on-spot whenever the need arises for it (them) as if to compensate for the hero's super-human acts. This particular script also fills in a lot of the emotional motivations which in Ferrer's movie were taken over (or put aside) by matinee action requirements: The theatre is this work's more natural home (rather than the movie house bigger-then-life silver screen). In addition, here the immediacy that television offers with its unparalleled sustained close-ups (entire 'asides' just by themselves) also add truly impressive gravitas to this production. There have been scores of marvelous performances both in movies and in the theatre, but I would rank this one in particular as one of the very best ever. This is a comedy, of course, and unlike the Ferrer movie, the comedy here shines through naturally throughout. In fact, it almost sets up the touching ending all by itself. Therefore you can't play this great piece as if it were a farce, or the more serious moments will be made to sound fake. And William Ball and his actors hit the nail right on the head with every aspect of their art here. These persons, who seem ever so real to us after all is said & done, are ever as silly and culpable as all of us are, and so in the end they come out surprisingly believable. S D Rodrian",
      "fileSize": 3136447499,
      "addedAt": "2026-01-07T00:07:51.627Z",
      "thumbnail": "https://archive.org/services/img/cyranodebergerac_sdrodrian",
      "language": "eng",
      "year": 1974,
      "collection": "feature_films",
      "downloads": 997
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.627Z"
}