{
  "imdbId": "archive-el-expreso-de-shanghai-1932-1080-p-vose",
  "title": "EL EXPRESO DE SHANGHAI (1932) [VOSE]",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-expreso-de-shanghai-1932-1080-p-vose",
      "title": "El Expreso De Shanghai 1932 1080 P Vose",
      "description": "Título original: Shanghai Express Fechas de estreno: En los Estados Unidos el estreno general fue el 12 de febrero de 1932;   En la Ciudad de México (D.F.) se estrenó en el cine Olimpia el 4 de mayo de 1932   y permaneció dos semanas en cartelera. En Argentina el 11 de mayo de 1932. En España el 31 de octubre de 1932. Duración: 80 min. País de origen: Los Estados Unidos Dirección Josef von Sternberg Guion: Jules Furthman Reparto: Clive Brook  como el capitán Donald \"Doc\" Harvey. Marlene Dietrich  como Shanghái Lily / Madeline. Anna May Wong  como Hui Fei. Warner Oland  como Henry Chang. Lawrence Grant  como el reverendo Carmichael. Eugene Pallette  como Sam Salt. Gustav von Seyffertitz  como Eric Baum. Louise Closser Hale  como la Sra. Haggerty Emile Chautard  como el mayor Lenard. Música: W. Franke Harling Fotografía: Lee Garmes (B&W) Género: Drama, Años 20, Trenes, Metros, Melodrama, Film Noir, Romance trágico, aventura, Sinopsis Tras ser plantada por el capitán Donal Harvey (Clie Brook), Lily (Dietrich) gana reputación como una famosa aventurera. Pero la situación se calienta cuando estos ex amantes se encuentran en el tren camino de Shanghai. Compartirán sitio con un grupo de pasajeros de distintas nacionalidades y clases incluido un comerciante muy sospechoso rechazado por la bella Lily. Cuando el tren es asaltado por rebeldes chinos, el capitán Harvey es tomado como rehén y el comerciante pasa a ser el líder de los rebeldes. Ahora Lily se encargará de hacer tratos con quien sea necesario con tal de salvar al hombre que nunca dejó de amar... (FILMAFFINITY)",
      "id": "el-expreso-de-shanghai-1932-1080-p-vose"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:52.697Z"
}