{
  "imdbId": "archive-pablo-and-the-dancing-chihuahua",
  "title": "Pablo And The Dancing Chihuahua (1968)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pablo-and-the-dancing-chihuahua",
      "title": "Pablo And The Dancing Chihuahua (1968)",
      "description": "\"Pablo and the Dancing Chihuahua\" is a 1968 telefilm produced by Walt Disney Productions. It was originally broadcast on NBC as a two-part episode on Walt Disney's Wonderful World of Color on January 28, and February 4, 1968. The telefilm was directed by Walter Perkins. In 1972, the program was released theatrically in the United Kingdom as a supporting feature to a re-release of Snow White and the Seven Dwarfs. A recently orphaned boy living in Mexico has one item that would link him to family, an old letter from an uncle with an address in Tucson, AZ. He set out across country and desert to locate this uncle in Tucson. At the border he was unwillingly linked up with a small chihuahua. The story is of their experiences as they made their trek across the desert, some funny and others harrowing. They encountered friendly people to aggressive Javelinas. They never found Pablo's uncle, but in the end they did find a loving family. Pablo and his \"dancing\" Chihuahua travel through 1800s Mexico seeking a relative. Through the \"wilderness\" Pablo and dog encounter curious characters and animals. Having seen the original airing and its repeat, I recall the distinct detail where Pablo and dog manage to quench thirst with cactus milk. While this film is probably hidden with Song of the South in Disney' \"film vault\", it is a dramatic piece and classic 1960s television. Includes the complete film and as a bonus for archival sake, the first episode as it aired on Best of Walt Disney, as the original source was missing Episode 2 from this show series.",
      "id": "pablo-and-the-dancing-chihuahua"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:12.694Z"
}