{
  "movieId": "archive-tres-argentinos-en-paris-aka-tres-anclados-en-paris-1938",
  "title": "Tres Argentinos En Paris (aka Tres Anclados En Paris)(1938)",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tres-argentinos-en-paris-aka-tres-anclados-en-paris-1938",
      "id": "tres-argentinos-en-paris-aka-tres-anclados-en-paris-1938",
      "title": "Tres Argentinos En Paris (aka Tres Anclados En Paris)(1938)",
      "description": "Tres anclados en París  es una película  argentina  en blanco y negro dirigida por  Manuel Romero  sobre su propio guion que se estrenó el 26 de enero de 1938 y que tuvo como protagonistas a  Florencio Parravicini ,  Tito Lusiardo ,  Irma Córdoba ,  Enrique Serrano  y  Hugo del Carril . El nombre original del filme era el de  Tres argentinos en París , pero debió ser cambiado por exigencia de las autoridades. (Wikipedia) Sinopsis Tres argentinos que viven en París y sueñan con volver a Buenos Aires pero carecen de recursos para el pasaje, encuentran su oportunidad cuando llegan a París un hacendado, un hombre de negocios y la hija de este. En una partida de póquer amañada los tres anclados obtienen de los recién llegados el dinero para los pasajes; ocurre sin embargo que el empresario ha cometido un desfalco e irá a la cárcel si no devuelve el dinero. El personaje representado por Parravicini, que es el verdadero padre de la hija adoptiva de aquel, le entrega el dinero ganado para que solucione su problema y los tres permanecen en París viéndoselos en un final con la mejor poética de Romero cruzando un puente bajo la neblina, silenciosos, otra vez anclados pero con la feliz tristeza de la autoestima recobrada. Produccion El flamante Instituto Cinematográfico del Estado obtuvo que se prohibiera el estreno de la película porque creyó ver en la partida tramposa de cartas un daño al prestigio del país. Con una vigorosa protesta los productores Romero y Guerrico se negaron a efectuar cortes y obtuvieron que se dejara sin efecto la prohibición con la sola concesión de cambiar el título que originalmente era  Tres argentinos en París . El hecho incrementó el interés por ver el filme, que fue uno de los mayores éxitos del cine y quedó reconocida como uno de sus clásicos. En la película se hizo por primera vez en el país un uso amplio del fondo proyectado: Francisco Mugica filmó en París los exteriores que aparecen en la película, incluyendo los que se ven en las excursiones del personaje de Parravicini. Reparto Florencio Parravicini  ... Domínguez Tito Lusiardo  ... Eustaquio Pedernera Irma Córdoba  ... Ángela Torres Enrique Serrano  ... Eleodoro López Hugo del Carril  ... Ricardo Juan Mangiante  ... Carlos Torres Alímedes Nelson  ... Ketty López Elvira Pagá  ... Ella misma Rosina Pagá  ... Ella misma Carlos Morganti José Alfayate Amalia Bernabé  ... Turista argentina en París Héctor Méndez  ... Conductor del grupo Raúl Deval",
      "fileSize": 1419687723,
      "addedAt": "2026-01-07T00:12:55.129Z",
      "thumbnail": "https://archive.org/services/img/tres-argentinos-en-paris-aka-tres-anclados-en-paris-1938",
      "language": "spa",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 55
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.129Z"
}