{
  "imdbId": "archive-UEBERFORDERT",
  "title": "1969 Überfordert (Overstrained)",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/UEBERFORDERT",
      "title": "1969 Überfordert (Overstrained)",
      "description": "With Wolfgang Domke. A man, \"tied\" to a table, gets drunk, eats beetroot and cream pie to be able to chuck and then during the some hours lasting process of sobering / disillusion he explains his vision of the future. Difficulties in articulation: In a gradual disillusionment from a drunken stupor, in dull bulls, chunking up (! In color, which was nice) and troglodytic muck the first communication sounds chuckle slowly from the speakers. The action takes place with progressive disillusionment in a series of statements that Wolf Domke (great when drunk) spits out in an agonizing way as an answer to the Voiceover questions from Lutz Mommartz. All hardships of jolting formulation reflect the Sysiphus like agony of thinking. They condense into the message of the film: That all future is lost, if you do not do thoughts in sorrow. Such a specific interpretation of course, limiteds the movie on a \"message\", with that alone certainly we do not give justice to the film! (DIE WELT, 12.3.69) Way less amusing were Lutz Mommartz from Düsseldorf (\"Overstrained\") and Adolf Winkelmann from Kassel, the secret pacemaker of the underground establishment. They attacked old viewing habits and illustrated the plight of the individual. They waived fable and actor. Instead they invented model situations and recorded with the camera the reality. (DER SPIEGEL, 17.3.69) Another strong example in which the audience is directly confronted with the performer and almost forces a reaction, provides the film \"Overstrained\". \"Overstrained\" is a drunken man trying to formulate his utopia during the process of sobering / disillusion but at the same time does not think that he is capable of. (HANS SCHÜTZ, NRZ, 20.3.70) The more the alcoholic daze decreases, with less resistance he returns to the most familiar role. Immediacy is reduced, the reflection crunches the intend to talk meaningful about the future. (HEINZ KLUNKER, DEUTSCHES ALLGEMEINES SONNTAGSBLATT, 23.3.69)",
      "fileSize": 1117904925,
      "id": "UEBERFORDERT"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.887Z"
}