{
  "imdbId": "archive-MontageGardenOfEden1962",
  "title": "Montage IV: The Garden of Eden, 1962",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MontageGardenOfEden1962",
      "title": "Montage IV: The Garden of Eden, 1962",
      "description": "Montage IV: The Garden of Eden (1962) Narration from the writings of S. P. Dinsmoor Sound: James Kramer Music: Jean Eichelberger Ivey Graphics: Ted T. Young Voice: Guy Gebhardt A film by Richard Grove, Richard J. Meyer, Wayne Sourbeer This film is a look at the eccentric and weird cement statuary created by S. P. Dinsmoor in Lucas, Kansas with narration taken from his equally eccentric writing. It was filmed in winter when the statues were overgrown and covered with bare shrubbery and leafless vines, adding another dose of ornate eeriness to them. Jean Eichelberger Ivey created the music for this and the next Montage production. Soon after these films, she gained a reputation as a ma jo r composer of modern orchestral and electronic music. Around 2010 I was contacted by a researcher into Ivey's work who had come across mention of her music for these films. The Montage Series By Ben Urish Beginning in 1951 Wichita, Kansas had a vibrant and adventurous film society. The Wichita Film Society ( WFS ) was a focal point for those interested in the cinema arts and was both an institution of education, exhibition, and a hub for other aspects of the local art and theater scenes. By the late 1950s, the WFS had several members and frequent patrons who wanted to make films of their own and in 1959, three of them formed Montage Productions , named after their interest in the films (and film theories) of Sergei Eisenstein and V.I Pudovkin. The films in the series eventually were tied together by two broad and broadly defined attributes: 1) they were about people or places (or both) in Kansas, and 2) the films were artistic representations of other artistic representations, broadly defined. The series lasted until 1965 by which time the m e m bers ' careers took them away from Wichita and each other. Each film had its premiere at a WFS screening. Credits as they appear in the films and a brief synopsis of the films are printed below. In the early and mid - 1980s, I researched the history of The Wichita Film Society and as a result, came across the information about the Montage films written here. Through other local filmmakers and former WFS member s , I was able to get in touch with Corban LePell, Wayne Sourbeer, Richard Wright, and Bruce Conner. They shared their memories and insights and either loaned me copies of their films or told me where to find them. Eventually, the WFS rescreened their films for the public along with more recent films by local filmmakers. I then got the idea to try and finish their unfinished works and began to read up on the town of Nicodemus, the subject of one of their unfinished Montage Productions . Soon, however, I decided to make a film of my own, in more or less the same style that they had used. That film is listed here as well. Years later, former WFS chairperson Rob McHenry also made a film inspired by the Montage series and that film is also listed here. The leader of Montage Productions was Wayne Sourbeer, who later went on to be a noted photographer and also to make several awar d -winning documentaries and other films, as well as building a successful career at PBS . His awards included winning an Emmy . When contacted in the early 1980s he related that he had made the film Starry Night , about the noted Van Gogh painting and he reported that he thought of it as being “ Montage -like” in form and purpose. The other two members were Richard Meyer and Richard Grove. In addition to their work with the WFS and Montage Productions, they began a film class, assisted other local filmmakers, and even started another alternative film series at a local Wichita theater with university professor Walter Merrill who was a ma jo r supporter of both the Montage group and the film and art scene in Wichita. Meyer went into television work eventually being a station director while Grove ran various art museums and became a museum Educatio n Specialis t for the U .S. Office of Education. He often instituted film programs as part of his work.",
      "id": "MontageGardenOfEden1962"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}