{
  "imdbId": "archive-blue-beard-1901-directed-by-georges-melies",
  "title": "Blue Beard (1901) Directed By Georges Méliès",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blue-beard-1901-directed-by-georges-melies",
      "title": "Blue Beard 1901 Directed By Georges Melies",
      "description": "Blue Beard Directed by Georges Méliès Starring Georges Méliès Jehanne d'Alcy Bleuette Bernon Distributed by Star Film Company Release date 3 May 1901 Running time 9 minutes Country France Language Silent film Blue Beard ( French : Barbe-Bleue ) is a 1901 French silent trick film by Georges Méliès , based on Charles Perrault 's fairy tale \" Bluebeard \". Plot A sinister aristocrat, Blue Beard, is looking for a beautiful woman to become his wife. Lured by his great riches, many noble families bring their most eligible daughters to meet him. None of the young women want to marry him, both due to his ghastly appearance and because he has already had seven previous wives – all of whom have mysteriously vanished without a trace. Bluebeard's great wealth, however, persuades one father to give his daughter's hand to him. She has no choice but to marry him, and after a lavish wedding feast, she begins her new life in his castle. One day as Blue Beard is going away on a journey, he entrusts the keys to his castle to her and warns his wife never to go into a particular room. Caught between the fear of her husband's wrath and her own curiosity, she is unsure of what to do regarding the forbidden chamber. Her curiosity manifests itself as an imp who taunts and mocks her with potential promises that the room might contain. In contrast, her better judgment comes in the form of a guardian angel , who attempts to dissuade her from entering the locked door. When her curiosity finally gets the best of her, she realizes that she has placed herself in great danger. She enters the dimly lit room, making out strange bag shapes. The room is a torture chamber, and these bags are dead bodies: the seven past wives of the murderous Blue Beard hanging on hooks, dripping stale blood onto the floor. The new wife drops the key in her horror and is stained with dead wives' blood which the wife relentlessly tries to wash off. Later that night, she dreams of seven giant keys haunting her. On Blue Beard's return, he discovers his wife's untamable curiosity and violently shakes her. She runs to the top of the tower and calls to her sister and brothers. Her relatives save her from death and pin Blue Beard with a sword to the castle walls. The angel appears to restore the murdered wives to life, and they are married to seven great lords. Production Charles Perrault 's fairy tale \" Bluebeard \" had previously been adapted for film in 1897, in a short version for the Lumière Brothers ' studio. Méliès may have known and remembered this film in preparing his elaborate ten-scene version, which adds several elements characteristic of his films, including the appearances of a good Fairy and the Devil. [ 1 ] The film features Jehanne d'Alcy in the leading role of Blue Beard's wife, identified as Fatima in the French and American catalogues. Bleuette Bernon plays the fairy. Méliès himself appears in three roles: Blue Beard, one of the kitchen assistants, and the Devil. [ 2 ] Méliès's production design for the film is eclectic, mixing Renaissance , Medieval , and Moorish elements as well as a giant modern-day bottle of Champagne Mercier . [ 2 ] The final shot is an apotheosis in theatrical style, as would be used at the conclusion of a stage spectacular at Paris venues like the Théâtre du Châtelet . [ 1 ] The special effects are created with substitution splices , dissolves , stage machinery , and pyrotechnics . [ 2 ] The exaggerated size of some props, particularly the Mercier bottle and the key to Bluebeard's chamber, point to Méliès's wish to emphasize certain details in the complex, sprawling wide shots of the film. In later cinema, when a grammar of narrative film editing became prevalent, such emphasis would often be given using closeups . [ 1 ] Similarly, to clarify the film's plot within its spacious format, Méliès drew freely on 19th-century theatrical techniques, including exaggerated mime-based acting, carefully layered groupings of actors, and scenery painted with sharp, high-contrast detail. [ 1 ] According to Méliès's recollections (as reported by his granddaughter, Madeleine Malthête-Méliès), the filming process was marked by an accident: during production of the penultimate scene, in which one of Bluebeard's brothers-in-law prepares to stab him, Méliès was knocked over, fell on the guard of his sword, and broke his femur. He finished the film, but had to get an orthopedic cast on his leg that night. He was still wearing the cast at the grand re-opening of his stage venue, the Théâtre Robert-Houdin , on 22 September 1901. [ 2 ] Release Blue Beard was sold by Méliès's Star Film Company and is numbered 361–370 in its catalogues. [ 3 ] A surviving print of the film, restored by the film preservationist David Shepard , was released on home video in 2008. [ 4 ] References 1 Frazer, John (1979), Artificially Arranged Scenes: The Films of Georges Méliès , Boston: G. K. Hall & Co., pp. 88–90, ISBN   0816183686 2 Essai de reconstitution du catalogue français de la Star-Film; suivi d'une analyse catalographique des films de Georges Méliès recensés en France , Bois d'Arcy: Service des archives du film du Centre national de la cinématographie, 1981, pp. 98–101, ISBN   2903053073 3 Malthête, Jacques; Mannoni, Laurent (2008), L'oeuvre de Georges Méliès , Paris: Éditions de La Martinière, p. 344, ISBN   9782732437323 4 Méliès, Georges (2008). Georges Méliès: First Wizard of Cinema (short film collection; DVD). Los Angeles: Flicker Alley. ISBN   1893967352 . From Wikipedia, the free encyclopedia",
      "id": "blue-beard-1901-directed-by-georges-melies"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:05:15.643Z"
}