{
  "imdbId": "archive-2018LaBelleHistoireDamour",
  "title": "2018 La Belle Histoire D'amour",
  "year": 2018,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/2018LaBelleHistoireDamour",
      "title": "2018LaBelleHistoireDamour",
      "description": "\"Seit den 1960er Jahren hat Lutz Mommartz (*1934) den deutschen Experimentalfilm mitgeprägt. Mommartz begann als Autodidakt, wurde mit seinen Filmen erfolgreich in der Kunst- und Filmszene und erhielt 1978 eine Professur für Film an der Kunstakademie Münster (bis 1999). In seinen Filmen und kinematografischen Installationen untersucht er die Mission des Kinos, die Anonymität des Betrachters, den Realitätsanspruch des Films und den Zweck des Drehbuchs. 1980 drehte Mommartz den Langfilm „Tango durch Deutschland“. Die Hauptrolle hatte der legendäre Eddie Constantine, der als alternder Kinostar im Film – wie auch im Leben – ziellos auf der Suche nach sich selbst war. Mommartz erklärte den damaligen Film für gescheitert und produzierte 1990 die neue Version „Eddie (Recycled aus ‚Tango durch Deutschland‘)“. 2018 liegt nun eine aktuelle Version vor, in der Mommartz das Geschehen rekapituliert und erneut die Tragik des Idols umkreist.\" \"Since the 1960s, Lutz Mommartz (* 1934) coined the German experimental film. Mommartz started as self-taught, his films were successful in the art and film scene and received in 1978 a professorship for film at the Kunstakademie Münster (until 1999). In his films and in cinematographic installations he explores the mission of Cinemas, the anonymity of the viewer, the reality claim of the Films and the purpose of the script. In 1980 Mommartz shot the feature film \"Tango durch Deutschland\". The Starring the legendary Eddie Constantine, who as aging movie star in the movie - as well as in life - aimlessly on the Looking for yourself. Mommartz explained the movie at the time for failed and produced in 1990 the new version \"Eddie (Recycled from 'Tango through Germany') \". 2018 is now one current version, in the Mommartz the happening recapitulates and once again orbits the tragedy of the idol.\"",
      "id": "2018LaBelleHistoireDamour"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:03:09.445Z"
}