{
  "movieId": "archive-SutehDelan-BrokenHearts1978_441",
  "title": "Suteh Delan - Broken Hearts (1978)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SutehDelan-BrokenHearts1978_441",
      "id": "SutehDelan-BrokenHearts1978_441",
      "title": "Suteh Delan - Broken Hearts (1978)",
      "description": "Suteh Delan (1978) - Broken Hearts Habib is a forty-year-old bachelor, who lives with his mother and his half-wit brother, Majid. Majid, who does errands at his brother1s shop, falls in love with the picture of a girl he has seen in a shop window. Finding out that the girl is already married, he is deeply disturbed and has to be taken to a holy shrine to be cured. Back in town, Majid falls in love again, this time with a movie-theatre ticket girl, and leaves home. Habib finds him, and decides to arrange for him to get married. He brings home a prostitute and leaves her with Majid. Majid falls in love with the girl and marries her. When later he finds out about his wife's past, he loses his emotional stability once again, and asks his brother to take him to the holy shrine. He dies before reaching the shrine, however, and Habib is forced to marry the pregnant prostitute. The film was shown at the Sixth Tehran International Film Festival Competition Section in 1977. Noted primarily for its artistic merits. Maghsoulou, Bahman. Iranian Cinema New York: New York UP Hagop Kevorkian Center for Near Eastern Studies, 1987. Cast overview: Shohreh Aghdashloo Rogheyeh Chehreh-Azad Jahangir Forouhar Fakhri Khorvash Jamshid Mashayekhi Akbar Meshkin Behrouz Vossoughi .... Majid",
      "fileSize": 12979481,
      "addedAt": "2026-01-07T00:06:58.270Z",
      "thumbnail": "https://archive.org/services/img/SutehDelan-BrokenHearts1978_441",
      "collection": "feature_films",
      "downloads": 373
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.270Z"
}