{
  "movieId": "archive-NaserMalekMotieeApril1930May2018",
  "title": "Naser Malek Motiee( April 1930 May 2018)",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NaserMalekMotieeApril1930May2018",
      "id": "NaserMalekMotieeApril1930May2018",
      "title": "Naser Malek Motiee( April 1930 May 2018)",
      "description": "Naser Malek Motiee( April 1930 May 2018) Iranian Veteran Actor Nasser Malek-Motiei dies at 88 Tehran Times May 26, 2018 TEHRAN – Iranian actor Nasser Malek-Motiei who appeared in over 100 movies and TV series, in most of which he played the roles of virile characters, died at Tehran’s Aatieh Hospital on Friday night, he was 88. He was suffering from a kidney disorder, Persian media outlets announced. Born in Tehran in 1930, he studied physical education at the Tehran Higher Education Center and pursued a teaching career as a sports theater at several of Tehran’s primary schools.    He later shifted onto cinema and made his debut in 1949 with “Spring Variety\", an episodic film directed by Parviz Khatibi. “I entered cinema with empty hands and lack of knowledge and unsupported, but with love. People ignored our mistakes, and it would be a pity if we do not appreciate them,” Malek-Motiei once said. He worked in numerous movies such as “Baba Shamal” and “Toqi” by Ali Hatami and “Qeisar” by Masud Kimiai. The movies all were produced before the victory of the Islamic Revolution in 1979. “The Imperiled” , directed by Iraj Qaderi in 1982, was the first film Malek-Motiei acted in after the victory of the revolution. Afterwards, he faced an unofficial ban due to the new conditions dominating the post-revolution cinema. In 2013, he returned to the silver screen in the role of an old man in Ali Atshani’s family drama “Negar’s Role” after a 31-year hiatus. “I cannot describe how pleased I am that I have appeared in cinema again,” Malek-Motiei said during a ceremony the film crew organized to celebrate his return. “I was the bad boy of cinema, who has returned to his home. I do not know how to express my happiness like that which child would,” he added. “Over the years, I was far from cinema. It was like I was far from my beloved. I always thought about the beloved, and now I do not know whether the beloved will accept me or not,” Malek-Motiei said. The movie turned out to be his swansong. Photo: Actor Nasser Malek-Motiei in an undated photo (MMS/YAW) Filmography     1949 Vareiteh bahar     1950 Vagabond     1952 The Enchanter     1955 The Crossroad of Events     1956 Accusation     1956 Seventeen Days to Execution     1958 Broken Spell     1958 The Runaway Bride     1959 The Twins     1959 Woman's Enemy     1960 Quiter Before the Storm     1960 The Stars Glitter     1960 The Strong Man     1961 Bitter Honey     1961 The Bum     1961 Uncle No-Ruz     1962 The Merchants of Death     1962 The Shadow of Fate     1962 The Velvet Hat     1963 Aras Khan     1963 Men and Roads     1963 The Polite Ones     1964 Abraham in Paris     1964 The Pleasures of Sin     1965 A Perfect Gentleman     1966 Running Away from Truth     1966 Hashem khan     1966 Hossein Kord Shabestari     1969 Gheysar     1969 Kölen Olayim     1970 Avare asik     1970 Wood Pigeon (Toghi) – directed by Ali Hatami     1970 Dancer of City     1970 The Coin of Luck     1971 A Hut across the River     1971 Baba Shamal     1971 Gholam Zhandarm     1971 Kako     1971 Knucklebones     1971 Looti     1971 Noghre-dagh     1971 Pahlevan Mofrad     1971 The Bridge     1972 Ghalandar     1972 Mehdi in Black and Hot Mini Pants     1973 Sheikh Saleh     1973 Riot     1974 Agha Mehdi Vared Mishavad     1974 Oosta Karim Nokaretim     1974 Salat-e zohr     1974 Ten Little Indians     1974 Soltan-e Sahebgharan (TV mini-series)     1974 Torkaman     1975 Golden Heel     1976 Southern Fire     1976 Idol     1976 Deprem     1977 Baraj     1977 Sine-chak     1982 The Imperilled     2014 Negar's Role  ",
      "fileSize": 64987744,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NaserMalekMotieeApril1930May2018",
      "collection": "feature_films",
      "downloads": 349
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.464Z"
}