{
  "movieId": "archive-mary-tim-1996-5-star-drama-rom",
  "title": "Mary & Tim (1996 5 Star Drama Rom)",
  "year": 1996,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mary-tim-1996-5-star-drama-rom",
      "id": "mary-tim-1996-5-star-drama-rom",
      "title": "Mary & Tim (1996 5 Star Drama Rom)",
      "description": "PLOT : The love that develops between a mentally challenged young man and the older, lonely widow who takes him under her wing._IMDb / IMDb User Review : Simple Heartwarming Movie!!! - nifabs - May 05, 2005): I admire the simple way love is played in this movie, Candy Bergen is a striking actress with wit, experience and talent, while Tom McCarthy(Saint Maybe) gives a fair turn as the \"slow\" young man who falls for her and gets her to fall in love with him. TRIVIA : 01 A remake of the 1979 movie \"Tim,\" which starred Piper Laurie and Mel Gibson. The movie was adapted from Colleen McCullough's first novel of the same name. 02 Richard Kiley, who played Tim's father Ron, also played Paddy Cleary-a character in the mini-series adaptation of \"The Thorn Birds\" written by Colleen McCullough, who also wrote \"Tim,\" the book based on the original version of \"Mary & Tim.\" 03 Final film of Louise Latham. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed watching and have, therefore, uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. I do receive a huge amount of joy in sharing with you, these many 100s of free-to-you items I have uploaded, however, I have no wish to infringe on any existing copyright laws. DEF.gp ddh **",
      "fileSize": 307931388,
      "addedAt": "2026-01-07T00:09:46.428Z",
      "thumbnail": "https://archive.org/services/img/mary-tim-1996-5-star-drama-rom",
      "language": "eng",
      "year": 1996,
      "collection": "feature_films",
      "downloads": 1527
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.428Z"
}