{
  "imdbId": "archive-TheGreatTrainRobbery1903",
  "title": "The Great Train Robbery 1903",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGreatTrainRobbery1903",
      "title": "TheGreatTrainRobbery1903",
      "description": "In this silent short, bandits rob the passengers on a train in this pioneering western. In 1903, an employee of Thomas Edison's motion picture company produced a movie with a story. It was called \"The Great TrainRobbery.\" It told a simple story of a group of western criminals who steal money from a train. Later they are killed by a group of police in a gun fight. The movie was extremely popular. \"The Great TrainRobbery\" started the huge motion picture industry. The Great Train Robbery was directed and photographed by Edwin S. Porter - a former Thomas Edison cameraman. It was a primitive one-reeler action picture, about 10 minutes long, with 14-scenes, filmed in November 1903 - not in the western expanse of Wyoming but on the East Coast in various locales in New Jersey (at Edison's New York studio, at Essex County Park in New Jersey, and along the Lackawanna railroad). The precursor to the western film genre was based on an 1896 story by Scott Marble. The film's title was also the same as a popular contemporary stage melodrama. It was the most popular and commercially successful film of the pre-nickelodeon era, and established the notion that film could be a commercially-viable medium. The film was originally advertised as \"a faithful duplication of the genuine 'Hold Ups' made famous by various outlaw bands in the far West.\" The plot was inspired by a true event that occurred on August 29, 1900, when four members of George Leroy Parker's (Butch Cassidy) 'Hole in the Wall' gang halted the No. 3 train on the Union Pacific Railroad tracks toward Table Rock, Wyoming. The bandits forced the conductor to uncouple the passenger cars from the rest of the train and then blew up the safe in the mail car to escape with about $5,000 in cash. The film used a number of innovative techniques, many of them for the first time, including parallel editing, minor camera movement, location shooting and less stage-bound camera placement. Jump-cuts or cross-cuts were a new, sophisticated editing technique, showing two separate lines of action or events happening continuously at identical times but in different places. The film is intercut from the bandits beating up the telegraph operator (scene one) to the operator's daughter discovering her father (scene ten), to the operator's recruitment of a dance hall posse (scene eleven), to the bandits being pursued (scene twelve), and splitting up the booty and having a final shoot-out (scene thirteen). The film also employed the first pan shots (in scenes eight and nine), and the use of an ellipsis (in scene eleven). Rather than follow the telegraph operator to the dance, the film cut directly to the dance where the telegraph operator enters. It was also the first film in which gunshots forced someone to dance (in scene eleven) - an oft-repeated, cliched action in many westerns. And the spectacle of the fireman (replaced by a dummy with a jump cut in scene four) being thrown off the moving train was a first in screen history. In the film's fourteen scenes, a narrative story with multiple plot lines was told - with elements that were copied repeatedly afterwards by future westerns - of a train holdup with six-shooters, a daring robbery accompanied by violence and death, a hastily-assembled posse's chase on horseback after the fleeing bandits, and the apprehension of the desperadoes after a showdown in the woods. The steam locomotive always provided a point of reference from different filming perspectives. The first cowboy star, Gilbert M. 'Broncho Billy' Anderson played several roles: a bandit, a wounded passenger, and a tenderfoot dancer.",
      "id": "TheGreatTrainRobbery1903"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:36.649Z"
}