{
  "imdbId": "archive-ErfaniHossein0213796",
  "title": "Erfani Hossein 02 13796",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ErfaniHossein0213796",
      "id": "ErfaniHossein0213796",
      "title": "Erfani Hossein 02 13796",
      "description": "Erfani Hossein A Tribute to great Iranian artist and Voice Actors Hossein Erfani and Iran Bozorgmehri-Rad iran-daily.com & wikipedia One of the greatest Iranian voice actors Hossein Erfani died last year due to lung cancer. He was 76. Actor Hossein Erfani Parsaei, Voice of Bogart in Dubbed Movies, was an Iranian voice actor known for Persian voice-dubbing foreign films. Erfani was born on July 27, 1942 in Tehran. He acted in numerous films and series and for over five decades he dubbed voices of many renowned Iranian and international movie characters. Hossein Erfani started his career as a voice actor at the Moulin Rouge Studio in Tehran in 1961. He is known for dubbing over Humphrey Bogart roles in Maltese Falcon or Casablanca and Clark Gable role as Rhett Butler From Gone with the Wind. He has dubbed over some of Orson Welles, Marlon Brando, Charlton Heston, Gene Hackman, Toshiro Mifune, William Holden, Morgan freeman and Arnold Schwarzenegger's voice roles in films they starred in. He has also dubbed over Jahangir Forouhar's role in My Uncle Napoleon (Daie Jan Napoleon) Iranian Television serial in the 1970s. He lent his voice to the characters of many big names in cinema such as Arnold Schwarzenegger, Samuel L. Jackson, Morgan Freeman, Humphrey Bogart, Orson Welles, Marlon Brando, Liam Neeson and Harrison Ford. The veteran Iranian actor and voice artist began his acting career in 1974, playing a role in “Bitter and Sweet”, a popular TV serial directed by Mansur Pourmand. He was also known for Hormat-e Rafigh (1977) and Sim-e Khardar (1981). Erfani worked with voice actor and director Manuchehr Nozari in \"Friday morning with you\" and other radio programs in 1980s.",
      "fileSize": 28735901,
      "addedAt": "2026-01-07T00:06:19.370Z",
      "thumbnail": "https://archive.org/services/img/ErfaniHossein0213796",
      "collection": "feature_films",
      "downloads": 293
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.370Z"
}