{
  "movieId": "archive-leave-her-to-heaven-1945_202404",
  "title": "Leave Her To Heaven 1945: Gene Tierney, Cornel Wilde [Enhanced]",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/leave-her-to-heaven-1945_202404",
      "id": "leave-her-to-heaven-1945_202404",
      "title": "Leave Her To Heaven 1945: Gene Tierney, Cornel Wilde [Enhanced]",
      "description": "Leave Her to Heaven is about a man who gets caught in the crosshairs of a woman. Richard Harland (Cornel Wilde) is a young novelist who meets a socialite named Ellen Berent (Tierney) on a train. Berent becomes infatuated with Harland, and soon proposes to him. She adores him, but her love soon becomes a dangerous obsession. Berent decides that she won’t let anyone, whether it’s Harland’s disabled younger brother Danny (Darryl Hickman) or their unborn child, get in the way of her desire to have Harland all to herself.  Shot in Technicolor, filming took place in several locations in California, as well as Arizona and New Mexico in the summer of 1945. Principal photography of Leave Her to Heaven took place between May and August 1945. The production initially planned to shoot the lake and surrounding outdoor sequences in the Pacific Northwest states of Washington and Oregon, though the planned locations in the region were ultimately not utilized. Instead, these scenes were filmed in Northern California at Bass Lake in the Sierra Nevada. Additional photography took place in Monterey. The desert sequences that take place in New Mexico were filmed in several locations in Arizona, including Sedona, Flagstaff, and the Granite Dells north of Prescott. The sequences set in Warm Springs, Georgia were filmed at Busch Gardens in Pasadena, though long shots and process plates were shot on location at the actual Warm Springs Foundation.  In the decades following its release, Leave Her to Heaven garnered a cult following and has been the subject of film criticism for its unique blurring of genres, featuring elements of film noir, psychological thrillers, and melodramas. It has also been noted for its numerous visual and narrative references to figures in Greek mythology. The film's title is drawn from William Shakespeare's Hamlet, in which the Ghost urges Hamlet not to seek vengeance against Queen Gertrude, but rather to \"leave her to heaven, and to those thorns that in her bosom lodge to prick and sting her.\"",
      "fileSize": 2050305393,
      "addedAt": "2026-01-07T00:09:38.889Z",
      "thumbnail": "https://archive.org/services/img/leave-her-to-heaven-1945_202404",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 1196
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.889Z"
}