{
  "imdbId": "archive-PaulLaurenceDunbarSunset",
  "title": "Paul Laurence Dunbar Sunset",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PaulLaurenceDunbarSunset",
      "title": "PaulLaurenceDunbarSunset",
      "description": "Paul Laurence Dunbar (June 27, 1872 – February 9, 1906) was an African-American poet, novelist, and playwright of the late 19th and early 20th centuries. Much of his popular work in his lifetime used a Negro dialect, which helped him become one of the first nationally-accepted African-American writers. Much of his writing, however, does not use dialect; these more traditional poems have become of greater interest to scholars. Dunbar was born in a home at 311 Howard Street in Dayton, Ohio on June 27, 1872. His parents had escaped from slavery in Kentucky; his father was a veteran of the American Civil War, having served in the 55th Massachusetts Infantry Regiment and the 5th Massachusetts Colored Cavalry Regiment. Dunbar was born six months into their marriage; their wedding was Christmas Eve, 1871. Dunbar's parents, Joshua and Matilda, began having marital problems a few months after their son's birth. After the birth of her daughter, who was ignored by Joshua, Matilda took the children, including two from a previous marriage, and left him. Joshua died in 1884 when Dunbar was 12 years old. Dunbar was the only African-American student during the years he attended Dayton's Central High School, and he participated actively as a student. During high school, he was both the editor of the school newspaper and class president, as well as the president of the school literary society. He wrote his first poem at age 6 and gave his first public recital at age 9. His mother Matilda assisted him in his schooling, having learned how to read expressly for that purpose. She often read the Bible with him and thought he might become a minister for the African Methodist Episcopal Church. Dunbar's first professionally published poems were \"Our Martyred Soldiers\" and \"On The River\", published in Dayton's The Herald newspaper in 1888. In 1890 Dunbar wrote and edited Dayton's first weekly African-American newspaper, The Tattler, printed by the fledgling company of his high school acquaintances Wilbur and Orville Wright. The paper lasted only 6 weeks. When his formal schooling ended in 1891, Dunbar took a job as an elevator operator, earning a salary of four dollars a week. The next year, Dunbar asked the Wrights to publish his dialect poems in book form, but the brothers did not have the facility to do so. Dunbar was directed to the United Brethren Publishing House which, in 1893, printed Dunbar's first collection of poetry, Oak and Ivy. Dunbar subsidized the printing of the book himself, though he earned back his investment in two weeks by selling copies personally, often to passengers on his elevator. The larger section of the book, the \"Oak\" section, consisted of traditional verse whereas the smaller section, the \"Ivy\", featured light poems written in dialect.",
      "id": "PaulLaurenceDunbarSunset"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:24.155Z"
}