{
  "imdbId": "archive-TAUSEND_SCHERBEN",
  "title": "1997 Tausend Scherben - Die Grosse Baustelle (Thousand shards - The large Construction site)",
  "year": 1997,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TAUSEND_SCHERBEN",
      "title": "TAUSEND SCHERBEN",
      "description": "With Xu Lu Jing und Familie, Du Hai, Chen Feng, Liu Shulan, Chen Xiaoling, Jiang Shi Hiong, Zhang Hua Xun, Fu Si, Xie Ting Kui, Bao Gen Hai, Dian Xie Lian, Wang Hannuo u.v.a. As throug a trip with a Chinese student by an unexpected event a portait of China arises. Preamble of \"Thoudend shards\": Xu Lu Jing wanted to go to Germany. In a booklet he had discovered a flaw: The Art Academy Münster. It became his loophole. Although I was convinced that it was not about art, I let him come. Right from the beginning he raved about the cooperation between our countries. In China he had already shot 70 films. In Germany, he earned his life with the sale of shackles and ship chains. Our students he did not take seriously. So these also did not accept him. He made Me a \"friend for a hundred years\". For a month he carried me through large parts of the People's Republic with the help of two interpreters. He arranged screenings of my films on video in the Association of filmmakers, in front of students of the Beijing Television and Film Academy and arranged the visit of Cinecitta in Beijing He gave me an insight view into the professional lives of his friends and his acquaintances, in factories, apartments and tourist highlights. Tired from the trip, I fell on the hotel bed. In my ears a beguiling music like a thousand bells or broken shards in the wind. I jumped up and look down from the 8th floor: Countless workers carved with iron bars and axes like a thousand years ago a huge foundation in the rock, day and night. My Hi8 cheered: The most beautiful sounds - the hardest work. In this way I had the first idea for a film about my journey through the People's Republic of China. Above all the film floats the sound of the work from the large construction site in Chongquing. (LUTZ MOMMARTZ)",
      "id": "TAUSEND_SCHERBEN"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:04:36.174Z"
}