{
  "movieId": "archive-dictatorlandseries11.kazakhstan",
  "title": "Dictatorland Series 1 1. Kazakhstan",
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dictatorlandseries11.kazakhstan",
      "id": "dictatorlandseries11.kazakhstan",
      "title": "Dictatorland Series 1 1. Kazakhstan",
      "description": "All credit goes to BBC and respective owners/producers - people who made the documentary. I receive no (and shall not receive any) profit whatsoever for these videos. These are published in the name of freedom of information and expression. The original description and credits follow: Series 1: 1.Kazakhstan In this episode, Ben Zand travels to Kazakhstan to experience the sinister and at times bizarre side to living in a dictatorship. Beginning his journey in the capital city Astana, he finds a wealthy country. In the Bayterek Tower - the national symbol of Kazakhstan - Ben places his hand in a golden handprint of the president, where he's told he can make a wish. But he also finds that he's being quietly accompanied by a minder to keep an eye on him. Deciding to get out of town, Ben takes the overnight train across the country to Kazakhstan's largest city, Almaty. It's Independence Day, celebrating 25 years since the end of Soviet rule, so Ben is keen to see some of the festivities. But instead, because the government is nervous of protests, Ben is hurried out of town by the local mayor's office and forced to spend the day being shown around a nearby ski resort, where his minders provide him with fascinating facts on the size of the ski lift and the speed of the ice. It's a fun day out, but it isn't really what Ben had in mind. So to try and find out more about the other side of life here, Ben goes to a dissidents' gathering, where he meets Zhanbolat Mamay, who runs one of the few remaining independent newspapers in Kazakhstan. Zhanbolat explains the fear that he lives in, and how journalists and politicians have reason to be scared for their lives. He recommends that Ben travels to the west of Kazakhstan, and a town called Zhanaozen, if he wants to get a real sense of the anti-government sentiment in the country. Ben travels to Zhanaozen with a lawyer called Asel, who has spent years fighting for compensation for residents in Zhanaozen, many of whom lost friends and relatives, and many others of whom were injured, when the local police massacred 16 striking oil workers in 2011. Asel takes Ben to meet two victims of the massacre. But as the sun sets, heavily armed police flock onto the streets - even five years after the massacre, the town is still more or less under curfew. When Ben gets back to his hotel, he's terrified to discover that the secret police are looking for him. It's a scary end to a journey in a country where the government still seems to have a lot to hide. Programme website: https://www.bbc.co.uk/programmes/b08n... Credits: https://www.bbc.co.uk/programmes/p04x... Presenter Ben Zand Series Producer Olly Bootle Executive Producer Mike Radford",
      "fileSize": 293284474,
      "addedAt": "2026-01-07T00:08:07.355Z",
      "thumbnail": "https://archive.org/services/img/dictatorlandseries11.kazakhstan",
      "collection": "feature_films",
      "downloads": 166
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.355Z"
}