{
  "imdbId": "archive-rebel-highway-complete-series-of-films",
  "title": "Rebel Highway complete series of films",
  "year": 1994,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rebel-highway-complete-series-of-films",
      "id": "rebel-highway-complete-series-of-films",
      "title": "Rebel Highway complete series of films",
      "description": "Rebel Highway was a short-lived series of made for tv movies created and produced in 1994 for Showtime. The concept was a 10-week series of 1950s \"drive-in classic\" B-movies remade \"with a '90s edge.\" Included are all 10 films, all of which are 480p except for Roadracers which is 1080p since it was the only one released on Blu-ray as far as I know. Roadracers   (directed by Robert Rodriguez) - Cynical look at a 1950s rebellious Rocker who has to confront his future, thugs with knives, and the crooked town sheriff. Confessions of Sorority Girls  (directed by Uli Edel) - A spoiled little rich girl arrives at Sorority High with studying the last thing on her mind. Spreading malicious rumours and splitting people up are just some of the things she finds amusing. Her behavior not surprisingly though, starts to alienate her from her fellow classmates. Motorcycle Gang (directed by John Milius) - Cal and his family are driving to their new home in California and are terrorized by a motorcycle gang along the highway. Runaway Daughters (directed by Joe Dante) - Angie, Mary, and Laura are teenage girls who are fed up with their bland and unexciting small town lives. Mary discovers that she's pregnant after having sex with her boyfriend. Girls in Prison (directed by John McNaughton) - Framed for the murder of a record company president in 1952 Hollywood, young, aspiring singer Aggie O'Hanlon is sentenced to life in prison and tries to adjust to her life life behind bars in a hellish womens prison where she is befriended by other \"lifer\" inmates who help her out when Aggie finds herself marked for murder by an unknown source who thinks she knows more about the murder than she does. Shake, Rattle and Rock! (directed by Allan Arkush) - As the rock 'n' roll craze sweeps across America, a rebellious young woman sets out to prove the new fad is here to stay. She and her friend start their own band and open a hoppin' nightclub where the local teens can hang out. Dragstrip Girl (directed by Mary Lambert) - Johnny is a bad guy who is trying to go straight and becomes smitten with Laura, a wealthy good girl who is rebelling against her parents by pretending to go steady with him, all set among the backdrop of 1950s Los Angeles. Jailbreakers (directed by William Friedkin) - A 1950s high school cheerleader meets a leather clad rebel biker and goes out on the town with him. When he steals an item of jewellery he gets thrown in prison but not for long. He makes a desperate escape and he is determined to catch up with his lost love and re-new their criminal activities. Cool and the Crazy (directed by Ralph Bakshi) - Michael and Roslyn are high school sweethearts who are now married with children in their early 20's. Roslyn's friend, Joannie, convinces her to have an affair with bad boy Joey. Joey is a very bad boy. Reform School Girl (directed by Jonathan Kaplan) - She does more than just make friends while inside, she starts a lesbian love affair that draws the wrath of the warden, an ex-Olympic athlete who looks for track and field capabilities in her girls. Meanwhile the rat of a boy friend she protected threatens her younger sister to force her to maintain her silence.",
      "fileSize": 18375167252,
      "addedAt": "2026-01-07T00:10:30.753Z",
      "thumbnail": "https://archive.org/services/img/rebel-highway-complete-series-of-films",
      "language": "eng",
      "year": 1994,
      "collection": "feature_films",
      "downloads": 12885
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.753Z"
}