{
  "movieId": "archive-maddalena-1971-lisa-gastoni-eric-woofe-ivo-garrani-paolo-gozlino-barbara-lilavin",
  "title": "Maddalena 1971 Lisa Gastoni, Eric Woofe, Ivo Garrani, Paolo Gozlino, Barbara Lilavin, Lucia Alberti, Ermelinda De Felice, Vera Drudi, Rosita Torosh + Jerzy Kawalerozicz",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/maddalena-1971-lisa-gastoni-eric-woofe-ivo-garrani-paolo-gozlino-barbara-lilavin",
      "id": "maddalena-1971-lisa-gastoni-eric-woofe-ivo-garrani-paolo-gozlino-barbara-lilavin",
      "title": "Maddalena 1971 Lisa Gastoni, Eric Woofe, Ivo Garrani, Paolo Gozlino, Barbara Lilavin, Lucia Alberti, Ermelinda De Felice, Vera Drudi, Rosita Torosh + Jerzy Kawalerozicz",
      "description": "Jerzy Kawalerowicz's 1971 film Maddalena involves a woman trying to seduce a priest for some reason. Does not make sense to me, she has no problem finding lovers so why the priest? At any rate, the film is beautifully shot in that European style of rich colors and careful settings. If you like looking at Lisa Gastroni, then this is your film as she appears with jet black hair and as a blonde in some flashbacks. In one flashback she is being chased by a pack of dogs which turns into a pack of young men in suits. The film has an Italian/Yugoslavian origin but was released in the USA two years before the Italian release. It may be set in South Africa as the beginning of the film takes place on New Year's Eve and the streets are littered with furniture, apparently this is a South African thing? The symbolism is beyond me, I am too far culturally removed from the time and place of the film and not enough of a student of filmaking to understand what Jerzy is trying to say.",
      "fileSize": 2546531619,
      "addedAt": "2026-01-07T00:09:46.421Z",
      "thumbnail": "https://archive.org/services/img/maddalena-1971-lisa-gastoni-eric-woofe-ivo-garrani-paolo-gozlino-barbara-lilavin",
      "language": "eng",
      "year": 1971,
      "collection": "feature_films",
      "downloads": 1949
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.421Z"
}