{
  "imdbId": "tt0053103",
  "title": "Battle Beyond the Sun",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BattleBeyondTheSun",
      "title": "Battle Beyond The Sun",
      "description": "The space race is on between two countries. Who's going to land on mars first? Look for the scene with two goofy looking monsters battling on an asteroid.",
      "id": "BattleBeyondTheSun"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R7Zp0BNQ3IU",
      "title": "Battle Beyond The Sun (1959) [Science Fiction] [Adventure]",
      "description": "Battle Beyond the Sun is the English-dubbed, re-edited U.S. version of Nebo Zovyot, a 1959 Soviet science fiction film directed by Mikhail Karyukov and Aleksandr Kozyr. It tells of the \"space race\" of two future nations competing to become the first to land a spacecraft on the planet Mars.\n\nRoger Corman acquired the film for US distribution and hired a young film-school student named Francis Ford Coppola to Americanize it. In addition to preparing a dubbing script free of anti-American propaganda and all references to the USSR, and supervising the dubbing, Coppola slightly re-edited the footage, eliminated the framing \"daydream\" sequences, and even saw to it that a pastel rhombus shape was matted in on a shot-by-shot basis, to cover the Cyrillic letters CCCP (USSR) which adorned the space station and Soviet rocketships.\n\nCoppola also had filmed a few shots of two space monsters fighting and cut them into the Soviet material. According to Jack Hill, who worked on the new version (it was his first paid job for Roger Corman), Coppola's idea was that one monster would look like a penis and the other a vagina. The new monster scenes were shot on a sound stage in Hollywood. Hill and Coppola also shot some footage of the Rose Parade at Pasadena.\n\nThe film opens with a non-sequitur prologue in which a narrator voice explains space flight concepts. Models of space craft \"currently under development by the United States Government\" are shown in succession. The narrator usefully explains that \"the motion picture you are about to see may be called 'a fantasy of the future'.\"\n\nThe time: November 1997. In the \"fear-ridden years following the great atomic war\", the world has been divided into northern and southern hemispheres. The two countries, North Hemis and South Hemis, are clearly analogues for the United States and Soviet Union. The camera zooms in toward the South Hemis banner. Dr. Albert Gordon and his wife, Dr. Ruth Gordon, currently head the top secret \"Project Red Planet\" for South Hemis. (The footage we see is dubbed from the original Russian-Soviet; names have been Anglicized.) A space mission – more re-purposed footage – blasts off for an orbiting space station. The mission docks with the station, delivering the Gordons as well as Astronaut Craig Matthews.\n\nSouth Hemis has been developing the Mercury, a spacecraft which should be able to complete a mission to Mars. Solar and orbital conditions are favorable. Suddenly, another spacecraft is detected approaching the station. It is from North Hemis. It requests and receives permission to land for emergency repairs. The two North Hemis astronauts – Captain Torrance and his co-pilot Dr. Martin – are treated to dinner by their South Hemis hosts. Dr. Gordon reveals that they themselves are about to commence a flight to Mars. The two North Hemis astronauts decide to end dinner, because \"it's getting late\".\n\nCaptain Torrance confers with his superiors in North Hemis. He wants to preempt the South Hemis flight to Mars with their own mission. Meanwhile, Dr. Martin meets with Dr. Gordon to discuss both missions. The North Hemis astronaut refuses to divulge any information about the North Hemis plan. Captain Torrance says, \"I cannot accept defeat.\" He disconnects from his North Hemis superiors and barges in on the meeting between Dr. Martin and Dr. Gordon. Outside in the corridor, Captain Torrance decides to proceed with the flight to Mars anyway. \"Our repairs may not hold up,\" says Dr. Martin. They decide to commandeer their rocketship – the Typhoon – under cover of trying to repair it. They blast off at full power. Paul Clinton, a South Hemis astronaut, is caught in the rocket back blast and is injured. Meanwhile, the Typhoon sets course for Mars.\n\nPaul Clinton is diagnosed with a concussion and cannot go on the Mars mission; Dr. Gordon will go with Craig Matthews. The Mercury launches. Meanwhile, the Typhoon encounters a meteor storm, and its course veers dangerously close to the sun. The ship is disabled. The Mercury locates the Typhoon and eventually intercepts it. Matthews effects an EVA transfer of the two North Hemis astronauts. The South Hemis ship abandons the Typhoon to space ...\n\n---\n\nDirected by Mikhail Karyukov, Aleksandr Kozyr, Francis Ford Coppola (additional sequences US version), produced by Roger Corman (US version), written by Mikhail Karyhukov, Yevgeni Pomeshchikov and Aleksei Sazonov, starring Aleksandr Shvorin Ivan Pereverzhev. \n\n---\n\nSource: \"Battle Beyond the Sun\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 April 2017. Web. 02 May 2017. https://en.wikipedia.org/wiki/Battle_Beyond_the_Sun\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "id": "R7Zp0BNQ3IU",
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "77 min",
    "imdbRating": "4.4",
    "imdbVotes": "1,165",
    "Genre": "Adventure, Sci-Fi",
    "Plot": "Battle Beyond the Sun is the English-dubbed and re-edited U.S. version of Nebo Zovyot, a 1959 Soviet science fiction film directed by Mikhail Karyukov and Aleksandr Kozyr. It tells of the \"space race\" of two future nations competing to become the first to land a spacecraft on the planet Mars.",
    "Director": "Mikhail Karyukov, Aleksandr Kozyr, Francis Ford Coppola",
    "Writer": "Aleksey Sazonov, Evgeniy Pomeshchikov, Mikhail Karyukov",
    "Actors": "Ivan Pereverzev, Aleksandr Shvorin, Konstantin Bartashevich",
    "Language": "Russian",
    "Country": "Soviet Union",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0052667",
      "title": "Caltiki, the Immortal Monster",
      "year": 1959,
      "imdbRating": "5.9",
      "imdbVotes": "1,743",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052702",
      "title": "The Cosmic Man",
      "year": 1959,
      "imdbRating": "4.8",
      "imdbVotes": "693",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053944",
      "title": "The Incredible Petrified World",
      "year": 1959,
      "imdbRating": "3.1",
      "imdbVotes": "1,349",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051507",
      "title": "Curse of the Faceless Man",
      "year": 1958,
      "imdbRating": "4.8",
      "imdbVotes": "1,257",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051638",
      "title": "From the Earth to the Moon",
      "year": 1958,
      "imdbRating": "5.1",
      "imdbVotes": "1,875",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054387",
      "title": "The Time Machine",
      "year": 1960,
      "imdbRating": "7.5",
      "imdbVotes": "47,044",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0055294",
      "title": "The Phantom Planet",
      "year": 1961,
      "imdbRating": "3.9",
      "imdbVotes": "3,524",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050622",
      "title": "The Land Unknown",
      "year": 1957,
      "imdbRating": "5.7",
      "imdbVotes": "2,092",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0247746",
      "title": "Supersonic Saucer",
      "year": 1956,
      "imdbRating": "5.5",
      "imdbVotes": "184",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049223",
      "title": "Forbidden Planet",
      "year": 1956,
      "imdbRating": "7.5",
      "imdbVotes": "55,938",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0056352",
      "title": "Planeta bur",
      "year": 1962,
      "imdbRating": "6.3",
      "imdbVotes": "1,511",
      "language": "Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046065",
      "title": "Menace from Outer Space",
      "year": 1956,
      "imdbRating": "3.8",
      "imdbVotes": "386",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:14.038Z"
}