{
  "imdbId": "tt0011741",
  "title": "Suds",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Suds_1920",
      "id": "Suds_1920",
      "title": "Suds",
      "description": "From IMDb : A London laundry woman tries to rise above her station in order to capture the love of a wealthy young man, and thus misses out on the truer love of one of her own class. Stars: Mary Pickford, Albert Austin, Harold Goodwin, Rose Dione, and Lavendor the Horse",
      "fileSize": 1255476178,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/Suds_1920",
      "language": "English",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 18016
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k-OXXzrhkoI",
      "id": "k-OXXzrhkoI",
      "title": "Suds (1920) | Colorized Public Domain Silent Comedy with Mary Pickford and Albert Austin",
      "description": "Suds (1920) is a silent romantic comedy directed by John Francis Dillon and produced by United Artists, starring Mary Pickford, one of the most iconic figures of early Hollywood. This colorized and restored edition revives a film that mixes humor, romance, and social commentary, making it both entertaining and historically significant. By presenting it in modern quality and color, Colorized Public Domain ensures that audiences in the United States, Europe, and worldwide can rediscover Mary Pickford’s timeless charm and the silent era’s artistry.\n\nPlot Summary:\nThe story follows Amanda Afflick (Mary Pickford), a poor and naive London laundry girl who spends her days washing clothes at a grimy shop. She dreams of a better life, often imagining herself in a romantic relationship with her wealthy customer Horace Greensmith (Albert Austin). Amanda’s fantasies provide a comedic counterpoint to her dreary existence, but her world is filled with hardship, ridicule, and loneliness.\nThe turning point comes when she adopts a neglected horse that arrives at the laundry with no owner willing to care for it. Her compassion and determination to keep the animal despite her poverty symbolize her resilience and goodness. Meanwhile, Amanda’s hopes for love and belonging are tested as she struggles to escape the confines of her social class. The film combines slapstick moments with heartfelt drama, making it both humorous and emotionally engaging.\n\nCast and Crew:\n• Director: John Francis Dillon\n• Producer: Mary Pickford, United Artists\n• Screenplay: John Francis Dillon, Waldemar Young (adaptation)\n• Based on: “’Op o’ Me Thumb” by Frederick Fenn and Richard Pryce\nStarring:\n• Mary Pickford as Amanda Afflick\n• Albert Austin as Horace Greensmith\n• Harold Goodwin as Benjamin Pillsbury\n• Rose Dione as Madame Didier\n• Charles Belcher as Mr. Bartlett\n• Zasu Pitts as Laundry Girl\n\nFilm Significance:\nSuds reflects the themes of class struggle and fantasy versus reality that were common in early 20th-century cinema. Mary Pickford, known as “America’s Sweetheart,” delivers a performance that combines physical comedy with emotional vulnerability, solidifying her reputation as one of the greatest silent film stars. Her work in Suds also highlights her power as a producer at United Artists, the groundbreaking studio she co-founded with Charlie Chaplin, D.W. Griffith, and Douglas Fairbanks. While not as widely remembered as Pickford’s most famous roles, Suds remains important as an example of her versatility and her appeal to both working-class and middle-class audiences of the era.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Suds remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nOriginally released in 1920 as a black-and-white silent comedy, Suds carried the charm of Mary Pickford’s star power but, like many silent films, can be overlooked by modern audiences. By offering a carefully colorized and digitally restored edition, we bridge the gap between historical authenticity and contemporary entertainment standards. This version makes Suds more accessible while honoring its place in cinematic history.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Silent Era through the Golden Age of Hollywood, from slapstick comedies to dramas and forgotten gems. Our mission is to keep these cultural treasures discoverable and enjoyable for audiences in the USA, Europe, and beyond.\n\n#Suds1920 #MaryPickford #SilentComedy #PublicDomainFilm #ColorizedClassic #SilentEra #FilmRestoration #UnitedArtists #JohnFrancisDillon #1920sMovies",
      "addedAt": "2025-12-24T00:48:14.171Z",
      "thumbnail": "https://i.ytimg.com/vi/k-OXXzrhkoI/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYciBSKEMwDw==&rs=AOn4CLDY5YGdwzm6hiLEOtAytPwq1oeXjg",
      "duration": 3855,
      "language": "en",
      "year": 1920,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "75 min",
    "imdbRating": 6.3,
    "imdbVotes": 294,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Amanda Afflick, a laundress with a romantic imagination, weaves a story about a shirt brought to the laundry eight months earlier by Horace Greensmith. She tells her fellow workers that the shirt belongs to her fiancé, Sir Horace, to whom her father objected and expelled from their castle, but who will one day return. While waiting for her lord, Amanda saves Lavender, the old laundry horse, from the glue factory and takes her home with her but is ousted the following morning by indignant tenants. Luckily, Lady Burke, a philanthropist, comes to Lavender's aid by providing her a home on the Burke country estate. Although the laundry driver Ben Pillsbury pines for Amanda, she ignores him, preferring to wait instead for Lord Horace. When Greensmith finally arrives for his shirt, Amanda pleads with him to pretend that he is her lover and he agrees, but later, realizing how shabby she looks, he discards her. He leaves Amanda, her romantic dreams shattered, sobbing, while Ben waits outside the laundry, disconsolate.",
    "Director": "John Francis Dillon",
    "Writer": "Waldemar Young, Richard Bryce, Frederick Fenn",
    "Actors": "Mary Pickford, Albert Austin, Harold Goodwin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0011652",
    "tt0010806",
    "tt0011960",
    "tt0012122",
    "tt0010227",
    "tt0012928",
    "tt0011588",
    "tt0022149",
    "tt0022242",
    "tt0014497",
    "tt0010040",
    "tt0012755"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.269Z"
}