{
  "movieId": "tt0079020",
  "title": "Que Viva Mexico",
  "year": 1979,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5rknic8PmWI",
      "id": "5rknic8PmWI",
      "title": "Que Viva Mexico",
      "description": "¡Que viva México! is an unfinished movie by Sergei Eisenstein made between 1931 and 1932. The movie was conceived as a broad picture of life in Mexico in different eras and under different social systems. Eisenstein formulated the idea of the movie as follows: ¡Que viva México! is the history of the shifts of culture, given not vertically, in years and centuries, but horizontally, in the order of the geographical cohabitation of the most diverse stages of culture side by side - a unique feature of Mexico where provinces of reigning matriarchy (Tehuantepec) border regions of communism almost achieved in the revolution of the 1910s (Yucatan, Zapatismo, etc.). \n\nThe making of Long Live Mexico has a fascinating history. In the autumn of 1929, a group of Soviet filmmakers headed by Eisenstein went to Hollywood, where they were supposed to learn the technique of sound cinema and produce a movie for Paramount Pictures. American and Mexican friends, including the famous artists Diego Rivera and David Siqueiros, writers Theodore Dreiser and Upton Sinclair, offered Eisenstein’s group an exciting idea with funding to shoot a feature movie about life in Mexico. \n\nIn its original form, the movie consisted of two novellas, Sandunga and Maguey, and three episodes framing the novellas, the Prologue, the Spanish-Catholic Mexico scenes, and the Epilogue. \n\nThe Prologue shows scenes of ancient Mexico, temples, and pyramids. Sandunga is an idyllic novella about matriarchal pre-colonial Mexico. The plot slowly unfolds around a young Indian couple. This novella was filmed in Oaxaca. \n\nNext, the viewer is introduced to Mexico after the Spanish conquest, which brought lavish festivities and the worship of the Blessed Virgin. Eisenstein managed to film the celebration of the 400th anniversary of the miraculous icon of Our Lady of Guadalupe, the patron saint of Mexico. He depicted here the self-torture of penitents, pilgrim processions, religious dances, and bullfighting. \nThe second novella is called Maguey, Agave maguey juice is used to make pulque. The novella is set on a maguey plantation during the dictatorship of Porfirio Diaz. The audience is presented with pictures of the hard work and suffering of peons. A drunken guest of the hacienda owner takes peon Sebastian’s beloved girl away from him. But the peon decides to take revenge and burns down the owner’s estate with the help of his three friends. However, the peons are caught and end up with a painful execution, buried up to their necks in the sand and trampled by horses. \n\nThe last and climactic novella, Soldadera, revolving around the Mexican Revolution, was not finished. As conceived by the director, it would tell the story of a girl named Pancha, the wife of a soldier of the Constitutional Army of Venustiano Carranza. Along with the other soldier’s wives, soldaderas who cook food for the troops and care for the wounded, she accompanies her husband on the campaigns. Her husband is killed on the battlefield, and Pancha becomes the wife of the enemy - a soldier fighting on Zapata’s side. It turns out that Pancha not only switches a husband but also joins another army, with which she enters Mexico City after joining Villa’s troops. In this way, Pancha embodies Mexico itself, driven by the fratricidal war between the various revolutionary forces. This novella would thus cap one of the themes of the movie - the relationship between a man and a woman - from a serene pastime in the pre-colonial era, to fighting for their rights in the feudal era, to ultimately fighting shoulder-to-shoulder in the revolution.\n \nThe last episode was supposed to be an Epilogue to celebrate the Day of the Dead. The viewer sees a parade of people dressed in skeleton costumes. There are skulls in tricornes of generals and ministers, skulls in toppers, and skeletons in bishop’s vestments. People in death masks dance to the sound of the rumba. But they take off their masks, and we see the faces of children, peons, and laborers. \n\nAt various times, 80,000 meters of footage shot by Eisenstein’s group were edited into feature films Thunder over Mexico and Time under the Sun. Selected footage has been used in various films, such as Viva, Villa! In 1955, Sinclair donated the entire negative to the collection of the Museum of Modern Art in New York. Due to Sergei Eisenstein’s problems with the Soviet authorities and Stalin in particular, Soviet viewers saw Long Live Mexico! Only after the director died in 1979. Eisenstein’s co-director Grigori Alexandrov edited a version close to the original idea. \n\nYear of production: 1932, 1978 \n\nDirected by: Sergei Eisenstein, Grigori Alexandrov, Nikita Orlov\nWritten by: Grigory Alexandrov,Sergei Eisenstein\nDirectors of photography: Eduard Tisse, Nikolai Olonovsky\nMusic: Yury Yakhushev\nProduction designer: Yury Sobolev\nStarring: Sergei Bondarchuk (voiceover), Grigory Alexandrov (cameo)\n\n#Mexican_history #Film_history #Sergei_Eisenstein #FullMoviesWithEngSubs",
      "addedAt": "2025-12-23T03:45:59.067Z",
      "thumbnail": "https://i.ytimg.com/vi/5rknic8PmWI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAhRlCpOIqQpE_fRZ7GpifXEzzb-A",
      "duration": 5053,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "90 min",
    "imdbRating": 7.4,
    "imdbVotes": 1912,
    "Genre": "Documentary, Drama, Western",
    "Plot": "Eisenstein shows us Mexico in this movie, its history and its culture. He believes, that Mexico can become a modern state.",
    "Director": "Sergei Eisenstein",
    "Writer": "Grigoriy Aleksandrov, Sergei Eisenstein",
    "Actors": "Sergey Bondarchuk, Grigoriy Aleksandrov",
    "Language": "Russian",
    "Country": "Soviet Union",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0015361",
    "tt0015648",
    "tt0077327",
    "tt0084239",
    "tt0037824",
    "tt0082443",
    "tt0074719",
    "tt0076261",
    "tt0073076",
    "tt0464185",
    "tt7320904",
    "tt0121791"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-23T04:02:55.425Z"
}