{
  "movieId": "tt0022756",
  "title": "¡Que viva Mexico!",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/QuevivaMexico",
      "id": "QuevivaMexico",
      "title": "Que Viva Mexico",
      "description": "Sergei Eisenstein shot ¡Que viva México! in Mexico in 1931 at the height of the Great Depression. The courageous financiers of this project were the author Upton Sinclair, his wife Mary Craig and a small group of their friends. They had great difficulties in keeping the production going; the economic crisis forced Sinclair to call a halt to it in early 1932. Shooting was stopped with most of the work completed; only one episode could not be filmed. At the same time Josef Stalin insisted on Eisenstein's return to the Soviet Union. Eisenstein left Mexico with Sinclair's promise in mind; that all the negatives would be send to him to enable the final editing of the film in Moscow. Sinclair tried several times in vain to transfer the film footage to Russia, but the Soviet Film Industry was instructed not to import the film. Eisenstein had been denounced both as a political renegade and as a Trotskyite, which was, in the eyes of Stalin, a serious offence. Preventing Eisenstein from finishing his Mexican film was Stalin's punishment. Consequently Eisenstein was left without film work for several years and started teaching at the State Film School. The Stalinist propaganda, which heaped all the blame on Upton Sinclair for the tragic end of ¡Que viva México!, prevailed. Two films utilizing Eisenstein's film footage were made with Upton Sinclair's permission: Thunder over Mexico made in 1933 by Sol Lesser and Time in the Sun, made by Mary Seton in 1939/40. Thanks to the foresight of Sinclair, who in the 1950s deposited the unedited materials of Eisenstein's film with the Museum of Modern Art in New York, and the subsequent work of Jay Leyda to make them accessible, all is not lost. We are sure that seventy years of archival care and investment in preserving the essence of this film will eventually result in an authentic reconstruction of this lost film. Many film-historians are convinced that ¡Que viva México! is one of Eisenstein's greatest films. ¡Que viva México! stood at the crossroads of Eisenstein’s artistic development and at a crucial point in the evolution of the art of the cinema. This work deserves more than any other to be taken out of the archives, to be appreciated by a new generation! It is a treasure waiting to be discovered.",
      "fileSize": 1417968697,
      "addedAt": "2026-01-07T00:06:45.468Z",
      "thumbnail": "https://archive.org/services/img/QuevivaMexico",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 386268
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "88 min",
    "imdbVotes": null,
    "Genre": "History",
    "Plot": "Having revolutionized film editing through such masterworks of montage as Potemkin and Strike, Soviet director Sergei Eisenstein emigrated west in hopes of testing the capabilities of the American film industry.",
    "Director": "Grigoriy Aleksandrov, Sergei Eisenstein",
    "Writer": "Grigoriy Aleksandrov",
    "Actors": "Félix Balderas, Sara García, Martín Hernández",
    "Language": "N/A",
    "Country": "United States, Mexico",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0018217",
    "tt0227607",
    "tt0024473",
    "tt0023888",
    "tt0024548",
    "tt0024966",
    "tt0024962",
    "tt0174450",
    "tt0025746",
    "tt0025272",
    "tt0250652",
    "tt0020030"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.468Z"
}