{
  "movieId": "tt0058859",
  "title": "Star Pilot",
  "year": 1966,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/StarPilot",
      "id": "StarPilot",
      "title": "StarPilot",
      "description": "“Unbelievably bad but hilarious” “Fun dreadful” “Gets better as it gets stupider” “I’m speechless!” (IMDB reviews quotes). If ever there was a movie that’s so bad it’s good it’s this spaghetti space opera that seems like it was thrown together by escapees from an asylum for deranged Italian movie producers. The absurd girls’ “uniforms” are a treat for dirty old men. The senseless dubbed dialog defies logic, and of course there are the half-dozen guys in gorilla suits. It’s a genuine treasure for all the wrong reasons that ranks with the best of Ed Wood's and Phil Tucker's hilarious worst. IMDB rating 4.4, MPAA PG. Directed by Pietro Francise. Released in 1966 (IT). Complete print (2nd release). Dubbed English AKA “2+5: Mission Hydra” CAST NOTE: Yes that’s Casey Kasem in a clip lifted from “Doomsday Machine.” ",
      "addedAt": "2025-12-23T03:53:38.520Z",
      "thumbnail": "https://archive.org/services/img/StarPilot",
      "collection": "feature_films",
      "downloads": 8503
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "91 min",
    "imdbRating": 4.3,
    "imdbVotes": 687,
    "Genre": "Adventure, Sci-Fi",
    "Plot": "Aliens from the constellation Hydra crash-land on the island of Sardinia. A prominent scientist, his daughter, several young technicians, and a pair of Oriental spies are taken hostage by the beings so they can use them to repair their spaceship's broken engine. With that done, they take off towards their home planet, taking the earthlings with them. However, the humans attempt to mutiny against their captors, inadvertently sending their tiny spaceship hurtling into the infinite beyond...",
    "Director": "Pietro Francisci",
    "Writer": "Ian Danby, Pietro Francisci, Fernando Paolo Girolami",
    "Actors": "Leonora Ruffo, Mario Novelli, Roland Lesaffre",
    "Language": "Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0062360",
    "tt0059887",
    "tt0059346",
    "tt0057860",
    "tt0336004",
    "tt0063790",
    "tt0064639",
    "tt0056352",
    "tt0006333",
    "tt0149677",
    "tt0079285",
    "tt0068713"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-27T19:36:23.776Z"
}