{
  "imdbId": "tt0046468",
  "title": "Wife",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/wife_20201211",
      "id": "wife_20201211",
      "title": "Wife",
      "description": "A novel by Fumiko Hiyashi provided that basis for this unusual work by Mikio Naruse -- Wife (aka Tsuma) (1953) tells the story of a decade-old marriage in the process of disintegrating. Opening and closing with the same sequence of the husband silently leaving home, the real focus of the story -- as with more Naruse films -- is the wife, who decides to take desperate measures to try and hold her marriage together, including foresaking her accepted obligations. The result is a drama with some near-comical, battle-of-the-sexes type overtones that are unusual for Naruse, though the tone is still rooted in domestic tragedy and the message seems to be a wider-ranging one concerning the stresses of life in postwar Japan.",
      "fileSize": 7902590888,
      "addedAt": "2026-01-07T00:13:06.704Z",
      "thumbnail": "https://archive.org/services/img/wife_20201211",
      "language": "jpn",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 6023
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "89 min",
    "imdbRating": 7.1,
    "imdbVotes": 332,
    "Genre": "Drama",
    "Plot": "Tokyo. Mihoko and Toichi Nakagawa's ten year marriage is crumbling out of inertia. Each knows the other isn't happy, they themselves aren't happy, but they don't talk about their problems with each other, each festering in their unhappiness largely so that they will not show especially to their three boarders their problems. Mihiko in particular, old fashioned in her outlook, does not see divorce as an option, that move which would be a stigma she could not tolerate. Both are seemingly oblivious to the fact that others around them are facing similar if not worse situations, and that they themselves are largely the cause of their unhappiness. Things for their marriage get worse when Toichi starts to fall for his work colleague, widowed Fusako Sagara, who returns his affections.",
    "Director": "Mikio Naruse",
    "Writer": "Fumiko Hayashi, Toshirô Ide",
    "Actors": "Mieko Takamine, Ken Uehara, Rentarô Mikuni",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0043587",
    "tt0054144",
    "tt0045473",
    "tt0045463",
    "tt0045465",
    "tt0045551",
    "tt0045533",
    "tt0046543",
    "tt0045566",
    "tt0045631",
    "tt0045669",
    "tt0046187"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}