{
  "movieId": "tt0056696",
  "title": "Young and Willing",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/THEWILD_201511",
      "id": "THEWILD_201511",
      "title": "Young and Willing",
      "description": "Title: Young and Willing Summary: University students form relationships and perform pranks with disastrous consequences all round. Directed by: Ralph Thomas Actors: Virginia Maskell, Paul Rogers, Ian McShane Production Company: Betty E. Box-Ralph Thomas Productions Release Date: 30 August 1963 (Finland) Aspect Ratio: REMOVE_TAG Harry Brown (Ian McShane in his introductory film role) is a somewhat rough student (the wild) at Kilminster University, who has the ability to win friends, especially the underdogs like Phil (John Hurt) who doesn't play 'rugger' and can't sink a whole pint of beer, and African student Reggie (Johnny Sekka). He also has a way with the girls (the willing), one of whom is his professors wife, who likes the students, but also her comfortable life with her boring husband more. After Harry is rebuffed, he takes up the challenge to hang a banner from the dangerously crumbling University tower. The rather weak Phil insists on being part of this escapade. This is a rather interesting film showing a University of the early 60s as a melting pot where many different rungs of society meet, and its message is still relevant today.",
      "fileSize": 808481757,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/THEWILD_201511",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 2176
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "110 min",
    "imdbRating": 5.9,
    "imdbVotes": 180,
    "Genre": "Drama, Romance",
    "Plot": "Harry Brown (Ian McShane in his introductory movie role) is a somewhat rough student (the wild) at Kilminster University, who has the ability to win friends, especially the underdogs like Phil (Sir John Hurt in his introductory movie role) who doesn't play \"rugger\", and can't sink a whole pint of beer, and African student Reggie (Johnny Sekka). He also has a way with the girls (the willing), one of whom is his professor's wife, who likes the students, but also her comfortable life with her boring husband more. After Harry is rebuffed, he takes up the challenge to hang a banner from the dangerously crumbling University tower. The rather weak Phil insists on being part of this escapade. This is a rather interesting movie showing a university of the early 1960s as a melting pot where many different rungs of society meet, and its message is still relevant today.",
    "Director": "Ralph Thomas",
    "Writer": "Laurence Doble, Nicholas Phipps, Mordecai Richler",
    "Actors": "Virginia Maskell, Paul Rogers, Ian McShane",
    "Language": "English, Spanish",
    "Country": "United Kingdom",
    "Awards": "Nominated for 1 BAFTA Award1 nomination total"
  },
  "relatedMovies": [
    "tt0052270",
    "tt0055905",
    "tt0360839",
    "tt0056626",
    "tt0354641",
    "tt0053354",
    "tt0053712",
    "tt0055230",
    "tt0055278",
    "tt0054790",
    "tt0185878",
    "tt0054698"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.271Z"
}