{
  "movieId": "tt0027623",
  "title": "Flash Gordon",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/flash-gordon-1936_202509",
      "id": "flash-gordon-1936_202509",
      "title": "Flash Gordon 1936",
      "description": "The complete 1936 serial Flash Gordon. All 13 episodes that were originally shown in theaters one per week. The movie studios were really churning out movies during the 30's and a new one showed up every week. Serials were a way of enticing people back to the theater week after week. You'll notice the cliff hangers at the end of each episode. It would always look like a disaster and then the next week, you'd see the character rescued.  Buster Crabbe stars as Flash, Jean Rogers is the kidnap-prone Dale Arden and Priscilla Lawson is the space princess who falls for Flash Flash Gordon started as a comic strip in 1934 and became popular enough to spawn 3 serials. In 1966 this one was edited into Spaceship to the Unknown.  In 1974 it was parodied in Flesh Gordon. Dale Arden's costumes were not changed much from the original serial. 1980 would see the release of director Mike Hodges take on the character. Sam Jones, Melody Anderson, Timothy Dalton and Ornella Muti would act in the movie while Brian Blessed gnawed his way through the furniture.  I removed the non-English audio and subtitles and tried to balance out the sound volume but the second half is quieter than the first.",
      "fileSize": 3753599904,
      "addedAt": "2026-01-07T00:08:24.396Z",
      "thumbnail": "https://archive.org/services/img/flash-gordon-1936_202509",
      "language": "eng",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 248
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "245 min",
    "imdbRating": 7,
    "imdbVotes": 2758,
    "Genre": "Action, Adventure, Family",
    "Plot": "A rogue planet is 'rushing madly toward the earth.' Impending doom creates worldwide pandemonium. But maverick scientist Dr. Zarkov hopes to stay disaster by travelling to the new planet in his experimental rocket. Two chance-met strangers, athletic Flash Gordon and damsel in distress Dale Arden, go with him. Arrived, the trio find Mongo to be a planet of wonders, warring factions, and deadly perils, its orbit controlled by Emperor Ming who has his own sinister plans for earth. Can our heroes, armed only with science and sex appeal, stop him?",
    "Director": "Frederick Stephani, Ray Taylor",
    "Writer": "Alex Raymond, Frederick Stephani, Ella O'Neill",
    "Actors": "Buster Crabbe, Jean Rogers, Charles Middleton",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0030138",
    "tt0032475",
    "tt0029081",
    "tt0030832",
    "tt0026435",
    "tt0282813",
    "tt0034928",
    "tt0057197",
    "tt0033317",
    "tt0028776",
    "tt0028241",
    "tt0012752"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:08:24.396Z"
}