{
  "movieId": "tt0041280",
  "title": "The Daring Caballero",
  "year": 1949,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5WkQG5AHIdc",
      "id": "5WkQG5AHIdc",
      "title": "The Daring Caballero (1949) DUNCAN RENALDO🍕 LEO CARRILLO",
      "description": "🍕PizzaFLIX Presents CLASSIC MOVIE MONDAY🍕\nStars: Duncan Renaldo, Leo Carrillo, David Leonard, Kippee Valez\nDirector: Wallace Fox\n🍕NEW HD PRESENTATION🍕\nRide into classic Western territory with The Cisco Kid in this thrilling 1949 adventure! In The Daring Caballero, Cisco and his ever-faithful sidekick Pancho find themselves entangled in a plot of fraud, mistaken identity, and frontier justice. When a dishonest land agent tries to swindle a wealthy ranch owner, Cisco steps in to expose the truth and clear his name—all while dodging bullets and charming the local señoritas.\n\nDirected by Wallace Fox and produced by Inter-American Productions, this installment in the beloved Cisco Kid series stars Duncan Renaldo as the dashing hero and Leo Carrillo as the lovable, quick-quipping Pancho. Filled with fast-paced action, light comedy, and vibrant post-war B-Western style, the film stands out as a gem of late-1940s Hollywood Western filmmaking.\n\nTRIVIA: The Cisco Kid is a fictional character created by O. Henry for his short story \"The Caballero's Way,\" first published in 1907. Four actors portrayed this Western hero in 25 films during the sound era. In 1928, the first all-talking western starred Warner Baxter as the Cisco Kid, followed by Cesar Romero, Duncan Renaldo, and Gilbert Roland.\n\n🍕Are you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nFans of classic cowboy cinema, Latino representation in early American film, and the iconic Cisco Kid will love this exciting entry packed with adventure, heart, and Old West justice. A must-see for collectors and Western film enthusiasts!\n\n#TheCiscoKid #DaringCaballero #DuncanRenaldo #LeoCarrillo #ClassicWesterns #1940sMovies #WallaceFox #WesternLegends #GoldenAgeHollywood #BWestern #LatinoCinema #OldWestAction #VintageMovies #CowboyHeroes #AmericanWestern",
      "addedAt": "2025-12-24T01:04:49.709Z",
      "thumbnail": "https://i.ytimg.com/vi/5WkQG5AHIdc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB6YQzycG6JbmdzXFA0ZljE86XhMQ",
      "duration": 3662,
      "language": "en",
      "year": 1949,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "60 min",
    "imdbRating": 6.9,
    "imdbVotes": 52,
    "Genre": "Western",
    "Plot": "Cisco learns from the Padre that Pappy Del Rio, the town's leading citizen, is to be hung the next day for murder and robbery. The Padre thinks he is innocent so Cisco breaks him out and hides him. Cisco then runs into the Mayor, an outlaw he knows who is now using a different name. Cisco figures he is the murderer and sets out to prove it.",
    "Director": "Wallace Fox",
    "Writer": "Frances Kavanaugh, Betty Burbridge, O. Henry",
    "Actors": "Duncan Renaldo, Leo Carrillo, Kippee Valez",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041405",
    "tt0041845",
    "tt0042506",
    "tt0030208",
    "tt0030443",
    "tt0830690",
    "tt0041362",
    "tt0041221",
    "tt0041809",
    "tt0041810",
    "tt0041177",
    "tt0041994"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:34:53.096Z"
}