{
  "imdbId": "tt0032832",
  "title": "Mysterious Doctor Satan",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mysterious-doctor-satan-1940-colorized-serial-compilation-720p-hd-1940",
      "id": "mysterious-doctor-satan-1940-colorized-serial-compilation-720p-hd-1940",
      "title": "Mysterious Doctor Satan – serial compilation (restored, colorized) (1940, mystery, imdb score: 7.4)",
      "description": "Mysterious Doctor Satan (also known as Doctor Satan's Robot ) is a 1940 American film serial directed by William Witney and John English . Produced by Republic Pictures , the serial stars Edward Ciannelli , Robert Wilcox , William Newell , C. Montague Shaw , Ella Neal, and Dorothy Herbert. The title of the serial is derived from that of its chief villain. Doctor Satan's main opponent is the masked mystery man, \"The Copperhead\", whose secret identity is Bob Wayne, a man searching for justice and revenge on Satan for the death of his guardian Governor Bronson. The serial charts the conflict between the two as Bob Wayne pursues Doctor Satan, while the latter completes his plans for world domination. Henry Brandon was originally intended to play the part of Doctor Satan while wearing a regular devil costume, complete with horns. At the end of the 1930s, however, this would have stretched credulity too far, even for a serial, so a more realistic villain was written in the form of a sleek, gangster-style mad scientist played by Ciannelli. The serial first began as a screenplay for Republic's never-produced Superman serial, which was cancelled after various problems arose with securing the rights to the famous and popular comic book character. Mysterious Doctor Satan was later remade in Turkish as The Deathless Devil .",
      "fileSize": 3085326472,
      "addedAt": "2026-01-07T00:09:54.334Z",
      "thumbnail": "https://archive.org/services/img/mysterious-doctor-satan-1940-colorized-serial-compilation-720p-hd-1940",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 476
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "267 min",
    "imdbRating": 7.4,
    "imdbVotes": 282,
    "Genre": "Action, Adventure, Crime",
    "Plot": "A mad scientist named Dr. Satan plots to steal key pieces of technolgy to enable him to build an army of robots based on his prototype to conquer America. The only one standing in his way is Bob Wayne, who fights Satan as the enigmatic Copperhead.",
    "Director": "John English, William Witney",
    "Writer": "Franklin Adreon, Ronald Davidson, Norman S. Hall",
    "Actors": "Eduardo Ciannelli, Robert Wilcox, William Newell",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031207",
    "tt0033317",
    "tt0033535",
    "tt0032164",
    "tt0032790",
    "tt0033082",
    "tt0033429",
    "tt0032690",
    "tt0032557",
    "tt0032559",
    "tt0033426",
    "tt0033547"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.334Z"
}