{
  "movieId": "tt0058333",
  "title": "The Masque of the Red Death",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/masque-of-the-red-death",
      "id": "masque-of-the-red-death",
      "title": "The Masque of the Red Death",
      "description": "The evil Prince Prospero is riding through the Catania village when he sees that the peasants are dying of Red Death plague. Prospero asks to burn down the village and he is offended by the villagers Gino and his father-in-law Ludovico. He decides to kill them, but Gino's wife, the young and beautiful Francesca, begs for the lives of her husband and her father and Prospero brings them alive to his castle expecting to corrupt Francesca. Propero worships Satan and invites his noble friends to stay in his castle that is a shelter of depravity against the plague. When Prospero invites his guests to attend a masked ball, he sees a red hooded stranger and he believes that Satan himself has attended his party.",
      "fileSize": 6440614102,
      "addedAt": "2026-01-07T00:09:46.428Z",
      "thumbnail": "https://archive.org/services/img/masque-of-the-red-death",
      "language": "eng",
      "year": 1964,
      "collection": "feature_films",
      "downloads": 16336
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-masque.of.the.-red.-death.-1964",
      "id": "the.-masque.of.the.-red.-death.-1964",
      "title": "The Masque of the Red Death (1964)",
      "description": "The Masque of the Red Death is a 1964 horror film directed by Roger Corman and starring Vincent Price. It follows  Prince Prospero, a Satanist, isolates himself and his courtiers in a castle to escape a deadly plague known as the Red Death. As they indulge in a lavish masquerade ball, a mysterious figure representing the plague infiltrates their festivities, leading to a horrifying revelation and the eventual demise of the guests.",
      "fileSize": 2507570278,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-masque.of.the.-red.-death.-1964",
      "language": "eng",
      "year": 1964,
      "collection": "feature_films",
      "downloads": 214
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "89 min",
    "imdbRating": 6.9,
    "imdbVotes": 17022,
    "Genre": "Drama, Horror",
    "Plot": "The evil Prince Prospero is riding through the Catania village when he sees that the peasants are dying of Red Death plague. Prospero asks to burn down the village and he is offended by the villagers Gino and his father-in-law Ludovico. He decides to kill them, but Gino's wife, the young and beautiful Francesca, begs for the lives of her husband and her father and Prospero brings them alive to his castle expecting to corrupt Francesca. Propero worships Satan and invites his noble friends to stay in his castle that is a shelter of depravity against the plague. When Prospero invites his guests to attend a masked ball, he sees a red hooded stranger and he believes that Satan himself has attended his party. But soon he learns who his mysterious guest is.",
    "Director": "Roger Corman",
    "Writer": "Charles Beaumont, R. Wright Campbell, Edgar Allan Poe",
    "Actors": "Vincent Price, Hazel Court, Jane Asher",
    "Language": "English, Latin",
    "Country": "United States, United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0059821",
    "tt0056606",
    "tt0055304",
    "tt0053925",
    "tt0057128",
    "tt0054017",
    "tt0058700",
    "tt0055019",
    "tt0058567",
    "tt0058279",
    "tt0058283",
    "tt0058430"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}