{
  "imdbId": "tt0048441",
  "title": "Oh... Rosalinda!!",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OHROSALINDA1955",
      "id": "OHROSALINDA1955",
      "title": "Oh... Rosalinda!!",
      "description": "Title: Oh... Rosalinda!! Summary: \"Die Fledermaus\" (The Bat) is the pseudonym adopted by Dr. Falke. Floating on the buoyant waltzes of Strauss, this Viennese romp is sure to please. Disguises, tricks, and every kind of ... Directed by: Michael Powell, Emeric Pressburger Actors: Production Company: Associated British Picture Corporation (ABPC) Release Date: 2 January 1956 (UK) Aspect Ratio: 2.55 : 1 \"Die Fledermaus\" (The Bat) is the pseudonym adopted by Dr. Falke. Floating on the buoyant waltzes of Strauss, this Viennese romp is sure to please. Disguises, tricks, and every kind of deception combine to reveal a would-be cheat in hot pursuit of his own wife, much to his chagrin. Silly, charming, always entertaining, always fun. This is a movie version of \"Die Fledermaus\" set in post-war Vienna with the main protagonists of Dr. Falke represented by the three occupying powers. This is not just a movie of a staged production, but a truly filmic version of the operetta.",
      "fileSize": 810094475,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/OHROSALINDA1955",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 3227
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "101 min",
    "imdbRating": 6,
    "imdbVotes": 443,
    "Genre": "Musical",
    "Plot": "\"Die Fledermaus\" (The Bat) is the pseudonym adopted by Dr. Falke (Anton Walbrook). Floating on the buoyant waltzes of Strauss, this Viennese romp is sure to please. Disguises, tricks, and every kind of deception combine to reveal a would-be cheat in hot pursuit of his own wife, much to his chagrin. Silly, charming, always entertaining, always fun. This is a movie version of \"Die Fledermaus\" set in post-war Vienna with the main protagonists of Dr. Falke represented by the three occupying powers. This is not just a movie of a staged production, but a truly filmic version of the operetta.",
    "Director": "Michael Powell, Emeric Pressburger",
    "Writer": "Michael Powell, Emeric Pressburger",
    "Actors": "Anthony Quayle, Anton Walbrook, Dennis Price",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0049357",
    "tt0048260",
    "tt0183070",
    "tt0198797",
    "tt0198847",
    "tt0036695",
    "tt0040725",
    "tt0049397",
    "tt0048988",
    "tt0325152",
    "tt0325275",
    "tt0179798"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.465Z"
}