{
  "imdbId": "tt0018350",
  "title": "Rubber Tires",
  "year": 1927,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=P_F89TPBb8w",
      "id": "P_F89TPBb8w",
      "title": "Rubber Tires (1927) | Colorized Public Domain Silent Comedy Classic with Bessie Love & Harrison Ford",
      "description": "Rubber Tires (1927) is a silent American comedy film directed by Alan Hale Sr., produced by DeMille Pictures, and distributed by Pathé Exchange during the late silent era. This colorized restoration revives one of the forgotten gems of the 1920s, blending humor, family struggles, and a distinctly American road trip narrative. By enhancing the film with modern color and clarity, Colorized Public Domain introduces this charming work to today’s audiences in the United States, Europe, and worldwide, preserving its humor and cultural value for new generations.\n\nPlot Summary:\nThe film follows the Stack family, who find themselves in financial difficulty after the death of the patriarch. Deciding to move west for a fresh start, the family travels in their old, unreliable car nicknamed “Lizzie.” Along the way, they encounter a mix of comic setbacks, romantic entanglements, and mechanical breakdowns that put their resolve to the test. The heart of the story revolves around Mary Ellen Stack (Bessie Love), whose charm and determination keep the family together as they navigate both personal and practical obstacles.\nThe journey is filled with humorous roadside adventures, highlighting both the frustrations and hopes of ordinary Americans in the 1920s. What makes Rubber Tires notable is its early depiction of the automobile as a symbol of freedom, aspiration, and modernity, reflecting the cultural shift of the Jazz Age. The film combines slapstick comedy with heartfelt moments, making it both entertaining and a cultural time capsule of interwar America.\n\nCast and Crew:\n• Director: Alan Hale Sr.\n• Producer: Cecil B. DeMille (DeMille Pictures)\n• Cinematography: Arthur C. Miller\nStarring:\n• Bessie Love as Mary Ellen Stack\n• Harrison Ford as Bill James\n• May Robson as Mrs. Stack\n• Junior Coghlan as Buddy Stack\n• Erwin Connelly as Pa Stack\n• Frank Beal as Sheriff\n\nFilm Significance:\nRubber Tires stands out as a comedy rooted in real-life struggles, appealing to audiences of the 1920s who were themselves grappling with rapid societal changes. It showcases the silent era’s ability to blend humor with social commentary, especially about mobility and the American dream. Bessie Love delivers a spirited performance that underscores her status as one of the silent era’s most charismatic actresses. Harrison Ford — not to be confused with the modern actor of the same name — plays the romantic lead, giving the film additional historical curiosity. Today, Rubber Tires provides valuable insight into interwar culture and is celebrated as part of the public domain library of silent cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Rubber Tires remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1927 release was a black-and-white silent comedy, typical of its era. While historically authentic, silent films often struggle to retain modern attention spans. By offering a carefully colorized edition, we preserve the film’s integrity while enhancing its visual appeal for today’s audiences. This adaptation bridges the gap between historical preservation and contemporary entertainment, making Rubber Tires both relevant and enjoyable for viewers across age groups.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the silent and Golden Age of cinema, from obscure comedies to significant cultural works. Our mission is to ensure these treasures remain accessible, entertaining, and preserved for audiences in the USA, Europe, and around the world.\n\n#RubberTires #BessieLove #SilentComedy #1920sMovies #PublicDomainFilm #ColorizedClassic #SilentEra #AlanHaleSr #FilmRestoration #AmericanCinema",
      "addedAt": "2025-12-24T00:48:12.529Z",
      "thumbnail": "https://i.ytimg.com/vi/P_F89TPBb8w/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBlKGUwDw==&rs=AOn4CLCcotPP1XPE3ahx4Xm1lm6GiqaCUQ",
      "duration": 3079,
      "language": "en",
      "year": 1927,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rubber-tires_1927",
      "id": "rubber-tires_1927",
      "title": "Rubber Tires",
      "fileSize": 1166375976,
      "addedAt": "2026-01-07T00:10:40.950Z",
      "thumbnail": "https://archive.org/services/img/rubber-tires_1927",
      "language": "English",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 424
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "70 min",
    "imdbRating": 6.7,
    "imdbVotes": 102,
    "Genre": "Comedy",
    "Plot": "The Stack family of New York City has fallen on difficult financial times. Pa Stack squandered the family's money by buying a home in Newhall, California, hoping that there would be oil on the land.",
    "Director": "Alan Hale",
    "Writer": "Frank Condon, Tay Garnett, Zelda Sears",
    "Actors": "Bessie Love, Erwin Connelly, Frank Coghlan Jr.",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019085",
    "tt0019151",
    "tt0015976",
    "tt0020014",
    "tt0440334",
    "tt0017634",
    "tt0312544",
    "tt0017765",
    "tt0018394",
    "tt0019339",
    "tt0017739",
    "tt0017926"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.950Z"
}