{
  "imdbId": "tt0004102",
  "title": "His Prehistoric Past",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CC_1914_12_07_HisPrehistoricpast",
      "title": "CC 1914 12 07 HisPrehistoricpast",
      "id": "CC_1914_12_07_HisPrehistoricpast"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his-prehistoric-past-1914-directed-by-charlie-chaplin",
      "title": "His Prehistoric Past 1914 Directed By Charlie Chaplin",
      "description": "His Prehistoric Past A scene from the film Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Mack Sennett Starring Charlie Chaplin Mack Swain Sydney Chaplin Cinematography Frank D. Williams Distributed by Keystone Studios Release date December 7, 1914 Running time 21 minutes, 49 seconds (two reels) Country United States Languages Silent film English Advertisement (1918) His Prehistoric Past is a 1914 American short silent comedy film , written and directed by Charlie Chaplin , featuring Chaplin in a stone-age kingdom trying to usurp the crown of King Low-Brow to win the affections of the king's favorite wife. [ 1 ] As this film was the final one that Chaplin made at Keystone Studios , [ 2 ] it was also the last film he made with most of Keystone's regular roster of comedians. Co-star Mack Swain would not appear in another Chaplin film until 1923 when he had a prominent role in the Chaplin silent film Pay Day . Plot The tramp sits on a park bench. He decides to have a nap and lies down and starts to dream. Back in the Stone Age , King Low-Brow, King of Wakiki Beach, sits surrounded by his six favorite wives as they watch a man dancing to entertain them. A guard stands in the background. All are dressed in animal skins. Charlie arrives in this land wearing a black hat, caveman-style. He is smoking a pipe and still has his hat and cane. He meets and falls in love with the King's favorite wife. The caveman, who had been dancing, leaves the king and goes hunting. He sees Charlie kissing the arm of the wife and fires an arrow, hitting Charlie in the backside. The wife pulls it out. Charlie throws a rock at the hunter but misses and hits the king on the head. Charlie and the hunter chase each other around a large boulder. The king joins the fracas and is accidentally attacked by the hunter. Charlie then reverses and knocks the hunter out with a club. He exchanges calling cards (leaves) with the King. They shake hands and rub noses. They become friends, and the King takes them to a cave to have a drink. The wives are admiring Charlie when a younger caveman arrives, and they admire him instead. Charlie clubs him. He picks one wife and goes to the rocky water's edge. A wave drags them out to sea. They make it back, but the King is annoyed. The clubbed caveman wakes up and seeks revenge. Charlie dances with his favourite wife. The king is annoyed again. They go hunting with a bow and arrow, and Charlie fires at a bird in a nest above, breaking an egg which lands on the king's head. He declares his love for the king's favorite wife. The other wives arrive. When the King is kicked over a cliff by Charlie, he is presumed dead by the wives, and Charlie declares himself King. However, the king is not dead and is found by the dancing caveman. The king comes back and bashes Charlie over the head with a rock. Charlie wakes from his dream and a policeman bashes Charlie over the head with his baton because he was sleeping in the park. Reception A reviewer from the San Francisco Call and Post wrote, \"Charles Chaplin and other members of the Keystone Company have outdone all their previous fun-provoking efforts in the two-part film called His Prehistoric Past , which puts Chaplin in a dream state during which time he goes through a series of prehistoric difficulties, trying enough to discourage even the strongest 'stone age' man.\" [ citation needed ] Cast Charlie Chaplin as Weak-Chin Mack Swain as King Low-Brow Fritz Schade as Ku-Ku aka Cleo, Medicine Man Cecile Arnold as Cavewoman Al St. John as Caveman Sydney Chaplin as Policeman Helen Carruthers as Queen Gene Marsh as Sum-Babee, Low-Brow's Favorite Water Maiden References 1 Walker, Brent E. (2010). Mack Sennett's Fun Factory: A History and Filmography of His Studio and His Keystone and Mack Sennett Comedies, with Biographies of Players and Personnel . McFarland Inc. p. 306. ISBN   9780786457076 . Retrieved 20 February 2024 . 2 LeMaster, David J. (1997). \"The pathos of the unconscious: Charlie Chaplin & dreams\". Journal of Popular Film & Television . 25 (3). doi : 10.1080/01956059709602757 . From Wikipedia, the free encyclopedia",
      "id": "his-prehistoric-past-1914-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his-prehistoric-past-1914_202304",
      "title": "His Prehistoric Past 1914 202304",
      "description": "His Prehistoric Past is a 1914 American short silent comedy film, written and directed by Charlie Chaplin, featuring a Chaplin in a stone-age kingdom trying to usurp the crown of King Low-Brow to win the affections of the king’s favorite wife. As this film was the final one that Chaplin made at Keystone Studios, it was also the last film he made with most of Keystone’s regular roster of comedians. Co-star Mack Swain would not appear in another Chaplin film until 1923 when he had a prominent role in the Chaplin silent film Pay Day. Watch on RetroFlix.org:  https://retroflix.org/his-prehistoric-past-1914/",
      "id": "his-prehistoric-past-1914_202304"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-his-prehistoric-past",
      "title": "His Prehistoric Past",
      "id": "silent-his-prehistoric-past"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "22 min",
    "imdbRating": "5.3",
    "imdbVotes": "1,082",
    "Genre": "Short, Comedy",
    "Plot": "Charlie dreams he is in the stone age. There King Low-Brow rules a harem of wives. Charlie, in skins and a bowler, falls in love with the king's favorite wife, Sum-Babee. During a hunting trip the king is pushed over a cliff. Charlie proclaims himself king, but Ku-Ku discovers the real king alive. They return to find Charlie and Sum- Babee together.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Mack Swain, May Wallace",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0004108",
      "title": "His Trysting Place",
      "year": 1914,
      "imdbRating": "6.2",
      "imdbVotes": "1,010",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004011",
      "title": "A Fair Exchange",
      "year": 1914,
      "imdbRating": "5.5",
      "imdbVotes": "1,032",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003760",
      "title": "Caught in the Rain",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "1,162",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004007",
      "title": "Gentlemen of Nerve",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "969",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004100",
      "title": "His Musical Career",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,171",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003923",
      "title": "The Face on the Barroom Floor",
      "year": 1914,
      "imdbRating": "5.2",
      "imdbVotes": "1,215",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004311",
      "title": "The Masquerader",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,564",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004546",
      "title": "The Rounders",
      "year": 1914,
      "imdbRating": "6.2",
      "imdbVotes": "1,820",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003863",
      "title": "Dough and Dynamite",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,197",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004101",
      "title": "His New Profession",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,417",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004210",
      "title": "Laughing Gas",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "1,665",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004518",
      "title": "Recreation",
      "year": 1914,
      "imdbRating": "5.0",
      "imdbVotes": "1,277",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:19:17.087Z"
}