{
  "imdbId": "tt0045332",
  "title": "The Winning Team",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheWinningTeam",
      "id": "TheWinningTeam",
      "title": "The Winning Team",
      "description": "trailer",
      "fileSize": 22235939,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/TheWinningTeam",
      "collection": "feature_films",
      "downloads": 1905
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "98 min",
    "imdbRating": 6.5,
    "imdbVotes": 1152,
    "Genre": "Biography, Drama, Family",
    "Plot": "In 1911, Grover Cleveland Alexander - Alex to his friends - is a Nebraska country hayseed who says he wants to settle down, marry his girlfriend Aimee Arrants and be a farmer to offer Aimee a secure and stable life. However he always seems to drop everything whenever the opportunity to play baseball, specifically as a pitcher, arises. This focus on baseball does not sit well with either Aimee or her father, who see it as Alex solely wanting to have fun while shirking responsibility. When Alex is asked to pitch in a game against a visiting professional team, he seizes the chance and throws a three hitter en route to winning the game. That leads to a stint on that pro team, the money from which he promises to use to buy Aimee her farm. When an eye injury seems to end his career even before it begins, he changes his focus to being a farmer to please his now wife Aimee Alexander, but thoughts of baseball that can never be in his life still torture him. When his injury does eventually heal a year later, Aimee now wants him to do what makes him happy, which is to pitch. His contract now with the Philadelphia Phillies, Alex's rise in major league baseball with the Phillies and then the Chicago Cubs is meteoric. But some things threaten his career, such as World War I, insecurity about his previous injury and the resulting turn to alcohol. He's going to need Aimee's support to help him through this down slide to his possible redemption.",
    "Director": "Lewis Seiler",
    "Writer": "Ted Sherdeman, Seeleg Lester, Merwin Gerard",
    "Actors": "Doris Day, Ronald Reagan, Frank Lovejoy",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0044106",
    "tt0046746",
    "tt0027499",
    "tt0056124",
    "tt0044903",
    "tt3246874",
    "tt4257926",
    "tt0018054",
    "tt3402880",
    "tt0052738",
    "tt0044735",
    "tt0093132"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}