{
  "imdbId": "tt0002922",
  "title": "Hamlet",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-hamlet",
      "title": "Hamlet",
      "fileSize": 2020517062,
      "id": "silent-hamlet"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "64 min",
    "imdbRating": 5,
    "imdbVotes": 81,
    "Genre": "Drama",
    "Plot": "The opening scene is in Elsinore, where a ghost is seen by the sentinels keeping guard on the battlements of the castle. This is related to Hamlet by his friend Horatio, who describes the spirit as much resembling the late King of Denmark, his deceased father, whom his Uncle Claudius is suspected to have murdered in order that the latter might usurp his throne. Uncle Claudius also married the queen, the mother of Hamlet, within a month after. Hamlet, moved by the narration of Horatio, determines to watch for the next appearance of the ghost. It is seen again at midnight, discloses itself to Hamlet as his murdered parent and relates to him the cruel circumstances of his cruel murder by the king, his uncle, and calls upon Hamlet to avenge it. In order to accomplish this purpose, Hamlet feigns madness, especially in his conduct towards Ophelia, daughter of Polonius, with whom he is enamored. Hamlet engages some players who enact a scene in the presence of the king and queen which displays the murder of his father, purposely to try the king. Claudius, on beholding this, stung by his conscious guilt and fearful of some outward event, determines to rid himself of his nephew by sending him to England. This project is aided by Hamlet, killing Polonius. whom he mistakes for the king and who was concealed behind the arras to listen to the conversation between the queen and her son, who had demanded an interview, Hamlet is by an accident made prisoner by some pirates as he is on his way to England but escapes and unexpectedly returns to Denmark. Previously, he discovers that the ambassadors are instructed by the king's letters to cause him to be put to death on his arrival in England. These letters he exchanges for others containing the same directions for the deaths of the ambassadors. During his absence, Ophelia, distracted through her father's death and her own misfortune, destroys herself, and her brother, Laertes, urged by false rumors concerning his father's demise, rebels against the king, but he abandons his intention on being told that Hamlet committed the deed. A stratagem is evolved by the king in which Laertes basely consents to kill Hamlet by secret means. Claudius wagers six Barbary horses against six French swords with Laertes that in a dozen passes he does not exceed Hamlet by three. Hamlet consents to make a trial and is first wounded by Laertes, who has treacherously used a poisoned weapon. In a scuffle they change swords and Laertes is himself wounded by the same deadly rapier. The king had prepared a poisoned chalice with which he determined to end Hamlet if Laertes failed. In the contents of this, the queen, unconscious that it is drugged, pledges Hamlet and is poisoned. Laertes, in the agony of death, confesses his own perfidy and accuses the king, and Hamlet, with the sword of Laertes, revenges himself by stabbing Claudius. The film concludes with the news of the death of Rosencrantz and Guilderstern through letters forged by Hamlet, and a eulogium oh the unfortunate prince by his friend Horatio and the choice of young Fortinbras for King of Denmark.",
    "Director": "Hay Plumb",
    "Writer": "William Shakespeare",
    "Actors": "Walter Ringham, Johnston Forbes-Robertson, S.A. Cookson",
    "Language": "None, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0232818",
      "title": "Tilly in a Boarding House",
      "year": 1912,
      "imdbRating": 6.3,
      "imdbVotes": 28,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002784",
      "title": "Cymbeline",
      "year": 1913,
      "imdbRating": 5,
      "imdbVotes": 50,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": 6.1,
      "imdbVotes": 625,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002910",
      "title": "Granddad",
      "year": 1913,
      "imdbRating": 6,
      "imdbVotes": 89,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003014",
      "title": "Ingeborg Holm",
      "year": 1913,
      "imdbRating": 7,
      "imdbVotes": 1470,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003075",
      "title": "The Little Tease",
      "year": 1913,
      "imdbRating": 5.7,
      "imdbVotes": 44,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003497",
      "title": "The Unwelcome Guest",
      "year": 1913,
      "imdbRating": 6.6,
      "imdbVotes": 33,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003516",
      "title": "The Wanderer",
      "year": 1913,
      "imdbRating": 5,
      "imdbVotes": 65,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0778062",
      "title": "Silent Heroes",
      "year": 1913,
      "imdbRating": 4.9,
      "imdbVotes": 29,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0464694",
      "title": "Tannhäuser",
      "year": 1913,
      "imdbRating": 5.2,
      "imdbVotes": 44,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002816",
      "title": "The Drummer of the 8th",
      "year": 1913,
      "imdbRating": 5.9,
      "imdbVotes": 128,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0470339",
      "title": "The Haunted Bedroom",
      "year": 1913,
      "imdbRating": 6.1,
      "imdbVotes": 27,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}