{
  "movieId": "tt0004873",
  "title": "Alice in Wonderland",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AliceInWonderland1915_503",
      "id": "AliceInWonderland1915_503",
      "title": "Alice In Wonderland",
      "description": "Alice In Wonderland (1915) http://www.imdb.com/title/tt0004873/ This is a shorter cut of the film, clocking in at 42minutes : 7seconds It is also \"tinted\" http://en.wikipedia.org/wiki/Film_tinting A full cut of this film is available on archive.org in black and white. ~~~~ Container: mkv Video: h.264 (x264) @ 1500kbps Audio: NONE or AC3 direct copy from source Soundtrack: The video is accompanied by a soundtrack which is synced up nicely to the movie. It is sourced from an early vinyl recording. Since I am not aware of the copyright information of the audio, I also included a version with no audio (audio has just been un-muxed with no additional video formatting). Source files - Silent - With Audio ~~~ For free electronic music, check out Karakasa Music!",
      "fileSize": 1746477237,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AliceInWonderland1915_503",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 141638
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nzpxlpPRnJ4",
      "id": "nzpxlpPRnJ4",
      "title": "Alice in Wonderland (1915) | Colorized Public Domain Silent Fantasy Classic Restored | Viola Savoy",
      "description": "Alice in Wonderland (1915) is one of the earliest film adaptations of Lewis Carroll’s beloved fantasy novel. Directed by W. W. Young and produced in the United States during the silent era, this extraordinary work captures the surreal wonder of Carroll’s imagination decades before color and sound transformed cinema. Now beautifully restored and colorized, this public domain classic reawakens the dreamlike world of Wonderland for modern viewers, bringing new visual life to a century-old masterpiece.\n\nPlot Summary:\nThe film follows Alice (Viola Savoy), a curious young girl who falls asleep and dreams of a magical land where logic bends, time behaves strangely, and nonsense rules supreme. After chasing a hurried White Rabbit into a rabbit hole, Alice finds herself in Wonderland, a strange realm populated by eccentric creatures and unpredictable royalty.\n\nShe encounters iconic characters such as the Mad Hatter, the March Hare, the grinning Cheshire Cat, the Caterpillar, and the quick-tempered Queen of Hearts, who famously shouts “Off with their heads!” at every turn. Each scene unfolds as a whimsical, dreamlike sequence — blending humor, mystery, and gentle moral lessons about curiosity, imagination, and growing up.\n\nThe film concludes as Alice awakens from her dream, leaving viewers to wonder whether her journey was merely imagination or a deeper metaphor for childhood exploration and identity.\n\nCast and Crew:\n• Director: W. W. Young\n• Producer: Uncredited (Independent Production)\n• Screenplay: Adapted from the novels by Lewis Carroll\n• Cinematography: H. Alderson Leach\n• Production Company: American Film Manufacturing Company\nStarring:\n• Viola Savoy as Alice\n• Herbert Rice as the Mad Hatter\n• Elmo Lincoln as the Executioner (uncredited)\n• Harry Marks as the White Rabbit\n• Gladys Hulette as the Dormouse\n• Kate Price as the Queen of Hearts\n\nFilm Significance:\nAs confirmed by Wikipedia and IMDb, the 1915 Alice in Wonderland is one of the earliest full-length American fantasy films and the first surviving feature-length adaptation of Carroll’s novels. It was produced during a time when fantasy cinema was still in its infancy, using theatrical makeup, costumes, and early trick photography to portray Wonderland’s absurdity.\n\nAlthough much of the film’s original reel is partially lost, surviving versions have been restored and preserved by film historians, making this colorized edition an essential cultural artifact. It provides insight into early 20th-century filmmaking techniques, silent-era performance styles, and the imaginative power of cinema before the advent of sound.\n\nFor modern audiences, this restored version highlights the artistry of early filmmakers who brought fantasy to life without digital tools — relying solely on costume, design, and creativity.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Alice in Wonderland remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1915 edition of Alice in Wonderland was originally filmed in black and white, using primitive visual effects and handcrafted costumes. Through advanced digital restoration and colorization, every frame has been revived to emphasize texture, contrast, and detail. The colorized version enriches the fantastical imagery — from Alice’s blue dress to the vivid surrealism of the Queen’s court — enhancing the sense of wonder that defined Carroll’s imagination.\n\nThis adaptation is particularly captivating for viewers aged 55 and older who grew up with classic literature and early cinema. Watching it on a modern TV, as nearly half of Colorized Public Domain’s audience does, amplifies the film’s dreamlike visuals and gentle pacing. It offers both nostalgia and discovery — the rediscovery of cinema’s first steps into fantasy storytelling.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the early days of cinema to the Golden Age of Hollywood. Our mission is to preserve historic works and make them accessible to audiences in the USA, Europe, and beyond. Every upload is carefully restored to respect its original artistry while offering a modern viewing experience for contemporary audiences.\n\n#AliceInWonderland1915 #LewisCarroll #SilentFantasy",
      "addedAt": "2025-12-24T00:49:32.705Z",
      "thumbnail": "https://i.ytimg.com/vi/nzpxlpPRnJ4/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBcKEYwDw==&rs=AOn4CLCZQz4Eruh_XpF1zZma7TTJfB46ng",
      "duration": 2762,
      "language": "en",
      "year": 1915,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AliceinWonderland1915",
      "id": "AliceinWonderland1915",
      "title": "Alice in Wonderland",
      "description": "Thanks to its imagination, costume designer, boldness and skillfulness W. W. Young film direction \"Alice In Wonderland\" is the best film adaptation of the Carroll's novel. It's a special delicacy: an early silent film masterpiece that every silent film fan shouldn't miss.",
      "fileSize": 1137932381,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AliceinWonderland1915",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 80572
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "52 min",
    "imdbRating": 6.1,
    "imdbVotes": 795,
    "Genre": "Adventure, Family, Fantasy",
    "Plot": "Alice goes with her sister to a picnic and then she falls asleep and starts dreaming about a wonderland full of talking animals and walking playing cards.",
    "Director": "W.W. Young",
    "Writer": "Lewis Carroll, W.W. Young, DeWitt C. Wheeler",
    "Actors": "Viola Savoy, Herbert Rice, Elmo Lincoln",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0004099",
    "tt0004457",
    "tt0050084",
    "tt0089961",
    "tt0015400",
    "tt0068190",
    "tt0290406",
    "tt0052948",
    "tt0243462",
    "tt0146315",
    "tt0104522",
    "tt0056112"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}