{
  "imdbId": "tt0023344",
  "title": "The Pocatello Kid",
  "year": 1931,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z6uRNNNm5jQ",
      "id": "Z6uRNNNm5jQ",
      "title": "The Pocatello Kid (1931) KEN MAYNARD",
      "description": "Stars: Ken Maynard, Marceline Day, Charles King\nDirector: Phil Rosen\n\nKen Maynard stars in a dual role, a good-bad outlaw as the title character, and his exact double, a bad-bad corrupt sheriff.",
      "addedAt": "2025-12-26T23:44:58.378Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Z6uRNNNm5jQ/maxresdefault.webp",
      "duration": 3489,
      "language": "en",
      "year": 1931,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 6.4,
    "imdbVotes": 94,
    "Genre": "Drama, Western",
    "Plot": "Ken Bledsoe/The Pocatello Kid escapes from prison while serving time for a crime committed by his twin brother, Jim Bledsoe. He heads for his brother's town to clear himself. Jim is now the sheriff and the tool of a gang of rustlers led by Pete Larkin. Sheriff Bledsoe provides a front for the outlaw's raids, and is also engaged to marry Pete's sister Mary, who is blissfully unaware of what goes on around her. Jim, hearing of Pocatello's escape, wants to leave the country but Larkin refuses to lose his \"legal\" protection and forces him to stay. But he loses it anyway when the gang catches the sheriff cheating at poker, and shoot him fatal like. Larkin only has a minute or so to worry about this unexpected turn of events as Pocatello comes riding up the road and knocks on the door. Larkin smoothly explains (or as smoothly as Dick Cramer can be) the situation and tells the wanted Pocatello he will provide sanctuary if Pocatello will pose as his departed-and-unmourned brother and become Sheriff Jim Bledsoe. Part of the agreement is that Pocatello must also continue the engagement to Mary Larkin, and Pocatello is not bothered at either proposal, especially when he gets a look at Mary. Pocatello, using his power as the sheriff, then embarks on a campaign to wipe out the Larkin gang, and to clear himself with the law.",
    "Director": "Phil Rosen",
    "Writer": "Scott Darling",
    "Actors": "Ken Maynard, Tarzan, Marceline Day",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021694",
    "tt0022514",
    "tt0021597",
    "tt0023692",
    "tt0024444",
    "tt0032959",
    "tt0037599",
    "tt0025303",
    "tt0022921",
    "tt0020866",
    "tt0023128",
    "tt0022988"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:31:11.833Z"
}