{
  "movieId": "tt0022628",
  "title": "The Animal Kingdom",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Animal_Kingdom",
      "id": "Animal_Kingdom",
      "title": "The Animal Kingdom",
      "description": "This was the first film shown at the RKO Roxy Theater. An awkward love triangle is created when a publisher (Howard) encounters a moral speed bump and engages in an affair with an open-minded artist (Harding) while married to a stodgy suburbanite (Loy). Complicating matters is the tendency of the mistress to play the role of unassuming wife while inelegant and deceptive wife acts as the mistress.",
      "fileSize": 1841808214,
      "addedAt": "2026-01-07T00:06:09.635Z",
      "thumbnail": "https://archive.org/services/img/Animal_Kingdom",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 61645
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Cdct9Ihlff8",
      "id": "Cdct9Ihlff8",
      "title": "The Animal Kingdom (1932) [Drama] [Comedy]",
      "description": "\"The Animal Kingdom\" (also known as The Woman in His House in the UK) is a 1932 American comedy-drama film directed by Edward H. Griffith based upon a comedy of manners of the same name by Philip Barry. The film starred Leslie Howard, Ann Harding, Myrna Loy, William Gargan, Ilka Chase, and Neil Hamilton. Howard, Gargan, and Chase also starred in the play when it opened on Broadway on 12 January 1932.\n\nThe film is based on a play, of the same name, set in 1930's New York and Connecticut. Tom Collier, Leslie Howard, is a book publisher, who has been living in the city with his best friend, Daisy Sage, Ann Harding, without being married. His wealthy Father, Rufus Collier, Henry Stephenson, wants him to live a respectable life. While Daisy is away, with her work, Cecilia, Myrna Loy, convinces Tom to marry her. Although, their lawyer and friend, Owen, Neil Hamilton, is in love with her; he doesn't have enough financial resources to maintain her interest. Cecilia tries to get Tom to \"sell out\", without his realizing it. She talks him into publishing books that will make money, get rid of his old friends, including \"Red\", his prize-fighter friend and butler. She wants Tom to sell his publishing company, live in the city, with his Father, as a \"proper gentleman\", and take their place in society, which Tom has been fighting all his life; but, is all \"Cee\" cares about.\n\nDaisy tries to stay away; but, she and Tom's Bohemian friends can't believe he's happy. She loves him deeply, and wants to have children with him; but, cares most about his well-being. Tom complains that he's losing his soul and integrity. Finally, when Cee offers Tom champagne, to toast selling his publishing company and moving in with his Father, Tom realizes that Cee's bedroom suite reminds him of a brothel he used to go, as he says, \"in vino veritas\". When Red tells Tom he is going back to the city, that he can't stomach anymore, Tom agrees, saying, he's \"going back to his wife,\" Daisy.\nAs he leaves, he put a little something on the mantle for Cee, just as he used to, with the girls, in the bordello.\n\n---\n\nDirected by Edward H. Griffith and George Cukor, produced by David O. Selznick, written by Philip Barry (play), Horace Jackson (screenplay), Edward H. Griffith, Adela Rogers St. Johns, starring Leslie Howard, Ann Harding and Myrna Loy.\n\n---\n\nSource: \"The Animal Kingdom\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 26 July 2012. Web. 30 July 2012. http://en.wikipedia.org/wiki/The_Animal_Kingdom.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:57.910Z",
      "thumbnail": "https://i.ytimg.com/vi/Cdct9Ihlff8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDvPTau8NOqwooH0eCCHmweJY5Qzg",
      "duration": 5075,
      "language": "en",
      "year": 1932,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=l8V_lhjLK1I",
      "id": "l8V_lhjLK1I",
      "title": "The Animal Kingdom (1932) | Colorized Public Domain Classic Drama with Leslie Howard and Myrna Loy",
      "description": "The Animal Kingdom (1932) is a pre-Code American drama film directed by Edward H. Griffith and adapted from Philip Barry’s Broadway play of the same name. This restored and colorized public domain classic explores themes of love, loyalty, compromise, and the clash between artistic integrity and societal expectations. Starring Leslie Howard, Ann Harding, and Myrna Loy, the film captures the sophistication and moral ambiguity that defined early 1930s Hollywood cinema before the stricter enforcement of the Production Code.\n\nPlot Summary:\nTom Collier (Leslie Howard), a wealthy publisher with refined tastes and an independent spirit, lives happily outside conventional norms with Daisy Sage (Ann Harding), a free-spirited artist who shares his ideals about love and personal freedom. Their unconventional relationship is based on honesty and equality, a rarity for films of the era. However, pressure from society and Tom’s domineering father begins to weigh on him, pushing him toward a more “respectable” life.\n\nWhen Tom becomes engaged to the ambitious and socially calculating Cecilia Henry (Myrna Loy), he is forced into a choice between personal authenticity and societal approval. Cecilia, determined to elevate Tom’s social status and wealth, urges him to abandon Daisy, his artistic friends, and even his literary independence. The heart of the story revolves around Tom’s inner struggle: should he remain true to himself and the woman he truly loves, or should he sacrifice his ideals for status, comfort, and acceptance?\n\nThe Animal Kingdom’s dialogue-driven narrative and intimate character study reflect the sophistication of Broadway drama adapted for the screen. It highlights themes of compromise, self-deception, and the price of abandoning one’s true nature. Unlike many films of its era, it confronts adult relationships with a directness that pre-Code cinema briefly allowed before censorship reshaped Hollywood storytelling.\n\nCast and Crew:\n• Director: Edward H. Griffith\n• Screenplay: Philip Barry (play), Horace Jackson (adaptation)\n• Cinematography: George J. Folsey\n• Editing: Daniel Mandell\nStarring:\n• Leslie Howard as Tom Collier\n• Ann Harding as Daisy Sage\n• Myrna Loy as Cecilia Henry Collier\n• William Gargan as Red Regan\n• Ilka Chase as Grace\n• Henry Stephenson as Rufus Collier\n• Robert Williams as Owen\n• Leni Stengel as Hannah\n\nFilm Significance:\nThe Animal Kingdom holds historical importance as a refined pre-Code drama, showcasing Leslie Howard in a role that foreshadowed his later Hollywood stardom in Gone with the Wind (1939). Ann Harding gives a nuanced performance as a progressive woman living by choice rather than convention, while Myrna Loy embodies the rising archetype of the alluring but socially ambitious wife.\n\nThe film is also an important cultural artifact, reflecting the artistic debates of the early 20th century: commercialism versus authenticity, conformity versus independence, and true love versus social ambition. Though not a mainstream blockbuster, it remains valuable for its exploration of gender roles, class, and integrity — themes still relevant today.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Animal Kingdom remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1932 release was in black and white, typical of its time. While authentic to the pre-Code era, black-and-white presentation often discourages modern audiences from engaging with films of this period. By presenting The Animal Kingdom in color, this edition bridges the gap between historical preservation and contemporary viewing habits. Viewers can now experience the performances of Leslie Howard, Ann Harding, and Myrna Loy with a vibrancy that draws in both classic cinema enthusiasts and new audiences unfamiliar with early 1930s Hollywood.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to prestigious dramas. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheAnimalKingdom #LeslieHoward #MyrnaLoy #AnnHarding #PreCodeHollywood #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration",
      "addedAt": "2025-12-24T00:50:22.987Z",
      "thumbnail": "https://i.ytimg.com/vi/l8V_lhjLK1I/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBQKEgwDw==&rs=AOn4CLCP7xMNeoXbQ7_VC2VJDjmAj1mg_A",
      "duration": 5023,
      "language": "en",
      "year": 1932,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-animal-kingdom-1932",
      "id": "the-animal-kingdom-1932",
      "title": "The Animal Kingdom (1932)",
      "description": "Tom Collier has had a great relationship with Daisy, but when he decides to marry, it is not Daisy whom he asks, it is Cecelia. After the marriage, Tom is bored with the social scene and the obligations of his life. He publishes books that will sell, not books that he wants to write. Even worse, he has his old friend working as a butler and Cecelia wants him fired. When Tom tries to get back together with Daisy to renew the feelings that he once felt, Daisy turns the tables on him and leaves to protect both of them. Watch on RetroFlix:  https://retroflix.org/the-animal-kingdom-1932/",
      "fileSize": 532196569,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-animal-kingdom-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 281
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-animal-kingdom-4-k",
      "id": "the-animal-kingdom-4-k",
      "title": "The Animal Kingdom (1932) [Colorised, 4K, 60FPS]",
      "description": "The Animal Kingdom is a 1932 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @ https://colab.research.google.com/  Technologies used: A.I. Colorizing: https://github.com/jantic/DeOldify A.I. Increasing frame rate 60 FPS: https://rife-vfi.github.io  A.I. Upscaling to 4K: https://ffmpeg.org  GPU: Google Colab",
      "fileSize": 6130065357,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-animal-kingdom-4-k",
      "collection": "feature_films",
      "downloads": 384
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sN3KxlYPbsM",
      "id": "sN3KxlYPbsM",
      "title": "The Animal Kingdom (1932) ANN HARDING",
      "description": "Stars: Ann Harding, Leslie Howard, Myrna Loy\nDirectors: Edward H. Griffith, George Cukor\nProduced by: David O. Selznick\n\nAn intellectual publisher can't choose between his society wife and his free-thinking former love.",
      "addedAt": "2025-12-26T23:49:33.108Z",
      "thumbnail": "https://i.ytimg.com/vi/sN3KxlYPbsM/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLCTs0rLVTTzlZ8z6ro1HxH4cyxd-A",
      "duration": 5074,
      "language": "en",
      "year": 1932,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XinHZFlxQjo",
      "id": "XinHZFlxQjo",
      "title": "The Animal Kingdom (1932) Comedy, Drama, Romance Full Length Film",
      "description": "Based on a play by Philip Barry, this sophisticated comedy is about a man trying to justify his love for both his wife and his mistress.\n\nDirectors: Edward H. Griffith, George Cukor \nWriters: Horace Jackson, Philip Barry \nStars: Ann Harding, Leslie Howard, Myrna Loy \nBudget: $458,000\n\n@CultCinemaClassics \nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:52:20.265Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/XinHZFlxQjo/maxresdefault.webp?v=62603ea1",
      "duration": 5091,
      "language": "en",
      "year": 1932,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": 6.3,
    "imdbVotes": 1353,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Tom Collier has had a great relationship with Daisy, but when he decides to marry, it is not Daisy whom he asks, it is Cecelia. After the marriage, Tom is bored with the social scene and the obligations of his life. He publishes books that will sell, not books that he wants to write. Even worse, he has his old friend working as a butler and Cecelia wants him fired. When Tom tries to get back together with Daisy to renew the feelings that he once felt, Daisy turns the tables on him and leaves to protect both of them.",
    "Director": "Edward H. Griffith, George Cukor",
    "Writer": "Horace Jackson, Philip Barry, Edward H. Griffith",
    "Actors": "Ann Harding, Leslie Howard, Myrna Loy",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0023537",
    "tt0022943",
    "tt0023202",
    "tt0021649",
    "tt0023955",
    "tt0024421",
    "tt0024436",
    "tt0024610",
    "tt0025306",
    "tt0020988",
    "tt0025335",
    "tt0025463"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.532Z"
}