{
  "imdbId": "tt0001340",
  "title": "The Oath and the Man",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheOathAndTheMan",
      "id": "PreviewTheOathAndTheMan",
      "title": "\"The Oath And The Man\" (1910) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Oath and the Man\" is a short drama directed by D.W. Griffith.  The film is included in our program to illustrate the work of cinematographer Billy Bitzer, a star of Silent Hall of Fame. Just before the French Revolution a common man loses his wife when she leaves him for a nobleman. When the mobs take charge the man has a chance for revenge. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Henry B. Walthall, Florence Barker, W. Chrystie Miller, Francis J. Grandon Distributed by                   Biograph Company Release date                      September 22, 1910 Country                             United States Running time                    11 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 13267279,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheOathAndTheMan",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 862
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheOathAndTheMan",
      "id": "TheOathAndTheMan",
      "title": "The Oath and the Man",
      "description": "The Oath and the Man was directed by D W Griffith in 1910. Griffith is often out of his depth when he goes far back in history. Herein he trivializes the French revolution. Before you criticize him, though, remember he was making two or three of these a week. If you get a few laughs, you will be laughing at it not with it",
      "fileSize": 256669091,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheOathAndTheMan",
      "collection": "feature_films",
      "downloads": 3958
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.1,
    "imdbVotes": 104,
    "Genre": "Short, Drama",
    "Plot": "Before the revolution in France the nobility exercised a most despotic rule over the peasants, subjecting them to abject slavery. Not only did they suffer pecuniary oppression, but their humble households were invaded and defiled by the noble profligates. Henri Provost, a perfumer, receives a call from his landlord in quest of some perfume. During his visit this nobleman is attracted by Henri's pretty young wife. Her beauty so enthralls him that he, during her husband's absence, exercises his presumed rights, and invites, or rather commands her to attend his house fete. Here he dresses her in finery and promises to make a great lady of her, so that when her husband, who finding whither she had gone, bursts into the palace, she denies him. The heartbroken perfumer at first would return to the palace and in vengeance murder both his wife and the nobleman, but the old priest stays him, by showing him the crucifix, the emblem of Christian charity and making him swear he would never kill them. Indicating that vengeance belonged to God. Henri takes this oath and lives up to it. Some time later the peasants chafing under aristocratic tyranny revolt, with the perfumer a leader. The revolutionists invade the home of the nobleman, the occupants of which flee in panic. The nobleman himself, with the perfumer's wife, who is still with him, make their way to her former home, which she imagines is deserted. The perfumer enters, and upon meeting the guilty pair, sees his chance to wreak vengeance. He is about to run them through when the old priest again appears and shows him the crucifix, reminding him of his oath. He then waves back the mob, who haven't seen the nobleman, with the exclamation, \"This is my wife.\" The mob dismissed, he takes the couple to an inner room where they exchange their finery for peasant's attire. Thus they leave to take their chances of evading intemperate revolutionists who are parading outside, devastating everything and destroying everybody aristocratic. What a bitter lesson she has been taught. Her covetousness has brought her only shame, terror, poverty and isolation.",
    "Director": "D.W. Griffith",
    "Writer": "Stanner E.V. Taylor",
    "Actors": "Henry B. Walthall, Florence Barker, W. Chrystie Miller",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001207",
    "tt0001245",
    "tt0001262",
    "tt0001401",
    "tt0001371",
    "tt0001388",
    "tt0001284",
    "tt0001407",
    "tt0001351",
    "tt0001256",
    "tt0001032",
    "tt0001050"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.034Z"
}