{
  "imdbId": "tt0061809",
  "title": "In Cold Blood",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/in.-cold.-blood.-1967_202510",
      "id": "in.-cold.-blood.-1967_202510",
      "title": "In Cold Blood (1967)",
      "description": "In Cold Blood is a 1967 American black-and-white neo-noir crime film written, produced and directed by Richard Brooks, based on Truman Capote's 1966 nonfiction novel. It stars Robert Blake as Perry Smith and Scott Wilson as Richard \"Dick\" Hickock, two men who murder a family of four in Holcomb, Kansas. Although the film is in parts faithful to the book, Brooks made some slight alterations, including the inclusion of a fictional character, \"The Reporter\". The film  follows ex-convicts Perry Smith and Dick Hickock as they plan to rob the Clutter family in Kansas, believing Herbert Clutter has a safe filled with cash. When they find no money, they murder the entire family to eliminate witnesses, leading to their eventual capture and trial for the brutal crime.",
      "fileSize": 1467629847,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/in.-cold.-blood.-1967_202510",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 128
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "134 min",
    "imdbRating": 7.9,
    "imdbVotes": 30068,
    "Genre": "Biography, Crime, Drama",
    "Plot": "In meeting in Kansas, ex-cons Perry Smith and Dick Hickock are breaking several conditions of their respective paroles. The meeting, initiated by Dick, is to plan and eventually carry out a robbery based on information he had received from a fellow inmate about $10,000 cash being locked in a hidden safe in the home of the farming Clutter family of Holcomb, Kansas. After the robbery, they plan on going to Mexico permanently to elude capture by the police. Each brings a necessary personality to the partnership to carry out the plan, Dick who is the brash manipulator, Perry the outwardly more sensitive but unrealistic dreamer with a violent streak under the surface. Perry literally carries all his dreams in a large box he takes with him wherever he goes. The robbery does not go according to plan in any respect, the pair who ultimately hogtie and execute all four members of the Clutter family, only coming away from the home with $43 in cash. As Perry and Dick go on the run, a murder investigation ensues, led by Topeka based Detective Alvin Dewey. If Dewey and his team are able eventually to identify the pair as the murderers and capture them, they, if they understand the two, may get their much needed confessions in dividing and conquering. Perry and Dick's fates may also be regardless of who literally pulled the trigger.",
    "Director": "Richard Brooks",
    "Writer": "Truman Capote, Richard Brooks",
    "Actors": "Robert Blake, Scott Wilson, John Forsythe",
    "Language": "English, French, Spanish",
    "Country": "United States",
    "Awards": "Nominated for 4 Oscars. 4 wins & 11 nominations total"
  },
  "relatedMovies": [
    "tt0060862",
    "tt0100234",
    "tt0050155",
    "tt0054102",
    "tt0055798",
    "tt0077928",
    "tt6212478",
    "tt0285728",
    "tt0103838",
    "tt0005960",
    "tt0042229",
    "tt0051114"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.187Z"
}