{
  "imdbId": "tt0000416",
  "title": "Alcohol and Its Victims",
  "year": 1902,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/alcohol-and-its-victims-1902-directed-by-ferdinand-zecca",
      "title": "Alcohol And Its Victims 1902 Directed By Ferdinand Zecca",
      "description": "Alcohol and Its Victims (1902) 'Les victimes de l'alcoolisme' Director: Ferdinand Zecca Les victimes de l'alcoolisme (English: Alcohol and its victims) is a 1902 French short drama film directed by Ferdinand Zecca, inspired by the 1877 naturalist novel L'Assommoir by Emile Zola. It is the first film inspired by this novel and one of first films aimed at fulfilling an objective of general social interest, in this case the fight against alcoholism. Analysis: The five scenes are each composed of one single wide shot taken by a static camera in front of theatre-like sets. The intertitles introducing each of the scene use black letters on a light background. There is a jump cut in scene 4, the man appearing suddenly wiggling on the floor. This may be due to a lost fragment. This is the first film by Pathé Frères including intertitles and one of the first in the world. Les victimes de l'alcoolisme is the first known cinematic adaptation of a novel by Emile Zola. The book on which it is based, L'Assommoir, would be the subject of a further three French cinematographic adaptations before the outbreak of World War I, L'Assommoir in 1909, Les Victimes de l'alcool (English: In the Grip of Alcohol/Victims of Alcoholism) in 1911 and Le Poison de l'humanité (English: An Accursed Inheritance) in 1912. In America, a further adaptation would be directed by D.W. Griffith in 1909, The Drunkard's reformation. This film has been singled out as enjoying the status of historical originality. \"Described by French film historian Georges Sadoul as a pantomime the Zola/Zecca narrative of the decline of a working class family due to the effects of chronic alcoholism and encroaching poverty has remained one of the most popular of all the naturalist texts to be adapted into film.\" This film is also one of the first example of cinema seen not only as entertainment, but as a media carrying a socially useful message. Dwight Vick notes that \"Les victimes de l'alcoolisme was the first attempt by the newly formed Pathé Company to exploit the burgeoning demand for anti-alcohol and anti-absinthe propaganda.\" Pathé itself emphasised this objective in its presentation of the film, which referred to the success of History of a Crime in 1901: \"Encouraged by this first success, we are now presenting to our customers a play that is even more dramatic than the previous one, more interesting and above all much more moral, because it touches on a social plague that is becoming more and more pervasive by the day, we have named Alcoholism (...) we are convinced that by publishing this scene we will help the many anti-alcoholic and temperance societies who think, like us, that in order to fight this evil that is decimating humanity, example prevails over all laws. Is not the cinematograph above all the distraction and relaxation of the humble and the worker? Therefore, nothing better than the Cinematograph could help to demonstrate the ravages caused by alcoholism. Consequently, we are certain to achieve a twofold goal, firstly to interest our customers and secondly to help stop, as far as possible, this terrible evil (...)\" -From Wikipedia",
      "id": "alcohol-and-its-victims-1902-directed-by-ferdinand-zecca"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "4 min",
    "imdbRating": "5.4",
    "imdbVotes": "205",
    "Genre": "Short, Drama",
    "Plot": "A happy family is brought to ruin when the father starts drinking.",
    "Director": "Ferdinand Zecca",
    "Writer": "Ferdinand Zecca, Émile Zola",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0398672",
      "title": "Ali Baba and the Forty Thieves",
      "year": 1902,
      "imdbRating": "6.1",
      "imdbVotes": "478",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0258104",
      "title": "Rêve et réalité",
      "year": 1901,
      "imdbRating": "5.1",
      "imdbVotes": "500",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0438165",
      "title": "The Little Match Seller",
      "year": 1902,
      "imdbRating": "6.7",
      "imdbVotes": "499",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0445338",
      "title": "The Dude and the Burglars",
      "year": 1903,
      "imdbRating": "4.3",
      "imdbVotes": "67",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000355",
      "title": "Fire!",
      "year": 1901,
      "imdbRating": "6.2",
      "imdbVotes": "804",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1090274",
      "title": "A Sneaky Boer",
      "year": 1901,
      "imdbRating": "4.9",
      "imdbVotes": "90",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0132077",
      "title": "Daylight Burglary",
      "year": 1903,
      "imdbRating": "6.0",
      "imdbVotes": "456",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0419034",
      "title": "Passion Play: Christ Calling Zaccheus from the Tree",
      "year": 1903,
      "imdbRating": "4.8",
      "imdbVotes": "28",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000471",
      "title": "Uncle Tom's Cabin",
      "year": 1903,
      "imdbRating": "5.2",
      "imdbVotes": "520",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0231716",
      "title": "The Hero of Liao-Yang",
      "year": 1904,
      "imdbRating": "5.8",
      "imdbVotes": "74",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0288468",
      "title": "Capture of Boer Battery by British",
      "year": 1900,
      "imdbRating": "4.6",
      "imdbVotes": "212",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0257676",
      "title": "A Fire in a Burlesque Theatre",
      "year": 1904,
      "imdbRating": "4.5",
      "imdbVotes": "268",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T21:43:45.154Z"
}