{
  "movieId": "tt0067216",
  "title": "The Horsemen",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-horsemen-1971-1080p",
      "id": "the-horsemen-1971-1080p",
      "title": "The Horsemen (1971) Omar Sharif · Leigh Taylor-Young",
      "description": "Drama depicting rural life in contemporary Afghanistan and the Afghani people's love for an ancient traditional sport similar to horseback polo.",
      "fileSize": 2040878168,
      "addedAt": "2026-01-07T00:12:10.588Z",
      "thumbnail": "https://archive.org/services/img/the-horsemen-1971-1080p",
      "language": "eng",
      "year": 1971,
      "collection": "feature_films",
      "downloads": 269
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "109 min",
    "imdbRating": 6.2,
    "imdbVotes": 1355,
    "Genre": "Action, Adventure, Drama",
    "Plot": "In the poor, desolate northern provinces of the mountainous feudal Sunni kingdom of Afghanistan (before the Soviet-engineered republican revolutions), the status of the proud men and their clans is determined less by wealth or even military power (both rare) then by victories in the ancient, though game of buskashi, a vicious form of polo dating back to Genghis Khan, in which the chapendaz (participating horsemen) use their horse-whips on both mounts and rivals in a ruthless fight for a heavy 'ball', a dead calf, which must be carried a long way, almost impossible with all the others mercilessly assailing. Tursen, a former champion, now holds the status of village notable thanks to his position as stable-keeper of the regional lord Osman Bey, and has finally bred a horse without equal, the white stallion Jahil, in time for the royal tournament on the plain of Bagrami, just outside the capital Kabul. As Tursen is too old and has a crooked leg, his son Uraz, even prouder and with a morbidly self-destructive need to prove himself against desperate odds, represents their stable, and after defeating every local adversary it's time to try his luck in Kabul, with a powerful incentive: after victory, he may keep the triumphant horse they cherish above life itself. It's a terribly long, dangerous road across the unforgiving Hindu Kush mountains, and despite a valiant fight Uraz looses the prize and has his leg badly fractured, but decides stubbornly to return home without healing in hospital, so gangrene sets in. His servant, the humble-born groom Mokkhi, is only persuaded to join the quasi-suicidal journey as Jahil is promised to him, but the valuable horse in equally desired by the cheap 'unclean' nomad Zareh whose female charms tempt the men, a deadly combination in itself...",
    "Director": "John Frankenheimer",
    "Writer": "Dalton Trumbo, Joseph Kessel",
    "Actors": "Omar Sharif, Leigh Taylor-Young, Jack Palance",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0064615",
    "tt0064397",
    "tt0069113",
    "tt0065374",
    "tt0070030",
    "tt0066987",
    "tt0065150",
    "tt0055633",
    "tt0105175",
    "tt0065969",
    "tt0072231",
    "tt0063060"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.588Z"
}