{
  "movieId": "tt0059920",
  "title": "The Wizard of Mars",
  "year": 1965,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WizardOfMars",
      "id": "WizardOfMars",
      "title": "The Wizard of Mars",
      "description": "Title: The Wizard of Mars Summary: In 1975, four astronauts, Dorothy, Doc, Charlie, and Steve, crash land on Mars when taking readings, with only four days of supplies. They must try to survive on the surface, which is ... Directed by: David L. Hewitt Actors: Production Company: American General Pictures Release Date: 1 January 1965 (USA) Aspect Ratio: REMOVE_TAG In 1975, four astronauts, Dorothy, Doc, Charlie, and Steve, crash land on Mars when taking readings, with only four days of supplies. They must try to survive on the surface, which is barren except for some canals with huge maggots with fins. After embarking through a golden igneous cavern, braving a storm and finding an unmanned Earth vessel, they discover a golden road which leads them to the unchanging ruins of what was once a beautiful Martian city. The Martians are modeled on the Flatheads of Oz, and their collective consciousness, the \"Wizard,\" forbids them to leave until they perform a very small task.",
      "fileSize": 607059574,
      "addedAt": "2026-01-07T00:07:18.436Z",
      "thumbnail": "https://archive.org/services/img/WizardOfMars",
      "year": 1965,
      "collection": "feature_films",
      "downloads": 7704
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "78 min",
    "imdbRating": 3.4,
    "imdbVotes": 631,
    "Genre": "Fantasy, Horror, Sci-Fi",
    "Plot": "In 1975, four astronauts, Dorothy, Doc, Charlie, and Steve, crash land on Mars when taking readings, with only four days of supplies. They must try to survive on the surface, which is barren except for some canals with huge maggots with fins. After embarking through a golden igneous cavern, braving a storm and finding an unmanned Earth vessel, they discover a golden road which leads them to the unchanging ruins of what was once a beautiful Martian city. The Martians are modeled on the Flatheads of Oz, and their collective consciousness, the \"Wizard,\" forbids them to leave until they perform a very small task.",
    "Director": "David L. Hewitt",
    "Writer": "David L. Hewitt, L. Frank Baum, Armando Busick",
    "Actors": "John Carradine, Roger Gentry, Vic McGee",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0059466",
    "tt10554196",
    "tt0340177",
    "tt0050432",
    "tt0228040",
    "tt0843873",
    "tt1132130",
    "tt3233972",
    "tt0059504",
    "tt0059486",
    "tt0407696",
    "tt0058279"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.436Z"
}