{
  "movieId": "tt0002550",
  "title": "Under Burning Skies",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/UnderBurningSkiesPreview",
      "id": "UnderBurningSkiesPreview",
      "title": "\"Under Burning Skies\" (1912) director D. W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Under Burning Skies\" is a short Western drama directed by D.W. Griffith, featuring Billy Bitzer and Robert Harron, stars of Silent Hall of Fame. Two newlyweds are chased through the desert by a disgruntled former rival. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Wilfred Lucas, Blanche Sweet, Christy Cabanne, Robert Harron Distributed by                   Biograph Company Release date                      February 22, 1912 Country                             United States Running time                    14 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 14620180,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/UnderBurningSkiesPreview",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 4524
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.3,
    "imdbVotes": 52,
    "Genre": "Drama, Short",
    "Plot": "Joe would have been happily married to Emily if he could have kept his promise to give up drink. But seemingly it was impossible, and when drunk he became so reckless and dangerous that he had received the name of \"The Bad Man of San Fernand.\" A young man from across the desert meets Emily, and before long she consents to marry him. Joe hears of this, and, his mind inflamed by liquor, he sends a message to the new sweetheart that he will shoot him on sight. Emily fearful that Joe might carry out his threat, marries the young man at once and they start across the desert for home and safety. Joe hearing of this, vengefully follows. On the desert the ripping of their water sack has left the young couple without a supply of water, and when Joe overtakes them they are on the verge of dying from thirst. Gloating over his chance for revenge, he refuses their appeals for water and leaves them to die. He cannot, however, forget little Emily's heartrending appeals, and, his better self awakening to a realization of what he has done, he returns.",
    "Director": "D.W. Griffith",
    "Writer": "Stanner E.V. Taylor",
    "Actors": "Wilfred Lucas, Blanche Sweet, Christy Cabanne",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001753",
    "tt0002212",
    "tt0002162",
    "tt0002208",
    "tt0002415",
    "tt0002190",
    "tt0002303",
    "tt0001987",
    "tt0002795",
    "tt0001593",
    "tt0001615",
    "tt0001499"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.887Z"
}