{
  "imdbId": "tt0030565",
  "title": "Peck's Bad Boy with the Circus",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pecks_bad_boy_circus",
      "id": "pecks_bad_boy_circus",
      "title": "Peck's Bad Boy with the Circus",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4151990916,
      "addedAt": "2026-01-07T00:10:12.697Z",
      "thumbnail": "https://archive.org/services/img/pecks_bad_boy_circus",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 64681
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WjxG_lClmME",
      "id": "WjxG_lClmME",
      "title": "Peck's Bad Boy with the Circus (1938) EDGAR KENNEDY",
      "description": "Stars: Tommy Kelly, Ann Gillis, Edgar Kennedy \n Director: Edward F. Cline\n\n Trouble-prone Billy Peck and his gang descend on a traveling circus in town, and their antics cause the circus owner all kinds of problems.",
      "addedAt": "2025-12-26T23:52:18.620Z",
      "thumbnail": "https://i.ytimg.com/vi/WjxG_lClmME/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCInCC-8iMXfGeflm9FGpZapQbeTw",
      "duration": 3909,
      "language": "en",
      "year": 1938,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "78 min",
    "imdbRating": 5.6,
    "imdbVotes": 129,
    "Genre": "Drama, Romance",
    "Plot": "Bill Peck (Tommy Kelly) receives ten dollars from his parents for railroad fare to summer camp where he is to defend his trophy cup in a cross-country obstacle race. But he is forced to spend his money for tickets to a circus that comes to town. In revenge, he feed his mother's sleeping pills to the circus lions. Arthur Bailey (Edgar Kennedy, the lion tamer, swears vengeance on the one responsible. His money gone, Bill hitch-hikes a ride to the camp with the circus. A puppy-love romance develops between Bill and Fleurette de Cava, ten-year old bareback rider. During rehearsals, Fleurette sprains an an ankle, and she must appear for the next performance or have her contract cancelled. Bailey suggests that Bill wear a wig and substitute for Fleurette. Bailey volunteers to guide Bill with a wire---one end fastened around Bill's waist and the other strung through a revolving pulley controlled by Bailey. Just as the act begins, Bailey learns that Bill ruined his lion-act. He gets his revenge manipulating the wire so that Bill spins through the air in a series of ludicrous poses, which causes the audience to howl with laughter and make Bill a comedy success. Bailey, really soft-hearted, finally forgives Bill. But, Bill is still miles from the summer camp and has only thirty minutes to get there. Baily and Bill requisition a circus racing chariot and take a thrilling short-cut over the mountains.",
    "Director": "Edward F. Cline",
    "Writer": "Al Martin, David Boehm, Robert Neville",
    "Actors": "Tommy Kelly, Ann Gillis, Edgar Kennedy",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029945",
    "tt0030217",
    "tt0035220",
    "tt0032411",
    "tt0029855",
    "tt0135745",
    "tt0030126",
    "tt0030170",
    "tt0030323",
    "tt0030063",
    "tt0030637",
    "tt0030692"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.697Z"
}