{
  "imdbId": "tt0007338",
  "title": "Sherlock Holmes",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sherlock-holmes-1916",
      "id": "sherlock-holmes-1916",
      "title": "Sherlock Holmes (1916)",
      "description": "William Gillette",
      "fileSize": 1535511121,
      "addedAt": "2026-01-07T00:10:50.366Z",
      "thumbnail": "https://archive.org/services/img/sherlock-holmes-1916",
      "collection": "feature_films",
      "downloads": 795
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "116 min",
    "imdbRating": 6.3,
    "imdbVotes": 463,
    "Genre": "Crime, Mystery",
    "Plot": "Sherlock Holmes, while out for a stroll with Dr. Watson, meets a beautiful woman. They are mutually attracted, but pass without recognition. Later Holmes is engaged by a noble family to recover papers involving the family in a scandal, and which are in the hands of a woman, whose sister was ruined by one of the members of the noble family. She is holding them in order to get revenge. Holmes discovers that the woman who holds these papers is the one that he had passed in the street, and to whom he was so singularly attracted. He tricks her out of the papers, but returns them to her, telling her that he believes that she will eventually give them to him of her own accord. He points out to her how much better it is to let the matter rest than to connect her own name with scandal in order to get revenge, not only on the man who caused her sister's unhappiness, but on the innocent members of his family. Holmes then goes to Watson's house, where he sends a note for the woman who holds the papers to meet him there. His cab driver, who is waiting outside, is the leader of the band of crooks. Holmes has penetrated his disguise, although the crook does not know this. Holmes brings him into the house under a pretext, and there slips handcuffs on him. He has also sent for the nobleman to come to Watson's house. He has Dr. Watson place the woman in a rear room so that she can overhear his conversation. He then turns over a package of blank papers to the nobleman, pretending he thinks they are the right ones. The nobleman berates him for having been duped. Sherlock admits it, and cries that he is ruined. The woman then rushes into the room and through her love for Sherlock gives up the real papers. The nobleman leaves satisfied and as Watson shows him to the door, Holmes slips his arms about the woman, and tells her of his love.",
    "Director": "Arthur Berthelet",
    "Writer": "H.S. Sheldon, William Gillette, Arthur Conan Doyle",
    "Actors": "William Gillette, Marjorie Kay, Ernest Maupain",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0173837",
    "tt0003165",
    "tt0051744",
    "tt0038494",
    "tt0039645",
    "tt0028231",
    "tt0204626",
    "tt0037960",
    "tt0034711",
    "tt3319920",
    "tt0047594",
    "tt0038577"
  ],
  "collections": [
    {
      "id": "sherlock-holmes",
      "name": "Sherlock Holmes"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.366Z"
}