{
  "movieId": "tt0053221",
  "title": "Rio Bravo",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rio-bravo-1959_202509",
      "id": "rio-bravo-1959_202509",
      "title": "Rio Bravo (1959) John Wayne · Dean Martin",
      "description": "How can you make a wimp who constantly begs for help into a Western hero?   Howard Hawks was so annoyed by \"High Noon\" that he made this film as a response, having his hero refuse any assistance. Yet Sheriff John T. Chance (John Wayne) desperately needs help. When he helps drunk Dude (Dean Martin) and locks up his tormentor Joe Burdett (Claude Akins), he incurs the wrath of cattle baron Nathan Burdett (John Russell). To get his brother out, Burdett sets his trigger-happy employees on Chance. He can only rely on drunk Dude, the battered Stumpy (Walter Brennan), the young gunslinger Colorado (rock star Ricky Nelson) and the beautiful gambler Feathers (Angie Dickinson)…  John Wayne, the “Duke,” liked his role and the humor of the Western so much that he made two more of this kind with Hawks: “El Dorado” and “Rio Lobo.”",
      "fileSize": 2515752925,
      "addedAt": "2026-01-07T00:10:30.755Z",
      "thumbnail": "https://archive.org/services/img/rio-bravo-1959_202509",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 857
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "141 min",
    "imdbRating": 8,
    "imdbVotes": 71739,
    "Genre": "Western",
    "Plot": "Sheriff John T. Chance has his hands full after arresting Joe Burdette for murder. He knows that Burdette's brother Nathan, a powerful rancher, will go to any lengths to get him out of jail. Chance's good friend Pat Wheeler offers to help but within 20 minutes of making the offer is gunned down in the street, shot in the back. That leaves his elderly deputy Stumpy, the town drunk Dude - once a deputy and a pretty good shot when he was sober - and a young hand, Colorado, who used to work for Wheeler. Nathan Burdette meanwhile has a couple of dozen men at his disposal. Chance does his best to prepare all the while romancing a pretty gambler who goes by the name of Feathers.",
    "Director": "Howard Hawks",
    "Writer": "Jules Furthman, Leigh Brackett, B.H. McCampbell",
    "Actors": "John Wayne, Dean Martin, Ricky Nelson",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "4 wins & 5 nominations total"
  },
  "relatedMovies": [
    "tt0054127",
    "tt0054757",
    "tt0178864",
    "tt0053461",
    "tt0052724",
    "tt0052993",
    "tt0053220",
    "tt0053145",
    "tt0053453",
    "tt0053457",
    "tt0052941",
    "tt0053026"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.755Z"
}