{
  "imdbId": "tt0030039",
  "title": "Dangerous to Know",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dangerous-to-know",
      "id": "dangerous-to-know",
      "title": "Dangerous To Know",
      "description": "Dangerous to Know Anna May Wong",
      "fileSize": 1288302481,
      "addedAt": "2026-01-07T00:07:51.628Z",
      "thumbnail": "https://archive.org/services/img/dangerous-to-know",
      "collection": "feature_films",
      "downloads": 941
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": 6.4,
    "imdbVotes": 266,
    "Genre": "Crime, Drama",
    "Plot": "Racketeer Steve Recka, art patron and political power-maker, rules his town and Madame Lan Ying, his beautiful Oriental friend and hostess (read: mistress), with an iron hand. He meets Margaret Van Kase, a socialite not impressed by his power nor his wealth, having no money herself, and Steve makes frantic efforts to win her and turns away from the loyal Lin Yang. Margaret ignores him as she plans to wed Philip Easton, a penniless bond salesman. The furious Recka, poses as a friend to Easton, while planning to ruin him. His henchmen kidnap Easton when he is carrying a large assignment of bonds, and he is branded as a runaway thief. The only doubters are Margaret and Police Inspector Brandon, who knows Recka's methods and suspects foul play. Easton is found in an abandoned house and arrested as the gangsters have taken the bonds and tipped the police where to find him. Recka offers to clear Easton if Margaret will become his bride and, while her hatred for Recka is intense, her love for Easton is greater and she consents. Recka, however, has reckoned without Lan Ying.",
    "Director": "Robert Florey",
    "Writer": "Edgar Wallace, William R. Lipman, Horace McCoy",
    "Actors": "Anna May Wong, Akim Tamiroff, Gail Patrick",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030322",
    "tt0028770",
    "tt0031232",
    "tt0033582",
    "tt0031534",
    "tt0034959",
    "tt0028136",
    "tt0041269",
    "tt0042618",
    "tt0030981",
    "tt0031221",
    "tt0031497"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.628Z"
}