{
  "movieId": "tt0049962",
  "title": "Blonde Bait",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BlondeBait",
      "id": "BlondeBait",
      "title": "Blonde Bait",
      "description": "Oh, Brother! This is new US footage clumsily tacked onto the British women’s prison drama “Women Without Men,” in a failed attempt to make what?…an international crime thriller? This one is strictly for the morbidly curious and bad movie collectors. IMDB rating 5.6. Directed by Elmo Williams. Released in 1956 (US). Complete print (US TV rip)            CAST NOTES: The US footage cast includes Richard Travis, Paul Cavanagh and Jim Davis. The UK footage cast includes Joan Rice, Thora Hird and Avril Angers. Beverly Michaels appears in the US and UK footage.",
      "fileSize": 733706624,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BlondeBait",
      "collection": "feature_films",
      "downloads": 2649
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 5.4,
    "imdbVotes": 181,
    "Genre": "Action, Adventure, Crime",
    "Plot": "U.S. State Department agent Kent Foster, on the trail of a murderous traitor, Nick Randall, hopes to trap Randall through singer/stripper Angela Booth. The latter has promised to marry Randall on New Year's Eve even though she is not to see him until then. However, she lands in prison after a quarrel with influential Julius Lord, during which she defended herself with a broken mirror. Foster arranges for her escape with the aid of \"Granny\" Ramsey in hope that she will lead him to Randall. The plan is snarled when another girl prisoner with her infant joins the escape and Angel slips away. She manages to meet Randall, and, when he slaps her, she realizes that all she has heard about him is true.",
    "Director": "Elmo Williams",
    "Writer": "Val Guest, Richard H. Landau",
    "Actors": "Beverly Michaels, Jim Davis, Joan Rice",
    "Language": "English, Spanish",
    "Country": "United Kingdom, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0050249",
    "tt0050497",
    "tt0046927",
    "tt0045668",
    "tt0026772",
    "tt0033426",
    "tt0029952",
    "tt0173742",
    "tt0031207",
    "tt2101341",
    "tt0021792",
    "tt0028836"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}