{
  "movieId": "tt0062994",
  "title": "Funny Girl",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/funny-girl-1968_202506",
      "id": "funny-girl-1968_202506",
      "title": "Funny Girl (1968)",
      "description": "Funny Girl (1968)",
      "fileSize": 4922056411,
      "addedAt": "2026-01-07T00:08:32.016Z",
      "thumbnail": "https://archive.org/services/img/funny-girl-1968_202506",
      "language": "eng",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 241
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "151 min",
    "imdbRating": 7.4,
    "imdbVotes": 26170,
    "Genre": "Biography, Comedy, Drama",
    "Plot": "Early twentieth century New York. Fanny Brice knows that she is a talented comedienne and singer. She also knows that she is not the beauty typical of the stage performers of the day, she with skinny legs and a crooked nose among other physical issues. So she knows she has to use whatever other means to get her break in show business, that break so that she can at least display her talents. With the help of Eddie Ryan who would become her friend, Fanny is able to get a part in a novelty act in a vaudeville show, the renown from which eventually comes to the attention of famed impresario Florenz Ziegfeld Jr. Fanny does become one of the Ziegfeld Follies most popular acts, despite she almost getting fired after her first performance by defying Flo's artistic vision for her closing number. Beyond stage success, Fanny also wants a happy personal life, most specifically with the suave Nicky Arnstein, a gambler in every respect of the word. Fanny loves him and loves that he loves her despite her lack of traditional beauty, but she does not love that he comes in and goes out of her life based on his financial standing at any given time and his need to earn that quick buck by the next poker game or high stakes business deal as he feels he needs to play the traditional role of money maker in their relationship on his own terms.",
    "Director": "William Wyler",
    "Writer": "Isobel Lennart",
    "Actors": "Barbra Streisand, Omar Sharif, Kay Medford",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 8 wins & 16 nominations total"
  },
  "relatedMovies": [
    "tt0071085",
    "tt0066181",
    "tt0038390",
    "tt0084044",
    "tt0011267",
    "tt0048312",
    "tt5442674",
    "tt0044735",
    "tt0063186",
    "tt0063557",
    "tt0059043",
    "tt0061809"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.016Z"
}