{
  "imdbId": "tt0001431",
  "title": "The Unchanging Sea",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/10TheUnchangingSea",
      "id": "10TheUnchangingSea",
      "title": "\"The Unchanging Sea\" (1910) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems      \"The Unchanging Sea\" is a short drama directed by D. W. Griffith. This film illustrates the work of Arthur V. Johnson and Billy Bitzer, stars of Silent Hall of Fame. A fisherman is saved from drowning, but loses his memory. Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          Charles Kingsley (poem) Cinematography                G.W. Bitzer Starring                                Arthur V. Johnson, Linda Arvidson, Mary Pickford, Charles West Distributed by                     Biograph Company Release date                         May 5, 1910 Running time                       14 min. Country                                United States Language                              Silent, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 297851036,
      "addedAt": "2026-01-07T00:06:00.050Z",
      "thumbnail": "https://archive.org/services/img/10TheUnchangingSea",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 5566
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheUnchangingSea",
      "id": "TheUnchangingSea",
      "title": "The Unchanging Sea",
      "description": "In this story set at a seaside fishing village and inspired by a Charles Kingsley poem \"The three fishers\", a young couple's happy life is turned about by an accident. The husband (Arthur V. Johnson), although saved from drowning, loses his memory. A child is on the way, and soon a daughter is born to his wife (Linda Arvidson). We watch the passage of time, as his daughter (Gladys Egan) matures and his wife ages. The daughter becomes a lovely young woman (Mary Pickford), herself ready for marriage. One day on the beach, the familiarity of the sea and the surroundings triggers a return of her father's memory, and we are reminded that although people age and change, the sea and the ways of the fisherfolk remain eternal.",
      "fileSize": 179657531,
      "addedAt": "2026-01-07T00:07:05.037Z",
      "thumbnail": "https://archive.org/services/img/TheUnchangingSea",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 4781
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-unchanging-sea",
      "id": "silent-the-unchanging-sea",
      "title": "The Unchanging Sea",
      "fileSize": 136416419,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-unchanging-sea",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 345
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "14 min",
    "imdbRating": 6.3,
    "imdbVotes": 916,
    "Genre": "Drama, Short",
    "Plot": "In this story set at a seaside fishing village and inspired by a Charles Kingsley poem, a young couple's happy life is turned about by an accident. The husband, although saved from drowning, loses his memory. A child is on the way, and soon a daughter is born to his wife. We watch the passage of time, as his daughter matures and his wife ages. The daughter becomes a lovely young woman, herself ready for marriage. One day on the beach, the familiarity of the sea and the surroundings triggers a return of her father's memory, and we are reminded that although people age and change, the sea and the ways of the fisherfolk remain eternal.",
    "Director": "D.W. Griffith",
    "Writer": "Charles Kingsley",
    "Actors": "Arthur V. Johnson, Linda Arvidson, Gladys Egan",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000852",
    "tt0000854",
    "tt0000785",
    "tt0001207",
    "tt0001120",
    "tt0001032",
    "tt0001050",
    "tt0001072",
    "tt0001510",
    "tt0000828",
    "tt0001593",
    "tt0000895"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}