{
  "movieId": "tt0008662",
  "title": "Tepeyac",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Tepeyac1917_220",
      "id": "Tepeyac1917_220",
      "title": "Tepeyac (1917)",
      "description": "TEPEYAC México, 1917 Directores: Carlos E. Gonzáles, José Manuel Ramos y Fernando Sáyago. Productora: Films Colonial. Productores: Carlos E. González, José Manuel Ramos y Fernando Sáyago. Intérpretes: Beatriz de Córdova, Gabriel Montiel, Pilar Cotta, Roberto Arroyo, Emilia Otazo. Una de las escasas películas mexicanas de ficción de largometraje de la era silente que han sobrevivido. TEPEYAC basa su argumento en la tradición de las apariciones de la Virgen de Guadalupe. Cinta que como todo el cine mexicano de la época, mezcla afortunadamente con gran ingenuidad ficción y realidad documental, lo que nos permite atisbar la Villa de Guadalupe en 1917 con sus costumbres populares, religiosas y paganas; aquí los personajes del filme se salen literalmente de la pantalla y se mezclan con el pueblo real, que fervoroso y contento, disfruta de su religiosidad. Rescatada por el historiador universitario Aurelio de los Reyes y restaurada por la Filmoteca de la UNAM a partir de los negativos y positivos de nitrato de celulosa.",
      "fileSize": 2441726412,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/Tepeyac1917_220",
      "collection": "feature_films",
      "downloads": 1987
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 5.7,
    "imdbVotes": 54,
    "Genre": "Drama",
    "Plot": "A man (Arroyo Carrillo) is sent to Europe on a diplomatic mission. The ship in which he travels is sunk by a German submarine. In Mexico, his girlfriend Lupita (Cota) receives a telegram with the news and looks for relief in La Virgen de Guadalupe, saint patron of catholic mexicans. After reading a book about the Virgin legend, Lupita falls asleep. Next morning, she receives good news, her boyfriend is alive. Together they go to La Villa del Tepeyac (a church devoted to La Virgen de Guadalupe) and thank for the miracle.",
    "Director": "Carlos E. González, José Manuel Ramos, Fernando Sáyago",
    "Writer": "Carlos E. González, José Manuel Ramos",
    "Actors": "Roberto Arroyo Carrillo, Pilar L. Cotta, Beatriz de Córdova",
    "Language": "None",
    "Country": "Mexico",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008663",
    "tt0008519",
    "tt0008133",
    "tt0007801",
    "tt0008188",
    "tt0008259",
    "tt0008443",
    "tt0007711",
    "tt0007958",
    "tt0007903",
    "tt0168593",
    "tt0142333"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.271Z"
}