{
  "movieId": "tt0027366",
  "title": "Black Gold",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Black_Gold",
      "id": "Black_Gold",
      "title": "Black Gold",
      "description": "\"Wildcat riggers risk their lives in the pursuit of oil. Their jobs get even more dangerous when ruthless oil baron J.C. Anderson (Berton Churchill) sets his sights on their territory. When longtime driller Dan O'Reilly (Frank Shannon) falls to his death from a well tower sabotaged by Anderson's strong-arm thugs, his teenage son 'Fishtail' (Frankie Darro) inherits the property and the troubles that come with it.",
      "fileSize": 1318816684,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/Black_Gold",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 67079
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XxoHXe_2y2o",
      "id": "XxoHXe_2y2o",
      "title": "Black Gold (1936) CRIME DRAMA",
      "description": "Stars: Frankie Darro, LeRoy Mason, Gloria Shea\nDirector: Russell Hopton\n\nAn oil-field action thriller directed by 'B' movie bad guy Russell Hopton.",
      "addedAt": "2025-12-26T23:50:23.293Z",
      "thumbnail": "https://i.ytimg.com/vi/XxoHXe_2y2o/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLA3yUzkTx473W5KCWaA5PULuIgYbA",
      "duration": 3264,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "57 min",
    "imdbRating": 5.2,
    "imdbVotes": 103,
    "Genre": "Action, Drama, Romance",
    "Plot": "Dan O'Reilly, who has spent forty years working in oil fields, is about to strike oil when his land lease nears its end. J. C. Anderson of the Anderson Producing and Refining Corp. discovers that Dan's well is the richest in the history of Anderson's oil field, but because Dan's contract insures him a ten year additional lease if he strikes oil, Anderson tries to pay Dan to abandon his well. When Dan refuses, Anderson's men sabotage his drill. Penniless, Dan resigns himself to take the money, until his son Clifford, called \"Fishtail,\" meets geologist Henry Langford, who promises to help. Henry then convinces Fishtail to go to school at night so that Henry can spend time with pretty schoolteacher Cynthia, who wants Fishtail to be the first O'Reilly to get an education. Then, when Henry discovers Anderson cheating the local independent contractors of a fair price for their oil, while unjustly foreclosing other leaseholders, he calls a town meeting. The townspeople confront Anderson, who appeases them, but the next day, while Dan rides the oil-drilling rig, the cables snap and he is killed. Henry is convinced Anderson is behind the murder. With two days left on the lease, Fishtail is nearly at oil sand when Anderson's thugs abduct Henry and Anderson tries to bribe Fishtail off the land. Fishtail refuses, so Anderson's men shut down the drill and knock him out. Henry, who has escaped, arrives in time to save Fishtail before Anderson's men dynamite the rig and the long-awaited oil is released. Cynthia, who has since fallen in love with Henry, then sends Fishtail to military school, and he returns a gentleman.",
    "Director": "Russell Hopton",
    "Writer": "Sascha Baraniey, Peter B. Kyne",
    "Actors": "Frankie Darro, LeRoy Mason, Gloria Shea",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030023",
    "tt0029830",
    "tt0029701",
    "tt0028592",
    "tt0028634",
    "tt0026489",
    "tt0029376",
    "tt0140551",
    "tt0030839",
    "tt0027008",
    "tt0169357",
    "tt0027057"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}