{
  "movieId": "tt0039137",
  "title": "Albéniz",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/albeniz-1947",
      "id": "albeniz-1947",
      "title": "Albeniz(1947)",
      "description": "Albéniz  es una  película   argentina  de 1947, dirigida por  Luis César Amadori , protagonizada por  Pedro López Lagar  y  Sabina Olmos . Estrenada en Buenos Aires el 4 de febrero de 1947. Ganadora del  Cóndor de Plata  como mejor película de 1948 y el actor  Pedro López Lagar  del premio al mejor actor (Wikipedia) Sinopsis La película está basada en la vida del compositor y pianista español  Isaac Albéniz . En este relato Albéniz es representado desde que era un  niño prodigio , tan talentoso que incluso se llega a decir que sus presentaciones eran un fraude. La película muestra también al niño como víctima de un padre tiránico, que intenta realizar sus propios deseos a través de su hijo. Para escapar de la presión de su padre, Albéniz huyó de su casa, primero hacia  América del Sur  y luego a  Estados Unidos . La vida personal del músico estaba marcada por tumultuosos romances. Albéniz volvió a  España , pero obtuvo una beca en el Conservatorio de  Bruselas  otorgada por el rey  Alfonso XII , pero una vez más el foco de su atención estuvo puesto en las mujeres, antes que en la música. El músico alcanzó fama internacional mediante conciertos que él mismo financiaba, obteniendo gran cantidad de premios. Reparto Pedro López Lagar  (Isaac Albéniz) Sabina Olmos Marisa Regules Pedro Aleandro Amadeo Novoa Andrés Mejuto Mercedes Díaz Susana Canales Federico Mansilla Eduardo Otero María Esther Podestá Lilian Valmar Berta Ortegosa Adolfo Linvel Miriam Sucre Pastora Soler César Fiaschi Eugenio Nigro Vicente Climent José María Gutiérrez Mario Cossa Arsenio Perdiguero Alfredo Prez Alfredo Alaria José Maurer Roberto Bordoni Paquita Más Herminio Baggini",
      "fileSize": 1896553406,
      "addedAt": "2026-01-07T00:07:24.995Z",
      "thumbnail": "https://archive.org/services/img/albeniz-1947",
      "language": "spa",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 143
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "125 min",
    "imdbRating": 5.9,
    "imdbVotes": 21,
    "Genre": "Biography, Drama",
    "Plot": "The film is based on the life of Spanish composer and pianist Isaac Albéniz. In this story Albéniz is represented since he was a child prodigy, so talented that even comes to say that his presentations were a fraud. The film also shows the child as the victim of a tyrannical father, who tries to fulfill his own desires through his son. To escape the pressure of his father, Albéniz fled his home, first to South America and then to the United States. The musician's personal life was marked by tumultuous romances. Albéniz returned to Spain, but received a scholarship at the Brussels Conservatory awarded by King Alfonso XII, but once again the focus of his attention was on women, rather than on music. The musician achieved international fame through concerts that he financed himself, obtaining many awards.",
    "Director": "Luis César Amadori",
    "Writer": "Pedro Miguel Obligado",
    "Actors": "Pedro López Lagar, Sabina Olmos, Marisa Regules",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    "tt0039178",
    "tt0042775",
    "tt0201263",
    "tt0178749",
    "tt0037576",
    "tt0038390",
    "tt0038120",
    "tt0041426",
    "tt0175437",
    "tt0178906",
    "tt0201411",
    "tt0178312"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.995Z"
}