{
  "movieId": "tt0042209",
  "title": "At War with the Army",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AtWarWithTheArmy",
      "id": "AtWarWithTheArmy",
      "title": "At War with the Army",
      "description": "This is a fun WWII-era B&W movie, full of Jerry Lewis and his ridiculous goofiness! Featuring Dean Martin and Jerry Lewis in their first collaboration. Jerry is a hapless private and Dean is the bossy First Sergeant of a slipshod platoon at a stateside training base. Jerry and Dean were friends who grew up in the same neighborhood before Uncle Sam made GIs out of them. All of the stereotypical military comedy characters are present, including the loudmouth drill instructor, the conniving supply sergeant, the doting corporal and the bumbling, hen-pecked company commander.",
      "fileSize": 2084941699,
      "addedAt": "2026-01-07T00:06:14.037Z",
      "thumbnail": "https://archive.org/services/img/AtWarWithTheArmy",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 313577
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/at-war-with-the-army-1950",
      "id": "at-war-with-the-army-1950",
      "title": "At War with the Army (1950)",
      "description": "Two former nightclub partners are now enlisted in the Army. Sergeant Puccinelli ranks above his former partner, Private First Class Korwin. Puccinelli is desperately trying to get transferred from his dull job to active duty overseas. Meanwhile, all Korwin wants is a pass to see his wife and new baby. Watch on RetroFlix:  https://retroflix.org/at-war-with-the-army-1950/",
      "fileSize": 1046229946,
      "addedAt": "2026-01-07T00:07:31.711Z",
      "thumbnail": "https://archive.org/services/img/at-war-with-the-army-1950",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 268
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AAriCP1Q10w",
      "id": "AAriCP1Q10w",
      "title": "At War with the Army (1950) | Colorized Public Domain Comedy with Dean Martin & Jerry Lewis Restored",
      "description": "At War with the Army (1950) is a classic American musical comedy film starring the iconic comedy duo Dean Martin and Jerry Lewis. Directed by Hal Walker, this was one of the earliest feature films to showcase Martin and Lewis together, cementing their on-screen chemistry and launching them toward legendary Hollywood careers. This restored and colorized edition revitalizes a mid-century public domain favorite, making it more accessible and engaging for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nSet during World War II in a Southern military training camp, the story follows two soldiers with very different personalities. First Lieutenant Vince Opposite (Dean Martin) is smooth, confident, and self-assured, always attracting the attention of women and commanding respect. His childhood friend, Private First Class Alvin Korwin (Jerry Lewis), is clumsy, naive, and constantly bungling his way through army life. Their reunion in the army camp sets the stage for a series of comedic misadventures, misunderstandings, and musical performances.\n\nThe plot unfolds as Alvin struggles with military discipline while Vince tries to balance duty, romance, and his growing frustration with Alvin’s antics. Between the comedic chaos, the film features musical numbers that highlight Dean Martin’s smooth singing voice and Jerry Lewis’s unmatched physical comedy. The dynamic between the two men reflects the classic straight man and comic pairing, making their routines timelessly entertaining.\n\nCast and Crew:\n• Director: Hal Walker\n• Writers: James B. Allardice (play), Fred F. Finklehoffe (screenplay)\n• Cinematography: Ernest Laszlo\n• Production Company: Paramount Pictures (later lapsed into public domain)\nStarring:\n• Dean Martin as First Lieutenant Vince Opposite\n• Jerry Lewis as Private First Class Alvin Korwin\n• Polly Bergen as Helen\n• Mike Kellin as Sergeant McVey\n• Jimmie Dundee as Private Pokey\n• Dick Stabile as himself (bandleader)\n\nFilm Significance:\nAt War with the Army represents an important moment in film history because it captured Martin and Lewis at the beginning of their decade-long run as one of America’s most successful comedy duos. Their partnership defined postwar comedy, blending slapstick, music, and fast-paced routines that influenced future entertainers. Dean Martin would later transition into solo superstardom as a singer and actor, while Jerry Lewis became one of the most influential comedians and directors of the 20th century.\nThe film also reflects the era’s fascination with lighthearted comedies set against the backdrop of World War II, a common theme for audiences seeking humor after years of global conflict. Today, it stands as a cultural artifact of both military comedy and early 1950s entertainment.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like At War with the Army remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1950 release was filmed in black and white, which was common for comedies of the time. While the humor and performances are timeless, many modern audiences skip black-and-white films entirely. By offering a restored and colorized version, we enhance the film’s visual appeal without compromising its original spirit. This edition allows viewers to enjoy Martin’s music and Lewis’s slapstick routines with modern clarity, ensuring the laughter translates across generations.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films spanning the silent era through the Golden Age of Hollywood. From timeless comedies to forgotten gems, our mission is to keep these works alive, relevant, and enjoyable for audiences in the USA, Europe, and worldwide.\n\n#AtWarWithTheArmy #DeanMartin #JerryLewis #1950sComedy #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #GoldenAgeHollywood #MusicalComedy",
      "addedAt": "2025-12-24T00:50:24.017Z",
      "thumbnail": "https://i.ytimg.com/vi/AAriCP1Q10w/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBUKEUwDw==&rs=AOn4CLD_dcUYeD5arimDEAOqmJOs9XRSGA",
      "duration": 5356,
      "language": "en",
      "year": 1950,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HEWMJNG3Lwc",
      "id": "HEWMJNG3Lwc",
      "title": "At War with the Army (1950) DEAN MARTIN🍕 JERRY LEWIS",
      "description": "It's Friday @PizzaFLIX\nStars: Dean Martin, Jerry Lewis, Polly Bergen\nDirector: Hal Walker\n\nWhen nightclub partners Dean Martin & Jerry Lewis enlist in the U.S. Army, they have different ambitions. Martin wants to see combat, while Lewis tries everything to avoid it.\n\nTRIVIA: When Jerry Lewis and Dean Martin signed with Paramount Pictures, it was with the proviso that they could make one film outside the studio every year for their own company, York Productions. This film was the first (and only) fruit of that negotiation, with the stars exchanging their usual salary for a 90% cut of the profits.",
      "addedAt": "2025-12-24T01:06:43.746Z",
      "thumbnail": "https://i.ytimg.com/vi/HEWMJNG3Lwc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCKU4Ly_AXQag1gQL1_1oiogWIKKw",
      "duration": 5591,
      "language": "en",
      "year": 1950,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/war-armies-4-k",
      "id": "war-armies-4-k",
      "title": "At War With The Army (1950) [Colorized, 4K, 60FPS]",
      "description": "At War With The Army is a 1950 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6577131586,
      "addedAt": "2026-01-07T00:13:06.701Z",
      "thumbnail": "https://archive.org/services/img/war-armies-4-k",
      "collection": "feature_films",
      "downloads": 455
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2NPfsJSBTT8",
      "id": "2NPfsJSBTT8",
      "title": "At War with the Army (1950) Dean Martin, Jerry Lewis | American musical comedy film",
      "description": "First Sergeant Vic Puccinelli and Private First Class Alvin Korwin, former nightclub partners, find themselves entangled in a series of comedic misadventures at a Kentucky army base. As they navigate military life, their antics crescendo towards a chaotic talent show performance, testing their friendship and resilience.\n\nDirected by Hal Walker\n\nMain Actors:\nDean Martin - 1st Sgt. Vic Puccinelli\nJerry Lewis - PFC Alvin Corwin\nMike Kellin - Sgt. McVey\nAngela Greene - Mrs. Deborah Caldwell\nTommy Farrell - Cpl. Clark\nPolly Bergen - Helen Palmer\nJean Ruth - Millie\nWilliam Mendrek - Capt. Ernest Caldwell\nDouglas Evans - Col. Davis\nKenneth Forbes - 2nd Lt Davenport\nDanny Dayton - Supply Sgt. Miller\nPaul Livermore - Pvt. Jack Edwards\nFrank Hyers - Cpl. Shaughnessy\nTy Perry - Lt. Terrey\nJimmie Dundee - Eddie\nDick Stabile - Pvt. Pokey\n\nBlack & White version https://youtu.be/Lk6RIhKiAvY\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:32:17.747Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/2NPfsJSBTT8/maxresdefault.webp?v=67e3d1c0",
      "duration": 5263,
      "language": "en",
      "year": 1950,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Lk6RIhKiAvY",
      "id": "Lk6RIhKiAvY",
      "title": "1950 - At War with the Army - America's Funniest Guys are GI's! Directed by Hal Walker",
      "description": "When former business partners Vic Puccinelli (Dean Martin) and Alvin Corwin (Jerry Lewis) enlist in the U.S. Army, they have different ambitions. Puccinelli, who has made the rank of sergeant, wants to see action rather than the drudgery of his current post. On the other hand, Korwin, who is a klutz, wants to stay out of combat and near his family in the United States. However, they both have to deal with stern Sgt. McVey (Mike Kellin) while also preparing for an Army variety show.\n\nOriginal title: At War with the Army\n\nColorized version https://youtu.be/2NPfsJSBTT8\n\n\nDirector: Hal Walker\nWriters: Fred F. Finklehoffe (screenplay), James B. Allardice (based on his play) \nCast: Dean Martin, Jerry Lewis,  Mike Kellin, Angela Greene \nGenres: Comedy, Musical, War \n\nRelease date: December 31, 1950 \nFilming location: Corriganville Movie Ranch\n\n\n00:00 Full movie with subtitles\n04:45 Jerry Lewis sings \"The Navy Gets the Gravy but the Army gets the Beans\"\n30:40 Dean Martin sings \"Tonda Wanda Hoy\"\n44:32 Jerry Lewis sings \"Tonda Wanda Hoy\"\n47:40 Dean Martin and Polly Bergen sing \"You and Your Beautiful Eyes\"\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:32:19.501Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Lk6RIhKiAvY/maxresdefault.webp?v=67ac07c6",
      "duration": 5263,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "93 min",
    "imdbRating": 5.5,
    "imdbVotes": 2798,
    "Genre": "Comedy, Musical, War",
    "Plot": "Before the war, Victor Puccinelli and Alvin Korwin were partners in a song and dance act, and friends. But now in the war as Sgt. Puccinelli and Pfc. Korwin in the same company at an army base stateside, they are finding it hard to maintain that friendship not only because of the differences in their ranks, but because of the differences in what they want being in the military which often places them at odds with each other. Vic wants to go overseas to fight in active duty, but while in the states, he, as a ladies man, has found a way to juggle several women on the go. He told Millie that he was on alert solely in wanting to break up with her in discovering she was not the brightest light in the world. And while he seems to like Helen Palmer more, he has told her the same, he dating her which is only complicated by she being the girlfriend Pvt. Jack Edwards, who wants to make Vic's life miserable when he discovers that Millie is again trying to enter his life. On the other hand, Alvin, who laments the poor quality of army food in often working mess detail, is happily married with their first child on the way, and as such all he wants is one three-day pass after another to be able to spend time at home with the family. Hijinks ensue for the pair as they try to achieve these goals within their situations while having to deal with the disparate group of other enlisted men and officers on the base.",
    "Director": "Hal Walker",
    "Writer": "James B. Allardice, Fred F. Finklehoffe",
    "Actors": "Dean Martin, Jerry Lewis, Mike Kellin",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0044119",
    "tt0044774",
    "tt0038119",
    "tt0045589",
    "tt0045094",
    "tt0041562",
    "tt0310604",
    "tt0194818",
    "tt0042447",
    "tt0043129",
    "tt0043983",
    "tt0041509"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.701Z"
}