{
  "imdbId": "tt0001733",
  "title": "The Lily of the Tenements",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheLilyOfTheTenements",
      "title": "\"The Lily Of The Tenements\" (1911) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Lily of the Tenements\" is a short drama. The film is included in our program to illustrate the work Billy Bitzer, a star of Silent Hall of Fame. A working girl lacking rent money tries to resist the unwelcome advances of her landlord. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Dorothy West, George Nichols, Clara Bracy, Francis Grandon Distributed by                   Biograph Company Release date                      February 27, 1911 Country                             United States Running time                    12 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 17527975,
      "id": "PreviewTheLilyOfTheTenements"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.4,
    "imdbVotes": 23,
    "Genre": "Short, Drama",
    "Plot": "Here we find a youthful toiler at a sewing machine eking the lives of her poor old mother and father. She receives a mere pittance for her labor, and this barely gives them plain food without having much for the rent of their cheerless rooms. The owner of the tenements calls for payment, and being a man of unconscionable principles offers her a means of ameliorating her condition and giving aid and ease to her and her own instead of the hopeless toil she is subjected to. The temptation is great, but her pure soul rebels against this contemptible assault and she sends him away, promising to pay the next day. What a rash promise, for she has no hopes aside from that which would be miraculous. Upon the owner's return to his office he is met by his son who is just back from college. This son is the father's one real love. He has built great hopes for him and at once makes him a member of the firm. The next day the owner goes to re-offer his proposition, feeling that by this time she has weakened in her determination. He feels assured when the girl in her hopeless condition seems compelled to make a sacrifice of herself. She, however, promises to give her decision next day. He has just left when she receives from the clothier a large order of sewing and so goes to beg for mercy and time in which to pay her rent. At the office she meets the son, who is deeply touched with the poor girl's condition and is further impressed by her innocent face. He at once decides to make an investigation, but business defers his errand until his father enters and tells him he will go, of course, with a different object in view. The poor girl at his entrance is as a lamb on the altar and he has come to claim the victim. The girl, with repugnance is about to yield, when the son with an urgent message for his father enters. He understands the situation at a glance and then and there denounces his father, bidding him good-bye forever. Hastening out he secures medical aid for his old folks and material assistance for all, promising to protect the girl for all time if she will allow, as her pitiful lot has aroused in him sincere, honest love.",
    "Director": "D.W. Griffith",
    "Writer": "N/A",
    "Actors": "Dorothy West, Clara T. Bracy, W. Chrystie Miller",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001388",
      "title": "Rose o' Salem Town",
      "year": 1910,
      "imdbRating": 5.7,
      "imdbVotes": 96,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001407",
      "title": "Sunshine Sue",
      "year": 1910,
      "imdbRating": 5.9,
      "imdbVotes": 21,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001510",
      "title": "Bobby, the Coward",
      "year": 1911,
      "imdbRating": 5.3,
      "imdbVotes": 68,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001913",
      "title": "Swords and Hearts",
      "year": 1911,
      "imdbRating": 5.4,
      "imdbVotes": 253,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001973",
      "title": "What Shall We Do with Our Old?",
      "year": 1911,
      "imdbRating": 6.1,
      "imdbVotes": 279,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002381",
      "title": "The Musketeers of Pig Alley",
      "year": 1912,
      "imdbRating": 6.6,
      "imdbVotes": 2540,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001150",
      "title": "A Child of the Ghetto",
      "year": 1910,
      "imdbRating": 5.4,
      "imdbVotes": 122,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001326",
      "title": "The Modern Prodigal",
      "year": 1910,
      "imdbRating": 5.5,
      "imdbVotes": 64,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002342",
      "title": "Man's Genesis",
      "year": 1912,
      "imdbRating": 5.7,
      "imdbVotes": 112,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002400",
      "title": "The Old Actor",
      "year": 1912,
      "imdbRating": 5.7,
      "imdbVotes": 264,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001315",
      "title": "The Message of the Violin",
      "year": 1910,
      "imdbRating": 6.9,
      "imdbVotes": 23,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001340",
      "title": "The Oath and the Man",
      "year": 1910,
      "imdbRating": 5.1,
      "imdbVotes": 104,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}