{
  "movieId": "tt0027382",
  "title": "Border Caballero",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/border_cabellero",
      "id": "border_cabellero",
      "title": "Border Caballero",
      "description": "After his friend is murdered, an FBI sharpshooter takes his place in trying to capture a gang of bankrobbers. You can find more information regarding this film on its IMDb page .",
      "fileSize": 4341909985,
      "addedAt": "2026-01-07T00:07:38.719Z",
      "thumbnail": "https://archive.org/services/img/border_cabellero",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 68106
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mpxxxSvZ_1g",
      "id": "mpxxxSvZ_1g",
      "title": "Border Caballero (1936) TIM McCOY",
      "description": "Stars: Tim McCoy, Lois January, Ralph Byrd\n Director: Sam Newfield\n\n Tex Weaver is working under cover to bring in a gang of bank robbers. When he is killed, Tim Ross, a marksman with Doc Shaw's traveling show, takes over. Posing as a Mexican he lays a trap for the gang.",
      "addedAt": "2025-12-26T23:53:48.101Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/mpxxxSvZ_1g/maxresdefault.webp",
      "duration": 3210,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "59 min",
    "imdbRating": 6.1,
    "imdbVotes": 85,
    "Genre": "Western",
    "Plot": "Tim Ross, formerly an agent for the Justice Department, is traveling with the Doc Shaw medicine show as a sharpshooter. He runs into an old friend, Tex Weaver, who is working undercover to roundup a bank-robbing band. Later, while Tex is holding a coin for Tim to shoot out of his hand at a show exhibition, another shot is fired from the outer circle of spectators at the same time as Tim fires. Tex falls dead. Everybody, but Tim and saloon girl Goldie Harris, Tex's girlfriend, is convinced that Tim misfired and hit his friend. Goldie has picked up the coin Tex was holding and knows Tim did not miss his intended target. Tim rejoins the federal service and swears vengeance on the real killer, Runniyon, a member of the gang. Disguised as a Mexican caballero (with an added mustache and a large sombrero and a larger accent),Tim goes to Clearwater, where he meets Goldie, who sees through his disguise and agrees to help him find the killer of her lover. Tim's investigations convince him that the secret head of the bank robbers is bank examiner Wiley Taggart, with the active leader being saloon owner Buff Brayden. Tim sets a trap by getting a fake message to Taggart and Brayden that a large sum of money has been deposited at the bank in Bordertown. Tim gets the outlaws but not before Goldie gets a bullet in her shoulder saving his life. Grittier than most B-series westerns and Lois January's \"Goldie\" is a smoldering little number.",
    "Director": "Sam Newfield",
    "Writer": "Norman S. Hall",
    "Actors": "Tim McCoy, Lois January, Ralph Byrd",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027886",
    "tt0028195",
    "tt0027255",
    "tt0027669",
    "tt0028404",
    "tt0028604",
    "tt0026157",
    "tt0029147",
    "tt0030581",
    "tt0030366",
    "tt0030001",
    "tt0030756"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.719Z"
}