{
  "imdbId": "tt0018440",
  "title": "Spring Fever",
  "year": 1927,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9JWfmA16pJQ",
      "title": "Spring Fever (1927) | Colorized Public Domain Romantic Comedy with William Haines & Joan Crawford",
      "description": "Spring Fever (1927) is a silent romantic comedy directed by Edward Sedgwick and produced by Metro-Goldwyn-Mayer during Hollywood’s Golden Age of silent cinema. This restored and colorized edition of the public domain classic revives one of MGM’s breezy comedies of the Jazz Age, showcasing the playful charisma of William Haines and the early screen presence of Joan Crawford before she became one of Hollywood’s greatest icons.\n\nPlot Summary:\nThe story follows Jack Kelly (William Haines), a brash and mischievous shipping clerk who unexpectedly finds himself drawn into the world of high-society golf. Determined to prove himself, Jack enters a championship tournament despite his lack of experience. There, he meets Allie Monte (Joan Crawford), a spirited young woman who quickly becomes his romantic interest.\n\nJack’s antics both on and off the golf course lead to comedic mishaps, misunderstandings, and clever reversals of fortune. With a mix of physical comedy and lighthearted romance, the film captures the clash between working-class ambition and aristocratic leisure culture. As the story unfolds, Jack’s determination and wit allow him to win more than just the tournament — he also wins Allie’s heart.\n\nCast and Crew:\n• Director: Edward Sedgwick\n• Producer: Metro-Goldwyn-Mayer\n• Cinematography: Clyde De Vinna\n• Editing: Sam Zimbalist\n\nStarring:\n• William Haines as Jack Kelly\n• Joan Crawford as Allie Monte\n• George K. Arthur as Tom\n• Edward Earle as William Monte\n• Jack Gardner as Dickie Long\n• Bert Roach as Al\n\nFilm Significance:\nSpring Fever is significant as an early romantic comedy pairing William Haines and Joan Crawford, two rising MGM stars of the 1920s. Haines was celebrated for his comedic timing and boyish charm, while Crawford, at this stage of her career, was transitioning from supporting roles to leading lady status.\n\nThe film is also a reflection of 1920s American culture, highlighting the popularity of golf among the wealthy elite and the comedic possibilities of class clashes. While not as remembered as Crawford’s later dramatic performances, this movie provides an entertaining glimpse of her early work and Haines’ dominance as one of the silent era’s top comedians.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Spring Fever remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1927 release was in black and white, standard for silent-era productions. While historically authentic, black-and-white films often struggle to capture attention from modern viewers. By presenting a restored, colorized version, this edition brings fresh vibrancy to William Haines’ comedy and Joan Crawford’s early performance, making the film more appealing to today’s audiences in the USA, Europe, and worldwide.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#SpringFever #JoanCrawford #WilliamHaines #SilentRomanticComedy #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentFilm #FilmRestoration #GoldenAgeHollywood",
      "id": "9JWfmA16pJQ",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/spring-fever-1927_202507",
      "title": "Spring Fever (1927)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. This popular, but critically panned, golf comedy follows a young couple as they meet, fall in love, try to find out whether the other is a gold-digger, and whether or not their elopement marriage will survive past the week. Oh, and there is occasionally golfing as well.  The footage here is as clean as possible given how damaged the reels must have been. It remains eminently watchable.",
      "id": "spring-fever-1927_202507"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/spring-fever_1927",
      "title": "Spring Fever",
      "id": "spring-fever_1927"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "78 min",
    "imdbRating": "6.5",
    "imdbVotes": "1,050",
    "Genre": "Comedy",
    "Plot": "To impress a wealthy young woman, a clerk pretends he is a pro-golfer.",
    "Director": "Edward Sedgwick",
    "Writer": "Frank Davis, Vincent Lawrence, Albert Lewin",
    "Actors": "William Haines, Joan Crawford, George K. Arthur",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0017534",
      "title": "West Point",
      "year": 1927,
      "imdbRating": "6.6",
      "imdbVotes": "1,947",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020902",
      "title": "Free and Easy",
      "year": 1930,
      "imdbRating": "5.5",
      "imdbVotes": "1,057",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020838",
      "title": "Doughboys",
      "year": 1930,
      "imdbRating": "5.7",
      "imdbVotes": "525",
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022254",
      "title": "Parlor, Bedroom and Bath",
      "year": 1931,
      "imdbRating": "6.1",
      "imdbVotes": "1,041",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023322",
      "title": "The Passionate Plumber",
      "year": 1932,
      "imdbRating": "5.9",
      "imdbVotes": "599",
      "language": "English, French, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029488",
      "title": "Riding on Air",
      "year": 1937,
      "imdbRating": "5.0",
      "imdbVotes": "131",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023498",
      "title": "Speak Easily",
      "year": 1932,
      "imdbRating": "5.8",
      "imdbVotes": "1,245",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028876",
      "title": "Fit for a King",
      "year": 1937,
      "imdbRating": "5.6",
      "imdbVotes": "136",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024762",
      "title": "What-No Beer?",
      "year": 1933,
      "imdbRating": "5.6",
      "imdbVotes": "603",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018825",
      "title": "Detectives",
      "year": 1928,
      "imdbRating": "8.1",
      "imdbVotes": "32",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018471",
      "title": "Tell It to the Marines",
      "year": 1926,
      "imdbRating": "7.1",
      "imdbVotes": "1,677",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019400",
      "title": "The Smart Set",
      "year": 1928,
      "imdbRating": "6.3",
      "imdbVotes": "1,059",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:35.627Z"
}