{
  "movieId": "tt0031506",
  "title": "Jeepers Creepers",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jeepers-creepers-1939",
      "id": "jeepers-creepers-1939",
      "title": "Jeepers Creepers (1939)",
      "description": "Police officer Porky is called to investigate strange noises at a house that might be haunted. Before he arrives, we tour the house and hear some evil-sounding cackles, which, it turns out, are coming from a radio one that a ghost was listening to. The ghost then sings the title song while getting ready for a night of haunting.",
      "fileSize": 1003754044,
      "addedAt": "2026-01-07T00:08:54.189Z",
      "thumbnail": "https://archive.org/services/img/jeepers-creepers-1939",
      "language": "eng",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 668
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 6.7,
    "imdbVotes": 286,
    "Genre": "Horror, Family, Animation",
    "Plot": "Police officer Porky is called to investigate strange noises at a house that might be haunted. Before he arrives, we tour the house and hear some evil-sounding cackles, which, it turns out, are coming from a radio one that a ghost was listening to. The ghost then sings the title song while getting ready for a night of haunting, just as Porky arrives. The ghost invites him in with a woman's voice, then disappears. Porky comes in and gets spooked by some flapping curtains. When he comes back in, the ghost puts a couple frogs into a pair of shoes and sets them loose; they collect a hatrack and a curtain, forming a sort of black ghost that ultimately scares Porky upstairs right into the arms of the ghost. He beats a hasty retreat...",
    "Director": "Robert Clampett",
    "Writer": "Ernest Gee",
    "Actors": "Mel Blanc, Pinto Colvig",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031588",
    "tt0031153",
    "tt0031713",
    "tt0031799",
    "tt0031813",
    "tt0031814",
    "tt0031815",
    "tt0031816",
    "tt0031899",
    "tt0032134",
    "tt0032190",
    "tt0032895"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.189Z"
}