{
  "imdbId": "tt0017739",
  "title": "The Cat and the Canary",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Cat_and_the_Canary",
      "title": "The Cat And The Canary",
      "description": "From IMDb : Rich old Cyrus West's relatives are waiting for him to die so they can inherit. But he stipulates that his will be read 20 years after his death. On the appointed day his expectant heirs arrive at his brooding mansion. The will is read and it turns out that Annabelle West, the only heir who shares his name, inherits, if she is deemed sane. If she isn't, the money and some diamonds go to someone else, whose name is in a sealed envelope. Before he can reveal the identity of Annabelle's successor, Mr. Crosby, the lawyer, disappears. This is the first in a series of mysterious events, some of which point to Annabelle in fact being unstable. Stars: Laura La Plante, Creighton Hale, Forrest Stanley, Tully Marshall, and Gertrude Astor",
      "id": "The_Cat_and_the_Canary"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/catcanary-4-k",
      "title": "Catcanary 4 K",
      "id": "catcanary-4-k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OBzDCT3FHQ4",
      "title": "The Cat and the Canary (1927) | Colorized Public Domain Silent Horror Classic by Paul Leni | Willard",
      "description": "The Cat and the Canary (1927) is a landmark silent horror-comedy directed by Paul Leni and produced by Universal Pictures, known for shaping the future of Hollywood’s horror cinema. This colorized and digitally restored edition by Colorized Public Domain revives the film’s chilling atmosphere and visual innovation that made it the blueprint for the “haunted house” genre. Adapted from John Willard’s 1922 stage play, this version allows modern audiences in the United States, Europe, and worldwide to experience the film’s gothic tension and dark humor in immersive color and clarity.\n\nPlot Summary:\nTwenty years after the death of eccentric millionaire Cyrus West, his relatives are summoned to his decaying mansion for the reading of his will. In a setting filled with cobwebs, secret doors, and flickering candlelight, attorney Roger Crosby announces that Annabelle West (Laura La Plante) will inherit the entire estate — but only if she is proven sane. If she shows signs of madness, the fortune passes to another heir. Moments later, the lights go out, the lawyer disappears, and an escaped lunatic known as “The Cat” is rumored to be inside the mansion. Terrified guests turn on one another as whispers of insanity and greed echo through the halls. Annabelle, frightened yet determined, must survive the night and uncover the truth before the killer strikes again. Combining psychological suspense with dark humor, the film keeps viewers guessing until the final revelation.\n\nCast and Crew:\n• Director: Paul Leni\n• Producer: Universal Pictures\n• Based on: The play “The Cat and the Canary” by John Willard\n• Cinematography: Gilbert Warrenton\n• Art Direction: Charles D. Hall\nStarring:\n• Laura La Plante as Annabelle West\n• Creighton Hale as Paul Jones\n• Forrest Stanley as Charles Wilder\n• Tully Marshall as Roger Crosby\n• Gertrude Astor as Cecily Young\n• Flora Finch as Susan Sillsby\n• Martha Mattox as Mammy Pleasant\n• Arthur Edmund Carewe as Harry Blythe\n• George Siegmann as The Guard\n\nFilm Significance:\nThe Cat and the Canary stands as a cornerstone of early American horror cinema, merging German Expressionist style with Hollywood storytelling. Paul Leni, fresh from the German film industry, brought stylized set design, exaggerated shadows, and creative camera angles that revolutionized visual storytelling in the United States. The film’s success established Universal Pictures as a leader in the horror genre and inspired later classics such as Dracula (1931), Frankenstein (1931), and The Old Dark House (1932). Its fusion of comedy, tension, and visual spectacle became the standard for “haunted mansion” mysteries and directly influenced Alfred Hitchcock’s early thrillers. Modern critics recognize it as one of the most influential silent films, proving that horror can blend fear, wit, and atmosphere with lasting cultural impact.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Cat and the Canary remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white on nitrate film stock, The Cat and the Canary suffered from visual degradation over time. This colorized edition revitalizes its eerie charm — from the deep shadows of the haunted mansion to the flicker of candle flames illuminating the terrified faces of its guests. Each frame has been digitally restored and enhanced to bring out texture, contrast, and spatial depth that silent-era audiences could only imagine. The result is a visually rich experience that bridges 1920s artistry with today’s standards of cinematic quality, making it ideal for modern large-screen TV viewers and film enthusiasts seeking immersive historical entertainment.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the silent and early sound eras — from legendary horrors to lost dramas — ensuring that cinematic history remains discoverable and engaging for audiences across the USA, Europe, and worldwide.\n\n#TheCatAndTheCanary #PaulLeni #LauraLaPlante #SilentHorror #PublicDomainMovie #ColorizedClassic #UniversalPictures #1920sCinema #FilmRestoration #HauntedHouseClassic",
      "id": "OBzDCT3FHQ4",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "108 min",
    "imdbRating": "7.1",
    "imdbVotes": "3,473",
    "Genre": "Comedy, Horror, Mystery",
    "Plot": "Rich old Cyrus West's relatives are waiting for him to die so they can inherit. But he stipulates that his will be read 20 years after his death. On the appointed day his expectant heirs arrive at his brooding mansion. The will is read and it turns out that Annabelle West, the only heir with his name left, inherits, if she is deemed sane. If she isn't, the money and some diamonds go to someone else, whose name is in a sealed envelope. Before he can reveal the identity of her successor to Annabelle, Mr. Crosby, the lawyer, disappears. The first in a series of mysterious events, some of which point to Annabelle in fact being unstable.",
    "Director": "Paul Leni",
    "Writer": "John Willard, Robert F. Hill, Alfred A. Cohn",
    "Actors": "Laura La Plante, Creighton Hale, Forrest Stanley",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0020080",
      "title": "The Last Warning",
      "year": 1928,
      "imdbRating": "6.9",
      "imdbVotes": "862",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019130",
      "title": "The Man Who Laughs",
      "year": 1928,
      "imdbRating": "7.6",
      "imdbVotes": "8,604",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0016123",
      "title": "The Monster",
      "year": 1925,
      "imdbRating": "6.2",
      "imdbVotes": "1,334",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013458",
      "title": "One Exciting Night",
      "year": 1922,
      "imdbRating": "5.3",
      "imdbVotes": "198",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026819",
      "title": "One Frightened Night",
      "year": 1935,
      "imdbRating": "6.0",
      "imdbVotes": "479",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037151",
      "title": "One Body Too Many",
      "year": 1944,
      "imdbRating": "5.4",
      "imdbVotes": "1,582",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025169",
      "title": "The Ghost Walks",
      "year": 1934,
      "imdbRating": "5.6",
      "imdbVotes": "663",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031143",
      "title": "The Cat and the Canary",
      "year": 1939,
      "imdbRating": "7.1",
      "imdbVotes": "3,911",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0057156",
      "title": "The Horror of It All",
      "year": 1964,
      "imdbRating": "4.8",
      "imdbVotes": "442",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0056285",
      "title": "No Place Like Homicide!",
      "year": 1961,
      "imdbRating": "6.3",
      "imdbVotes": "1,029",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034850",
      "title": "The Hidden Hand",
      "year": 1942,
      "imdbRating": "6.1",
      "imdbVotes": "686",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1100053",
      "title": "Tormented",
      "year": 2009,
      "imdbRating": "5.1",
      "imdbVotes": "6,636",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T14:26:33.770Z"
}