{
  "movieId": "tt0003772",
  "title": "Cinderella",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Cinderella1914_201312",
      "id": "Cinderella1914_201312",
      "title": "\"Cinderella\" (1914) starring Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Cinderella\" (1914) is a fantasy film, based on the fairy tale by Charles Perrault. Mary Pickford stars opposite Owen Moore, who was her husband at the time.   Directed by                    James Kirkwood Produced by                  Famous Players Film Company Written by                     Charles Perrault Starring                         Mary Pickford, Owen Moore Release date                   December 28, 1914 Running time                 51 minutes Country                          United States Language                        Silent film   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 37714002,
      "addedAt": "2026-01-07T00:06:19.366Z",
      "thumbnail": "https://archive.org/services/img/Cinderella1914_201312",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 7042
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "52 min",
    "imdbRating": 6.1,
    "imdbVotes": 1070,
    "Genre": "Fantasy, Drama",
    "Plot": "Based on the fairy tale: Cinderella is mistreated by her stepmother and stepsisters, and is forced to live as their servant. One day, the Fairy Godmother appears to the family disguised as an elderly, destitute woman. The others treat her harshly, but Cinderella is kind to her and feeds her. The Fairy Godmother invisibly helps Cinderella, helping her when she goes to gather wood, and enabling her to meet Prince Charming as he travels through the forest. Soon afterward, the king plans a great ball so that the prince can meet all the women and choose one for his bride. Cinderella must help her family prepare for the ball, while she stays at home. But the Fairy Godmother appears again, and miraculously enables Cinderella to go after all, with dramatic consequences.",
    "Director": "James Kirkwood",
    "Writer": "Charles Perrault",
    "Actors": "Mary Pickford, Owen Moore, Isabel Vernon",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005302",
    "tt0003516",
    "tt0004134",
    "tt0003419",
    "tt0417062",
    "tt0000488",
    "tt0004681",
    "tt0002130",
    "tt0005951",
    "tt0003497",
    "tt0001544",
    "tt0191358"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.366Z"
}