{
  "movieId": "tt0000355",
  "title": "Fire!",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/fire-1901-directed-by-james-williamson",
      "id": "fire-1901-directed-by-james-williamson",
      "title": "Fire! (1901) Directed By James Williamson",
      "description": "Fire! (1901) Director: James Williamson Fire! is a 1901 British short silent drama film, directed by James Williamson, showing the occupants of a house in Hove being rescued by the local fire service. Description: This five tableaux film, according to Michael Brooke of Screenonline, \"was one of the very first films to make use of multiple shots edited together to create a chronological sequence propelling a coherent narrative along. Williamson also creates suspense by showing the audience the extent of the fire in the first shot, which heightens the sense of urgency as the fire crew (who lack this privileged information) leave the station and rush to put it out.\" It was released along with Stop Thief! (1901), \"indicating the direction Williamson would take over the next few years, as he refined this new film grammar to tell stories of unprecedented narrative and emotional sophistication.\" \"Brooke also states that it was \"a major influence on a pioneering American film, Edwin S. Porter's Life of an American Fireman (1903), which borrowed Williamson's narrative model and developed it further by introducing close-ups.\"- Production: The director made the film at a derelict house called Ivy Lodge in Hove, where he had previously shot Attack on a China Mission (1900). References: Brooke, Michael. \"Fire!\". BFI Screenonline Database. Retrieved 24 April 2011. -wikipedia",
      "fileSize": 15968190,
      "addedAt": "2026-01-07T00:08:24.395Z",
      "thumbnail": "https://archive.org/services/img/fire-1901-directed-by-james-williamson",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 92
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-fire",
      "id": "silent-fire",
      "title": "Fire!",
      "fileSize": 85538668,
      "addedAt": "2026-01-07T00:10:59.117Z",
      "thumbnail": "https://archive.org/services/img/silent-fire",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 431
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "5 min",
    "imdbRating": 6.2,
    "imdbVotes": 804,
    "Genre": "Short, Action, Drama",
    "Plot": "Firefighters ring for help, and here comes the ladder cart; they hitch a horse to it. A second horse-drawn truck joins the first, and they head down the street to a house fire. Inside a man sleeps, he awakes amidst flames and throws himself back on the bed. In comes a firefighter, hosing down the blaze. He carries out the victim, down a ladder to safety. Other firefighters enter the house to save belongings, and out comes one with a baby. The saved man rejoices, but it's not over yet. Another resident appears upstairs. He jumps.",
    "Director": "James Williamson",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0438165",
    "tt0132534",
    "tt0000273",
    "tt1090274",
    "tt0249600",
    "tt0000416",
    "tt0288468",
    "tt0234913",
    "tt0445338",
    "tt0132077",
    "tt0419034",
    "tt0000471"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.117Z"
}