{
  "imdbId": "tt0001459",
  "title": "Winning Back His Love",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WinningBackHisLove",
      "title": "\"Winning Back His Love\" (1910) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"Winning Back His Love\" is a short drama. The film is included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Wilfred Lucas, Stephanie Longfellow, Vivian Prescott, Edwin August  Distributed by                   Biograph Company Release date                      December 26, 1910 Country                             United States Running time                    12 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 7621773,
      "id": "WinningBackHisLove"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.5,
    "imdbVotes": 65,
    "Genre": "Drama, Short, Romance",
    "Plot": "Mrs. Wallace is possessed of a disturbing premonition that her husband's love is waning, and truth to say her fears are well grounded, for although she doesn't know of anything conclusively, still there is a reason, and that reason is Vera Blair, a show girl, who, believing Frederick Wallace to be a single man, is attracted by him and successfully fascinates him. He has spent several evenings in her company and now finds her irresistible. Hence, when he receives a note asking him to accompany her to a little after-the-show supper, he hastens to comply. This note falls into the hands of the wife, who is beside herself with grief, when Bob Martin, a friend of the family, appears. Upon learning the cause of her woe, he suggests a plan to cure Fred of his folly. This remedy is to pay him back in his own coin, to wit: visit the café in his company and pretend a reckless abandon, thereby putting the \"shoe on the other foot.\" Repugnant as this procedure is to her, she is induced to consent as it will mean one thing or the other decisively. Fred has arrived at the stage door and meeting the girl, he is just leaving for the café when the wife and friend appear in the distance. They follow and secure the adjoining private booth to that occupied by Fred and the girl. It isn't long before Fred hears the clink of glasses and a hilarious laugh that is unmistakably his wife's. Stealthily drawing the curtain dividing the booths aside the sight that greets him freezes his blood, for there is his wife, with an empty wine glass in her hand, apparently in a state of mild intoxication, accompanied by their dearest friend, in an instant he is towering with rage. His wife in such a place drinking with his friend, outrageous! Ah! but he doesn't yet appreciate the enormity of his own fault. Getting the girl into another room by subterfuge, he bursts in upon what he deems the guilty pair. Urged by the friend, the wife continues to play her part, though her heart is well near breaking, and almost rebels. At this point the girl returns for her gloves which she dropped and learns now that he is a married man. She scorns him with even more vehemence than his wife appears to do, and departs, the wife leaving at the same time. Left alone, he now realizes his profligacy and the value of his wife's love, which he imagines he has lost. As he sits there alone, he is in the depths of desperation when he espies on the table a water glass filled with wine, it is now clear to him. His wife did not drink, but poured the wine into this glass and pretended intoxication to show him the error of his way, which he now sees only too clearly. What a wretch he has been. What a jewel she is to suffer indignity for his sake. Jumping up from the table, he rushes home with a firm purpose of amendment, bestowing upon her the love and attention she hungered for.",
    "Director": "D.W. Griffith",
    "Writer": "Anthony Donnelly",
    "Actors": "Wilfred Lucas, Stephanie Longfellow, Vivian Prescott",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001371",
      "title": "Ramona",
      "year": 1910,
      "imdbRating": 5.8,
      "imdbVotes": 449,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001615",
      "title": "Fisher Folks",
      "year": 1911,
      "imdbRating": 4.9,
      "imdbVotes": 39,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001978",
      "title": "When a Man Loves",
      "year": 1911,
      "imdbRating": 6,
      "imdbVotes": 33,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001740",
      "title": "The Lonedale Operator",
      "year": 1911,
      "imdbRating": 6.5,
      "imdbVotes": 1322,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002512",
      "title": "The Sunbeam",
      "year": 1912,
      "imdbRating": 6.2,
      "imdbVotes": 412,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001262",
      "title": "In Life's Cycle",
      "year": 1910,
      "imdbRating": 5.2,
      "imdbVotes": 32,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001385",
      "title": "The Rocky Road",
      "year": 1910,
      "imdbRating": 5.5,
      "imdbVotes": 78,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001284",
      "title": "The Lesson",
      "year": 1910,
      "imdbRating": 4.9,
      "imdbVotes": 53,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": 6.1,
      "imdbVotes": 625,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001050",
      "title": "A Strange Meeting",
      "year": 1909,
      "imdbRating": 4.9,
      "imdbVotes": 90,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001987",
      "title": "A Woman Scorned",
      "year": 1911,
      "imdbRating": 6.2,
      "imdbVotes": 25,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001593",
      "title": "Enoch Arden: Part I",
      "year": 1911,
      "imdbRating": 6.3,
      "imdbVotes": 393,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.436Z"
}