{
  "imdbId": "tt0041958",
  "title": "Thieves' Highway",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1949-thieves-highway-mercado-de-ladrones-jules-dassin-vose",
      "id": "1949-thieves-highway-mercado-de-ladrones-jules-dassin-vose",
      "title": "1949 - Thieves Highway - Mercado de ladrones - Jules Dassin - VOSE",
      "description": "derechonoir.wordpress.com t.me/agendasocioculturalplus",
      "fileSize": 446315867,
      "addedAt": "2026-01-07T00:06:06.561Z",
      "thumbnail": "https://archive.org/services/img/1949-thieves-highway-mercado-de-ladrones-jules-dassin-vose",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 1080
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thieves-highway-1949",
      "id": "thieves-highway-1949",
      "title": "Thieves' Highway (1949)",
      "description": "Nick Garcos comes back from his tour of duty in World War II planning to settle down with his girlfriend, Polly Faber. He learns, however, that his father was recently beaten and burglarized by mob-connected trucker Mike Figlia, and Nick resolves to get even. He partners with prostitute Rica, and together they go after Mike, all the while getting pulled further into the local crime underworld. Watch on RetroFlix:  https://retroflix.org/thieves-highway-1949/",
      "fileSize": 610439155,
      "addedAt": "2026-01-07T00:12:44.282Z",
      "thumbnail": "https://archive.org/services/img/thieves-highway-1949",
      "language": "eng",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 93
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thieveshighway1948",
      "id": "thieveshighway1948",
      "title": "Thieves' Highway (1949) Dir: Jules Dassin, Starring Richard Conte, Lee J Cobb, Valentina Cortese",
      "description": "Thieves' Highway is a 1949 film noir directed by Jules Dassin. starring Richard Conte, Lee J Cobb, Valentina Cortese. The screenplay was written by A. I. Bezzerides, based on his novel Thieves' Market.   Find out more about the movie here .",
      "fileSize": 358791801,
      "addedAt": "2026-01-07T00:12:44.282Z",
      "thumbnail": "https://archive.org/services/img/thieveshighway1948",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 12930
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "94 min",
    "imdbRating": 7.5,
    "imdbVotes": 7130,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "The soldier Nick Garcos returns back home from the war very happy, with gifts for his parents Yanko and Parthena Garcos and money in his pocket to open a business and marry his girlfriend Polly Faber. Out of the blue, Nick realizes that his father has lost both legs. Yanko, who was a truck driver, says that he was cheated by a dealer, Mike Figlia, in a San Francisco market when he delivered a truckload of tomatoes but was not paid. He believes that his accident was caused by Figlia's gangsters. Yanko also says that he then sold the truck to a driver named Ed Kinney who has not paid him. Nick meets Ed and says that he will take back the truck, but Ed proposes a deal with apples, where they may earn a great amount of money. Nick invests his savings in another truck and buys apples from a Polish farmer. They need to drive directly to the market in San Francisco without sleeping to keep the fruit fresh; but Ed's truck has problem with its axle, and Nick arrives first. Mike Figlia hires the Italian whore Rica to distract Nick but she falls for him and tells him that Mike is robbing his cargo. Mike is forced to share his earnings with Nick, who earns a large amount. Then Nick calls Polly and asks her to meet him to get married. Rica tells Nick that Polly is only interested in his money. When Nick is robbed by Mike's gangsters, he learns who really loves him. But Nick still has to settle the score with Mike.",
    "Director": "Jules Dassin",
    "Writer": "A.I. Bezzerides",
    "Actors": "Richard Conte, Valentina Cortese, Lee J. Cobb",
    "Language": "English, Italian, Greek",
    "Country": "United States",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    "tt0040636",
    "tt0039224",
    "tt0041487",
    "tt0040257",
    "tt0042788",
    "tt0042707",
    "tt0042039",
    "tt0039515",
    "tt0043646",
    "tt0043660",
    "tt0043086",
    "tt0041503"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "film-noir",
      "name": "Film Noir"
    },
    {
      "id": "1940s",
      "name": "1940s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.282Z"
}