{
  "movieId": "tt0052027",
  "title": "The Old Man and the Sea",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-old-man-and-the-sea-1958",
      "id": "the-old-man-and-the-sea-1958",
      "title": "The Old Man And The Sea (1958) Spencer Tracy · Felipe Pazos jr.",
      "description": "An adventurous drama based on Hemingway An old fisherman makes the catch of a lifetime: He wrestles with a giant fish for three days before finally conquering it. But the journey home turns into a disaster... In 1958, Western specialist John Sturges directed Ernest Hemingway's novel, which was considered \"unfilmable.\" The work is brought to life primarily by Spencer Tracy, who delivers a magnificent performance in the role of the lonely fisherman. .. Magnificent adaptation of a classic book..",
      "fileSize": 2767286846,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-old-man-and-the-sea-1958",
      "language": "eng",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 385
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-old-man-and-the-sea-1958_202511",
      "id": "the-old-man-and-the-sea-1958_202511",
      "title": "The Old Man and the Sea (1958)",
      "description": "The Old Man and the Sea is a novella by Ernest Hemingway that tells the story of Santiago, an aging Cuban fisherman who struggles with a long stretch of bad luck. For 84 days, he has gone without catching a fish, leaving him considered \"salao,\" or unlucky. On the 85th day, Santiago sets out into the Gulf Stream, determined to change his fortune. He sails far into the sea and hooks a gigantic marlin, a fish much larger than his small boat. The struggle between Santiago and the marlin lasts for three days and nights, testing the old man's physical and mental strength. Despite his fatigue and pain, Santiago showcases profound respect for the marlin, viewing it as a noble adversary. He reflects on his connection to the creature and nature, feeling a deep sense of unity. As he finally manages to catch the fish, he ties it alongside his skiff, exhausted but triumphant.However, Santiago's victory is short-lived. On his way back to shore, sharks are drawn to the marlin's blood. Despite his best efforts to fend them off, they attack and devour much of the fish. By the time Santiago returns home, he finds only the marlin's skeleton left.Though he returns empty-handed, Santiago's journey embodies themes of perseverance, pride, and the relationship between man and nature. He may not have caught the marlin intact, but his spirit and determination leave a lasting impression on the village, reflecting the essence of human struggle. The novella concludes with Santiago dreaming of lions, symbolizing hope and the indomitable human spirit. ",
      "fileSize": 788471572,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-old-man-and-the-sea-1958_202511",
      "language": "eng",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 271
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "86 min",
    "imdbRating": 6.9,
    "imdbVotes": 8800,
    "Genre": "Adventure, Drama",
    "Plot": "Now an old man, a lifelong fisherman sets out to sea to ply his trade as he has done all of his life. He's not had much good fortune of late and has gone almost three months without a major catch while others are catching one or even two large marlins every week. Many of the locals make fun of him and some say he's too old now to be fishing but he still loves what he does and is encouraged by a young boy who loves him and has faith in him. On this day he hooks the fish of a lifetime, a marlin that is larger than his skiff. As it slowly pulls him out to sea, the old man reminisces about his past, his successes and the high points of his life. When he does finally manage to land the fish he has to fight off sharks who are feeding on it as he tries to return to his Cuban village.",
    "Director": "John Sturges, Fred Zinnemann",
    "Writer": "Ernest Hemingway, Peter Viertel",
    "Actors": "Spencer Tracy, Felipe Pazos, Harry Bellaver",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 6 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt0049523",
    "tt0052170",
    "tt0051702",
    "tt0051398",
    "tt0053935",
    "tt0051808",
    "tt0052604",
    "tt0167346",
    "tt0050803",
    "tt0052538",
    "tt0050208",
    "tt0050225"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}