{
  "imdbId": "tt0011128",
  "title": "Down on the Farm",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-down-on-the-farm",
      "id": "silent-down-on-the-farm",
      "title": "Down on the Farm",
      "fileSize": 1979733214,
      "addedAt": "2026-01-07T00:10:59.116Z",
      "thumbnail": "https://archive.org/services/img/silent-down-on-the-farm",
      "language": "English",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 558
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "50 min",
    "imdbRating": 6.3,
    "imdbVotes": 156,
    "Genre": "Comedy",
    "Plot": "The day starts off as any normal day on Roach's farm, where Teddy, the farmhouse dog, is doing more productive work than everyone else combined. But the day changes when Roach's farmhand sees an opportunity to be the knight in shining armor to Louise, Roach's daughter, who he wants to marry. Roach, however will not have his daughter marry a lowly farmhand, although Louise loves the farmhand. It's also rent day, and their landlord - the mortgage holder of the farm - is making his rounds to collect the moneys. He uses his position of power to garner sexual favors from women in return for non-eviction. Having never met Louise, the landlord immediately falls in love with her, who he too wants to marry. Louise hatches a plan to throw off the landlord's unwanted advances. That plan has unintended consequences. Add to the mix Louise's fear of mice, the landlord intercepting an important letter to Roach, a collar salesman and his missing infant son, and it becomes unclear who Roach will allow marry his daughter and if she will get married at all.",
    "Director": "Ray Grey, F. Richard Jones, Erle C. Kenton",
    "Writer": "Ray Grey, Raymond Griffith, Mack Sennett",
    "Actors": "Louise Fazenda, Harry Gribbon, Bert Roach",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0011656",
    "tt0011071",
    "tt0011267",
    "tt0367898",
    "tt1598572",
    "tt0011508",
    "tt0011521",
    "tt0011541",
    "tt0011588",
    "tt0011741",
    "tt0011193",
    "tt0011848"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.116Z"
}