{
  "movieId": "tt0049693",
  "title": "Rumble on the Docks",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rumble-on-the-docks-1956",
      "id": "rumble-on-the-docks-1956",
      "title": "Rumble on the Docks (1956) Directed by Fred F. Sears, Starring James Darren, Laurie Carroll, Robert Blake",
      "description": "Rumble on the Docks is a 1956 American crime FILM NOlR directed by Fred F. Sears and starring James Darren. It is based on the rivalry between two gangs living near the Brooklyn docks.",
      "fileSize": 1408345805,
      "addedAt": "2026-01-07T00:10:40.951Z",
      "thumbnail": "https://archive.org/services/img/rumble-on-the-docks-1956",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 633
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "82 min",
    "imdbRating": 5.6,
    "imdbVotes": 288,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "In 1950s Brooklyn, 17-year old Jimmy Smigelski, son of hard-working, honest Polish immigrants, is at odds with his father, Pete Smigelski. His father tries to instill in Jimmy his values of hard work, respect for the law and love of family. Jimmy, however, prefers to hang around the streets with his gang, the 'Diggers', get into fights with rival gangs, such as the 'Stompers', and annoy the neighborhood cops. His father is a bitter crippled man with a beef against the dockside mobsters, led by boss Joe Brindo, who set-up the 'accident' that crippled Pete. Although the official inquiry determined that an accident had occurred, Pete is convinced that it was Brindo's mob that arranged the mishap, in order to punish Pete for trying to unionize the dock longshoremen and for speaking out against Brindo's racketeering. Unfortunately, Jimmy, doesn't share his father's feelings and, worse still, admires men like Brindo who lead a flashy lifestyle. Pete runs a small printing shop and still attacks Brindo's activities, in print, despite the mobster's attempts to intimidate the old man. Pete also tries to revive his old dream of unionizing the dock workers, which would mean the end of Brindo's grip on the long-shore business. When Jimmy saves a girl, Della, from the clutches of two 'Stompers', a protracted war between that gang and the 'Diggers' begins, often leading to rumbles, property damage, arrests by the police and court appearances. Jimmy and Della fall in-love and she tries to persuade him to give up his gang lifestyle but Jimmy is stubborn. Fed-up with his son's lawlessness, Pete Smigelski throws his son out of the house. Taking advantage of this situation, mob boss Joe Brindo takes Jimmy under his wing and even offers Jimmy shelter and that flashy lifestyle Jimmy dreamed of. But Jimmy learns that everything comes at a price when the mobster asks Jimmy to falsely testify in a court case involving first-degree murder. Initially, Jimmy agrees to the scheme but when he starts having second-thoughts, Brindo and his main henchman, Frank Mangus, come gunning for Jimmy.",
    "Director": "Fred F. Sears",
    "Writer": "Jack DeWitt, Lou Morheim, Frank Paley",
    "Actors": "James Darren, Laurie Carroll, Michael Granger",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0047934",
    "tt0047232",
    "tt0048209",
    "tt0050365",
    "tt0051081",
    "tt0049340",
    "tt0049406",
    "tt0049904",
    "tt0049955",
    "tt0049769",
    "tt0049636",
    "tt0050087"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.951Z"
}