{
  "imdbId": "tt0028774",
  "title": "The Great Hospital Mystery",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/great-hospital-mystery-1937",
      "id": "great-hospital-mystery-1937",
      "title": "The Great Hospital Mystery (1937)",
      "description": "Jane Darwell",
      "fileSize": 1406470588,
      "addedAt": "2026-01-07T00:08:39.342Z",
      "thumbnail": "https://archive.org/services/img/great-hospital-mystery-1937",
      "collection": "feature_films",
      "downloads": 744
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 6.1,
    "imdbVotes": 74,
    "Genre": "Comedy, Crime, Drama",
    "Plot": "The first of three films made featuring the Nurse Sarah Keate character created by Mignon Eberhardt. This 20th Century-Fox film was followed by two from Warner Bros. in 1938 (\"Mystery House\" and \"The Patient in Room 18\"), both starring Ann Sheridan in the role played here by Jane Darwell, who was, despite source that seems to think otherwise, first-billed in this film with her name on the posters twice the size of that of Sig Rumann(as billed in this film), Sally Blane, Thomas Beck and Joan Davis. The story has nurse Ann Smith, with the knowledge of her night supervisor Sarah Keate, smuggling her brother Allen Tracy into the hospital as a patient of Doctor Taggert, in order to hide him from gunmen sworn to get him. Gangster Mortimer Beatty is admitted to the room next to Tracy's. Ann's patient is found dead, but the dead man is not Tracy but a charity patient who had died days before, but now has some fresh bullet wounds in his body. Ann's sweetheart, hospital physician David McKerry, and the police, led by Detective Mattoon, try to solve the mystery of why anyone would want to shoot a man already dead. Bumbling nurse Flossie Duffy finds the body of the murdered morgue keeper, while Ann explains that her brother slipped out of the hospital and she had substituted the corpse in his bed, hoping the gangsters would believe he had died. Beatty also turns up missing, and in his place on the operating table is the unconscious Tracy, suffering from blows to his head. And it is learned that Dr. Taggert and the morgue keeper were mortal enemies. Maybe there are two mysteries.",
    "Director": "James Tinling",
    "Writer": "Mignon G. Eberhart, Bess Meredyth, William M. Conselman",
    "Actors": "Jane Darwell, Sig Ruman, Sally Blane",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027437",
    "tt0029670",
    "tt0028748",
    "tt0024985",
    "tt0028346",
    "tt0029199",
    "tt0027501",
    "tt0030261",
    "tt0182242",
    "tt0028405",
    "tt0028083",
    "tt0027863"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.342Z"
}