{
  "imdbId": "tt0021287",
  "title": "Reaching for the Moon",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ReachingForTheMoondecember291930",
      "id": "ReachingForTheMoondecember291930",
      "title": "Reaching for the Moon",
      "description": "Bing Crosby in his first solo film performance. -One of several shortened versions of the film.",
      "fileSize": 1418131428,
      "addedAt": "2026-01-07T00:06:51.866Z",
      "thumbnail": "https://archive.org/services/img/ReachingForTheMoondecember291930",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 62561
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H7c0uWtFhPI",
      "id": "H7c0uWtFhPI",
      "title": "Reaching for the Moon (1930) | Colorized Public Domain Comedy with Douglas Fairbanks & Bebe Daniels",
      "description": "Reaching for the Moon (1930) is an elegant pre-Code American musical comedy directed by Edmund Goulding and starring silent-era legend Douglas Fairbanks alongside the radiant Bebe Daniels. This colorized and digitally restored edition from Colorized Public Domain revives a long-forgotten gem that blends romance, wit, and lavish early sound-era charm. The film offers a rare glimpse into Hollywood’s transition from silent spectacle to talkie sophistication, capturing the optimism and extravagance of early 1930s America before the Great Depression reshaped the industry. Now beautifully colorized, it’s a rediscovery of Fairbanks’s first sound performance and one of the last productions to feature his swashbuckling charisma adapted to a new cinematic age.\n\nPlot Summary:\nDouglas Fairbanks plays Larry Day, a confident and wealthy Wall Street tycoon whose self-made success has turned him into a cynic about love. When he meets the charming Vivien Benton (Bebe Daniels), his worldview begins to change. Their meeting on an ocean liner sparks a battle of wit and ego, with both characters representing the clash between money, romance, and emotional vulnerability.\n\nAs the voyage continues, the two find themselves caught in an unexpected romance filled with comedic misunderstandings, sharp dialogue, and musical interludes. The film cleverly shifts from comedy to introspection as Larry learns that wealth and control can’t buy happiness. Set against luxurious ship interiors and stylish 1930s fashion, the film captures the era’s fascination with glamour, escapism, and the human cost of ambition.\n\nCast and Crew:\n• Director: Edmund Goulding\n• Producer: Joseph M. Schenck\n• Screenplay: Edmund Goulding, Donald Ogden Stewart\n• Music: Irving Berlin\n• Cinematography: James Wong Howe\n• Editing: Stuart Heisler\nStarring:\n• Douglas Fairbanks as Larry Day\n• Bebe Daniels as Vivien Benton\n• Edward Everett Horton as Roger\n• Claud Allister as Lord Wallingford\n• Jack Mulhall as Jimmy\n• June MacCloy as Blonde\n• Lowell Sherman as Reverend Holt\n• Irving Bacon as Steward\n\nFilm Significance:\nReaching for the Moon stands as an important artifact of early sound-era Hollywood, representing Douglas Fairbanks’s transition from silent action hero to talking romantic lead. Originally intended as a full musical with songs by Irving Berlin, much of the music was cut before release due to shifting public tastes. Nevertheless, its surviving sequences display the opulent production values and sparkling dialogue characteristic of the pre-Code period. The cinematography by James Wong Howe adds visual sophistication, making this film both a historical document and a timeless romantic comedy. Modern viewers can now appreciate its charm through this colorized restoration, which revitalizes its atmosphere for audiences used to contemporary visual standards.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Reaching for the Moon remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1930 black-and-white version reflected early sound-era limitations but captured the height of Hollywood sophistication. This colorized edition gives modern audiences a richer and more vibrant view of Fairbanks and Daniels, showcasing the opulence of 1930s design in new visual detail. Especially suited for mature audiences aged 55–64 in the United States, Germany, and Serbia who appreciate nostalgic yet high-quality restorations, this edition preserves the film’s historical integrity while enhancing its emotional depth and visual allure. The result is a smoother, more engaging experience for viewers watching on modern large-screen TVs and computers — the dominant viewing devices for Colorized Public Domain audiences today.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from Hollywood’s Golden Age, from forgotten musicals and romances to landmark comedies and dramas. Our restorations preserve cinematic heritage while making these treasures discoverable and enjoyable for audiences across the United States, Europe, and worldwide.\n\n#ReachingForTheMoon #DouglasFairbanks #BebeDaniels #1930sMusical #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #PreCodeHollywood #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:47:06.087Z",
      "thumbnail": "https://i.ytimg.com/vi/H7c0uWtFhPI/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYciBIKDowDw==&rs=AOn4CLALx0HvTLKNX8Gp0FJFinYI154IVg",
      "duration": 4198,
      "language": "en",
      "year": 1930,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/reaching-for-the-moon-1930",
      "id": "reaching-for-the-moon-1930",
      "title": "Reaching for the Moon (1930)",
      "description": "Wall Street wizard, Larry Day, new to the ways of love, is coached by his valet. He follows Vivian Benton on an ocean liner, where cocktails, laced with a \"love potion,\" work their magic. He then loses his fortune in the market crash and feels he has also lost his girl. Watch on RetroFlix:  https://retroflix.org/reaching-for-the-moon-1930/",
      "fileSize": 394880613,
      "addedAt": "2026-01-07T00:10:30.752Z",
      "thumbnail": "https://archive.org/services/img/reaching-for-the-moon-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 737
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U5rTvWMx_Aw",
      "id": "U5rTvWMx_Aw",
      "title": "Reaching for the Moon (1930) DOUGLAS FAIRBANKS",
      "description": "Stars: Douglas Fairbanks, Bebe Daniels, Edward Everett Horton\n Director: Edmund Goulding\n Writer: Irving Berlin\n\n A Wall Street wizard is coached by his valet in the ways of love.",
      "addedAt": "2025-12-26T23:54:38.268Z",
      "thumbnail": "https://i.ytimg.com/vi/U5rTvWMx_Aw/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gOAAoADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDSAomXDDL0yoWr-MIAc7ZXE2WWIw",
      "duration": 3979,
      "language": "en",
      "year": 1930,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cvznz_IyCm4",
      "id": "cvznz_IyCm4",
      "title": "Reaching for the Moon (1930) Douglas Fairbanks- Adventure Full Length Film",
      "description": "Wall Street wizard, Larry Day, new to the ways of love, is coached by his valet. He follows Vivian Benton on an ocean liner, where cocktails, laced with a \"love potion,\" work their magic. He then loses his fortune in the market crash and feels he has also lost his girl...\n\nDirector: Edmund Goulding\nWriters: Irving Berlin, Edmund Goulding\nStars: Douglas Fairbanks, Bebe Daniels, Edward Everett Horton \nGenre:  Classics, Cult Film, Adventure \n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:51:57.760Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/cvznz_IyCm4/maxresdefault.webp?v=62bf158a",
      "duration": 3980,
      "language": "en",
      "year": 1930,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "91 min",
    "imdbRating": 5.5,
    "imdbVotes": 477,
    "Genre": "Comedy, Romance",
    "Plot": "Wall Street wizard, Larry Day, new to the ways of love, is coached by his valet. He follows Vivian Benton on an ocean liner, where cocktails, laced with a \"love potion,\" work their magic. He then loses his fortune in the market crash and feels he has also lost his girl...",
    "Director": "Edmund Goulding",
    "Writer": "Irving Berlin, Edmund Goulding, Elsie Janis",
    "Actors": "Douglas Fairbanks, Bebe Daniels, Edward Everett Horton",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0042742",
    "tt0022086",
    "tt0020479",
    "tt0020514",
    "tt0018882",
    "tt0020809",
    "tt0020988",
    "tt0021133",
    "tt0021377",
    "tt0021134",
    "tt0020838",
    "tt0020987"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.752Z"
}