{
  "imdbId": "tt0028827",
  "title": "Elephant Boy",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y7DNvtWY-LU",
      "title": "Elephant Boy (1937) [Adventure] [Drama] [Family]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | Elephant Boy is an adventure film starring Sabu in his film debut. Documentary filmmaker Robert J. Flaherty, who produced some of the Indian footage, and supervising director Zoltan Korda, who completed the film, won the Best Director Award at the Venice Film Festival. The film was made at the London Films studios at Denham, and in Mysore, India, and is based on the story \"Toomai of the Elephants\" from Rudyard Kipling's The Jungle Book (1894).\n\nThe movie ist about Toomai (Sabu), a young boy growing up in India, who longs to become a hunter. In the meantime, he helps his mahout (elephant driver) father with Kala Nag, a large elephant that has been in their family for four generations. Petersen (Walter Hudd) hires the father and Kala Nag, among others, for a large annual government roundup of wild elephants to be tamed and put to work. Amused by Toomai and learning that he has no one but his father to look after him, Petersen allows the boy to come too. Strangely, no elephants have been seen in the region in a while, so Petersen has staked his reputation on a guess that they will be found further north. However, six weeks of hunting prove fruitless. He is ready to give up, but his right-hand man, Machua Appa (Allan Jeayes), persuades him to keep hunting for another month. When the other hired natives learn of Toomai's ambition, they mock him, telling him that he will become a hunter only when he sees the elephants dance (a myth).\n\nOne night, Toomai's father spots a tiger prowling near the camp and wakes Petersen. When the two go out to shoot the beast, Toomai's father is killed. Kala Nag's grief becomes so intense, he rampages through the camp, only stopping when Toomai calms him down. Petersen decides to assign cruel Rham Lahl (Bruce Gordon) to Kala Nag, as Toomai is too young for the job. When Rham Lahl beats the elephant, however, Kala Nag injures his tormenter. The mahout insists that Kala Nag be destroyed, as is the law. Petersen manages to get him to change his mind and accept 100 rupees instead by threatening to have him removed from the safety of the camp.\n\nUnaware of this reprieve, Toomai takes Kala Nag and runs away into the jungle. There, they stumble upon the missing wild elephants, and Toomai sees them dancing. He leads Petersen to them. The other natives are awed, and hail him as \"Toomai of the Elephants\". Machua Appa offers to train the boy to become a hunter, a plan Petersen approves of.\n\n---\n\nDirected by Robert J. Flaherty and Zoltan Korda, produced by Alexander Korda , screenplay by John Collier, Marcia De Silva and Ákos Tolnay,  based on “Toomai of the Elephants”, from The Jungle Book by Rudyard Kipling, starring Sabu as Toomai, W. E. Holloway as Father, Walter Hudd as Petersen, Allan Jeayes as Machua Appa, Bruce Gordon as Rham Lahl, D. J. Williams as Hunter, Wilfrid Hyde-White as Commissioner, Iravatha as Kala Nag and Harry Lane as Bit Part.\n\n---\n\nSource: \"Elephant Boy (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 July 2018. Web. 08 August 2018. https://en.wikipedia.org/wiki/Elephant_Boy_(film) . If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "Y7DNvtWY-LU",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ElephantBoy",
      "title": "Elephant Boy",
      "description": "Rudyard Kipling's short story \"Toomai of the Elephants\" comes to life in this exciting little movie from Sir Alexander Korda. The original material has been embroidered upon, but the changes from Kipling, who had died in 1936, actually give the slight tale more punch without destroying its integrity. Location shooting, personally granted by the Maharaja of Mysore on his private lands, gives a veracity to the film which no studio back lot could equal. In the title role, 13 year old, Sabu Dastagir in his film debut plays a young Elephant Boy who dreams of becoming a hunter like his father, grandfather and great-grandfather.",
      "id": "ElephantBoy"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Elephant_Boy_",
      "title": "Elephant_Boy_",
      "description": "Already on archive...this copy, I believe, is complete with better audio and video. From IMDb; This black and white movie is based on Rudyard Kipling's \"Toomai, of the Elephants\", in which a small native lad claims he knows the congregating place of the elephant hordes.",
      "id": "Elephant_Boy_"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": "6.4",
    "imdbVotes": "856",
    "Genre": "Adventure, Drama, Family",
    "Plot": "This black and white movie is based on Rudyard Kipling's \"Toomai, of the Elephants\", in which a small native lad claims he knows the congregating place of the elephant hordes.",
    "Director": "Robert J. Flaherty, Zoltan Korda",
    "Writer": "Rudyard Kipling, John Collier, Ákos Tolnay",
    "Actors": "Sabu, W.E. Holloway, Walter Hudd",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "2 wins & 1 nomination"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0029844",
      "title": "The Adventures of Tom Sawyer",
      "year": 1938,
      "imdbRating": "7.0",
      "imdbVotes": "2,371",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026164",
      "title": "Call of the Wild",
      "year": 1935,
      "imdbRating": "6.8",
      "imdbVotes": "2,715",
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0046672",
      "title": "20,000 Leagues Under the Sea",
      "year": 1954,
      "imdbRating": "7.2",
      "imdbVotes": "39,080",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0072615",
      "title": "Against a Crooked Sky",
      "year": 1975,
      "imdbRating": "5.4",
      "imdbVotes": "773",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030143",
      "title": "Flying Fists",
      "year": 1937,
      "imdbRating": "5.5",
      "imdbVotes": "56",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029081",
      "title": "King Solomon's Mines",
      "year": 1937,
      "imdbRating": "6.3",
      "imdbVotes": "1,484",
      "language": "Spanish, English, Portuguese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029745",
      "title": "Wallaby Jim of the Islands",
      "year": 1937,
      "imdbRating": "4.8",
      "imdbVotes": "77",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029119",
      "title": "The Last Train from Madrid",
      "year": 1937,
      "imdbRating": "6.3",
      "imdbVotes": "310",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029162",
      "title": "Lost Horizon",
      "year": 1937,
      "imdbRating": "7.6",
      "imdbVotes": "14,766",
      "language": "English, Mandarin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0109279",
      "title": "Black Beauty",
      "year": 1994,
      "imdbRating": "6.6",
      "imdbVotes": "11,171",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0029374",
      "title": "Paradise Isle",
      "year": 1937,
      "imdbRating": "5.2",
      "imdbVotes": "76",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0043067",
      "title": "Treasure Island",
      "year": 1950,
      "imdbRating": "6.9",
      "imdbVotes": "10,232",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:19.370Z"
}