{
  "movieId": "tt0027917",
  "title": "Lucky Terror",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LuckyTerror",
      "id": "LuckyTerror",
      "title": "Lucky Terror",
      "description": "A sharpshooter (Hoot Gibson) in a traveling sideshow is falsely accused of murdering a local miner.",
      "fileSize": 1362757197,
      "addedAt": "2026-01-07T00:06:38.751Z",
      "thumbnail": "https://archive.org/services/img/LuckyTerror",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 17039
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c0QCPc7LQe4",
      "id": "c0QCPc7LQe4",
      "title": "Lucky Terror (1936) HOOT GIBSON",
      "description": "Stars: Hoot Gibson, Charles Hill, Lona Andre\n Director: Alan James\n\n A sharpshooter in a traveling sideshow is falsely accused of murdering a local miner.",
      "addedAt": "2025-12-26T23:51:48.773Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/c0QCPc7LQe4/maxresdefault.webp",
      "duration": 3629,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 6.1,
    "imdbVotes": 82,
    "Genre": "Western",
    "Plot": "Lucky Carson is riding through the snow-covered mountains when he sees Bat Moulton and his gang chasing Jim Thornton. Since it's none of his business Lucky hides behind a boulder to avoid being involved. (Unlike most B-western heroes, those played by Hoot Gibson often not only avoided trouble that wasn't theirs, they often avoided trouble when it was directed at them.) But Thornton has doubled back and pulls a gun on Lucky with the intent of stealing Lucky's untired horse. But the frightened horse rears,dashes over a cliff and takes Thornton with him. Lucky goes through Thornton's saddle bags, finds gold in them and realizes why Moulton's men were chasing the late departed Thornton. Hiding the bags at the foot of a mountain, Lucky (on Thornton's now-rested horse) rides on and comes across a Medicine Show ran by Doc Haliday. He hooks on as a sharpshooter and meets entertainer Ann Thornton, the dead man's niece. Moulton and his men ride up and inform Ann that they have taken possession of the Bonanza Mine that was owned jointly by Ann and her late uncle. Moulton also suspects Lucky of having the gold since he has found Thornton's body but no gold. Moulton goes to Sheriff Hodges and charges Lucky with the murder and robbery of Thornton. Lucky gets thrown in a cell with a drunk named Wheeler, who is the only lawyer in town and is assigned by the court to be Lucky's defender. During the trial, while Wheeler is sleeping off his hangover, Lucky manages to implicate Moulton and his men revealing that he saw them chasing Thornton. Wheeler wakes up and believing Lucky to be guilty --- Wheeler has never had an innocent client---takes Lucky to a back room during a recess and gives him the best and only advice gained in his years of lawyering... RUN. Lucky does. Meanwhile, the coroner breaks down Moulton's testimony, and the jury finds that Thornton's death was accidental. The Judge orders Moulton and his men to cease and desist with their activities at the Bonanza Mine, and goes to tell Lucky he has been cleared. He acts somewhat surprised to find that Lucky has departed the scene, although he shouldn't have been considering he left Wheeler and his client alone in a room with a window. (Any B-western that has a court with Milburn Morante as the judge, Charles King as a defense lawyer, Horace B. Carpenter as the prosecutor and buzzard-looking Nelson McDowell as the Coroner has to be cherished. ) Meanwhile, Moulton's gang is chasing Lucky, and Ann and the Sheriff go to the mine and find Jim Thornton's diary that reveals that Moulton had held Moulton prisoner after the gold had been discovered and extracted---but did allow Thornton to keep his diary entries up to date---and they conclude that ol' Uncle Jim had managed to escape and take the gold with him. The sheriff takes off after Moulton and sees Lucky. But Lucky also sees the sheriff and thinks he is the chasee since he didn't wait around to hear the jury's verdict. Lucky takes off and manages to get himself captured by Moulton and company and they truss him up in an ore car with intentions of giving him a ride over the cliff if he doesn't fess up about where the gold is hidden. It all works out.",
    "Director": "Alan James",
    "Writer": "Alan James, Roger Allman",
    "Actors": "Hoot Gibson, Charles Hill, Lona Andre",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0134216",
    "tt0027165",
    "tt0025269",
    "tt0030959",
    "tt0036101",
    "tt0024267",
    "tt0024444",
    "tt0023604",
    "tt0172155",
    "tt0027434",
    "tt0029367",
    "tt0026909"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.751Z"
}