{
  "imdbId": "tt0051182",
  "title": "The Wayward Bus",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/twb544487",
      "id": "twb544487",
      "title": "The Wayward Bus",
      "description": "Title: The Wayward Bus Summary: Joan Collins, Jayne Mansfield and Dan Dailey star in this engaging drama based on a novel by John Steinbeck. Three strangers - a stripper (Mansfield), an alcoholic wife (Collins) and a ... Directed by: Victor Vicas Actors: Joan Collins, Jayne Mansfield, Dan Dailey Production Company: Twentieth Century Fox Release Date: 27 May 1957 (USA) Aspect Ratio: 2.35 : 1 Joan Collins, Jayne Mansfield and Dan Dailey star in this engaging drama based on a novel by John Steinbeck. Three strangers - a stripper (Mansfield), an alcoholic wife (Collins) and a traveling salesman (Dailey) - embark on a life-changing journey on a fateful bus ride. As the road presents challenges, each character faces his or her own shortcomings, not knowing where life will lead next.",
      "fileSize": 838370053,
      "addedAt": "2026-01-07T00:12:55.130Z",
      "thumbnail": "https://archive.org/services/img/twb544487",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 2597
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "87 min",
    "imdbRating": 6.5,
    "imdbVotes": 840,
    "Genre": "Drama",
    "Plot": "Dame Joan Collins, Jayne Mansfield, and Dan Dailey star in this engaging drama based on a novel by John Steinbeck. Three strangers - a stripper (Mansfield), an alcoholic wife (Collins), and a travelling salesman (Dailey) - embark on a life-changing journey on a fateful bus ride. As the road presents challenges, each character faces his or her own shortcomings, not knowing where life will lead next.",
    "Director": "Victor Vicas",
    "Writer": "Ivan Moffat, John Steinbeck",
    "Actors": "Joan Collins, Jayne Mansfield, Dan Dailey",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0051492",
    "tt0049035",
    "tt0051433",
    "tt0049204",
    "tt0050782",
    "tt0050634",
    "tt0050241",
    "tt0050083",
    "tt0050097",
    "tt0050155",
    "tt0051713",
    "tt0050526"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.130Z"
}