{
  "movieId": "tt0056293",
  "title": "Nude on the Moon",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Nude.on.the.Moon.1961.AVI1Gb",
      "id": "Nude.on.the.Moon.1961.AVI1Gb",
      "title": "Nude on the Moon",
      "description": "Two scientists cash in on one’s inherited fortune, and finance their own trip to the moon. And what surprises they find! Blue skies, lush vegetation, identical gravity, gold ingots… But they also discover a civilization of telepathic “moonatics” who look exactly like us – except for two key differences. All of them have pipe-cleaner antennae attached to plastic hairbands…and   everyone is topless all the time! Naturally, our intrepid duo must investigate – purely in the interest of science. Of course. “Nude on the Moon” is almost Woodian in its ineptitude. Yes, you shouldn’t expect much more than cheese from these things – but the astronauts’ flight suits seem to be leftovers from a Middle Ages picture. Their helmets are not airtight (really just buckets on their heads) and they keep the faceplates raised most of the time. Their quarter-million-mile trip takes just two hours. Inside the ship, they must communicate with each via mics and headsets…while seated next to each other! And let’s not forget…the queen’s…breathy…and…halting….telepathic…communicationnnnn…… You’ll find many, many more mistakes; you might to keep want a pad and pencil handy, to keep track. “Moon Doll” is crooned by Ralph Young, who later had a quite successful career after teaming up with Tony Sandler. Doc Severinsen arranged the score (which isn't half-bad)  but, despite urban legends, does not appear in it. DVDtalk.com describes the whole thing as “a family home movie on LSD.” The entire review is here: http://www.dvdtalk.com/dvdsavant/s135nude.html This sci-fi “nudie cutie” was the second feature by the legendary Doris Wishman, and lacks any sort of copyright notification. And the “good stuff” begins around the 31-minute mark.",
      "fileSize": 2737738119,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/Nude.on.the.Moon.1961.AVI1Gb",
      "collection": "feature_films",
      "downloads": 142128
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "83 min",
    "imdbRating": 3.8,
    "imdbVotes": 1386,
    "Genre": "Comedy, Fantasy, Romance",
    "Plot": "Dr. Huntley and Professor Nichols are able to complete their work on a moon rocket because of an unexpected inheritance. They travel to the moon, but find a lush garden paradise rather than a barren wasteland. They are captured by virtually naked telepathic humanoids and taken in front of the Great Council. The Moon Goddess decides they should be allowed to continue their experiments, and Dr. Huntley begins falling in love with her. Professor Nichols worries about getting Huntley to return to earth.",
    "Director": "Doris Wishman",
    "Writer": "Jack Caplan, Doris Wishman",
    "Actors": "Marietta, William Mayer, Lester Brown",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0036962",
    "tt0034881",
    "tt0033414",
    "tt0054698",
    "tt0054851",
    "tt0033712",
    "tt0054700",
    "tt0032043",
    "tt0015167",
    "tt0040553",
    "tt0029682",
    "tt0140379"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.465Z"
}