{
  "imdbId": "tt0040472",
  "title": "Inner Sanctum",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Inner_Sanctum_movie",
      "id": "Inner_Sanctum_movie",
      "title": "Inner Sanctum",
      "description": "An atmospheric film starring Charles Russell and Mary Beth Hughes. Fritz Leiber, Sr. (father of the famous author) has a cameo as a seer or psychic. \"You're very pretty ... when those lips aren't moving.\" The IMDB entry is here. This print seems to be complete and may be of higher quality than the one already in the Archive. You can load the mpeg2 file into DVDAuthorGUI (a free program) and create a DVD to watch on your television.",
      "fileSize": 2260750575,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/Inner_Sanctum_movie",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 361130
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1948-inner-sanctum-victima-de-su-destino-lew-landers-ve",
      "id": "1948-inner-sanctum-victima-de-su-destino-lew-landers-ve",
      "title": "1948 - Inner Sanctum - Víctima de su destino - Lew Landers - VE",
      "description": "For Academic - Educational Use Only",
      "fileSize": 500031848,
      "addedAt": "2026-01-07T00:06:03.999Z",
      "thumbnail": "https://archive.org/services/img/1948-inner-sanctum-victima-de-su-destino-lew-landers-ve",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 400
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1948-inner-sanctum-victima-de-su-destino-lew-landers-vo",
      "id": "1948-inner-sanctum-victima-de-su-destino-lew-landers-vo",
      "title": "1948 - Inner Sanctum - Víctima de su destino - Lew Landers - VO",
      "description": "For Academic - Educational Use Only",
      "fileSize": 366105833,
      "addedAt": "2026-01-07T00:06:03.999Z",
      "thumbnail": "https://archive.org/services/img/1948-inner-sanctum-victima-de-su-destino-lew-landers-vo",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 381
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/inner-sanctum-1948",
      "id": "inner-sanctum-1948",
      "title": "Inner Sanctum (1948)",
      "description": "Inner Sanctum",
      "fileSize": 1385938877,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/inner-sanctum-1948",
      "collection": "feature_films",
      "downloads": 1148
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/inner-sanctum-1948_202307",
      "id": "inner-sanctum-1948_202307",
      "title": "Inner Sanctum (1948)",
      "description": "A killer hides out in a small-town boarding house. Watch on RetroFlix:  https://retroflix.org/inner-sanctum-1948/",
      "fileSize": 178609803,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/inner-sanctum-1948_202307",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 166
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/inner_sanctum",
      "id": "inner_sanctum",
      "title": "Inner Sanctum",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4913042149,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/inner_sanctum",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 201110
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6t_t1sgAm8c",
      "id": "6t_t1sgAm8c",
      "title": "Inner Sanctum (1948) [Film Noir] [Mystery]",
      "description": "Inner Sanctum is a movie about a murderer who is on the lam and hiding out in a small town. Unbeknownst to him, he is not only hiding in the same boarding house as the only witness to his crime, he is sharing the same room.\n\nThe story is framed with the murder victim speaking with a mysterious man who warns her not to leave the train at the next stop. Laughing that she ignores warning the mysterious man relates the story of the murder without revealing that she is the victim.\n\n---\n\nDirected by Lew Landers, produced by Richard B. Morros (executive producer), Samuel Rheiner (producer) and Walter Shenson (producer), written by Jerome T. Gollard, starring Charles Russell as Harold Dunlap, Mary Beth Hughes as Jean Maxwell, Dale Belding as, Mike Bennett, Billy House as McFee, Fritz Leiber, Sr. as Doctor Valonius (the Seer), Nana Bryant as Thelma Mitchell, Lee Patrick as Ruth Bennett, Roscoe Ates as Willy, Eddie Parks as Barney and Eve Miller as Marie Kembar (Dunlap's Fiancée).\n\n---\n\nSource: \"Inner Sanctum (1948 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 8 November 2012. Web. 22 March 2013. http://en.wikipedia.org/wiki/Inner_Sanctum_(1948_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:38.827Z",
      "thumbnail": "https://i.ytimg.com/vi/6t_t1sgAm8c/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBxEifb7hhk0-SfEePZ1mPcRGMttg",
      "duration": 3455,
      "language": "en",
      "year": 1948,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3alMj-uukps",
      "id": "3alMj-uukps",
      "title": "Inner Sanctum (1948) | Colorized Public Domain Noir Mystery with Charles Russell & Mary Beth Hughes",
      "description": "Inner Sanctum (1948) is an American mystery film noir directed by Lew Landers, adapted from the popular radio series of the same name that captivated audiences during the 1940s. This colorized and restored public domain classic presents a gripping blend of suspense, guilt, and psychological tension — showcasing the post-war shift in American cinema from moral simplicity to the darker realism of the human mind.\n\nSet in a world of small-town gossip, crime, and conscience, Inner Sanctum explores the thin divide between truth and deception through haunting cinematography and taut dialogue. The colorized edition by Colorized Public Domain brings new depth to this noir atmosphere, highlighting shadows, light contrasts, and emotional subtleties that were often muted in black-and-white originals.\n\nPlot Summary:\nThe story opens with Harold Dunlap, portrayed by Charles Russell, nervously boarding a train after what appears to be a crime. His suspicious demeanor draws the attention of fellow passengers, and as the train moves through the night, fragments of his past begin to surface. When Dunlap arrives in a small town and takes a room at a boarding house, the real tension begins — the town’s residents start connecting him to a local murder.\n\nMary Beth Hughes delivers a memorable performance as a perceptive and alluring woman who begins to suspect Dunlap’s secret. The film uses confined spaces, moral ambiguity, and growing paranoia to sustain a sense of claustrophobia typical of the noir genre. As Dunlap’s guilt tightens around him, the story blurs reality and illusion until the shocking truth unfolds in a tragic, poetic conclusion.\n\nCast and Crew:\n• Director: Lew Landers\n• Producer: Ben Judell\n• Screenplay: Edward Dein\n• Based on: The Inner Sanctum radio program\n• Cinematography: George Robinson\n• Editing: Norman Colbert\nStarring:\n• Charles Russell as Harold Dunlap\n• Mary Beth Hughes as Marie Kembar\n• Dale Belding as Mike\n• Billy House as Bob\n• Nana Bryant as Mrs. Burnside\n\nFilm Significance:\nInner Sanctum represents a transitional period in late 1940s American cinema, reflecting postwar anxiety, moral fatigue, and fascination with psychological complexity. While not as widely known as the Universal Inner Sanctum series starring Lon Chaney Jr., this 1948 independent production captures the noir essence with stripped-down realism and economical storytelling.\n\nIts concise pacing, heavy reliance on dialogue, and shadow-driven tension make it an educational study in low-budget noir filmmaking. Thematically, it examines guilt as both a psychological burden and a social contagion — anticipating the psychological thrillers of the 1950s and 1960s. The colorized restoration gives modern audiences, particularly those viewing on high-definition televisions, a renewed appreciation of the film’s darkly expressive cinematography.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Inner Sanctum remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1948 original release was filmed in black and white, standard for noir aesthetics of the era. However, this colorized version deepens the atmosphere for contemporary audiences by highlighting emotional nuance and facial expressions that define the film’s tension. For the channel’s core audience aged 55 to 64 — especially in the United States and Europe — this restored edition offers the best of both worlds: the authenticity of postwar noir and the clarity of modern digital presentation. The HD colorization enhances contrast and restores lost detail, making Inner Sanctum visually compelling even on large television screens.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including thrillers, mysteries, and forgotten noir gems. Each release is carefully restored to ensure historical preservation and accessibility for audiences worldwide, particularly in the United States and Europe where classic film appreciation and restoration culture thrive.\n\n#InnerSanctum1948 #FilmNoir #ColorizedClassic #PublicDomainMovie #MysteryThriller #ClassicNoir #CharlesRussell #MaryBethHughes #GoldenAgeHollywood #FilmRestoration #ColorizedPublicDomain #1940sCinema #NoirRestoration",
      "addedAt": "2025-12-24T00:49:28.715Z",
      "thumbnail": "https://i.ytimg.com/vi/3alMj-uukps/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYaiBqKGowDw==&rs=AOn4CLDdotxDELjjWiFd9LBJU-21LZweCg",
      "duration": 3664,
      "language": "en",
      "year": 1948,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6bUPoAqF86E",
      "id": "6bUPoAqF86E",
      "title": "Inner Sanctum (1948) FILM NOIR",
      "description": "Stars: Charles Russell, Mary Beth Hughes, Dale Belding\n Director: Lew Landers\n\nIn this eerie psycho-noir, an eccentric traveler warns a fellow train passenger not to get off at the next stop. When she sees her fiancée on the platform, she disregards the advice and rushes off to meet her fate.",
      "addedAt": "2025-12-26T23:55:01.787Z",
      "thumbnail": "https://i.ytimg.com/vi/6bUPoAqF86E/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBhgWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLAD_oPFxuxKKhFEz5_IFAbZ2Fn-8w",
      "duration": 3721,
      "language": "en",
      "year": 1948,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Inner_Sanctum_1948",
      "id": "Inner_Sanctum_1948",
      "title": "Inner Sanctum (1948; smallest download)",
      "description": "Actors: Charles Russell; Mary Beth Hughes; Fritz Leiber, Sr.; Billy House; Dale Belding; Nana Bryant; Roscoe Ates; Lee Patrick; Eddie Parks; Eve Miller; Buck Russell; Bert Stevens Writer: Jerome T. Gollard Director: Lew Landers Runtime: 1:02:03",
      "fileSize": 440060437,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/Inner_Sanctum_1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 1453
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 6,
    "imdbVotes": 1211,
    "Genre": "Film-Noir, Horror, Mystery",
    "Plot": "A man accidentally kills his fiancée as he exits a train. Just as the train pulls out, he drops her body on the rear platform. No one saw him do it, but someone does see him at the otherwise deserted station: a mischievous, freckle-faced boy. Later, he's walking along a road when the town's newspaper editor stops and gives him a lift. The editor tells his passenger that a flood has washed out the bridge. For now, there's no way out of town, so he takes the stranger to a boarding house. Fate decrees that of all houses, this is the one where the boy lives. The boy thinks he recognizes the new boarder. The new boarder thinks it's time to get rid of the boy. And a sexy blonde living at the house thinks it's time to run off with a man she knows is a murderer.",
    "Director": "Lew Landers",
    "Writer": "Jerome T. Gollard",
    "Actors": "Charles Russell, Mary Beth Hughes, Billy House",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039050",
    "tt0033855",
    "tt0039815",
    "tt0040798",
    "tt0040823",
    "tt0040002",
    "tt0040457",
    "tt0040604",
    "tt0040829",
    "tt0040338",
    "tt0037622",
    "tt0039757"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:09:44.082Z"
}