{
  "movieId": "tt0057917",
  "title": "The Carpetbaggers",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-carpetbaggers-1964",
      "id": "the-carpetbaggers-1964",
      "title": "The Carpetbaggers (1964) George Peppard · Carroll Baker",
      "description": "The meteoric rise of an unscrupulous industrialist and Hollywood powerhouse who ruthlessly prevails against all odds, recklessly sacrificing even friendship and love for the sake of success... A routine adaptation of a bestseller. Not uninteresting in its portrayal of the milieu, but lacking sufficient psychological justification for the main characters' behavior and too showy in its pursuit of popular success.",
      "fileSize": 4814371097,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-carpetbaggers-1964",
      "language": "eng",
      "year": 1964,
      "collection": "feature_films",
      "downloads": 422
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "150 min",
    "imdbRating": 6.5,
    "imdbVotes": 2560,
    "Genre": "Drama, Romance",
    "Plot": "Upon the death of his father in 1928, Jonas Cord Jr., who has thus far led a wild life, assumes control of the Cord business empire centered on a Nevada chemical company, that control despite the animosity that existed between father and son about business issues. With the exception of a few trusted people including his best friend, aging cowboy Nevada Smith, business manager \"Mac\" McAllister, and longtime butler Jedidiah, Jonas in turn trusts no one in his effort to take complete control of the business and his life, buying out other \"friends\", business associates and adversaries in his \"I know best\" attitude. In the process, he begins to diversify his business interests into areas which he either has an interest and/or believes will be industries of the immediate future, including aviation and the movie industry. The poor way he treats people extends to his personal life, including the many women closest to him, such as his stepmother, Rina Marlowe, who was his girlfriend before she married his father, and who would become his wife, Monica Winthrop, the daughter of a business associate. The question becomes if this life is sustainable for him, especially as people try to usurp him, and those he trusts may no longer be able to tolerate his behavior, which he may not be able to let go of in much of it stemming from issues ingrained into him when he was a child.",
    "Director": "Edward Dmytryk",
    "Writer": "Harold Robbins, John Michael Hayes",
    "Actors": "George Peppard, Alan Ladd, Robert Cummings",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 BAFTA Award2 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt0050882",
    "tt0060177",
    "tt0228438",
    "tt0058104",
    "tt0059927",
    "tt0058414",
    "tt0054698",
    "tt0059252",
    "tt0059788",
    "tt0059232",
    "tt0056696",
    "tt0060802"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.682Z"
}