{
  "imdbId": "tt0016051",
  "title": "The Lucky Devil",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-lucky-devil",
      "id": "silent-the-lucky-devil",
      "title": "The Lucky Devil",
      "fileSize": 1231965003,
      "addedAt": "2026-01-07T00:11:15.977Z",
      "thumbnail": "https://archive.org/services/img/silent-the-lucky-devil",
      "language": "English",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 1924
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "63 min",
    "imdbRating": 6.4,
    "imdbVotes": 44,
    "Genre": "Action, Comedy, Drama",
    "Plot": "Department store worker Richard Dix (as Randy Farnum) admires an automobile (license #F-131313) used as a model for his outdoorsy camping exhibit. Unaware the car was donated due to the previous owner professing bad luck behind the wheel, Mr. Dix longs to take the car on the road. He gets his wish upon winning the \"hoodoo\" auto in a raffle. Unsuccessfully attempting to avoid problems with woman and cops, Dix meets pretty blonde Esther Ralston (as Doris) and her pessimistic aunt Edna May Oliver (as Abbie) while traveling and getting a ticket. The women are on their way to claim an inheritance, but are in for a surprise...An edit of this film cut mild expletives, omitted scenes and changed some names; notably, Dix become \"William 'Bill' Phelps\"...Dix and Ms. Ralston continue to cross paths, until \"The Lucky Devil\" ends with an expected \"big race\". It's an amusing picture, and certainly helped make Dix a box office star. It did seem Dix was carrying on for actor Wallace Reid, an immensely popular star who died suddenly in 1923. The story was written by Byron Morgan, a regular writer for Mr. Reid, beginning with \"The Roaring Road\" (1919). While already famous for appearing in prestigious productions, Dix entered \"Top Ten\" favorite players polls held by \"Motion Picture Magazine\" (1926) and \"Quigley Publications\" (1927); and, he transitioned to \"talkies\" successfully.****** The Lucky Devil (7/7/25) Frank Tuttle ~ Richard Dix, Esther Ralston, Edna May Oliver, Charles Sellon",
    "Director": "Frank Tuttle",
    "Writer": "Byron Morgan, Townsend Martin",
    "Actors": "Richard Dix, Esther Ralston, Edna May Oliver",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0016013",
    "tt0019421",
    "tt0020234",
    "tt0020135",
    "tt0347938",
    "tt0029939",
    "tt0132960",
    "tt0026593",
    "tt0033058",
    "tt0015772",
    "tt0016641",
    "tt0064137"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.977Z"
}