{
  "imdbId": "tt0005542",
  "title": "In the Park",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/InThePark_201404",
      "title": "Charlie Chaplin's \"In the Park\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"In the Park\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin           Starring                     Charlie Chaplin, Edna Purviance, Leo White Cinematography        Harry Ensign Distributed by           Essanay Films Release date               March 15, 1915 Running time             14 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 181603913,
      "id": "InThePark_201404"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/in-the-park-1915",
      "title": "In The Park (1915)",
      "description": "In the Park is Charlie Chaplin’s fourth film released in 1915 by Essanay Films. It was his third film while at the Niles Essanay Studio. It was one of several films Charlie Chaplin created in a park setting. The film co-starred Edna Purviance, Leo White, Lloyd Bacon, and Bud Jamison. Watch on RetroFlix.org:  https://retroflix.org/in-the-park-1915/",
      "fileSize": 256291359,
      "id": "in-the-park-1915"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/in-the-park-1915-directed-by-charlie-chaplin",
      "title": "In The Park (1915) Directed By Charlie Chaplin",
      "description": "In the Park Theatrical poster to In the Park Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Leo White Edna Purviance Cinematography Harry Ensign Edited by Charlie Chaplin Distributed by Essanay Films Release date March 18, 1915 Running time 15 minutes (restored version) Country United States Languages Silent film English intertitles In the Park is Charlie Chaplin 's fourth film released in 1915 by Essanay Films . It was his third film while at the Niles Essanay Studio. It was one of several films Charlie Chaplin created in a park setting at the Golden Gate Park in San Francisco. The film co-starred Edna Purviance , Leo White , Lloyd Bacon , and Bud Jamison . Synopsis In one of Charlie Chaplin's \"park comedies,\" another tramp is causing havoc. He attempts to pickpocket Charlie, but finds nothing in his pockets. Meanwhile, Charlie stealthily goes through the pickpocket's jacket and steals a cigarette and his matches. Meanwhile, two couples are having romantic interludes on separate benches. The crooked tramp steals one girl's handbag, but swiftly loses it to Charlie when he tries to pickpocket him a second time. Charlie rescues a hot dog vendor from a thug, but deftly takes a few of the sausages with his cane. Charlie sells the stolen handbag to the other male suitor. A suspicious policemen observes the goings-on and the men realize the bag is stolen and pass it among each other. Finally Charlie presents it as a gift to the other female and receives an affectionate embrace. The bag's original owner becomes angry with her suitor for permitting her bag to be stolen. The suitor is rejected and reacts hyper-dramatically. He intends to drown himself in the park's lake and asks Charlie to assist him. He presents his behind as a target and Charlie gladly kicks him into the pond. Shortly thereafter he also kicks the other girl's suitor into the pond along with the park policeman. Cast Charlie Chaplin and his crew at the Golden Gate Park in San Francisco Edna Purviance and Chaplin Charlie Chaplin - Charlie Edna Purviance - Nursemaid Leo White - The Count, Elegant Masher Leona Anderson - The Count's Fancy Bud Jamison - Edna's Beau Billy Armstrong - Sausage Thief Ernest Van Pelt - Sausage Seller Reception A reviewer from Bioscope wrote, \"The one and only Charlie is seen to the best advantage in this riotous farce which is as wildly funny as it is absurd. Unlike many comedians, Chaplin is always amusing. There seem to be no grey patches in his work. It is all one large scarlet scream.\" From Wikipedia, the free encyclopedia",
      "fileSize": 343610852,
      "id": "in-the-park-1915-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-in-the-park",
      "title": "In the Park",
      "fileSize": 2885154794,
      "id": "silent-in-the-park"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/InTheParktinted",
      "title": "In the Park [tinted]",
      "description": "In the Park (1915) is a silent movie written, directed and starring Charlie Chaplin. Resolution : 718x576 pixels Version: This is a tinted print. For highest quality download the source mkv file and play with VLC Player . IMDB Link ~~~~ For free intelligent electronic music visit Karakasa Music @ archive.org",
      "fileSize": 323612509,
      "id": "InTheParktinted"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "14 min",
    "imdbRating": 5.6,
    "imdbVotes": 1782,
    "Genre": "Short, Comedy",
    "Plot": "A tramp steals a girl's handbag, but when he tries to pick Charlie's pocket loses his cigarettes and matches. He rescues a hot dog man from a thug, but takes a few with his walking stick. When the thief tries to take some of Charlie's sausages, Charlie gets the handbag. The handbag makes its way from person to person to its owner, who is angry with her boyfriend who didn't protect her in the first place. The boyfriend goes to throw himself in the lake in despair. Charlies helps him.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Leona Anderson, Billy Armstrong",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0004936",
      "title": "The Bank",
      "year": 1915,
      "imdbRating": 6.6,
      "imdbVotes": 2325,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006309",
      "title": "A Woman",
      "year": 1915,
      "imdbRating": 6.4,
      "imdbVotes": 1990,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005044",
      "title": "By the Sea",
      "year": 1915,
      "imdbRating": 5.7,
      "imdbVotes": 1967,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005489",
      "title": "His New Job",
      "year": 1915,
      "imdbRating": 6,
      "imdbVotes": 2089,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006313",
      "title": "Work",
      "year": 1915,
      "imdbRating": 6.2,
      "imdbVotes": 1891,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006177",
      "title": "The Tramp",
      "year": 1915,
      "imdbRating": 6.9,
      "imdbVotes": 3953,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006032",
      "title": "Shanghaied",
      "year": 1915,
      "imdbRating": 6.1,
      "imdbVotes": 1732,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005812",
      "title": "A Night in the Show",
      "year": 1915,
      "imdbRating": 6.4,
      "imdbVotes": 2446,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005571",
      "title": "A Jitney Elopement",
      "year": 1915,
      "imdbRating": 5.9,
      "imdbVotes": 1464,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005810",
      "title": "A Night Out",
      "year": 1915,
      "imdbRating": 5.9,
      "imdbVotes": 1915,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005074",
      "title": "The Champion",
      "year": 1915,
      "imdbRating": 6.7,
      "imdbVotes": 2846,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": 6.9,
      "imdbVotes": 3173,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:09:30.436Z"
}