{
  "movieId": "tt0032055",
  "title": "Trigger Fingers",
  "year": 1939,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QgY4HC8dHPg",
      "id": "QgY4HC8dHPg",
      "title": "Trigger Fingers (1939) TIM McCOY🍕 COWBOY WESTERN",
      "description": "Stars: Tim McCoy, Joyce Bryant, Ben Corbett, Harley Wood\nDirector: Sam Newfield\nIn this action-packed cowboy adventure, Lightning Bill Carson and his trusty sidekick Magpie disguise themselves as gypsies to outsmart a ruthless gang of cattle thieves.\n\nStep back into the wild frontier with a thrilling classic Western starring the legendary Tim McCoy as Lightning Bill Carson, alongside Ben Corbett, Joyce Bryant, and Harley Wood. Directed by prolific Western filmmaker Sam Newfield.\n\nIf you're a fan of Tim McCoy Westerns, Lightning Bill Carson cowboy movies, or the unforgettable PizzaFLIX Cowboy Westerns, this is a must-watch! Experience the excitement, drama, and gun-slinging action that defined the 1930s Western film era.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Don’t forget to LIKE, SUBSCRIBE, and hit the BELL 🔔 for more classic Western movies, cowboy films, and timeless Hollywood Westerns! 🍕\n\nPerfect for lovers of old Western movies, cowboy films, vintage Western cinema, and the iconic performances of Lightning Bill Carson. Subscribe to PizzaFLIX for more full-length classic Westerns, rare vintage films, and timeless cowboy tales starring legends like Tim McCoy and directed by Sam Newfield. Don't miss this rare Western gem from Hollywood's golden age!\n\n#TimMcCoy #LightningBillCarson #BenCorbett #SamNewfield #ClassicWestern #1939Western #PizzaFLIX #FullMovie #OldWestern #CowboyMovie #VintageWestern",
      "addedAt": "2025-12-24T01:04:10.528Z",
      "thumbnail": "https://i.ytimg.com/vi/QgY4HC8dHPg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCY2z7aZ7-TH7BdlyWbbxPSg2-zEw",
      "duration": 3240,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "54 min",
    "imdbRating": 6.3,
    "imdbVotes": 34,
    "Genre": "Western",
    "Plot": "Recovering a saddle with fingerprints from the Lasson County gang, Bill, Magpie, and Margaret arrive posing as Gypsies. Bill tells fortunes using cards and later checks them for fingerprints. Not finding any matches they arrive at the gang's hideout. But gang leader Lee soon realizes what's happening and they are in trouble.",
    "Director": "Sam Newfield",
    "Writer": "Basil Dickey",
    "Actors": "Tim McCoy, Ben Corbett, Harley Wood",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033104",
    "tt0031164",
    "tt0031306",
    "tt0032014",
    "tt0031769",
    "tt0030366",
    "tt0030756",
    "tt0030581",
    "tt0033141",
    "tt0030001",
    "tt0032989",
    "tt0032563"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:34:18.285Z"
}