{
  "movieId": "tt0026663",
  "title": "Mad Love",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mad.-love.-1935",
      "id": "mad.-love.-1935",
      "title": "Mad Love (1935)",
      "description": "Mad Love is a psychological thriller that revolves around the character of Dr. Paul Sereno, a talented and ambitious surgeon portrayed by Peter Lorre . The plot unfolds when Sereno becomes infatuated with a beautiful pianist named Yvonne Orlac , played by Frances Drake , who is the wife of a famous concert pianist, Stephen Orlac . After a tragic accident leaves Stephen Orlac unable to play, Yvonne seeks help from Dr. Sereno. In a radical medical procedure, Sereno performs a transplant, replacing Stephen's damaged hands with those of a recently executed criminal.As Stephen begins to recover, he finds himself struggling with his new hands, which seem to have a mind of their own. He becomes increasingly paranoid, fearing that the personality traits of the executed criminal are affecting him.Meanwhile, Dr. Sereno's obsession with Yvonne deepens. His unhealthy infatuation leads him to manipulate her and Stephen’s lives in increasingly sinister ways, culminating in a shocking climax.The story builds to a tense and dramatic conclusion, where the consequences of Sereno's medical actions and his obsession come to a head, ultimately examining themes of love, madness, and the ethics of medical experimentation.",
      "fileSize": 1223627956,
      "addedAt": "2026-01-07T00:09:46.421Z",
      "thumbnail": "https://archive.org/services/img/mad.-love.-1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 144
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "68 min",
    "imdbRating": 7.2,
    "imdbVotes": 6040,
    "Genre": "Horror, Romance, Sci-Fi",
    "Plot": "In Paris, the great surgeon Dr. Gogol falls madly in love with stage actress Yvonne Orlac, and his ardor disturbs her quite a bit when he discovers to his horror that she is married to concert pianist Stephen Orlac. Shortly thereafter, Stephen's hands are badly crushed in a train accident- beyond the power of standard medicine. Knowing that his hands are his life, Yvonne overcomes her fear and goes to Dr. Gogol, to beg him to help. Gogol decides to surgically graft the hands of executed murderer Rollo onto Stephen Orlac, the surgery is successful but has terrible side-effects...",
    "Director": "Karl Freund",
    "Writer": "Maurice Renard, Florence Crewe-Jones, Guy Endore",
    "Actors": "Peter Lorre, Frances Drake, Colin Clive",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0051631",
    "tt0054020",
    "tt0023245",
    "tt0025465",
    "tt0025391",
    "tt0024894",
    "tt0027521",
    "tt0021884",
    "tt0029508",
    "tt0024184",
    "tt0034902",
    "tt0026671"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.421Z"
}