{
  "movieId": "tt0026123",
  "title": "The Black Room",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-black.-room.-1935",
      "id": "the.-black.-room.-1935",
      "title": "The Black Room (1935)",
      "description": "The Black Room is a 1935 American horror film directed by Roy William Neill and starring Boris Karloff. Cinematography was done by Allen G. Siegler. It follows  twin brothers Gregor and Anton are born into a noble family with a prophecy that the younger brother will kill the elder in a mysterious Black Room. As adults, Gregor becomes a tyrannical ruler, while Anton, who is kind-hearted, returns home, leading to a tragic confrontation that fulfills the prophecy.",
      "fileSize": 1224533837,
      "addedAt": "2026-01-07T00:12:33.207Z",
      "thumbnail": "https://archive.org/services/img/the.-black.-room.-1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 272
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "68 min",
    "imdbRating": 6.9,
    "imdbVotes": 2387,
    "Genre": "Horror",
    "Plot": "Prophecy has it that younger twin Anton will kill brother Gregor in the castle's Black Room. Anton returns to the castle after a 10 year hiatus. Gregor, a Baron, has many attempts on his life as his subjects detest his tyranny. However, good natured Anton earns the subjects' respect, and the admiration of Col.Hassel, uncle of the beautiful Thea. When Gregor kills young servant Mashka, his subjects storm the castle to remove him. Devious Gregor renounces his title in favour of brother Anton to appease them. He then kills Anton to assume his identity and the Baronship again. He is free to pursue Thea with Col.Hassel's blessing. When Col.Hassel discovers Gregor's impersonation, he also meets death. With Thea's true love, Lt. Lussan, wrongfully convicted of Hassel's murder, it appears nothing can stop evil Gregor from ambushing her into marriage. But what of that prophecy?",
    "Director": "Roy William Neill",
    "Writer": "Arthur Strawn, Henry Myers",
    "Actors": "Boris Karloff, Marian Marsh, Robert Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038259",
    "tt0037168",
    "tt0036348",
    "tt0036349",
    "tt0037248",
    "tt0037303",
    "tt0026912",
    "tt0024894",
    "tt0024055",
    "tt0023893",
    "tt0025155",
    "tt0026230"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.207Z"
}