{
  "imdbId": "tt0014322",
  "title": "The Nth Commandment",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-nth-commandment",
      "id": "silent-the-nth-commandment",
      "title": "The Nth Commandment",
      "fileSize": 405239436,
      "addedAt": "2026-01-07T00:11:24.921Z",
      "thumbnail": "https://archive.org/services/img/silent-the-nth-commandment",
      "language": "English",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 625
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6.6,
    "imdbVotes": 23,
    "Genre": "Drama",
    "Plot": "Although the print I saw of this film was deteriorated from age, one could easily see the gem hiding underneath the rough, in this silent feature directed by the sentimental Frank Borzage. Colleen Moore stars as Sarah, a store clerk being wooed by two men, one a serious fellow who really loves her, with an illness (we are to assume TB, though it is not stated), and another one a flighty Broadway producer who is just after Colleen for one thing. The people in the story all \"talk\" via the title cards in Brooklyn accents and it is very realistic for that time period and that area of New York. Colleen decides to marry the serious fellow, but the marriage is strained from lack of finances due to his ill health, and the Broadway producer comes back into the picture to try and woo her away from the husband. A typical triangle love story, but made special by the delightful performance of Colleen Moore, one of my favorite silent stars.A particularly notable scene takes place near the beginning at a roller skating rink, with many people going fast, doing turns and carousing around having fun. Great camera shots and suspense, as Colleen is eventually whisked away from the man she loves, and he is ridiculed by falling down, over and over and over again, as the people whiz past him.I enjoyed the film, but I wish people had taken much more care of these silent treasures over the years and not allowed them to deteriorate so badly. It really is a shame.",
    "Director": "Frank Borzage",
    "Writer": "Fannie Hurst, Frances Marion",
    "Actors": "Colleen Moore, James Morrison, Eddie Phillips",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015312",
    "tt0016006",
    "tt0015722",
    "tt0016013",
    "tt0011317",
    "tt0018379",
    "tt0022879",
    "tt0021635",
    "tt0051476",
    "tt0040607",
    "tt0020122",
    "tt0019429"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.921Z"
}