{
  "imdbId": "tt0044106",
  "title": "The Tanks Are Coming",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-tanks-are-coming-1951_202509",
      "title": "The Tanks Are Coming (1951) Steve Cochran Philip Carey",
      "description": "During World War II in 1944, Saint-Lô, France, five tanks of the 3rd Armored Division attempt to pierce the Siegfried Line. The story is set after the breakout from Normandy, when an American tank crew fights its way into Germany.",
      "fileSize": 767774952,
      "id": "the-tanks-are-coming-1951_202509"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 6.2,
    "imdbVotes": 350,
    "Genre": "Action, Drama, War",
    "Plot": "During the second-half of 1944, various Allied units stationed in Belgium attempt to smash their way through the tough German defenses at the Siegfried Line. If successful, the way to Germany is wide-open. One of these units is the American 3rd Armored Division. The film's story concerns a particular five-tank platoon, commanded by Lt. Rawson, the best platoon in Captain Bob Horner's Company C. During an ambush, the lead tank, California Jane, commanded by Master Sgt. Joe Davis, is seriously damaged by a German Panther tank. Davis is severely wounded and his driver is killed. Soon after, a replacement sergeant takes over Davis' role. However, the new man, staff sergeant Francis Aloysius Sullivan is cocky, heartless and tactless. His behavior frustrates both his men and his superiors. Many suspect that Sullivan is a show-off, and eager for an aggressive combat style in order to receive promotions, medals and praises. Some of the other men in the platoon are Danny Kolowicz, Sgt. Lemchek, Pfc. George 'Ike' Eisenhower, Sgt. Tucker, Pvt. Jerry Marconi Whitehouse, Heinrich 'Heinie' Weinburger and Lt. Rawson himself. Sgt. Sullivan is mercilessly pushing his men to their limit, with little rest, praise or empathy. This leadership style attracts the enmity of his men and of the more humane platoon leader, Lt. Rawson. At a river fording, the inadequacy of the American Sherman tank, armed with the 75 mm gun, becomes evident. The lead tank is neutralized by a German 88 mm Flack gun. During one-on-one tank duels with the much heavier, better armored, superior gunned German tanks, the American Shermans fall pray to German shells, while the Shermans' shells bounce-off the German armor. Some men bemoan the situation and dream of better American tanks to give the crews a better chance of survival during fire exchanges with the German monsters. Pfc. Eisenhower even begs a two-star general for better tanks and is promised newer tanks, armed with 90 mm guns and sporting thicker armor. They all take this promise as a joke, meant to humor the men, until, a few months later, the first Pershing tanks start arriving. After liberating a few Belgian towns, the division moves into position to assault the Siegfried Line. The German tank obstacles, including the deadly 'dragon's teeth' and heavy artillery await the American tank units. Sergeant Sullivan's reckless bravery wins them successes but casualties too. Later-on, a major German infantry counter-attack is repulsed by Sullivan's advance smart defensive preparations. The men don't know whether to admire or hate Sullivan's guts. Once over the border, into Germany proper, the men open a bottle of champagne to celebrate the event. When they reach a major German town, Pfc. Heinrich 'Heinie' Weinburger, a German-American, starts asking strange questions, in German, of the numerous German POW's being herded and processed by the American soldiers. When Weinburger wanders-off into the city, a suspicious Sullivan follows him around and discovers Weinburger's painful secret. Finally, a promotion to Lieutenant, arrives for Sullivan but it also means the mandatory re-assignment to another unit. Emotionally attached to his men and his platoon, Sullivan refuses the promotion, choosing to remain a sergeant with his outfit instead.",
    "Director": "Lewis Seiler",
    "Writer": "Robert Hardy Andrews, Samuel Fuller",
    "Actors": "Steve Cochran, Philip Carey, Mari Aldon",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0043547",
      "title": "Flying Leathernecks",
      "year": 1951,
      "imdbRating": 6.3,
      "imdbVotes": 5672,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046746",
      "title": "The Bamboo Prison",
      "year": 1954,
      "imdbRating": 6.1,
      "imdbVotes": 267,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043469",
      "title": "Distant Drums",
      "year": 1951,
      "imdbRating": 6.4,
      "imdbVotes": 2436,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045332",
      "title": "The Winning Team",
      "year": 1952,
      "imdbRating": 6.5,
      "imdbVotes": 1152,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048667",
      "title": "Strategic Air Command",
      "year": 1955,
      "imdbRating": 6.3,
      "imdbVotes": 4275,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048593",
      "title": "The Sea Chase",
      "year": 1955,
      "imdbRating": 6.4,
      "imdbVotes": 3669,
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025011",
      "title": "Crimson Romance",
      "year": 1934,
      "imdbRating": 5.7,
      "imdbVotes": 181,
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0064571",
      "title": "Eagles Over London",
      "year": 1969,
      "imdbRating": 5.6,
      "imdbVotes": 845,
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036516",
      "title": "We Dive at Dawn",
      "year": 1943,
      "imdbRating": 6.7,
      "imdbVotes": 1709,
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048966",
      "title": "Attack",
      "year": 1956,
      "imdbRating": 7.4,
      "imdbVotes": 6042,
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0062688",
      "title": "Attack on the Iron Coast",
      "year": 1968,
      "imdbRating": 5.5,
      "imdbVotes": 803,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050252",
      "title": "China Gate",
      "year": 1957,
      "imdbRating": 6.2,
      "imdbVotes": 967,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.204Z"
}