{
  "imdbId": "tt0039090",
  "title": "No Regrets for Our Youth",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/no-regrets-for-our-youth",
      "id": "no-regrets-for-our-youth",
      "title": "No Regrets For Our Youth",
      "description": "In Akira Kurosawa's first film after the end of World War II, future beloved Ozu regular Setsuko Hara gives an astonishing performance as Yukie, the only female protagonist in Kurosawa's body of work and one of his strongest heroes. Transforming herself from genteel bourgeois daughter to independent social activist, Yukie traverses a tumultuous decade in Japanese history.",
      "fileSize": 2193498439,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/no-regrets-for-our-youth",
      "language": "jpn",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 14571
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "110 min",
    "imdbRating": 7.1,
    "imdbVotes": 4157,
    "Genre": "Drama",
    "Plot": "In 1933, in Kyoto, academic freedom is under attack and the spoiled daughter of Professor Yagihara, Yukie Yagihara, is courted by the idealistic student Ruykichi Noge and by the tolerant Itokawa. When the academic freedom movement is crushed by the fascists, Professor Yagihara and the members of the Faculty of Law resign from their positions and Noge is arrested. Five years later, Noge visits Professor Yagihara and his family under the custody of the now Prosecutor Itokawa and tells them that he is going to China. Yukie decides to move alone to Tokyo and years later, she meets Itokawa in Tokyo and tells her that Noge is living in Tokyo. Yukie visits Noge and they become lovers. In 1941, Noge is arrested accused of being the ringleader of a spy network and Yukie is also sent to prison. When she is released, she decides to move to the peasant village where Noge's parents live and are blamed of being spies by the villagers. She changes her lifestyle and works hard with Madame Noge planting rice and earning the respect of her mother and father-in-law. With the end of the war, freedom is restored in the defeated Japan and the flowers blossom again.",
    "Director": "Akira Kurosawa",
    "Writer": "Eijirô Hisaita, Akira Kurosawa, Keiji Matsuzaki",
    "Actors": "Setsuko Hara, Susumu Fujita, Denjirô Ôkôchi",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038268",
    "tt0036400",
    "tt0039871",
    "tt0036947",
    "tt0043614",
    "tt0041699",
    "tt0042958",
    "tt0071411",
    "tt0057565",
    "tt0080979",
    "tt0058888",
    "tt0056443"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "akira-kurosawa",
      "name": "Akira Kurosawa"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.898Z"
}