{
  "movieId": "tt0026392",
  "title": "Gunfire",
  "year": 1934,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yYSkjUSbEAY",
      "id": "yYSkjUSbEAY",
      "title": "Gunfire (1934) REX BELL",
      "description": "First Time on YouTube!\nStars: Rex Bell, Ruth Mix, Buzz Barton\nDirector: Harry L. Fraser\n\nThe McGreggors are out to ruin rancher Jerry Dunbar and have planted their man on his ranch to inform them of his cattle movements!\n\nTRIVIA: The second of four films made by Resolute Productions, Inc. that had Rex Bell, Ruth Mix and Buzz Barton billed above the title.",
      "addedAt": "2025-12-24T01:08:56.585Z",
      "thumbnail": "https://i.ytimg.com/vi/yYSkjUSbEAY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDhL8yDn-VR-8TtUGDikls9oEQxRQ",
      "duration": 3611,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "56 min",
    "imdbRating": 6,
    "imdbVotes": 19,
    "Genre": "Western",
    "Plot": "The second of four films made by Resolute Productions, Inc. that had Rex Bell, Ruth Mix and Buzz Barton billed above the title, and the basic plot is rather basic as the McGregor clan, Ross, Dan and Alex, arch-enemies of Paradise Ranch owner Jerry Vance, frame him on a murder charge, and Danny Blake, a young cowhand befriended by Jerry, and Mary Vance, an eastern girl who co-owns the ranch with Jerry, help him clear his name... but, the subplots provided by writer Eric Howard, who taught a short-story writing class at the University of Southern California, makes it play like a precursor to current soap operas on daytime television; Sally Moore, staying at Jerry's ranch since her mother died, because she thinks her stepfather Les Daggett displays an unhealthy attitude toward her, causes some talk among the boys down at the saloon about her and Jerry, who really loves Mary but Mary thinks he loves Sally, so she listens to the oily talk of Dan, who knows he has to get Jerry out of the way before he can have Mary. Deputy Lafe Hutchins is in love with Jane, Dan's sister, and is in league with Dan's plot to get rid of Jerry... to which end, all hands, including step-daddy Daggett, kidnap Sally. Eric Howard wasn't called on much more to write a lot of westerns.",
    "Director": "Harry L. Fraser",
    "Writer": "Harry L. Fraser, Eric Howard",
    "Actors": "Rex Bell, Ruth Mix, Buzz Barton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0131072",
    "tt0028213",
    "tt0022819",
    "tt0024042",
    "tt0132461",
    "tt0022921",
    "tt0024805",
    "tt0027217",
    "tt0026857",
    "tt0026608",
    "tt0027180",
    "tt0027712"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:40:25.281Z"
}