{
  "imdbId": "tt0024405",
  "title": "Oliver Twist",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/oliver-twist-1933",
      "title": "Oliver Twist (1933)",
      "description": "An orphan boy in 1830s London is abused in a workhouse, then falls into the clutches of a gang of thieves. Watch on RetroFlix:  https://retroflix.org/oliver-twist-1933/",
      "fileSize": 226112794,
      "id": "oliver-twist-1933"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/oliver_twist",
      "title": "Oliver Twist",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 3694689927,
      "id": "oliver_twist"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=86VClCodYLA",
      "title": "Oliver Twist (1933) [Drama]",
      "description": "\"Oliver Twist\" is a 1933 American film directed by William J. Cowen. It is an adaptation of Charles Dickens's popular novel with the same name and was the first sound version of the classic. It stars Irving Pichel as Fagin, Dickie Moore as Oliver, Doris Lloyd as Nancy, and William \"Stage\" Boyd as Bill Sikes. Pichel played Fagin without resorting to any mannerisms which could be construed as offensive.\n\nAn orphan boy in 1830's London is abused in a workhouse, then falls into the clutches of a gang of thieves.\n\nDespite the fact that the Sowerberrys and Noah Claypole appear in the cast list, the entire Sowerberry sequence is omitted from this film, as is Monks, Oliver's half-brother. Rose Maylie becomes Brownlow's daughter in this version, and it is Brownlow's house that Skes attempts to rob. It is possible that early releases of this film did include Noah Claypole and the Sowerberrys.\n\n---\n\nDirected by William J. Cowen, produced by I.E. Chadwick, written by Charles Dickens (novel Oliver Twist) and Elizabeth Meehan (writer), starring Irving Pichel, Dickie Moore, Doris Lloyd and William \"Stage\" Boyd.\n\n---\n\nSource: \"Oliver Twist (1933 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 16 March 2012. Web. 2 August 2012. http://en.wikipedia.org/wiki/Oliver_Twist_(1933_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "86VClCodYLA",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a-A3TVch4GU",
      "title": "Oliver Twist (1933) | Colorized Public Domain Classic | Dickens’ Timeless Tale Restored",
      "description": "Oliver Twist (1933) is an American pre-Code adaptation of Charles Dickens’ iconic 1838 novel, directed by William J. Cowen and produced by Monogram Pictures. Featuring a strong cast led by Dickie Moore as Oliver Twist, Doris Lloyd as Nancy, and Irving Pichel as the sinister Fagin, this version of Dickens’ masterpiece remains one of the most notable early sound adaptations of the classic story. This restored and colorized presentation from Colorized Public Domain brings new vibrancy to a film that has delighted generations, enhancing the experience for audiences in the United States, Europe, and worldwide while preserving its historic and cultural significance.\n\nPlot Summary:\nThe story follows Oliver Twist, an orphan born in a workhouse who endures poverty, cruelty, and mistreatment before seeking his place in the world. After escaping a harsh apprenticeship, Oliver travels to London, where he falls into the clutches of Fagin, a manipulative criminal who trains children to become pickpockets. Despite this dark underworld, Oliver’s innate goodness shines through as he encounters compassion from Nancy, a tragic figure torn between loyalty to her lover Bill Sikes and her desire to save Oliver. As Oliver’s true identity and heritage come to light, Dickens’ tale delivers a message of justice, redemption, and the enduring fight between good and evil.\n\nCast and Crew:\n• Director: William J. Cowen\n• Producer: Sam Bischoff\n• Based on: Charles Dickens’ 1838 novel Oliver Twist\nStarring:\n• Dickie Moore as Oliver Twist\n• Irving Pichel as Fagin\n• Doris Lloyd as Nancy\n• William “Stage” Boyd as Bill Sikes\n• Barbara Kent as Rose Maylie\n• Ivan Simpson as Mr. Brownlow\n• Alec B. Francis as The Doctor\n\nFilm Significance:\nThe 1933 adaptation of Oliver Twist is especially important as it represents the early Hollywood attempt to faithfully bring Dickens’ complex novel to the screen during the pre-Code era. Released before the strict enforcement of the Production Code in 1934, this version was able to retain some of the darker and more unsettling elements of Dickens’ narrative. The portrayal of crime, poverty, and moral ambiguity remains powerful, reflecting the social realities of both Victorian England and Depression-era America.\n\nDickie Moore, one of Hollywood’s most beloved child actors and a former member of the Our Gang series, delivers a touching and memorable performance as Oliver. Irving Pichel’s menacing depiction of Fagin provides a haunting interpretation of Dickens’ infamous villain, balancing menace and manipulation. Doris Lloyd’s portrayal of Nancy adds emotional depth, embodying the compassion and tragedy at the heart of Dickens’ story.\n\nEnhanced Public Domain Edition:\nOliver Twist (1933) has entered the public domain, allowing it to be freely shared, studied, and preserved. Colorized Public Domain carefully restores these timeless works through frame-by-frame digital cleaning, enhancing clarity, stabilizing sound, and applying authentic, historically respectful colorization. By modernizing the visual presentation while respecting the original artistry, we make Oliver Twist accessible to new generations of viewers who may otherwise overlook early black-and-white cinema.\n\nWhy This Version Matters:\nWhile many adaptations of Oliver Twist exist, including later big-budget productions, the 1933 version remains a vital piece of cinematic history. Produced by Monogram Pictures, a studio known for low-budget but culturally significant films, it captures the grit, humanity, and drama of Dickens’ story in a way that reflects both the social struggles of Victorian England and the economic anxieties of 1930s America. This version also highlights the transition in Hollywood as sound cinema became firmly established, blending stage-style performances with early talkie filmmaking.\n\nFor classic film fans, Dickens enthusiasts, and students of early Hollywood, Oliver Twist (1933) provides a fascinating intersection of literature, cinema history, and cultural commentary. The film remains a testament to the enduring relevance of Dickens’ critique of poverty, injustice, and the resilience of the human spirit.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more restored and colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nAt Colorized Public Domain, we bring forgotten treasures back to life. From literary adaptations like Oliver Twist to golden-age Hollywood dramas, pre-Code films, comedies, and adventure stories, our channel is dedicated to preserving cinema history while reimagining it for modern audiences in the USA, Europe, and beyond.\n\n#OliverTwist1933 #CharlesDickens #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #GoldenAgeHollywood #DickieMoore #IrvingPichel #PreCodeHollywood #MonogramPictures",
      "id": "a-A3TVch4GU",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s0Ar5Gfli-Q",
      "title": "Oliver Twist (1933) CHARLES DICKENS🍕 DICKIE MOORE🍕 FAMILY DRAMA",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Dickie Moore, Irving Pichel, William 'Stage' Boyd\nDirector: William J. Cowen\nWriter: Charles Dickens (based on a novel by)\n\nStep into the world of Charles Dickens’ beloved story with Oliver Twist, a classic family drama brought to life by Monogram Pictures. Directed by William J. Cowen, this captivating adaptation stars Dickie Moore (Our Gang) as Oliver, the courageous orphan who inspires generations with his quest for love and belonging. The versatile Irving Pichel delivers a masterful performance as Fagin, bringing depth to Dickens' iconic villain. \n\nThe remarkable supporting cast includes William 'Stage' Boyd as the ruthless Bill Sikes, Barbara Kent as the kind-hearted Rose, and Sonny Ray as The Artful Dodger.\n\nThis classic adaptation is a must-watch for fans of vintage cinema, drama enthusiasts, and admirers of Charles Dickens’ timeless tales. Whether you're a devotee of Monogram Pictures or a lover of family movies with heart and substance, Oliver Twist (1933) delivers an unforgettable cinematic experience.\n\nExplore the treasures of Hollywood’s golden age on PizzaFLIX, your destination for classic movies and vintage storytelling. Subscribe today to uncover more timeless films that have shaped the history of cinema.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#OliverTwist #CharlesDickens #ClassicMovies #FamilyDrama #DickieMoore #IrvingPichel #MonogramPictures #VintageCinema #PizzaFLIX",
      "id": "s0Ar5Gfli-Q",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "80 min",
    "imdbRating": 5,
    "imdbVotes": 399,
    "Genre": "Drama, Family, Mystery",
    "Plot": "An orphan boy in 1830s London is abused in a workhouse, then falls into the clutches of a gang of thieves.",
    "Director": "William J. Cowen",
    "Writer": "Charles Dickens, Elizabeth Meehan",
    "Actors": "Dickie Moore, Irving Pichel, William 'Stage' Boyd",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026001",
      "title": "Woman Unafraid",
      "year": 1934,
      "imdbRating": 6.2,
      "imdbVotes": 58,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0024210",
      "title": "The Kennel Murder Case",
      "year": 1933,
      "imdbRating": 6.8,
      "imdbVotes": 4237,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024619",
      "title": "Strange People",
      "year": 1933,
      "imdbRating": 5.8,
      "imdbVotes": 67,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024727",
      "title": "The Vampire Bat",
      "year": 1933,
      "imdbRating": 5.7,
      "imdbVotes": 3180,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024787",
      "title": "The World Gone Mad",
      "year": 1933,
      "imdbRating": 4.8,
      "imdbVotes": 615,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt3305388",
      "title": "Mountain Top",
      "year": 2017,
      "imdbRating": 7.2,
      "imdbVotes": 598,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt3417316",
      "title": "Leaves of the Tree",
      "year": 2015,
      "imdbRating": 5,
      "imdbVotes": 152,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0024559",
      "title": "The Silk Express",
      "year": 1933,
      "imdbRating": 6.1,
      "imdbVotes": 183,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024222",
      "title": "The Kiss Before the Mirror",
      "year": 1933,
      "imdbRating": 6.5,
      "imdbVotes": 731,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022791",
      "title": "Cross-Examination",
      "year": 1932,
      "imdbRating": 5.6,
      "imdbVotes": 146,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022989",
      "title": "Hell's Headquarters",
      "year": 1932,
      "imdbRating": 4.6,
      "imdbVotes": 68,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023218",
      "title": "The Midnight Lady",
      "year": 1932,
      "imdbRating": 5.6,
      "imdbVotes": 97,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.902Z"
}