{
  "imdbId": "tt0046731",
  "title": "Attila",
  "year": 1954,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y-FVH-6IyMk",
      "id": "Y-FVH-6IyMk",
      "title": "Attila | Full Action Horror Movie",
      "description": "**This film is under license from The Asylum.  All rights reserved**\n\nAttila - When American soldiers inadvertently steal Attila the Hun's secret riches, the wrath of the barbarian is awakened; the mummified warrior will stop at nothing to kill the intruders.\n\n2013\nStars: Cheick Kongo, Chris Conrad, Mikayla S. Campbell\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:58.888Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Y-FVH-6IyMk/maxresdefault.webp",
      "duration": 5103,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "NZ",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "80 min",
    "imdbRating": 5.4,
    "imdbVotes": 806,
    "Genre": "Biography, Drama, History",
    "Plot": "The king of the Huns, whose hordes from various tribes and allies have been sweeping the Asian steppes and both Roman empires, dies, leaving the throne to two sons. Bleda, tired of war and hungry, bloody campaigns, wants to settle as allies of Rome in peace, his brother Attila believes only in the power of the sword. Roman general Aethius, who knows the Huns well as a result of former hostage exchanges, fails to get a true peace but buys a shaky one promising doubled tribute. The court of weakling emperor Valentinianus, moved north from Rome to Ravenna, where the true ruler is empress-mother Galla Placidia, widow of a barbarian king, refuses the terms and imprisons Aethius, who still refuses to seize power with Valentinian's sister Honoria. The ambitious princess now offers her hand and the empire as dowry to Attila, just what Bleda hoped for. Scorning peace, Attila has popular Bleda murdered during a hunt, and persuades the hordes to march with him on the empire. While clueless, scared Valentinian can only mourn his pet cheetah, Aethius is rehabilitated by Galla Placidia to lead a desperate defense, but the neglected legions without serious fortifications are no match for the Hun hordes, who fear nothing, except perhaps the mysterious Christian god and his earthly representative, pope Leo...",
    "Director": "Pietro Francisci",
    "Writer": "Ennio De Concini, Frank Gervasi, Richard C. Sarafian",
    "Actors": "Anthony Quinn, Sophia Loren, Henri Vidal",
    "Language": "Italian",
    "Country": "Italy, France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0045473",
    "tt0046051",
    "tt0049933",
    "tt0055774",
    "tt0054847",
    "tt0048603",
    "tt0041437",
    "tt1441953",
    "tt0060107",
    "tt0086891",
    "tt0024966",
    "tt0266425"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:22:46.717Z"
}