{
  "movieId": "tt0003497",
  "title": "The Unwelcome Guest",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheUnwelcomeGuest",
      "id": "PreviewTheUnwelcomeGuest",
      "title": "\"The Unwelcome Guest\" (1913) director D. W. Griffith with Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"The Unwelcome Guest\" is a short drama, included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame.   Directed by               D. W. Griffith Produced by             Biograph Company Scenario by                George Hennessy       Starring                     Mary Pickford, W. Chrystie Miller, Claire McDowell, Charles Hill Mailes, Elmer Booth, Harry Carey Cinematography        Billy Bitzer Distributed by           General Film Company Release date               March 15, 1913 Running time             17 min. Country                      United States Language                    Silent film, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 27297867,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheUnwelcomeGuest",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 2007
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 6.6,
    "imdbVotes": 33,
    "Genre": "Short, Drama",
    "Plot": "Just before she dies, an elderly married woman stashes the horde of money she's secretly accumulated beneath the false bottom of an old shipping trunk. After her death, her husband, believing himself penniless, has to leave their old home and move in with his son's family, where he's treated with no respect or consideration. Also on the scene is a newly-hired kindly young housekeeper (Mary Pickford); she and the old gentleman become close friends and eventually run away together (taking the old shipping trunk with them).",
    "Director": "D.W. Griffith",
    "Writer": "George Hennessy",
    "Actors": "Mary Pickford, W. Chrystie Miller, Charles Hill Mailes",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002400",
    "tt0002386",
    "tt0002478",
    "tt0002391",
    "tt0003075",
    "tt0003516",
    "tt0003323",
    "tt0002968",
    "tt0002054",
    "tt0002342",
    "tt0002176",
    "tt0002415"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}