{
  "imdbId": "tt0024645",
  "title": "Tarzan the Fearless",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TarzanTheFearless1933",
      "title": "Tarzan the Fearless (1933)",
      "description": "Dr. Brooks is captured by followers of Zar, God of the Jeweled Fingers and Tarzan (Buster Crabbe) sets out to save him. AFter seeing a picture of Brooks daughter Mary (Julie Bishop) Tarzan is captivated and sets out to find her. One of the guides is carrying a telegram offering a reward for Tarzan, dead or alive. The guides are also after the Treasure of Zar in the Lost City. - Release Date: 08/11/1933 Mystic Nights Videos The complete, original 12-chapter serial version is considered to be a lost film.",
      "fileSize": 1909677905,
      "id": "TarzanTheFearless1933"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2bUGWpj08-A",
      "title": "Tarzan the Fearless (1933) | Colorized Public Domain Jungle Adventure with Buster Crabbe as Tarzan",
      "description": "Tarzan the Fearless (1933) is a pre-Code jungle adventure film starring Olympic gold medalist Buster Crabbe in his first role as Edgar Rice Burroughs’ legendary ape man. Originally released as a 12-chapter serial and later edited into a feature film, it captures the early Hollywood fascination with exotic settings, action-packed cliffhangers, and the enduring popularity of the Tarzan character. This restored and colorized edition from Colorized Public Domain brings new life to a film that once thrilled audiences with its daring heroics, wild landscapes, and pulp adventure storytelling.\n\nPlot Summary:\nThe story follows Tarzan, the fearless lord of the jungle, as he encounters Mary Brooks (Julie Bishop, credited as Jacqueline Wells), the daughter of an explorer who has vanished in Africa. Mary sets out to find her father, guided by her fiancé Bob Hall and his companion. Along the way, the group becomes entangled with greedy fortune hunters who are after hidden treasure and a mysterious lost city.\n\nTarzan emerges as both protector and rival, rescuing Mary from wild animals, treacherous landscapes, and the schemes of those who would exploit the jungle. A recurring tension arises between Tarzan’s primal strength and Bob’s reliance on weapons and modern civilization, highlighting the film’s central conflict between nature and man. Ultimately, Tarzan proves himself not just as a physical hero, but as a guardian of the jungle and those who enter it with honest intent.\n\nOriginally structured as a serialized adventure shown in theaters week by week, Tarzan the Fearless emphasizes suspense, with each chapter ending in a cliffhanger designed to keep audiences returning. The film showcases elaborate stunts, animal encounters, and Buster Crabbe’s athleticism, reflecting his real-life background as a champion swimmer and Olympic gold medalist.\n\nCast and Crew:\n• Director: Robert F. Hill\n• Producer: Sol Lesser\n• Screenplay: Edgar Rice Burroughs (characters), Basil Dickey\n• Cinematography: Edward A. Kull\n\nStarring:\n• Buster Crabbe as Tarzan\n• Julie Bishop (as Jacqueline Wells) as Mary Brooks\n• E. Alyn Warren as Dr. Brooks\n• Edward Woods as Bob Hall\n• Philo McCullough as Atan Thome\n• Matthew Betz as Jeff Herbert\n\nFilm Significance:\nTarzan the Fearless holds a special place in cinema history as one of the earliest sound-era Tarzan adaptations. While Johnny Weissmuller is more widely remembered for his long-running MGM series, Buster Crabbe brought his own physicality and charisma to the role, later becoming famous for other iconic adventure characters such as Flash Gordon and Buck Rogers. The film reflects the pulpy escapism of 1930s Hollywood, when exotic jungles, lost cities, and rugged heroes captivated Depression-era audiences.\n\nFor modern viewers, the film provides a unique look at both early Tarzan adaptations and the serialized adventure tradition that influenced later Hollywood blockbusters. Despite being considered lower-budget compared to MGM productions, it remains a key example of early adventure cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Tarzan the Fearless remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1933 release was in black and white and designed as a serialized theater experience. While this format worked for audiences of the 1930s, many modern viewers are less inclined to watch serial-style black-and-white films. By presenting a restored and colorized edition, we make Tarzan the Fearless accessible, visually engaging, and more appealing to contemporary audiences while preserving its adventurous spirit.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TarzanTheFearless #BusterCrabbe #TarzanMovie #PublicDomainMovie #ColorizedClassic #1930sCinema #FilmRestoration #AdventureClassic #JungleAdventure #Tarzan1933",
      "id": "2bUGWpj08-A",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tarzan-the-fearless-1933_202402",
      "title": "Tarzan the Fearless (1933)",
      "description": "Mary Brooks' father, who has been studying ancient tribes, falls into the hands of \"the people of Zar, god of the Emerald Fingers.\" Tarzan helps Mary locate her father, rescues everyone from the High Priest of Zar, and takes Mary to his cave. Watch on RetroFlix:  https://retroflix.org/tarzan-the-fearless-1933/",
      "fileSize": 540592855,
      "id": "tarzan-the-fearless-1933_202402"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XyPjIiJyGfs",
      "title": "Tarzan the Fearless (1933) Colorized | Buster Crabbe",
      "description": "Mary Brooks’ father, who has been studying ancient tribes, falls into the hands of “the people of Zar, god of the Emerald Fingers.” Tarzan helps Mary locate her father, rescues everyone from the High Priest of Zar, and takes Mary to his cave.\n\nDirector: Robert F. Hill \nWriters: Edgar Rice Burroughs, Walter Anthony\nStars: Buster Crabbe, Julie Bishop, Edward Woods \nGenres: Classics, Action, Adventure\nWatch the original Black & White version: https://youtu.be/Xd4cbvhvkWI\n\nCCC CHAPTERS: in the general comments, tell us your favorite scene or line in the movie, with a time stamp & we will add it here!\n00:00 Full Length Movie\n03:20 Buster & the lion\n10:33 Wild white man raised by apes\n11:18 Tarzan to the rescue\n14:07 Tarzan meets mary\n\n@CultCinemaClassics",
      "id": "XyPjIiJyGfs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "86 min",
    "imdbRating": 4.8,
    "imdbVotes": 854,
    "Genre": "Adventure, Family",
    "Plot": "In the African Jungle, a group of Europeans come across the fabled white man who was raised by apes. Tarzan takes an immediate liking to the blond Mary Brooks and rescues her during a nasty storm. Not everyone in the party sees Tarzan as a friend and one of the safari guides, Jeff Herbert, has a written offer of £10,000 for anyone who can confirm that the ape man is dead. Mary's father disappears however, taken prisoner by those who guard the treasure of Zar. It's left to Tarzan to rescue him and the others who have been taken prisoner.",
    "Director": "Robert F. Hill",
    "Writer": "Edgar Rice Burroughs, Walter Anthony",
    "Actors": "Buster Crabbe, Julie Bishop, Edward Woods",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0025309",
      "title": "Inside Information",
      "year": 1934,
      "imdbRating": 5.4,
      "imdbVotes": 70,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023753",
      "title": "Alice in Wonderland",
      "year": 1933,
      "imdbRating": 6.3,
      "imdbVotes": 2885,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028241",
      "title": "Shadow of Chinatown",
      "year": 1936,
      "imdbRating": 4.5,
      "imdbVotes": 303,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028396",
      "title": "Too Much Beef",
      "year": 1936,
      "imdbRating": 5.8,
      "imdbVotes": 49,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027623",
      "title": "Flash Gordon",
      "year": 1936,
      "imdbRating": 7,
      "imdbVotes": 2758,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025656",
      "title": "Pirate Treasure",
      "year": 1934,
      "imdbRating": 5.6,
      "imdbVotes": 78,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0025712",
      "title": "The Return of Chandu",
      "year": 1934,
      "imdbRating": 5.5,
      "imdbVotes": 456,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0028637",
      "title": "Blake of Scotland Yard",
      "year": 1937,
      "imdbRating": 5,
      "imdbVotes": 194,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030143",
      "title": "Flying Fists",
      "year": 1937,
      "imdbRating": 5.5,
      "imdbVotes": 56,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026164",
      "title": "Call of the Wild",
      "year": 1935,
      "imdbRating": 6.8,
      "imdbVotes": 2715,
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0026903",
      "title": "Queen of the Jungle",
      "year": 1939,
      "imdbRating": 4,
      "imdbVotes": 83,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024219",
      "title": "King of the Jungle",
      "year": 1933,
      "imdbRating": 6.2,
      "imdbVotes": 218,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.528Z"
}