{
  "movieId": "tt0021380",
  "title": "Sinkin' in the Bathtub",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sinkin-in-the-bathtub-1930_20230531",
      "id": "sinkin-in-the-bathtub-1930_20230531",
      "title": "Sinkin' in the Bathtub (1930)",
      "description": "Sinkin’ in the Bathtub is the first Warner Bros. theatrical cartoon short as well as the first of the Looney Tunes series. The short debuted in April 1930 (most likely April 19), at the Warner Bros. Theater in Hollywood. The cartoon features Bosko, and the title is a pun on the 1929 song Singin’ in the Bathtub. The film was erroneously copyrighted under the same title as the 1929 song. Watch on RetroFlix.org:  https://retroflix.org/sinkin-in-the-bathtub-1930/",
      "fileSize": 40851542,
      "addedAt": "2026-01-07T00:11:24.928Z",
      "thumbnail": "https://archive.org/services/img/sinkin-in-the-bathtub-1930_20230531",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 1101
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "8 min",
    "imdbRating": 6.1,
    "imdbVotes": 629,
    "Genre": "Animation, Short, Comedy",
    "Plot": "The film opens with Bosko whistling in his bathtub as the shower fills it with water. The song, appropriately, is \"Singin' in the Bathtub.\" He plucks his toes and his nose to make musical sounds. He even plays the streams of water as if they were harp strings. The bathtub gets into the act, by rising on its feet and dancing around the bathroom, waving a bath towel and throwing sheets of toilet paper into the air as if they were flower petals. Bosko drives his anthropomorphic car to the home of his girlfriend, Honey. The two go for a ride, but the way is blocked by a haughty cow. Bosko pushes her body down under her legs, which stick up like tent poles, and drives over her. All is sunny and bright for Bosko and Honey until they lose control of the car. This event leads to more calamities, including Honey getting trapped in a runaway bathtub on wheels. Only the happy pair's good luck can save the day.",
    "Director": "Hugh Harman, Rudolf Ising",
    "Writer": "Friz Freleng",
    "Actors": "Rochelle Hudson, Carman Maxwell",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020784",
    "tt0020983",
    "tt0020699",
    "tt0022405",
    "tt0021824",
    "tt0021590",
    "tt0021660",
    "tt0020705",
    "tt0021686",
    "tt0022956",
    "tt0024547",
    "tt0019714"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.928Z"
}