{
  "movieId": "tt0014358",
  "title": "The Pilgrim",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-pilgrim-1923-directed-by-charlie-chaplin",
      "id": "the-pilgrim-1923-directed-by-charlie-chaplin",
      "title": "The Pilgrim (1923) Directed By Charlie Chaplin",
      "description": "The Pilgrim Theatrical release poster Directed by Charlie Chaplin Written by Charlie Chaplin Starring Charlie Chaplin Edna Purviance Production company Charlie Chaplin Productions Distributed by Associated First National Pictures (USA) Release date February 25, 1923 Running time 46 min Country United States Languages Silent film English intertitles The Pilgrim is a 1923 American silent film made by Charlie Chaplin for the First National Film Company, starring Chaplin and Edna Purviance. The film marks the last time Edna Purviance co-starred with Chaplin and the last film he made for First National. Purviance also starred in Chaplin's A Woman of Paris (1923), in which Chaplin had a brief cameo. It was Chaplin's second-shortest feature film, constructed more like a two-reeler from earlier in his career. It is also noted as the first film for Charles Reisner, who became a successful director. In 1959, Chaplin included The Pilgrim as one of three films comprising The Chaplin Revue. Slightly re-edited and fully re-scored, the film contained the song \"I'm Bound For Texas\", written and composed by Chaplin, and sung by Matt Monro. The Pilgrim is one of many works from 1923 that entered the public domain in the United States in 2019. Plot The Pilgrim, an escaped convict, steals a minister's clothes to replace his prison uniform. At a train station, he encounters an eloping couple who want him to marry them. The woman's father shows up and takes her away. The convict then picks a destination at random and ends up in Devil's Gulch, Texas, on a Sunday. A delegation is waiting to welcome their new parson. With the sheriff nearby, the Pilgrim has to keep playing his part. A large deacon takes him to the church, where he improvises a sermon about David and Goliath. It has been arranged for the parson to board with Mrs. Brown and her attractive daughter. The latter and the Pilgrim are attracted to each other. A complication arises when the crook, the Pilgrim's old cellmate, spots him. Curious, the man pretends to be the Pilgrim's old college friend and is invited to tea by Mrs. Brown. Among the other guests are a man and wife and their young boy, who proceeds to annoy everyone. Also present is the large deacon, who refuses to accept Mrs. Brown's mortgage payment on the Sabbath. Despite the Pilgrim's best efforts, the crook later steals the money and flees. The Pilgrim promises Miss Brown he will get the money back. After he leaves, however, the sheriff shows the young woman a wanted poster for her boarder. The crook heads to a casino. Despite a robbery in progress, the Pilgrim manages to retrieve the money. He gives it and the church collection to Miss Brown. When he is apprehended by the sheriff, Miss Brown comes to his defense, revealing what he has done. As a result, the sheriff takes his prisoner to the border and orders him to pick him some flowers on Mexican land. Not taking the hint, the Pilgrim returns. The sheriff has to literally kick him out of American jurisdiction before he recognizes the lawman's act of kindness. However, his enjoyment of the peace of a new land proves to be short-lived; several gunmen pop out of the undergrowth and start shooting at each other. The frightened Pilgrim hastens away, straddling the border as he ponders his options. Reception Chaplin biographer Jeffrey Vance considers The Pilgrim to be an important work and gives the film careful consideration in his 2003 book Chaplin: Genius of the Cinema in contrast to other Chaplin biographers. Vance writes: \"The Pilgrim is one of Chaplin's richest—and most neglected—films.\" Vance praises the film's economy of action, classical theatrical roots (including Molière and the British music-hall), the sharp edge to the film's comedy and the ironic ending, with Chaplin's character straddling the international line between the U.S. and Mexico. Film scholar Donna Kornhaber calls the film's \"famous sermon in pantomime\" (of the story of David and Goliath) one of Chaplin's \"greatest act[s] of physical storytelling.\" In its generally positive February 26, 1923 review, The New York Times said: \"No, this picture is not the equal of The Kid. It lacks that comedy's subtleties, it isn't as sharply pointed with humanity, it isn't as finely characterized, but it's a genuine Chaplin, nevertheless.\" In the 1952 Sight & Sound poll, the great French film critic André Bazin picked The Pilgrim as one of the ten greatest movies of all time. Cast Charlie Chaplin – The Pilgrim (Lefty Lombard / Slippery Elm according to a newspaper) Edna Purviance – Miss Brown Sydney Chaplin – Eloper / Train Conductor / Little Boy's Father Mack Swain – Deacon Jones (Large Deacon) Loyal Underwood – Small Deacon Dean Riesner – Little Boy Charles Reisner – Howard Huntington, alias Nitro Nick, alias Picking Pete Tom Murray – Sheriff Bryan Henry Bergman – Sheriff on Train / Man in Railroad Station Marion Davies - Congregation member (uncredited) Phyllis Allen - Congregation member (uncredited) Kitty Bradbury – Mrs. Brown Mai Wells – Little Boy's Mother References Douglas, Nick (April 13, 2018). \"These 1923 Copyrighted Works Enter the Public Domain in 2019\". Life Hacker. Retrieved September 5, 2018. Vance, Jeffrey (2003). Chaplin: Genius of the Cinema. New York: Harry N. Abrams, pg. 128-133. ISBN 0-8109-4532-0 Vance, Jeffrey (2003). Chaplin: Genius of the Cinema. New York: Harry N. Abrams, pg. 128. ISBN 0-8109-4532-0. Vance, Jeffrey (2003). Chaplin: Genius of the Cinema. New York: Harry N. Abrams, pg. 130-133. ISBN 0-8109-4532-0 Kornhaber, Donna (2014). Charlie Chaplin, Director. Evanston, Illinois: Northwestern University Press, pg. 219. ISBN 978-0810129528 \"Movie Review – The Pilgrim\". The New York Times. February 26, 1923. Retrieved August 16, 2020. -From Wikipedia",
      "fileSize": 669388816,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-pilgrim-1923-directed-by-charlie-chaplin",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 972
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "47 min",
    "imdbRating": 7.2,
    "imdbVotes": 5880,
    "Genre": "Comedy, Western",
    "Plot": "When Charlie escapes from prison he dons a preacher's clothes. By mistake he becomes the new minister for the town of Devil's Gulch. Later, discovered as the convict, the sheriff takes Charlie to the Mexican border where he can choose to return, a convict, or face Mexican bandits at war with each other.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Edna Purviance, Syd Chaplin",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    "tt0012304",
    "tt0012349",
    "tt0009611",
    "tt0013486",
    "tt0010747",
    "tt0004936",
    "tt0005571",
    "tt0006414",
    "tt0007194",
    "tt0006684",
    "tt0008133",
    "tt0007613"
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    },
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}