{
  "imdbId": "tt0039799",
  "title": "Sarge Goes to College",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sarge-goes-to-college",
      "id": "sarge-goes-to-college",
      "title": "Sarge Goes To College",
      "description": "Sarge Goes to College Freddie Stewart, June Pressier, Noel Neill, Frankie Darro, Alan Hale Jr., Frank Cady 1947 Monogram Pictures This is the fifth of eight films in The Teen Agers series.",
      "fileSize": 1248665098,
      "addedAt": "2026-01-07T00:10:40.952Z",
      "thumbnail": "https://archive.org/services/img/sarge-goes-to-college",
      "collection": "feature_films",
      "downloads": 519
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "63 min",
    "imdbRating": 6.5,
    "imdbVotes": 35,
    "Genre": "Comedy, Music, Romance",
    "Plot": "A Marine Sergeant wounded in overseas combat service, requires an operation, and Navy psychiatrist Captain R. S. Handler, recommends to Marine Captain Russ Morgan and Colonel Winters that \"Sarge\" be given a few weeks rest before hospitalization. Through Dean McKinley of San Juan Junior College, Sarge enters the school on a temporary basis. The teenagers are rehearsing a school show and Freddie is worried because they have no band. Freddie, Dodie Rogers and Betty Rogers find Sarge asleep in the park, and the girls put him up at their house when they learn he can't find a room. Betty has a row with boyfriend Roy , and in order to make him jealous gets Freddie to invite her to the school dance after telling Freddie that his girlfriend Dodie is going with Sarge. Many misunderstandings follow but all is well when Sarge gets his marine captain to bring his band over to the school for the school's BIG SHOW.",
    "Director": "Will Jason",
    "Writer": "Harry Edwards, Hal Collins",
    "Actors": "Freddie Stewart, June Preisser, Frankie Darro",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040803",
    "tt0039948",
    "tt0040208",
    "tt0040919",
    "tt0036861",
    "tt0036928",
    "tt0036922",
    "tt0024808",
    "tt0039219",
    "tt0031440",
    "tt0039370",
    "tt0034730"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.952Z"
}