{
  "imdbId": "tt0006313",
  "title": "Work",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewWork",
      "id": "PreviewWork",
      "title": "Charlie Chaplin's \"Work\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Work\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin      Starring                     Charlie Chaplin, Edna Purviance, Billy Armstrong, Marta Golden Cinematography        Harry Ensign, Roland Totheroh Distributed by           General Film Company Release date               June 21, 1915 Running time             28 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 362785283,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewWork",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 12264
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-work",
      "id": "silent-work",
      "title": "Work",
      "fileSize": 443896649,
      "addedAt": "2026-01-07T00:11:24.927Z",
      "thumbnail": "https://archive.org/services/img/silent-work",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 2212
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/work-1915",
      "id": "work-1915",
      "title": "Work (1915)",
      "description": "Work is a 1915 American silent film starring Charlie Chaplin (his eighth film for Essanay Films), and co-starring Edna Purviance, Marta Golden and Charles Inslee. It was filmed at the Majestic Studio in Los Angeles. Watch on RetroFlix.org:  https://retroflix.org/work-1915/",
      "fileSize": 508733407,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/work-1915",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 186
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/work-1915-directed-by-charlie-chaplin",
      "id": "work-1915-directed-by-charlie-chaplin",
      "title": "Work (1915) Directed By Charlie Chaplin",
      "description": "Work Still of Charlie Chaplin and Edna Purviance for the film. Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Charles Inslee Billy Armstrong Edna Purviance Leo White Cinematography Harry Ensign Edited by Charlie Chaplin Music by Robert Israel (Kino video release) Distributed by Essanay Studios General Film Company Release date June 21, 1915 Running time 33 minutes Country United States Languages Silent film English (original intertitles) Work is a 1915 American silent film starring Charlie Chaplin (his eighth film for Essanay Films ), and co-starring Edna Purviance , Marta Golden and Charles Inslee . It was filmed at the Majestic Studio in Los Angeles . It is one of the first movies to appreciate the slapstick potential of a painting and decorating scenario. Plot Charlie is an assistant to Izzy A. Wake, a painter and wallpaper hanger. The two men are on their way to a job carrying their ladders and materials on a cart. The boss rides in the cart, leisurely sitting in front of all their paraphernalia, while Charlie is hitched to the cart like a mule. The boss also treats Charlie like a mule, beating him with a stick to get him to move faster. When the boss opts to take a shortcut up a steep hill, the out-of-control cart descends and is nearly hit by an oncoming streetcar. A second attempt to scale the enormous hill is successful. A further delay is caused by Charlie falling down a manhole. At the destination house, Charlie carries all the material on the cart into the house in one move. They have been commissioned to hang wallpaper, but Charlie becomes distracted by the pretty maid. The boss has a misadventure and falls, his head ending up in a bucket of paste. Meanwhile, the short-tempered homeowner is contending with the threat of an exploding stove and an amorous French visitor who is making passes at his wife. Shots are fired—and the target turns out to be Charlie who has been enjoying the maid's company. An enraged Charlie gives the Frenchman, his boss, and the homeowner each a face full of paste. As the fight moves into the kitchen, the troublesome stove finally explodes. When the dust dies down, Charlie is nowhere to be seen. Slowly the oven door opens. Charlie looks out and retreats back into the stove. Cast Charlie Chaplin ... Izzy A. Wake's Assistant Billy Armstrong ... The Husband (uncredited) Marta Golden ... The Wife (uncredited) Charles Inslee ... Izzy A. Wake - Paperhanger (uncredited) Paddy McGuire ... The Plasterbearer (uncredited) Edna Purviance ... Maid (uncredited) Leo White ... The Secret Lover (uncredited) Reception A reviewer from Bioscope praised Work, noting, \"The humor is designed to rise in a long crescendo of screams to a climax of roars. Positively, the thing is irresistible.\" From Wikipedia, the free encyclopedia",
      "fileSize": 694581510,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/work-1915-directed-by-charlie-chaplin",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 196
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "29 min",
    "imdbRating": 6.2,
    "imdbVotes": 1891,
    "Genre": "Comedy, Short",
    "Plot": "Charlie and his boss have difficulties just getting to the house they are going to wallpaper. The householder is angry because he can't get breakfast and his wife is screaming at the maid as they arrive. The kitchen gas stove explodes, and Charlie offers to fix it. The wife's secret lover arrives and is passed off as the workers' supervisor, but the husband doesn't buy this and fires shots. The stove explodes violently, destroying the house.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Billy Armstrong, Marta Golden",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006309",
    "tt0004936",
    "tt0005044",
    "tt0005489",
    "tt0005542",
    "tt0006177",
    "tt0006032",
    "tt0005812",
    "tt0005571",
    "tt0005810",
    "tt0005074",
    "tt0006414"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}