{
  "imdbId": "tt0002478",
  "title": "The School Teacher and the Waif",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheSchoolTeacherAndTheWaif",
      "id": "PreviewTheSchoolTeacherAndTheWaif",
      "title": "\"The School Teacher And The Waif\" (1912) with Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The School Teacher and the Waif\" is a short drama, included in our program to illustrate the work of Robert Harron and Billy Bitzer, stars of Silent Hall of Fame. An unhappy girl intends to run away, lured by a marriage proposal from a stranger. Her kindly teacher is the only one that can stop her.   Directed by               D.W. Griffith Produced by             Biograph Company Starring                     Edwin August, Mary Pickford, Robert Harron, Charles Hill Mailes Cinematography        Billy Bitzer Distributed by           General Film Company Release date               June 27, 1912 Running time             13 min. Country                      United States Language                    Silent film, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 16331339,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheSchoolTeacherAndTheWaif",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 2555
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.6,
    "imdbVotes": 69,
    "Genre": "Short, Comedy, Drama",
    "Plot": "Nora, a wild girl who lives with her alcoholic father, is forced to attend school. The untamed girl, who does not know how to socialize, is soon taunted by the other children. She warms towards the kind schoolteacher, as he befriends and encourages her, until she is told to wear the dunce cap at a spelling bee. She then angrily leaves the school and encounters a slick huckster. He convinces her they will run away and be married. Meanwhile, the schoolteacher, concerned over the waif's absence, goes looking for her. He encounters her at a crossroad, being spirited away by the cad. He calls the man's bluff by telling them he will get the minister to marry them at once. The huckster high-tails it out of town, leaving a rejected Nora. The caring schoolteacher, lovingly escorts her back to school.",
    "Director": "D.W. Griffith",
    "Writer": "N/A",
    "Actors": "Edwin August, Mary Pickford, Charles Hill Mailes",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0003323",
    "tt0002054",
    "tt0002386",
    "tt0002391",
    "tt0000800",
    "tt0003497",
    "tt0002400",
    "tt0002408",
    "tt0002162",
    "tt0002176",
    "tt0002415",
    "tt0002190"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}