{
  "movieId": "tt0016646",
  "title": "Beverly of Graustark",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beverly-of-graustark-1926",
      "id": "beverly-of-graustark-1926",
      "title": "Beverly Of Graustark (1926)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. This cross-dressing romantic comedy follows Marion Davies as the cousin of the prince of the country of Graustark. Her cousin is about to be decreed as king, but he suffers an injury that keeps him in bedrest. The prince begs his cousin to take his place and she happily does so. Unfortunately, she now has two issues to contend with: keeping up the act of being a haughty prince, and falling in love with the prince's bodyguard. The film was a great financial and critical hit upon release and ended up being Davies' biggest success. ",
      "fileSize": 3484681324,
      "addedAt": "2026-01-07T00:07:38.716Z",
      "thumbnail": "https://archive.org/services/img/beverly-of-graustark-1926",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 61
    }
  ],
  "metadata": {
    "Rated": "TV-PG",
    "Runtime": "70 min",
    "imdbRating": 6.6,
    "imdbVotes": 628,
    "Genre": "Comedy, Romance",
    "Plot": "Beverly of Graustark (1926) is a silent film directed by Sidney Franklin, starring Marion Davies, Antonio Moreno and Creighton Hale. The film's screenplay was written by Agnes Christine Johnston based on the novel by George Barr McCutcheon, and set on the fictional land of Graustark. The movie features a final sequence in Technicolor. This was the first film by Sidney Franklin for MGM.",
    "Director": "Sidney Franklin",
    "Writer": "Agnes Christine Johnston, George Barr McCutcheon, Joseph Farnham",
    "Actors": "Marion Davies, Antonio Moreno, Creighton Hale",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0018297",
    "tt0013512",
    "tt0018311",
    "tt0015909",
    "tt0019258",
    "tt0017305",
    "tt0017204",
    "tt0016751",
    "tt0018471",
    "tt0020081",
    "tt0014205",
    "tt0019815"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.716Z"
}