{
  "imdbId": "tt0018097",
  "title": "London After Midnight",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/london-after-midnight_1927",
      "title": "London After Midnight",
      "fileSize": 807243843,
      "id": "london-after-midnight_1927"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "69 min",
    "imdbRating": 6.6,
    "imdbVotes": 1495,
    "Genre": "Horror, Mystery, Thriller",
    "Plot": "When Roger Balfour is found shot dead in his London home, his death is declared a suicide by Inspector Burke of Scotland Yard, even though the executor of Balfour's estate, Sir James Hamlin, insists his friend never would have taken his own life. Five years later, the abandoned Balfour house comes to life again with the arrival of two sinister-looking tenants: a fiendish-looking man with pointed teeth, bulging eyes and a tall beaver hat, and a pale young woman in a long gown. The presence of the strangers prompts Sir James, who lives next door, to call in Inspector Burke again. Also living in the Hamlin household are the other people who were also present in Balfour's house the night he died: Sir James' nephew, Arthur Hibbs; the late Balfour's now-grown daughter, Lucille; and Williams, the butler. Burke expresses skepticism about Sir James' suspicions that the new neighbors might have been involved in Balfour's death, until strange things start happening: Balfour's body disappears from its tomb. The new maid, Smithson, tells a terrifying tale of being menaced in Lucille's bedroom by the stranger in the beaver hat. And a man spotted inside the Balfour house by Burke and Sir James looks distinctly like the late Roger Balfour. A skittish Arthur becomes convinced the neighbors are vampires. Burke takes Lucille aside, and tells her he doesn't believe her father committed suicide. He asks her to trust him. Burke also has a private talk with Arthur. Burke uses hypnosis to put Arthur into a trance, but learns nothing new about Balfour's death. That night, someone fires a shot into Arthur's room, but Arthur isn't there; instead, it's Burke who's slightly wounded. Lucille is abducted by the beaver-hatted man and the butler and brought to her former home. Sir James, acting at Burke's instruction, also shows up at the Balfour house; he's met out front by the beaver-hatted man, who puts him into a hypnotic trance. Arthur breaks into the Balfour house in an attempt to rescue Lucille; he's caught by Burke and a couple of detectives and locked away. It turns out the man with the beaver hat and pointed teeth was really a disguised Inspector Burke, who was aided at times by a double; Smithson, the maid, is an assistant detective; the mysterious young woman, a stage performer working for the police. Under Burke's hypnosis, Sir James re-creates his actions the night Roger Balfour died, with Lucille and the butler, Williams, playing themselves, and Burke's double playing the part of Balfour. It turns out Sir James shot and killed Balfour and made the death appear a suicide after Balfour rejected Sir James as a future husband for young Lucille. Sir James is brought out of his trance and arrested by Burke. The mystery of Balfour's death solved, Lucille and Arthur, who have come to realize how much they love each other, are now free to marry.",
    "Director": "Tod Browning",
    "Writer": "Tod Browning, Waldemar Young, Joseph Farnham",
    "Actors": "Lon Chaney, Marceline Day, Henry B. Walthall",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0019563",
      "title": "West of Zanzibar",
      "year": 1928,
      "imdbRating": 7.2,
      "imdbVotes": 2019,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0018528",
      "title": "The Unknown",
      "year": 1927,
      "imdbRating": 7.7,
      "imdbVotes": 9487,
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0020080",
      "title": "The Last Warning",
      "year": 1928,
      "imdbRating": 6.9,
      "imdbVotes": 862,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020534",
      "title": "The Unholy Night",
      "year": 1929,
      "imdbRating": 5.7,
      "imdbVotes": 413,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0020581",
      "title": "Where East Is East",
      "year": 1929,
      "imdbRating": 6.6,
      "imdbVotes": 710,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018697",
      "title": "The Big City",
      "year": 1928,
      "imdbRating": 6.9,
      "imdbVotes": 92,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016123",
      "title": "The Monster",
      "year": 1925,
      "imdbRating": 6.2,
      "imdbVotes": 1334,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020492",
      "title": "The Thirteenth Chair",
      "year": 1929,
      "imdbRating": 5.7,
      "imdbVotes": 745,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024625",
      "title": "A Study in Scarlet",
      "year": 1933,
      "imdbRating": 5.6,
      "imdbVotes": 1237,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0073582",
      "title": "Deep Red",
      "year": 1975,
      "imdbRating": 7.5,
      "imdbVotes": 45677,
      "language": "Italian, German, Hebrew",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0185371",
      "title": "House on Haunted Hill",
      "year": 1999,
      "imdbRating": 5.6,
      "imdbVotes": 62582,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053719",
      "title": "The City of the Dead",
      "year": 1960,
      "imdbRating": 6.7,
      "imdbVotes": 8856,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.892Z"
}