{
  "imdbId": "tt0020620",
  "title": "Abraham Lincoln",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/abraham_lincoln",
      "title": "Abraham Lincoln",
      "description": "A biography of the beloved United States president by D. W. Griffith. You can find more information regarding this film on its IMDb page .",
      "id": "abraham_lincoln"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/abraham-lincoln-1930",
      "title": "Abraham Lincoln",
      "description": "A biopic dramatizing Abraham Lincoln's life through a series of vignettes depicting its defining chapters: his romance with Ann Rutledge; his early years as a country lawyer; his marriage to Mary Todd; his debates with Stephen A. Douglas; the election of 1860; his presidency during the Civil War; and his assassination in Ford’s Theater in 1865. Watch on RetroFlix:  https://retroflix.org/abraham-lincoln-1930/",
      "id": "abraham-lincoln-1930"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q3P0Vq8-toE",
      "title": "Abraham Lincoln (1930) | Colorized Public Domain Biographical Drama Directed by D W Griffith | POTUS",
      "description": "Abraham Lincoln 1930 is a landmark American biographical drama directed by D W Griffith, the controversial yet influential pioneer of silent and early sound cinema. This film marked Griffith’s second sound feature and his last significant work before his career decline, blending elements of historical pageantry with personal drama. By colorizing and restoring this important public domain film, we make it accessible for today’s audiences while preserving its historical and cultural significance. This edition is especially designed for viewers in the United States, Europe, and beyond who want to rediscover classic Hollywood storytelling in modern quality.\n\nAbraham Lincoln[b] (February 12, 1809 – April 15, 1865) was the 16th president of the United States, serving from 1861 until his assassination in 1865. He led the United States through the American Civil War, defeating the Confederate States and playing a major role in the abolition of slavery. Lincoln was born into poverty in Kentucky and raised on the frontier.\n\nPlot Summary:\nThe film traces the life of Abraham Lincoln, America’s 16th president, from his humble beginnings in Kentucky and Indiana through his political rise, Civil War leadership, and ultimate assassination. Walter Huston delivers a commanding performance as Lincoln, portraying him with warmth, humor, and gravity. The narrative highlights key moments in Lincoln’s personal and political life: his courtship of Ann Rutledge, his marriage to Mary Todd, his debates against Stephen A Douglas, his presidential election, and his struggle to preserve the Union during the Civil War. The film culminates with Lincoln’s assassination at Ford’s Theatre, presenting him as both a tragic hero and a symbol of American perseverance.\n\nWhile the film compresses history into dramatic episodes, it reflects early Hollywood’s vision of Lincoln as a figure of moral clarity and national unity. Griffith aimed to humanize Lincoln, showing his inner doubts and personal hardships alongside his larger-than-life leadership.\n\nCast and Crew:\n• Director: D W Griffith\n• Producer: Joseph M Schenck\n• Screenplay: Stephen Vincent Benét and Gerrit Lloyd\n• Cinematography: Karl Struss\n• Editing: James Smith\nStarring:\n• Walter Huston as Abraham Lincoln\n• Una Merkel as Ann Rutledge\n• Kay Hammond as Mary Todd Lincoln\n• Hobart Bosworth as General Ulysses S Grant\n• Ian Keith as John Wilkes Booth\n• Jason Robards Sr as William Seward\n• Russell Simpson as Tom Lincoln\n• Helen Freeman as Elizabeth Edwards\n\nFilm Significance:\nAbraham Lincoln 1930 holds a unique place in cinema history. It was D W Griffith’s attempt to adapt to the new sound era after pioneering epic silent works like The Birth of a Nation and Intolerance. While the film received mixed reviews upon release, Walter Huston’s portrayal of Lincoln was widely praised and remains one of the most enduring screen interpretations of the president. For modern audiences, the film is not just entertainment but also a cultural artifact reflecting early Hollywood’s narrative style, technical experimentation with sound, and the shaping of Lincoln’s myth in popular culture.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Abraham Lincoln remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1930 release was in black and white and constrained by the early limitations of synchronized sound. While historically authentic, such qualities can feel distant to contemporary audiences. By offering a restored and colorized edition, we bring new vibrancy to the film, making its performances, sets, and historical details more visually compelling. This edition bridges the gap between archival preservation and modern cinematic experience, ensuring the story of Abraham Lincoln continues to inspire.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#AbrahamLincoln1930 #WalterHuston #DWGriffith #PublicDomainMovie #ColorizedClassic #HistoricalDrama #ClassicCinema #FilmRestoration #AmericanHistoryFilm",
      "id": "q3P0Vq8-toE",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AbrahamLincoln1930FullMovie",
      "title": "Abraham Lincoln (1930) restored version",
      "description": "The 16th U.S. president (Walter Huston) is portrayed as a lawyer, orator, husband and Civil War commander.",
      "id": "AbrahamLincoln1930FullMovie"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AbrahamLincoln_877",
      "title": "Abraham Lincoln",
      "description": "This 603MB file has the same runtime, and essentially the same video and audio qualities, as the 3.5GB file found elsewhere at IA. Heavily fictionalized, episodic biopic. Stars Walter Houston in his third feature film role. Art direction (settings) by William Cameron Menzies. D. W. Griffith's first sound and penultimate film. Listed in the book \"The 50 Worst Films of All Time: and How They Got That Way.\" The runtime of this version is 84 minutes. Initially released on 8 November 1930 with a runtime of 96 minutes. IMDB page: http://www.imdb.com/title/tt0020620/",
      "id": "AbrahamLincoln_877"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IftLte65ZyY",
      "title": "Abraham Lincoln (1930) D.W. GRIFFITH",
      "description": "Director: D.W. Griffith\nStars: William L. Thorne, Lucille La Verne, Walter Huston\n\nIn this episodic biography, a simple backwoods boy rises to become one of America''s most beloved presidents.",
      "id": "IftLte65ZyY",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sM3zDZMLVBY",
      "title": "Abraham Lincoln (1930) Colorized | Walter Huston, Una Merkel | Full Movie | HD Quality | Subtitled",
      "description": "A biopic dramatizing Abraham Lincoln’s life through a series of vignettes depicting its defining chapters: his romance with Ann Rutledge; his early years as a country lawyer; his marriage to Mary Todd; his debates with Stephen A. Douglas; the election of 1860; his presidency during the Civil War; and his assassination in Ford’s Theater in 1865.\n\nBlack & White version: https://youtu.be/d0BjEZUbwmo\nDirector: D.W. Griffith\nWriters: Stephen Vincent Benet, John W. Considine Jr. \nStars: Walter Huston, Una Merkel, William L. Thorne \nGenre:  Classics, Cult Film, Biography, Drama, History \n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "sM3zDZMLVBY",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=d0BjEZUbwmo",
      "title": "Abraham Lincoln (1930) D.W. Griffith | Biography, History | Original version with subtitles",
      "description": "Battles Rage, Sheridan Rides, History is Written and Lincoln Lives Again in this episodic biography of the 16th President of the United States.\n\nColorized version: https://youtu.be/sM3zDZMLVBY\n\n\nDirector: D.W. Griffith\nWriters: Stephen Vincent Benet, John W. Considine Jr. \nStars: Walter Huston, Una Merkel, William L. Thorne \nGenre:  Classics, Cult Film, Biography, Drama, History \n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "d0BjEZUbwmo",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "96 min",
    "imdbRating": "5.6",
    "imdbVotes": "1,747",
    "Genre": "Biography, Drama, War",
    "Plot": "Brief vignettes about Lincoln's early life include his birth, early jobs, (unsubstantiated) affair with Ann Rutledge, courtship of Mary Todd, and the Lincoln-Douglas debates; his presidency and the Civil War are followed in somewhat more detail, though without actual battle scenes; film concludes with the assassination.",
    "Director": "D.W. Griffith",
    "Writer": "Stephen Vincent Benet, John W. Considine Jr., Gerrit J. Lloyd",
    "Actors": "Walter Huston, Una Merkel, William L. Thorne",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0000854",
      "title": "Edgar Allan Poe",
      "year": 1909,
      "imdbRating": "5.9",
      "imdbVotes": "573",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004972",
      "title": "The Birth of a Nation",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "26,892",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001265",
      "title": "In the Border States",
      "year": 1910,
      "imdbRating": "6.4",
      "imdbVotes": "579",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014672",
      "title": "America",
      "year": 1924,
      "imdbRating": "6.3",
      "imdbVotes": "459",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009150",
      "title": "Hearts of the World",
      "year": 1918,
      "imdbRating": "6.6",
      "imdbVotes": "1,094",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000895",
      "title": "The Hessian Renegades",
      "year": 1909,
      "imdbRating": "5.5",
      "imdbVotes": "211",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001913",
      "title": "Swords and Hearts",
      "year": 1911,
      "imdbRating": "5.4",
      "imdbVotes": "253",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001227",
      "title": "The Fugitive",
      "year": 1910,
      "imdbRating": "5.8",
      "imdbVotes": "254",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001680",
      "title": "His Trust: The Faithful Devotion and Self-Sacrifice of an Old Negro Servant",
      "year": 1911,
      "imdbRating": "5.1",
      "imdbVotes": "661",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009109",
      "title": "The Girl Who Stayed at Home",
      "year": 1919,
      "imdbRating": "6.3",
      "imdbVotes": "131",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001256",
      "title": "The House with Closed Shutters",
      "year": 1910,
      "imdbRating": "5.9",
      "imdbVotes": "590",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020074",
      "title": "Lady of the Pavements",
      "year": 1929,
      "imdbRating": "6.9",
      "imdbVotes": "135",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:52:41.999Z"
}