{
  "imdbId": "tt0025610",
  "title": "Our Daily Bread",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ODailyBread",
      "id": "ODailyBread",
      "title": "Our Daily Bread",
      "description": "Great Depression tale of community, cleverness, and hard work. Tagline: We live! We love! We fight! We hate! What don't we do for - OUR DAILY BREAD Here's the IMDB page.",
      "fileSize": 1824455986,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/ODailyBread",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 87044
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eqa6vGhpkvc",
      "id": "eqa6vGhpkvc",
      "title": "Our Daily Bread (1934) TOM KEENE🍕 KAREN MORLEY",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nDirector: King Vidor\nStars: Tom Keene, Karen Morley, Barbara Pepper, John Qualen\nWriters: King Vidor, Elizabeth Hill, Joseph L. Mankiewicz\n\nA powerful tale of resilience and ingenuity in the face of desperation during the Great Depression. \n\n🍕TRIVIA: A sequel to King Vidor's Oscar-nominated film The Crowd, with the same lead characters but portrayed by different actors🍕\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "addedAt": "2025-12-24T01:05:28.821Z",
      "thumbnail": "https://i.ytimg.com/vi/eqa6vGhpkvc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAv99LweH4nIxd8kFvL4t1-qGqXWw",
      "duration": 4523,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 7,
    "imdbVotes": 2233,
    "Genre": "Drama, Romance",
    "Plot": "John Sims is a man with big ideas but little follow through. Unemployed, unable to find a job, and having no money with the economy being as depressed as it is, he and his loving wife Mary Sims are a few days away from being evicted and thus homeless. Not wanting a handout per se, Mary is hoping that her visiting Uncle Anthony will at least be able to offer John a job. What he offers them instead is an unused farm property - one hundred sixty acres - for which he has no use, and which the bank holding the mortgage doesn't want in the value being virtually worthless, it at least giving them a place to live and work until they decide their next step. It isn't until they arrive that they truly discover how little they know about farming, especially as a transient Swede named Chris, passing by much like them looking for work, and his wife Hilda show them more about farming and rural life in one day than they could have imagined. It is then that John comes up with his next big idea: to amass others looking for work to form a cooperative on the farm. Each person, providing what they have available, would barter among themselves their services and belongings with the others who need such, they all living on the property in small houses they build themselves, they all sharing equally what they have, and they selling whatever surplus they may have, especially in what they raise, for other things they may need to purchase. In finding such like minded people solely by posting a sign along the road, John is able to form that cooperative, the people, in turn, voting, that their governance structure will be John, the one who brought them all together, as \"boss\", with others assigned needed administrative roles. The question then becomes whether John can follow through especially when the situation throws them curve balls, such potential ones being people in their midst who are solely out for themselves, or the fickle nature of farming which is highly reliant upon Mother Nature's cooperation.",
    "Director": "King Vidor",
    "Writer": "King Vidor, Elizabeth Hill, Joseph L. Mankiewicz",
    "Actors": "Karen Morley, Tom Keene, Barbara Pepper",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0022689",
    "tt0022436",
    "tt0045109",
    "tt0049934",
    "tt0018806",
    "tt0016251",
    "tt0015498",
    "tt0019258",
    "tt0026489",
    "tt0025178",
    "tt0025016",
    "tt0026367"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.465Z"
}