{
  "imdbId": "tt0043655",
  "title": "The Hoodlum",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Hoodlum",
      "title": "The Hoodlum",
      "description": "Lawrence Tierney plays an unreformed, hardened criminal who has just been released from prison. While working at his brother's gas station, he becomes very interested in the armored car that makes regular stops at the bank across the street. If you enjoy heist films, watch this. Tierney was perfect for this type of role. The IMDB entry is here.",
      "id": "The_Hoodlum"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XacsUhpbAok",
      "title": "The Hoodlum (1951) [Film Noir] [Crime] [Drama]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"The Hoodlum\" is a 1951 American film noir directed by Max Nosseck featuring Lawrence Tierney, Allene Roberts, Marjorie Riordan and Lisa Golm. The movie is about an ex-convict, who plans a bank robbery that implicates his brother.\n\n---\n\nDirected by Max Nosseck, produced by Maurice Kosloff, screenplay by Sam Neuman and Nat Tanchuck, story by Sam Neuman and Nat Tanchuck, starring Lawrence Tierney as Vincent Lubeck, Allene Roberts as Rosa, Marjorie Riordan as Eileen, Lisa Golm as Mrs. Lubeck, Edward Tierney as Johnny Lubeck, Stuart Randall as Police Lt. Burdick, Angela Stevens as Christie Lang, John De Simone as Marty Connell, Tom Hubbard as Police Sgt. Schmidt, Eddie Foster as Mickey Sessions, O.Z. Whitehead as Mr. Breckenridge. Richard Barron as Eddie Bright and Rudy Rama as Harry Hill.\n\n---\n\nSource: \"The Hoodlum (1951 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 July 2013. Web. 21 July 2013. http://en.wikipedia.org/wiki/The_Hoodlum_(1951_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "XacsUhpbAok",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kdWDJWgivY4",
      "title": "The Hoodlum (1951) | Colorized Public Domain Crime Drama with Lawrence Tierney and Allene Roberts",
      "description": "The Hoodlum (1951) is an American crime drama directed by Max Nosseck, starring Lawrence Tierney in one of his most memorable tough-guy performances. This colorized and restored edition breathes new life into a gritty postwar story of greed, betrayal, and downfall. By reviving this forgotten gem in modern quality and color, today’s audiences in the United States, Europe, and beyond can rediscover a raw and uncompromising example of classic film noir storytelling.\n\nPlot Summary:\nVincent Lubeck (Lawrence Tierney) is a hardened ex-convict released from prison after serving time for bank robbery. Despite the hopes of his mother and his brother Johnny (Edward Tierney), Vincent quickly falls back into his old ways. Working at his brother’s gas station only fuels his resentment and restless ambition. Soon, he becomes involved in another robbery — this time targeting an armored bank truck. Consumed by greed and unable to escape his violent impulses, Vincent manipulates everyone around him, including Rosa (Allene Roberts), an innocent young woman drawn into his web of deceit.\nAs his ruthless schemes spiral out of control, Vincent betrays those closest to him, sealing his own fate. The film unfolds as a stark portrait of postwar disillusionment, where ambition without conscience leads only to destruction.\n\nCast and Crew:\n• Director: Max Nosseck\n• Producer: Maurice Kosloff\n• Screenplay: Sam Neuman, Nat Tanchuck\n• Cinematography: Clark Ramsey\n• Editing: William Austin\nStarring:\n• Lawrence Tierney as Vincent Lubeck\n• Allene Roberts as Rosa\n• Edward Tierney as Johnny Lubeck\n• Lisa Golm as Mrs. Lubeck\n• Marjorie Riordan as Eileen\n• Stuart Randall as Policeman\n\nFilm Significance:\nThe Hoodlum reflects the classic traits of American film noir: morally ambiguous characters, harsh urban landscapes, and fatalistic storytelling. Lawrence Tierney, often cast as a menacing antihero, delivers a performance that embodies the raw energy and brutality of the genre. While not a big-budget studio release, the film captures the essence of postwar crime cinema, showing how ambition and corruption corrode family ties and human decency. For modern audiences, it serves as a cultural artifact of the early 1950s, a time when noir was shifting from major studio productions to grittier, independent features.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Hoodlum remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe Hoodlum was originally released in 1951 in black and white, consistent with the film noir tradition. While visually atmospheric, black-and-white often discourages modern audiences from engaging with older films. By offering a carefully restored and colorized version, we highlight the emotional intensity of Lawrence Tierney’s performance and make the gritty postwar story more accessible to today’s viewers. This edition bridges the gap between classic Hollywood style and modern viewing expectations.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten noir crime dramas to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheHoodlum #LawrenceTierney #1950sCrime #FilmNoir #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #CrimeDrama #ClassicCinema #FilmRestoration",
      "id": "kdWDJWgivY4",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-hoodlum-1951",
      "title": "The Hoodlum (1951)",
      "description": "Vincent Lubeck is a vicious ex-convict. His criminal activities are despised by his family, but he uses and abuses them in the course of his crimes. Eventually his own brother must stand up to him. Watch on RetroFlix:  https://retroflix.org/the-hoodlum-1951/",
      "id": "the-hoodlum-1951"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WiUtScwwptk",
      "title": "The Hoodlum (1951) LAWRENCE TIERNEY",
      "description": "Stars: Lawrence Tierney, Edward Tierney, Allene Roberts\nDirector: Max Nosseck\n\nA bloodthirsty convict is released prison after his mother makes a\ndesperate plea to the parole board. Once free, he uses a job at his brother’s gas station to mastermind a complex armored car heist!\nReal-life Tough Guy Lawrence Tierney's iconic role.",
      "id": "WiUtScwwptk",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "61 min",
    "imdbRating": "6.2",
    "imdbVotes": "1,236",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Vincent Lubeck is a vicious and sociopathic ex-convict. His family despises his criminal activities, and he uses and abuses them in the course of his crimes. Eventually, his own brother decides he has gone entirely too far and prepares to stand up to him.",
    "Director": "Max Nosseck",
    "Writer": "Sam Neuman, Nat Tanchuck",
    "Actors": "Lawrence Tierney, Allene Roberts, Marjorie Riordan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0042640",
      "title": "Kill or Be Killed",
      "year": 1950,
      "imdbRating": "5.5",
      "imdbVotes": "153",
      "language": "American Sign , Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044364",
      "title": "Another Man's Poison",
      "year": 1951,
      "imdbRating": "6.8",
      "imdbVotes": "3,699",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043435",
      "title": "Cry Danger",
      "year": 1951,
      "imdbRating": "7.3",
      "imdbVotes": "3,004",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043390",
      "title": "Cause for Alarm!",
      "year": 1951,
      "imdbRating": "6.4",
      "imdbVotes": "2,709",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043465",
      "title": "Detective Story",
      "year": 1951,
      "imdbRating": "7.5",
      "imdbVotes": "9,898",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043625",
      "title": "He Ran All the Way",
      "year": 1951,
      "imdbRating": "7.0",
      "imdbVotes": "3,252",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043646",
      "title": "Hollywood Story",
      "year": 1951,
      "imdbRating": "6.7",
      "imdbVotes": "1,060",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043660",
      "title": "The House on Telegraph Hill",
      "year": 1951,
      "imdbRating": "6.9",
      "imdbVotes": "4,025",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043320",
      "title": "The Basketball Fix",
      "year": 1951,
      "imdbRating": "5.4",
      "imdbVotes": "210",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043523",
      "title": "The Fat Man",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "586",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043066",
      "title": "Three Steps North",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "186",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044155",
      "title": "Two Dollar Bettor",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "225",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:10.588Z"
}