{
  "movieId": "tt0034891",
  "title": "In Which We Serve",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/In_Which_We_Serve",
      "id": "In_Which_We_Serve",
      "title": "In Which We Serve",
      "description": "Based on the true story of Lord Mountbatten's destroyer, the film unfolds in flashback as survivors cling to a dinghy, and interweaves the history of their ship with the onshore lives of her crew. Hope someone uploads a better copy! Noel Coward produced, wrote the screenplay, composed the score, and starred as Captain Edward Kinross. Coward also officially codirected, though he handed the reigns to David Lean (his directorial debut). Also stars: John Mills, Bernard Miles, Celia Johnson, Kay Walsh, and Joyce Carey IMDb Page Wikipedia Page",
      "fileSize": 1880256987,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/In_Which_We_Serve",
      "language": "English",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 212053
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/THEBIJOUGOESTOWARspecialDoubleFeature",
      "id": "THEBIJOUGOESTOWARspecialDoubleFeature",
      "title": "THE BIJOU GOES TO WAR (special double feature)",
      "description": "This simulated wartime double feature program at an American movie theater in the early ‘40s is a tribute, typical of the time, to our gallant British Allies. The road to ultimate victory begins with coming attractions, a Movietone newsreel and a cartoon. The feature presentations are two critically acclaimed dramas of the Royal Navy’s war at sea, “In Which We Serve” and “We Dive at Dawn.” The intermission short subject is the USAAF recruiting film “Winning Your Wings.” ",
      "fileSize": 3514152501,
      "addedAt": "2026-01-07T00:06:58.270Z",
      "thumbnail": "https://archive.org/services/img/THEBIJOUGOESTOWARspecialDoubleFeature",
      "collection": "feature_films",
      "downloads": 12155
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "115 min",
    "imdbRating": 7.2,
    "imdbVotes": 6880,
    "Genre": "Drama, War",
    "Plot": "This is the story of a British Naval ship, H.M.S. Torrin, from its construction to its sinking in the Mediterranean during action in World War II. The ship's first and only commanding officer is the experienced Captain E.V. Kinross, who trains his men not only to be loyal to him, but to the country, and most importantly, to themselves. They face challenges at sea, and also at home. They lose some of their shipmates in action, and some of their loved ones in the devastation that is the blitz. Throughout it all, the men of the Torrin serve valiantly and heroically.",
    "Director": "Noël Coward, David Lean",
    "Writer": "Noël Coward",
    "Actors": "Noël Coward, John Mills, Bernard Miles",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "Nominated for 2 Oscars. 9 wins & 3 nominations total"
  },
  "relatedMovies": [
    "tt0034512",
    "tt0036516",
    "tt0136209",
    "tt0159476",
    "tt0036093",
    "tt0035301",
    "tt0035494",
    "tt0034593",
    "tt0034647",
    "tt0034748",
    "tt0035033",
    "tt0035249"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "war",
      "name": "War"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:30:33.171Z"
}