{
  "movieId": "tt0051465",
  "title": "La caída",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-caida-1959",
      "id": "la-caida-1959",
      "title": "La Caida (1959)",
      "description": "La caída  es una  película   argentina  de 1959, dirigida por  Leopoldo Torre Nilsson  y protagonizada por  Elsa Daniel  y  Lautaro Murúa . Estrenada en Buenos Aires el 26 de febrero de 1959. Ganadora de 5  Cóndor de Plata  en 1960 incluyendo Mejor película y Mejor Director. La película es una adaptación de la novela de  Beatriz Guido . La infancia inocente pero diabólica de  El secuestrador  es la base de esta película, aunque se desarrolla en un contexto mucho más fantasmagórico y abstracto. \"Quizá después de verla podamos pensar en la incomunicación humana, en el tremendo desencuentro entre adultos y niños\", escribió Nilsson en 1959. \"Si algo de ello ocurre, si después de ver este film un solo hombre mira los ojos de un solo niño buscando algo más que esa ecuación simplificadora que hemos hecho de la infancia, la mitad de nuestro camino estará cumplida\". La repercusión local e internacional de sus películas previas permitió a Nilsson ser su propio productor en \"La caída\", aunque lo hizo dentro de la estructura de Argentina Sono Film. El siguiente paso sería alcanzar la independencia total. [ 1 ] ​ En una encuesta de 2022 de las  100 mejores películas del cine argentino , la película alcanzó el puesto 38. [ 2 ] ​(Wikipedia) Sinopsis La historia comienza con la llegada de Albertina, una joven de provincias de buena familia, que se dirige a estudiar Letras en Buenos Aires. Su presupuesto es limitado y a través de un anuncio alquila una habitación en una enorme casa donde habita una mujer enferma con cuatro hijos. Albertina no sabe qué le impresiona más, si la indiferencia de la madre hacia sus hijos o el comportamiento de esos niños, precoces, indisciplinados, que por momentos actúan como personas mayores y a continuación muestran actitudes infantiles. La obsesión de esos niños que sobreviven por sí mismos es la figura de un tío ausente, “viaja mucho”, que cuando raramente les visita, les lleva a restaurantes, les compra regalos y les deleita con historias de viajes y aventuras. Albertina conoce a un joven abogado de la  burguesía  con el que empieza a salir y muy pronto comenzara a conocer oscuros secretos de la familia y comprenderá extraños sucesos que estaban sucediendo. Produccion La película fue rodada en la ciudad de Buenos Aires y tardo un mes en terminar de producirla. La historia es autobiográfica, salvo que la acción tuvo lugar en la  Italia  de posguerra. Beatriz Guido estuvo en Roma haciendo un curso y la pensión en la que se hospedó está retratada en el film. No hay duda de que esa experiencia la debió marcar. El enorme caserón, la atmósfera opresiva, el desamparo que sufren los niños que ellos disimulan con descaro y malicia, envuelven a la joven que no puede desentenderse del drama que se desarrolla ante sus ojos. [ 3 ] ​ Actores Elsa Daniel  como Albertina. Lautaro Murúa  como el tío Lucas. Duilio Marzio  como José María. Lydia Lamaison  como Marta. Hebe Marbec  como Laura. Carlos López Monet  como Gustavo. Oscar Orlegui  como Diego. Pinky  como Delfina. Emma Bernal  como la tía. Nora Singerman Mónica Grey Osvaldo Robledo Santángelo Mónica Linares Miguel Caiazzo Roberto Bordoni Enrique Kossi Ángel Díaz María Delfino Susana Latou Reparto",
      "fileSize": 1803491746,
      "addedAt": "2026-01-07T00:09:24.701Z",
      "thumbnail": "https://archive.org/services/img/la-caida-1959",
      "language": "spa",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 150
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "84 min",
    "imdbRating": 7,
    "imdbVotes": 122,
    "Genre": "Drama",
    "Plot": "Albertina, a pretty but wet university student, is hired by a bedridden widow to take care of her and her four children. Helping out around the house she soon discovers the kids live a life of their own, independent of their mother, who neglects them. The atmosphere of the place is both fascinating and unhealthy and Albertina gradually finds herself stuck in it so that although a young lawyer falls for her, she won't follow him out of the house...",
    "Director": "Leopoldo Torre Nilsson",
    "Writer": "Beatriz Guido, Leopoldo Torre Nilsson",
    "Actors": "Elsa Daniel, Duilio Marzio, Lautaro Murúa",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "5 wins & 1 nomination"
  },
  "relatedMovies": [
    "tt0049273",
    "tt0052174",
    "tt0051580",
    "tt0047586",
    "tt0062388",
    "tt0201867",
    "tt0056076",
    "tt0071238",
    "tt0179121",
    "tt0072878",
    "tt0073542",
    "tt0179248"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.701Z"
}