{
  "imdbId": "tt0035031",
  "title": "Man with Two Lives",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Man_with_Two_Lives_1942",
      "title": "Man with Two Lives",
      "description": "Fortunately, a scientist is able to restore life to the body of a man who died in an automobile crash. Unfortunately, he does so when the soul of a criminal just executed is looking for a home.",
      "fileSize": 1497711818,
      "id": "Man_with_Two_Lives_1942"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ManwithTwoLives",
      "title": "Man with Two Lives",
      "description": "A man is brought back from death at the same time a vicious criminal dies in the electric chair. However, the man's soul is now taken over by the electrocuted gangster, who embarks on a vengeful crime wave.",
      "fileSize": 1679094468,
      "id": "ManwithTwoLives"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/man-with-two-lives-1942",
      "title": "Man with Two Lives (1942)",
      "description": "A man is brought back from death at the same time a vicious criminal dies in the electric chair. However, the man's soul is now taken over by the electrocuted gangster, who embarks on a vengeful crime wave. Watch on RetroFlix:  https://retroflix.org/man-with-two-lives-1942/",
      "fileSize": 160047687,
      "id": "man-with-two-lives-1942"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fmPgmTp4gK4",
      "title": "Man with Two Lives (1942) [Horror] [Science Fiction] [Thriller]",
      "description": "The story is of a man who is brought back from the dead and whose body is hijacked by the soul of an executed gangster, consequently making the deceased man a high proze criminal. At the beginning of the story the happy couple Phillip Bennett and Louise Hammond are engaged to be married. A major bump on their planned road to the future emerges when sadly Phillip is killed in a traffic accident as they are driving back from their very engagement party. The dubious Dr. Clarke, who apparently is known for being able to revive deceased animals, is called on for the purpose of bringing Phillip back to life. By midnight on that very same night as Phillips demise, the infamous criminal Panino, is to receive his capital punishment for his crimes: execution through electrocution. Just minutes before midnight Dr. Clarke performs his resuscitaion operation and it is a successful one, but when Panino dies moments later his ominous soul enters and claims Phillip's body. The soul change goes unnoticed however, and Phillip's body is brought home to his hopeful wife to be. At first it appears Phillip suffers from severe amnesia, and he is uncapable of recognizing any of the persons previously known to him, which is of course an unpleasant surprise.\n\nPhillip instantly starts roaming Panino's old hoods, and it doesn't take long before he once again is supreme commander of his old gang, running the business as usual, but in the shape of Phillip. The people around Phillip, including his father Hobart Bennet is worried by the development and this new personality of Phillip's. They become even more worried when they start noticing that he is more and more absent from his home. Soon a crime wave hits the city and there is an outbreak of gang wars, throwing the city into chaos as gang member are killed on every side. Accompanied by Dr. Clarke, Phillip's father Hobart visit the gang's headquarters and meets with the gangsters, to tell them who Panino/Phillip really is. They inquires the gang members about Phillip's relation to the gang and its business, and the gang members find out that Phillip, a respectable citizen, is the son of Hobart Bennet. Phillip/Panino finds out about this and feels threatened by the fact that some of the gang members know about his \"secret identity\". He murders all of the potentially dangerous gang members, but fails to do off with one person, a brother to one of the murdered gang members, who knows his secret.\n\nThis remaining man becomes the key to catching Panino/Phillip and stop him from going through with his planned robbery. He tips the police of Panino/Phillip's plans and a trap is laid out to catch the felon, but he escapes and decides to take revenge on the detective in charge of hunting him down. He ends up killing the detective, but is in turn killed himself by Dr. Clarke.\n\n---\n\nDirected by Phil Rosen, produced by A.W. Hackel, written by Joseph Hoffman, starring Edward Norris as Philip Bennett, Marlo Dwyer as Helen Lengel, Eleanor Lawson as Louise Hammond, Frederick Burton as Hobart Bennett, Addison Richards as Lt. Detective George Bradley, Edward Keane as Dr. Richard Clark, Hugh Sothern as Prof. Toller, Tom Seidel as Reginald \"Reg\" Bennett, Elliott Sullivan as Eric, Anthony Warde as Hugo, Ernie Adams as Gimpy, Kenne Duncan as Jess Fowler, George Dobbs as Tim Martin, Lois Landon as Aunt Margaret, Frances Richards as Nurse, Jack Buckley as Mitch Larsen, Jack Ingram as Ed. Sporady and George Kirby as The Bennett Butler. \n\n---\n\nSource: \"Man with Two Lives\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 4 April 2013. Web. 20 April 2013. http://en.wikipedia.org/wiki/Man_with_Two_Lives.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "fmPgmTp4gK4",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_bgjciqVezM",
      "title": "Man with Two Lives (1942) HORROR",
      "description": "Stars: Edward Norris, Marlo Dwyer, Eleanor Lawson\n Director: Phil Rosen\n\n A man is brought back from death at the same time a vicious criminal dies in the electric chair. However, the man's soul is now taken over by the electrocuted gangster, who embarks on a vengeful crime wave.",
      "id": "_bgjciqVezM",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=i9WrldoX1tQ",
      "title": "Man with Two Lives (1942) Horror, Thriller Full Length Movie",
      "description": "His Secret Means DEATH!\nA man is brought back from death at the same time a vicious criminal dies in the electric chair. However, the man's soul is now taken over by the electrocuted gangster, who embarks on a vengeful crime wave.\n\nDirector: Phil Rosen\nWriter: Joseph Hoffman\nStars: Edward Norris, Marlo Dwyer, Eleanor Lawson \nGenres: Classics, Horror, Thriller\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "i9WrldoX1tQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "65 min",
    "imdbRating": 5.1,
    "imdbVotes": 353,
    "Genre": "Horror, Thriller",
    "Plot": "Phillip Bennett and Louise Hammond, engaged to be married, are returning from her home after the engagement party, and Phillip is apparently killed in an automobile accident. Dr. Clarke is called and asked to bring Phillip back to life as he has been able to do so on animals. Panino, a vicious criminal, is to be electrocuted that same night at midnight. Dr. Clarke performs his operation a few minutes before this, and as Panino dies his soul enters Phillip's body, and he lives. Phillip is brought home but seems to have amnesia, as he does not recognize any one. He goes instinctively for Panino's haunts, and gradually assumes leadership of the gang and its business. Hobart Bennet, Phillip's father, becomes worried because of his newly-developed attitude and continued absence from home. A crime wave and gang-war breaks out in the city, with many killings. Mr. Bennett and Dr. Clarke go to the gang's hideout, and both are recognized by other gangsters. They question the men regarding Phillip's connection with the gangsters, and tell them that Phillip is Bennett's son. Phillip/Panino learns of this and murders the members of the gang who have found out his identity, but doesn't know that a brother of one of the slain men also knows the secret. The brother tips the police about a robbery Phillip has planned but he escapes the trap and returns home. He kills a detective that has followed him, but is in turn killed by Dr. Clarke.",
    "Director": "Phil Rosen",
    "Writer": "Joseph Hoffman",
    "Actors": "Edward Norris, Marlo Dwyer, Eleanor Lawson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0034224",
      "title": "Spooks Run Wild",
      "year": 1941,
      "imdbRating": 5.3,
      "imdbVotes": 1961,
      "language": "English, French",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0034521",
      "title": "Black Dragons",
      "year": 1942,
      "imdbRating": 4.3,
      "imdbVotes": 1324,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034985",
      "title": "The Living Ghost",
      "year": 1942,
      "imdbRating": 5.3,
      "imdbVotes": 695,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0197651",
      "title": "Una luz en la ventana",
      "year": 1942,
      "imdbRating": 6.1,
      "imdbVotes": 57,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036307",
      "title": "Revenge of the Zombies",
      "year": 1943,
      "imdbRating": 4.7,
      "imdbVotes": 849,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036104",
      "title": "The Leopard Man",
      "year": 1943,
      "imdbRating": 6.7,
      "imdbVotes": 6122,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036349",
      "title": "Sherlock Holmes in Washington",
      "year": 1943,
      "imdbRating": 6.7,
      "imdbVotes": 5077,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036125",
      "title": "The Mad Ghoul",
      "year": 1943,
      "imdbRating": 5.8,
      "imdbVotes": 972,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037303",
      "title": "The Spider Woman",
      "year": 1943,
      "imdbRating": 7,
      "imdbVotes": 5282,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036653",
      "title": "Bluebeard",
      "year": 1944,
      "imdbRating": 5.9,
      "imdbVotes": 2188,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036999",
      "title": "The Lady and the Monster",
      "year": 1944,
      "imdbRating": 5.6,
      "imdbVotes": 420,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027398",
      "title": "The Bridge of Sighs",
      "year": 1936,
      "imdbRating": 5.1,
      "imdbVotes": 77,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.426Z"
}