{
  "movieId": "tt0014538",
  "title": "Three Ages",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Silent_ThreeAges_1923",
      "id": "Silent_ThreeAges_1923",
      "title": "Three Ages",
      "description": "This gut busting comedy, starring Buster Keaton, charmingly explores love in the three ages of life - the prehistoric age, the roman age, and the modern age. Throughout the years, where love is concerned, does anything really change? You can read more about this film on its IMDb page . Enjoy!",
      "fileSize": 1036822982,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/Silent_ThreeAges_1923",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 68375
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/buster-keaton-in-three-ages-1923-qyzb-kb-exja-e",
      "id": "buster-keaton-in-three-ages-1923-qyzb-kb-exja-e",
      "title": "Three Ages (1923) HD with Score",
      "description": "A parody of D.W. Griffith s Intolerance, dramatizing man s quest for love in three parallel settings a modern city, the Stone Age, and ancient Rome.",
      "fileSize": 1745855001,
      "addedAt": "2026-01-07T00:07:45.165Z",
      "thumbnail": "https://archive.org/services/img/buster-keaton-in-three-ages-1923-qyzb-kb-exja-e",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 2977
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-three-ages",
      "id": "silent-three-ages",
      "title": "Three Ages",
      "fileSize": 1228249146,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-three-ages",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 360
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/yorkmba99_hotmail_TA",
      "id": "yorkmba99_hotmail_TA",
      "title": "\"Three Ages\" (1923) starring Buster Keaton and Joe Roberts",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"Three Ages\" is a sparkling comedy, included in our program to celebrate the work and contributions of Joe Roberts, a star of Silent Hall of Fame. \"Three Ages\" is Buster Keaton's first feature film. Before that he created 19 amazing short comedies and Joe Roberts was his partner in 16 of them. \"Three Ages\" tries to prove the point that love has not changed throughout human history, on the example of the stone age, the Roman civilization and modern times. Directed by               Edward F. Cline, Buster Keaton Produced by             Buster Keaton Productions Scenario by               Jean Havez, Clyde Bruckman and Joseph Mitchell          Starring                     Buster Keaton, Joe Roberts, Margaret Leahy, Wallace Beery, Lillian Lawrence Cinematography        Elgin Lessley, William C. McGann Distributed by           Metro Pictures Corporation Release date               September 24, 1923 Running time             64 minutes Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 1772010235,
      "addedAt": "2026-01-07T00:13:17.038Z",
      "thumbnail": "https://archive.org/services/img/yorkmba99_hotmail_TA",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 12856
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uAJG3Jep-AQ",
      "id": "uAJG3Jep-AQ",
      "title": "Three Ages (1923) | Colorized Public Domain Silent Comedy Classic by Buster Keaton",
      "description": "Three Ages (1923) is an American silent comedy film written, directed, and produced by Buster Keaton in collaboration with Edward F. Cline. Not only does this film mark Keaton’s first feature-length directorial effort, but it also stands as a masterclass in comedic structure and cinematic parody. This restored and colorized edition revives one of Keaton’s most important works, making it more accessible for modern audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe film cleverly tells three parallel love stories set in different historical periods: the Stone Age, Ancient Rome, and the Modern Age (1920s America). In each story, Keaton plays a hopeful young man competing for the affection of a woman, only to find himself pitted against a stronger, wealthier rival.\n\nStone Age: Keaton is a bumbling caveman trying to win the heart of a cavewoman (Margaret Leahy) while competing with a brutish rival (Wallace Beery).\n\nAncient Rome: Keaton plays a Roman citizen in pursuit of the same woman, facing challenges from gladiatorial contests and public spectacle.\n\nModern Age: In a 1920s setting, Keaton plays a poor suitor vying for love in a world dominated by money, cars, and social status.\n\nThe three stories unfold simultaneously, intercut with one another, and each concludes with a resolution of the rivalry. True to Keaton’s style, the film is filled with elaborate physical comedy, inventive stunts, and visual gags that highlight his genius for timing and subtle expression.\n\nCast and Crew:\n• Directors: Buster Keaton, Edward F. Cline\n• Writers: Buster Keaton, Edward F. Cline\n• Producer: Joseph M. Schenck\n• Cinematography: Elgin Lessley, George Stevens\n• Editing: Buster Keaton\n\nStarring:\n• Buster Keaton as The Lover (in all three ages)\n• Margaret Leahy as The Girl\n• Wallace Beery as The Rival\n• Joe Roberts as Supporting Role\n• Lillian Lawrence as The Girl’s Mother\n\nFilm Significance:\nThree Ages is often described as Buster Keaton’s parody of D.W. Griffith’s Intolerance (1916), which similarly used multiple historical settings to tell interconnected stories. Unlike Griffith’s heavy-handed moralizing, Keaton transforms the technique into a vehicle for comedy, satire, and romance.\n\nThis film is historically important as it launched Keaton into feature-length filmmaking after his successful run of short comedies. It also introduced audiences to his method of blending elaborate stunts with understated humor, a contrast to the broader slapstick of contemporaries like Harold Lloyd or Charlie Chaplin. Wallace Beery’s performance as the recurring rival adds depth and menace to Keaton’s struggles, while Margaret Leahy provides the romantic center of each story.\n\nAs one of Keaton’s earliest full-length works, Three Ages provides a fascinating look at both his comedic style and the evolution of silent-era storytelling. Its themes of rivalry, love, and perseverance remain timeless, making it a culturally and historically significant piece of cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Three Ages remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1923 release was filmed in black and white, characteristic of silent cinema. While authentic to its time, modern viewers often overlook black-and-white films. By offering a colorized edition, we honor the legacy of Buster Keaton while adapting the film for contemporary viewing habits. This edition makes Three Ages more visually engaging for audiences in the United States, Europe, and beyond, ensuring that Keaton’s pioneering comedy can continue to entertain and inspire.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema — comedies, dramas, thrillers, westerns, and more. Our goal is to keep forgotten treasures alive for audiences worldwide.\n\n#ThreeAges #BusterKeaton #SilentComedy #1920sFilm #PublicDomainMovie #ColorizedClassic #WallaceBeery #ClassicHollywood #SilentEraCinema #FilmRestoration",
      "addedAt": "2025-12-27T00:56:52.461Z",
      "thumbnail": "https://i.ytimg.com/vi/uAJG3Jep-AQ/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGEggWShlMA8=&rs=AOn4CLD0PFpboZwzPU3p1-5n107OTKlcgw",
      "duration": 3763,
      "language": "en",
      "year": 1923,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "63 min",
    "imdbRating": 7,
    "imdbVotes": 5356,
    "Genre": "Comedy",
    "Plot": "In his first independently produced feature film Buster tells of love and romance through three historical ages: the Stone Age, the Roman Age, and the Modern Age.",
    "Director": "Edward F. Cline, Buster Keaton",
    "Writer": "Clyde Bruckman, Joseph A. Mitchell, Jean C. Havez",
    "Actors": "Buster Keaton, Margaret Leahy, Wallace Beery",
    "Language": "None",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0013422",
    "tt0013858",
    "tt0013025",
    "tt0012543",
    "tt0013055",
    "tt0013099",
    "tt0013158",
    "tt0012253",
    "tt0012570",
    "tt0011984",
    "tt0012255",
    "tt0012278"
  ],
  "collections": [
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:17.038Z"
}