{
  "movieId": "tt0029168",
  "title": "Love Takes Flight",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6NOj9PWXH9A",
      "id": "6NOj9PWXH9A",
      "title": "Love Takes Flight (1937) Adventure, Drama, Romance | Full Length Movie",
      "description": "SHE flirted with Danger for Love! HE took a Nose Dive for Fame! On a transcontinental flight from New York City to Los Angeles, Joan Lawson, the flight hostess, attracts the attention of a move producer, Dave Miller, and he tries to persuade her to sign a movie contract. She declines, as she is in love with the pilot, Neil Bradshaw, and desires to learn to fly under his tuition.\n \nDirector: Conrad Nagel\nWriters: Lionel Houser, Mervin J. Houser \nStars: Bruce Cabot, Beatrice Roberts, John Sheehan\nGenres: Adventure, Drama, Romance\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:44:40.418Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/6NOj9PWXH9A/maxresdefault.webp?v=63be8296",
      "duration": 4177,
      "language": "en",
      "year": 1937,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 6.1,
    "imdbVotes": 70,
    "Genre": "Adventure, Drama, Romance",
    "Plot": "On a transcontinental flight from New York City to Los Angeles, Joan Lawson, the flight hostess, attracts the attention of a move producer, Dave Miller, and he tries to persuade her to sign a movie contract. She declines, as she is in love with the pilot, Neil Bradshaw, and desires to learn to fly under his tuition. The airplane, because of unfavorable flying conditions, is grounded in L.A, but a passenger, movie star Diane Andre, insists that Neil start for New York, despite the weather. \"Spud\" Johnson, publicity director for the airline, sees publicity and exploitation possibilities and orders Neil to take up the airplane. Later, the plane is reported lost and the newspapers publish stories of the lost plane, the lost actress and the lost pilot. Then they are found on a mountain, having been forced down by the storm. While there, Diane offers to make Neil the leading man in her new film and he, forgetting his goal of flying solo around the world, accepts. Meanwhile, Joan, decides she will take some more flying lessons and do what he intended to do.",
    "Director": "Conrad Nagel",
    "Writer": "Lionel Houser, Mervin J. Houser, Anne Morrison Chapin",
    "Actors": "Bruce Cabot, Beatrice Roberts, John Sheehan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030005",
    "tt0030274",
    "tt0028396",
    "tt0030541",
    "tt0033216",
    "tt0026083",
    "tt0031082",
    "tt0028634",
    "tt0029376",
    "tt0033297",
    "tt0032392",
    "tt0033159"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:50:53.355Z"
}