{
  "movieId": "tt0068370",
  "title": "Children Shouldn't Play with Dead Things",
  "year": 1972,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ChildrenShouldntPlayWithDeadThings_201501",
      "id": "ChildrenShouldntPlayWithDeadThings_201501",
      "title": "Children Shouldn't Play With Dead Things",
      "description": "Children Shouldn't Play with Dead Things (also known as Revenge of the Living Dead , Things From the Dead , and Zreaks ) is a 1972 comedic horror film directed by Bob Clark. It later became a cult classic. This low-budget zombie film is the third film of director Bob Clark, who later became famous for directing the films Black Christmas , A Christmas Story , and Porky's . The story focuses on a theatre troupe, led by Alan. He is a mean-spirited director, who travels with the others by boat to a small island for buried criminals to have a night of fun and games. Once on the island Alan tells his group—he calls them his \"children\"—numerous stories relating to the island's history and buried inhabitants. At midnight using a grimoire, Alan begins a séance to raise the dead after digging up the body of a man named Orville Dunworth. Though the original intent of the ritual may have been solely as a joke, Alan appears disappointed that nothing happens. Afterwards the party continues and Alan goes to extremes to degrade the actors, using the corpse of Orville for his own sick jokes. Then, however, animated by the fell ritual, the dead return to life and force the troupe to take refuge in the old house…   (condensed from Wikipedia) Star Alan Ormsby also wrote this script and created the make-up effects. He wrote and co-directed “Deranged,” and wrote “Deathdream.”   Later, he wrote the screenplays for “My Bodyguard,” “The Little Dagons,” “Cat People” and “Porky’s II.” “Children Shouldn’t Play with Dead Things”” is available from The RetroFilm Vault, “the original and definitive one-stop source for public domain movies and television for broadcast programing or stock footage use. From the heart of movie land, The RetroFilm Vault has the largest virtual catalog for broadcast quality public domain films on the planet.” Also listed as PD here: http://www.moviesmademe.com/lists/37 http://spookyfests.com/html/pdlist.htm https://actv20.wordpress.com/2009/06/05/saturday-fright-special/ http://www.x-human.net/trades.shtml  ",
      "fileSize": 1620137242,
      "addedAt": "2026-01-07T00:06:19.366Z",
      "thumbnail": "https://archive.org/services/img/ChildrenShouldntPlayWithDeadThings_201501",
      "collection": "feature_films",
      "downloads": 26713
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "87 min",
    "imdbRating": 5.3,
    "imdbVotes": 5302,
    "Genre": "Comedy, Horror",
    "Plot": "An acting troupe led by Alan Ormsby go to a graveyard on a remote island to perform a necromantic ritual. The ritual works too well and soon the dead are walking about and chowing down on human flesh. The dwindling group of survivors struggle to escape.",
    "Director": "Bob Clark",
    "Writer": "Bob Clark, Alan Ormsby",
    "Actors": "Alan Ormsby, Valerie Mamches, Jeff Gillen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0066871",
    "tt0070908",
    "tt0066740",
    "tt0065762",
    "tt0270882",
    "tt0062957",
    "tt0044925",
    "tt0067818",
    "tt0071085",
    "tt0052655",
    "tt0043255",
    "tt0044406"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.366Z"
}