{
  "movieId": "tt0027845",
  "title": "Kind Lady",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kind-lady-1935",
      "id": "kind-lady-1935",
      "title": "Kind Lady (1935)",
      "description": "Basil Rathbone",
      "fileSize": 1861093256,
      "addedAt": "2026-01-07T00:09:24.700Z",
      "thumbnail": "https://archive.org/services/img/kind-lady-1935",
      "collection": "feature_films",
      "downloads": 1716
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "76 min",
    "imdbRating": 6.9,
    "imdbVotes": 654,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "Mary Herries is a rich woman with a habit of contributing to those less fortunate than her. On her way home from a concert on Christmas Eve she discovers a poor, would-be artist outside her estate. Mary takes pity on this artist, Henry Abbott, and gives him some food and money. After taking him in, she finds herself somewhat attracted to this artist; he is handsome, and quite knowledgeable of fine art, especially the paintings in Mary's extensive collection. However, when she discovers that Henry has both a wife and a small child that he is struggling to support, she gives him some money and hand-me downs, and sends him on his way. A few days later he shows up with some of his own paintings (which are absolutely awful) as well as some items he stole from Mary's house on Christmas Eve. Henry demands a large amount of money for his paintings, which Mary eventually pays. She then discovers that Henry has left his wife and baby outside, in the rain. His wife collapses and Mary, out of pity, lets Henry and his family stay with her until his wife is well. Soon, Mary's servants have all quit, tired of dealing with Henry and his family, who are unreasonable and greedy. Once the servants are gone, Henry's extended family arrives, and Mary discovers to her horror that Henry's \"family\" is actually a gang of art thieves, planning to imprison her in her own house to gain control of her art collection.",
    "Director": "George B. Seitz",
    "Writer": "Bernard Schubert, Edward Chodorov, Hugh Walpole",
    "Actors": "Aline MacMahon, Basil Rathbone, Mary Carlisle",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026731",
    "tt0027028",
    "tt0022826",
    "tt0028231",
    "tt0027003",
    "tt0024782",
    "tt0028511",
    "tt0024904",
    "tt0025452",
    "tt0027839",
    "tt0021820",
    "tt0022206"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.700Z"
}