{
  "imdbId": "tt0011263",
  "title": "Haunted Spooks",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/haunted-spooks-1920",
      "title": "Haunted Spooks (1920) Directed by Hal Roach, Alfred J. Goulding",
      "description": "Haunted Spooks Promotional advertisement Directed by Alfred J. Goulding Hal Roach Written by H. M. Walker Produced by Hal Roach Starring Harold Lloyd Mildred Davis Wallace Howe Ernest Morrison Blue Washington Release date March 14, 1920 Running time 25 minutes Country United States Language Silent (English intertitles ) Haunted Spooks is a 1920 American silent Southern Gothic comedy horror film , produced and co-directed by Hal Roach , [ 1 ] starring Harold Lloyd and Mildred Davis . The short film has a comedic version of a typical haunted house tale, and a dispute over a family's inheritance. A young woman is the heiress to a mansion and a plantation , but only if she is married. She quickly enters an arranged marriage with a stranger, and they travel to the mansion. Her uncle fakes ghostly apparitions, in order to scare them away and lay claim to the inheritance. At the end of the film, the husband and wife remember to enquire about their respective names. Plot The action in Haunted Spooks centres around Harold's romantic problems. It is set in the South (\"[go] down the Mississippi and turn to the right\"). The opening sequence has an uncle reading a telegram regarding a will. It tells him that his niece Mildred will inherit the house and plantation, provided she lives there for a year with her husband. He tells his wife that they must scare them out of the house. A lawyer visits the niece to tell her of the will. She tells him she is not married and he says he can resolve the problem. We then jump to Harold who is disappointed in love and vying for the attention of the Other Girl in rivalry with her other potential suitor. They compete to be first to ask her father for her hand in marriage. Harold wins but when he returns to the girl she is in the arms of yet a third man, so he gives up. He then tries, with notable lack of success, to commit suicide . Firstly using a gun he finds on a path, which turns out to be a water-pistol; then standing in front of a tram, which takes a sudden turn; then he ties a rock around his neck and jumps off a low bridge into a lake, but this fails as it is only inches deep; he then picks a second bridge, but lands in a boat; and finally stands in front of a car, which stops in time, but contains the lawyer from the earlier scene. He takes Harold to Mildred and arranges their marriage. They then drive off to the mansion, with some jokes en route: the gesticulating passengers in the car in front appear to be signalling right then left, preventing overtaking; the birds in the back seat pecking his head. They reach the mansion and the uncle plays a series of tricks to make the house appear haunted. A series of people appear in white sheets and covered in flour until the prank is uncovered. In a more unusual prank, a pair of trousers walk on their own, having a little black boy inside. We see Harold's hair stand on end then fall. The film ends with the couple inquiring about each other's name and entering the bedroom together. Cast Harold Lloyd as The Boy [ 2 ] Mildred Davis as Mildred Hillary, The Girl Wallace Howe as The Uncle Sammy Brooks as Short Butler (uncredited) Gaylord Lloyd (uncredited) Sam Lufkin as Man arguing in car (uncredited) Ernest Morrison as Little Boy (uncredited) Dee Lampton as Tall Butler (uncredited) Charles Stevenson as Winning Suitor (uncredited) Blue Washington as Negro Butler (uncredited) Noah Young as Chef (uncredited) [ 3 ] Production The film began shooting on August 9, 1919 and halted on the 23rd of that month due to an accident. Lloyd was posing for publicity photos, and a prop bomb exploded in his hand. He lost two fingers, his face was badly burned and he was temporarily blinded. In subsequent films, he wore a prosthetic glove fitted with artificial fingers. After four months of recovering the film resumed on January 5, 1920 and continued through the 25th. There was very little public knowledge about the loss of Lloyd's fingers, but people knew of the accident. Lloyd wanted it that way because he did not want people to watch his films for sympathy or curiosity, but to watch his films \"because they were good, laughable, and delightful comedies\". [ 4 ] Lloyd's salary doubled after his return to this film. After this movie, he moved away from slapstick and went towards more intellectual and romantic comedies. [ 1 ] Three years after this film was made, Harold Lloyd married his co-star Mildred Davis, whose brother Jack was a member of Hal Roach 's Our Gang comedies. They remained married until her death in 1969. [ 5 ] Haunted Spooks was filmed on location at Hancock Park and what is now MacArthur Park . The scenes at the haunted mansion were filmed at Hal Roach Studios , in Culver City , California . The film had a lot of racist humor in it, revolving mainly around the frightened black servants in the house showing then-stereotypical behavior such as shaking knees and wide eyes. One of the servants was even played by a white actor in blackface . \"One can even conclude that the film's title is a racist slur\" according to critic Christopher Workman. [ 1 ] References 1 Workman, Christopher; Howarth, Troy (2016). Tome of Terror: Horror Films of the Silent Era . Midnight Marquee Press. p. 221. ISBN   978-1936168-68-2 . 2 \"Girl Shy\" . San Francisco Silent Film Festival . Retrieved July 12, 2017 . 3 \"Haunted Spooks (1920)\" . IMDb . Retrieved July 12, 2017 . 4 \"Harold Clayton Lloyd (1893-1971)\" . haroldlloyd.com . Archived from the original on July 1, 2017 . Retrieved July 12, 2017 . 5 Workman, Christopher; Howarth, Troy (2016). Tome of Terror: Horror Films of the Silent Era . Midnight Marquee Press. p. 222. ISBN   978-1936168-68-2 .",
      "id": "haunted-spooks-1920"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-haunted-spooks",
      "title": "Haunted Spooks",
      "id": "silent-haunted-spooks"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "25 min",
    "imdbRating": "6.6",
    "imdbVotes": "1,455",
    "Genre": "Short, Comedy, Horror",
    "Plot": "After numerous failed attempts to commit suicide, our hero (Lloyd) runs into a lawyer who is looking for a stooge to stand in as a groom in order to secure an inheritance for his client (Davis). The inheritance is a house, which her scheming uncle \"haunts\" so that he can scare them off and claim the property.",
    "Director": "Alfred J. Goulding, Hal Roach",
    "Writer": "H.M. Walker",
    "Actors": "Harold Lloyd, Mildred Davis, Wally Howe",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0010146",
      "title": "From Hand to Mouth",
      "year": 1919,
      "imdbRating": "6.9",
      "imdbVotes": "1,180",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011521",
      "title": "Number, Please?",
      "year": 1920,
      "imdbRating": "6.9",
      "imdbVotes": "1,263",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011293",
      "title": "High and Dizzy",
      "year": 1920,
      "imdbRating": "6.8",
      "imdbVotes": "1,494",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010258",
      "title": "His Royal Slyness",
      "year": 1920,
      "imdbRating": "6.2",
      "imdbVotes": "819",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011144",
      "title": "An Eastern Westerner",
      "year": 1920,
      "imdbRating": "6.8",
      "imdbVotes": "1,759",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011223",
      "title": "Get Out and Get Under",
      "year": 1920,
      "imdbRating": "6.6",
      "imdbVotes": "1,071",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012499",
      "title": "Never Weaken",
      "year": 1921,
      "imdbRating": "7.5",
      "imdbVotes": "2,147",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012255",
      "title": "The Haunted House",
      "year": 1921,
      "imdbRating": "6.9",
      "imdbVotes": "3,791",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011922",
      "title": "Among Those Present",
      "year": 1921,
      "imdbRating": "6.6",
      "imdbVotes": "831",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012303",
      "title": "I Do",
      "year": 1921,
      "imdbRating": "6.2",
      "imdbVotes": "833",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012512",
      "title": "Now or Never",
      "year": 1921,
      "imdbRating": "6.7",
      "imdbVotes": "899",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010311",
      "title": "A Jazzed Honeymoon",
      "year": 1919,
      "imdbRating": "5.8",
      "imdbVotes": "122",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}