{
  "movieId": "tt0030090",
  "title": "The Duke of West Point",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheDukeOfWestPoint",
      "id": "TheDukeOfWestPoint",
      "title": "The Duke of West Point",
      "description": "Title: The Duke of West Point Summary: An arrogant Cambridge student emigrates to America and enrolls at the West Point. Directed by: Alfred E. Green Actors: Production Company: Edward Small Productions Release Date: 29 December 1938 (USA) Aspect Ratio: 1.37 : 1 An arrogant Cambridge student emigrates to America and enrolls at the West Point.",
      "fileSize": 939225918,
      "addedAt": "2026-01-07T00:06:58.274Z",
      "thumbnail": "https://archive.org/services/img/TheDukeOfWestPoint",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 1628
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "96 min",
    "imdbRating": 6.4,
    "imdbVotes": 185,
    "Genre": "Action, Drama, Romance",
    "Plot": "Steve Early (Louis Hayward), the son of an American Embassy Official in London, sails to America to enter West Point in line with family tradition. Although warned by his father that he , raised in England, will be entering a strange and new way of life. His first mistake is arriving at West Point with more pomp-and-circumstance than is fitting for an incoming plebe. Then, by befriending Sonny Drew (Tom Brown), another plebe who is unmercifully teased as a 'mother's boy, Steve further alienates the upperclassmen. Drew and a poor boy from the country, Jack West (Richard Carlson) become Steve's room-mates. As plebes, the three are bullied by Corporal Strong (Alan Curtis), according to academy customs,and Steve, on one of his many assigned hazing errands, stumble and falls at the feet of Strong and Ann Porter (Joan Fontaine). Making the most of his accident, , thereby antagonizing Strong still further. Later, Ste crashes an upperclassmen hop-forbidden to plebes- to see Ann. To do this he douses the lights of the pavilion, and escapes with Ann. With the experience he had gained on the Canbridge Varsity Rugby team, Steve stands out on the football field, to the astonishment of the football-playing cadets and the delight of \"Doc\" Porter, Ann's father and also the varsity football coach, who is looking forward to having him on the team next year, since plebes (first-year-cadets) aren't eligible to play on the varsity team. And Steve's actions and escapades and Honor Code violations and rule-breaking and disgrace regarding one thing or another that the cocky Steve doesn't think apply to him, indicate he'll soon be dismissed from West Point and never become a second-year cadet. Or will Steve find a way to show he has the \"right stuff \" to become a West Point graduate?",
    "Director": "Alfred E. Green",
    "Writer": "George Bruce",
    "Actors": "Louis Hayward, Joan Fontaine, Tom Brown",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028994",
    "tt0030911",
    "tt0028592",
    "tt0028634",
    "tt0029376",
    "tt0140551",
    "tt0030839",
    "tt0169357",
    "tt0027366",
    "tt0030023",
    "tt0029830",
    "tt0029701"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.274Z"
}