{
  "movieId": "tt0052932",
  "title": "Island of Lost Women",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/IslandOfLostWomen",
      "id": "IslandOfLostWomen",
      "title": "Island of Lost Women",
      "description": "A farfetched, south seas island, mad scientist adventure. The main attractions are three pretty girls, Venetia Stevenson, Dianne Jergens and June Blair. The mad scientist is Alan Napier, who some will fondly remember as Batman's butler, Alfred, in the '60s TV series. Directed by Frank W Tuttle. Released in 1959. Some missing frames Original release ran 71 minutes. CAST NOTE: Venetia Stevenson is best known for playing the ill-fated Nan Barlow in \"Horror Hotel\" (a.k.a. \"City of the Dead\") which is available here at IA. Venetia is the daughter of British actress Anna Lee, who is represented here at IA in \"Non-Stop New York,\" \"The Man Who Changed His Mind\" and \"King Solomon's Mines.\"",
      "fileSize": 909922707,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/IslandOfLostWomen",
      "collection": "feature_films",
      "downloads": 99177
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 5.1,
    "imdbVotes": 329,
    "Genre": "Adventure",
    "Plot": "While flying to an international news conference in Melbourne, radio commentator Mark Bradley and his pilot, Joe Walker, are forced to crash land on an uncharted island in the Pacific Ocean. They find this island is inhabited by Dr. Paul Lujan and his three beautiful daughters: Venus, Mercuria, and Urana. Lujan, a nuclear scientist, has fled here to escape from a world which is like \"a horrible great snowball rolling faster and faster toward extinction.\" He doesn't want his two visitors to leave, lest they reveal his whereabouts, so he destroys their plane. With help from the two older daughters, however, the men begin to construct a raft. (Mark and Venus have fallen in love as have Joe and Mercuria). A fire in Lujan's solar furnace now causes an explosion which nearly wrecks the island but which attracts the attention of a search plane. Mark, Joe, and the three young women look forward to being rescued; Lujan has doubts but is resigned.",
    "Director": "Frank Tuttle",
    "Writer": "Ray Buffum, Prescott Chaplin",
    "Actors": "Jeff Richards, Venetia Stevenson, John Smith",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020461",
    "tt0053103",
    "tt0052667",
    "tt0052604",
    "tt0052702",
    "tt0052782",
    "tt0167346",
    "tt0053944",
    "tt0052538",
    "tt0052394",
    "tt0052948",
    "tt0053126"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}