{
  "imdbId": "tt0045564",
  "title": "The Blue Gardenia",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1953-the-blue-gardenia-gardenia-azul-fritz-lang-vose",
      "id": "1953-the-blue-gardenia-gardenia-azul-fritz-lang-vose",
      "title": "1953 - The Blue Gardenia - Gardenia azul - Fritz Lang - VOSE",
      "description": "For Academic / Educational Use Only",
      "fileSize": 337801569,
      "addedAt": "2026-01-07T00:06:06.562Z",
      "thumbnail": "https://archive.org/services/img/1953-the-blue-gardenia-gardenia-azul-fritz-lang-vose",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 3301
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MoonIsBlue",
      "id": "MoonIsBlue",
      "title": "The Moon Is Blue",
      "description": "Title: The Moon Is Blue Summary: Two aging playboys are both after the same attractive young woman, but she fends them off by claiming that she plans to remain a virgin until her wedding night. Both men determine to find a way around her objections. Directed by: Otto Preminger Actors: William Holden, David Niven, Maggie McNamara Production Company: Otto Preminger Films Release Date: 8 July 1953 (USA) Aspect Ratio: 1.37 : 1 Successful architect Don Gresham (William Holden) engages a young actress, Patty O'Neill (Maggie McNamara), in conversation on top of the Empire State Building, and she accepts his invitation to dinner. Dropping in at his apartment on the way, they decide to dine there as Patty announces herself an excellent cook. Don slips out to buy food, and Patty is briefly visited by his ex-fiancée, Cynthia Slater (Dawn Addams), and not too briefly, by Cynthia's father David (David Niven), a middle-aged, practiced charmer who, on her invitation, stays to dinner. A slight accident at the table occasions Patty to change her dress for Don's bathrobe. While Don is away placating the jealous Cynthia, David loses no time in offering Patty a proposal of marriage and a six hundred dollar gift. She accepts the latter and is surprised by Don in a grateful kiss to David. Don is still enraged with Patty when her father arrives, and, outraged to discover his daughter in a bachelor's apartment, knocks him ...",
      "fileSize": 760221795,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/MoonIsBlue",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 17579
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thebluegardenia1953",
      "id": "thebluegardenia1953",
      "title": "The Blue Gardenia (1953) Dir: Fritz Lang, Featuring Anne Baxter, Richard Conte, Raymond Burr, Ann Sothern - Film Noir Full Movie",
      "description": "The Blue Gardenia is a 1953 film noir crime film directed by Fritz Lang and based on a novella by Vera Caspary, starring Anne Baxter, Richard Conte, Raymond Burr and Ann Sothern. The Blue Gardenia - a cynical take on press coverage of a sensational murder case - was the first installment of Lang's \"newspaper noir\" movie trio, being followed in 1956 by both While the City Sleeps and Beyond a Reasonable Doubt. The director of cinematography for The Blue Gardenia was Nicholas Musuraca. Wikipedia: https://en.wikipedia.org/wiki/The_Blue_Gardenia Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 279625189,
      "addedAt": "2026-01-07T00:12:44.280Z",
      "thumbnail": "https://archive.org/services/img/thebluegardenia1953",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 18120
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blue-gardenia-1953",
      "id": "blue-gardenia-1953",
      "title": "The Blue Gardenia 1953 colorized (Anne Baxter)",
      "description": "After being dumped by her fiancé, a telephone operator (Anne Baxter) ends up drunk and almost raped by a lecherous photgrapher (Raymond Burr), who is found dead the next morning. With no memory of exactly what happened, and afraid of being arrested for his murder, she accepts help from a journalist (Richard Conte) who offers his newspaper's support in exchange for an exclusive interview. Directed by Fritz Lang, based on a story by Vera Caspary. Anne Baxter as Norah Larkin Richard Conte as Casey Mayo Ann Sothern as Crystal Carpenter Raymond Burr as Harry Prebble Jeff Donnell as Sally Ellis Richard Erdman as Al George Reeves as Police Capt. Sam Haynes Ruth Storey as Rose Miller Fay Baker as Switchboard Monitor Nat 'King' Cole as himself I colorized this using AI software that doesn't always get the colors right, but I think it looks fairly natural. Hopefully a more professional job will be done someday.",
      "fileSize": 754667260,
      "addedAt": "2026-01-07T00:07:38.719Z",
      "thumbnail": "https://archive.org/services/img/blue-gardenia-1953",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 6614
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 6.8,
    "imdbVotes": 6423,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "In Los Angeles, on the day of her birthday, the telephone operator Norah Larkin decides to celebrate dining alone at home, with the picture of her beloved fiancé, a soldier overseas, and reading his last letter to her. In the letter, he tells her that he met an Army nurse stationed in Japan and plans to marry her. Norah, completely upset, accepts a blind date with the Don Juan and photographer of calendar girls, Harry Prebble. They go to the Blue Gardenia Club, and Norah drinks six strong cocktails, Polynesian Pearl Divers, and gets very, very drunk. Harry takes her to his apartment and tries to force Norah to have sex, and she grabs a fireplace poker to fend off Harry. On the next morning, she wakes up in her apartment with her two roommates, but she cannot remember what happened. When she reads the newspaper, she finds that Harry is dead and the police have her handkerchief, her high heels, and her blue gardenia, and they are trying to locate the woman who killed the famous wolf Harry. When she reads in the newspaper that the journalist Casey Mayo is offering his support, as well as his newspaper's, in exchange for an exclusive interview, Norah decides to call him.",
    "Director": "Fritz Lang",
    "Writer": "Charles Hoffman, Vera Caspary",
    "Actors": "Anne Baxter, Richard Conte, Ann Sothern",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0045555",
    "tt0042579",
    "tt0038057",
    "tt0037075",
    "tt0037469",
    "tt0047087",
    "tt0047101",
    "tt0044502",
    "tt0047878",
    "tt0043646",
    "tt0048421",
    "tt0047881"
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:07:57.808Z"
}