{
  "imdbId": "tt0007367",
  "title": "The Social Secretary",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-social-secretary",
      "title": "The Social Secretary",
      "id": "silent-the-social-secretary"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "52 min",
    "imdbRating": "5.8",
    "imdbVotes": "557",
    "Genre": "Comedy, Drama",
    "Plot": "Mayme is a beautiful young woman who is forced to earn her own living. Her beauty proves a serious handicap in that it attracts the attention of every man who is forced to come in contact with her, the result being that she is forced to resign from place to place in order to escape from their attentions. Finally, in desperation, she sees an advertisement for a social secretary and answers it. Before doing so she disguises her comeliness as much as possible. She is accepted for the position by the society matron who has inserted the advertisement. In the household there is a young son, who is a most estimable young man with but one fault, drink. There is also a daughter, a foolish young thing, who believes her cup of happiness would be filled to overflowing were she able to announce her marriage to a titled person. One night, the some coming home late after a spree, climbs into the window and comes unexpectedly on the social secretary, who, believing herself safe from prying eyes, is satisfying a natural feminine desire to make herself look as pretty as possible. The son is astounded, and attempts to embrace her. The young woman escapes however. The following morning the social secretary announces that she is going to resign, but the son, seeing her alone, begs her to remain, and promises that he will never offend again. She does so, and shortly afterwards meets a count who is paying court to the young daughter of the household. The secretary recognizes him as one of the men with whom she had an ugly experience in former years, but realizes that her word would not be taken at that time, as against the count's, who has completely won the girl. The secretary determines to thwart the count, however, and permits him to flirt with her again. He makes an appointment to meet her in the garden, and she keeps it, first making certain that they will be discovered by the family. They are, and the engagement is broken by the girl's mother. The count is persistent, however, and telephones the girl to meet him at his apartment. The secretary overhears the telephone conversation by \"listening in\" on another wire and determines to prevent the meeting, or at least to protect the girl. A reporter who has observed the meetings of the count, the girl and the secretary and the young son of the family, anxious to secure a story for his paper, takes to following the various members of the family, and in this manner trails the girl to the count's apartment. The secretary also having anonymously warned the girl's mother of the meeting, hurries off to the apartment and climbs the fire escape to effect an entrance unobserved. When the girl has been in the apartment but a few minutes, her mother and the reporter seek admittance. The girl, in a panic, is thrust in a rear room by the count. The secretary is on the fire escape outside this room, and when she is certain the girl is alone, opens the window and urges her to flee by means of the fire escape. The girl does so, and the secretary takes her place in the room, but as the enraged mother, her son, and the reporter rush into the room, the astonishment of the count is as real as that of the others in the room when he sees who is really there. The mother is naturally indignant that a person who would be found in so compromising a position would dare enter her home. The son is the soul of loyalty, however, and sticks to the girl whom he wants to marry, even in the face of the incriminating circumstances. When it seems certain that the girl must stand convicted of whatever people choose to think of her, the young daughter comes to her rescue and confesses that she was in the room, and that she had been able to escape only through the generosity of the social secretary. Vindicated, the social secretary rewards the young man for his loyalty by accepting his love and giving him her promise to be his wife.",
    "Director": "John Emerson",
    "Writer": "John Emerson, Anita Loos",
    "Actors": "Norma Talmadge, Kate Lester, Helen Weir",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0006809",
      "title": "His Picture in the Papers",
      "year": 1916,
      "imdbRating": "5.9",
      "imdbVotes": "182",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007108",
      "title": "The Mystery of the Leaping Fish",
      "year": 1916,
      "imdbRating": "6.7",
      "imdbVotes": "979",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007873",
      "title": "Down to Earth",
      "year": 1917,
      "imdbRating": "6.3",
      "imdbVotes": "82",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008498",
      "title": "Reaching for the Moon",
      "year": 1917,
      "imdbRating": "6.4",
      "imdbVotes": "111",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008775",
      "title": "Wild and Woolly",
      "year": 1917,
      "imdbRating": "6.4",
      "imdbVotes": "675",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006357",
      "title": "American Aristocracy",
      "year": 1916,
      "imdbRating": "6.1",
      "imdbVotes": "117",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006764",
      "title": "He Did and He Didn't",
      "year": 1916,
      "imdbRating": "6.4",
      "imdbVotes": "303",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006826",
      "title": "Hoodoo Ann",
      "year": 1916,
      "imdbRating": "5.9",
      "imdbVotes": "903",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007507",
      "title": "The Vagabond",
      "year": 1916,
      "imdbRating": "6.8",
      "imdbVotes": "3,287",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004413",
      "title": "The Ocean Waif",
      "year": 1916,
      "imdbRating": "6.3",
      "imdbVotes": "510",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008519",
      "title": "A Romance of the Redwoods",
      "year": 1917,
      "imdbRating": "6.2",
      "imdbVotes": "866",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008133",
      "title": "The Immigrant",
      "year": 1917,
      "imdbRating": "7.5",
      "imdbVotes": "9,530",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:35:22.872Z"
}