{
  "movieId": "tt0030001",
  "title": "Code of the Rangers",
  "year": 1938,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X-jR7X9rmeI",
      "id": "X-jR7X9rmeI",
      "title": "Code of The Rangers (1938) TIM McCOY🍕 COWBOY WESTERN",
      "description": "Stars: Tim McCoy, Pauline Haddon, Rex Lease, Frank LaRue\nDirector: Sam Newfield\n\nMarshal Tim Donovan has been sent to investigate a series of holdups. Posing as a card sharp, he soon believes he knows who is tipping off the outlaws. But when his carefully planned trap gets derailed, can he still bring the bad guys to justice?\n\nGet ready to ride into the heart of the Old West with a classic cowboy Western starring the iconic Tim McCoy! Directed by prolific filmmaker Sam Newfield, this thrilling adventure is a must-watch for fans of vintage Westerns, lawmen versus outlaws, and tales of rugged frontier justice.\n\nFeaturing stellar performances from Pauline Haddon, Rex Lease, and Frank LaRue, this action-packed film is a treasure for lovers of Western classics. Whether you’re a lifelong Tim McCoy fan or a first-time viewer, this thrilling tale of deception, danger, and justice will keep you hooked.\n\nPerfect for fans of classic Westerns, Western outlaws, and PizzaFLIX’s curated collection of retro cinema, Riders of Black Mountain is a timeless gem. Hit play and relive the golden age of cowboy cinema!\n\n#Tim McCoy #classic Westerns #Riders of Black Mountain #cowboy movies #Western outlaws #Sam Newfield #Pauline Haddon #Rex Lease #Frank LaRue #vintage Western films #PizzaFLIX #stagecoach holdups #frontier justice #cowboy hero.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "addedAt": "2025-12-24T01:04:35.780Z",
      "thumbnail": "https://i.ytimg.com/vi/X-jR7X9rmeI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCthWXMi6_wqx1gP5z6w5LnKEa1MQ",
      "duration": 3326,
      "language": "en",
      "year": 1938,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "56 min",
    "imdbRating": 6,
    "imdbVotes": 17,
    "Genre": "Western",
    "Plot": "Brothers Tim and Jack are Rangers after Blackie Miller. When Tim learns Jack broke one of Miller's men out of jail, he doesn't report it but has him resign. Later when the bank is robbed, Tim gives chase and catches Jack with the loot. Protecting Jack again, he poses as the robber and goes to prison. Quickly pardoned he catches up with Jack and when Miller's men attack, Jack gets a chance to repay him.",
    "Director": "Sam Newfield",
    "Writer": "Stanley Roberts",
    "Actors": "Tim McCoy, Rex Lease, Judith Ford",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027886",
    "tt0027255",
    "tt0032989",
    "tt0030581",
    "tt0030366",
    "tt0030756",
    "tt0033104",
    "tt0031164",
    "tt0031306",
    "tt0032055",
    "tt0032014",
    "tt0031769"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:34:40.207Z"
}