{
  "imdbId": "tt0038990",
  "title": "The Strange Woman",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1946-the-strange-woman-la-extrana-mujer-edgar-g.-ulmer-douglas-sirk-vose",
      "id": "1946-the-strange-woman-la-extrana-mujer-edgar-g.-ulmer-douglas-sirk-vose",
      "title": "1946 - The Strange Woman - La extraña mujer - Edgar G. Ulmer - Douglas Sirk - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com t.me/agendasociocultural",
      "fileSize": 697512548,
      "addedAt": "2026-01-07T00:06:03.998Z",
      "thumbnail": "https://archive.org/services/img/1946-the-strange-woman-la-extrana-mujer-edgar-g.-ulmer-douglas-sirk-vose",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 1326
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/StrangeWoman",
      "id": "StrangeWoman",
      "title": "The Strange Woman",
      "description": "Title: The Strange Woman Summary: In 1820s New England beautiful but poor and manipulative Jenny Hager marries rich old man Isaiah Poster but also seduces his son and his company foreman. Directed by: Edgar G. Ulmer, Douglas Sirk Actors: Production Company: Hunt Stromberg Productions Release Date: 25 October 1946 (USA) Aspect Ratio: 1.37 : 1 Beautiful Jenny Hager finds she can always get what she wants from the men in the 1820's port of Bangor, Maine. Freed by his death from her drunkard father she soon manoeuvres herself into a position to marry a middle-aged monied local businessman. Though she often uses his money to do good, she continues to consider all other men fair game.",
      "fileSize": 283686542,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/StrangeWoman",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 2754
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Strange_Woman_movie",
      "id": "Strange_Woman_movie",
      "title": "The Strange Woman",
      "description": "Hedy Lamarr and George Sanders in a movie based on Ben Ames Williams' novel of early 19th-century Maine. The IMDB entry is here . The video files with \"_1946\" in the file-name are of higher quality; the picture is sharper and there are no covered up watermarks. However, they have a very slight problem. At 1:25:26 the sign on the church is in French instead of English. The mpeg2 file is ready to be loaded into DVDAuthorGUI (a free program) to create a DVD to watch on your television.",
      "fileSize": 5126464358,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/Strange_Woman_movie",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 77318
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EueX9HoBZbM",
      "id": "EueX9HoBZbM",
      "title": "The Strange Woman (1946) [Film Noir] [Drama]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"The Strange Woman\" is an American film directed by Edgar G. Ulmer, starring Hedy Lamarr, and released by United Artists. An unscrupulous 19th-century woman will stop at nothing to control the men in her life.\n\n---\n\nDirected by Edgar G. Ulmer, produced by Jack Chertok (producer), Hedy Lamarr (executive producer), Eugen Schüfftan (producer) and Hunt Stromberg (executive producer), written by Ben Ames Williams (novel), Herb Meadow (screenplay), Hunt Stromberg (writer) and Edgar G. Ulmer (writer), starring Hedy Lamarr as Jenny Hager, George Sanders as John Evered, Louis Hayward as Ephraim Poster, Hillary Brooke as Meg Saladine and Gene Lockhart as Isaiah Poster.\n\n---\n\nSource: \"The Strange Woman\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 22 May 2012. Web. 22 July 2012. http://en.wikipedia.org/wiki/The_Strange_Woman.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:42:04.437Z",
      "thumbnail": "https://i.ytimg.com/vi/EueX9HoBZbM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBuCQbNQX5P8fzQ9_caQwj2GlYkHg",
      "duration": 5953,
      "language": "en",
      "year": 1946,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OYi1-_k6SJU",
      "id": "OYi1-_k6SJU",
      "title": "The Strange Woman (1946) | Colorized Public Domain Classic Drama with Hedy Lamarr & George Sanders",
      "description": "The Strange Woman (1946) is an American melodrama directed by Edgar G. Ulmer and adapted from Ben Ames Williams’ novel of the same name. This colorized and restored edition revives a striking period drama that showcases Hedy Lamarr in one of her strongest and most complex performances. Set in 19th-century Bangor, Maine, the story combines ambition, romance, and moral conflict in a way that reflects both the allure and dangers of unchecked desire. With Ulmer’s atmospheric direction and a cast led by Lamarr, George Sanders, and Louis Hayward, the film stands out as a powerful example of Hollywood’s post-war fascination with flawed heroines and psychological drama.\n\nPlot Summary:\nThe story follows Jenny Hager (Hedy Lamarr), a young woman growing up in Bangor, Maine, during the early 1800s. Scarred by an abusive childhood, Jenny learns to use her beauty and intelligence to manipulate the men around her, climbing the social ladder while pursuing wealth and influence. Her outward charm masks ruthless ambition, as she exploits relationships with Ezra Bigbee (Gene Lockhart), his son Ephraim (Louis Hayward), and wealthy businessman Isaiah Poster (George Sanders).\n\nJenny marries Isaiah for financial security, but her heart strays toward Ephraim, her childhood friend. This tangled web of deceit, betrayal, and suppressed passion drives the narrative to its tragic climax. The film explores timeless themes of power, morality, and the consequences of selfish choices, with Jenny embodying both victimhood and villainy.\n\nCast and Crew:\n• Director: Edgar G. Ulmer\n• Producer: Jack Chertok\n• Screenplay: Herbert J. Biberman, Hunt Stromberg\n• Based on: The Strange Woman by Ben Ames Williams\n• Cinematography: Lucien N. Andriot\n• Editing: Richard C. Currier\n• Music: Carmen Dragon\n\nStarring:\n• Hedy Lamarr as Jenny Hager\n• George Sanders as Isaiah Poster\n• Louis Hayward as Ephraim Poster\n• Gene Lockhart as Timothy Hager / Ezra Bigbee\n• Hillary Brooke as Meg Saladine\n• Alan Napier as John Evered\n\nFilm Significance:\nThe Strange Woman is one of Hedy Lamarr’s most acclaimed performances, allowing her to break away from her usual glamorous image and embody a morally ambiguous character. The role demonstrated her range as an actress, though her legacy is often overshadowed by her later reputation as an inventor and Hollywood beauty. The film also highlights Edgar G. Ulmer’s talent as a director capable of creating intense atmosphere on modest budgets, following his cult success with Detour (1945).\n\nThematically, the film connects to the tradition of femme fatale narratives in classic Hollywood but places them in a 19th-century setting. Its focus on power, sexuality, and female agency was daring for its time, and it remains a fascinating piece of mid-century American cinema. Over the years, it has developed cult appreciation for both Lamarr’s performance and Ulmer’s bold handling of melodrama.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Strange Woman remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1946 release was filmed in black and white, emphasizing shadows, textures, and period detail. While historically authentic, many modern audiences often pass over black-and-white films. By offering a colorized edition, we bring to life the rich costumes, sets, and dramatic atmosphere, giving audiences a new appreciation of Hedy Lamarr’s performance and Ulmer’s striking visuals. This edition bridges the gap between cinematic history and modern viewing habits.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from celebrated Hollywood dramas to hidden treasures. Our mission is to preserve these cultural artifacts and ensure their accessibility for audiences in the USA, Europe, and worldwide.\n\n#TheStrangeWoman #HedyLamarr #GeorgeSanders #LouisHayward #PublicDomainMovie #ColorizedClassic #FilmRestoration #1940sCinema #ClassicHollywood #GoldenAgeDrama",
      "addedAt": "2025-12-24T00:50:08.749Z",
      "thumbnail": "https://i.ytimg.com/vi/OYi1-_k6SJU/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYciBNKD8wDw==&rs=AOn4CLBxtkSSGavxGLYYPpRmuEuwxc4SHg",
      "duration": 5762,
      "language": "en",
      "year": 1946,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-strange-woman-1946",
      "id": "the-strange-woman-1946",
      "title": "The Strange Woman (1946)",
      "description": "Isaiah, a 19th-century businessman, has his eye on the beautiful and very young Jenny. Finally of age, she accepts his marriage proposal, but their love affair quickly turns sour. Ephraim, Isaiah's college-age son, comes for a visit, immediately striking up a chemistry with Jenny. She promises marriage -- if he murders his father first. But Jenny also swoons for John, the fiancé of her best friend, Meg. Watch on RetroFlix:  https://retroflix.org/the-strange-woman-1946/",
      "fileSize": 238622306,
      "addedAt": "2026-01-07T00:12:33.204Z",
      "thumbnail": "https://archive.org/services/img/the-strange-woman-1946",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 313
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thestrangewoman1946_202002",
      "id": "thestrangewoman1946_202002",
      "title": "The Strange Woman (1946) |Edgar G. Ulmer| Hedy Lamarr, George Sanders - Film Noir Full Movie",
      "description": "The Strange Woman is a 1946 American drama film noir thriller directed by Edgar G. Ulmer, starring Hedy Lamarr, George Sanders and Louis Hayward. Wikipedia: https://en.wikipedia.org/wiki/The_Strange_Woman Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 307834607,
      "addedAt": "2026-01-07T00:12:44.281Z",
      "thumbnail": "https://archive.org/services/img/thestrangewoman1946_202002",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 7170
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z4t4io4OoDE",
      "id": "Z4t4io4OoDE",
      "title": "The Strange Woman (1946) HEDY LAMARR",
      "description": "Stars: Hedy Lamarr, George Sanders, Louis Hayward \nDirector: Edgar G. Ulmer\n\nA tantalizing Jezebel, abused by her alcoholic father, takes lustful revenge on the men who love her until a touring evangelist reveals her evil ways",
      "addedAt": "2025-12-26T23:54:55.127Z",
      "thumbnail": "https://i.ytimg.com/vi/Z4t4io4OoDE/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB9ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLBdnqqwvXfSFzswSbLyXmPqyq_dDg",
      "duration": 5918,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=j5yYxp-3KJQ",
      "id": "j5yYxp-3KJQ",
      "title": "The Strange Woman (1946) COLORIZED | Hedy Lamarr | Drama, Film-Noir, Romance | Full Movie",
      "description": "There Was Evil in Her Kisses! So shocking she could only be spoken about in whispers!\nIn 1820s New England beautiful but poor and manipulative Jenny Hager marries rich old man Isaiah Poster but also seduces his son and his company foreman.\n\nOriginal title: The Strange Woman (1946)\nBlack & white version: https://youtu.be/LFsdU3orNYQ\n\nDirectors: Edgar G. Ulmer, Douglas Sirk \nWriters: Herb Meadow, Ben Ames Williams\nStars: Hedy Lamarr, George Sanders, Louis Hayward, Hillary Brooke\nGenre: Drama, Mystery & Suspense, Film-Noir, Romance\n\nCCC Chapters:\n00:00:00 Introduction\n00:02:41 a cruel child\n00:15:54 Plans for Jenny\n00:23:13 if the men don't donate, the women will\n00:26:10 Ephraim Poster returns home\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:45:48.875Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/j5yYxp-3KJQ/maxresdefault.webp?v=64833da7",
      "duration": 5950,
      "language": "en",
      "year": 1946,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "100 min",
    "imdbRating": 6.5,
    "imdbVotes": 2520,
    "Genre": "Drama, Romance, Thriller",
    "Plot": "Beautiful Jenny Hager finds she can always get what she wants from the men in the 1820's port of Bangor, Maine. Freed by his death from her drunkard father she soon manoeuvres herself into a position to marry a middle-aged monied local businessman. Though she often uses his money to do good, she continues to consider all other men fair game.",
    "Director": "Edgar G. Ulmer, Douglas Sirk",
    "Writer": "Herb Meadow, Ben Ames Williams, Hunt Stromberg",
    "Actors": "Hedy Lamarr, George Sanders, Louis Hayward",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037547",
    "tt0039114",
    "tt0035612",
    "tt0041886",
    "tt0035452",
    "tt0040751",
    "tt16156352",
    "tt0038342",
    "tt0038986",
    "tt0038988",
    "tt0018972",
    "tt0038592"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.281Z"
}