{
  "movieId": "tt0019726",
  "title": "Broadway Babies",
  "year": 1929,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cpldKzJeCDE",
      "id": "cpldKzJeCDE",
      "title": "Broadway Babies (1929) ALICE WHITE 🍕 PRE-CODE MUSICAL 🍕  FULL MOVIE",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Alice White, Marion Byron, Sally Eilers\nDirector: Mervyn LeRoy\nttps://www.youtube.com/playlist?list=PLmHgXUJMN1TUzR3YhpzxOuBM6YrZ91UVG\n🍕 Watch the complete, full-length 1929 Pre-Code Musical Movie 🍕 \nAn all-talking backstage musical from First National Pictures starring Alice White, Sally Eilers, and Marion Byron. Directed by Mervyn LeRoy, this vintage drama unfolds in the glittering shadows of Broadway, where ambition collides with crime and love becomes a dangerous game.\n\nA chorus girl chasing stardom finds herself caught in a sizzling love triangle between her dependable stage manager and a charming but dangerous bootlegger. Packed with Jazz Age flair, speakeasy style, and dramatic tension, this early talkie delivers classic musical numbers alongside bold storytelling—hallmarks of Pre-Code Hollywood.\n\nAlice White dazzles in the lead role, backed by standout turns from Sally Eilers and Marion Byron. The film also echoes real-life scandal: just a few years later, White herself became entangled in a tabloid-fueled love triangle that shocked Hollywood and derailed her rising career.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🎭 Subscribe for more Oscar-winning films, vintage musicals, and Pre-Code Hollywood gems!\n\n#FullMovie Broadway Babies #1929 #Fullmovie #AliceWhite #PreCodeMusical #BackstageDrama #BroadwayMusical #ClassicMovie #MervynLeRoy #SallyEilers #MarionByron #JazzAgeCinema #LoveTriangle #PizzaFLIX",
      "addedAt": "2025-12-24T01:04:01.573Z",
      "thumbnail": "https://i.ytimg.com/vi/cpldKzJeCDE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBrOcuYyV7Eguw0XNve8CSY7fR9gg",
      "duration": 5236,
      "language": "en",
      "year": 1929,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "86 min",
    "imdbRating": 6,
    "imdbVotes": 222,
    "Genre": "Drama, Musical",
    "Plot": "Dee lives with her two girlfriends in a boarding house. Billy is in love with Dee and runs the show where Dee is in the chorus. He has Dee stepping from the chorus to featured dancer. Gessant is a importer and gambler from Detroit. A gang is trying to keep him in town to fleece him and they use Dee as bait. He is introduced to Dee after her show and she and her friends go out with Gessant and his gambling buddies only because Dee is mad at Billy. Gessant helps her get another job as headliner at the New Moon Club. Billy and Dee break up over this job and Gessant falls for Dee. But Billy still loves Dee and Gessant loves Dee and Dee must choose who she wants.",
    "Director": "Mervyn LeRoy",
    "Writer": "Jay Gelzer, Monte M. Katterjohn, Humphrey Pearson",
    "Actors": "Alice White, Marion Byron, Sally Eilers",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0044903",
    "tt0019644",
    "tt0019933",
    "tt0019946",
    "tt0019959",
    "tt0020121",
    "tt0020143",
    "tt0020458",
    "tt0020366",
    "tt0020402",
    "tt0019729",
    "tt0020585"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:34:09.700Z"
}