{
  "imdbId": "tt0036047",
  "title": "It Ain't Hay",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/it-aint-hay-1943",
      "id": "it-aint-hay-1943",
      "title": "It Ain't Hay (1943)",
      "description": "Abbot and Costello must find a replacement for a woman's horse they accidentally killed after feeding it some candy. They head for the racetrack, find a look-a-like and take it. They do not realize that the nag is \"Tea Biscuit,\" a champion racehorse. Watch on RetroFlix:  https://retroflix.org/it-aint-hay-1943/",
      "fileSize": 1889709943,
      "addedAt": "2026-01-07T00:08:54.188Z",
      "thumbnail": "https://archive.org/services/img/it-aint-hay-1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 94
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 6.5,
    "imdbVotes": 1063,
    "Genre": "Comedy",
    "Plot": "King O'Hara (Cecil Kellaway) uses his horse-drawn, handsome Hansom Cab to drive the guys and dolls of Broadway around and about Central Park, and all is well and good until O'Hara's ailing horse comes up more than a little bit ill and, in fact, ups and dies after King's friend, taxicab driver Wilbur Hoolihan (Lou Costello), inadvertently but effectively by administering candy to the ailing animal. Some of the guys and dolls are more than somewhat upset, especially those citizens, who carry rods and get a lot of pointed questions from police officers, and who aren't among those most admired as upright citizens. So, Wilbur sets out to acquire a new horse to pull King's Hansom Cab through Central Park. Wilbur rescues a lost horse and gives it to KIng. But the new horse , unknown to all, is a famous race-hose named Tea Biscuit, and it is soon noticed that the horse has a lot more spirit and giddy-up than the horse he replaced. And it is not long before Tea Biscuit is entered in a famous horse-race in Saratoga - and complications arise.",
    "Director": "Erle C. Kenton",
    "Writer": "Damon Runyon, Allen Boretz, John Grant",
    "Actors": "Bud Abbott, Lou Costello, Grace McDonald",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0036004",
    "tt0032980",
    "tt0036953",
    "tt0035252",
    "tt0031278",
    "tt0031286",
    "tt0037771",
    "tt0033781",
    "tt0018673",
    "tt0015228",
    "tt0025755",
    "tt0039037"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.188Z"
}