{
  "imdbId": "tt0032871",
  "title": "One Million B.C.",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/one.million.b.c.1940",
      "id": "one.million.b.c.1940",
      "title": "One Million B.C. (1940)",
      "description": "\"One Million B.C.\" is a 1940 American fantasy film directed by Hal Roach and Hal Roach Jr. The story follows Tumak, who is exiled from the aggressive Rock Tribe after failing to assert his dominance. He encounters Loana from the peaceful Shell Tribe, who teaches him their cooperative ways. Tumak struggles to adapt but eventually helps unite both tribes against a common threat, including a volcanic eruption.",
      "fileSize": 2333963972,
      "addedAt": "2026-01-07T00:10:12.692Z",
      "thumbnail": "https://archive.org/services/img/one.million.b.c.1940",
      "language": "eng",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 467
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vv0GSvZGSxg",
      "id": "vv0GSvZGSxg",
      "title": "One Million B.C. (1940) | Colorized Public Domain Prehistoric Cult | Lon Chaney Jr. & Victor Mature",
      "description": "One Million B.C. (1940) is an American prehistoric fantasy adventure film directed by Hal Roach and Hal Roach Jr., produced by Hal Roach Studios, and distributed by United Artists. Starring Victor Mature, Carole Landis, and Lon Chaney Jr., the film became one of the most influential prehistoric-themed movies in Hollywood history. Noted for its ambitious special effects, imaginative depiction of primitive life, and groundbreaking use of lizards and other creatures as “dinosaurs,” the film was both a critical and commercial success. This restored and colorized edition revives the vivid spectacle of this classic for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nThe film’s story is framed through a present-day setting, where a group of college students listens to a lecture by an anthropology professor (Conrad Nagel). To explain prehistoric life, the professor recounts a dramatized tale of survival “one million years ago.”\n\nThe narrative follows Tumak (Victor Mature), a young warrior cast out from the brutal Rock Tribe led by his father, Akhoba (Lon Chaney Jr.). Tumak wanders into unknown territory and eventually encounters the more peaceful Shell Tribe, led by women and skilled in cooperation. There, he meets Loana (Carole Landis), who teaches him compassion, patience, and survival techniques unfamiliar to his warlike upbringing.\n\nConflict arises when Tumak must navigate loyalty between the violent traditions of his people and the more civilized ways of Loana’s tribe. Along the way, they battle natural disasters, dangerous animals, and tribal warfare. The climax blends romance, survival, and moral lessons about cooperation, resilience, and unity in the face of overwhelming odds.\n\nCast and Crew:\n• Directors: Hal Roach, Hal Roach Jr.\n• Producers: Hal Roach Studios\n• Writers: Mickell Novack, George Baker, Joseph Frickert (story)\n• Cinematography: Norbert Brodine, Roy Seawright (special effects)\n• Music: Werner R. Heymann\n\nStarring:\n• Victor Mature as Tumak\n• Carole Landis as Loana\n• Lon Chaney Jr. as Akhoba\n• Conrad Nagel as The Professor / Narrator\n• Nigel De Brulier as The Wise Man\n\nFilm Significance:\nOne Million B.C. was groundbreaking for its ambitious production. Released during Hollywood’s Golden Age, it used real animals with special effects techniques to simulate dinosaurs and prehistoric creatures, a method that became iconic—though controversial—for decades. Its innovative makeup, costuming, and use of live-action spectacle earned it two Academy Award nominations (Best Special Effects and Best Musical Score).\n\nThe film also propelled the careers of its leading actors. Victor Mature rose to stardom with his commanding performance as Tumak, while Carole Landis gained recognition as a rising Hollywood star. Lon Chaney Jr., already known for his family legacy, further cemented his reputation with a powerful role as the tribal leader Akhoba.\n\nBeyond its immediate impact, the film’s visual material became so iconic that stock footage from One Million B.C. was reused in numerous later films and television shows, including Robot Monster (1953), Valley of the Dragons (1961), and even episodes of Lost in Space and The Outer Limits.\n\nEnhanced Public Domain Explanation:\nOne Million B.C. (1940) is preserved as part of the public domain and remains freely available for restoration and cultural enjoyment. At Colorized Public Domain, we breathe new life into films like this through detailed digital restoration and colorization. By adding naturalistic hues to the harsh volcanic landscapes, tribal costumes, and prehistoric creatures, this edition enhances both the spectacle and human drama for today’s audiences.\n\nWhy Watch This Colorized Edition:\nOriginally presented in black and white, the film relied heavily on striking contrasts and dramatic cinematography. The colorized version amplifies these effects, bringing intensity to the volcanic eruptions, realism to the natural landscapes, and greater immersion to the emotional journeys of Tumak and Loana. It combines the authenticity of classic cinema with a modern visual upgrade, making it a must-watch for fans of prehistoric adventures, fantasy epics, and Golden Age Hollywood spectacles.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more restored and colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nAt Colorized Public Domain, our channel is dedicated to restoring and enhancing Hollywood’s timeless films—from silent-era dramas to fantasy adventures. Join us as we preserve these cultural treasures and introduce them to new generations of audiences across the USA, Europe, and worldwide.\n\n#OneMillionBC1940 #VictorMature #CaroleLandis #LonChaneyJr #ClassicAdventure #PrehistoricFantasy #GoldenAgeHollywood #PublicDomainMovie #ColorizedClassic #FilmRestoration #1940sMovies #CultClassicCinema",
      "addedAt": "2025-12-24T00:47:44.985Z",
      "thumbnail": "https://i.ytimg.com/vi/vv0GSvZGSxg/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYYCBlKE8wDw==&rs=AOn4CLA9Gi-LKGf3e4M-Sql01TK6iMvsaw",
      "duration": 4502,
      "language": "en",
      "year": 1940,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 5.7,
    "imdbVotes": 1724,
    "Genre": "Adventure, Fantasy, Romance",
    "Plot": "Tumak, member of the prehistoric Rock tribe, is exiled and makes his way to the more peaceful Shell tribe, where he is taken in and taught manners by the lovely Loana. Forced to leave the Shell tribe for fighting, Tumak, along with Loana, return to the Rock tribe, where Loana shows them the error of their brutal ways - until the volcano erupts!",
    "Director": "Hal Roach Jr., Hal Roach",
    "Writer": "Mickell Novack, George Baker, Joseph Frickert",
    "Actors": "Victor Mature, Carole Landis, Lon Chaney Jr.",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 2 Oscars. 3 nominations total"
  },
  "relatedMovies": [
    "tt0032403",
    "tt0033297",
    "tt0032392",
    "tt0032818",
    "tt0033159",
    "tt0032247",
    "tt0034831",
    "tt0026903",
    "tt0034264",
    "tt0031082",
    "tt0031204",
    "tt0031691"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.692Z"
}