{
  "imdbId": "tt0010178",
  "title": "The Glorious Lady",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGloriousLadyPreview",
      "id": "TheGloriousLadyPreview",
      "title": "\"The Glorious Lady\" (1919) starring Olive Thomas",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Glorious Lady\" is a moving drama included this film in our program to illustrate the work and contributions of Olive Thomas, a star of Silent Hall of Fame. This rare film lets us enjoy one of very few surviving performances of Olive Thomas, who died the year after its release at 25. A simple English girl becomes a duchess by marriage and must fulfill the heavy duty of giving birth to an heir to extend the noble family line.   Directed by                  George Irving Written by                  George M. Arthur Starring                      Olive Thomas, Matt Moore, Evelyn Brent, Robert Taber, Mona Kingsley, Huntley Gordon Cinematography        Lewis Physioc Distributed by            Select Pictures Corporation Release date                October 19, 1919 Running time              53 min Country                       United States Language                     Silent film, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 95633200,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGloriousLadyPreview",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 2296
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-glorious-lady-1919",
      "id": "the-glorious-lady-1919",
      "title": "The Glorious Lady",
      "description": "https://web.archive.org/web/20230310193739/https://en.wikipedia.org/wiki/The_Glorious_Lady",
      "fileSize": 1260593285,
      "addedAt": "2026-01-07T00:11:57.688Z",
      "thumbnail": "https://archive.org/services/img/the-glorious-lady-1919",
      "language": [
        "dut",
        "English"
      ],
      "year": 1919,
      "collection": "feature_films",
      "downloads": 1716
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "56 min",
    "imdbRating": 6,
    "imdbVotes": 47,
    "Genre": "Drama",
    "Plot": "During the annual English celebration in which peasants and aristocrats mingle, the Duke of Loame, a contestant in the \"point-to-point\" horse race, is thrown from his horse and saved by Ivis Benson, a tenant farmer's daughter, who was leading the race. Both are injured and they fall in love during the duke's visits while Ivis recovers, to the dismay of his mother and Lady Eileen, his mother's choice for his bride. After the duke and Ivis marry, the Dowager Duchess and Lady Eileen have Lady Eileen's brother, Dr. Neuman, tell the duke that because of Ivis' injuries she will not be able to perform the most important duty of a duchess - bearing an heir. Ivis, overhearing, attempts to get a divorce by feigning drunkenness in public to disgrace the duke. When this fails, she leaves, but a maid tells the duke of the scheme, and he brings Ivis home where she does bear a son.",
    "Director": "George Irving",
    "Writer": "George M. Arthur, Edmund Goulding",
    "Actors": "Olive Thomas, Matt Moore, Evelyn Brent",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010402",
    "tt0192409",
    "tt0007903",
    "tt0008489",
    "tt0009559",
    "tt0009968",
    "tt0010103",
    "tt0010137",
    "tt0010208",
    "tt0010316",
    "tt0010418",
    "tt0010890"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.688Z"
}