{
  "imdbId": "tt0027893",
  "title": "Little Lord Fauntleroy",
  "year": 1936,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CGT07npaFoo",
      "title": "Little Lord Fauntleroy (1936) [Drama] [Family]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | The movie \"Little Lord Fauntleroy\" is a 1936 drama film based on the 1886 novel of the same name by Frances Hodgson Burnett. The film stars Freddie Bartholomew, Dolores Costello, and C. Aubrey Smith. The first film produced by David O. Selznick's Selznick International Pictures, it was the studio's most profitable film until Gone With the Wind. The film is directed by John Cromwell.\n\nPlot: Young Cedric \"Ceddie\" Errol (Freddie Bartholomew) and his widowed mother, whom he calls \"Dearest\" (Dolores Costello), live frugally in 1880s Brooklyn after the death of his father. Cedric's prejudiced English grandfather, the Earl of Dorincourt (C. Aubrey Smith), had long ago disowned his son for marrying an American.\n\nThe earl sends his lawyer Havisham (Henry Stephenson) to bring Ceddie to England. As the earl's sons are all dead, Ceddie is the heir to the title. Mrs. Errol accompanies her son to England, but is not allowed to live at Dorincourt castle. For Cedric's happiness, she does not tell him it is because of his grandfather's bigotry. The earl's lawyer is impressed with the young widow's wisdom. However, the earl expresses skepticism when Mr. Havisham informs him that Cedric's mother will not accept an allowance from him.\n\nCedric soon wins the hearts of his stern grandfather and everyone else. The earl hosts a grand party to proudly introduce his grandson to British society, notably his sister Lady Constantia Lorridaile (Constance Collier).\n\nAfter the party, Havisham informs the Earl that Cedric is not the heir apparent after all. American Minna Tipton (Helen Flint) insists her son Tom (Jackie Searl) is the offspring of her late husband, the earl's eldest son. Heartbroken, the earl accepts her apparently valid claim, though Tom proves to be a rather obnoxious lad.\n\nFortunately for Ceddie, his friend Dick Tipton (Mickey Rooney) recognises Minna from her newspaper picture. He takes his brother Ben, Tom's real father, to England and disproves Minna's claim. The earl apologises to Ceddie's mother and invites her to live with the delighted Ceddie on his estate.\n\n---\n\nDirected by John Cromwell, produced y David O. Selznick, screenplay by Hugh Walpole, based on the novel \"Little Lord Fauntleroy\"\nby Frances Hodgson Burnett, starring Freddie Bartholomew as Cedric \"Ceddie\" Errol Lord Fauntleroy, Dolores Costello Barrymore as \"Dearest\" Errol, C. Aubrey Smith as the Earl of Dorincourt, Guy Kibbee as Mister Silas Hobbs, Henry Stephenson as Mister Havisham, Mickey Rooney as Dick Tipton, a Brooklyn bootblack, Una O'Connor as Mary, the Errols' servant, Constance Collier as Lady Constantia Lorridaile, Dorincourt's sister, Jackie Searl as Tom Tipton, Jessie Ralph as the Applewoman from Brooklyn, Helen Flint as Minna Tipton, Walter Kingsford as Mister Joshua Snade, Minna's lawyer, E. E. Clive as Sir Harry Lorridaile, Constancia's husband, Ivan F. Simpson as Reverend Mordaunt, Virginia Field as Miss Herbert, singer at party and Eric Alden as Ben Tipton, Dick's brother.\n\n---\n\nSource: \"Little Lord Fauntleroy (1936 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc..  10 February 2017. Web. 24 April 2017. https://en.wikipedia.org/wiki/Little_Lord_Fauntleroy_(1936_film)\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "CGT07npaFoo",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LittleLordFauntleroy1936JohnCromwellfullMovieHD",
      "title": "Little Lord Fauntleroy (1936) HD quality print",
      "description": "Young Ceddie (Freddie Bartholomew) lives with his American mother. His long-dead father was a British earl disowned by his grandfather, the Earl of Dorincourt (C. Aubrey Smith), who disapproved of all Americans. With his sons dead, the earl decides to recognize Ceddie as his heir. The stern and ill- tempered old man is soon won over by Ceddie's kindness and honesty. As the family begins to come together, trouble arrives when another woman insists her son is the earl's true heir.",
      "id": "LittleLordFauntleroy1936JohnCromwellfullMovieHD"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LittleLordFauntleroy720p1936",
      "title": "Little Lord Fauntleroy",
      "description": "Title: Little Lord Fauntleroy Summary: An American boy turns out to be the long-lost heir of a British fortune. He is sent to live with the cold and unsentimental lord who oversees the trust. Directed by: John Cromwell Actors: Freddie Bartholomew, Dolores Costello, C. Aubrey Smith Production Company: Selznick International Pictures Release Date: 6 March 1936 (USA) Aspect Ratio: 1.37 : 1 After the death of Cedric ('Ceddie')'s English father, he and his mother live together in Brooklyn. Cedric's grandfather, the Earl of Dorincourt, had disowned Cedric's father when he married an American. But when the Earl's remaining son dies, he accepts Cedric as Lord Fauntleroy, his heir, and the Earl sends for Cedric and his mother. Cedric uses the first of his newly found wealth to do some favors for his old friends, and then heads to England, where he must try to overcome the Earl's dislike for Cedric's mother.",
      "id": "LittleLordFauntleroy720p1936"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LittleLordFauntleroyh264",
      "title": "Little Lord Fauntleroy",
      "description": "In late nineteenth century Brooklyn, Ceddie Errol, the young son of an American woman and a late Englishman finds himself the sole male heir of his paternal grandfather, the Earl of Darincourt. The Earl, who has a pronounced distate for all things American and had previously refused to have anything to do wth Ceddie or his mother, invites them to relocate to England so Ceddie be groomed to take over the family title and fortune. Will the old aristocrat, a gruff character with a stern grip on the family wealth, remake the generous and easy-going Ceddie in his image or will it go the other way around? This film is one the of the four Selznick International Pictures productions that fell in the public domain after renewal registrations were not filed timely. These are all well-made, well-acted, big budget productions and are worth a look. For reference, the other three are: Nothing Sacred (1937) A Star is born (1937) Made for each other (1939) The version uploaded here is a two-pass H264 transcoding (using HandBrake 0.9.4) of the original 3.9GB MPEG2 already existing on the archive, with the intent of making the film more accessible to people who might otherwise be discouraged by the sheer size of the original. The original print had seen better days and I haven't done any reprocessing beyond de-telecining , so be prepared for occasional dots, spots and jumpy images. Note for Microsoft Windows users Your version of Windows Media Player might not be able to handle MP4 containers such as the one offered here. If this is the case, the film can still can be played using the VLC media player or Apple Quicktime , both of which are free to download. I personally recommend VLC, as it is much more versatile and can do a better job with other formats that Windows Media Players does support. For example, VLC plays MP2 soundtracks embedded in AVI containers such as this one seamlessly, while Windows Media Player 10 just plays the video without any sound, leading some users to wrongly think that they downloaded a film with no soundtrack. External links IMDB page American Film Institute entry Wikipedia entry Under the hood: VIDEO: [H264] 706x480 24bpp 24.031 fps 1200.0 kbps AUDIO: 48000 Hz, 2 ch, s16le, 128.0 kbit Original registration: LITTLE LORD FAUNTLEROY. Released through United Artists. 1936. 97 min., sd. From the novel by Frances Hodgson Burnett. Credits: Producer, David O. Selznick; director, John Cromwell; screenplay, Hugh Walpole; film editor, Hal C. Kern; music score. Max Steiner. Selznick International Pictures, Inc.; ©6Mar36; LP6189. Renewal registration: none",
      "id": "LittleLordFauntleroyh264"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/little-lord-fauntleroy-1936",
      "title": "Little Lord Fauntleroy (1936)",
      "description": "An American boy turns out to be the heir of a wealthy British earl. He is sent to live with the irritable and unsentimental aristocrat, his grandfather. Watch on RetroFlix:  https://retroflix.org/little-lord-fauntleroy-1936/",
      "id": "little-lord-fauntleroy-1936"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/little_lord_fauntleroy",
      "title": "Little Lord Fauntleroy",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "little_lord_fauntleroy"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=I6CVFeJKP6g",
      "title": "Little Lord Fauntleroy (1936) | Colorized Public Domain Classic Drama with Freddie Bartholomew",
      "description": "Little Lord Fauntleroy (1936) is a classic American drama film directed by John Cromwell, based on the beloved 1886 novel by Frances Hodgson Burnett. This colorized and restored edition of the public domain masterpiece revives one of the most iconic literary adaptations of the 1930s, giving modern audiences a chance to rediscover its warmth, charm, and emotional depth. Starring Freddie Bartholomew in one of his most memorable roles, this film captures the timeless tale of innocence, kindness, and the transformative power of compassion. By offering a high-quality colorized version, Colorized Public Domain brings this Hollywood classic to life for today’s viewers in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story follows Cedric Errol (Freddie Bartholomew), a young American boy living modestly in New York City with his widowed mother, Dearest (Dolores Costello Barrymore). Cedric’s life changes forever when he learns that he is the heir to a vast English estate and must travel to Britain to meet his estranged grandfather, the Earl of Dorincourt (C. Aubrey Smith). Known for his sternness and disdain for Americans, the Earl initially resists Cedric’s presence. However, the boy’s innocence, charm, and unwavering kindness gradually soften his grandfather’s heart, bridging the gap between class, culture, and generations.\n\nAs Cedric adapts to aristocratic life, conflicts arise when questions of inheritance threaten his legitimacy. Yet his honesty and genuine character ultimately restore harmony, leaving a lasting impact on both his family and the estate. The film’s resolution emphasizes loyalty, compassion, and the belief that decency can overcome prejudice and bitterness.\n\nCast and Crew:\n• Director: John Cromwell\n• Producer: David O. Selznick\n• Screenplay: Hugh Walpole\n• Based on: “Little Lord Fauntleroy” by Frances Hodgson Burnett\n• Cinematography: Charles Rosher\n• Editing: Hal C. Kern\n\nStarring:\n• Freddie Bartholomew as Cedric Errol / Lord Fauntleroy\n• Dolores Costello Barrymore as Mrs. Errol (Dearest)\n• C. Aubrey Smith as Earl of Dorincourt\n• Mickey Rooney as Dick Tipton\n• Guy Kibbee as Mr. Hobbs\n• Henry Stephenson as Havisham\n• Constance Collier as Lady Lorridaile\n• E. E. Clive as Sir Harry Lorridaile\n\nFilm Significance:\nLittle Lord Fauntleroy is more than a simple literary adaptation; it reflects Depression-era America’s fascination with stories of upward mobility, moral values, and the redemptive power of love. Produced by David O. Selznick shortly before his monumental success with “Gone with the Wind” (1939), the film highlights Selznick’s skill in adapting beloved novels for the screen. Freddie Bartholomew’s performance won critical acclaim and cemented his status as one of Hollywood’s most celebrated child actors of the 1930s. The supporting cast, including C. Aubrey Smith and a young Mickey Rooney, adds richness to the film’s emotional and dramatic layers.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Little Lord Fauntleroy remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1936 release was filmed in black and white, typical of its time and reflective of the era’s visual style. While historically authentic, black-and-white films often deter modern audiences. By offering a carefully restored and colorized version, we make the story more visually engaging for contemporary viewers while preserving the performances, atmosphere, and themes that define the film’s historical significance. This edition bridges the gap between heritage cinema and modern entertainment habits, making Little Lord Fauntleroy as relevant today as it was in the 1930s.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten gems to enduring Hollywood classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#LittleLordFauntleroy #FreddieBartholomew #PublicDomainMovie #1930sDrama #ClassicCinema #ColorizedClassic #GoldenAgeHollywood #FrancesHodgsonBurnett #FilmRestoration #FamilyDrama",
      "id": "I6CVFeJKP6g",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iHLhgxVW_98",
      "title": "Little Lord Fauntleroy (1936) FREDDIE BARTHOLOMEW",
      "description": "Stars: Freddie Bartholomew, Dolores Costello, C. Aubrey Smith\n Director: John Cromwell\n\n An American boy turns out to be the long-lost heir of a British fortune. He is sent to live with the cold and unsentimental lord who oversees the trust. Watch for a teenage Mickey Rooney!",
      "id": "iHLhgxVW_98",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ROHag1wxBQo",
      "title": "Little Lord Fauntleroy (1936) Freddie Bartholomew, Dolores Costello Barrymore | Full Movie",
      "description": "An American boy turns out to be the long-lost heir of a British fortune. He is sent to live with the cold and unsentimental Lord, who oversees the trust.\n\nThis video is subtitled in more than 30 languages and dubbed in German & Spanish. Click on ⚙️ and choose audio tracks and/or subtitles.\n\nColorized version https://youtu.be/LGKgB-YFC4I\nDirector: John Cromwell\nWriters: Frances Hodgson Burnett, Hugh Walpole\nStars: Freddie Bartholomew, Dolores Costello, C. Aubrey Smith, & Mickey Rooney\nGenres: Classics, Drama, Family, Romance",
      "id": "ROHag1wxBQo",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OMmxSELuP-8",
      "title": "Little Lord Fauntleroy (1936) Freddie Bartholomew, Dolores Costello | Full Movie",
      "description": "An American boy turns out to be the long-lost heir of a British fortune. He is sent to live with the cold and unsentimental Lord, who oversees the trust.\n\nChoose this new high definition version with multi audio tracks and subtitles:\nhttps://youtu.be/ROHag1wxBQo\n\nColorized version https://youtu.be/LGKgB-YFC4I\nDirector: John Cromwell\nWriters: Frances Hodgson Burnett, Hugh Walpole\nStars: Freddie Bartholomew, Dolores Costello, C. Aubrey Smith\nGenres: Classics, Drama, Family, Romance\n\n @CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "OMmxSELuP-8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "102 min",
    "imdbRating": "7.3",
    "imdbVotes": "2,696",
    "Genre": "Drama, Family",
    "Plot": "After the death of Cedric ('Ceddie')'s English father, he and his mother live together in Brooklyn. Cedric's grandfather, the Earl of Dorincourt, had disowned Cedric's father when he married an American, but when the Earl's remaining son dies, he accepts Cedric as Lord Fauntleroy, his heir, and the Earl sends for Cedric and his mother. Cedric uses the first of his newly found wealth to do some favors for his old friends, and then heads to England, where he must try to overcome the Earl's dislike for Cedric's mother.",
    "Director": "John Cromwell",
    "Writer": "Frances Hodgson Burnett, Hugh Walpole, John Cromwell",
    "Actors": "Freddie Bartholomew, Dolores Costello, C. Aubrey Smith",
    "Language": "English",
    "Country": "United States",
    "Awards": "4 wins total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0027331",
      "title": "Banjo on My Knee",
      "year": 1936,
      "imdbRating": "6.2",
      "imdbVotes": "660",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029855",
      "title": "Algiers",
      "year": 1938,
      "imdbRating": "6.6",
      "imdbVotes": "3,341",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025586",
      "title": "Of Human Bondage",
      "year": 1934,
      "imdbRating": "7.0",
      "imdbVotes": "8,650",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027499",
      "title": "Daniel Boone",
      "year": 1936,
      "imdbRating": "5.6",
      "imdbVotes": "358",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027882",
      "title": "Let's Sing Again",
      "year": 1936,
      "imdbRating": "5.7",
      "imdbVotes": "92",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0300647",
      "title": "What Becomes of the Children?",
      "year": 1936,
      "imdbRating": "5.2",
      "imdbVotes": "71",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031602",
      "title": "Made for Each Other",
      "year": 1939,
      "imdbRating": "6.2",
      "imdbVotes": "4,172",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026164",
      "title": "Call of the Wild",
      "year": 1935,
      "imdbRating": "6.8",
      "imdbVotes": "2,715",
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0028827",
      "title": "Elephant Boy",
      "year": 1937,
      "imdbRating": "6.4",
      "imdbVotes": "856",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0026972",
      "title": "Scrooge",
      "year": 1935,
      "imdbRating": "6.4",
      "imdbVotes": "2,667",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028988",
      "title": "Heidi",
      "year": 1937,
      "imdbRating": "7.2",
      "imdbVotes": "5,105",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029271",
      "title": "Los muchachos de antes no usaban gomina",
      "year": 1937,
      "imdbRating": "7.5",
      "imdbVotes": "64",
      "language": "Spanish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:38.891Z"
}