{
  "imdbId": "tt0047878",
  "title": "The Big Combo",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Big_Combo_1955",
      "title": "The Big Combo",
      "description": "Because a reviewer stated that the audio is out of sync with the video, here's a link to a different transcoding that was derived from a different source file: CLICK HERE Cornel Wilde stars in an excellent noir. This copy is sharper than the one that was already here.",
      "id": "Big_Combo_1955"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1955-the-big-combo-agente-especial-joseph-h.-lewis_202007",
      "title": "1955 The Big Combo Agente Especial Joseph H. Lewis 202007",
      "id": "1955-the-big-combo-agente-especial-joseph-h.-lewis_202007"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBigComboCornellWilde1955BOO",
      "title": "TheBigComboCornellWilde1955BOO",
      "description": "http://www.imdb.com/title/tt0047878/ Police captain Peterson (Robert Middleton) storms into the office of police Lt. Leonard Diamond (Cornel Wilde) critical of Diamond's spending exorbitant amounts of the city budget and his own personal money in an attempt to arrest a crime boss Mr. Brown (Richard Conte). Peterson says it is a waste of time trying to find something incriminating to bring Mr. Brown to justice because his crime combo does business without accounting books, and furthermore Peterson says Diamond's actual motivation is Diamond's love for Brown's girlfriend Susan Lowell (Jean Wallace). Susan is attended to at all time by Brown's thugs Mingo (Earl Holliman) and Fante (Lee Van Cleef). Seemingly drawn to Brown through his ability to inflict pain, she seems kidnapped and yet willingly waits for Brown's brutal attentions. Attempting suicide she overdoses on pills, and utters the name \"Alicia\" as Diamond attends to her in the hospital. Believing this may be Brown's wife Diamond follows up on this new lead, but Brown captures and tortures Diamond and delivers him back to his boss Peterson attempting to make diamond appear drunk. Meanwhile Joe McClure (Brian Donlevy)..... Download and find out",
      "id": "TheBigComboCornellWilde1955BOO"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Big_Combo_1955",
      "title": "The Big Combo",
      "description": "A high-quality p.d. noir.   Don't bother downloading the h.264 file or the Ogg Video file; the Cinepack file from which they are derived is smaller.",
      "id": "The_Big_Combo_1955"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iIkCXF9Y4ow",
      "title": "The Big Combo (1955) [Film Noir] [Crime]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | Police Lt. Leonard Diamond is on a personal crusade to bring down sadistic gangster Mr. Brown. He's also dangerously obsessed with Brown's girlfriend, the suicidal Susan Lowell. His main objective as a detective is to uncover what happened to a woman called \"Alicia\" from the crime boss's past. Mr. Brown, his second-in-command McClure and thugs Fante and Mingo kidnap and torture the lieutenant, then pour a bottle of alcohol-based hair tonic down his throat before letting him go. Diamond eventually learns through one of Brown's past accomplices that Alicia was actually Brown's wife. The accomplice suspects that Alicia was sent away to Sicily with former mob boss Grazzi, then murdered, tied to the boat's anchor and permanently submerged. Diamond questions a Swede named Dreyer, who was the skipper of that boat (but now operates an antiques store as a front, bankrolled by Brown). Dreyer denies involvement, but this doesn't prevent him from being murdered by McClure within seconds after he leaves the shop. Diamond tries to persuade Susan to leave Brown and admits he might be in love with her. He shows her a photo of Brown, Alicia and Grazzi together on the boat. Susan finally confronts Brown about his wife and is told she is still alive in Sicily, Italy, living with Grazzi.\n\nBrown next orders a hit on Diamond. However, when his gunmen Fante and Mingo go to Diamond's apartment, they mistakenly shoot and kill the cop's burlesque dancer girlfriend Rita instead. Diamond sees an up-to-date photo of Alicia but realizes it wasn't taken in Sicily (since there's snow on the ground). This leads Diamond to suspect Brown didn't kill Alicia but his boss Grazzi instead. Diamond is able to track Alicia to a sanitarium, where she is staying under another name. He asks for her help. Brown's right-hand man, McClure, wants to take over. He plots with Fante and Mingo to ambush Mr. Brown, but ends up getting killed himself because they are loyal to the boss. At police headquarters, Brown shows up with a writ of habious corpus, effectively preventing Alicia to testify against her husband. Brown also brings a big stash of \"money\" to Fante and Mingo while they are hiding out from the police, but the box turns out to contain a bomb that apparently kills both. Brown shoots the lieutenant's partner Sam and kidnaps Susan, planning to fly away to safety. Diamond finds a witness that could finally nail the elusive gangster -- Mingo, who survived the blast and confesses that Brown was behind it all. Alicia is able to help Diamond figure out where Brown was likely to take Susan, a private airport where Brown intends to board a getaway plane.\n\nHowever, the plane doesn't show up and the film climaxes in a foggy airplane hangar shootout. Susan shines a bright light in Brown's eyes and the lieutenant places him under arrest. The last scene shows the silhouetted figures of Diamond and Susan in the fog, considered to be one of the iconic images of film noir.\n\n---\n\nDirected by Joseph H. Lewis, produced by Sidney Harmon, written by Philip Yordan, starring Cornel Wilde as Police Lt. Leonard Diamond, Richard Conte as Mr. Brown, Brian Donlevy as Joe McClure, Jean Wallace as Susan Lowell, Robert Middleton as Police Capt. Peterson, Lee Van Cleef as Fante, Earl Holliman as Mingo, Helen Walker as Alicia Brown, Jay Adler as Sam Hill, John Hoyt as Nils Dreyer, Ted de Corsia as Bettini, Helene Stanton as Rita, Roy Gordon as Audubon, Whit Bissell as Doctor (scenes deleted) (as Whit Bissel), Steve Michaell as Bennie Smith - Boxer, Baynes Barron as Young Detective, James McCallion as Frank - Technician, Tony Michaels as Photo Technician, Brian O'Hara as Attorney Malloy, Bruce Sharpe Detective, Michael Mark as Fred - Hotel Clerk, Philip Van Zandt as Mr. Jones (scenes deleted) and Donna Drew as Miss Hartleby.\n\n---\n\nSource: \"The Big Combo\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 28 February 2013. Web. 12 March 2013. http://en.wikipedia.org/wiki/The_Big_Combo.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "iIkCXF9Y4ow",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-big-combo-1955",
      "title": "The Big Combo (1955)",
      "description": "Police Lt. Leonard Diamond vies to bring a clever, well connected, and sadistic gangster to justice all the while obsessing over the gangster's girlfriend. Watch on RetroFlix:  https://retroflix.org/the-big-combo-1955/",
      "id": "the-big-combo-1955"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-big-combo-pnm",
      "title": "The Big Combo (1955) [P&M] 1080p Blu-Ray (13GB)",
      "description": "For the P&M collection, I scour the web for the highest fidelity uploads of films, whether that be here on the Archive, elsewhere on the web, on bittorrent or even YouTube. Once I've painstakingly compared every download that I could get my hands on, I upload the best one so that no one else needs to go through that struggle to be sure they're getting the highest possible fidelity. These are often much larger files than what are typically on the Archive, but, if you're like me, this may be no issue for you.",
      "id": "the-big-combo-pnm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OITrTnAqWI8",
      "title": "The Big Combo (1955) by Joseph H. Lewis | The Most Startling Story The Screen Has Ever Dared Reveal!",
      "description": "The Most Startling Story The Screen Has Ever Dared Reveal! \nA police lieutenant is ordered to stop investigating deadly crime boss Mr. Brown because he hasn't been able to get any hard evidence against him. He goes after Brown's girlfriend, who despises him, for information instead.\n\nOriginal title: The Big Combo (1955) AKA: The Hoodlum \n\nColorized version: https://youtu.be/1OUaw_JDPVs\n\n\nDirector: Joseph H. Lewis\nWriter: Philip Yordan\nStars: Cornel Wilde, Richard Conte, Jean Wallace, Lee Van Cleef\nGenres: Crime, Drama, Film-Noir, Thriller\n\n00:00 Full Movie\n04:06 A police officer named Leonard is determined to take down Mr. Brown, the leader of an illegal organization, but struggles to gather evidence and convince his superiors.\n09:10 A man named Mr. Brown becomes enraged and takes extreme measures after his girlfriend attempts suicide and is arrested for homicide.\n17:15 A man is interrogated about a woman named Alicia and denies knowing her, but his reactions suggest otherwise.\n22:47 A conversation between two individuals about false arrests, a missing person, and a party invitation.\n38:34 Lt Diamond interrogates a drunk suspect named Bettini to find information about Brown and Alicia.\n41:05 Lt. Diamond investigates the disappearance of Alicia, Mr. Brown's wife, and suspects foul play.\n48:28 A seaman confronts Mr. Diamond and threatens him, leading to a shooting incident.\n57:39 Mr. Brown's ex-wife wants to come back, but he doesn't want to talk about it.\n1:05:40 Alicia is alive and living in Sicily, disproving the theory that she was murdered.\n1:14:49 A witness against Mr. Brown reveals his crimes, leading to panic and a search for Brown.\n1:19:59 A group of criminals plan a getaway but things go awry when one of them is shot and another is killed.\n\n\n@CultCinemaClassics",
      "id": "OITrTnAqWI8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "87 min",
    "imdbRating": "7.3",
    "imdbVotes": "9,203",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Police Lt. Diamond is told to close his surveillance of suspected mob boss Mr. Brown because it's costing the department too much money with no results. Diamond makes one last attempt to uncover evidence against Brown by going to Brown's girlfriend, Susan Lowell.",
    "Director": "Joseph H. Lewis",
    "Writer": "Philip Yordan",
    "Actors": "Cornel Wilde, Richard Conte, Jean Wallace",
    "Language": "English, Swedish, Latin, German",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0049801",
      "title": "Storm Fear",
      "year": 1955,
      "imdbRating": "6.3",
      "imdbVotes": "1,207",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037932",
      "title": "My Name Is Julia Ross",
      "year": 1945,
      "imdbRating": "7.0",
      "imdbVotes": "3,830",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042006",
      "title": "The Undercover Man",
      "year": 1949,
      "imdbRating": "6.6",
      "imdbVotes": "1,454",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048421",
      "title": "New York Confidential",
      "year": 1955,
      "imdbRating": "7.1",
      "imdbVotes": "1,106",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0047881",
      "title": "The Big Tip Off",
      "year": 1955,
      "imdbRating": "6.3",
      "imdbVotes": "105",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047087",
      "title": "Highway Dragnet",
      "year": 1954,
      "imdbRating": "6.2",
      "imdbVotes": "1,070",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045564",
      "title": "The Blue Gardenia",
      "year": 1953,
      "imdbRating": "6.8",
      "imdbVotes": "6,423",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050213",
      "title": "The Brothers Rico",
      "year": 1957,
      "imdbRating": "6.8",
      "imdbVotes": "1,666",
      "language": "English, Italian, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047934",
      "title": "Chicago Syndicate",
      "year": 1955,
      "imdbRating": "6.5",
      "imdbVotes": "661",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047958",
      "title": "Crashout",
      "year": 1955,
      "imdbRating": "7.0",
      "imdbVotes": "791",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047904",
      "title": "A Bullet for Joey",
      "year": 1955,
      "imdbRating": "6.0",
      "imdbVotes": "1,322",
      "language": "English, Spanish, Italian, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049204",
      "title": "Female Jungle",
      "year": 1955,
      "imdbRating": "5.5",
      "imdbVotes": "630",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:40:04.100Z"
}