{
  "movieId": "tt0053453",
  "title": "The Wonderful Country",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-wonderful-country-1959_202508",
      "id": "the-wonderful-country-1959_202508",
      "title": "The Wonderful Country (1959) Robert Mitchum · Julie London",
      "description": "Commissioned by Mexican politician Castro (Pedro Armendariz), gunfighter Martin Brady (Mitchum) is tasked with smuggling weapons from Texas across the border to the south. He breaks his leg and recuperates in the arms of the seductive officer's wife, Ellen. When he botches his job, Castro sets a killer on him. Mitchum (who also produced the film) is in his element here, playing the border crosser, the man between worlds, with stoic composure. Director Robert Parrish , who also shot \"Playing with Fire\" (1957) with Mitchum, does a fine job. And Floyd Crosby's cinematography delivers beautiful, wildly romantic Technicolor images.",
      "fileSize": 1456434299,
      "addedAt": "2026-01-07T00:12:33.207Z",
      "thumbnail": "https://archive.org/services/img/the-wonderful-country-1959_202508",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 225
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "98 min",
    "imdbRating": 6.1,
    "imdbVotes": 2392,
    "Genre": "Romance, Western",
    "Plot": "Having fled to Mexico from the U.S. many years ago for killing his father's murderer, Martin Brady travels to Texas to broker an arms deal for his Mexican boss, strongman Governor Cipriano Castro. Brady breaks a leg and while recuperating in Texas the gun shipment is stolen. Complicating matters further the wife of local army major Colton has designs on him, and the local Texas Ranger captain makes him a generous offer to come back to the states and join his outfit. After killing a man in self defense, Brady slips back over the border and confronts Castro who is not only unhappy that Brady has lost his gun shipment but is about to join forces with Colton to battle the local raiding Apache Indians.",
    "Director": "Robert Parrish",
    "Writer": "Robert Ardrey, Tom Lea, Walter Bernstein",
    "Actors": "Robert Mitchum, Julie London, Gary Merrill",
    "Language": "English, Spanish, German",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0054127",
    "tt0051411",
    "tt0054428",
    "tt0186500",
    "tt0055184",
    "tt0049472",
    "tt0051936",
    "tt0051899",
    "tt0050923",
    "tt0052600",
    "tt0017463",
    "tt0040078"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.207Z"
}