{
  "movieId": "tt0063350",
  "title": "Night of the Living Dead",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Night.Of.The.Living.Dead_1080p",
      "id": "Night.Of.The.Living.Dead_1080p",
      "title": "Night of the Living Dead",
      "description": "This is the full 1080p Blu-Ray rip (m2ts) of \"Night of the Living Dead\" ( IMDB ) as well as other versions derived from it. The mkv's each have the DTS and AC3 soundtracks with the chapters info included. Please enjoy and let me know if there are problems with any of the files.",
      "fileSize": 62255369623,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/Night.Of.The.Living.Dead_1080p",
      "language": "English",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 295255
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NightOfTheLivingDead-MPEG",
      "id": "NightOfTheLivingDead-MPEG",
      "title": "Night Of The Living Dead",
      "description": "The dead come back to life and terrorize a group of people trapped inside a rural Pennsylvania farmhouse. \"It has been established that persons who have recently died have been returning to life and committing acts of murder. A wide investigation of reports from funeral homes, morgues and hospitals has concluded that the unburied dead are coming back to life and seeking human victims...\"",
      "fileSize": 2906505059,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NightOfTheLivingDead-MPEG",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 128750
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NightOfTheLivingDead1968-Restored",
      "id": "NightOfTheLivingDead1968-Restored",
      "title": "Night of the Living Dead (1968) - restored",
      "description": "The classic original but with the editing mistakes and jump cuts fixed. A superior cut to any other.",
      "fileSize": 2409372044,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NightOfTheLivingDead1968-Restored",
      "collection": "feature_films",
      "downloads": 64942
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NightOfTheLivingDead_201508",
      "id": "NightOfTheLivingDead_201508",
      "title": "Night Of The Living Dead",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 1105029259,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NightOfTheLivingDead_201508",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 7084
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NightOfTheLivingDead_228",
      "id": "NightOfTheLivingDead_228",
      "title": "Night of the Living Dead",
      "description": "Night of the Living Dead",
      "fileSize": 211214051,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NightOfTheLivingDead_228",
      "collection": "feature_films",
      "downloads": 33380
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Night_Of_The_Living_Dead_raw_HD_WS",
      "id": "Night_Of_The_Living_Dead_raw_HD_WS",
      "title": "Night Of The Living Dead",
      "description": "Some different prints of the all-time classic. 1. Raw untouched video master - how the film has been seen on late night TV and PD video's and DVDs for years. 2. A remastered version of the film presented in HD. 3. Rare international widescreen theatrical release print presented 16:9 enhanced. Copyright Status: PUBLIC DOMAIN Published without a valid Copyright Notice. Type of Work: Cancelled Registration Cancelled Registration Number: PA0000046101 PA reg. cancelled. Published pre ’78 without copyright notice. Title: Night of the living dead / an Image Ten production ; produced by Russell W. Streiner, Karl Hardiman ; directed by George A. Romero.",
      "fileSize": 4843135391,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/Night_Of_The_Living_Dead_raw_HD_WS",
      "language": "English",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 134090
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Night_of_the_Living_Dead_AVI",
      "id": "Night_of_the_Living_Dead_AVI",
      "title": "Night of the Living Dead",
      "description": "A group of people hide from bloodthirsty zombies in a farmhouse. - IMDB Description",
      "fileSize": 2232365980,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/Night_of_the_Living_Dead_AVI",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 25974
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/livingDead_4k",
      "id": "livingDead_4k",
      "title": "Night of the Living Dead (1968) [colorised, 4k, 60FPS]",
      "description": "Of Human Bondage is a 1968 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @   https://colab.research.google.com/   Technologies used: A.I. Colorizing:   https://github.com/jantic/DeOldify   A.I. Increasing frame rate 60 FPS:   https://rife-vfi.github.io   A.I. Upscaling to 4K:   https://ffmpeg.org   GPU: Google Colab ",
      "fileSize": 6895510943,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/livingDead_4k",
      "collection": "feature_films",
      "downloads": 1190
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night-of-the-living-dead-1968-colorized",
      "id": "night-of-the-living-dead-1968-colorized",
      "title": "Night Of The Living Dead (1968) Colorized",
      "description": "Night of the Living Dead (1968) Colorized",
      "fileSize": 1159463876,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/night-of-the-living-dead-1968-colorized",
      "collection": "feature_films",
      "downloads": 487
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night-of-the-living-dead-1968_202312",
      "id": "night-of-the-living-dead-1968_202312",
      "title": "Night of the Living Dead (1968)",
      "description": "A disparate group of individuals takes refuge in an abandoned house when corpses begin to leave the graveyard in search of fresh human bodies to devour. The pragmatic Ben does his best to control the situation, but when the murderous zombies surround the house, the other survivors begin to panic. Watch on RetroFlix:  https://retroflix.org/night-of-the-living-dead-1968/",
      "fileSize": 553635008,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/night-of-the-living-dead-1968_202312",
      "language": "eng",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 942
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night-of-the-living-dead_1968",
      "id": "night-of-the-living-dead_1968",
      "title": "Night of the Living Dead",
      "description": "https://web.archive.org/web/20230312153921/https://en.wikipedia.org/wiki/Night_of_the_Living_Dead For best video and audio quality, use the source file by loading the playlist into your local media player (must support Matroska, e.g. VLC or mpv ).",
      "fileSize": 11198108931,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/night-of-the-living-dead_1968",
      "language": "eng",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 2346
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night_of_the_living_dead_dvd",
      "id": "night_of_the_living_dead_dvd",
      "title": "Night of the Living Dead",
      "description": "I did some digital tweaking on Night of the Living Dead to make it more watchable and made it into a DVD image that you can burn.",
      "fileSize": 5003733232,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/night_of_the_living_dead_dvd",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 288239
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/notld_201610",
      "id": "notld_201610",
      "title": "Night of the Living Dead",
      "description": "Title: Night of the Living Dead Summary: A ragtag group of Pennsylvanians barricade themselves in an old farmhouse to remain safe from a bloodthirsty, flesh-eating breed of monsters who are ravaging the East Coast of the United States. Directed by: George A. Romero Actors: Production Company: Image Ten Release Date: 4 October 1968 (USA) Aspect Ratio: 1.37 : 1 Barbra and Johnny visit their father's grave in a remote cemetery when they are suddenly set upon by zombies. Barbra manages to get away and takes refuge in what seems to be an abandoned farm house. She is soon joined by Ben who stopped at the house in need of gas. Beset by the walking dead all around them Ben does his best to secure the doors and windows. The news reports are grim however with creatures returning to life everywhere. Barbra and Ben are surprised when they realize there are 5 people hiding out in the basement: Harry, Helen and Karen Cooper; and a young couple, Tom and Judy. Dissensions sets in almost immediately with Harry Cooper wanting to be in charge. As their situation deteriorates, their chances of surviving the night lessen minute by minute.",
      "fileSize": 724699817,
      "addedAt": "2026-01-07T00:10:02.899Z",
      "thumbnail": "https://archive.org/services/img/notld_201610",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 4571
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H91BxkBXttE",
      "id": "H91BxkBXttE",
      "title": "Night of the Living Dead (1968) [Horror] [Mystery]",
      "description": "\"Night of the Living Dead\" is an American independent horror and cult film directed by George A. Romero and starring Duane Jones, Judith O'Dea and Karl Hardman. It premiered on October 1, 1968, and was completed on a US$114,000 budget. After decades of cinematic re-releases, the film ultimately became a financial success, grossing $12 million domestically and $18 million internationally. Night of the Living Dead was heavily criticized at its release owing to explicit content, but eventually garnered critical acclaim and has been selected by the Library of Congress for preservation in the National Film Registry as a film deemed \"culturally, historically or aesthetically significant.\n\nThe story begins as siblings Barbra (Judith O'Dea) and Johnny (Russell Streiner) drive to rural Pennsylvania to visit their father's grave where they are violently attacked by a strange man (Bill Hinzman). Johnny tries to rescue his sister, but is killed after he falls and cracks his head on a gravestone. Barbra flees, with the killer in pursuit; eventually to an empty farmhouse where to her horror she discovers a half-eaten woman's corpse. Running out of the house, she notices several menacing figures akin to her pursuer; whereupon a man named Ben (Duane Jones) arrives in a car and takes her inside the house.\n\nThe ghouls swarm around the house, searching for living human flesh. Hiding in the cellar are married couple Harry (Karl Hardman) and Helen Cooper (Marilyn Eastman) and their daughter Karen (Kyra Schon), who sought refuge at the farmhouse after a group of attackers turned over their car; and teenage couple Tom (Keith Wayne) and Judy (Judith Ridley) who arrived after hearing an emergency broadcast about a series of brutal murders. Ben activates a radio while Barbra awakens from a stupor. Harry asks everyone to hide in the cellar; but Ben deems it a \"deathtrap\" and remains upstairs. Harry returns to the cellar to Helen and Karen, who has fallen seriously ill after being bitten on the arm by one of their attackers. Radio reports explain that a state of mass murder is sweeping across the East Coast of the United States. When Ben finds a television, the emergency broadcaster reports that the recently deceased have become living dead and are consuming the flesh of living people. Experts, scientists, and the United States military do not know the cause, though one scientist suspects radioactive contamination from a space probe returning from Venus that exploded in the Earth's atmosphere.\n\nThe Cooper family hiding in the cellar beneath the house. When news reports reveal local rescue centers offering refuge, Ben plans to reach the nearest of these and obtain medical care for Karen. Ben and Tom then go to refuel Ben's truck while Harry hurls Molotov cocktails from an upper window to keep the ghouls at bay. Fearing for Tom's safety, Judy follows him. At the pump, Tom accidentally spills fuel, setting the truck ablaze. Tom and Judy try to withdraw the truck to avoid further damage; but it explodes, killing them both. Ben returns to the house to find Harry retreating to the cellar door. Angered by Harry's cowardice, Ben attacks him, while the ghouls feed on Tom and Judy. In the house, a report on the television reveals that, aside from lighting dead bodies on fire, a gunshot or heavy blow to the head will stop any ghoul and that posses of armed men are patrolling the countryside to restore order.\n\nMoments later, the ghouls attempt to break into the house. Harry grabs Ben's rifle and threatens to shoot him, but Ben takes back the gun and shoots Harry, who stumbles into the cellar to collapse next to Karen, who has died of the infection of her injury. The ghouls begin to pull Helen and Barbra through the windows; but Helen frees herself and goes down to the cellar to find a reanimated Karen consuming Harry, whereupon Karen kills her with a masonry trowel. Barbra, distracted by seeing Johnny as one of the ghoul among the ghouls, is carried away by the horde and eaten. The undead break into the house, and Karen attacks Ben; but he seals himself in the cellar and shoots Harry and Helen just as they reanimate. The next morning, Ben is killed by a member of the posse in mistake for a ghoul, and placed onto a burning pyre along with other dead bodies.\n\n---\n\nDirected by George A. Romero, produced by Karl Hardman and Russell Streiner, written by George A. Romero and John A. Russo, starring Duane Jones, Judith O'Dea, Karl Hardman, Marilyn Eastman, Keith Wayne, Judith Ridley, Bill Cardille and Kyra Schon.\n\n---\n\nSource: \"Night of the Living Dead\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 26 August 2012. Web. 27 August 2012. http://en.wikipedia.org/wiki/The_Night_Of_The_Living_Dead\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:51.382Z",
      "thumbnail": "https://i.ytimg.com/vi/H91BxkBXttE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC76sBxjCGlNZxh5V4sX3KWTC6DoQ",
      "duration": 5718,
      "language": "en",
      "year": 1968,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "DE",
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Gistc7ieq1M",
      "id": "Gistc7ieq1M",
      "title": "Night of the Living Dead (1968) | Colorized Public Domain Horror Classic by George A. Romero",
      "description": "Night of the Living Dead (1968) is an independent American horror film directed by George A. Romero that reshaped cinema history and redefined the modern zombie genre. This colorized and restored edition brings one of the most influential films of all time into vivid detail for a new generation of viewers. Known for its shocking realism, bleak atmosphere, and groundbreaking social commentary, the film remains a cornerstone of both horror cinema and independent filmmaking. By reviving it in color, we preserve its cultural power while making it more accessible to audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe film opens with siblings Barbra (Judith O’Dea) and Johnny (Russell Streiner) visiting a Pennsylvania cemetery, only to be attacked by a strange, flesh-hungry figure. Barbra escapes and finds refuge in a rural farmhouse where she meets Ben (Duane Jones), a resourceful man who becomes the group’s reluctant leader. As night falls, more survivors—including the fractious Cooper family and a young couple—arrive at the farmhouse. Tensions rise as the small group struggles to defend themselves against the relentless horde of the undead swarming outside.\n\nWhat makes Night of the Living Dead so impactful is its unflinching portrayal of human conflict under extreme pressure. The threat outside is terrifying, but the mistrust and divisions within the farmhouse prove just as dangerous. The film builds toward a shocking climax that challenges traditional Hollywood endings, leaving audiences with a sense of dread and hopelessness rarely seen in the 1960s.\n\nCast and Crew:\n• Director: George A. Romero\n• Producer: Karl Hardman, Russell Streiner\n• Screenplay: John Russo, George A. Romero\n• Cinematography: George A. Romero\n• Editing: George A. Romero\n• Music: Stock music from Capitol Hi-Q library\n\nStarring:\n• Duane Jones as Ben\n• Judith O’Dea as Barbra\n• Karl Hardman as Harry Cooper\n• Marilyn Eastman as Helen Cooper\n• Keith Wayne as Tom\n• Judith Ridley as Judy\n• Kyra Schon as Karen Cooper\n• Russell Streiner as Johnny\n\nFilm Significance:\nUpon its release, Night of the Living Dead shocked audiences with its raw violence, bleak tone, and subversive themes. The casting of Duane Jones, an African American actor, in the lead role was groundbreaking for 1968 and gave the film an added layer of social commentary during the Civil Rights era. Despite its shoestring budget, Romero’s use of handheld camerawork, realistic gore, and claustrophobic tension created a film that felt frighteningly real.\n\nThe film is credited with inventing the modern “zombie” as we know it: flesh-eating, relentless, and apocalyptic. It spawned countless sequels, remakes, and imitators, influencing everything from Dawn of the Dead (1978) to The Walking Dead. Today, it is considered one of the most important horror films ever made and a milestone in American independent cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Night of the Living Dead remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1968 release was in stark black and white, adding to its documentary-like realism. While iconic, black-and-white visuals can deter modern audiences unfamiliar with vintage cinema. By offering a colorized edition, we bring fresh life to Romero’s masterpiece without altering its tone or message. The detail of zombie makeup, costumes, and farmhouse settings gains new depth, making the horror more immediate and immersive.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema and beyond, from pioneering horrors to forgotten gems. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#NightOfTheLivingDead #GeorgeRomero #1960sHorror #PublicDomainMovie #ColorizedClassic #ZombieMovie #FilmRestoration #CultHorror #ClassicCinema #IndependentFilm",
      "addedAt": "2025-12-24T00:50:07.933Z",
      "thumbnail": "https://i.ytimg.com/vi/Gistc7ieq1M/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBZKEYwDw==&rs=AOn4CLB6QrrTtmWu5Bb6zT93VfV7ouyOdg",
      "duration": 5514,
      "language": "en",
      "year": 1968,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ekEXtU9gszE",
      "id": "ekEXtU9gszE",
      "title": "Night of the Living Dead (1968) GEORGE A. ROMERO",
      "description": "Director: George A. Romero\nStars: Duane Jones, Judith O'Dea, Karl Hardman \n\nIn George A. Romero's cinematic landmark, seven strangers are trapped in a rural farmhouse by a ravenous gang of flesh-eating zombies.",
      "addedAt": "2025-12-26T23:44:26.935Z",
      "thumbnail": "https://i.ytimg.com/vi/ekEXtU9gszE/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB-gSAAuADigIMCAAQARhdIF0oXTAP&rs=AOn4CLCs7GI0bvN4pz8fj5dpwMxWoZE_DA",
      "duration": 5753,
      "language": "en",
      "year": 1968,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NightOfTheLivingDead720p1968",
      "id": "NightOfTheLivingDead720p1968",
      "title": "Night Of The Living Dead 720p 1968",
      "description": "In this classic horror film, strangers hold up in a rural Pennsylvania farmhouse and battle constant attacks from dead locals who have been brought back to life by mysterious radiation. 720p version.",
      "fileSize": 1112690010,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NightOfTheLivingDead720p1968",
      "collection": "feature_films",
      "downloads": 21588
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "96 min",
    "imdbRating": 7.8,
    "imdbVotes": 148892,
    "Genre": "Horror, Thriller",
    "Plot": "Barbra and Johnny visit their father's grave in a remote cemetery when they are suddenly set upon by zombies. Barbra manages to get away and takes refuge in what seems to be an abandoned farm house. She is soon joined by Ben who stopped at the house in need of gas. Beset by the walking dead all around them Ben does his best to secure the doors and windows. The news reports are grim however with creatures returning to life everywhere. Barbra and Ben are surprised when they realize there are 5 people hiding out in the basement: Harry, Helen and Karen Cooper; and a young couple, Tom and Judy. Dissensions sets in almost immediately with Harry Cooper wanting to be in charge. As their situation deteriorates, their chances of surviving the night lessen minute by minute.",
    "Director": "George A. Romero",
    "Writer": "John A. Russo, George A. Romero",
    "Actors": "Duane Jones, Judith O'Dea, Karl Hardman",
    "Language": "English",
    "Country": "United States",
    "Awards": "7 wins total"
  },
  "relatedMovies": [
    "tt0060536",
    "tt0063242",
    "tt0488433",
    "tt0064186",
    "tt0065858",
    "tt0061005",
    "tt0083767",
    "tt0059106",
    "tt0067119",
    "tt0059646",
    "tt0067656",
    "tt0068967"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-11T23:00:54.700Z"
}