{
  "imdbId": "tt0020785",
  "title": "Conspiracy",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/conspiracy-1930-dvd-mkv",
      "id": "conspiracy-1930-dvd-mkv",
      "title": "Conspiracy (1930) DVD MKV",
      "description": "DVD remux of the 1930 RKO film \"Conspiracy.\" IMDb TMDB Wikipedia Conspiracy is a 1930 American pre-Code mystery melodrama film produced and distributed by RKO Pictures and directed by Christy Cabanne. It is the second adaptation of the play The Conspiracy by Robert B. Baker and John Emerson and stars Bessie Love and Ned Sparks. (In 1958, the film entered the public domain in the U.S. because the copyright claimants did not renew the copyright registration in the 28th year after publication.)",
      "fileSize": 4746783759,
      "addedAt": "2026-01-07T00:07:51.624Z",
      "thumbnail": "https://archive.org/services/img/conspiracy-1930-dvd-mkv",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 231
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/conspiracy-4-k",
      "id": "conspiracy-4-k",
      "title": "Conspiracy (1930) [Colorized, 4K, 60FPS]",
      "description": "Conspiracy is a 1930 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6120403583,
      "addedAt": "2026-01-07T00:07:51.624Z",
      "thumbnail": "https://archive.org/services/img/conspiracy-4-k",
      "collection": "feature_films",
      "downloads": 271
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8rjILTGHG08",
      "id": "8rjILTGHG08",
      "title": "Conspiracy (1930) | Colorized Public Domain Pre-Code Mystery Thriller with Bessie Love & Ned Sparks",
      "description": "Conspiracy (1930) is an American pre-Code mystery thriller directed by Christy Cabanne and distributed by Metro-Goldwyn-Mayer. This restored and colorized public domain edition revives a forgotten early sound-era film filled with espionage, double-crosses, and high-stakes drama. Released during the dawn of talking pictures, the movie blends mystery, romance, and suspense while showcasing the transitional style of Hollywood as it moved beyond silent storytelling.\n\nPlot Summary:\nThe film follows Margaret Holt (Bessie Love), a resourceful and courageous young woman who becomes entangled in a shadowy plot involving political intrigue and covert agents. When she accidentally overhears a conversation that could threaten national security, Margaret is drawn into a dangerous web of deception. Unsure of whom to trust, she finds herself caught between rival operatives while attempting to safeguard critical information.\n\nAdding tension is Winthrop Clavering (Hugh Trevor), a determined young man who may either be an ally or a potential betrayer. Their uneasy alliance deepens into a tentative romance as they navigate a world of hidden identities, coded messages, and high-risk encounters. Providing comic relief and sharp commentary is the dry-witted character played by Ned Sparks, whose distinct voice and deadpan delivery became a hallmark of early sound cinema.\n\nThe stakes escalate as Margaret faces life-threatening situations that test her courage and resolve. Themes of loyalty, patriotism, and the cost of secrecy dominate the narrative, reflecting a cultural fascination with espionage in the years leading up to global conflict.\n\nCast and Crew:\n• Director: Christy Cabanne\n• Distributor: Metro-Goldwyn-Mayer\n• Cinematography: Notably early sound studio work typical of 1930 MGM productions\n\nStarring:\n• Bessie Love as Margaret Holt\n• Ned Sparks as Supporting Role\n• Hugh Trevor as Winthrop Clavering\n• Ivan Lebedeff as Anton Kravetz\n• Dorothy Revier as Joan Thorpe\n• Lionel Belmore as Professor Roland\n\nFilm Significance:\nConspiracy is a classic example of Hollywood experimenting with both sound technology and story-driven suspense during the pre-Code era. While not as well-known as other MGM productions of the early 1930s, it remains significant for its atmospheric mystery and early sound-era performances. Bessie Love, already an established star from silent films, adapted her acting style effectively to the new medium. Ned Sparks, meanwhile, delivers his trademark sardonic wit, grounding the film with a unique character voice that appealed to audiences of the time.\n\nThe film also demonstrates how early 1930s cinema embraced themes of espionage and conspiracy, foreshadowing the larger political narratives that would dominate later decades of filmmaking. Today, Conspiracy is valuable not only as entertainment but also as a cultural artifact showcasing the transitional moment in Hollywood history when sound was still a novelty and genre conventions were being redefined.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Conspiracy remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1930 release was in black and white, consistent with early sound productions. While authentic, many modern viewers skip over older films due to their visual limitations. By restoring and colorizing Conspiracy, we highlight the intrigue, performances, and suspense with renewed visual clarity. This edition bridges historical preservation with modern accessibility, helping a forgotten pre-Code thriller reach new audiences while honoring its original artistry.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant features. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Conspiracy1930 #BessieLove #NedSparks #PreCodeHollywood #PublicDomainMovie #ColorizedClassic #EarlySoundCinema #ClassicMystery #FilmRestoration #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:49:51.784Z",
      "thumbnail": "https://i.ytimg.com/vi/8rjILTGHG08/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYYSBhKGEwDw==&rs=AOn4CLDe0VDVPS07lhVqS3LBYL5wv9bN1A",
      "duration": 4074,
      "language": "en",
      "year": 1930,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "69 min",
    "imdbRating": 5.1,
    "imdbVotes": 171,
    "Genre": "Comedy, Crime, Mystery",
    "Plot": "For the last four years Margaret Holt has been helping her brother, assistant D.A. Victor Holt, to try to bring down the dope dealing Schemer Marko gang. Margaret kills Marko (aka 'James Morton') when he discovers she's found evidence to use against him. Looking for someplace to hide out, she flees to a local house for disadvantaged women. Her secret is discovered by gossip columnist John Howell and crotchety old mystery writer Winthrop Clavering, who concoct a plan to try to clear Margaret of the crime and, at the same time, capture the Marko gang, who have since kidnapped Victor and are now hot on Margaret's trail as well.",
    "Director": "Christy Cabanne",
    "Writer": "Beulah Marie Dix, Robert M. Baker, John Emerson",
    "Actors": "Bessie Love, Ned Sparks, Hugh Trevor",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021763",
    "tt0023384",
    "tt0024787",
    "tt0019690",
    "tt0023528",
    "tt0026819",
    "tt0032608",
    "tt0029757",
    "tt0039800",
    "tt0024545",
    "tt0024054",
    "tt0023030"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.624Z"
}