{
  "imdbId": "tt0076786",
  "title": "Suspiria",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/suspiria-1977",
      "id": "suspiria-1977",
      "title": "Suspiria (1977)",
      "description": "SUSPIRIA  (  Suspiria , 1977 - Itália ) ( Filme Completo / Legendado em Português ) Data de Lançamento: 01 de Fevereiro de 1977 » SOBRE O FILME: Uma novata em uma elegante academia de balé percebe, aos poucos, que a escola é na verdade uma fachada para um mundo sinistro e bizarro, cujo objetivo é promover caos e destruição. . Com base em Suspiro das Profundezes (Suspiria de Profundis), obra de Thomas De Quincey, Argento cria um conto de fadas incomum, com poucas mas inesquecíveis mortes e um elemento fantasioso que oprime e perturba personagens e espectadores. Um filme que por muitos motivos fez escola e, mesmo que não seja uma obra-prima, tem uma importância conceitual muito grande para o gênero terror, principalmente para diretores que não estão apenas preocupados em gerar o medo puro e simples, mas em também criar, através da beleza, uma porta de entrada para o macabro sobrenatural. » » DIREÇÃO: Dario Argento GÊNERO: Terror, Suspense ORIGEM: Itália DURAÇÃO: 1h 38min » » ELENCO PRINCIPAL: Jessica Harper......Suzy Bannion Stefania Casini....Sara Flávio Blucci......Daniel Miguel Bosé........Mark Barbara Magnolf....Olga Eva Axén...........Pat Hingle Joan Bennett.......Madame Blanc Alida Valli........Miss Tarner",
      "fileSize": 6343220117,
      "addedAt": "2026-01-07T00:11:35.634Z",
      "thumbnail": "https://archive.org/services/img/suspiria-1977",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 71512
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "92 min",
    "imdbRating": 7.3,
    "imdbVotes": 112468,
    "Genre": "Horror",
    "Plot": "Suzy Bannion travels to Germany to perfect her ballet skills. She arrives at the Tanz dance academy in the pouring rain and is refused admission after another woman is seen fleeing the school. She returns the next morning and this time is let in. She learns that the young woman she saw fleeing the previous evening, Pat Hingle, has been found dead. Strange things soon begin to occur. Suzy becomes ill and is put on a special diet; the school becomes infested with maggots; odd sounds abound; and Daniel, the pianist, is killed by his own dog. A bit of research indicates that the ballet school was once a witches' coven - and as Suzy learns, still is.",
    "Director": "Dario Argento",
    "Writer": "Dario Argento, Daria Nicolodi, Thomas De Quincey",
    "Actors": "Jessica Harper, Stefania Casini, Flavio Bucci",
    "Language": "Italian, Russian, English, German, Latin",
    "Country": "Italy",
    "Awards": "1 win & 4 nominations total"
  },
  "relatedMovies": [
    "tt0073582",
    "tt0065143",
    "tt0075820",
    "tt0075990",
    "tt0080990",
    "tt0076271",
    "tt0076630",
    "tt0076731",
    "tt0074486",
    "tt0076162",
    "tt0078240",
    "tt0076665"
  ],
  "collections": [
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.634Z"
}