{
  "movieId": "tt0007903",
  "title": "An Even Break",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/forarch_201908",
      "id": "forarch_201908",
      "title": "\"An Even Break\" (1917) starring Olive Thomas",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"An Even Break\" is an emotional drama included in our program to illustrate the work and contributions of Olive Thomas, a star of Silent Hall of Fame. This rare film lets us enjoy one of very few surviving performances of Olive Thomas, who died three years later at 25. Two girls and a boy grow up together and years later end up in a love triangle.   Directed by                  Lambert Hillyer Written by                  Lambert Hillyer Starring                      Olive Thomas, Charles Gunn, Margaret Thompson, Darrel Foss, Charles K. French Cinematography        John Stuart Stumar Distributed by            Triangle Film Corporation Release date                august 5, 1917 Running time              52 min Country                       United States Language                     Silent film, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 92898899,
      "addedAt": "2026-01-07T00:08:32.015Z",
      "thumbnail": "https://archive.org/services/img/forarch_201908",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 4721
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "50 min",
    "imdbVotes": 22,
    "Genre": "Comedy, Drama",
    "Plot": "Claire Curtis, Jimmie Strong and Mary have spent their childhood together in the country. Upon reaching adulthood, Claire goes to New York and becomes a success on stage. Jimmie, who has always dreamed of becoming an inventor, goes to New York to sell the machine he invented, and there he renews his acquaintance with Claire. Soon their old friendship ripens into love. Meanwhile, back in the country, Ralph and David Harding, who are making Jimmie's machine, plan to steal the right to it. Back in New York, Mary appears and informs Claire that she loves Jimmie, and the actress resolves to give her a chance to win him. When it appears that the Hardings' scheme to steal Jimmie's machine will succeed, however, Mary's ardor turns cold. Claire and Jimmie then rush back to the country in time to avert the takeover and save his firm from bankruptcy.",
    "Director": "Lambert Hillyer",
    "Writer": "Lambert Hillyer",
    "Actors": "Olive Thomas, Charles Gunn, Margaret Thompson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008519",
    "tt0008133",
    "tt0008443",
    "tt0168593",
    "tt0008499",
    "tt0007964",
    "tt0326184",
    "tt0011779",
    "tt0006357",
    "tt0006764",
    "tt0006826",
    "tt0008822"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.015Z"
}