{
  "movieId": "tt0016643",
  "title": "The Better 'Ole",
  "year": 1926,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TNlFnUWyQUU",
      "id": "TNlFnUWyQUU",
      "title": "The Better 'Ole (1926) SYD CHAPLIN",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Syd Chaplin, Jack Ackroyd, Edgar Kennedy\nDirector: Charles Reisner\nWriters: Bruce Bairnsfather (by), Darryl F. Zanuck (Screenplay)\n🍕Presented with the original synchronized orchestral score and sound effects🍕\nThe adventures of Old Bill and his friends Bert and Alf in the trenches of the First World War. Adapted from the 1917 stage musical of the same name by Bruce Bairnsfather, which in turn was based on his 1915 comic strip. \n\nTRIVIA: The second full-length film by Warner Bros. Pictures to utilize the Vitaphone sound-on-disc process for a synchronized musical score and sound effects.",
      "addedAt": "2025-12-24T01:06:41.318Z",
      "thumbnail": "https://i.ytimg.com/vi/TNlFnUWyQUU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAH0XTxJku3xUhhAXk3h3UFZN4rsg",
      "duration": 5783,
      "language": "en",
      "year": 1926,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-better-ole-1926-dvd-mkv",
      "id": "the-better-ole-1926-dvd-mkv",
      "title": "The Better 'Ole (1926) DVD MKV",
      "description": "DVD remux of the 1926 Vitaphone film \"The Better 'Ole.\" IMDb TMDB Wikipedia The Better 'Ole is a 1926 American synchronized sound World War I comedy drama film. Released by Warner Bros. Pictures, Inc., this film is the second full-length film to utilize the Vitaphone sound-on-disc process, two months after the first Vitaphone feature Don Juan; with no audible dialogue, the film does have a synchronized musical score and sound effects. This film was also the second onscreen adaptation of the 1917 musical The Better 'Ole by Bruce Bairnsfather and Arthur Elliot. Charlie Chaplin's eldest brother Sydney Chaplin played the main lead as Old Bill in perhaps his best-known film today. This film is also believed by many to have the first spoken word of dialog, \"coffee\", although there are those who disagree. At one point during the film, Harold Goodwin's character whispers a word to Sydney Chaplin which is also faintly heard. This was discovered by the UCLA's Robert Gitt, during the restoration of the sound discs for the film. The line was recorded in perfect sync, apparently during the orchestra recording sessions rather than live on set, therefore making it the earliest known use of dubbing in a motion picture.",
      "fileSize": 4688272035,
      "addedAt": "2026-01-07T00:11:46.533Z",
      "thumbnail": "https://archive.org/services/img/the-better-ole-1926-dvd-mkv",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 356
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "95 min",
    "imdbRating": 6.2,
    "imdbVotes": 311,
    "Genre": "Comedy, War, Drama",
    "Plot": "The adventures of Old Bill and his friends Bert and Alf in the trenches of the first World War.",
    "Director": "Charles Reisner",
    "Writer": "Bruce Bairnsfather, Arthur Eliot, Darryl F. Zanuck",
    "Actors": "Syd Chaplin, Harold Goodwin, Jack Ackroyd",
    "Language": "English, German",
    "Country": "United States",
    "Awards": "2 wins"
  },
  "relatedMovies": [
    "tt0017540",
    "tt0029209",
    "tt0032132",
    "tt0018742",
    "tt0017457",
    "tt0048380",
    "tt0046359",
    "tt0018471",
    "tt0017765",
    "tt0016028",
    "tt0019339",
    "tt0017750"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}