{
  "imdbId": "tt0022698",
  "title": "Blonde Venus",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blonde-venus",
      "id": "blonde-venus",
      "title": "Blonde Venus",
      "description": "Josef von Sternberg returned Marlene Dietrich to the stage in  Blonde Venus,  both a glittering spectacle and a sweeping melodrama about motherly devotion. Unfolding episodically, the film tells the story of Helen (Dietrich), once a German chanteuse, now an American housewife, who resurrects her stage career after her husband (Herbert Marshall) falls ill; she then becomes the mistress of a millionaire (Cary Grant), in a slide from loving martyr to dishonored woman. Despite production difficulties courtesy of the Hays Office, the director’s baroque visual style shines, as do one of the most memorable musical numbers in all of cinema and a parade of visionary costumes by von Sternberg and Dietrich’s longtime collaborator Travis Banton.",
      "fileSize": 7711716631,
      "addedAt": "2026-01-07T00:07:38.718Z",
      "thumbnail": "https://archive.org/services/img/blonde-venus",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 8228
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blonde-venus-1932-remastered-720p",
      "id": "blonde-venus-1932-remastered-720p",
      "title": "Blonde Venus (1932)",
      "description": "American chemist Ned Faraday marries a German entertainer and starts a family. However, he becomes poisoned with Radium and needs an expensive treatment in Germany to have any chance at being cured. Wife Helen returns to night club work to attempt to raise the money and becomes popular as the Blonde Venus. In an effort to get enough money sooner, she prostitutes herself to millionaire Nick Townsend.",
      "fileSize": 2815328477,
      "addedAt": "2026-01-07T00:07:38.718Z",
      "thumbnail": "https://archive.org/services/img/blonde-venus-1932-remastered-720p",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 16963
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "93 min",
    "imdbRating": 7.1,
    "imdbVotes": 6071,
    "Genre": "Drama",
    "Plot": "American chemist Ned Faraday marries a German entertainer and starts a family. However, he becomes poisoned with Radium and needs an expensive treatment in Germany to have any chance at being cured. Wife Helen returns to night club work to attempt to raise the money and becomes popular as the Blonde Venus. In an effort to get enough money sooner, she prostitutes herself to millionaire Nick Townsend. While Ned is away in Europe, she continues with Nick but when Ned returns cured, he discovers her infidelity. Now Ned despises Helen but she grabs son Johnny and lives on the run, just one step ahead of the Missing Persons Bureau. When they do finally catch her, she loses her son to Ned. Once again she returns to entertaining, this time in Paris, and her fame once again brings her and Townsend together. Helen and Nick return to America engaged, but she is irresistibly drawn back to her son and Ned. In which life does she truly belong?",
    "Director": "Josef von Sternberg",
    "Writer": "Jules Furthman, S.K. Lauren, Josef von Sternberg",
    "Actors": "Marlene Dietrich, Cary Grant, Herbert Marshall",
    "Language": "English, French, German",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023458",
    "tt0021800",
    "tt0025746",
    "tt0021156",
    "tt0020697",
    "tt0026276",
    "tt0020499",
    "tt0019754",
    "tt0018839",
    "tt0019071",
    "tt0034175",
    "tt0016310"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.718Z"
}