{
  "movieId": "tt0026260",
  "title": "Danger Trails",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lbz04F8vC5s",
      "id": "lbz04F8vC5s",
      "title": "Danger Trails (1935) BIG BOY WILLIAMS🍕 COWBOY WESTERN",
      "description": "Stars: Guinn 'Big Boy' Williams, Marjorie Gordon, John Elliott\nDirector: Robert F. Hill\n\nSaddle up for another vintage Cowboy Western featuring the legendary Guinn 'Big Boy' Williams, in one of his most iconic roles. This action-packed gem, directed by Robert F. Hill, delivers all the excitement of the Wild West—gunfights, family betrayal, and tough choices on the open frontier.\n\nWhen a former football star journeys west to find his long-lost father, his stagecoach is ambushed by outlaws who shockingly turn out to be his own brothers. Caught between justice and blood ties, he must decide whether to stand by the law or protect the only family he has left. It's a gripping tale of honor, loyalty, and the hard choices faced by men of the frontier.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPerfect for fans of Cowboy Westerns, Classic Western movies, 1930s Westerns, and vintage Hollywood action. A must-watch for admirers of Guinn 'Big Boy' Williams and supporting stars Marjorie Gordon and John Elliott. If you enjoy nostalgic Western films like those featured on PizzaFLIX, you're in for a real treat.\n\n👍 LIKE, 💬 COMMENT, and 🔔 SUBSCRIBE for more rare and exciting Western classics every week!\n\n#GuinnBigBoyWilliams #ClassicWesterns #VintageWesterns #OldHollywood #WesternMovies #1930sCinema #CowboyMovies #MarjorieGordon #JohnElliott",
      "addedAt": "2025-12-24T01:04:04.851Z",
      "thumbnail": "https://i.ytimg.com/vi/lbz04F8vC5s/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDku3pzjogaS0-orWyu3MIqShphYw",
      "duration": 3583,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 5.7,
    "imdbVotes": 22,
    "Genre": "Western",
    "Plot": "Having been raised in the East, Bob Wilson returns to find his father and three half brothers outlaws. He convinces his father to go straight but as his father rides to give himself up, he is killed by the Sheriff. When the three brothers then kidnap the Sheriff's daughter, the Sheriff and his men ride to get not only the three brothers but Bob also.",
    "Director": "Robert F. Hill",
    "Writer": "Robert F. Hill, Guinn 'Big Boy' Williams",
    "Actors": "Guinn 'Big Boy' Williams, Marjorie Gordon, John Elliott",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025006",
    "tt0027167",
    "tt0027006",
    "tt0026253",
    "tt0027789",
    "tt0027874",
    "tt0028491",
    "tt0028101",
    "tt0028188",
    "tt0025143",
    "tt0028712",
    "tt0028865"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:34:13.266Z"
}