{
  "movieId": "tt0061916",
  "title": "The Long Duel",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-long-duel-1967",
      "id": "the-long-duel-1967",
      "title": "The Long Duel (1967)",
      "description": "An idealistic colonial police officer is sent to capture a rebel leader who threatens the stability of the Raj's north-west frontier. Despite his official colonial capacity, the policeman is impressed by the ingenuity and integrity of his enemy and is determined to arrest him alive rather than bring him in dead as his superiors might wish. Watch on RetroFlix:  https://retroflix.org/the-long-duel-1967/",
      "fileSize": 1068398234,
      "addedAt": "2026-01-07T00:12:10.592Z",
      "thumbnail": "https://archive.org/services/img/the-long-duel-1967",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 121
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "115 min",
    "imdbRating": 5.9,
    "imdbVotes": 735,
    "Genre": "Action, Adventure, Drama",
    "Plot": "Superintendent Stafford of the United Provinces Police, has his men arrest an entire tribe on vague allegations of poaching and theft in British India. Their leader, Sultan, father of a young boy, Munnu, whose wife, Tara, is expecting their second child, is also arrested and held in a cell with criminals in Fort Najibabad. Sultan, Tara, and many others manage to break out, but Tara and the newborn both pass away. Sultan, with the help of his men, decides to revolt against the oppressive British - who create a mobile unit, led by Freddy Young, to counter this revolt as well as announce a reward of Rs.500.00 - but Sultan manages to elude them. Then amidst clashes between Freddy and Stafford, and the entry of Jane Stafford, it is made known that Sultan's tribe will be transported by train to a compound in Delhi. This news reaches Sultan and he prepares to attack the train and free his people - little knowing the trap he and his men will soon be walking in to.",
    "Director": "Ken Annakin",
    "Writer": "Peter Yeldham, Ranveer Singh, Ernest Borneman",
    "Actors": "Yul Brynner, Trevor Howard, Harry Andrews",
    "Language": "English, Hindi",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0060261",
    "tt0063060",
    "tt0060588",
    "tt0060862",
    "tt0064615",
    "tt0066987",
    "tt0065150",
    "tt0073511",
    "tt0065374",
    "tt0060897",
    "tt0178515",
    "tt0067216"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}