{
  "imdbId": "tt0047610",
  "title": "El tren expreso",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-tren-expreso-1955",
      "id": "el-tren-expreso-1955",
      "title": "El Tren Expreso (1955)",
      "description": "El Tren Expreso  fue el primer largometraje español dirigido y guionado por de  León Klimovsky  Dulfán. El guion fue producido basándose en el poema de  Ramón de Campoamor , el cual fue utilizado como argumento. Los diálogos adicionales fueron creados por Luis Fernando Igoa. Esta película fue producida en 1954 en España y se estrenó el 23 de mayo de 1955. Fue filmada con un formato negativo de 35 milímetros y fue emulsionada en blanco y negro. Aunque en su registro oficial está acreditada como una producción exclusiva de Unión Films (compañía de  Eduardo Manzanos ), en algunas filmografías aparece con una coproducción hispano-argentina. (Wikipedia) Sinopsis Mario es un célebre concertista de piano afectado por una  neurosis  obsesiva. Se va de París, anula sus contratos y vuelve a España para dedicarse solamente a la música. En un tren conoce a una joven viuda, que por desgraciados temas matrimoniales intenta suicidarse. Mario la socorre cuando ella trata de arrojarse del tren en marcha. Reparto Jorge Mistral Laura Hidalgo Evangelina Elizondo Manuel Monroy Juan Calvo Rafael Bardem Amelia de la Torre Matilde Muñoz Sampedro Carlos Díaz de Mendoza Luis Domínguez Luna",
      "fileSize": 1169837612,
      "addedAt": "2026-01-07T00:08:15.379Z",
      "thumbnail": "https://archive.org/services/img/el-tren-expreso-1955",
      "language": "spa",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 56
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "92 min",
    "imdbRating": 3.4,
    "imdbVotes": 13,
    "Genre": "Drama",
    "Plot": "N/A",
    "Director": "León Klimovsky",
    "Writer": "Eduardo Borrás, León Klimovsky, Ramón de Campoamor",
    "Actors": "Laura Hidalgo, Jorge Mistral, Manuel Monroy",
    "Language": "Spanish",
    "Country": "Argentina, Spain",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0153331",
    "tt0190048",
    "tt0127017",
    "tt0178312",
    "tt0186380",
    "tt0184223",
    "tt0199395",
    "tt0047178",
    "tt4887484",
    "tt0047878",
    "tt0047900",
    "tt0047934"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.379Z"
}