{
  "imdbId": "tt0014606",
  "title": "White Tiger",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MyMovie_20181217",
      "title": "\"White Tiger\" (1923) director Tod Browning",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"White Tiger\" is a crime drama. A band of crooks gets away with a robbery, but then its members turn on each other. Directed by               Tod Browning Produced by             Universal Film Manufacturing Company Scenario by               Tod Browning and Charles Kenyon Based on                    the screen story by Tod Browning Starring                     Priscilla Dean, Wallace Beery, Raymond Griffith, Matt Moore, Alfred Allen Cinematography        William Fildew Distributed by           Universal Film Manufacturing Company Release date               December 17, 1923 Running time             81 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 1569068547,
      "id": "MyMovie_20181217"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-white-tiger",
      "title": "White Tiger",
      "fileSize": 1119342252,
      "id": "silent-white-tiger"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/whitetiger4k",
      "title": "White Tiger (1923) [Colorized, 4K, 60FPS]",
      "description": "White Tiger is a 1923 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6996277976,
      "id": "whitetiger4k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ThNJeNjkFLA",
      "title": "White Tiger (1923) Crime, Drama, Mystery, Silent Film",
      "description": "Three crooks pull off a magnificent crime. As they're forced to hide out together they slowly begin to distrust each other.\n\nDirector: Tod Browning\nWriters: Tod Browning, Charles Kenyon\nStars: Priscilla Dean, Matt Moore, Raymond Griffith\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "ThNJeNjkFLA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cNEjYRlluj0",
      "title": "White Tiger (1923) | Colorized Public Domain Silent Crime Thriller by Tod Browning",
      "description": "White Tiger (1923) is a silent crime drama directed by Tod Browning, the filmmaker who later created Dracula (1931) and Freaks (1932). This restored and colorized public domain classic brings back an early thriller that combines mystery, gangsters, and mechanical illusions, showcasing Browning’s fascination with deception and criminal psychology. Featuring stars Priscilla Dean, Wallace Beery, Raymond Griffith, and Matt Moore, the film blends suspense with early cinematic tricks, making it a fascinating look at crime drama in the silent era.\n\nPlot Summary:\nThe story follows a gang of international criminals led by Sylvia (Priscilla Dean), a woman entangled in a world of deception and betrayal. Partnered with the sinister gangster Harvey (Wallace Beery) and the clever con man Roy (Raymond Griffith), Sylvia becomes involved in a scheme centered around a mechanical chess-playing automaton used to commit robbery and fraud.\n\nTheir plot unfolds in a gloomy European setting, where crime, disguise, and betrayal are the tools of survival. When an American adventurer, Dick Longworth (Matt Moore), crosses paths with Sylvia, he becomes both her love interest and her potential savior. As double-crosses mount and loyalties collapse, Sylvia must decide between loyalty to her criminal partners and a chance at redemption.\n\nThe climax reveals Browning’s signature fascination with trickery and mechanical illusions, elements he would perfect in later works.\n\nCast and Crew:\n• Director: Tod Browning\n• Writer: Tod Browning (story), Joseph Farnham (titles)\n• Cinematography: William Fildew\n\nStarring:\n• Priscilla Dean as Sylvia\n• Wallace Beery as Harvey\n• Raymond Griffith as Roy\n• Matt Moore as Dick Longworth\n• John Davidson as The Hindu\n\nFilm Significance:\nWhite Tiger is notable for showcasing Tod Browning’s recurring themes of crime, illusion, and betrayal, which would later define his best-known films. The mechanical chess automaton is a centerpiece of the story, symbolizing both deception and the blending of stage illusion with cinema.\n\nPriscilla Dean, one of Universal’s biggest silent stars of the early 1920s, gives a powerful performance as a conflicted woman caught between crime and conscience. Wallace Beery, who would later become an MGM star and Academy Award winner, appears here in one of his many villainous early roles. The film’s atmosphere, suspense, and use of trick effects make it a fascinating silent thriller that foreshadows Browning’s later Gothic masterpieces.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like White Tiger remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1923 release was silent and black and white, relying on intertitles and early effects to tell its story. While authentic, many modern audiences overlook silent black-and-white films. By restoring and colorizing this edition, we bring out the suspense, atmosphere, and visual richness of Tod Browning’s early crime drama. This approach makes the film more immersive for today’s audiences while preserving its historical significance.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including crime dramas, silent thrillers, and legendary works by Hollywood’s most important directors. Our mission is to preserve and share these treasures with audiences in the USA, Europe, and worldwide.\n\n#WhiteTiger1923 #TodBrowning #PriscillaDean #WallaceBeery #SilentFilm #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentThriller #FilmRestoration",
      "id": "cNEjYRlluj0",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "86 min",
    "imdbRating": 6.1,
    "imdbVotes": 270,
    "Genre": "Drama",
    "Plot": "Sylvia Donovan, Roy Donovan, and \"Count Donelli\" are three international crooks who come to America. Sylvia and Roy are unaware that they are brother and sister. The three cooperate to rob wealthy homes by using a gimmick known as a chess-playing machine. Eventually, Sylvia and Roy learn that they are brother and sister and that \"Count Donelli,\" alias Hawkes, killed their father. The detective and Sylvia fall in love.",
    "Director": "Tod Browning",
    "Writer": "Tod Browning, Charles Kenyon",
    "Actors": "Priscilla Dean, Matt Moore, Raymond Griffith",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0013719",
      "title": "Under Two Flags",
      "year": 1922,
      "imdbRating": 6.7,
      "imdbVotes": 31,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016473",
      "title": "The Unholy Three",
      "year": 1925,
      "imdbRating": 7.1,
      "imdbVotes": 2348,
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0010890",
      "title": "The Wicked Darling",
      "year": 1919,
      "imdbRating": 6.4,
      "imdbVotes": 474,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016142",
      "title": "The Mystic",
      "year": 1925,
      "imdbRating": 6.7,
      "imdbVotes": 489,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018528",
      "title": "The Unknown",
      "year": 1927,
      "imdbRating": 7.7,
      "imdbVotes": 9487,
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0018697",
      "title": "The Big City",
      "year": 1928,
      "imdbRating": 6.9,
      "imdbVotes": 92,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022913",
      "title": "Freaks",
      "year": 1932,
      "imdbRating": 7.8,
      "imdbVotes": 53322,
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019563",
      "title": "West of Zanzibar",
      "year": 1928,
      "imdbRating": 7.2,
      "imdbVotes": 2019,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0022002",
      "title": "The Iron Man",
      "year": 1931,
      "imdbRating": 5.8,
      "imdbVotes": 348,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020492",
      "title": "The Thirteenth Chair",
      "year": 1929,
      "imdbRating": 5.7,
      "imdbVotes": 745,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027521",
      "title": "The Devil-Doll",
      "year": 1936,
      "imdbRating": 7,
      "imdbVotes": 5320,
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020581",
      "title": "Where East Is East",
      "year": 1929,
      "imdbRating": 6.6,
      "imdbVotes": 710,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}