{
  "imdbId": "tt0026563",
  "title": "Kentucky Blue Streak",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kentucky_blue_streak1935",
      "id": "kentucky_blue_streak1935",
      "title": "Kentucky Blue Streak",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 3812154266,
      "addedAt": "2026-01-07T00:09:16.000Z",
      "thumbnail": "https://archive.org/services/img/kentucky_blue_streak1935",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 66200
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1J7h0RAWbz8",
      "id": "1J7h0RAWbz8",
      "title": "Kentucky Blue Streak (1935) HORSE RACE DRAMA",
      "description": "Stars: Edward J. Nugent, Frank Coghlan Jr., Patricia Scott\n Director: Bernard B. Ray\n\n In this crime drama, a jockey, wrongfully imprisoned for riding at an \"illegal\" racetrack, escapes from prison just prior to his parole so he can ride Blue Streak in the Kentucky Derby.",
      "addedAt": "2025-12-26T23:50:11.759Z",
      "thumbnail": "https://i.ytimg.com/vi/1J7h0RAWbz8/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB7gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLBL5GFZG_Loyu3XBRXyzq7QMhkNxg",
      "duration": 3553,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "60 min",
    "imdbRating": 4,
    "imdbVotes": 44,
    "Genre": "Action, Crime, Drama",
    "Plot": "Mary Bradley leaves her family's farm in Cloverdale, Kentucky to visit her brother Johnny, a jockey, in San Francisco. Their reunion is interrupted by Harry Johnson, who tries to convince Johnny to ride in the illegal race at the Pagona fair. After Mary and Johnny learn that the colt Mary brought to California to sell has broken a leg, Johnny agrees to go along with Harry's scheme. After Harry is shot, Johnny is arrested on the belief that he wanted to stop Harry from blackmailing him. Although he is innocent, Johnny agrees to a plea bargain under the alias Barnsdale so that he will not disgrace his family. A reporter, Marty Marion, who is investigating the racetrack rackets, helps Johnny obtain a work release. Meanwhile in Kentucky, Mary prepares to enter her horse, Blue Streak, in the Kentucky Derby. With the family farm already heavily mortgaged, Mary appeals to District Attorney Barton Pierce to pay the race entrance fee. Johnny reads about the approaching Derby and escapes prison to attend the race, but Marty has anticipated Johnny's reaction. In Kentucky, Marty gains admittance to a Derby ball, and when Barton sees Marty with Mary, he becomes jealous. Later, to increase his horse's odds, Barton spreads a rumor that Johnny will be his jockey for the Derby, but plans to have him arrested before the race begins. On the day of the race, Marty discovers Barton's scheme and is able to stop him. Johnny rides Blue Streak to a first-place finish, and Marty shows him a telegram sent from California. Harry's murderer has confessed, and Marty tells Johnny he may keep the telegram as the first memento from his future brother-in-law.",
    "Director": "Raymond K. Johnson",
    "Writer": "Homer King Gordon, Rose Gordon, Edward O'Brien",
    "Actors": "Edward J. Nugent, Patricia Scott, Frank Coghlan Jr.",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027008",
    "tt0033822",
    "tt0027057",
    "tt0029596",
    "tt0182242",
    "tt0026458",
    "tt0026206",
    "tt0026259",
    "tt0029544",
    "tt0026937",
    "tt0027354",
    "tt0027406"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:16.000Z"
}