{
  "movieId": "tt0001105",
  "title": "The Woman Always Pays",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-woman-always-pays",
      "id": "silent-the-woman-always-pays",
      "title": "The Woman Always Pays",
      "fileSize": 642548351,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-the-woman-always-pays",
      "language": "Danish",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 708
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "38 min",
    "imdbRating": 6.4,
    "imdbVotes": 1038,
    "Genre": "Short, Drama",
    "Plot": "At a tramcar in Copenhagen the piano teacher Magda Vang meets the young man Knud Svane, who falls in love with her. She is invited to spend the summer with him and his parents at the vicarage in Gjerslev. Outside the vicarage a circus troupe passes by, and Magda is saluted by the performer Rudolph Stern. In the night Rudolph climbs a ladder to Magda's bedroom. She tries to flee his advances, but after a hot kiss she surrenders, and runs away with him. Magda is hired as a dancer with Rudolph at the Empire Varieté. When Rudolph fondles a ballet dancer Magda gets furious, and starts a fight in front of the audience. Magda and Rudolph are fired. To earn some money Rudolph forces Magda to play the piano in a band at a garden restaurant. Knud turns up and recognizes her. Incognito he asks her for a private meeting. Magda thinks she is asked to sell her body and refuses, but Rudolph forces her to go. When Rudloph after a while interrupts and finds Magda with Knud, he gets furious and starts to beat her. During the turmoil she grabs a knife and stabs Rudolph in his chest. In her despair she clings to his dead body, and has to be taken away by force.",
    "Director": "Urban Gad",
    "Writer": "Urban Gad",
    "Actors": "Asta Nielsen, Robert Dinesen, Poul Reumert",
    "Language": "None, Danish",
    "Country": "Denmark",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001892",
    "tt0001265",
    "tt0001431",
    "tt0001150",
    "tt0258254",
    "tt0001118",
    "tt0001544",
    "tt0001207",
    "tt0001326",
    "tt0001245",
    "tt0001262",
    "tt0001283"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}