{
  "imdbId": "tt0020884",
  "title": "Fighting Thru; or, California in 1878",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FightinThru1930",
      "id": "FightinThru1930",
      "title": "Fighting Thru; or, California in 1878",
      "description": "Title: Fighting Thru; or, California in 1878 Summary: Dan and Tennessee are successful gold miners. Ace Brady learns of their success and sends Fox to rob them. During the robbery Fox shoots Tennessee and Ace arrives to arrest Dan for the murder. Dan escapes but is now a wanted man. Directed by: William Nigh Actors: Ken Maynard, Jeanette Loff, Wallace MacDonald Production Company: Tiffany Productions Release Date: 25 December 1930 (USA) Aspect Ratio: 1.37 : 1 Miner Dan Barton (Ken Maynard) and his partner George Malden, known as \"Tennessee\", have hit a strike on their claim, and Dan returns to their cabin to find that Malden has departed to meet his sister, Alice (Jeanette Loff), who is arriving on the stage from Tennessee to join her brother. Dan knows that Malden has a weakness for drink, gambling and girls and follows him to town, where he finds him playing cards with gamblers Fox Tyson (Charles King) and saloon owner Ace Brady (William Thorne) who, with the aid of bar girl Queenie (Carmelita Geraghty), are well on their way to cheating him out of his share of the claim. Dan puts the stop to that, but Malden is killed by Tyson and Dan is framed for the killing. He escapes and saves Alice from a stagecoach disaster, and takes her to his and Malden's cabin, but doesn't let her know he is wanted for the death of her brother. But Ace and Tyson quickly inform her, and are well on their way to getting all of the Barton/Malden gold mine. The ...",
      "fileSize": 435084811,
      "addedAt": "2026-01-07T00:06:25.399Z",
      "thumbnail": "https://archive.org/services/img/FightinThru1930",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 1062
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "61 min",
    "imdbRating": 5.7,
    "imdbVotes": 51,
    "Genre": "Western",
    "Plot": "Miner Dan Barton (Ken Maynard) and his partner George Malden, known as \"Tennessee\", have hit a strike on their claim, and Dan returns to their cabin to find that Malden has departed to meet his sister, Alice (Jeanette Loff), who is arriving on the stage from Tennessee to join her brother. Dan knows that Malden has a weakness for drink, gambling and girls and follows him to town, where he finds him playing cards with gamblers Fox Tyson (Charles King) and saloon owner Ace Brady (William Thorne) who, with the aid of bar girl Queenie (Carmelita Geraghty), are well on their way to cheating him out of his share of the claim. Dan puts the stop to that, but Malden is killed by Tyson and Dan is framed for the killing. He escapes and saves Alice from a stagecoach disaster, and takes her to his and Malden's cabin, but doesn't let her know he is wanted for the death of her brother. But Ace and Tyson quickly inform her, and are well on their way to getting all of the Barton/Malden gold mine. The two songs are \"Wait for the Wagon\" and \"Oh, Susanna.\" Other than being filmed under the working title of \"California in 1878\", which was also the title of Jack Natteford's original story,and then getting sold to TV in 1949 and having the title changed, there are no other alternative titles on this film. Two alternative spellings are shown by some sources---fighting for fightin' and through for thru---but those are typos created by two different trade paper reviewers in 1930.Accuracy regarding B-western titles was not a sticky point with the trade papers of the day.There are several versions of this story, including a Maynard remake called \"Fargo Express\" and Reliable Pictures used the story for Bob Steele's \"The Pal from Texas.\"",
    "Director": "William Nigh",
    "Writer": "Jack Natteford",
    "Actors": "Ken Maynard, Jeanette Loff, Wallace MacDonald",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023703",
    "tt0022705",
    "tt0029122",
    "tt0039771",
    "tt0038971",
    "tt0038340",
    "tt0038552",
    "tt0021694",
    "tt0023344",
    "tt0022514",
    "tt0021597",
    "tt0019811"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}