{
  "imdbId": "tt0037701",
  "title": "First Yank Into Tokyo",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/appointment-in-tokyo-1945",
      "id": "appointment-in-tokyo-1945",
      "title": "Appointment in Tokyo (1945)",
      "description": "Produced by the Army Pictorial Service, Signal Corps, with the cooperation of the Army Air Forces and the United States Navy, and released by Warner Bros. for the War Activities Committee shortly after the surrender of Japan. Follow General Douglas MacArthur and his men from their exile from the Philippines in early 1942, through the signing of the instrument of surrender on the USS Missouri on September 1, 1945. Watch on RetroFlix:  https://retroflix.org/appointment-in-tokyo-1945/",
      "fileSize": 340520506,
      "addedAt": "2026-01-07T00:07:25.000Z",
      "thumbnail": "https://archive.org/services/img/appointment-in-tokyo-1945",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 122
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ApptInTokyo",
      "id": "ApptInTokyo",
      "title": "Appointment in Tokyo",
      "description": "Title: Appointment in Tokyo Summary: Produced by the Army Pictorial Service, Signal Corps, with the cooperation of the Army Air Forces and the United States Navy, and released by Warner Bros. for the War Activities Committee, ... Directed by: Jack Hively Actors: Douglas MacArthur, Chester W. Nimitz, Jonathan M. Wainwright. Produced by the Army Pictorial Service Production Company: U.S. Army Pictorial Services Release Date: 7 December 1945 (USA) Aspect Ratio: 1.37 : 1 Color: Black and White Produced by the Army Pictorial Service, Signal Corps, with the cooperation of the Army Air Forces and the United States Navy, and released by Warner Bros. for the War Activities Committee, Motion Picture Industry, \"Appointment in Tokyo\" is the film story of four years of Pacific war detailing the history of the defeat of Japan. The path traces across the Pacific from Corregidor in 1942, General Wainwright's surrender, the Death March, Australia in peril, the turning points of Naval victory in the Coral Sea, land victory at Guadalcanal, and air victory over a giant Japanese convoy in the Bismarck Sea. Vast armies are marshaled in the Philippines as the Marines take Iwo Jima, and combined Army, Navy and Marine forces take Okinawa.",
      "fileSize": 389318498,
      "addedAt": "2026-01-07T00:06:09.635Z",
      "thumbnail": "https://archive.org/services/img/ApptInTokyo",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 1364
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "82 min",
    "imdbRating": 5.4,
    "imdbVotes": 264,
    "Genre": "Action, Drama, Romance",
    "Plot": "An American agent undergoes plastic surgery to make him look Japanese so he can infiltrate Japan and help to free an American POW.",
    "Director": "Gordon Douglas",
    "Writer": "J. Robert Bren, Gladys Atwater",
    "Actors": "Tom Neal, Barbara Hale, Marc Cramer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0053399",
    "tt0037409",
    "tt0037253",
    "tt0036449",
    "tt0059252",
    "tt0050204",
    "tt0040502",
    "tt0038478",
    "tt0033399",
    "tt0041179",
    "tt0041841",
    "tt0028592"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:25.000Z"
}