{
  "imdbId": "tt0029855",
  "title": "Algiers",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Algiers_",
      "title": "Algiers",
      "description": "Gaby (Hedy Lamarr) arrives in Algiers engaged to a fat, vulgar borderline-loathsome older man who clearly regards her as a trophy bought and paid for. Why she needed this creep isn't clear. What is clear is her falling in love with the jewel thief Pepe Le Moko (Charles Boyer) who abandons the devoted and clinging Ines (Sigrid Gurie) for this right-off-the-boat hothouse beauty. A Parisian police official (Walter Kingsford) is in Algiers determined to collar Pepe. His forays into the casbah meet with no success and quiet derision from both the locals and some of the French police who understand that the casbah is honeycombed with escape routes and populated with folks eager to thwart the gendarmerie.",
      "id": "Algiers_"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/algiers-1938_202312",
      "title": "Algiers (1938)",
      "description": "Pepe Le Moko is a notorious thief, who escaped from France. Since his escape, Moko has become a resident and leader of the immense Casbah of Algiers. French officials arrive insisting on Pepe's capture are met with unfazed local detectives, led by Inspector Slimane, who are biding their time. Meanwhile, Pepe meets the beautiful Gaby, which arouses the jealousy of Ines. Watch on RetroFlix:  https://retroflix.org/algiers-1938/",
      "id": "algiers-1938_202312"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/algiers-1938_202503",
      "title": "Algiers (1938)",
      "description": "Pepe Le Moko is a notorious thief, who escaped from France. Since his escape, Moko has become a resident and leader of the immense Casbah of Algiers. French officials arrive insisting on Pepe's capture are met with unfazed local detectives, led by Inspector Slimane, who are biding their time. Meanwhile, Pepe meets the beautiful Gaby, which arouses the jealousy of Ines. Watch on RetroFlix:  https://retroflix.org/algiers-1938-2/",
      "id": "algiers-1938_202503"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/algiers-pnm",
      "title": "Algiers (1938) [P&M] 99 min AVI (700MB)",
      "description": "Note: Although some higher-res and smoother-looking versions exist, based on my comparisons this seems to be the file that they're all based off of, and you'll likely get a better picture by upscaling and filtering this file, yourself, than you'll find elsewhere, if that's your thing! In other words, some other derivatives may look SUBJECTIVELY better than this, but they're all lossy versions of this file. For the P&M collection, I scour the web for the highest fidelity uploads of films, whether that be here on the Archive, elsewhere on the web, on bittorrent or even YouTube. Once I've painstakingly compared every download that I could get my hands on, I upload the best one so that no one else needs to go through that struggle to be sure they're getting the highest possible fidelity. These are often much larger files than what are typically on the Archive, but, if you're like me, this may be no issue for you.",
      "id": "algiers-pnm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OwRDsCGCvTk",
      "title": "Algiers (1938) [Drama] [Mystery] [Romance]",
      "description": "\"Algiers\" is a 1938 American drama film directed by John Cromwell and starring Charles Boyer, Sigrid Gurie, and Hedy Lamarr. Written by John Howard Lawson, the film is about a notorious French jewel thief hiding in the labyrinthine native quarter of Algiers known as the Casbah. Feeling imprisoned by his self-imposed exile, he is drawn out of hiding by a beautiful French tourist who reminds him of happier times in Paris. The Walter Wanger production was a remake of the successful 1937 French film Pépé le Moko, which derived its plot from the Henri La Barthe novel of the same name. \"Algiers\" was a sensation because it was the first Hollywood film starring Hedy Lamarr, whose stunning beauty became the main feature for film audiences. The film is notable as one of the sources of inspiration to the screenwriters of the 1942 Warner Bros. film Casablanca who wrote it with Hedy Lamarr in mind as the original female lead. According to the Turner Classic Movie channel, Charles Boyer's depiction of the main character, Pepe Le Moko, was the inspiration for the Warner Bros. animated character, Pepe Le Pew. \n\nPepe Le Moko (Boyer) is a notorious thief, who escaped from France after his last great heist to Algeria. Since his escape, Moko became a resident and leader of the immense Casbah, or \"native quarter,\" of Algiers. French officials arrive insisting on Pepe's capture are met with unfazed local detectives, led by Inspector Slimane (Calleia), who are biding their time. Meanwhile, Pepe begins to feel increasingly trapped in his prison-like stronghold, a feeling which intensifies after meeting the beautiful Gaby (Lamarr), who is visiting from France. His love for Gaby soon arouses the jealousy of Ines (Gurie), Pepe's Algerian mistress.\n\n---\n\nDirected by John Cromwell, produced by Walter Wanger, written by James M. Cain \nand John Howard Lawson, starring Charles Boyer as Pepe le Moko. Sigrid Gurie as Ines, Hedy Lamarr as Gaby, Joseph Calleia as Inspector Slimane, Alan Hale as Grandpere, Gene Lockhart as Regis, Walter Kingsford as Chef Inspector Louvain, Paul Harvey as Commissioner Janvier, Stanley Fields as Carlos, Johnny Downs as Pierrot, Charles D. Brown as Max, Robert Greig as Giraux, Leonid Kinskey as L'Arbi, Joan Woodbury as Aicha\nand Nina Koshetz as Tania. \n\n---\n\nSource: \"Algiers (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 18 March 2013. Web. 20 April 2013. http://en.wikipedia.org/wiki/Algiers_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "OwRDsCGCvTk",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NPOGNOL8k9g",
      "title": "Algiers (1938) | Colorized Public Domain Classic Film Noir with Charles Boyer & Hedy Lamarr",
      "description": "Algiers (1938) is a crime-romance drama directed by John Cromwell and adapted from the French classic Pépé le Moko (1937). This colorized public domain edition revives a landmark film from Hollywood’s Golden Age, remembered for its atmospheric setting in the Casbah of Algiers and for introducing the world to Austrian actress Hedy Lamarr in her American film debut. With Charles Boyer’s magnetic performance as the fugitive antihero and Lamarr’s enigmatic allure, this restored version makes one of the most stylish pre-war dramas accessible to modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story follows Pépé le Moko (Charles Boyer), a master thief who has found sanctuary in the labyrinthine Casbah of Algiers. Protected by its winding streets and loyal underworld network, Pépé is untouchable by the authorities who long to arrest him. Yet this life of forced exile wears on him, leaving him trapped between power and imprisonment. His fate begins to shift when he meets Gaby (Hedy Lamarr), a glamorous Parisian woman visiting Algiers. Unlike the women of the Casbah, Gaby represents sophistication, freedom, and the allure of a life beyond crime. Their intense, romantic connection places Pépé in grave danger, as Inspector Slimane (Joseph Calleia) patiently watches and waits for his opportunity to strike. Torn between loyalty to his world and the dream of escape with Gaby, Pépé’s choices lead to a dramatic and tragic conclusion.\n\nCast and Crew:\n• Director: John Cromwell\n• Producers: Walter Wanger\n• Screenplay: John Howard Lawson, adapted from Henri La Barthe’s novel Pépé le Moko\n• Cinematography: James Wong Howe\n• Editing: Al Clark, Arthur Schmidt\n• Music: Vincent Scotto, Hugo Riesenfeld\n\nStarring:\n• Charles Boyer as Pépé le Moko\n• Hedy Lamarr as Gaby\n• Sigrid Gurie as Ines\n• Joseph Calleia as Inspector Slimane\n• Alan Hale as Grandpere\n• Gene Lockhart as Regis\n• Walter Kingsford as Commissioner Louvain\n\nFilm Significance:\nAlgiers is remembered not only for its gripping story but also for shaping the archetype of romanticized gangsters in Hollywood. Charles Boyer’s portrayal of Pépé influenced later characters such as Humphrey Bogart’s Rick in Casablanca (1942). The film also made Hedy Lamarr an international star, launching her American career after her controversial European film Ecstasy (1933). With atmospheric cinematography by James Wong Howe, the film is a textbook example of Hollywood’s early embrace of poetic realism and proto-film noir aesthetics. Its legacy lives on as a cultural touchstone, echoing through decades of American crime dramas and romantic tragedies.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Algiers remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1938 release was black and white, capturing the shadows and intrigue of the Casbah. While visually striking, many modern audiences often bypass black-and-white films. By offering a colorized edition, this restoration bridges the gap between historic authenticity and modern preferences. Viewers can rediscover Charles Boyer and Hedy Lamarr in vivid color, with details of costume, set design, and atmosphere now enhanced to match contemporary viewing standards.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, ranging from celebrated dramas to hidden gems. Our mission is to preserve cinematic history while keeping it relevant for today’s audiences in the USA, Europe, and worldwide.\n\n#Algiers1938 #CharlesBoyer #HedyLamarr #PublicDomainMovie #ColorizedClassic #FilmNoir #ClassicHollywood #CasbahDrama #GoldenAgeCinema #RestoredMovie",
      "id": "NPOGNOL8k9g",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Bu9iCkSkxR4",
      "title": "Algiers (1938), starring Charles Boyer and Hedy Lamarr",
      "id": "Bu9iCkSkxR4",
      "channelName": "Public Domain Movies - Classic Old Movies",
      "channelId": "UCT6gOjzXtqeb_oE-wZVHlFA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Algiers_868",
      "title": "Algiers",
      "description": "\"Algiers\" is a romantic mystery starring Charles Boyer and Hedy Lamarr. It's a 1938 Hollywood remake of the 1937 French film \"Pepe le Moko\" with Jean Gabin. Pepe (Boyer) is a notorious thief who has escaped from France and hides in the Casbah of Algiers. The French officials are after him, but he is protected by the local police. Boyer and Lamarr are attractive, and in one scene Boyer sings \"C'est la vie\" to his neighbours. See: http://en.wikipedia.org/wiki/Algiers_%28film%29",
      "id": "Algiers_868"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QXC5rSf9FG8",
      "title": "Algiers (1938) HEDY LAMARR",
      "description": "Stars: Charles Boyer, Hedy Lamarr, Alan Hale\nDirector: John Cromwell\n\nIn this classic love story, an alluring tourist steals the heart of an infamous master thief but puts his life at risk when his mistress betrays him to the French authorities. Nominated for four Academy Awards including Best Actor and Best Cinematography!",
      "id": "QXC5rSf9FG8",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/algiers-1938-colorized",
      "title": "Algiers 1938 Colorized",
      "description": "From IMDB: Beautiful Gaby meets a romantic jewel thief in the mysterious Casbah. https://www.imdb.com/title/tt0029855/reference Public Domain movie. Colorized using neural AI (DeOldify technology). (Note: Although this movie is public domain, the colorization is copyright by me. My colorized movies are freely uploaded for free personal use. Please don't put them on your own YouTube channel and monetize them. Thanks.)",
      "id": "algiers-1938-colorized"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/algiers-1983-colorized-movie-576p-sd",
      "title": "Algiers (colorized) (1938, crime, imdb score: 6.6)",
      "description": "Algiers is a 1938 American crime drama film directed by John Cromwell , written by John Howard Lawson and starring Charles Boyer , Sigrid Gurie and Hedy Lamarr . The plot concerns a French jewel thief hiding in Algiers who meets a beautiful French tourist. The Walter Wanger production (originally distributed by United Artists ) was a remake of the successful 1937 French film Pépé le Moko , which derived its plot from the Henri La Barthe novel of the same name. Algiers became a sensation because it was Lamarr's Hollywood debut. The film is notable as a source of inspiration to the screenwriters of the 1942 Warner Bros. film Casablanca , who wrote the later film with Lamarr in mind as the original female lead. Boyer's depiction of Pepe le Moko inspired the Warner Bros. animated character Pepé Le Pew . In 1966, the film entered the public domain in the United States because the claimants did not renew its copyright registration in the 28th year after publication.",
      "id": "algiers-1983-colorized-movie-576p-sd"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "96 min",
    "imdbRating": "6.6",
    "imdbVotes": "3,341",
    "Genre": "Drama, Mystery, Romance",
    "Plot": "Pepe Le Moko, a thief who escaped from France with a fortune in jewels, has for two years lived in, and virtually ruled, the mazelike, impenetrable Casbah, \"native quarter\" of Algiers. A French official insists that he be captured, but sly Inspector Slimane knows he need only bide his time. The suave Pepe increasingly regards his stronghold as also his prison, especially when he meets beautiful Parisian visitor Gaby, who reminds him of the boulevards to which he dare not return...and arouses the mad jealousy of Ines, his Algerian mistress.",
    "Director": "John Cromwell",
    "Writer": "John Howard Lawson, James M. Cain, Henri La Barthe",
    "Actors": "Charles Boyer, Hedy Lamarr, Sigrid Gurie",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 4 Oscars. 1 win & 5 nominations total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0031602",
      "title": "Made for Each Other",
      "year": 1939,
      "imdbRating": "6.2",
      "imdbVotes": "4,172",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027331",
      "title": "Banjo on My Knee",
      "year": 1936,
      "imdbRating": "6.2",
      "imdbVotes": "660",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030727",
      "title": "Secrets of an Actress",
      "year": 1938,
      "imdbRating": "6.2",
      "imdbVotes": "439",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032077",
      "title": "Undercover Doctor",
      "year": 1939,
      "imdbRating": "6.2",
      "imdbVotes": "38",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025586",
      "title": "Of Human Bondage",
      "year": 1934,
      "imdbRating": "7.0",
      "imdbVotes": "8,650",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035360",
      "title": "Son of Fury: The Story of Benjamin Blake",
      "year": 1942,
      "imdbRating": "7.1",
      "imdbVotes": "1,888",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032976",
      "title": "Rebecca",
      "year": 1940,
      "imdbRating": "8.1",
      "imdbVotes": "160,202",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026124",
      "title": "Black Sheep",
      "year": 1935,
      "imdbRating": "6.8",
      "imdbVotes": "414",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024989",
      "title": "The Clairvoyant",
      "year": 1935,
      "imdbRating": "6.6",
      "imdbVotes": "1,252",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031593",
      "title": "Love Affair",
      "year": 1939,
      "imdbRating": "7.3",
      "imdbVotes": "6,880",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031863",
      "title": "Rio",
      "year": 1939,
      "imdbRating": "6.1",
      "imdbVotes": "198",
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035378",
      "title": "Stand by All Networks",
      "year": 1942,
      "imdbRating": "5.6",
      "imdbVotes": "86",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T18:50:17.135Z"
}