{
  "movieId": "tt0066049",
  "title": "A Man Called Horse",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-man-called-horse-1970",
      "id": "a-man-called-horse-1970",
      "title": "A Man Called Horse (1970)",
      "description": "A Man Called Horse is a 1970 Western film directed by Elliot Silverstein, produced by Sandy Howard, and written by Jack DeWitt. The film follows  an English aristocrat named John Morgan is captured by a Sioux tribe in the 1820s and initially treated like an animal. As he endures harsh treatment and learns the tribe's customs, he gains their respect, ultimately becoming a warrior and leader within the tribe.",
      "fileSize": 1117523245,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-man-called-horse-1970",
      "language": "eng",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 311
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "114 min",
    "imdbRating": 6.8,
    "imdbVotes": 9898,
    "Genre": "Adventure, Drama, Western",
    "Plot": "During the early 1800s, English Lord John Morgan (Richard Harris) is hunting in the Dakotas, but he is captured by a group of Sioux warriors. Morgan's guides are killed, but he is spared by Sioux Chief Yellow Hand (Manu Tupou), who marvels at Morgan's blond hair. Brought to Yellow Hand's tribal village, Morgan has to endure physical abuse and mockery at the hands of women and children who consider him to be a wild horse. Restrained by a rope around his neck, Morgan is given as a gift to an old squaw, Buffalo Cow Head (Dame Judith Anderson), to be her slave and help her with daily chores. In the village, Morgan meets Running Deer (Corinna Tsopei), the beautiful young sister of Chief Yellow Hand. Morgan witnesses the traditional courtship process when Running Deer is asked in marriage by a tribe member who presents Yellow Hand with gifts in return for his sister's hand in marriage. Morgan starts to fall in love with her. Also in the village is half-breed, Batise (Jean Gascon), whose mother was Sioux and father was French. Batise becomes Morgan's friend and interpreter. Batise advises Morgan against escaping citing his own escape attempt when he was re-captured and hamstrung by the savage Sioux. Despite these warnings, Morgan tries to escape several times, but he is re-captured. He decides to bide his time for another escape opportunity. When a rival Shoshone war party approaches the Sioux village, Morgan kills two of the Shoshone scouts, winning the respect of his Sioux captors. Instead of escaping, Morgan plans to learn the ways of the Sioux, become a warrior, and gain his place amongst them. But this would require much more than killing a few Shoshone scouts. Lord John Morgan's true ordeal is just beginning.",
    "Director": "Elliot Silverstein",
    "Writer": "Jack DeWitt, Dorothy M. Johnson, Gregory Crosby",
    "Actors": "Richard Harris, Judith Anderson, Jean Gascon",
    "Language": "English, Sioux, French",
    "Country": "United States, Mexico",
    "Awards": "1 win & 2 nominations total"
  },
  "relatedMovies": [
    "tt0065988",
    "tt0063818",
    "tt0061832",
    "tt0062479",
    "tt0042383",
    "tt0032111",
    "tt0032959",
    "tt0197903",
    "tt0064093",
    "tt0046808",
    "tt1160018",
    "tt0066335"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}