{
  "imdbId": "tt0029542",
  "title": "The Shadow Strikes",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheShadowStrikes720p1937",
      "id": "TheShadowStrikes720p1937",
      "title": "The Shadow Strikes",
      "description": "Title: The Shadow Strikes Summary: Lamont Cranston assumes his secret identity as \"The Shadow\", to break up an attempted robbery at an attorney's office. When the police search the scene, Cranston must assume the identity of... Directed by: Lynn Shores Actors: Rod La Rocque, Agnes Anderson, James Blakeley Production Company: Colony Pictures Release Date: 29 October 1937 (USA) Aspect Ratio: 1.37 : 1 Lamont Cranston assumes his secret identity as \"The Shadow\", to break up an attempted robbery at an attorney's office. When the police search the scene, Cranston must assume the identity of the attorney. Before he can leave, a phone call summons the attorney to the home of Delthern, a wealthy client, who wants a new will drawn up. As Cranston meets with him, Delthern is suddenly shot, and Cranston is quickly caught up in a new mystery.",
      "fileSize": 722879445,
      "addedAt": "2026-01-07T00:07:05.036Z",
      "thumbnail": "https://archive.org/services/img/TheShadowStrikes720p1937",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 7443
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shadow_strikes",
      "id": "shadow_strikes",
      "title": "The Shadow Strikes",
      "fileSize": 2036863034,
      "addedAt": "2026-01-07T00:10:50.365Z",
      "thumbnail": "https://archive.org/services/img/shadow_strikes",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 25497
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-shadow-strikes-1937",
      "id": "the-shadow-strikes-1937",
      "title": "The Shadow Strikes (1937)",
      "description": "Lamont Cranston assumes his secret identity as \"The Shadow\", to break up an attempted robbery at an attorney's office. When the police search the scene, Cranston must assume the identity of the attorney. Before he can leave, a phone call summons the attorney to the home of Delthern, a wealthy client, who wants a new will drawn up. As Cranston meets with him, Delthern is suddenly shot, and Cranston is quickly caught up in a new mystery. Watch on RetroFlix:  https://retroflix.org/the-shadow-strikes-1937/",
      "fileSize": 386234744,
      "addedAt": "2026-01-07T00:12:22.159Z",
      "thumbnail": "https://archive.org/services/img/the-shadow-strikes-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 71
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the_shadow_strikes",
      "id": "the_shadow_strikes",
      "title": "The Shadow Strikes",
      "description": "Film based on the Street and Smith Magazine publication \"The Shadow\"",
      "fileSize": 1330754522,
      "addedAt": "2026-01-07T00:12:44.280Z",
      "thumbnail": "https://archive.org/services/img/the_shadow_strikes",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 57312
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KB3_jB-Kb2E",
      "id": "KB3_jB-Kb2E",
      "title": "The Shadow Strikes (1937) MYSTERY",
      "description": "Stars: Rod La Rocque, Agnes Anderson, James Blakeley\n Director: Lynn Shores\n\n Lamont Cranston assumes his secret identity as \"The Shadow,\" to break up an attempted robbery at an attorney's office. When the police search the scene, Cranston must assume the identity of the attorney. Before he can leave, a phone call summons the attorney to the home of a wealthy client, who wants a new will drawn up. As Cranston meets with him, the client is suddenly shot, and Cranston is quickly caught up in a new mystery.",
      "addedAt": "2025-12-26T23:54:12.020Z",
      "thumbnail": "https://i.ytimg.com/vi/KB3_jB-Kb2E/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB-gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLA8urqxJ1609_hLJXDUNtJaoRkkmw",
      "duration": 3700,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UZ2wgSrJJmg",
      "id": "UZ2wgSrJJmg",
      "title": "The Shadow Strikes (1937) Crime, Film-Noir, Mystery Full Length Movie",
      "description": "Scourge of the underworld! Lamont Cranston assumes his secret identity as \"The Shadow\", to break up an attempted robbery at an attorney's office. When the police search the scene, Cranston must assume the identity of the attorney.\n\nDirector: Lynn Shores\nWriters: Walter B. Gibson (story \"The Ghost of the Manor\"), Al Martin, Rex Taylor\nStars: Rod La Rocque, Agnes Anderson, James Blakeley\nGenres: Classics, Crime, Film-Noir, Mystery\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:47:20.294Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/UZ2wgSrJJmg/maxresdefault.webp?v=62c5a7fd",
      "duration": 3680,
      "language": "en",
      "year": 1937,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheShadowStrikes1937",
      "id": "TheShadowStrikes1937",
      "title": "The Shadow Strikes * 1937",
      "description": "The Shadow Strikes * 1937 This is Lamont Cranston, aka The Shadow. It stars Rod La Rocque and Agnes Anderson. Margo Lane is absent; and the Shadow character lacks the supernatural ability that makes him fun; but it's not a bad whodunnit. There are some funny bits, and some people think of it as a comedy. More information can be found on IMDB The source for this upload can be found elsewhere on archive.org. I cleaned up the audio and decided to share it back to this site.",
      "fileSize": 1631536169,
      "addedAt": "2026-01-07T00:07:05.036Z",
      "thumbnail": "https://archive.org/services/img/TheShadowStrikes1937",
      "collection": "feature_films",
      "downloads": 8228
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 4.8,
    "imdbVotes": 555,
    "Genre": "Crime, Film-Noir, Mystery",
    "Plot": "When The Shadow, a mysterious and masked crime fighter, finds the men that gambler and racketeer Brossett sent to break into attorney Randall's safe, he apprehends them and turns them over to the police. Later, while investigating the crime scene, police captain Breen discovers Lamont Granston, whose secret identity is The Shadow, nosing around the safe, and Lamont succeeds in fooling Breen into believing that he is Randall. As they are about to leave, Lamont answers Randall's phone and poses as the absent attorney. The caller, old millionaire Caleb Delthern, wants Randall to come immediately to help him re-write his will. Breen, overhearing the conversation, insists that Lamont go to his client. Upon his arrival, Lamont is instructed by Caleb to omit his niece Marcia from the will because he does not approve of her plans to marry Warren Berranger. Soon after ordering his niece's disinheritance, Caleb is shot and killed by a bullet shot through an open window. When the police arrive, they arrest Winstead Comstock, Marcia's cousin and the designated heir to Caleb's millions, who was seen walking in the garden. They release him, however, when they realize that there is not enough evidence to charge him. After the police and Lamont leave, Marcia's brother Jasper comes home drunk, after having lost a great sum of money at Brossett's gambling house. Brossett, aware of Jasper's bad credit, has threatened to kill him if he does not pay his gambling debts soon. Jasper desperately tries to borrow money from Winstead, and when he refuses the loan Jasper becomes angry and picks up a gun. At that moment Winstead is shot dead. Although it appears as if Jasper killed Winstead, the authorities later prove that the bullet that killed Winstead came from another gun. Warren, meanwhile, begins to suspect that Lamont is a fraud and soon finds out that the real Randall is out of town. Hoping to learn more about Brossett, Lamont poses as Randall's assistant, bugs Brossett's office and subsequently learns that Brossett has been planning to acquire Jasper's portion of the Delthern estate. At the Delthern house, Brossett's thugs hold up Marcia, Winstead's brother Humphrey and Warren, and demand that they give them Caleb's will, until Lamont, in his Shadow disguise, rescues them and foils Brossett's plan. When Brossett and his cohort, Wellington, show up at Lamont's home, intent on killing him, Lamont manages to create a distraction that results in Brossett and Wellington shooting each other. Before dying, Wellington confesses that he is Warren's father and that he killed Caleb and Winstead so that his son and Marcia would inherit Caleb's money and have a better life. Later, Lamont meets the real Randall, who forgives Lamont for impersonating him when he learns that he solved an important mystery.",
    "Director": "Lynn Shores",
    "Writer": "Walter B. Gibson, Al Martin, Rex Taylor",
    "Actors": "Rod La Rocque, Agnes Anderson, James Blakeley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028001",
    "tt0030873",
    "tt0031705",
    "tt0033855",
    "tt0028360",
    "tt0028667",
    "tt0028788",
    "tt0037078",
    "tt0037691",
    "tt0040457",
    "tt0038640",
    "tt0042640"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:38:14.484Z"
}