{
  "imdbId": "tt0035454",
  "title": "Too Many Women",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TooManyWomen",
      "id": "TooManyWomen",
      "title": "Too Many Women",
      "description": "Richard Sutton (Neil Hamilton) and Linda Pearson (Barbara Read) are secretly engaged but unable to marry because of financial problems. Crooked promoter Gibbons (Pat Gleason) offers Richard a deal but, in order to get rid of him, Richard says a rich uncle in Brazil has died and left him a fortune.",
      "fileSize": 1447562823,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/TooManyWomen",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 30677
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QJqxsQmzM7I",
      "id": "QJqxsQmzM7I",
      "title": "Too Many Women (1942) COMEDY",
      "description": "Stars: Neil Hamilton, June Lang, Joyce Compton\n Director: Bernard B. Ray\n\n When a common man pretends to be wealthy, hordes of desperate gold-diggers flock to win his affections. Before long, the deceiver is engaged to three women and must struggle to keep his fiancée from finding out about the ruse!",
      "addedAt": "2025-12-26T23:52:13.633Z",
      "thumbnail": "https://i.ytimg.com/vi/QJqxsQmzM7I/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLB-jmXx_4blA1SR_XSBbUupdxUV8g",
      "duration": 3963,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "67 min",
    "imdbRating": 4.7,
    "imdbVotes": 104,
    "Genre": "Comedy",
    "Plot": "Richard Sutton and Linda Pearson are secretly engaged but unable to marry because of financial problems. Crooked promoter Gibbons offers Richard a deal but, in order to get rid of him, Richard says a rich uncle in Brazil has died and left him a fortune. The news soon spreads all over town and perks up his wealthy-and-ailing grandmother and her doctor warns Richard against telling her the truth. Granny Sutton tricks him into an engagement with a beautiful young nitwit, Gwenny Miller, of whom she is very fond. Barbara Cartwright, daughter of the town's richest man, suggests she has an idea to get him out of his difficulty and Richard, suffering from an overdose of sleeping pills, visits her. He is too sleepy to realize that her plans calls for marrying her instead, and when her father catches them in an embrace, Richard finds himself engaged to a third woman. Linda walks out and Richard goes on a drinking spree and wakes up in the apartment of playboy Chester Wannamaker, who had lent him his keys before leaving town. Chester's chorus girl fiancée, Lorraine O'Reilly, arrives and proceeds to make herself at home. Gwenny and Barbara also show up as does Lorraine's gangster brother Spike O'Reilly who insists, at the point of a gun, that Richard \"do right\" by his sister. And then it gets confusing.",
    "Director": "Bernard B. Ray",
    "Writer": "Eddie Davis",
    "Actors": "Neil Hamilton, June Lang, Joyce Compton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033510",
    "tt0034087",
    "tt0033820",
    "tt0135173",
    "tt0034476",
    "tt0034486",
    "tt0034488",
    "tt0446928",
    "tt0034859",
    "tt0035508",
    "tt0034839",
    "tt0034698"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.886Z"
}