{
  "imdbId": "tt0030652",
  "title": "The Rage of Paris",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RageofParis",
      "title": "The Rage of Paris",
      "description": "An enticing French girl named Nicole(Danielle Darrieux) has no employ and without rent. She is helped by an ex-actress (Broderick) and a maitre of New York city Hotel (Mischa Auer). They are planning a plot for snare a rich hubby and catch the eyes on Bill (Louis Hayward). The scheme works and the engagement is quickly publicized in the newspapers. But Bill's friend (Douglas Fairbanks J.R) knows the true intentions and the plans may be thwarted.",
      "id": "RageofParis"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OUlSUCk61ZQ",
      "title": "The Rage of Paris (1938) [Comedy]",
      "description": "\"The Rage of Paris\" is a 1938 American comedy film made by Universal Pictures. The movie was directed by Henry Koster, and written by Bruce Manning and Felix Jackson. It won the Venice Film Festival for Special Recommendation.\n\n---\n\nDirected by Henry Koster, produced by Buddy G. DeSylva and Henry Koster, written by Bruce Manning, Felix Jackson, starring Danielle Darrieux as Nicole de Cortillon, Douglas Fairbanks Jr. as James 'Jim' Trevor, Mischa Auer as Mike Lebedovich, Louis Hayward as Bill (Jerome) Duncan, Helen Broderick as Gloria Patterson, Charles Coleman as Wrigley Trevor's Butler, Samuel S. Hinds as Mr. Duncan, Nella Walker as Mrs. Duncan and Harry Davenport as Pops, Caretaker.\n\n---\n\nSource: \"The Rage of Paris\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 10 February 2012. Web. 3 August 2012. http://en.wikipedia.org/wiki/The_Rage_of_Paris.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "OUlSUCk61ZQ",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=clN42yx1ovk",
      "title": "The Rage of Paris (1938) | Colorized Public Domain Comedy | Danielle Darrieux & Douglas Fairbanks Jr",
      "description": "The Rage of Paris (1938) is a sparkling romantic comedy directed by Henry Koster and starring French actress Danielle Darrieux alongside Douglas Fairbanks Jr. This colorized and restored public domain classic captures the wit, charm, and elegance of late 1930s Hollywood romantic comedies. Produced by Universal Pictures, the film combines sophistication, mistaken identity, and screwball humor in a transatlantic love story between Paris and New York. Colorized Public Domain presents this cinematic gem in vivid color, breathing new life into a film that epitomizes Golden Age glamour and comedic timing.\n\nPlot Summary:\nNicole de Cortillon (Danielle Darrieux) is a stunning but penniless French model living in New York who dreams of wealth and romance. With the help of her scheming friend Gloria (Helen Broderick) and the loyal butler Guy (Mischa Auer), she concocts a daring plan to marry a rich American bachelor. Her target is the charming and wealthy Jim Trevor (Louis Hayward), but there is a twist—his best friend Jim (Douglas Fairbanks Jr.) knows all too well how gold-diggers operate. Determined to expose Nicole’s deception, he pretends to fall for her himself, setting off a battle of wits, flirtation, and misunderstanding that spirals into genuine affection.\n\nAs their charade unfolds, Nicole’s sincerity begins to surface, and the film explores the tension between ambition and authenticity. The comic timing, snappy dialogue, and sparkling chemistry between Darrieux and Fairbanks make The Rage of Paris a delightful snapshot of late-Depression-era optimism and charm.\n\nCast and Crew:\n• Director: Henry Koster\n• Producer: Bruce Manning\n• Screenplay: Bruce Manning and Felix Jackson\n• Cinematography: Rudolph Maté\n• Editing: Ted J. Kent\n• Music: Charles Previn\nStarring:\n• Danielle Darrieux as Nicole de Cortillon\n• Douglas Fairbanks Jr. as Jim Trevor\n• Helen Broderick as Gloria Patterson\n• Mischa Auer as Guy\n• Louis Hayward as Bill Duncan\n• Samuel S. Hinds as Mr. Trevor\n• Fanny Brice as Hotel Manager\n• Edward Everett Horton as the Butler\n\nFilm Significance:\nThe Rage of Paris stands as a prime example of Hollywood’s ability to blend European sophistication with American comedic rhythm. Danielle Darrieux, already a celebrated star in France, made a dazzling Hollywood debut that established her international charm. Henry Koster’s direction ensures brisk pacing, while Rudolph Maté’s cinematography adds elegance and polish. The film’s romantic tension and glamorous settings influenced later Hollywood romantic comedies in the 1940s and beyond. For modern audiences, it’s a window into how pre-war cinema balanced humor, gender roles, and social aspiration with style and intelligence.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Rage of Paris remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nOriginally released in 1938 in black and white, The Rage of Paris shimmered with sophistication but lacked the visual warmth that color brings. This colorized edition revitalizes the film’s lavish hotel interiors, elegant fashion, and romantic Parisian atmosphere. For viewers aged 55 to 64, particularly those watching on large TV screens in the United States, Germany, and Serbia, this version enhances immersion and nostalgia. It evokes the allure of classic Hollywood while delivering modern clarity and restoration quality suited for today’s home viewing experience.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our mission is to preserve these treasures while making them accessible to modern audiences across the United States, Europe, and beyond.\n\n#TheRageOfParis #DanielleDarrieux #DouglasFairbanksJr #PublicDomainMovie #ColorizedClassic #RomanticComedy #1930sCinema #ClassicHollywood #FilmRestoration #ScrewballComedy #GoldenAgeHollywood #1938Movies #VintageRomance #ColorizedPublicDomain",
      "id": "clN42yx1ovk",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uv7VFJiG-3Y",
      "title": "The Rage of Paris (1938) DANIELLE DARRIEUX🍕 DOUGLAS FAIRBANKS JR 🍕 SCREWBALL COMEDY🍕  FULL MOVIE",
      "description": "It's Friday @PizzaFLIX \nStars: Danielle Darrieux, Douglas Fairbanks Jr., Mischa Auer\nDirector: Henry Koster\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TXEBMtSqYpWfok-xg95KXao\n🍕 NEW BRILLIANT HD RESTORATION🍕\nDiscover the wit, charm, and elegance of 1930s Hollywood in a delightful screwball comedy produced by Universal Pictures. Directed by Henry Koster, this stylish film stars French screen legend Danielle Darrieux in her American debut, alongside Douglas Fairbanks Jr., Mischa Auer, Louis Hayward, and Helen Broderick.\n\nSet in glamorous New York high society, the story follows a clever Parisian model whose elaborate scheme to marry a millionaire quickly spirals into comic chaos. With razor-sharp dialogue, endearing performances, and Koster’s deft direction, this film is a standout example of the screwball comedy era.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nFilmed at Universal Studios, the screenplay was written by Norman Krasna, based on a story by Jean de Limur and Gregor Ziemer. This sparkling classic captures the charm and sophistication of pre-war American cinema, making it a must-watch for lovers of vintage film and romantic comedies.\n\n#TheRageOfParis #FullMovie #DanielleDarrieux #DouglasFairbanksJr #HenryKoster #ClassicHollywood #ScrewballComedy #VintageFilm #OldHollywood #UniversalPictures #1930sCinema",
      "id": "uv7VFJiG-3Y",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-rage-of-paris-1938_202402",
      "title": "The Rage of Paris (1938)",
      "description": "Nicole has no job and is several weeks behind with her rent. Her solution to her problems is to try and snare a rich husband. Enlisting the help of her friend Gloria and the maitre'd at a ritzy New York City hotel, the trio plot to have Gloria catch the eye of Bill Duncan, a millionaire staying at the hotel. The plan works and the two quickly become engaged. Nicole's plan may be thwarted by Bill's friend, Jim Trevor, who's met Nicole before and sees through her plot. Watch on RetroFlix:  https://retroflix.org/the-rage-of-paris-1938/",
      "id": "the-rage-of-paris-1938_202402"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4agFYuXtr2k",
      "title": "The Rage of Paris (1938) Darrieux dazzles; Fairbanks charms - Romantic Comedy film",
      "description": "A Parisian in New York whose high‑society charade collides with quick wit, glamour, and romance.\nNicole has no job and is several weeks behind with her rent. Her solution is to try to snare a rich husband, and she enlists the help of her friend Gloria and the maitre d' to catch the eye of Bill Duncan.\n\nColorized version https://youtu.be/JSBuffm6dfA\n\nCredits:\n• Director: Henry Koster \n• Producer: Buddy G. DeSylva \n• Writers: Bruce Manning, Felix Jackson \n• Cinematography: Joseph A. Valentine \n• Music: Frank Skinner, Hans J. Salter, Charles Previn, Charles Henderson \n• Release: July 1, 1938 \n\nCast:\nDanielle Darrieux; Douglas Fairbanks Jr.; Mischa Auer; Louis Hayward; Helen Broderick; Charles Coleman; Samuel S. Hinds; Nella Walker; Harry Davenport\n\nNotes:\nVenice Film Festival Special Recommendation. Reissued in 1951 as “Confessions of a Model.”",
      "id": "4agFYuXtr2k",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bPQD0VuD7K0",
      "title": "The Rage of Paris (1938) Comedy Full Length Movie",
      "description": "Nicole has no job and is several weeks behind with her rent. Her solution to her problem is to try and snare a rich husband. Enlisting the help of her friend Gloria and the maitre'd at a ritzy New York City hotel, the trio plot to have Gloria catch the eye of Bill Duncan, a handsome millionaire staying at the hotel. The plan works and the two quickly become engaged. Nicole's plan may be thwarted by Bill's friend, Jim Trevor, who's met Nicole before and sees through her plot.\n\nDirector: Henry Koster\nWriters: Bruce Manning, Felix Jackson \nStars: Danielle Darrieux, Douglas Fairbanks Jr., Mischa Auer\nGenres: Classics, Comedy",
      "id": "bPQD0VuD7K0",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "78 min",
    "imdbRating": "6.9",
    "imdbVotes": "1,008",
    "Genre": "Comedy",
    "Plot": "Nicole has no job and is several weeks behind with her rent. Her solution to her problem is to try and snare a rich husband. Enlisting the help of her friend Gloria and the maitre'd at a ritzy New York City hotel, the trio plot to have Gloria catch the eye of Bill Duncan, a handsome millionaire staying at the hotel. The plan works and the two quickly become engaged. Nicole's plan may be thwarted by Bill's friend, Jim Trevor, who's met Nicole before and sees through her plot.",
    "Director": "Henry Koster",
    "Writer": "Bruce Manning, Felix Jackson, Henri Debain",
    "Actors": "Danielle Darrieux, Douglas Fairbanks Jr., Mischa Auer",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0025647",
      "title": "Peter",
      "year": 1934,
      "imdbRating": "7.6",
      "imdbVotes": "58",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041509",
      "title": "The Inspector General",
      "year": 1949,
      "imdbRating": "6.7",
      "imdbVotes": "3,654",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041257",
      "title": "Come to the Stable",
      "year": 1949,
      "imdbRating": "7.1",
      "imdbVotes": "1,588",
      "language": "English, French, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042546",
      "title": "Harvey",
      "year": 1950,
      "imdbRating": "7.9",
      "imdbVotes": "60,260",
      "language": "English, Spanish, Latin",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0040553",
      "title": "The Luck of the Irish",
      "year": 1948,
      "imdbRating": "6.6",
      "imdbVotes": "1,122",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031002",
      "title": "The Young in Heart",
      "year": 1938,
      "imdbRating": "7.3",
      "imdbVotes": "1,670",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031261",
      "title": "East Side of Heaven",
      "year": 1939,
      "imdbRating": "6.6",
      "imdbVotes": "291",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029853",
      "title": "Alf's Button Afloat",
      "year": 1938,
      "imdbRating": "5.5",
      "imdbVotes": "144",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029939",
      "title": "Born to Be Wild",
      "year": 1938,
      "imdbRating": "5.7",
      "imdbVotes": "112",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028548",
      "title": "Abenteuer in Warschau",
      "year": 1938,
      "imdbRating": "5.8",
      "imdbVotes": "21",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0483126",
      "title": "Das Protektionskind",
      "year": 1938,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029045",
      "title": "Ihr Leibhusar",
      "year": 1938,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:22.157Z"
}