{
  "imdbId": "tt0001401",
  "title": "The Sorrows of the Unfaithful",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheSorrowsOfTheUnfaithful",
      "title": "\"The Sorrows Of The Unfaithful\" (1910) director D. W. Griffith with Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Sorrows of the Unfaithful\" is a short drama. This film illustrates the work of cinematographer Billy Bitzer, a star of Silent Hall of Fame. Mary Pickford is engaged to her childhood sweetheart, but then suddenly falls for another man. Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          Stanner E. V. Taylor Cinematography                Billy Bitzer Starring                               Mary Pickford, Henry B. Walthall, Edward Dillon, W. Chrystie Miller, Gladys Egan Distributed by                     Biograph Company Release date                        August 22, 1910 Running time                      11 min. Country                               United States Language                             Silent, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "PreviewTheSorrowsOfTheUnfaithful"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": "6.1",
    "imdbVotes": "29",
    "Genre": "Drama, Short",
    "Plot": "In a quaint fishing village we see the childhood sweethearts, Bill and Mary, a boy and girl of about ten or eleven years. Constant companions, they hold for each other a regard beyond their understanding. Ten years roll by, and the boy, now a young man, with a ring approaches the girl and the sweethearts of childhood now renew their vows. They are both very happy until fate interferes, it seems, to test the girl's sincerity. Bill while strolling on the shore, which to him since the betrothal is a Utopia, espies a raft with an object on it that looks like a human being, far out at sea. Dashing into the surf, he swims to the raft and finds the almost exhausted form of a fisherman lying prone upon it. Pushing the raft to the shore, he, with the aid of others, revives the man, who is a stranger to them all, having put out from a far distant shore. Bill and Joe, the stranger, become staunch friends, and through this Joe meets Mary. She is at once smitten with the stranger and cruelly casts Bill aside for him. Joe, of course, knowing nothing of Bill's love for Mary, reciprocates her affection until he learns the truth. The horror of the situation is vivid. Here he finds himself the successful rival of the man to whom he owes his life. No, it cannot be, and so repulsing the impetuous Mary he rushes from the place, but not before Bill has seen enough to make him believe Joe has proved himself an ingrate. Joe makes a strenuous effort to reject Mary's advances, but she is persistent. Finally managing to elude her, he sends her the following note: \"Mary, Bill saved my life. I will not rob him of his love. I see the raft on the shore. I shall go back to the sea on it. If the sea claims me it is my fate. Joe.\" She is amazed at this and rushes madly to the shore in view of staying his determination. In the meantime, Bill overtakes Joe at the shore, and ignorant of his purpose, with a blow sends him into the sea, never to return. At this moment Mary rushes up, she, of course, not aware of Joe's fate and shows Bill the note. He is driven mad upon learning that his deed was entirely unnecessary, so bidding Mary to wait, he wanders out, out into the sea with an insane idea of recovering his victim.",
    "Director": "D.W. Griffith",
    "Writer": "Stanner E.V. Taylor",
    "Actors": "Mary Pickford, Henry B. Walthall, Edward Dillon",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001371",
      "title": "Ramona",
      "year": 1910,
      "imdbRating": "5.8",
      "imdbVotes": "449",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001118",
      "title": "An Arcadian Maid",
      "year": 1910,
      "imdbRating": "5.5",
      "imdbVotes": "218",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001262",
      "title": "In Life's Cycle",
      "year": 1910,
      "imdbRating": "5.2",
      "imdbVotes": "32",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001340",
      "title": "The Oath and the Man",
      "year": 1910,
      "imdbRating": "5.1",
      "imdbVotes": "104",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001388",
      "title": "Rose o' Salem Town",
      "year": 1910,
      "imdbRating": "5.7",
      "imdbVotes": "96",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001120",
      "title": "As It Is in Life",
      "year": 1910,
      "imdbRating": "5.6",
      "imdbVotes": "247",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001227",
      "title": "The Fugitive",
      "year": 1910,
      "imdbRating": "5.8",
      "imdbVotes": "254",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001256",
      "title": "The House with Closed Shutters",
      "year": 1910,
      "imdbRating": "5.9",
      "imdbVotes": "590",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001032",
      "title": "The Sealed Room",
      "year": 1909,
      "imdbRating": "6.0",
      "imdbVotes": "985",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001050",
      "title": "A Strange Meeting",
      "year": 1909,
      "imdbRating": "4.9",
      "imdbVotes": "90",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001072",
      "title": "A Trap for Santa Claus",
      "year": 1909,
      "imdbRating": "5.6",
      "imdbVotes": "409",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001083",
      "title": "The Violin Maker of Cremona",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "157",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}