{
  "movieId": "tt0041251",
  "title": "City Across the River",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/city-across-the-river-1949",
      "id": "city-across-the-river-1949",
      "title": "City Across the River (1949)",
      "description": "Brooklyn youth Frank Cusack, good son and brother by day, is a gang member by night. The Dukes, seemingly likable dead-end-kids, are dangerously involved with racketeer Gaggsy Steens. Despite the efforts of Franks's parents, he and pal Benny get involved in a serious crime. Can Stan Albert, head of the community center, prevent them from becoming full-time crooks? Watch on RetroFlix:  https://retroflix.org/city-across-the-river-1949/",
      "fileSize": 216238978,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/city-across-the-river-1949",
      "language": "eng",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 137
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cityacrosstheriver1949",
      "id": "cityacrosstheriver1949",
      "title": "City Across the River (1949) Tony Curtis, Stephen McNally",
      "description": "City Across the River is known for being the film that kick-started Tony Curtis' screen career. It was also the template for such crucial 1950s movies as Blackboard Jungle and Rebel Without a Cause.   It is a 1949 American film noir crime film directed by Maxwell Shane and stars Tony Curtis, Stephen McNally, Thelma Ritter. The screenplay is based on the novel The Amboy Dukes by Irving Shulman.   The book is about a teenage street gang, the Amboy Street Dukes, and its theme is the upheaval that the war inflicted on family and social structures. It focuses on the lack of parental guidance for teenagers during this time, either because parents were absent at war or work, or were abdicating their responsibilities.",
      "fileSize": 435074594,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/cityacrosstheriver1949",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 3371
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "91 min",
    "imdbRating": 6.3,
    "imdbVotes": 455,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Brooklyn youth Frank Cusack, good son and brother by day, is a gang member by night. The Dukes, seemingly likable dead-end-kids, are dangerously involved with racketeer Gaggsy Steens. Despite the efforts of Franks's parents, he and pal Benny get involved in a serious crime. Can Stan Albert, head of the community center, prevent them from becoming full-time crooks?",
    "Director": "Maxwell Shane",
    "Writer": "Maxwell Shane, Dennis J. Cooper, Irving Shulman",
    "Actors": "Stephen McNally, Thelma Ritter, Luis Van Rooten",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0048412",
    "tt0049553",
    "tt0042792",
    "tt0042052",
    "tt0041503",
    "tt0041268",
    "tt0041555",
    "tt0041761",
    "tt0041269",
    "tt0041786",
    "tt0042006",
    "tt0041958"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.623Z"
}