{
  "imdbId": "tt0049540",
  "title": "The Naked Hills",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheNakedHills",
      "id": "TheNakedHills",
      "title": "The Naked Hills",
      "description": "Tracy Powell (David Wayne), an Indiana farmer, gets the gold fever and heads for Stockton, California in 1849. There, he abandons his first partner, Bert Killian (Denver Pyle), and teams up with Sam Wilkins (Keenan Wynn), a claim jumper employed by Willis Haver (Jim Backus). Six years later, Powell returns to Indiana and his sweetheart, Julie (Marcia Henderson). They marry and he tries farming again but, on the night their son is born, he takes off again searching for gold.",
      "fileSize": 1874534000,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheNakedHills",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 80880
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 5.5,
    "imdbVotes": 246,
    "Genre": "Western",
    "Plot": "Tracy Powell, an Indiana farmer, gets the gold fever and heads for Stockton, California in 1849. There, he abandons his first partner, Bert Killian, and teams up with Sam Wilkins, a claim jumper employed by Willis Haver. Six years later, Powell returns to Indiana and his sweetheart, Julie. They marry and he tries farming again but, on the night their son is born, he takes off again searching for gold. This time he heads for the hills with an inveterate prospector, Jimmo McCann. A decade later, the two are still hunting for their big strike when McCann is killed in an accident. Powell returns home with news of a big strike but the deserted Julie will have nothing to do with him. His friend Killian will not believe him but Haver, now a banker gives him a small loan and then beats him out of his claim. Many years pass before he comes home, now sixty-years-old, and this time, his wife and son open their home to him. But he vows to go prospecting come next spring.",
    "Director": "Josef Shaftel",
    "Writer": "Helen S. Bilkie, Josef Shaftel",
    "Actors": "David Wayne, Keenan Wynn, James Barton",
    "Language": "Spanish, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0049121",
    "tt0049655",
    "tt0049216",
    "tt0049351",
    "tt0049472",
    "tt0049515",
    "tt0049485",
    "tt0049793",
    "tt0049434",
    "tt0049970",
    "tt0048535",
    "tt0048734"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.034Z"
}