{
  "imdbId": "tt0056937",
  "title": "Cleopatra",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cleopatra-1963_202511",
      "title": "Cleopatra (1963)",
      "description": "The film Cleopatra (1963), directed by Joseph L. Mankiewicz, dramatizes the life of the last active ruler of the Ptolemaic Kingdom of Egypt, Cleopatra VII. The story is set in the backdrop of political intrigue, power struggles, and romance between Cleopatra and two of Rome's most powerful leaders: Julius Caesar and Mark Antony.  The film opens with Cleopatra's ascension to the throne of Egypt, following the death of her father, Ptolemy XII. She faces pressure from her brother Ptolemy XIII and the Roman forces.Seeking support against her brother, Cleopatra forms an alliance with Julius Caesar. Their relationship blossoms, leading to the birth of Caesar’s son, Caesarion. Cleopatra's charm and intelligence captivate Caesar, allowing her to solidify her power.As tensions in Rome rise, the Senate grows concerned about Caesar’s relationship with Cleopatra. Their alliance ultimately leads to political unrest and civil war in Rome.After Caesar's assassination, Cleopatra turns her attention to Mark Antony, who is infatuated with her. They engage in a passionate romance while navigating the complexities of Roman politics.The movie climaxes with the naval Battle of Actium, where Antony and Cleopatra face Octavian's forces. Their defeat marks the beginning of their downfall.With Antony's forces defeated and their dreams shattered, Cleopatra faces a grim future. In an act of defiance, she takes her own life, believing it to be the only way to retain her dignity.",
      "id": "cleopatra-1963_202511"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "320 min",
    "imdbRating": "7.0",
    "imdbVotes": "40,253",
    "Genre": "Biography, Drama, History",
    "Plot": "In 48 B.C., Julius Caesar (Sir Rex Harrison) pursues Pompey from Pharsalia to Egypt. Pharaoh Ptolemy XIII (Richard O'Sullivan), now supreme ruler after deposing his older sister, Cleopatra VII (Dame Elizabeth Taylor), attempts to gain favor with Caesar by presenting the conquerer with the head of Pompey, borne by his governors, Pothinus (Grégoire Aslan) and Achillas (John Doucette). To win Caesar's support from her brother, Cleopatra hides herself in a rug, which Apollodorus (Cesare Danova), her servant, presents to Caesar. The Roman is immediately infatuated. Banishing Ptolemy, he declares Cleopatra Egypt's sole ruler and takes her as his mistress. A son, Caesarion (Loris Loddi), is born of their union. Caesar, however, must return to Italy. Although he is briefly reunited with Cleopatra during a magnificent reception for the Queen in Rome, Caesar is assassinated shortly thereafter, and Cleopatra returns to Egypt. When Mark Antony (Richard Burton), Caesar's protégé, beholds Cleopatra aboard her elaborate barge at Tarsus some years later, he is smitten and becomes both her lover and military ally. Their liaison notwithstanding, Antony, to consolidate his position in Rome, marries Octavia (Jean Marsh), sister of the ambitious Octavian (Roddy McDowall). The marriage satisfies no one. Cleopatra is infuriated, and Antony, tiring of his Roman wife, returns to Egypt. There he flaunts his liaison by marrying Cleopatra in a public ceremony. Sensing Antony's weakness, Octavian attacks and defeats his forces at Actium. Alarmed, Cleopatra withdraws her fleet and seeks refuge in her tomb.",
    "Director": "Joseph L. Mankiewicz, Rouben Mamoulian",
    "Writer": "Joseph L. Mankiewicz, Ranald MacDougall, Sidney Buchman",
    "Actors": "Elizabeth Taylor, Richard Burton, Rex Harrison",
    "Language": "English",
    "Country": "Switzerland, United Kingdom, United States",
    "Awards": "Won 4 Oscars. 7 wins & 13 nominations total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0055774",
      "title": "Barabbas",
      "year": 1961,
      "imdbRating": "6.9",
      "imdbVotes": "7,163",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0054847",
      "title": "El Cid",
      "year": 1961,
      "imdbRating": "7.2",
      "imdbVotes": "16,684",
      "language": "Italian, Arabic, English, Latin",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0060107",
      "title": "Andrei Rublev",
      "year": 1966,
      "imdbRating": "8.0",
      "imdbVotes": "58,379",
      "language": "Russian, Italian, Tatar",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0053800",
      "title": "Esther and the King",
      "year": 1960,
      "imdbRating": "5.5",
      "imdbVotes": "883",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053946",
      "title": "Inherit the Wind",
      "year": 1960,
      "imdbRating": "8.1",
      "imdbVotes": "33,439",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0056197",
      "title": "The Longest Day",
      "year": 1962,
      "imdbRating": "7.7",
      "imdbVotes": "61,129",
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1441953",
      "title": "Testament of Youth",
      "year": 2014,
      "imdbRating": "7.2",
      "imdbVotes": "31,170",
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Moviedome"
    },
    {
      "imdbId": "tt0045473",
      "title": "Admiral Ushakov",
      "year": 1953,
      "imdbRating": "7.3",
      "imdbVotes": "224",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0056810",
      "title": "Act One",
      "year": 1963,
      "imdbRating": "6.0",
      "imdbVotes": "316",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0086891",
      "title": "Anatomy of an Illness",
      "year": 1984,
      "imdbRating": "6.4",
      "imdbVotes": "116",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024966",
      "title": "Chapaev",
      "year": 1934,
      "imdbRating": "7.0",
      "imdbVotes": "1,461",
      "language": "Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0266425",
      "title": "Conspiracy",
      "year": 2001,
      "imdbRating": "7.6",
      "imdbVotes": "28,545",
      "language": "English, German, Latin",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:51.623Z"
}