{
  "movieId": "tt0093791",
  "title": "Morning Patrol",
  "year": 1987,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Morning-patrol-movie",
      "id": "Morning-patrol-movie",
      "title": "Morning Patrol - Greek Cinema - 1987 - Based on Philip K Dick novel",
      "description": "Having no recollection of who she is, what happened, or how she ended up with an inflamed wound on her arm, a wary woman meanders through the ruins of an endless, ghastly wasteland, uttering a soliloquy. Scavenging for food and water in the carcass of a desolate, post-Apocalyptic, dog-eat-dog world, all the woman knows is she must keep walking towards the West and fight tooth and nail to stay alive. Indeed, against the backdrop of global civilisation collapse, there can be no heroes, and what's left of the cities is a death trap: silent, well-kept remnants where the pitiless Morning Patrol has laid its snares for the unsuspecting ones who enter the off-limits zone. But with humankind on its knees, who can you trust? And, if resistance is futile, are memories enough to keep us going?",
      "fileSize": 801840125,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/Morning-patrol-movie",
      "language": "gre",
      "year": 1987,
      "collection": "feature_films",
      "downloads": 1728
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "108 min",
    "imdbRating": 7.1,
    "imdbVotes": 1042,
    "Genre": "Drama, Sci-Fi",
    "Plot": "A woman is walking alone through an abandoned city. She approaches the forbidden zone and tries to pass through. Everywhere the Morning Patrol and deceptive traps are watching. The city itself is alive but uncontrolled. Computer voices warn non-existing inhabitants to leave the city. The communication system works... cinemas show films... classic faces of a past era flash across TV screens. She is confronted by one of the few survivors guarding the city. They will come close to each other ; they will try to recall the past. Together they unravel their tangled memory - threads of this catastrophe and decide to penetrate the zone together ; They are linked by the bonds of violence and death since no other behaviour is possible in this kind of world. Is there an end? Is there hope and any future since no person that was allowed through ever returned to tell us whether the freedom of the sea exists. The fugitives encounter increasing dangers... A story of love in this unbearable world... what point can it have?",
    "Director": "Nikos Nikolaidis",
    "Writer": "Raymond Chandler, Philip K. Dick, Daphne Du Maurier",
    "Actors": "Michele Valley, Takis Spyridakis, Panos Thanassoulis",
    "Language": "Greek",
    "Country": "Greece",
    "Awards": "1 win & 3 nominations"
  },
  "relatedMovies": [
    "tt0091166",
    "tt0092530",
    "tt0087803",
    "tt0101264",
    "tt0099582",
    "tt0235245",
    "tt0086429",
    "tt0092978",
    "tt14407336",
    "tt0096492",
    "tt0094683",
    "tt0973837"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}