{
  "imdbId": "tt0019856",
  "title": "Evangeline",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/evangeline-1929",
      "id": "evangeline-1929",
      "title": "Evangeline (1929)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. Dolores del Rio stars in this romantic tragedy about a woman who searches years and across a continent to try to find her lost lover, though seemingly she is always just a little too late to catch up. While there is no spoken dialogue, there is an attached soundtrack, with Rio singing near the end of the picture. ",
      "fileSize": 1042299897,
      "addedAt": "2026-01-07T00:08:24.393Z",
      "thumbnail": "https://archive.org/services/img/evangeline-1929",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 68
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "87 min",
    "imdbRating": 6.8,
    "imdbVotes": 172,
    "Genre": "Drama",
    "Plot": "In Acadia, now part of the Canadian province of Nova Scotia, young Evangeline is betrothed to Gabriel. But before their wedding can take place, the British imprison the men and send them into exile with their lands forfeit to the Crown. Evangeline follows the exiled men in hopes of finding her beloved, but even after he and the other Acadians are released in Louisiana, she cannot find him, always arriving at some locale just after he has departed. But she dedicates her life to searching the continent for the man she loves.",
    "Director": "Edwin Carewe",
    "Writer": "Finis Fox, Henry Wadsworth Longfellow",
    "Actors": "Dolores Del Río, Roland Drew, Alec B. Francis",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0019305",
    "tt0024834",
    "tt0020305",
    "tt0019312",
    "tt0019489",
    "tt0020030",
    "tt0019644",
    "tt0019765",
    "tt0019933",
    "tt0019957",
    "tt0019979",
    "tt0019983"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.393Z"
}