{
  "imdbId": "tt0049363",
  "title": "Indestructible Man",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/IndestructibleMan1956CrimeHorrorScienceFiction",
      "title": "Indestructible Man (1956) Lon Chaney Jr. high quality print",
      "description": "An executed killer called the Butcher (Lon Chaney Jr.) is zapped back to life in Los Angeles.",
      "id": "IndestructibleMan1956CrimeHorrorScienceFiction"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Indestructible_Man_movie",
      "title": "Indestructible Man",
      "description": "Betrayed by his fellow criminals, Lon Chaney, Jr. is executed, but has his chance for revenge when he is reanimated by a scientist. (This copy seems to have no gaps.) Find out more at the IMDB . (The video is interlaced in the MPEG2 file. If viewing with VLC, deinterlace with menu-path Video/Deinterlace/Blend.) The mpeg2 file can be loaded into DVDAuthorGUI (a free program) to create a DVD.",
      "id": "Indestructible_Man_movie"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/indestructible-man-1956",
      "title": "Indestructible Man (1956)",
      "description": "A scientific experiment involving subjecting a corpse to an extreme charge of electricity accidentally revives an executed criminal and makes him impervious to harm, allowing him to seek revenge on his former partners, and deal similarly with anyone else who gets in his way. Watch on RetroFlix:  https://retroflix.org/indestructible-man-1956/",
      "id": "indestructible-man-1956"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/indestructible.-man.-1956",
      "title": "Indestructible Man (1956)",
      "description": "Indestructible Man is a 1956 science fiction film directed by Jack Pollexfen . The story revolves around a notorious criminal named Jack Stone , played by Lon Chaney Jr. , who is executed after a series of violent crimes. In an experimental procedure, he is brought back to life with enhanced strength and resilience, making him virtually indestructible.After his resurrection, Jack seeks revenge on those who wronged him during his life. As he wreaks havoc, law enforcement struggles to stop him, leading to a tense confrontation.",
      "id": "indestructible.-man.-1956"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/indestructible_man",
      "title": "Indestructible Man",
      "description": "Stars Lon Chaney Jr. You can find more information regarding this film on its IMDb page .",
      "id": "indestructible_man"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/indestructible_man_201510",
      "title": "Indestructible Man",
      "description": "This film has fallen into the Public Domain.",
      "id": "indestructible_man_201510"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Wt7eedQCDQY",
      "title": "Indestructible Man (1956) [Crime] [Horror] [Science Fiction]",
      "description": "Told in flashback by police detective Dick Chasen (Showalter), the movie concerns a 72-hour period of horror for the main characters. Charles \"Butcher\" Benton (Chaney) is a double-crossed convicted robber and murderer who was executed in the gas chamber. His body is unlawfully sold to a scientist (Robert Shayne of Adventures of Superman fame), who plans to move his testing to human subjects. The corpse is subjected to chemical injection and massive jolts of high-frequency electricity in order to study the effect on human tissues. But Benton's heart is restimulated and he completely revives (though rendered mute due to electrical damage to his vocal cords), immensely strong and with skin virtually impervious - even to bazooka shells.\n\nAfter killing the doctor and his assistant (Joe Flynn, pre-McHale's Navy), Benton sets out to avenge himself on his attorney and the lawyer's henchmen who, in collusion with the attorney, had betrayed Benton in order to steal his loot. Benton had left the location of his stash to his stripper-girlfriend (Carr), who had since gone straight and begun dating the detective who brought Benton to justice, after she had rejected the lawyer's own advances.\nThe story then follows Benton's revenge on his enemies; the police who first learn of a wave of mysterious killing, then of Benton's reanimation; and the developing relationship between the detective and the stripper. The lawyer, fearing for his life after the two henchman are murdered, confesses the plot to the police, and reveals that Benton had always used the sewer system to evade detection; and to find a hiding place for the money, as it turns out.\n\nTracked down by the police, Benton is weakened but not killed when he takes a direct hit in the solar plexus from a bazooka, and is disfigured by a flame thrower. He runs to a power station, where he maneuvers metal equipment and himself into position to trigger a high-voltage jolt of electricity, which kills him. At the fade-out, Chasen proposes to his girlfriend.\n\n---\n\nDirected and produced by Jack Pollexfen, written by Vy Russell and Sue Dwiggins, starring Lon Chaney Jr., Max Showalter, Marian Carr, Ross Elliott, Stuart Randall, Ken Terrell, Marjorie Stapp, Robert Shayne, Peggy Maley, Robert Foulk, Reita, Roy Engel and Madge Cleveland.\n\n---\n\nSource: \"Indestructible Man\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 15 March 2013. Web. 22 March 2013. http://en.wikipedia.org/wiki/Indestructible_Man.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "Wt7eedQCDQY",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Skcv6MObyl8",
      "title": "Indestructible Man (1956) | Colorized Public Domain Sci-Fi Horror with Lon Chaney Jr. & Casey Adams",
      "description": "Indestructible Man (1956) is an American science fiction horror film directed by Jack Pollexfen, blending the gritty crime-thriller tone of 1950s noir with shocking elements of horror and early science fiction. This restored and colorized edition revives one of Lon Chaney Jr.’s most haunting late-career performances, transforming a forgotten B-movie into a thrilling spectacle for modern audiences in the United States, Europe, and beyond. By bringing this public domain gem into high-quality color, Colorized Public Domain ensures that both classic horror fans and contemporary viewers can experience its unique mix of terror, revenge, and Cold War–era anxieties.\n\nPlot Summary:\nThe story follows Charles “Butcher” Benton (Lon Chaney Jr.), a hardened Los Angeles gangster sentenced to death in the gas chamber for robbery and murder. Before his execution, Benton vows vengeance against his double-crossing partners and the lawyer who betrayed him. After his death, his body is stolen by Dr. Bradshaw (Robert Shayne), a scientist experimenting with electricity and human tissue regeneration. Through a massive jolt of high-voltage current, Benton is reanimated as a nearly indestructible monster, impervious to bullets and consumed by rage.\n\nAs Benton stalks through Los Angeles on his murderous path of revenge, Lt. Dick Chasen (Casey Adams, credited as Max Showalter) pursues him in a desperate attempt to stop the unstoppable. Caught in the middle is Eva Martin (Marian Carr), Benton’s former girlfriend, who becomes both a target of his twisted affection and a pawn in his violent vendetta. With each act of revenge, Benton grows more dangerous, culminating in a deadly chase through the sewers of Los Angeles that pits brute strength against human determination.\n\nCast and Crew:\n• Director: Jack Pollexfen\n• Screenplay: Vy Russell, Sue Dwiggins\n• Producer: Vy Russell\n• Cinematography: Brydon Baker\n• Editing: Hugh Winn\n\nStarring:\n• Lon Chaney Jr. as Charles “Butcher” Benton\n• Casey Adams (Max Showalter) as Lt. Dick Chasen\n• Marian Carr as Eva Martin\n• Robert Shayne as Dr. Bradshaw\n• Ross Elliott as Paul Lowe\n• Stuart Randall as Capt. John Lauder\n\nFilm Significance:\nIndestructible Man reflects the anxieties of postwar America, where science experiments and atomic-age fears often collided with noir-inspired storytelling. Lon Chaney Jr., son of silent horror legend Lon Chaney Sr., delivers a physically imposing performance that channels both Frankenstein’s Monster and the tragic villain archetype. The film is notable for its blending of crime drama and horror, presenting a creature not from outer space but from humanity’s own reckless scientific ambition. Today, the movie endures as a cult classic, cherished by fans of B-grade sci-fi horror for its moody Los Angeles setting, Chaney’s raw performance, and its symbolic merging of crime, science, and monstrosity.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Indestructible Man remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1956 release was in black and white, common for low-budget horror and crime films of the decade. While authentic to its time, black-and-white visuals often deter modern audiences. By offering a colorized edition, we enhance the dramatic impact of Lon Chaney Jr.’s performance, highlight the moody Los Angeles settings, and bring out details that were once hidden in shadows. This allows contemporary viewers to enjoy the story with fresh eyes while still appreciating its cult-classic origins.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#IndestructibleMan #LonChaneyJr #1950sHorror #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #SciFiHorror #CrimeHorror #1956Movies #GoldenAgeHorror #CultClassic",
      "id": "Skcv6MObyl8",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-D1cUAX4m24",
      "title": "Indestructible Man (1956) LON CHANEY, JR",
      "description": "Stars: Lon Chaney Jr., Max Showalter, Marian Carr\nDirector: Jack Pollexfen\n\nScientific experiments accidentally revive an executed criminal and make him impervious to harm, prompting him to seek revenge on his former partners.",
      "id": "-D1cUAX4m24",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SvLThH870rc",
      "title": "Indestructible Man (1956) Lon Chaney Jr | Crime, Horror, Sci-Fi Movie",
      "description": "Charles \"The Butcher\" Benton, a brutal death row inmate gets double-crossed by his crooked lawyer. He gets his chance for revenge when, after he's been executed, a bizarre experiment brings him back to life and more deadly than ever.\n\nDirector: Jack Pollexfen\nWriters: Vy Russell, Sue Dwiggins \nStars: Lon Chaney Jr., Max Showalter, Marian Carr \nGenres: Crime | Horror | Sci-Fi\n\nConnect with the rest of the cult on social media :\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "SvLThH870rc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CountSchlockulasShockShowVolume2",
      "title": "Count Schlockula's Shock Show Volume 2",
      "description": "Greetings from The COUNT....Our feature presentation is INDESTRUCTIBLE MAN starring Lon Chaney followed by the next chapter of FLASH GORDON CONQUERS THE UNIVERSE. Enjoy the Show.",
      "id": "CountSchlockulasShockShowVolume2"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": "4.4",
    "imdbVotes": "3,349",
    "Genre": "Crime, Horror, Sci-Fi",
    "Plot": "\"Butcher\" Benton goes to his death in the state prison, cursing the three men who double-crossed him following an armored-car hold-up; \"Squeamy\" Ellis, Joe Marcelli and Paul Lowe, his attorney and leader of the gang. He vows to return and kill them and dies without revealing the location of the stolen money. Detective Chasen is determined to keep working on the case until the stolen loot is recovered. Benton's body is taken to Professor Bradshaw and his assistant for experimentation, and they manage to restore him to life, making him practically indestructible in the process. He takes off after the three men, getting rid of everybody who stands in his way. He is impervious to police bullets. He kills Ellis and Marcelli, while Lowe seeks police protection. Benton takes to the sewers to recover the hidden loot and the police are powerless to stop him.",
    "Director": "Jack Pollexfen",
    "Writer": "Vy Russell, Sue Dwiggins",
    "Actors": "Lon Chaney Jr., Max Showalter, Marian Carr",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0053593",
      "title": "The Amazing Transparent Man",
      "year": 1960,
      "imdbRating": "4.1",
      "imdbVotes": "2,798",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032245",
      "title": "Before I Hang",
      "year": 1940,
      "imdbRating": "6.1",
      "imdbVotes": "1,450",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031614",
      "title": "The Man They Could Not Hang",
      "year": 1939,
      "imdbRating": "6.8",
      "imdbVotes": "2,005",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0197521",
      "title": "Godzilla: King of the Monsters!",
      "year": 1956,
      "imdbRating": "6.3",
      "imdbVotes": "9,321",
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049370",
      "title": "It Conquered the World",
      "year": 1956,
      "imdbRating": "4.9",
      "imdbVotes": "2,754",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049900",
      "title": "Warning from Space",
      "year": 1956,
      "imdbRating": "4.8",
      "imdbVotes": "1,328",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049366",
      "title": "Invasion of the Body Snatchers",
      "year": 1956,
      "imdbRating": "7.7",
      "imdbVotes": "58,248",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049468",
      "title": "Man Beast",
      "year": 1956,
      "imdbRating": "4.2",
      "imdbVotes": "651",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0049103",
      "title": "The Creature Walks Among Us",
      "year": 1956,
      "imdbRating": "5.6",
      "imdbVotes": "4,346",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049248",
      "title": "The Gamma People",
      "year": 1956,
      "imdbRating": "5.3",
      "imdbVotes": "875",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050177",
      "title": "Beginning of the End",
      "year": 1957,
      "imdbRating": "4.0",
      "imdbVotes": "2,831",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050723",
      "title": "Monster from Green Hell",
      "year": 1957,
      "imdbRating": "3.7",
      "imdbVotes": "1,413",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T18:00:23.997Z"
}