{
  "movieId": "tt0023251",
  "title": "The Music Box",
  "year": 1932,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AtRmKF8J1-Q",
      "id": "AtRmKF8J1-Q",
      "title": "The Music Box | Full Spooky Thriller Movie",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nThe Music Box - When six-year-old Sophie is tragically orphaned guardianship is assigned to her estranged aunt Annabelle. The two move into a large, eerie, Victorian house where Sophie unearths a locked wooden box with a strange symbol drawn on it. Desperate to connect with her niece Annabelle pries the lock open revealing a beautiful music box. Each time the music box is wound and replayed it's surprisingly chilling melody plays slightly longer, captivating Sophie even more. When the music box begins affecting Sophie's behavior and health Annabelle seeks the aid of a child psychologist and clairvoyant who soon discover the music box is possessed by an evil spirit who seeks to haunt Sophie and destroy Annabelle. As the haunting intensifies time begins to run out and Annabelle finds herself racing against the music box's melody to defeat the spirit before the last note plays.\n\n2018\nStars: Antonio Lujak, Antonella Salvucci, Fiona Whitelaw\n\n★ Awesome Movies \n\nWelcome to the Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under license from various copyright holders. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n★ Buy some items from our merch store - \nhttps://teespring.com/stores/classic-movies-channel\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:11:20.710Z",
      "thumbnail": "https://i.ytimg.com/vi/AtRmKF8J1-Q/maxresdefault.jpg",
      "duration": 5080,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "29 min",
    "imdbRating": 7.9,
    "imdbVotes": 8136,
    "Genre": "Short, Comedy, Family",
    "Plot": "The Laurel &amp; Hardy Moving Co. have a challenging job on their hands (and backs): hauling a player piano up a monumental flight of stairs to Prof. von Schwarzenhoffen's house. Their task is complicated by a sassy nursemaid and, unbeknownst to them, the impatient Prof. von Schwarzenhoffen himself. But the biggest problem is the force of gravity, which repeatedly pulls the piano back down to the bottom of the stairs. Finally, the irate Professor explodes in fury to discover the \"mechanical blunderbuss\" in his home, not knowing it was a surprise birthday present from his wife.",
    "Director": "James Parrott",
    "Writer": "H.M. Walker, Oliver Hardy, Stan Laurel",
    "Actors": "Stan Laurel, Oliver Hardy, Dinah",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 2 wins total"
  },
  "relatedMovies": [
    "tt0019504",
    "tt0020264",
    "tt0019999",
    "tt0020489",
    "tt0019688",
    "tt0020161",
    "tt0017231",
    "tt0023669",
    "tt0024361",
    "tt0022402",
    "tt0025786",
    "tt0024852"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:23:33.999Z"
}