{
  "imdbId": "tt0066660",
  "title": "George!",
  "year": 1972,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4MqpnP32F_w",
      "id": "4MqpnP32F_w",
      "title": "George! (1972) DOG LOVER'S🍕 FAMILY COMEDY",
      "description": "It's Friday @PizzaFLIX \nStars: George, Marshall Thompson, Ingeborg Schöner, Jack Mullaney\nWriter/Director: Wallace C. Bennett\n\nIn this adorable family comedy, the tranquil life of an American pilot residing in the Swiss Alps is defrosted by the arrival of a slobbering 250 lb Saint Bernard. \n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nGet ready to fall in love with \"George,\" a heartwarming family comedy that will charm audiences of all ages! This delightful tale unfolds in the breathtaking Swiss Alps. An American pilot seeking peace in the serene mountain landscape finds his life turned upside down when a massive, lovable 250-pound Saint Bernard named George enters the scene. Chaos and comedy ensue as the mischievous George teaches life lessons about love, loyalty, and laughter.\n\nWritten and directed by Wallace C. Bennett, George is packed with hilarious moments and tender scenes, making it a must-watch for fans of family-friendly entertainment, dog lovers, and classic films. Whether you adore Saint Bernards, scenic adventures in the Swiss Alps, or the timeless charm of Marshall Thompson and Ingeborg Schöner, this film delivers smiles from start to finish.\n\nPerfect for movie nights with the whole family, this gem offers laughs, adventure, and a furry friend you'll never forget. Tune in now on PizzaFLIX for a comedy classic that brings the magic of the Swiss Alps to your screen! Don't miss out—subscribe for more adorable family comedies and timeless entertainment!",
      "addedAt": "2025-12-24T01:05:08.339Z",
      "thumbnail": "https://i.ytimg.com/vi/4MqpnP32F_w/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCY0jsW_QQkdwS86gjOE8CYZEFYwQ",
      "duration": 5823,
      "language": "en",
      "year": 1972,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "86 min",
    "imdbRating": 6.1,
    "imdbVotes": 117,
    "Genre": "Comedy, Family",
    "Plot": "After a St. Bernard named George is given to a relative by its owner, he causes mischief in the neighboring town and for his new owner. After enough terror while trying to get a girl, the new owner gives George to a monastery in the cold snowy mountain wasteland, until its original owner comes back to get him. However, during the night George escapes and finds himself trapped among the frozen wasteland. The only way for the new owner to get the girl and save George is to realize how important George truly is.",
    "Director": "Wallace C. Bennett",
    "Writer": "Wallace C. Bennett, Marshall Thompson",
    "Actors": "Marshall Thompson, Jack Mullaney, Ingeborg Schöner",
    "Language": "English",
    "Country": "Switzerland, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0067818",
    "tt0068670",
    "tt0066194",
    "tt0178401",
    "tt0031322",
    "tt0031580",
    "tt5863634",
    "tt0036696",
    "tt0058022",
    "tt0071085",
    "tt0043255",
    "tt0046799"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:35:10.193Z"
}