{
  "imdbId": "tt0021198",
  "title": "Officer O'Brien",
  "year": 1930,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=V97t60JER2E",
      "id": "V97t60JER2E",
      "title": "Officer O'Brien (1930) CRIME DRAMA",
      "description": "Stars: William Boyd, Ernest Torrence, Dorothy Sebastian \nDirector: Tay Garnett\n\nA straight-arrow police officer deals with his recently-paroled father, a former mob boss! Stars William Boyd later known as Hopalong Cassidy.",
      "addedAt": "2025-12-26T23:46:51.846Z",
      "thumbnail": "https://i.ytimg.com/vi/V97t60JER2E/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBrgSAAqADigIMCAAQARhlIGUoZTAP&rs=AOn4CLB9-_kc1XHKD9coCL9scVnwJ80WWw",
      "duration": 4550,
      "language": "en",
      "year": 1930,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "72 min",
    "imdbRating": 5,
    "imdbVotes": 63,
    "Genre": "Crime, Comedy, Drama",
    "Plot": "I just watched this PQ and sound was not so good but not unexpected for the age. I didn't take it for much of a comedy though did laugh out loud a few times.I like the director's other offerings over the many years of his career. Not this one. I like Hoppy Boyd so prejudiced in his favor. I do not go for the inability of some of the early attempts made by silent stars to recite lines.Most females considered acting with dialogue was a tremolo-quiver to indicate every emotion but a laugh, which also quivers. I did not see any real beauty of execution in this one. Lines seemed coached for every other word sometimes. Lots of the trouble was just newness of milieu-but there were far better films from that year and better execution ,pauses to send in lines or whatever. It is a film I watched start to finish and do not advise against it, just not the best of the year but an interesting historical piece showing all the obstacles that were overcome with in a couple of years. ground breakers , pioneers etc should be watches just is lousy.I would have liked it more as a silent. maybe it was released soundless in some theaters? Nearly forgot-Movie about an upwardly mobile cop who gets his jewel thief pop out of prison on parole without dad's knowledge- a serious cop hater somehow never knew his son became a cop while in the joint. twists and turns gives the movie some distinction but , still...",
    "Director": "Tay Garnett",
    "Writer": "Tom Buckingham",
    "Actors": "William Boyd, Ernest Torrence, Dorothy Sebastian",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019887",
    "tt0033062",
    "tt0020234",
    "tt0019414",
    "tt0021508",
    "tt0021890",
    "tt0020004",
    "tt0023935",
    "tt0023271",
    "tt0043390",
    "tt0031282",
    "tt0033038"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:33:13.863Z"
}