{
  "movieId": "tt0071508",
  "title": "Flesh for Frankenstein",
  "year": 1973,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/flesh-for-frankenstein",
      "id": "flesh-for-frankenstein",
      "title": "Flesh For Frankenstein",
      "description": "Within the decadent walls of the Frankenstein mansion, the Baron and his depraved assistant Otto have discovered the means of creating new life. As the Baron’s laboratory begins to fill up with stitched body parts, the Baroness dallies with the randy new manservant and soon the decadent, permissive household is consumed by an outrageous, bizarre, and hilarious orgy of death and dismemberment.",
      "fileSize": 213952499,
      "addedAt": "2026-01-07T00:08:24.396Z",
      "thumbnail": "https://archive.org/services/img/flesh-for-frankenstein",
      "collection": "feature_films",
      "downloads": 6620
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "95 min",
    "imdbRating": 5.8,
    "imdbVotes": 7188,
    "Genre": "Horror, Sci-Fi",
    "Plot": "In Serbia, middle-aged Baron Frankenstein lives with the Baroness Katrin, his wife/sister and their two teenage children, Monica and Erik. He dreams of a super-race, returning Serbia to its grand connections to ancient Greece. In his laboratory, assisted by Otto, he builds a desirable female body, but needs a male who will be super-body and super-lover. He thinks he has found just the right brain to go with a body he's built, but he's made an error, taking the head of a asexual ascetic. Meanwhile, the Baroness has her lusts, and she fastens on Nicholas, farmhand boy and a friend of the dead lad. Can the Baron pull off his grand plan? He brings the two zombies together to mate. Meanwhile, Nicholas tries to free his dead friend. What about the Baron's children?",
    "Director": "Paul Morrissey, Antonio Margheriti",
    "Writer": "Paul Morrissey, Tonino Guerra, Pat Hackett",
    "Actors": "Joe Dallesandro, Udo Kier, Dalila Di Lazzaro",
    "Language": "English, French",
    "Country": "United States, Italy, France",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0070222",
    "tt0068713",
    "tt0068615",
    "tt0069426",
    "tt0067017",
    "tt0072666",
    "tt0075343",
    "tt0074475",
    "tt0075990",
    "tt0060536",
    "tt0063145",
    "tt0076271"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.396Z"
}