{
  "imdbId": "tt0030833",
  "title": "Tarzan's Revenge",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tarzans_revenge",
      "title": "Tarzan's Revenge",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "tarzans_revenge"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=F5opMb8-o8s",
      "title": "Tarzan’s Revenge (1938) | Colorized Public Domain Jungle Adventure | Glenn Morris and Eleanor Holm",
      "description": "Tarzan’s Revenge (1938) is an American jungle adventure film directed by D. Ross Lederman and produced by Sol Lesser. This restored and colorized public domain edition brings back one of the most unique takes on Edgar Rice Burroughs’ legendary character. Released in the late 1930s, the film starred Olympic gold medalist Glenn Morris in his only screen appearance as Tarzan, alongside swimming champion Eleanor Holm in her first and only leading role. Unlike other Tarzan adaptations, this movie carries a distinctive blend of romance, colonial adventure, and athletic spectacle. Now brought to modern audiences in color, it can be appreciated both as a campy piece of cinematic history and a fascinating snapshot of pre-war Hollywood filmmaking.\n\nPlot Summary:\nThe story follows Tarzan (Glenn Morris), the famed jungle hero who encounters Eleanor Reed (Eleanor Holm), a visiting American on a family safari in Africa. Eleanor’s wealthy family is traveling with her fiancé, Nevin Potter (George Meeker), and her father, Roger Reed (George Barbier). During their expedition, they are threatened by a villainous sheik, Ben Alleu Bey (C. Henry Gordon), who desires Eleanor for his harem. Tarzan rescues her multiple times, leading to a bond that blossoms into romance. The film plays out as a mix of thrilling rescues, jungle chases, and exotic spectacle, with Tarzan using both brute strength and cunning to protect Eleanor from danger.\n\nCast and Crew:\n• Director: D. Ross Lederman\n• Producer: Sol Lesser\n• Screenplay: Robert Lee Johnson\n• Cinematography: George Meehan\n• Editing: Gene Milford\n\nStarring:\n• Glenn Morris as Tarzan\n• Eleanor Holm as Eleanor Reed\n• George Meeker as Nevin Potter\n• George Barbier as Roger Reed\n• Hedda Hopper as Penny Reed\n• C. Henry Gordon as Ben Alleu Bey\n• Joe Sawyer as Olaf Punch\n\nFilm Significance:\nTarzan’s Revenge is one of the lesser-known entries in the Tarzan film canon, notable for casting Olympic athletes instead of established Hollywood stars. Glenn Morris, gold medal decathlete at the 1936 Berlin Olympics, was promoted as a natural choice for the role of Tarzan, though this became his only film. Eleanor Holm, Olympic swimming champion, also made her sole starring role here. The movie reflects 1930s Hollywood’s fascination with exotic adventure stories and the blending of athletic stardom with cinematic spectacle. Although critically mixed at release, the film endures as a cultural curiosity, embodying the era’s pulp adventure style.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Tarzan’s Revenge remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1938 release was in black and white, typical for low-budget adventure films of its time. While historically authentic, modern audiences often overlook black-and-white cinema. By offering a colorized edition, we revive the exotic jungle settings and highlight the athletic performances of Glenn Morris and Eleanor Holm, making the film more accessible to new audiences while preserving its historical authenticity.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TarbansRevenge #Tarzan #GlennMorris #EleanorHolm #1930sAdventure #PublicDomainMovie #ColorizedClassic #ClassicCinema #JungleAdventure #FilmRestoration #GoldenAgeHollywood #1938Movies",
      "id": "F5opMb8-o8s",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Gp1u760sn_4",
      "title": "Tarzan's Revenge (1938) GLEN MORRIS🍕JUNGLE ADVENTURE",
      "description": "Stars: Glenn Morris, Eleanor Holm, George Barbier\nDirector: D. Ross Lederman\n\nEleanor and her parents are hunting big game, accompanied by her wimpish fiance. Ben lleu Bey wants to add her to his 100-woman harem. Tarzan wants her too.\n\nMovie Class by PizzaFLIX: Hollywood pioneer, Sol Lesser acquired the lucrative rights to five Tarzan films from a bankrupt independent producer in 1932. After the success of MGM's big-budget Tarzan starring Johnny Weissmuller, Lesser cashed in with TARZAN THE FEARLESS (1933) casting Olympic swimmer Buster Crabbe. He sold his rights for 3 films to MGM, but Lesser produced TARZAN'S REVENGE (1938,) casting yet another Olympian Glenn Morris as the Ape Man.",
      "id": "Gp1u760sn_4",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": "4.7",
    "imdbVotes": "739",
    "Genre": "Adventure, Family",
    "Plot": "In Africa to collect specimens for zoos Roger and Penny Reed, their daughter Eleanor and her fiancé Nevin Potter are led by the corrupt guide Olaf Punch who is in the pay of the local ruler Ben Alleu Bey. Tarzan rescues Eleanor when she becomes trapped in a mud pit. No one will believe her story of a white man who came to her rescue however. When a lioness tries to free her captured cubs, Tarzan is again forced to save Eleanor and then also frees the animals that have so far been captured. Punch has been payed to deliver Eleanor to Ben Alleu Bey to get the girl for him and when she is taken captive by tribesmen loyal to Alleu Bey, Tarzan has to save her one last time.",
    "Director": "D. Ross Lederman",
    "Writer": "Robert Lee Johnson, Jay Vann, Edgar Rice Burroughs",
    "Actors": "Glenn Morris, Eleanor Holm, George Barbier",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0030832",
      "title": "Tarzan and the Green Goddess",
      "year": 1938,
      "imdbRating": "4.4",
      "imdbVotes": "569",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029844",
      "title": "The Adventures of Tom Sawyer",
      "year": 1938,
      "imdbRating": "7.0",
      "imdbVotes": "2,371",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030138",
      "title": "Flash Gordon's Trip to Mars",
      "year": 1938,
      "imdbRating": "6.9",
      "imdbVotes": "1,106",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028827",
      "title": "Elephant Boy",
      "year": 1937,
      "imdbRating": "6.4",
      "imdbVotes": "856",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0029081",
      "title": "King Solomon's Mines",
      "year": 1937,
      "imdbRating": "6.3",
      "imdbVotes": "1,484",
      "language": "Spanish, English, Portuguese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029751",
      "title": "Wee Willie Winkie",
      "year": 1937,
      "imdbRating": "6.9",
      "imdbVotes": "1,972",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031394",
      "title": "The Green Hornet",
      "year": 1940,
      "imdbRating": "6.5",
      "imdbVotes": "764",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0032475",
      "title": "Flash Gordon Conquers the Universe",
      "year": 1940,
      "imdbRating": "6.6",
      "imdbVotes": "1,573",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0028444",
      "title": "Undersea Kingdom",
      "year": 1936,
      "imdbRating": "4.6",
      "imdbVotes": "623",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027623",
      "title": "Flash Gordon",
      "year": 1936,
      "imdbRating": "7.0",
      "imdbVotes": "2,758",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035610",
      "title": "Adventure in Iraq",
      "year": 1943,
      "imdbRating": "5.1",
      "imdbVotes": "191",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026164",
      "title": "Call of the Wild",
      "year": 1935,
      "imdbRating": "6.8",
      "imdbVotes": "2,715",
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T01:57:33.000Z"
}