{
  "imdbId": "tt0026912",
  "title": "The Raven",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-raven.-1935",
      "id": "the.-raven.-1935",
      "title": "The Raven (1935)",
      "description": "The Raven is a 1935 American horror film directed by Louis Friedlander and starring Boris Karloff and Bela Lugosi. It  follows Dr. Richard Vollin, a neurosurgeon obsessed with Edgar Allan Poe, who becomes infatuated with a young dancer named Jean Thatcher after he saves her life following a car accident. As his obsession grows, he uses a fugitive criminal, Edmond Bateman, to carry out his twisted plans involving torture and revenge against those who stand in the way of his desires.",
      "fileSize": 1100162239,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-raven.-1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 445
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 6.8,
    "imdbVotes": 6964,
    "Genre": "Crime, Horror",
    "Plot": "A wealthy judge coaxes the brilliant but eccentric neurological surgeon Dr. Vollin (Lugosi), who also has an obsessive penchant for Edgar Allen Poe, out of retirement to save the life of his daughter, a dancer crippled and brain damaged in an auto wreck. Vollin restores her completely, but also envisions her as his \"Lenore,\" and cooks up a scheme to kidnap the woman and torture and kill her fiance' and father in his Poe-inspired dungeon. To do his dirty work, Vollin recruits a wanted criminal (Karloff), and turns him into a hideous monster to guarantee his subservience.",
    "Director": "Lew Landers",
    "Writer": "Edgar Allan Poe, David Boehm, Guy Endore",
    "Actors": "Boris Karloff, Bela Lugosi, Lester Matthews",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0024894",
    "tt0026758",
    "tt0027479",
    "tt0030353",
    "tt0022663",
    "tt0023249",
    "tt0031208",
    "tt0031614",
    "tt0023790",
    "tt0024538",
    "tt0024649",
    "tt0038418"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}