{
  "imdbId": "tt0001741",
  "title": "The Long Road",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheLongRoad",
      "id": "PreviewTheLongRoad",
      "title": "\"The Long Road\" (1911) director D. W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Long Road\" is a short drama, included in our program to illustrate the work of Robert Harron and Billy Bitzer, stars of Silent Hall of Fame. A woman becomes a nun after losing her fiance to another woman. Years later she meets him again in desperate circumstances. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Blanche Sweet, Charles West, Claire McDowell, Kate Bruce, Robert Harron Distributed by                   Biograph Company Release date                      October 26, 1911 Country                             United States Running time                    13 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 16945073,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheLongRoad",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 4344
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 4.4,
    "imdbVotes": 23,
    "Genre": "Short, Drama",
    "Plot": "At a garden party, Edith, in a spirit of coquetry, arouses the jealousy of Neil, her fiancé, who, taking her action seriously, gives a parasol, which he intended as a present for her, to another girl. This induces a quarrel, and both stubborn, the break is never mended. Hence, he marries the other girl. Heart-crushed, Edith seeks solace in the convent of a Sister of Mercy. Sometime later, fate ordains it that she be assigned to embroider the layette of Ned's first baby, a task often undertaken by the Sisters. This, you may imagine, is a terrible ordeal, but there is no help for it and the task is finished, which brings about the first meeting since the day of the garden fete between the two women. Several years later, while Edith is working among the poor of the East Side, she is startled by the sound of a shot, and following a small boy into the saloon from whence the sound came, finds Ned, who, having suffered business reverses, and become a hopeless drunkard, the accidental victim of the shot, with his child, now grown to boyhood, and his wife by his side. Ned has now reached the final turn in the road.",
    "Director": "D.W. Griffith",
    "Writer": "Bernardine R. Leist",
    "Actors": "Blanche Sweet, Grace Henderson, Charles West",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001753",
    "tt0001499",
    "tt0002190",
    "tt0001978",
    "tt0001740",
    "tt0001265",
    "tt0002408",
    "tt0002212",
    "tt0001315",
    "tt0001439",
    "tt0002162",
    "tt0002176"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}