{
  "imdbId": "tt0054285",
  "title": "Atom Age Vampire",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AtomAgeVampire",
      "id": "AtomAgeVampire",
      "title": "Atom Age Vampire",
      "description": "After a beauty is mangled in a car accident, a researcher uses a treatment he has created to restore her to her former self. However, the treatment comes with a high price.... This was originialy an Italian film titled \"Seddok, l'erede di Satana\" which was later dubbed into English and retitled \"Atomic Age Vampire\". You can find more information regarding this film on its IMDb page .",
      "fileSize": 3826454871,
      "addedAt": "2026-01-07T00:06:14.037Z",
      "thumbnail": "https://archive.org/services/img/AtomAgeVampire",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 231247
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/atom.-age.-vampire.-1960",
      "id": "atom.-age.-vampire.-1960",
      "title": "Atom Age Vampire (1960)",
      "description": "\"Atom Age Vampire\" is a 1960 Italian horror film directed by Anton Giulio Majano. It follows Jeanette Moreneau, a stripper who becomes disfigured in a car accident. A scientist, Dr. Alberto Levin, develops a serum to restore her beauty. However, as the treatment begins to fail, he resorts to unethical methods, including murder, to obtain the necessary ingredients for the serum. The film explores themes of obsession and the consequences of scientific experimentation.",
      "fileSize": 2874505250,
      "addedAt": "2026-01-07T00:07:31.712Z",
      "thumbnail": "https://archive.org/services/img/atom.-age.-vampire.-1960",
      "language": "eng",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 223
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/atom_age_vampire",
      "id": "atom_age_vampire",
      "title": "Atom Age Vampire",
      "description": "Taken from IMDB : A stripper is horribly disfigured in a car accident. A brilliant scientist develops a treatment that restores her beauty and falls in love with her. To preserve her appearance the doctor must give her additional treatments using glands taken from murdered women.",
      "fileSize": 1696111515,
      "addedAt": "2026-01-07T00:07:31.712Z",
      "thumbnail": "https://archive.org/services/img/atom_age_vampire",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 80616
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AtomAgeVampire1960",
      "id": "AtomAgeVampire1960",
      "title": "Atom Age Vampire (1960)",
      "description": "Atom Age Vampire is an Italian horror film ( Seddok, L'Erede di Satana ) that has has been dubbed into English. A car accident disfigures exotic dancer Jeanette Moreneau and after the plastic surgeons have given up on her Professor Alberto Levin offers to redeem her beauty by using his secret formula, Derma-25. The cure is not permanent though, and to make matters worse the mad professor soon becomes infatuated with his patient. You can find out more about Atom Age Vampire at A Passion For Horror",
      "fileSize": 1061300565,
      "addedAt": "2026-01-07T00:06:14.037Z",
      "thumbnail": "https://archive.org/services/img/AtomAgeVampire1960",
      "collection": "feature_films",
      "downloads": 52381
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=np9gqrqB1rs",
      "id": "np9gqrqB1rs",
      "title": "Atom Age Vampire (1960) HORROR",
      "description": "Stars: Alberto Lupo, Susanne Loret, Sergio Fantoni \n Director: Anton Giulio Majano\n\n The stripper Jeanette Moreneau is dumped by her boyfriend Pierre Mornet and she drives her car to talk to him. However, she has a car accident and the left side of her face is completely disfigured by horrible scars. She is approached in the hospital by Monique Riviere, who is the assistant and lover of Professor Alberto Levin, and she tells Jeanette that her face can be restored. Jeanette secretly goes to the professor's house and is treated by him, using a process that depends on the cells that Prof. Levin, who is also a monster that strangles his victim, removes from the women that he kills. While treating Jeanette, Prof. Levin falls in an unrequited love for her and kills Monique. Meanwhile, the police inspector that is investigating the mysterious murders, suspects of Prof. Levin.",
      "addedAt": "2025-12-26T23:54:51.132Z",
      "thumbnail": "https://i.ytimg.com/vi/np9gqrqB1rs/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLAHmYhdil0rK_2qhOrkZ77dGwK1Lw",
      "duration": 5173,
      "language": "en",
      "year": 1960,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "87 min",
    "imdbRating": 3.9,
    "imdbVotes": 1759,
    "Genre": "Horror, Sci-Fi",
    "Plot": "A stripper is horribly disfigured in a car accident. A brilliant scientist develops a treatment that restores her beauty and falls in love with her. To preserve her appearance the doctor must give her additional treatments using glands taken from murdered women. His unexplained ability to turn into a hideous monster helps with this problem but does nothing to win her love. The doctor's woes multiply as the police and the girl's boyfriend begin to close in on him.",
    "Director": "Anton Giulio Majano",
    "Writer": "Piero Monviso, Gino De Santis, Alberto Bevilacqua",
    "Actors": "Alberto Lupo, Susanne Loret, Sergio Fantoni",
    "Language": "Italian",
    "Country": "Italy, France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0053593",
    "tt0054099",
    "tt0054020",
    "tt0053337",
    "tt0054950",
    "tt0054673",
    "tt0052667",
    "tt0051064",
    "tt0052846",
    "tt0051947",
    "tt0054462",
    "tt0052969"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.712Z"
}