{
  "imdbId": "tt0033459",
  "title": "Cheers for Miss Bishop",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cheers-for-miss-bishop-1941",
      "title": "Cheers For Miss Bishop",
      "description": "Ella Bishop is an inhibited girl whose frustrations grow as she approaches womanhood. As a women, her ambitions to teach cause her to lose her only opportunity for true love. Ella's life becomes one of missed chances and wrong choices. As she reaches old age, she reflects back and realizes she allowed the years to go by without achieving what she believes to be her true fulfillment. However, her years have not been without glory, and her moment of triumph arrives when her numerous now-famous students from over the years, return to honor their beloved Miss Bishop. Watch on RetroFlix:  https://retroflix.org/cheers-for-miss-bishop-1941/",
      "id": "cheers-for-miss-bishop-1941"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cheers_for_miss_bishop",
      "title": "Cheers For Miss Bishop",
      "id": "cheers_for_miss_bishop"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sp3Nso-imsE",
      "title": "Cheers for Miss Bishop (1941) [Drama]",
      "description": "\"Cheers for Miss Bishop\" is a film based on the novel \"Miss Bishop\" by Bess Streeter Aldrich. This film marked the debut of Rosemary De Camp.\n\nMiss Ella Bishop is a teacher at a small town Midwestern college. The story is told in flashback and takes place over many years, from the 1880s to the 1930s, showing her from her freshman year to her retirement as an old woman. At the beginning, she lives with her mother and her vixenish cousin Amy; she remembers when her father had a farm near the town. Ella is an inhibited girl whose frustration grows as she approaches womanhood. Her ambition to teach causes her to lose her only opportunity for true love, and her life becomes one of missed chances and wrong choices.\n\nShe is engaged to lawyer Delbert Thompson; but she learns, to her distress, that Amy is pregnant by him. Delbert and Amy run off together; but Amy dies in childbirth, leaving Ella to care for Amy's daughter Hope. Hope grows up and marries Richard, and they move away and have a daughter named Gretchen. Ella also has a fling with another teacher, the unhappily married John Stevens, but she eventually breaks off the relationship; later, she is distressed to learn that John has been killed.\n\nThrough all the years, Ella is supported by her friend Sam Peters, a local grocer. Another source of support is Professor Corcoran, the college president who hires her as a teacher and persuades her to stay when she considers leaving. His death is a blow to Ella. As Ella reaches old age, she reflects back and realizes she allowed the years to go by without achieving what she believes to be true fulfillment. However, the years have not been without glory; and her moment of triumph arrives when her numerous now-famous students from over the years return to a testimonial dinner at the school to honour their beloved Miss Bishop.\n\n---\n\nDirected by Tay Garnett, produced by Richard A. Rowland, written by Bess Streeter Aldrich (novel), Stephen Vincent Benet, Sheridan Gibney and Adelaide Heilbron, starring Martha Scott as Ella Bishop, Edmund Gwenn as Professor Corcoran, Don Douglas as Delbert, William Gargan as Sam Peters, Sterling Holloway as Chris, Dorothy Peterson as Mrs. Bishop, Sidney Blackmer as John Stevens, Mary Anderson as Amy, Marsha Hunt as Hope and Rosemary De Camp as Minna.\n\n---\n\nSource: \"Cheers for Miss Bishop\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 April 2013. Web. 21 July 2013. http://en.wikipedia.org/wiki/Cheers_for_miss_bishop.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "sp3Nso-imsE",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=N6fwOBQswSE",
      "title": "Cheers for Miss Bishop (1941) DRAMA",
      "description": "Stars: Martha Scott, William Gargan, Edmund Gwenn \n Director: Tay Garnett\n\n In old age, Miss Bishop reminisces about her life. A dedicated teacher, she spent her whole life teaching at Midwestern College. She never married when her first love married her cousin and another could not get a divorce from his wife. When her cousin dies giving birth, she raises the girl as if she were her own daughter and names her Hope. Throughout her life, she proved to be an inspiration to many students, many of whom move on to great things. On her retirement, many of her students return to say farewell.",
      "id": "N6fwOBQswSE",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YH5Abr9Lwkc",
      "title": "Cheers for Miss Bishop (1941) Drama, Romance",
      "description": "Dedicated Midwestern teacher Ella Bishop is distressed when her fiancé runs off with her vixenish cousin Amy. After Amy dies in childbirth, Ella is left to care for Amy's daughter Hope.\n\nDirector: Tay Garnett\nWriters: Bess Streeter Aldrich (novel), Stephen Vincent Benet\nStars: Martha Scott, William Gargan, Edmund Gwenn  \nGenres: Classics, Drama, Romance \n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "YH5Abr9Lwkc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "95 min",
    "imdbRating": "6.4",
    "imdbVotes": "852",
    "Genre": "Drama, Romance",
    "Plot": "Spinster septuagenarian Ella Bishop, on the brink of retirement from her fifty-two year career as the freshman English teacher at small town Midwestern University, her alma mater, wants to look toward the future, but can't help reflect upon her past, what brought her to this point. Although she always wanted to be a teacher and was both surprised and ecstatic when her mentor, Midwestern's then President James Corcoran, offered her the English teacher opening upon graduation, she only saw it as one short phase of her life until she got married and had a family, unlike her younger cousin, Amy Saunders, who solely needed romance and love to feel fulfilled. She thinks about the two men with who she was mutually in love and would have married if she could have if it not for one circumstance or another, and the one man whose love for her was and is unrequited, at least in the romantic sense, but who was and has always been there for her. Although never haven given birth to a child of her own, she thinks about the many to who she has acted as a mother or grandmother either in a practical and/or emotional sense, including her many students, some who have gone on to great things, her niece Hope who she practically raised, and her grand-niece, Gretchen. She also thinks about having stayed at Midwestern in her home town, her career which was not always smooth sailing, especially with the changing times.",
    "Director": "Tay Garnett",
    "Writer": "Bess Streeter Aldrich, Stephen Vincent Benet, Adelaide Heilbron",
    "Actors": "Martha Scott, William Gargan, Edmund Gwenn",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 3 wins & 1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0033038",
      "title": "Seven Sinners",
      "year": 1940,
      "imdbRating": "6.5",
      "imdbVotes": "1,850",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0031282",
      "title": "Eternally Yours",
      "year": 1939,
      "imdbRating": "5.7",
      "imdbVotes": "851",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032881",
      "title": "Our Town",
      "year": 1940,
      "imdbRating": "6.5",
      "imdbVotes": "3,101",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034647",
      "title": "Destination Unknown",
      "year": 1942,
      "imdbRating": "6.7",
      "imdbVotes": "54",
      "language": "English, Chinese, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033062",
      "title": "Slightly Honorable",
      "year": 1939,
      "imdbRating": "6.0",
      "imdbVotes": "541",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033891",
      "title": "Meet John Doe",
      "year": 1941,
      "imdbRating": "7.6",
      "imdbVotes": "16,080",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034012",
      "title": "Penny Serenade",
      "year": 1941,
      "imdbRating": "7.0",
      "imdbVotes": "8,233",
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033399",
      "title": "Blonde Comet",
      "year": 1941,
      "imdbRating": "5.0",
      "imdbVotes": "112",
      "language": "English, Swedish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033526",
      "title": "Desperate Cargo",
      "year": 1941,
      "imdbRating": "5.2",
      "imdbVotes": "140",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033808",
      "title": "Lady from Louisiana",
      "year": 1941,
      "imdbRating": "5.8",
      "imdbVotes": "594",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034272",
      "title": "That Hamilton Woman",
      "year": 1941,
      "imdbRating": "7.2",
      "imdbVotes": "5,180",
      "language": "English, French, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0123126",
      "title": "Joven, viuda y estanciera",
      "year": 1941,
      "imdbRating": "8.0",
      "imdbVotes": "16",
      "language": "Spanish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:57:51.019Z"
}