{
  "imdbId": "tt0022086",
  "title": "Lonely Wives",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Lonely_Wives_1931",
      "title": "Lonely Wives",
      "description": "Pre-code fun with Edward Everett Horton.",
      "fileSize": 1987155514,
      "id": "Lonely_Wives_1931"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lonely-wives-1931",
      "title": "Lonely Wives (1931)",
      "description": "A highly respectable lawyer becomes a sexual animal after working hours; His live-in mother-in-law tries to keep him in line. When an actor-impersonator comes to see him, the two switch lives. Watch on RetroFlix:  https://retroflix.org/lonely-wives-1931/",
      "fileSize": 538827644,
      "id": "lonely-wives-1931"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5XBmIe3UPk0",
      "title": "Lonely Wives (1931) [Comedy]",
      "description": "Lonely Wives is a 1931 American comedy film directed by Russell Mack and starring Edward Everett Horton, Esther Ralston, and Laura La Plante. \n\nEdward Everett Horton plays Richard \"Dickie\" Smith, a respectable defence lawyer, for murder cases, who turns into an unfettered Don Juan, after the clock strikes 8 o'clock, in this Pre-Hays Code comedy. To fool his Mother-in-Law, Maude Eburne, as Mrs. Mantel, he hires famous vaudeville impersonator Felix, the Great Zero, played by Edward Everett Horton, in a double role, to stay at the house. While he goes out on the town, with his new, sultry secretary, Patsy Ruth Miller, as Kitty \"Minty\" Minter; and, his new client, Laura La Plante, as Diane O'Dare, unsuspecting that the husband she wants to divorce, for neglect, is actually Felix, the Great Zero, himself.\nWhen Esther Ralston, as Madeline Smith, returns early from her trip, Felix knows that the jig is up; or, is it.\n\nIt's a question of who's fooling who, which ends with an angry husband chasing them all with a loaded gun, an irate cabby looking for his fare, and a seemingly, flirtatious, fired, French maid. Meanwhile, Spencer Charters, as Andrews, the Butler, thinks he must have the DT's, seeing double of everyone. They know they'll reform their ways, if any of them survive the night.\n\n---\n\nDirected by Russell Mack, produced by E.B. Derr, written by Walter DeLeon and A.H. Woods (play), starring Edward Everett Horton as Richard \"Dickie\" Smith,, Esther Ralston as Madeline Smith, Laura La Plante as Diane O'Dare, Patsy Ruth Miller as Kitty \"Minty\" Minter, Spencer Charters as Andrews, the Butler, Maude Eburne as Mrs. Mantel and Maurice Black as Taxi Driver.\n\n---\n\nSource: \"Lonely Wives (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 9 January  2012. Web. 12 August 2012. http://en.wikipedia.org/wiki/Lonely_Wives_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "5XBmIe3UPk0",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1QFanwqvz10",
      "title": "Lonely Wives (1931) | Colorized Public Domain Pre-Code Comedy with Edward Everett Horton",
      "description": "Lonely Wives (1931) is an American pre-Code comedy directed by Russell Mack and distributed by Pathé Exchange. This restored and colorized public domain version breathes new life into a witty and daring comedy of errors from the early 1930s, making it engaging for today’s audiences across the United States, Europe, and beyond. With its fast-paced humor, mistaken identities, and risqué undertones, the film captures the unique charm of pre-Code Hollywood before the enforcement of the stricter Hays Code.\n\nPlot Summary:\nThe film follows Richard “Dickie” Smith (Edward Everett Horton), a seemingly respectable lawyer with a restless spirit. When his wife Madeline (Esther Ralston) leaves town, Richard sees an opportunity for romantic adventure. His plans become complicated when Felix, a vaudeville impersonator who happens to look exactly like him, enters the picture. Richard convinces Felix to take his place at home so that he can enjoy a night of freedom without being caught.\n\nChaos ensues when Richard’s wife unexpectedly returns, creating a storm of confusion, mistaken identities, and hilarious entanglements. The farcical situations spiral as friends, clients, and unsuspecting houseguests are caught in the deception. What begins as a clever scheme quickly turns into a whirlwind of comedic mishaps, exposing the risks of temptation and double lives.\n\nCast and Crew:\n• Director: Russell Mack\n• Producer: E.B. Derr\n• Screenplay: Walter DeLeon\n• Cinematography: Arthur L. Todd\n• Editing: Russell F. Schoengarth\n\nStarring:\n• Edward Everett Horton as Richard “Dickie” Smith / Felix\n• Esther Ralston as Madeline Smith\n• Laura La Plante as Diane O’Dare\n• Lew Cody as Jackson “Jack”\n• Maude Eburne as Mrs. Mantel\n• Spencer Charters as Judge Mantel\n\nFilm Significance:\nLonely Wives represents a fascinating example of pre-Code comedy, produced at a time when Hollywood films explored themes of marriage, fidelity, and sexual freedom with far fewer restrictions. Edward Everett Horton, later beloved for his supporting roles in 1930s screwball comedies, takes center stage in a dual role that showcases his impeccable timing and expressive physical comedy. Esther Ralston and Laura La Plante bring glamour and wit, while Lew Cody adds charisma as the roguish foil.\n\nFor modern audiences, this film offers both entertainment and a glimpse into the freer artistic climate of early 1930s Hollywood. It blends sophisticated wit with physical humor, paving the way for later screwball classics. The film also stands as a reminder of how the Production Code soon reshaped Hollywood storytelling, making Lonely Wives a rare snapshot of cinema’s more daring side.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Lonely Wives (1931) remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1931 release was black and white, typical of the era’s modest studio productions. While authentic to its time, many modern viewers skip past black-and-white comedies. By offering a colorized version, we bridge the gap between historical preservation and modern audience expectations. This makes the humor, energy, and style of pre-Code Hollywood more accessible to viewers who primarily consume content on TV screens and streaming platforms today.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from pre-Code comedies to culturally significant dramas. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#LonelyWives #PreCodeHollywood #EdwardEverettHorton #ClassicComedy #1930sMovies #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #EstherRalston #LauraLaPlante",
      "id": "1QFanwqvz10",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Dm2AED4QkeI",
      "title": "Lonely Wives (1931) EDWARD EVERETT HORTON ♥ PRE-CODE HOLLYWOOD",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Edward Everett Horton, Esther Ralston, Laura La Plante\nDirector: Russell Mack\n\nNAUGHTY PRE-CODE HOLLYWOOD FARCE! Complications arise when a womanizing lawyer hires a famous impersonator so he can play around while his wife is away.",
      "id": "Dm2AED4QkeI",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "85 min",
    "imdbRating": 6.2,
    "imdbVotes": 478,
    "Genre": "Comedy, Romance",
    "Plot": "A lonely husband whose wife has been away hires a lookalike impersonator to fill his place and fool his mother-in-law while he plays around with a pretty coquette. Confusion prevails when his wife returns that evening.",
    "Director": "Russell Mack",
    "Writer": "A.H. Woods, Walter DeLeon",
    "Actors": "Edward Everett Horton, Esther Ralston, Laura La Plante",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0021184",
      "title": "Night Work",
      "year": 1930,
      "imdbRating": 6.3,
      "imdbVotes": 120,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0021287",
      "title": "Reaching for the Moon",
      "year": 1930,
      "imdbRating": 5.5,
      "imdbVotes": 477,
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021649",
      "title": "Behind Office Doors",
      "year": 1931,
      "imdbRating": 6.1,
      "imdbVotes": 556,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022000",
      "title": "Indiscreet",
      "year": 1931,
      "imdbRating": 6.2,
      "imdbVotes": 1610,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022263",
      "title": "Le petit café",
      "year": 1931,
      "imdbRating": 6.6,
      "imdbVotes": 26,
      "language": "French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021910",
      "title": "Girls About Town",
      "year": 1931,
      "imdbRating": 6.9,
      "imdbVotes": 717,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022489",
      "title": "Tonight or Never",
      "year": 1931,
      "imdbRating": 6.6,
      "imdbVotes": 1604,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0022268",
      "title": "Platinum Blonde",
      "year": 1931,
      "imdbRating": 6.7,
      "imdbVotes": 3687,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025493",
      "title": "The Merry Widow",
      "year": 1934,
      "imdbRating": 7.2,
      "imdbVotes": 3336,
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023537",
      "title": "A Successful Calamity",
      "year": 1932,
      "imdbRating": 6.9,
      "imdbVotes": 528,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022628",
      "title": "The Animal Kingdom",
      "year": 1932,
      "imdbRating": 6.3,
      "imdbVotes": 1353,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020809",
      "title": "Dangerous Nan McGrew",
      "year": 1930,
      "imdbRating": 4.7,
      "imdbVotes": 80,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.892Z"
}