{
  "imdbId": "tt0060560",
  "title": "The Pornographers",
  "year": 1966,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-pornographers",
      "id": "the-pornographers",
      "title": "The Pornographers",
      "description": "Subu makes pornographic films. He sees nothing wrong with it. They are an aid to a repressed society, and he uses the money to support his landlady, Haru, and her family. From time to time, Haru shares her bed with Subu, though she believes her dead husband, reincarnated as a carp, disapproves. Director Shohei Imamura has always delighted in the kinky exploits of lowlifes, and in this 1966 classic, he finds subversive humor in the bizarre dynamics of Haru, her Oedipal son, and her daughter, the true object of her pornographer-boyfriend's obsession. Imamura's comic treatment of such taboos as voyeurism and incest sparked controversy when the film was released, but  The Pornographers  has outlasted its critics, and now seems frankly ahead of its time.",
      "fileSize": 10414507008,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-pornographers",
      "language": "jpn",
      "year": 1966,
      "collection": "feature_films",
      "downloads": 24440
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "120 min",
    "imdbRating": 7.2,
    "imdbVotes": 2586,
    "Genre": "Comedy, Drama",
    "Plot": "Mr. Ogata lives a complicated life: he is a pornographer making two skin flicks per day and trying to stay beneath the radar screen of the local mob; he deeply loves his ailing wife Haru who's cursed by the restless spirit of her dead first husband; he also has a mistress, a step-son who wants to go to university, and a step-daughter entering adolescence. He lusts after his step-daughter, and when Haru finds out about those sexual advances, she asks him to marry the girl. Haru even signs over her business to him, and a crisis ensues when Ogata uses her nest egg to buy equipment so he and his pals can set up their own film processing lab. Surreal images and events weave their way into Ogata's life.",
    "Director": "Shôhei Imamura",
    "Writer": "Akiyuki Nosaka, Shôhei Imamura, Koji Numata",
    "Actors": "Shôichi Ozawa, Sumiko Sakamoto, Keiko Sagawa",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "3 wins"
  },
  "relatedMovies": [
    "tt0054709",
    "tt0057829",
    "tt0063371",
    "tt0309401",
    "tt0060802",
    "tt0060586",
    "tt0057363",
    "tt0060584",
    "tt0060304",
    "tt0061407",
    "tt0060201",
    "tt0320675"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}