{
  "imdbId": "tt0029670",
  "title": "Thunder in the City",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThunderintheCity",
      "id": "ThunderintheCity",
      "title": "Thunder in the City",
      "description": "In this satire of British-American relations, Edward G. Robinson stars as Dan Armstrong, a hard-sell American salesman whose company sends him to England to learn how to tone down his act. There he meets some distant relatives, the aristocrats Sir Peter and Lady Challoner (Arthur Wontner and Annie Esmond). They invite him to their mansion for the weekend, where among the house guests are the penniless aristocrats the Duke and Duchess of Glenavon (Nigel Bruce and Constance Collier ) and their daughter Lady Patricia (Luli Deste), as well as a conniving stockbroker, Henry Graham Manningdale (Ralph Richardson). The Duke and Duchess own only an apparently worthless mine in Rhodesia that supposedly contains a metal called magnelite. Manningdale says that he will develop the mine in exchange for permission to marry Lady Patricia. Armstrong also has designs on Patricia, however, and he engineers a scheme to start a company and sell stock in the mine.",
      "fileSize": 1675954107,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/ThunderintheCity",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 85969
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=V8ozwIeiawE",
      "id": "V8ozwIeiawE",
      "title": "Thunder in the City (1937) EDWARD G. ROBINSON",
      "description": "It's Friday@PizzaFLIX\nStars: Edward G. Robinson, Nigel Bruce, Arthur Wontner, Ralph Richardson\nDirector: Marion Gering\nMusic Score: Miklos Rozsa\n\nEdward G. plays an American huckster visiting London, who engages in a bold business promotion the likes of which the British have never seen.\n\nTRIVIA: The aristocratic blue-eyed German actress, Luli Deste made her English-speaking film debut in Thunder in the City. She subsequently came to Hollywood with an entourage of three Afghan hounds but found quality roles hard to come by and quit film acting in 1941.",
      "addedAt": "2025-12-24T01:08:26.590Z",
      "thumbnail": "https://i.ytimg.com/vi/V8ozwIeiawE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC_RuudhXvmLu4GNxZ8E1Bd0_k2oA",
      "duration": 4771,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "87 min",
    "imdbRating": 6.1,
    "imdbVotes": 436,
    "Genre": "Comedy, Crime, Drama",
    "Plot": "Dan comes to England to learn more sedate business practices. While there he becomes involved in a scheme to exploit mangalite mines in Rhodesia. He and Manningdale become rivals for Patricia.",
    "Director": "Marion Gering",
    "Writer": "Robert E. Sherwood, Aben Kandel, Ákos Tolnay",
    "Actors": "Edward G. Robinson, Nigel Bruce, Constance Collier",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027214",
    "tt0028774",
    "tt0028748",
    "tt0028346",
    "tt0029199",
    "tt0027501",
    "tt0030261",
    "tt0182242",
    "tt0028405",
    "tt0028083",
    "tt0027863",
    "tt0031490"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.886Z"
}