{
  "imdbId": "tt0057156",
  "title": "The Horror of It All",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheHorrorOfItAll1964",
      "id": "TheHorrorOfItAll1964",
      "title": "The Horror Of It All (1964)",
      "description": "The Horror of It All  is a horror comedy directed by  Terence Fisher . It stars  Pat Boone ,  Erica Rogers, and  was made at Shepperton Studios in England. The story is essentially a comedic remake of the classic  Universal Studios  horror film  The Old Dark House  (1932) which had already been remade as a comedy,  The Old Dark House (1963 film) , a year earlier. The plot also has elements of the horror-comedy  Murder, He Says  (1945).",
      "fileSize": 1776770659,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheHorrorOfItAll1964",
      "language": "English",
      "year": 1964,
      "collection": "feature_films",
      "downloads": 6189
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "75 min",
    "imdbRating": 4.8,
    "imdbVotes": 442,
    "Genre": "Comedy, Horror, Mystery",
    "Plot": "American salesman Jack Robinson falls in love with Englishwoman Cynthia Marley and they visit her family so he can ask for permission to marry her. She points out to him that her relatives are rather eccentric and, by the way, a cousin has just died. The remaining members of the clan are; the sinister Reginal; Percival, an inventor who has recently discovered electricity, the phonograph, and several other handy items; Natalia, a macabre, vampire-like creature; Cornwallis, a hammy and dapper ex-actor; Grandfather, who lies bedridden upstairs; and, by the way, Muldoon, who is kept locked up in the fear that he will harm someone. Several attempts are made on his life which leads Jack to believe that the Marleys are a shade past eccentric. He becomes convinced that he is just in the way of one of the Marley's attempts to do away with the other Marleys, especially, during his investigation of the vanishing Marleys, when he learns that the family fortune consists of one million dollars and one of the Marleys intends to end up with all of it. He wants to contact the police but there is no phone or car on the premises.",
    "Director": "Terence Fisher",
    "Writer": "Ray Russell",
    "Actors": "Pat Boone, Erica Rogers, Dennis Price",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0055650",
    "tt0058155",
    "tt0052905",
    "tt0056285",
    "tt0013458",
    "tt0026819",
    "tt0037151",
    "tt0025169",
    "tt0031143",
    "tt0016123",
    "tt0017739",
    "tt0034850"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}