{
  "imdbId": "tt0013571",
  "title": "Salomé",
  "year": 1922,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0a0KTPeKw1M",
      "title": "Salomé (1922) | Colorized Public Domain Cult Classic Starring Alla Nazimova in Oscar Wilde’s Vision",
      "description": "Salomé (1922) is an American silent drama directed by Charles Bryant and produced by and starring Alla Nazimova. This striking adaptation of Oscar Wilde’s controversial 1891 play is one of the most visually distinctive films of the silent era. Presented here in a restored and colorized edition, this public domain masterpiece can now be appreciated by modern audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nSet in ancient Judea, the story follows Salomé (Alla Nazimova), the stepdaughter of King Herod (Mitchell Lewis). Obsessed with the imprisoned prophet John the Baptist, known as Jokanaan (Nigel De Brulier), Salomé becomes fascinated by his purity and strength, contrasting sharply with the corruption of Herod’s court. When Jokanaan rejects her advances, Salomé’s infatuation turns to vengeance.\n\nHerod, captivated by Salomé’s beauty, promises her anything she desires after she performs the sensual and unforgettable “Dance of the Seven Veils.” Instead of riches or power, she demands the head of Jokanaan on a silver platter. Herod, horrified, reluctantly complies, sealing the fate of all involved.\n\nThe film is remembered for its extravagant sets and costumes, heavily influenced by Art Nouveau and the illustrations of Aubrey Beardsley, whose drawings had accompanied Wilde’s original play. Nazimova, a pioneering figure in early Hollywood and one of the first openly queer actresses in the industry, poured her creative vision and financial resources into the production, resulting in a film that is as much a piece of visual art as it is cinema.\n\nCast and Crew:\n• Director: Charles Bryant\n• Producer: Alla Nazimova\n• Screenplay: Based on the play by Oscar Wilde\n• Cinematography: N/A (silent-era credits limited)\nStarring:\n• Alla Nazimova as Salomé\n• Mitchell Lewis as King Herod\n• Nigel De Brulier as Jokanaan (John the Baptist)\n• Rose Dione as Herodias\n• Arthur Jasmine as Herodias’ Page\n\nFilm Significance:\nSalomé is considered one of the boldest artistic experiments of silent Hollywood. Though it was a commercial failure in 1922, the film has since been praised for its daring visuals, theatrical style, and avant-garde aesthetic that pushed beyond the realism of its time. It represents early Hollywood’s willingness to experiment before the studio system standardized production. Today, it is studied for its queer subtext, radical design, and as an early feminist reading of Wilde’s play.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Salomé remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1922 release was entirely in black and white, with elaborate costumes and sets designed to mimic Aubrey Beardsley’s drawings. While visually striking, the lack of color left some of its artistic intention under-realized for modern viewers. This colorized version restores depth and vibrancy to the visuals, highlighting the opulence of the sets and costumes while keeping the silent-era aesthetic intact. By bridging the gap between historical authenticity and modern expectations, this edition makes Salomé more immersive for today’s audience.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten silent-era experiments to culturally significant Hollywood classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Salome1922 #AllaNazimova #OscarWilde #SilentFilmClassic #PublicDomainMovie #ColorizedClassic #SilentEraCinema #GoldenAgeHollywood #FilmRestoration #ArtNouveauFilm",
      "id": "0a0KTPeKw1M",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/salome-1922-muda-vose-kw-63zs-fw-nnc",
      "title": "Salomé (1922)",
      "description": "Based on Oscar Wilde’s play, the films tells the story of how Salomé agrees to dance for King Herod in return for the head of John the Baptist.",
      "fileSize": 462907553,
      "id": "salome-1922-muda-vose-kw-63zs-fw-nnc"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "72 min",
    "imdbRating": 6.6,
    "imdbVotes": 1123,
    "Genre": "Biography, Drama, History",
    "Plot": "Salome, the daughter of Herodias, seduces her step-father/uncle Herod, governor of Judea, with a salacious dance. In return, he promises her the head of the prophet John the Baptist.",
    "Director": "Charles Bryant, Alla Nazimova",
    "Writer": "Oscar Wilde, Alla Nazimova, Natacha Rambova",
    "Actors": "Alla Nazimova, Nigel De Brulier, Mitchell Lewis",
    "Language": "None",
    "Country": "United States",
    "Awards": "2 wins"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0014532",
      "title": "The Ten Commandments",
      "year": 1923,
      "imdbRating": 6.8,
      "imdbVotes": 2731,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0160467",
      "title": "The Life Story of David Lloyd George",
      "year": 1918,
      "imdbRating": 6.6,
      "imdbVotes": 102,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1441953",
      "title": "Testament of Youth",
      "year": 2014,
      "imdbRating": 7.2,
      "imdbVotes": 31170,
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Moviedome"
    },
    {
      "imdbId": "tt0045473",
      "title": "Admiral Ushakov",
      "year": 1953,
      "imdbRating": 7.3,
      "imdbVotes": 224,
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0060107",
      "title": "Andrei Rublev",
      "year": 1966,
      "imdbRating": 8,
      "imdbVotes": 58379,
      "language": "Russian, Italian, Tatar",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0086891",
      "title": "Anatomy of an Illness",
      "year": 1984,
      "imdbRating": 6.4,
      "imdbVotes": 116,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024966",
      "title": "Chapaev",
      "year": 1934,
      "imdbRating": 7,
      "imdbVotes": 1461,
      "language": "Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0266425",
      "title": "Conspiracy",
      "year": 2001,
      "imdbRating": 7.6,
      "imdbVotes": 28545,
      "language": "English, German, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033451",
      "title": "Carl Peters",
      "year": 1941,
      "imdbRating": 5.7,
      "imdbVotes": 64,
      "language": "German, English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt9071322",
      "title": "Dark Waters",
      "year": 2019,
      "imdbRating": 7.6,
      "imdbVotes": 118173,
      "language": "English, Korean",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007801",
      "title": "Cleopatra",
      "year": 1917,
      "imdbRating": 6.6,
      "imdbVotes": 413,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053800",
      "title": "Esther and the King",
      "year": 1960,
      "imdbRating": 5.5,
      "imdbVotes": 883,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.951Z"
}