{
  "movieId": "tt0019489",
  "title": "The Trail of '98",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-trail-of-98-1928",
      "id": "the-trail-of-98-1928",
      "title": "The Trail Of '98 (1928)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. This period piece stars Dolores del Rio and Harry Carey as a couple who upend their lives to search for gold, although Carey's character lets his greed get the best of him. During production six crew were killed. Three from a chunk of snow and ice falling on them, and another three stuntmen drowned in rapids during a stunt sequence. Reviews were mixed, and box office was middling, but action sequences were praised.",
      "fileSize": 3577128733,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-trail-of-98-1928",
      "language": "eng",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 68
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-trail-of-98_1928",
      "id": "the-trail-of-98_1928",
      "title": "The Trail of '98",
      "fileSize": 6163977487,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-trail-of-98_1928",
      "language": "English",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 955
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "87 min",
    "imdbRating": 7,
    "imdbVotes": 457,
    "Genre": "Action, Adventure, Drama",
    "Plot": "The Klondike gold strike of 1897 inspires fortune-seekers to head for Alaska. Joe and Jim, brothers from South Carolina; Lars, escaping a shrewish wife in Michigan; a poor farmer from Kansas; weathered prospectors from Nevada; and countless others leave San Francisco by ship. The Bulkys head north to open a restaurant, bringing a poor relative, Berna, along to help. On board Berna meets Larry and falls in love. The overland route to Dawson City is hazardous and arduous. Each person must carry their own food, a ton of it. That means traveling 80 miles back and forth to advance one mile, carrying 50 pounds a trip. The Chilkoot Pass is one of the worst sections of the trail. In the spring the trekkers take to the rivers, swollen by melting ice. Whitehorse Rapids proves the last and biggest obstacle to reaching the gold fields. But that's not the end of the hardships. Claim jumping, blizzards, fires, and Berna's honor at stake are to be faced before striking it rich.",
    "Director": "Clarence Brown",
    "Writer": "Robert W. Service, Benjamin Glazer, Joseph Farnham",
    "Actors": "Dolores Del Río, Ralph Forbes, Karl Dane",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0019434",
    "tt0015772",
    "tt0020210",
    "tt0045039",
    "tt0019591",
    "tt0016641",
    "tt0022399",
    "tt0022957",
    "tt0377062",
    "tt0072231",
    "tt0034428",
    "tt0052604"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}