{
  "movieId": "tt0041498",
  "title": "I Was a Male War Bride",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/i-was-a-male-war-bride-1949",
      "id": "i-was-a-male-war-bride-1949",
      "title": "I Was a Male War Bride (1949)",
      "description": "After marrying an American lieutenant with whom he was assigned to work in  post-war Germany, a French captain attempts to find a way to accompany her back  to the States under the terms of the War Bride Act. Watch on RetroFlix:  https://retroflix.org/i-was-a-male-war-bride-1949/",
      "fileSize": 465740855,
      "addedAt": "2026-01-07T00:08:46.615Z",
      "thumbnail": "https://archive.org/services/img/i-was-a-male-war-bride-1949",
      "language": "eng",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 163
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "105 min",
    "imdbRating": 7,
    "imdbVotes": 9345,
    "Genre": "Comedy, Romance, War",
    "Plot": "In post-war, French Army Captain Henrí Rochard and US Army Lieutenant Catherine Gates, stationed in Heidelberg, West Germany, are often teamed on missions. Their personal relationship teeters from being friendly enough to Catherine not sure if she wants to spend any time with him, professionally or personally, as he is the type who will chase anything in a skirt, while she knows she ultimately wants to be with the type of man who only wants one \"skirt\", namely hers. Their latest mission, what will be their last together before he is decommissioned, is punctuated by them getting into one misadventure after another, and despite those mishaps, they come to realize that they love each other on the fact that they would never see each other again after their return to Heidelberg, and want to get married. That want starts the bureaucratic nightmare they face, ranging the gamut of military policies and civil laws in whatever jurisdiction they are in. That nightmare culminates when Catherine's unit is being shipped back to the United States, the only way that Henrí can enter the United States as her spouse being under the War Brides Act. Henrí ends up being classified among one hundred thirty-nine other war brides, one hundred twenty-six children of war brides, nine dogs, three cats, two canaries and one parrot, none having as much trouble that he has despite he being \"approved\" as \"Mrs. Henrí Rochard\".",
    "Director": "Howard Hawks",
    "Writer": "Charles Lederer, Leonard Spigelgass, Hagar Wilde",
    "Actors": "Cary Grant, Ann Sheridan, Marion Marshall",
    "Language": "English, German, French",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0032599",
    "tt0045810",
    "tt0058324",
    "tt0044916",
    "tt0040395",
    "tt0041089",
    "tt0233667",
    "tt0034854",
    "tt0041509",
    "tt0041587",
    "tt0130153",
    "tt0020838"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "war",
      "name": "War"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.615Z"
}