{
  "imdbId": "tt0028575",
  "title": "Angel",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/angel-1937_202508",
      "id": "angel-1937_202508",
      "title": "Angel (1937)",
      "description": "Neglected by her diplomat husband, Lady Maria seeks escape in Paris and shares a fleeting affair with a charming stranger. But when love and secrets collide back home, she must choose between passion and loyalty. A tale of temptation, mistaken identities, and rediscovered devotion, where one woman’s heart threatens to unravel everything she thought she knew. Watch on RetroFlix:  https://retroflix.org/angel-1937/",
      "fileSize": 1547920445,
      "addedAt": "2026-01-07T00:07:24.999Z",
      "thumbnail": "https://archive.org/services/img/angel-1937_202508",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 157
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "91 min",
    "imdbRating": 7.2,
    "imdbVotes": 3607,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Lord Frederick Barker is the British representative to the League of Nations. Current geopolitical tensions, which could lead to war if not dealt with, have him preoccupied with work, he more often than not feeling the need to deal with issues rather than delegate them to subordinates. As such, his wife, Lady Maria Barker, is feeling neglected, Frederick, totally devoted to and in love with his wife, unaware of her feelings. While he is in Geneva for work, she secretly flies to Paris under an assumed name to deal with her emotions with her old friend, the Grand Duchess Anna Dmitrievna formerly of Russia, the only person in Paris who knows her true identity. The Grand Duchess' general role in her social circle is to facilitate good times for others, with unspoken discretion. It is at the Grand Duchess' salon that Maria meets playboy Anthony Halton. While spending the evening together, Maria and Tony fall in love with each other, with Maria, under the circumstances, refusing to divulge her name or her situation to him, and thus neither using any names for each other except what he ends up calling her: his Angel. Maria promises to make up her mind if there is a future for them if she shows up the following Wednesday at 5pm back at the Grand Duchess' salon, the intervening time which she will spend back in London with Frederick to evaluate the situation and her feelings. Complicating matters is that Tony and Frederick were casual acquaintances during the Great War, they who have just reconnected and become friends in their mutual admiration for each other. Thus, the question becomes who, if anyone, will show up at the Grand Duchess' salon at the appointed time.",
    "Director": "Ernst Lubitsch",
    "Writer": "Melchior Lengyel, Guy Bolton, Russell G. Medcraft",
    "Actors": "Marlene Dietrich, Herbert Marshall, Melvyn Douglas",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0011960",
    "tt0029861",
    "tt0029929",
    "tt0026276",
    "tt0028557",
    "tt0320737",
    "tt0029298",
    "tt0025493",
    "tt0033038",
    "tt0027311",
    "tt0027286",
    "tt0028010"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.999Z"
}