{
  "imdbId": "tt0015002",
  "title": "Hot Water",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hotwater4k",
      "title": "Hot Water (1924) [Colorized, 4K, 60FPS]",
      "description": "Hot Water  is a 1924 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io A.I. Upscaling to 4K:  https://ffmpeg.org GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "hotwater4k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=J8lkfgHd-98",
      "title": "Hot Water (1924) | Colorized Public Domain Silent Comedy Classic with Harold Lloyd",
      "description": "Hot Water (1924) is an American silent comedy film starring Harold Lloyd, one of the great icons of early Hollywood and a pioneer of physical comedy. Directed by Fred C. Newmeyer and Sam Taylor, this restored and colorized public domain edition brings new energy to one of Lloyd’s lesser-known but inventive features. Released during the height of the silent film era, Hot Water cleverly blends slapstick gags, domestic comedy, and absurd social scenarios that highlight Harold Lloyd’s everyman charm and his impeccable comic timing. By presenting this 1920s gem in color, audiences in the United States, Europe, and worldwide can rediscover the humor that defined the Golden Age of silent cinema.\n\nPlot Summary:\nHot Water unfolds in a series of comedic episodes centered on Harold Lloyd as the long-suffering husband of Mildred Davis. The film’s episodic structure plays out in three memorable parts. The first involves Harold’s comically chaotic attempt to bring home groceries and navigate public transportation, only for small mishaps to spiral into slapstick disaster. The second section highlights his misadventures with a new automobile, a status symbol in the 1920s, leading to a parade of laugh-inducing crashes, police encounters, and mechanical troubles. The final act places Harold in the middle of domestic farce when his in-laws come to live with him, creating tensions, misunderstandings, and comic clashes that spiral out of control. Each section showcases Lloyd’s trademark blend of relatability, physical comedy, and escalating absurdity.\n\nWhat makes Hot Water stand out is how it portrays middle-class anxieties of the 1920s, from adjusting to modern inventions like the automobile to the timeless struggles of marriage and family life. Harold Lloyd’s performance carries the film with a mix of charm and resilience that made him one of the top three silent comedians, alongside Charlie Chaplin and Buster Keaton.\n\nCast and Crew:\n• Directors: Fred C. Newmeyer and Sam Taylor\n• Producer: Hal Roach\n• Cinematography: Walter Lundin\n• Editing: Allen McNeil\nStarring:\n• Harold Lloyd as Himself, the Husband\n• Mildred Davis as The Wife\n• Josephine Crowell as Mother-in-law\n• Charles Stevenson as Brother-in-law\n• Jackie Condon as Son-in-law\n• Andy Clark as Baby\n\nFilm Significance:\nThough not as widely remembered as Harold Lloyd’s Safety Last! (1923) or The Freshman (1925), Hot Water represents an important example of his ability to turn everyday scenarios into timeless comedy. Its three-part structure, each packed with gags and escalating farce, was unusual at the time and showcases the innovation of Lloyd and his creative team at Hal Roach Studios. The film also provides modern viewers with a humorous yet genuine window into 1920s American culture, from suburban life to the rise of the automobile as both a convenience and a headache.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Hot Water remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1924 release was silent and black and white, typical of its era. While historically authentic, many modern audiences skip over silent films due to their format. By offering a colorized and restored edition, we bridge the gap between film history and modern entertainment habits. With Harold Lloyd’s universal comedy style, this colorized version allows contemporary audiences to enjoy his genius without the barrier of outdated visuals.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#HotWater1924 #HaroldLloyd #SilentComedy #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentFilmEra #FilmRestoration #ClassicComedy #GoldenAgeHollywood",
      "id": "J8lkfgHd-98",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-hot-water",
      "title": "Hot Water",
      "id": "silent-hot-water"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "53 min",
    "imdbRating": "7.1",
    "imdbVotes": "1,531",
    "Genre": "Comedy",
    "Plot": "Episodic look at married life and in-law problems. Adventures include a ride on a crowded trolley with a live turkey; a wild spin in a new auto with the in-laws in tow; and a sequence in which Hubby accidently chloroforms his mother-in-law and is convinced that he has killed her. When she begins sleep-walking, he thinks that she has returned to haunt him.",
    "Director": "Fred C. Newmeyer, Sam Taylor",
    "Writer": "Sam Taylor, John Grey, Tim Whelan",
    "Actors": "Harold Lloyd, Jobyna Ralston, Josephine Crowell",
    "Language": "None",
    "Country": "United States",
    "Awards": "2 wins"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0014945",
      "title": "Girl Shy",
      "year": 1924,
      "imdbRating": "7.7",
      "imdbVotes": "3,618",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014611",
      "title": "Why Worry?",
      "year": 1923,
      "imdbRating": "7.3",
      "imdbVotes": "2,102",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0015841",
      "title": "The Freshman",
      "year": 1925,
      "imdbRating": "7.5",
      "imdbVotes": "6,373",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0014429",
      "title": "Safety Last!",
      "year": 1923,
      "imdbRating": "8.1",
      "imdbVotes": "23,503",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013075",
      "title": "Dr. Jack",
      "year": 1922,
      "imdbRating": "7.1",
      "imdbVotes": "1,707",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018051",
      "title": "The Kid Brother",
      "year": 1927,
      "imdbRating": "7.6",
      "imdbVotes": "4,920",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013201",
      "title": "Grandma's Boy",
      "year": 1922,
      "imdbRating": "7.0",
      "imdbVotes": "1,999",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0373309",
      "title": "Shine 'em Up!",
      "year": 1922,
      "imdbRating": "5.8",
      "imdbVotes": "64",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015477",
      "title": "West of Hot Dog",
      "year": 1924,
      "imdbRating": "5.6",
      "imdbVotes": "305",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014664",
      "title": "Alice's Spooky Adventure",
      "year": 1924,
      "imdbRating": "5.3",
      "imdbVotes": "262",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0141028",
      "title": "Felix Goes West",
      "year": 1924,
      "imdbRating": "5.7",
      "imdbVotes": "109",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014992",
      "title": "His New Mamma",
      "year": 1924,
      "imdbRating": "5.7",
      "imdbVotes": "117",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.120Z"
}