{
  "movieId": "tt0050717",
  "title": "The Robot vs. The Aztec Mummy",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iNQWSJ570rg",
      "id": "iNQWSJ570rg",
      "title": "The Robot vs. the Aztec Mummy (1958) [Adventure] [Horror] [Science Fiction]",
      "description": "\"The Robot vs the Aztec Mummy\" (originally \"La momia azteca contra el robot humano\") is an Mexican film directed by Rafael Portillo, starring Ramón Gay and Rosa Arenas. It blends elements of science fiction and horror. The film is the sequel to The Aztec Mummy and The Curse of the Aztec Mummy, both released earlier that year, and a large portion of the film consists of an extended recap of the first two entries in the series. The film is also known as \"The Aztec Mummy Against the Humanoid Robot\" or \"Aztec Mummy vs. the Human Robot\".\n\nThe evil Dr. Krupp (Luis Aceves Castañeda), also known as \"The Bat\", plots to steal a valuable Aztec treasure from the tomb of a centuries-old living mummy, Popoca (Angel di Stefani). Krupp builds a robot to defeat the mummy. Krupp's former colleague Dr. Eduardo Almada (Ramón Gay) and associates work to stop the mad scientist from creating his robot.\n\nThe movie shows a notable lack of awareness of Mesoamerican civilizations, as it suggests the Aztecs practiced mummification and used hieroglyphics. In reality, they had no system of writing and practiced cremation and (more often) simple burial. It was the Inca civilization that practiced mummification, and the Maya who had a system of hieroglyphics. Also, the mummy is depicted in the Egyptian style (upright or lying on its back) rather than in the Inca style (hunched into a ball with its feet pulled to the body and its knees close to the face).\n\n---\n\nDirected by Rafael Portillo, produced Guillermo Calderón, written by Guillermo Calderón (original story) and Alfredo Salazar (original story and adaptation), starring Ramón Gay as Dr. Eduardo Almada, Rosa Arenas as Flor Almada / Xochitl, Crox Alvarado as Pinacate, Luis Aceves Castañeda Dr. Krupp, Jorge Mondragón as Dr. Sepúlveda, Arturo Martínez as Tierno, Emma Roldán as Maria, the housekeeper, Julián de Meriche as Comandante Salvador Lozano, Jaime González Quiñones as Pepe Almada, Ángel Di Stefani as Popoca (the Mummy), Adolfo Rojas, Jesús Murcielago Velázquez as El Murciélago, Enrique Yáñez as Esbirro del Murciélago, Guillermo Hernández as Esbirro del Murciélago, Alberto Yáñez as Esbirro del Murciélago, Firpo Segura as Esbirro del Murciélago and Sergio Yañez as Esbirro del Murciélago.\n\n---\n\nSource: \"The Robot vs. The Aztec Mummy\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 5 April 2013. Web. 23 June 2013. http://en.wikipedia.org/wiki/The_Robot_vs._The_Aztec_Mummy.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:18.741Z",
      "thumbnail": "https://i.ytimg.com/vi/iNQWSJ570rg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDxLrvimWsPrXVmRHcfwmEW9p1pvg",
      "duration": 3866,
      "language": "en",
      "year": 1958,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB",
          "MX"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iplNK6vZzl4",
      "id": "iplNK6vZzl4",
      "title": "The Robot vs. The Aztec Mummy (1958) See the relentless machine battle the gruesome corpse",
      "description": "A mad doctor (Luis Aceves Castañeda) builds a robot (Adolfo Rojas) in order to steal a valuable Aztec treasure from a tomb guarded by a centuries-old living mummy (Ángel Di Stefani).\n\nColorized version https://youtu.be/7F1T8YOMtvE\n\n\nOriginal title: La Momia Azteca contra El Robot Humano (1958)\nAlternative titles: The Aztec Mummy Against the Humanoid Robot, Momia Azteca vs Robot Humano, Aztec Mummy vs. the Human Robot, Die Azteken-Mumie gegen den Menschen-Roboter, La momie aztèque contre le robot, Il terrore viene d'oltretomba\n\nDirector: Rafael Portillo\nWriters: Guillermo Calderón, Alfredo Salazar\nStars: Ramón Gay, Rosita Arenas, Luis Aceves Castañeda, Ángel Di Stefani, Adolfo Rojas\nGenres: Horror, Sci-Fi\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:39.310Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/iplNK6vZzl4/maxresdefault.webp?v=670474ae",
      "duration": 3867,
      "language": "en",
      "year": 1958,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "65 min",
    "imdbRating": 2.4,
    "imdbVotes": 2859,
    "Genre": "Horror, Sci-Fi",
    "Plot": "A mad doctor builds a robot in order to steal a valuable Aztec treasure from a tomb guarded by a centuries-old living mummy.",
    "Director": "Rafael Portillo",
    "Writer": "Guillermo Calderón, Alfredo Salazar",
    "Actors": "Ramón Gay, Rosita Arenas, Crox Alvarado",
    "Language": "Spanish",
    "Country": "Mexico",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0050393",
    "tt0051993",
    "tt0052187",
    "tt0052228",
    "tt0051432",
    "tt0051020",
    "tt0052379",
    "tt0051507",
    "tt0051631",
    "tt0051948",
    "tt0050894",
    "tt0051418"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:34:57.871Z"
}