{
  "movieId": "tt0053226",
  "title": "Room at the Top",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ROOMATTHETOP_201601",
      "id": "ROOMATTHETOP_201601",
      "title": "Room at the Top",
      "description": "Title: Room at the Top Summary: An ambitious young accountant plots to wed a wealthy factory owner's daughter, despite falling in love with a married older woman. Directed by: Jack Clayton Actors: Laurence Harvey, Simone Signoret, Heather Sears Production Company: Romulus Films Release Date: 22 January 1959 (UK) Aspect Ratio: 1.66 : 1 The English factory town is dreary but Joe Lampton has landed a job with a future. To have something to do at night he joins a theatrical group. His boss's daughter Susan is playing ingenue roles on stage and in real life. She is attracted to Joe and Joe thinks about how much faster he will get ahead if he is the boss's son-in-law. This plan is complicated by his strong desire to be with an older woman who also belongs to the theatrical group. She is French and unhappily married. Joe believes he can get away with seeing both women.",
      "fileSize": 937286298,
      "addedAt": "2026-01-07T00:06:45.468Z",
      "thumbnail": "https://archive.org/services/img/ROOMATTHETOP_201601",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 11899
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "115 min",
    "imdbRating": 7.5,
    "imdbVotes": 7520,
    "Genre": "Drama, Romance",
    "Plot": "The English factory town is dreary but Joe Lampton has landed a job with a future. To have something to do at night, he joins a theatrical group. His boss's daughter Susan is playing ingenue roles on stage and in real life. She is attracted to Joe, who thinks about how much faster he will get ahead if he is the boss's son-in-law. This plan is complicated by his strong desire to be with an older woman who also belongs to the theatrical group; she is French and unhappily married. Joe believes he can get away with seeing both women.",
    "Director": "Jack Clayton",
    "Writer": "Neil Paterson, John Braine, Mordecai Richler",
    "Actors": "Laurence Harvey, Simone Signoret, Heather Sears",
    "Language": "English, French",
    "Country": "United Kingdom",
    "Awards": "Won 2 Oscars. 10 wins & 15 nominations total"
  },
  "relatedMovies": [
    "tt0051429",
    "tt0051476",
    "tt0051987",
    "tt0052270",
    "tt0051666",
    "tt0053270",
    "tt0051411",
    "tt0052106",
    "tt0051435",
    "tt0050782",
    "tt0050634",
    "tt0052600"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.468Z"
}