{
  "imdbId": "tt0032416",
  "title": "Dr. Kildare's Strange Case",
  "year": 1940,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sv2miUxxWSs",
      "title": "Dr. Kildare's Strange Case (1940) | Colorized Public Domain Classic | Lew Ayres and Lionel Barrymore",
      "description": "Dr. Kildare's Strange Case (1940) is an American drama film directed by Harold S. Bucquet and produced by Metro-Goldwyn-Mayer during the studio system era of Hollywood. This restored and colorized public domain classic continues the popular Dr. Kildare series, showcasing the moral challenges, medical dilemmas, and personal struggles of a young physician mentored by an older, seasoned doctor. By enhancing this film with color and modern restoration, audiences in the United States, Europe, and beyond can rediscover a story that blends medicine, ethics, and drama in the way only Golden Age Hollywood could deliver.\n\nPlot Summary:\nThe story follows Dr. James Kildare (Lew Ayres), a brilliant young physician working under the watchful eye of the wise and often gruff Dr. Leonard Gillespie (Lionel Barrymore). In this installment, Dr. Kildare faces a difficult medical case involving Nancy Cordell (Helen Gilbert), a young woman whose mysterious mental condition tests his abilities, compassion, and professional judgment. The challenge lies not only in diagnosing her illness but also in navigating the social and personal consequences of her condition.\nAs Kildare investigates her case, he uncovers psychological complexities that push him to balance science, empathy, and moral responsibility. Alongside Dr. Gillespie’s guidance, Kildare learns that being a doctor means more than treating symptoms—it requires courage to face uncomfortable truths and integrity in making life-changing decisions. The drama intensifies as Nancy’s health becomes a matter of urgency, forcing Kildare to prove his dedication both to his patients and to his profession.\n\nCast and Crew:\n• Director: Harold S. Bucquet\n• Producer: Lou L. Ostrow\n• Screenplay: Harry Ruskin and Willis Goldbeck\n• Cinematography: George J. Folsey\n• Editing: Elmo Veron\n\nStarring:\n• Lew Ayres as Dr. James Kildare\n• Lionel Barrymore as Dr. Leonard Gillespie\n• Helen Gilbert as Nancy Cordell\n• Nat Pendleton as Joe Wayman\n• Samuel S. Hinds as Dr. Stephen Kildare\n• Alma Kruger as Molly Byrd\n• Nell Craig as Nurse Parker\n• Emma Dunn as Mrs. Cordell\n• Frank Orth as Mike Ryan\n\nFilm Significance:\nDr. Kildare’s Strange Case stands as one of the early entries in the Dr. Kildare film series that would later inspire radio shows and television adaptations. It captures the tension between traditional medical practice and the emerging understanding of psychological health in the 1940s. The dynamic between Lew Ayres and Lionel Barrymore anchors the film, with Barrymore delivering a commanding performance despite his real-life health struggles. The movie exemplifies MGM’s ability to create serialized stories that built loyal audiences, reflecting both entertainment value and the era’s evolving social attitudes toward medicine and mental health.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Dr. Kildare’s Strange Case remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1940 release was in black and white, reflecting the industry standard of its era. While historically significant, black-and-white films often struggle to capture modern audiences’ attention. By offering a colorized edition, we preserve the authenticity of the original while making it more visually compelling and relatable for today’s viewers. This edition bridges the gap between history and contemporary entertainment, ensuring the film’s themes of compassion, duty, and medical ethics continue to resonate.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from serialized dramas like the Dr. Kildare films to forgotten B-movies and culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#DrKildaresStrangeCase #LewAyres #LionelBarrymore #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #ClassicDrama #FilmRestoration #1940sCinema #MedicalDrama",
      "id": "sv2miUxxWSs",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zPrRjmVTIus",
      "title": "Dr. Kildare's Strange Case (1940) LIONEL BARRYMORE",
      "description": "Stars: Lew Ayres, Lionel Barrymore, Laraine Day\n Director: Harold S. Bucquet\n\n Young Dr. Kildare tries to help an unlucky brain surgeon and his seemingly insane patient.",
      "id": "zPrRjmVTIus",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5sp8VlAS2Sc",
      "title": "Dr. Kildare's Strange Case (1940) Crime, Drama Full Movie",
      "description": "Young Dr. Kildare tries to help an unlucky brain surgeon and his seemingly insane patient.\n\nDirector: Harold S. Bucquet\nWriters: Max Brand, Willis Goldbeck \nStars: Lew Ayres, Lionel Barrymore, Laraine Day\nGenres: Crime, Drama\n\nCCC CHAPTERS: in the general comments tell us your favorite scene, or line with a timestamp  and we will add it!\n00:00 Full Length Movie\n02:45 Doctors & Nurses\n04:11 Bedside manner \n06:14 The Grayson case\n10:40 Mistakes & Drink your milk\n11:59 Got milk?\n15:11 Hospital Flirt\n16:04 1940's Operating theatre\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "5sp8VlAS2Sc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Kildares_Strange_Case_1940",
      "title": "Dr. Kildare's Strange Case (1940; smallest download)",
      "description": "[Doctor Kildare's Strange Case] The story was co-authored by Max Brand, the creator of Dr. Kildare. Actors: Lew Ayres; Lionel Barrymore; Laraine Day Runtime: 1:14:40 Here's another Kildare movie: The Secret of Dr. Kildare This is in the public domain because the copyright was not renewed. (In fact, it is included in Mill Creek's Crime Classics 50-movie pack.) Of the Kildare movies starring Lew Ayres, these didn't have copyright renewals: THE SECRET OF DR. KILDARE (1939) DR. KILDARE'S STRANGE CASE (1940) Here are the copyright renewals for the others: YOUNG DR. KILDARE, a photoplay in eight reels by Loew's. (C) 12Oct38; L8362. Metro-Goldwyn-Mayer, Inc. (PWH); 12Oct65; R369914. CALLING DR. KILDARE, a photoplay in nine reels by Loew's. (C) 24Apr39; L8813. Metro-Goldwyn-Mayer, Inc. (PWH); 25Apr66; R384977. DR. KILDARE GOES HOME, a photoplay in eight reels by Loew's. (C) 5Sep40; L9894. Metro-Goldwyn-Mayer, Inc. (PWH); 2Oct67; R418348. DR. KILDARE'S CRISIS, a photoplay in eight reels by Loew's. (C) 26Nov40; L10098. Metro-Goldwyn- Mayer, Inc. (PWH); 29Nov67; R422923. THE PEOPLE VS. DR. KILDARE, a photo- play in eight reels by Loew's. (C) 29Apr41; L10443. Metro-Goldwyn- Mayer, Inc. (PWH); 2May68; R434833. DR. KILDARE'S WEDDING DAY, a photoplay in eight reels by Loew's. (C) 12Aug41; L10668. Metro-Goldwyn- Mayer, Inc. (PWH); 14Aug68; R441560. DR. KILDARE'S VICTORY, a photoplay in 9 reels by Loew's. From a story by Joseph Harrington; based upon the characters created by Max Brand. (C) 26Nov41; L10882. Metro-Goldwyn- Mayer, Inc. (PWH); 27Nov68; R449745.",
      "id": "Kildares_Strange_Case_1940"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dr.-kildares-strange-case-with-lew-ayres-1940-1080p-hd-film",
      "title": "Dr. Kildare's Strange Case Lew Ayres 1940",
      "description": "In this installment of the medical series, handsome young doctor James Kildare (Lew Ayres) continues to learn from his surly mentor, Dr. Leonard Gillespie (Lionel Barrymore), and romance beautiful nurse Mary Lamont (Laraine Day). Although Dr. Gregory Lane (Shepperd Strudwick) is a rival for Mary's a ffections, Kildare comes to his aid when an unstable patient accuses the surgeon of malpractice. Kildare attempts to prove that Lane isn't at fault with an unusual form of therapy, but will it work?",
      "id": "dr.-kildares-strange-case-with-lew-ayres-1940-1080p-hd-film"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": "6.0",
    "imdbVotes": "624",
    "Genre": "Crime, Drama",
    "Plot": "Young Dr. Kildare is still being trained at General Hospital by old, crusty Dr. Gillespie. This time, he tries to rehabilitate Gregory Lane, a brain surgeon depressed over losing too many patients (and incidentally Kildare's romantic rival for nurse Mary Lamont). Lane's losing streak takes a new turn when one of his patients survives...but seems to be insane. Or is the man's strange obsession with Friday the clue to a mystery? To find out, Kildare must take a terrible risk.",
    "Director": "Harold S. Bucquet",
    "Writer": "Max Brand, Willis Goldbeck, Harry Ruskin",
    "Actors": "Lew Ayres, Lionel Barrymore, Laraine Day",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0031909",
      "title": "The Secret of Dr. Kildare",
      "year": 1939,
      "imdbRating": "6.4",
      "imdbVotes": "510",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030323",
      "title": "King of the Newsboys",
      "year": 1938,
      "imdbRating": "5.6",
      "imdbVotes": "117",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032343",
      "title": "City of Chance",
      "year": 1940,
      "imdbRating": "6.6",
      "imdbVotes": "83",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032179",
      "title": "21 Days Together",
      "year": 1940,
      "imdbRating": "6.1",
      "imdbVotes": "1,285",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032404",
      "title": "Doomed to Die",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "1,465",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0135739",
      "title": "Die drei Codonas",
      "year": 1940,
      "imdbRating": "6.2",
      "imdbVotes": "13",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032508",
      "title": "Gang War",
      "year": 1940,
      "imdbRating": "5.0",
      "imdbVotes": "149",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032641",
      "title": "Island of Doomed Men",
      "year": 1940,
      "imdbRating": "5.8",
      "imdbVotes": "679",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032183",
      "title": "Adventure in Diamonds",
      "year": 1940,
      "imdbRating": "6.3",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032257",
      "title": "Black Diamonds",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "33",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032258",
      "title": "Black Friday",
      "year": 1940,
      "imdbRating": "6.3",
      "imdbVotes": "3,077",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032482",
      "title": "The Flying Squad",
      "year": 1940,
      "imdbRating": "5.9",
      "imdbVotes": "119",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T19:26:32.432Z"
}