{
  "movieId": "tt0055034",
  "title": "Jungle Street Girls",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jsg61",
      "id": "jsg61",
      "title": "Jungle Street Girls",
      "description": "Title: Jungle Street Girls Summary: Terry Collins mugs an old man, who subsequently dies. Joe Lucas finds out about it and blackmails him, threatening to turn him in to the police if he doesn't give him money. Terry then ... Directed by: Charles Saunders Actors: Jill Ireland, David McCallum, Kenneth Cope Production Company: Theatrecraft Release Date: 1961 (USA) Aspect Ratio: REMOVE_TAG Terry Collins mugs an old man, who subsequently dies. Joe Lucas finds out about it and blackmails him, threatening to turn him in to the police if he doesn't give him money. Terry then plans to rob the safe at a night club with his friend Johnny. However, Terry double-crosses him by taking off with the money and also Johnny's girl friend Sue. Finally as the police close in, he kills a tailor, and then is caught as he attempts to run.",
      "fileSize": 564751502,
      "addedAt": "2026-01-07T00:09:15.997Z",
      "thumbnail": "https://archive.org/services/img/jsg61",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 2432
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "82 min",
    "imdbRating": 5.9,
    "imdbVotes": 174,
    "Genre": "Crime, Drama",
    "Plot": "Terry Collins mugs an old man, who subsequently dies. Joe Lucas finds out about it and blackmails him, threatening to turn him in to the police if he doesn't give him money. Terry then plans to rob the safe at a night club with his friend Johnny, who is the boyfriend of a stripper (Jill Ireland) that Terry's infatuated with.",
    "Director": "Charles Saunders",
    "Writer": "Alexander Doré, Guido Coen",
    "Actors": "Jill Ireland, David McCallum, Kenneth Cope",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0181437",
    "tt0243152",
    "tt0047225",
    "tt0047299",
    "tt0054058",
    "tt0054084",
    "tt0054102",
    "tt0054295",
    "tt0054380",
    "tt0179823",
    "tt2017464",
    "tt0054041"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.997Z"
}