{
  "movieId": "tt0002302",
  "title": "Lena and the Geese",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewLenaAndTheGeese",
      "id": "PreviewLenaAndTheGeese",
      "title": "\"Lena And The Geese\" (1912) director D. W. Griffith with Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"Lena and the Geese\" is a short comedy, included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame.   Directed by               D. W. Griffith Produced by             Biograph Company Scenario by                Mary Pickford       Starring                     Mary Pickford, J. Jiquel Lanoe, Kate Bruce, Mae Marsh, Claire McDowell Cinematography        Billy Bitzer Distributed by           General Film Company Release date               June 17, 1912 Running time             12 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 23453720,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewLenaAndTheGeese",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 2526
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.7,
    "imdbVotes": 61,
    "Genre": "Romance, Short, Fantasy",
    "Plot": "For reasons of state, the first-born, a baby girl, is sent away and placed in the care of Gretchen, a trusted peasant woman, who is the widowed mother of a little child about the same age. The two children grow up as sisters. Later, upon her deathbed, the noble lady repents and sends for her child to reinstate her. Gretchen takes this opportunity to make a great lady of her own daughter Lena, the goose girl, by sending her to court instead of the real heiress. Hence Lena is taken before the noble lady as she breathes her last, happy in the belief that she has made reparation. Lena is now a great lady, but the title is a great misfit; court etiquette with her is hard work. She longs to be back with Gretchen and her \"geeses.\" She endures it as long as she can and then bolts. Gretchen, by this time, is sorry for her deception, and is only too eager to straighten the affair.",
    "Director": "D.W. Griffith",
    "Writer": "Mary Pickford",
    "Actors": "Mary Pickford, J. Jiquel Lanoe, Kate Bruce",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002497",
    "tt0002282",
    "tt0002357",
    "tt0002197",
    "tt0002512",
    "tt0001978",
    "tt0001452",
    "tt0001371",
    "tt0001458",
    "tt0001387",
    "tt0002473",
    "tt0002400"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}