{
  "imdbId": "tt0084747",
  "title": "Sweeney Todd: The Demon Barber of Fleet Street",
  "year": 1982,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheDemon_201609",
      "id": "TheDemon_201609",
      "title": "The Demon",
      "description": "A serial killer stalks a young teacher while being hunted by a psychic investigator. You can find out more about this movie on its IMDB page .",
      "fileSize": 3162536478,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheDemon_201609",
      "year": 1981,
      "collection": "feature_films",
      "downloads": 35162
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "140 min",
    "imdbRating": 8.3,
    "imdbVotes": 3959,
    "Genre": "Drama, Horror, Musical",
    "Plot": "It's 1846. Sweeney Todd and Anthony Hope, greeted only by a crazed beggar woman, sail into London, where Todd implies he has been before but not in quite some time. Todd heads to his old stomping grounds of Fleet Street, where he runs across the pie shop belonging to Mrs. Nellie Lovett, who professes to make the worst meat pies in London due to the high cost of meat. The upstairs of her building has sat empty since no one wants to rent a space that is considered haunted by its long ago tenant, barber Benjamin Barker who was falsely accused and ultimately sentenced by the sadistic Judge Turpin and who was shipped away to prison in Australia, leaving his wife Lucy and infant daughter Johanna alone in the world. Todd comes to an agreement with Mrs. Lovett to rent the upstairs of her building so that he can open his own barber shop. A series of incidents, including one with rival barber Senor Pirelli, make Todd change his focus slightly away from having a choice encounter with Judge Turpin and his equally sadistic henchman Beadle Bamford, which was one of the reasons he returned to London. Mrs. Lovett believes this change can only help her pie shop. Meanwhile, upon sighting each other, Anthony and Johanna fall in love at first sight. Johanna is now the ward of Judge Turpin, who has his own incompatible wants with her. Todd and Mrs. Lovett's collaboration as well as Anthony's pursuit of Johanna take marked turns with a number of revelations, most specifically about the crazed beggar woman and Mrs. Lovett's motivations.",
    "Director": "Terry Hughes",
    "Writer": "Hugh Wheeler, Christopher Bond",
    "Actors": "Angela Lansbury, George Hearn, Cris Groenendaal",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 3 Primetime Emmys. 7 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt0073537",
    "tt0082338",
    "tt0082497",
    "tt0081250",
    "tt0187281",
    "tt0081114",
    "tt0079082",
    "tt0089269",
    "tt0090197",
    "tt0077174",
    "tt0092530",
    "tt0078067"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "horror",
      "name": "Horror"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.273Z"
}