{
  "movieId": "tt0067003",
  "title": "'Doc'",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/doc-1971",
      "id": "doc-1971",
      "title": "'Doc' (1971)",
      "description": "\"Doc\" is a revisionist Western film directed by Frank Perry, released in 1971 . It presents a gritty and unconventional portrayal of the legendary figures involved in the Gunfight at the O.K. Corral , focusing on Doc Holliday and his friendship with Wyatt Earp . In the film, Doc Holliday (played by Stacy Keach ) travels to Tombstone, Arizona , accompanied by Katie Elder (played by Faye Dunaway ), a prostitute. Doc is suffering from tuberculosis, complicating their journey. Upon arrival, he reunites with his old friend Wyatt Earp (portrayed by Harris Yulin ), who is engaged in conflict with the Clanton gang. The film builds tension leading up to the infamous gunfight, capturing the complexities and realities of their lives rather than glorifying the legends.",
      "fileSize": 1640351473,
      "addedAt": "2026-01-07T00:08:07.359Z",
      "thumbnail": "https://archive.org/services/img/doc-1971",
      "language": "eng",
      "year": 1971,
      "collection": "feature_films",
      "downloads": 252
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "96 min",
    "imdbRating": 6.2,
    "imdbVotes": 2263,
    "Genre": "Drama, Western",
    "Plot": "One night of 1881, Doc Holliday, a famous poker gambler, enters the 'No Name Saloon'. There, he challenges a man to poker, betting his horse against his opponent's fiance. Doc wins and from now on, Katie Fisher, also known as Katie Elder, will follow him wherever he goes. Their next destination is Tombstone, where the law is represented by Sheriff Wyatt Earp. When they arrive, the election campaign is in full swing. Earp runs for candidate but the Clantons, a family gang of outlaw cowboys, are not among his keenest supporters. Conflict erupts following the failure of some shadowy bargaining and Doc decides to join Wyatt and his brothers. The four of them gather at the O.K. Corral where the seven Clanton brothers are waiting for them.",
    "Director": "Frank Perry",
    "Writer": "Pete Hamill",
    "Actors": "Stacy Keach, Faye Dunaway, Harris Yulin",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0065988",
    "tt0070091",
    "tt0067057",
    "tt0067979",
    "tt0068539",
    "tt0070569",
    "tt0066049",
    "tt0065451",
    "tt0066907",
    "tt0065596",
    "tt0068885",
    "tt0216546"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.359Z"
}