{
  "movieId": "tt0036344",
  "title": "Shantytown",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shantytown_202010",
      "id": "shantytown_202010",
      "title": "Shantytown",
      "description": "Title: Shantytown Summary: Elizabeth \"Liz\" Gorty ( Mary Lee ) lives with her mother and stepfather in a ramshackle boarding house in \"Shantytown\" on the \"wrong side of the tracks.\" Bill Allen ( John Archer ) and his wife... Directed by: Joseph Santley Actors: Mary Lee, John Archer, Marjorie Lord Production Company: Republic Pictures (I) Release Date: 20 April 1943 (USA) Aspect Ratio: 1.37 : 1 Elizabeth \"Liz\" Gorty (",
      "fileSize": 4712457922,
      "addedAt": "2026-01-07T00:10:50.365Z",
      "thumbnail": "https://archive.org/services/img/shantytown_202010",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 1090
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": 6.5,
    "imdbVotes": 23,
    "Genre": "Crime, Drama, Music",
    "Plot": "Elizabeth \"Liz\" Gorty (Mary Lee) lives with her mother and stepfather in a ramshackle boarding house in \"Shantytown\" on the \"wrong side of the tracks.\" Bill Allen (John Archer) and his wife Virginia (Marjorie Lord) rent a room from the Gorty's and \"Liz\", always a tomboy, resolves to become a lady like Virginia, who is expecting a baby. Bill is a fugitive from the law because he was innocently involved in a crime pulled off by the \"Ace\" Landers gang. Landers (Noel Madison) locates Bill and the latter is forced to drive a get-away car in a bank robbery. The gang is caught but Bill escapes. Meanwhile, Virginia is ill and is attended by kindly old \"Doc\" Herndon (Harry Davenport). \"Liz\" manages to get on an amateur-hour broadcast, sings \"On The Corner of Sunshine and Main\" and \"It Had To Be You\", accompanied by Marty Malneck (Matty Malneck) and his Orchestra , and she tosses in a plea for Bill to come home.",
    "Director": "Joseph Santley",
    "Writer": "Olive Cooper, Henry K. Moritz",
    "Actors": "Mary Lee, John Archer, Marjorie Lord",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027184",
    "tt0026455",
    "tt0035581",
    "tt0035249",
    "tt0031668",
    "tt0033469",
    "tt0033749",
    "tt0054817",
    "tt0041109",
    "tt0035740",
    "tt0024416",
    "tt0165739"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.365Z"
}