{
  "imdbId": "tt0034959",
  "title": "Lady Gangster",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yVUTfg2WTmA",
      "title": "Lady Gangster (1942) [Film Noir] [Drama] [Crime]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | Lady Gangster is a Film Noir movie directed by Robert Florey, credited as \"Florian Roberts\". It is based on the play \"Gangstress\", or \"Women in Prison\" by Dorothy Mackaye, who had spent ten months of a one-to-three-years sentence in San Quentin State Prison. \"Lady Gangster\" is a remake of the pre-Code film \"Ladies They Talk About\" (1933). Jackie Gleason plays a supporting role.\n\nThe movie is about Dorothy \"Dot\" Burton (Faye Emerson), who is a member of a gang of bank robbers. Using her femininity and a cute dog provided her by her male cohorts who dognapped him, she is able to enter a bank before opening time, leaving the door open and the bank guard holding her dog, thus enabling a successful robbery. When police interfere with the getaway she faints and proclaims her innocence, however the police have strong doubts as \"her\" dog won't come to her and has a different name on his collar than what she calls him. After she confesses to her part in the robbery, she is sent to women's prison where she makes enemies of fellow inmates seeking Dot's share of the money.\n\n---\n\nDirected by Robert Florey, produced by William Jacobs , screenplay by Anthony Coldeway, based on \"Women in Prison 1932 play\nby Dorothy Mackaye, starring Faye Emerson as Dorothy Drew Burton, Julie Bishop as Myrtle Reed, Frank Wilcox as Kenneth Phillips, Roland Drew as Carey Wells, Jackie Gleason as Wilson, Ruth Ford as Lucy Fenton, Virginia Brissac as Mrs. Stoner, Dorothy Vaughan as Matron Jenkins, Dorothy Adams as Deaf Annie, William Hopper as John, Vera Lewis as Ma Silsby, Herbert Rawlinson as Lewis Sinton, Charles C. Wilson as Detective, Frank Mayo as Walker, Leah Baird as Matron, Jack Mower as Police Sergeant.\n\n---\n\nSource: \"Lady Gangster\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 2 October 2017. Web. 30 Dezember 2017. https://en.wikipedia.org/wiki/Lady_Gangster . If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "yVUTfg2WTmA",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Lady.Gangster",
      "title": "Lady Gangster",
      "description": "From IMDb : An actress gets mixed up with a criminal gang and winds up taking the rap for a $40,000 robbery. Before she's sent to prison, she steals the money from her cohorts and hides it, intending to use it as a bargaining chip to win her release from prison. However, her former partners have other ideas. Stars: Faye Emerson, Julie Bishop, Frank Wilcox, Roland Drew, and Jackie C. Gleason",
      "fileSize": 1424659467,
      "id": "Lady.Gangster"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lady-gangster-1942",
      "title": "Lady Gangster (1942)",
      "description": "An actress gets involved with a criminal gang and winds up taking the rap for a $40,000 robbery. Before being sent to prison, she steals the money from her partners and hides it, she is thinking to use it as a bargaining chip to be released from prison. However, her former partners don't have the same ideas. Watch on RetroFlix:  https://retroflix.org/lady-gangster-1942/",
      "fileSize": 146393072,
      "id": "lady-gangster-1942"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lady-gangster-1942-crime-drama-film-noir-full-length-film",
      "title": "Lady Gangster (1942) [P&M] YouTube (300MB)",
      "description": "I usually only upload movies where the video quality is significantly greater than what's currently available on the Archive, but this is an interesting exception. This is a video that I downloaded from YouTube because it looks slightly better, to me, than what's currently available on the Archive: the contrast is better, the sound quality is much better, and the macroblocking is a big improvement. That being said, the bitrate is surprisingly low -- and, much more importantly, the animation is bizarrely uneven. Still, when watching the film, this is the version that I chose, and I have no idea of where it comes from (where the YouTube uploader first got it). The cropping is also somewhat different compared to what else is available here on the Archive. As long as you can get over the uneven framerate, you might appreciate this alternative to what's currently available, here.",
      "fileSize": 643029659,
      "id": "lady-gangster-1942-crime-drama-film-noir-full-length-film"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ytgI-aAyA_g",
      "title": "Lady Gangster (1942) | Colorized Public Domain Crime Drama with Faye Emerson & Jackie Gleason",
      "description": "Lady Gangster (1942) is a gritty American crime drama directed by Robert Florey, based on the play Gangstress, or Women in Prison by Dorothy Mackaye. This restored and colorized edition revives a hard-hitting B-movie that blends the tough world of gangsters with the claustrophobic tension of a women’s prison drama. Originally released in stark black and white, this colorized version makes the suspense, characters, and 1940s atmosphere come alive for modern audiences in the USA, Europe, and worldwide.\n\nPlot Summary:\nDorothy “Dot” Burton (Faye Emerson) is a young woman who becomes entangled with a ruthless gang. Drawn into crime by her association with men who see her as both an asset and a liability, Dot soon finds herself on the wrong side of the law. When she takes part in a bank robbery, her luck runs out and she is arrested, sentenced, and sent to a women’s prison.\n\nBehind bars, Dot navigates the rivalries, betrayals, and hardships of prison life while wrestling with her own conscience. As she contemplates redemption, her former associates on the outside still expect her to help them pull off more crimes. Dot’s struggle becomes a battle between loyalty to her criminal past and the possibility of reclaiming her future. Her story crescendos in a dangerous climax that forces her to choose between self-destruction and a chance at redemption.\n\nCast and Crew:\n• Director: Robert Florey\n• Producer: Bryan Foy\n• Screenplay: Anthony Coldeway\n• Based on: Gangstress, or Women in Prison by Dorothy Mackaye\n• Cinematography: Arthur L. Todd\n• Editing: Thomas Pratt\nStarring:\n• Faye Emerson as Dorothy “Dot” Burton\n• Julie Bishop as Lucy Gilman\n• Roland Drew as Kenneth Phillips\n• Frank Wilcox as Assistant District Attorney\n• Jackie Gleason as Wilson (early film role)\n• Ruth Ford as Mrs. Thomas\n• Dorothy Vaughn as Matron\n• William Hopper as Dr. Philip Dexter\n\nFilm Significance:\nLady Gangster is notable for its blend of gangster melodrama and women’s prison film, genres that were especially popular during the 1930s and 1940s. It also served as an early showcase for Faye Emerson, who later became known as the “First Lady of Television” in the 1950s. The film is of particular interest to fans of Jackie Gleason, who appears here in a minor role years before achieving fame with The Honeymooners.\n\nThe movie reflects wartime Hollywood’s appetite for quick, engaging B-pictures that combined action, moral lessons, and gritty realism. Lady Gangster stands as a cultural artifact of its era, portraying the dangers of organized crime and the challenges faced by women who strayed from conventional paths. Its mixture of suspense, romance, and moral conflict makes it an enduring curiosity for fans of classic crime dramas.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Lady Gangster remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1942 release was shot in black and white, like many of Warner Bros.’s crime dramas of the period. While authentic to its era, the lack of color often deters modern audiences—especially those watching on TVs or digital platforms. By presenting this colorized edition, we enhance the costumes, settings, and dramatic tension, making the film more visually dynamic and engaging for today’s audiences in the USA, Europe, and worldwide.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#LadyGangster #FayeEmerson #JackieGleason #1940sCrimeDrama #PublicDomainMovie #ColorizedClassic #WomenInPrison #GoldenAgeHollywood #FilmRestoration #ClassicCinema",
      "id": "ytgI-aAyA_g",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GfOnjRGUqaw",
      "title": "Lady Gangster (1942) CRIME NOIR",
      "description": "Stars: Faye Emerson, Julie Bishop, and Jackie Gleason\nDirector: Robert Florey\n\nAn actress gets mixed up with a criminal gang and winds up taking the rap for a $40,000 robbery. Before she's sent to prison.",
      "id": "GfOnjRGUqaw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1942-lady-gangster-robert-florey-vose",
      "title": "1942 - Lady Gangster - Robert Florey - VOSE",
      "description": "https://derechonoir.wordpress.com/",
      "fileSize": 629530496,
      "id": "1942-lady-gangster-robert-florey-vose"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 5.7,
    "imdbVotes": 846,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Dot Burton (Faye Emerson) has acted as a decoy in a bank robbery and fails to get away. Her arrest attracts the attention of Ken Phillips (Frank Wilcox), a former childhood sweetheart who believes her innocent until she confesses. But before going to jail she manages to steal the bank's $40,000 from her accomplices and leaves it with her landlady.",
    "Director": "Robert Florey",
    "Writer": "Anthony Coldeway, Dorothy Mackaye, Carlton Miles",
    "Actors": "Faye Emerson, Julie Bishop, Frank Wilcox",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0033582",
      "title": "The Face Behind the Mask",
      "year": 1941,
      "imdbRating": 7.1,
      "imdbVotes": 1965,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031232",
      "title": "Disbarred",
      "year": 1939,
      "imdbRating": 6,
      "imdbVotes": 49,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041269",
      "title": "The Crooked Way",
      "year": 1949,
      "imdbRating": 6.6,
      "imdbVotes": 1671,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042618",
      "title": "Johnny One-Eye",
      "year": 1950,
      "imdbRating": 5.5,
      "imdbVotes": 161,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034941",
      "title": "Kid Glove Killer",
      "year": 1942,
      "imdbRating": 6.8,
      "imdbVotes": 1174,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035388",
      "title": "Street of Chance",
      "year": 1942,
      "imdbRating": 6.3,
      "imdbVotes": 777,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034798",
      "title": "The Glass Key",
      "year": 1942,
      "imdbRating": 7,
      "imdbVotes": 7712,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035432",
      "title": "This Gun for Hire",
      "year": 1942,
      "imdbRating": 7.4,
      "imdbVotes": 10874,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034621",
      "title": "Criminal Investigator",
      "year": 1942,
      "imdbRating": 5.2,
      "imdbVotes": 58,
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035850",
      "title": "Eyes of the Underworld",
      "year": 1942,
      "imdbRating": 6,
      "imdbVotes": 131,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035082",
      "title": "Moontide",
      "year": 1942,
      "imdbRating": 6.8,
      "imdbVotes": 2352,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035233",
      "title": "Quiet Please: Murder",
      "year": 1942,
      "imdbRating": 6.4,
      "imdbVotes": 428,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T17:36:44.618Z"
}