{
  "imdbId": "tt0027495",
  "title": "Dancing Feet",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DancingFeet_201903",
      "id": "DancingFeet_201903",
      "title": "Dancing Feet",
      "description": "“Dancing lessons over the radio?” (IMDB review quote) Yep, and be sure to “stay tuned” for the last five minutes of this one! An entertaining tap-dancing musical/romantic comedy with a good cast headed by Joan Marsh, Eddie Nugent, Ben Lyon and Isabel Jewell. Good production values for type. Lively fun from beginning to end. Remade as “Melody and Moonlight” in 1940. IMBD rating 7.1. Directed by Joseph Stanley. Released in 1936. Complete print.",
      "fileSize": 1053651755,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/DancingFeet_201903",
      "collection": "feature_films",
      "downloads": 4472
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": 6.7,
    "imdbVotes": 94,
    "Genre": "Comedy, Music, Mystery",
    "Plot": "Peyton Wells (Ben Lyon) rescues Judy Jones (Joan Marsh) from a very dull young man, at a sedate party given for her by her multi-millionaire grandfather Silas P. Jones (Purnell Pratt.) Judy refuses to accompany Peyton on a slumming trip to a cheap dance hall, and Peyton dances with several of the dowagers and tells them that Silas is practically dying of scarlet fever. The guests hastily depart and Joan joins Peyton at the Dreamland Dance Hall. She is mistaken by Jimmy Cassidy (Edward J. Nugent) as one of the hostesses and decides to dance with him as a lark. One thing follows another and Judy gets disinherited and takes a job at the dance hall through Jimmy and his friend Mabel(Isabel Jewell.) Jimmy confides to Judy his ambition to become a dance instructor over the radio and Judy decides to help him but can't get the needed financial backing. She gets Peyton to front the money, promising him she will reconsider his offer of marriage if Jimmy's plan fails. The dance school of the air proves to be a flop because of Silas Jones, who threatens to withdraw his large advertising account unless the dance school is taken off.",
    "Director": "Joseph Santley",
    "Writer": "Jerome Chodorov, Olive Cooper, Wellyn Totman",
    "Actors": "Ben Lyon, Joan Marsh, Edward J. Nugent",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026019",
    "tt0029806",
    "tt0028483",
    "tt0027734",
    "tt0033749",
    "tt0025194",
    "tt0026455",
    "tt0025427",
    "tt0027807",
    "tt0028260",
    "tt0027384",
    "tt0027496"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.368Z"
}