{
  "imdbId": "tt0017866",
  "title": "Fast and Furious",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/fast-and-furious_1927",
      "title": "Fast and Furious",
      "fileSize": 2240186852,
      "id": "fast-and-furious_1927"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=txR3DfI7Eu0",
      "title": "Fast and Furious (1927) | Colorized Public Domain Comedy Classic with Reginald Denny & Barbara Worth",
      "description": "Fast and Furious (1927) is a silent comedy film directed by Melville W. Brown and distributed by Universal Pictures. This restored and colorized public domain edition revives one of the late silent-era comedies that entertained audiences in the roaring twenties. Starring Reginald Denny, a versatile British-American actor known for his athletic charm, the film captures both the humor and energy that defined silent comedy in the years just before sound revolutionized Hollywood.\n\nPlot Summary:\nSet against a backdrop of fast cars, quick wits, and the social life of the 1920s, the film follows a story of misadventures in love and ambition. Reginald Denny plays the protagonist whose life quickly spins out of control through misunderstandings, comedic mishaps, and daring escapades. With the help of leading lady Barbara Worth, the plot blends romance with slapstick, portraying the chaotic yet exciting pace of modern life.\n\nThough often overlooked today, Fast and Furious highlights the transition from the carefree silent comedy tradition to the more sophisticated narratives of the late 1920s. Its themes of romance, mistaken identity, and physical humor made it an accessible crowd-pleaser in its time, appealing to audiences eager for lighthearted entertainment during a rapidly modernizing decade.\n\nCast and Crew:\n• Director: Melville W. Brown\n• Producer: Universal Pictures\n• Cinematography: Arthur L. Todd\n• Editing: Unknown (records incomplete)\n\nStarring:\n• Reginald Denny as Protagonist\n• Barbara Worth as Leading Lady\n• Claude King as Supporting role\n• Armand Kaliz as Supporting role\n\nFilm Significance:\nFast and Furious demonstrates the popularity of silent comedy films during the 1920s, showcasing Reginald Denny at a point in his career when he was known for both his comedic timing and his physicality. While not as famous as Charlie Chaplin or Harold Lloyd’s work, Denny’s comedies were consistent box office performers for Universal. This film also reflects the cultural fascination with speed, modern romance, and the thrills of urban life in the Jazz Age. Today, it stands as a rare surviving example of Universal’s comedy output before the full transition to sound in the late 1920s.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Fast and Furious remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1927 release was black and white, typical of silent-era productions. While authentic to its time, modern audiences — particularly older viewers in the United States and Europe who watch YouTube on TV — often skip past black-and-white silent films. This colorized edition bridges the gap between historical preservation and modern entertainment, presenting Reginald Denny’s comedic talent in a visually fresh way that resonates with today’s audiences. For fans of silent comedy, film history, and Jazz Age culture, this restoration offers a unique opportunity to experience a forgotten gem in a new light.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the silent era through Hollywood’s Golden Age, covering lost comedies, overlooked dramas, and influential works that shaped cinema. Our channel ensures these treasures remain discoverable, engaging, and preserved for audiences in the USA, Europe, and worldwide.\n\n#FastAndFurious1927 #SilentComedy #PublicDomainMovie #ColorizedClassic #ReginaldDenny #SilentEraFilm #1920sCinema #UniversalPictures #ClassicHollywood #FilmRestoration",
      "id": "txR3DfI7Eu0",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "60 min",
    "imdbRating": 5.3,
    "imdbVotes": 56,
    "Genre": "Comedy",
    "Plot": "Tom Brown, a wealthy young bachelor fond of speeding, wrecks his car and is aided by Smithfield, whereupon he instantly becomes enamored of the latter's daughter, Ethel. After recuperating from the accident, Tom embarks for California to find the Smithfields. During a traffic jam, he and Smithfield get into an altercation, which results in Tom's tweaking Smithfield's nose; at the Smithfield residence, Tom visits Ethel, who is supervising the creation of a statue dedicated by her father to racing drivers. Only Ethel's and the sculptor's combined efforts prevent a battle with Smithfield. Tom agrees to impersonate Billings, a racing champion, who is to pose for the sculptor and appear at the dedication, and is forced to complete the deception by driving in a race. After numerous adventures he wins the race and the love of Ethel.",
    "Director": "Melville W. Brown",
    "Writer": "Raymond Cannon, Reginald Denny, Rob Wagner",
    "Actors": "Reginald Denny, Barbara Worth, Claude Gillingwater",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0019797",
      "title": "Dance Hall",
      "year": 1929,
      "imdbRating": 5.1,
      "imdbVotes": 111,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020042",
      "title": "Jazz Heaven",
      "year": 1929,
      "imdbRating": 5.5,
      "imdbVotes": 173,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0020758",
      "title": "Check and Double Check",
      "year": 1930,
      "imdbRating": 4.9,
      "imdbVotes": 445,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021649",
      "title": "Behind Office Doors",
      "year": 1931,
      "imdbRating": 6.1,
      "imdbVotes": 556,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026797",
      "title": "The Nut Farm",
      "year": 1935,
      "imdbRating": 5.1,
      "imdbVotes": 118,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025424",
      "title": "Lost in the Stratosphere",
      "year": 1934,
      "imdbRating": 4.3,
      "imdbVotes": 138,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021394",
      "title": "So Long Letty",
      "year": 1929,
      "imdbRating": 6.1,
      "imdbVotes": 188,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0015663",
      "title": "California Straight Ahead",
      "year": 1925,
      "imdbRating": 6.2,
      "imdbVotes": 30,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020454",
      "title": "Stolen Kisses",
      "year": 1929,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0440334",
      "title": "A Dozen Socks",
      "year": 1927,
      "imdbRating": 6.2,
      "imdbVotes": 19,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017634",
      "title": "Anything Once!",
      "year": 1927,
      "imdbRating": 6.3,
      "imdbVotes": 41,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0312544",
      "title": "Chasing Choo Choos",
      "year": 1927,
      "imdbRating": 7.4,
      "imdbVotes": 103,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.394Z"
}