{
  "movieId": "tt0020081",
  "title": "The Last of Mrs. Cheyney",
  "year": 1929,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2RuXxoq31PY",
      "id": "2RuXxoq31PY",
      "title": "The Last of Mrs Cheyney (1929) NORMA SHEARER🍕 BASIL RATHBONE",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nDirector: Sidney Franklin\nStars: Norma Shearer, Basil Rathbone, George Barraud, and Hedda Hopper\n\nStep into the glittering world of Pre-Code Hollywood with a romantic comedy of manners, mystery, and mischief! Starring Norma Shearer at her most glamorous, this witty and stylish caper follows a clever jewel thief posing as a wealthy widow to infiltrate London’s upper crust. Her target? A priceless pearl necklace. Her obstacle? A charming aristocrat who just might steal her heart.\n\nDirected by Sidney Franklin and adapted from the hit stage play, this early talkie gem features an all-star ensemble: Basil Rathbone as the elegant Lord Dilling, George Barraud, Herbert Bunston, and a delightfully sharp Hedda Hopper. Brimming with high society intrigue, snappy dialogue, and a dash of romantic suspense, this Pre-Code classic is a must-watch for fans of vintage crime comedies and old Hollywood elegance.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPresented by PizzaFLIX, your ultimate destination for classic films from the golden age of cinema—spotlighting Norma Shearer, Basil Rathbone, and other legends of the 1920s and 1930s. If you love romantic plots, clever cons, and sparkling sophistication, this one’s for you!\n\nSubscribe to PizzaFLIX for more timeless gems from the Golden Age of Hollywood! Don’t forget to like, comment, and share if you love vintage cinema.\n\n#PreCodeHollywood #NormaShearer #BasilRathbone #ClassicRomanticComedy #1929Movies #VintageMystery #OldHollywood #TalkieEra #SidneyFranklin #HeddaHopper #CrimeComedy #PizzaFLIX",
      "addedAt": "2025-12-24T01:04:29.221Z",
      "thumbnail": "https://i.ytimg.com/vi/2RuXxoq31PY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCfvNOopd8m1ihACMDAkYRbk3vKYQ",
      "duration": 5717,
      "language": "en",
      "year": 1929,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-last.of.-mrs.-cheyney.-1929.-dvdrip.-600-mb.h-264.-mp-4",
      "id": "the.-last.of.-mrs.-cheyney.-1929.-dvdrip.-600-mb.h-264.-mp-4",
      "title": "The Last of Mrs. Cheyney (1929)",
      "description": "I've been researching newly public domain films from 1929 and am uploading the best possible copies that I can find. This Dramedy starring Norma Shearer and Basil Rathbone earned screenwriter Hans Kraly a Best Writing nomination at the 2nd academy awards.",
      "fileSize": 630882496,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-last.of.-mrs.-cheyney.-1929.-dvdrip.-600-mb.h-264.-mp-4",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 163
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "94 min",
    "imdbRating": 6,
    "imdbVotes": 564,
    "Genre": "Comedy, Drama",
    "Plot": "There is a big charity function at the house of Mrs. Cheyney and a lot of society is present. With her rich husband, deceased, rich old Lord Elton and playboy Lord Arthur Dilling are both very interested in the mysterious Fay. Invited to the house of Mrs. Webley, Fay is again the center of attention for Arthur and Elton with her leaning towards stuffy old Elton. When Arthur sees Charles, Fay's Butler, lurking in the gardens, he remembers that Charles was a thief caught in Monte Carlo and he figures that Fay may be more interested in the pearls of Mrs. Webley, which she is. After Fay takes the pearls, but before she can toss them out the window, she is caught by Arthur who is very disappointed in how things are turning out.",
    "Director": "Sidney Franklin",
    "Writer": "Frederick Lonsdale",
    "Actors": "Norma Shearer, Basil Rathbone, George Barraud",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    "tt0018297",
    "tt0020589",
    "tt0019067",
    "tt0019933",
    "tt0019797",
    "tt0019900",
    "tt0020121",
    "tt0020210",
    "tt0020004",
    "tt0021449",
    "tt0020042",
    "tt0020247"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}