{
  "movieId": "tt0003516",
  "title": "The Wanderer",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheWanderer",
      "id": "PreviewTheWanderer",
      "title": "\"The Wanderer\" (1913) cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Wanderer\" is a short drama.  The film is included in our program to illustrate the work of our star Billy Bitzer. A man apparently loses all interest in life and starts wandering around. His useless existence is interrupted for one day, when a woman gives him food and he finds a way to repay her.   NOTE: All film sites cite a film \"The Wanderer\" (1913) directed by D.W. Griffith and starring Henry B. Walthall as the Wanderer, who also plays a flute. As you can see, in our film there is no flute and Henry B. Walthall does not act. The film that we show matches the description of \"Olaf - An Atom\" (1913) directed by Anthony O’Sullivan, also a Biograph Company production, and starring Harry Carey.  The opening titles show \"The Wanderer\" and we will leave it as it is. UPDATE: A film \"The Wanderer\" (1913) directed by D.W. Griffith and starring Henry B. Walthall has emerged. Thus, even if the film described here bears the title \"The Wanderer\", we believe that this is a mistake, and in reality this is \"Olaf - An Atom\" (1913) directed by Anthony O’Sullivan.   Directed by                       unknown (see NOTE above) Cinematography by         Billy Bitzer Starring                             Harry Carey, Claire McDowell, Charles Hill Mailes Distributed by                   Biograph Company Release date                       May, 1913 Country                             United States Running time                    10 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 17498168,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheWanderer",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 1185
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5,
    "imdbVotes": 65,
    "Genre": "Short, Drama, Fantasy",
    "Plot": "This story is somewhat in the nature of a poetical fantasy, and may be construed as the spectator pleases. It is the story of a wanderer who prefers to seek, through his flute, the spirit of truth, that he may give it out into the world as he passes through his various journeys and experiences in life and thus make earth a better and fairer place. He prefers this to the perpetual strife for gain.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Henry B. Walthall, Charles Hill Mailes, Christy Cabanne",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002795",
    "tt0003497",
    "tt0003323",
    "tt0002082",
    "tt0002212",
    "tt0002386",
    "tt0002478",
    "tt0002391",
    "tt0002415",
    "tt0002550",
    "tt0002546",
    "tt0002190"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}