{
  "movieId": "tt0032566",
  "title": "Half a Sinner",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HalfaSinner",
      "id": "HalfaSinner",
      "title": "Half a Sinner",
      "description": "A prim school teacher (Heather Angel) has a secret desire to kick up her heels and leave her small town behind her. She does the next best thing - buys some silk stockings, a new hat and goes on a spree for the day. She gets some unwanted attention from a hood, \"Handsome\" (Henry Brandon), and in her haste to escape, pushes him over and steals his car. Unbeknownst to her, there is a dead body in the back. She picks up a hitch-hiker (John King), whose car has broken down, and a romance begins.",
      "fileSize": 1645173781,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/HalfaSinner",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 15658
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lNBg_xNgPNk",
      "id": "lNBg_xNgPNk",
      "title": "Half a Sinner (1940) | Colorized Public Domain Crime Comedy Classic with Heather Angel & John King",
      "description": "Half a Sinner (1940) is an American crime comedy directed by Al Christie and based on the story “The Bride Wore Boots” by Dalton Trumbo. Released during the Golden Age of Hollywood, this lighthearted but suspenseful film blends humor, romance, and criminal misadventures into a fast-paced B-movie entertainment. Originally presented in black and white, this edition has been fully restored and colorized by Colorized Public Domain, offering a fresh and engaging experience for modern audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe film centers on Jean Livingston (Heather Angel), a schoolteacher who becomes bored with her quiet and uneventful life. Longing for excitement, she impulsively decides to skip work one day and indulge in a bit of adventure. Her seemingly innocent decision takes a dangerous turn when she becomes entangled with criminals, stolen money, and a stolen car.\n\nWhile driving the hot vehicle, Jean meets carefree playboy David Robbins (John King), who quickly becomes both her companion and unwitting partner in the chaos. Together, the unlikely pair stumble into a series of comedic and suspenseful encounters — from run-ins with gangsters to clever attempts at outsmarting the law. Through quick thinking, wit, and a touch of charm, Jean transforms from a mild-mannered teacher into a daring woman who discovers both courage and romance in the face of danger.\n\nThe film moves at a brisk pace, typical of its B-movie roots, balancing screwball comedy with crime-thriller tension. Jean’s double life — a prim teacher on one hand, a woman of action on the other — makes her one of the more unconventional heroines of early 1940s cinema.\n\nCast and Crew:\n• Director: Al Christie\n• Producer: Al Christie\n• Screenplay: Dalton Trumbo (story), Garrett Fort (adaptation)\n• Cinematography: Charles Van Enger\n• Editing: Charles Craft\n\nStarring:\n• Heather Angel as Jean Livingston\n• John King as David Robbins\n• Constance Collier as Mrs. Julia Randolph\n• Fritz Feld as Carlo\n• Robert Elliott as Police Inspector\n• Edward Gargan as Policeman\n• William Pawley as Gangster\n\nFilm Significance:\n“Half a Sinner” is notable for its mix of crime and comedy at a time when Hollywood was experimenting with genre-blending formulas to entertain Depression-era and pre-WWII audiences. Its heroine, Jean Livingston, reflects early Hollywood’s occasional departure from traditional female roles, presenting a protagonist who takes risks, bends the rules, and embraces her desire for freedom. Dalton Trumbo’s involvement (before his later fame and blacklisting during the McCarthy era) adds historical significance to the film. While modest in budget and scope, “Half a Sinner” remains a charming relic of the era’s B-movie output and a showcase of Heather Angel’s versatility.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Half a Sinner remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1940 release was shot in black and white, typical of low-budget productions of the time. While authentic, many modern audiences skip over monochrome films. This carefully colorized edition revitalizes the visuals — from costumes and car chases to comedic encounters and moody crime sequences — making them more immersive for contemporary audiences in the USA, Europe, and beyond. By offering this restoration, Colorized Public Domain bridges the gap between historic preservation and modern cinematic accessibility.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#HalfASinner #HeatherAngel #DaltonTrumbo #PublicDomainMovie #ColorizedClassic #ClassicCinema #CrimeComedy #FilmRestoration #1940sMovies #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:47:19.485Z",
      "thumbnail": "https://i.ytimg.com/vi/lNBg_xNgPNk/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYciBQKDwwDw==&rs=AOn4CLAxe3SPM_4X97okyFMAn1ibrwNu8w",
      "duration": 3348,
      "language": "en",
      "year": 1940,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wAY_zjwQWp8",
      "id": "wAY_zjwQWp8",
      "title": "Half a Sinner (1940) DALTON TRUMBO",
      "description": "Stars: Heather Angel, John 'Dusty' King, Constance Collier \n Director: Al Christie\n Writer: Dalton Trumbo (story)\n\n Although young and beautiful, schoolteacher Anne Gladden fears a dull future. She finally decides to take a walk on the wild side, splurging on some fashionable new clothes and setting off to find adventure. Her new confidence inspires her to flirt with complete strangers. When a gangster pays unwanted attention to her, she ditches him and flees in his car, unaware that there's a corpse in the trunk. Determined to recover his stolen vehicle and its incriminating cargo the thug begins a desperate search. The oblivious Anne, comes to the aid of a handsome young man stranded alongside the road. Romance blooms, but after the shocking discovery of a body in the trunk, the duo decide they have to return the car. The bickering lovebirds head back to the city, trailed by both the angry gangster and the cops, who suspect the young couple of murder.",
      "addedAt": "2025-12-26T23:54:35.497Z",
      "thumbnail": "https://i.ytimg.com/vi/wAY_zjwQWp8/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhgIGAoYDAP&rs=AOn4CLAjaNLCstte0a2LHE_lRUQWahYfMA",
      "duration": 3569,
      "language": "en",
      "year": 1940,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bY-lUFCyFuA",
      "id": "bY-lUFCyFuA",
      "title": "Half a Sinner (1940) Starring Heather Angel | She Wanted to Be Naughty - in a Nice Way",
      "description": "When prim schoolteacher Anne Gladden (Heather Angel) decides to ditch her spectacles for a day of adventure, she accidentally steals a gangster's car with a surprise passenger in the trunk! Racing against time with charming stranger Larry Cameron (John 'Dusty' King), this unlikely duo must outmaneuver both law enforcement and criminals in a whirlwind chase where romance blooms amid danger and mistaken identities.\n\nOriginal title: Half a Sinner\nAlternative title: Everything Happens to Annie\n\nColorized version: https://youtu.be/s6-OF2qJqIg\n\nDirector: Al Christie\nWriters: Frederick J. Jackson, Dalton Trumbo\nActors: Heather Angel, John 'Dusty' King, Constance Collier\nGenres: Adventure, Comedy, Crime, Mystery\nRelease date: April 5, 1940\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:29:59.209Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/bY-lUFCyFuA/maxresdefault.webp?v=68446a87",
      "duration": 3778,
      "language": "en",
      "year": 1940,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "59 min",
    "imdbRating": 6.3,
    "imdbVotes": 426,
    "Genre": "Adventure, Comedy, Mystery",
    "Plot": "Although young and beautiful, schoolteacher Anne Gladden fears a dull future. She finally decides to take a walk on the wild side, splurging on some fashionable new clothes and setting off to find adventure. Her new confidence inspires her to flirt with complete strangers. When a gangster pays unwanted attention to her, she ditches him and flees in his car, unaware that there's a corpse in the backseat. Determined to recover his stolen vehicle and its incriminating cargo the thug begins a desperate search. The oblivious Anne, comes to the aid of a handsome young man stranded alongside the road. Romance blooms, but after the shocking discovery of a body in the trunk, the duo decide they have to return the car. The bickering lovebirds head back to the city, trailed by both the angry gangster and the cops, who suspect the young couple of murder.",
    "Director": "Al Christie",
    "Writer": "Frederick J. Jackson, Dalton Trumbo",
    "Actors": "Heather Angel, John 'Dusty' King, Constance Collier",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031124",
    "tt0031054",
    "tt0029951",
    "tt0032289",
    "tt0033514",
    "tt2130142",
    "tt0032277",
    "tt0032608",
    "tt0033214",
    "tt0032686",
    "tt0028668",
    "tt0031397"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}