{
  "imdbId": "tt0037600",
  "title": "The Cisco Kid Returns",
  "year": 1945,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZcWgrgQdIyw",
      "id": "ZcWgrgQdIyw",
      "title": "The Cisco Kid Returns (1945) DUNCAN RENALDO🍕 MARTIN GARRALAGA",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Duncan Renaldo, Martin Garralaga, Roger Pryor\nDirector: John P. McCarthy\n\nCisco and Pancho attempt to prove that they did not kidnap the child they are protecting from a killer!\n\nTRIVIA: The Cisco Kid is a fictional character created by O. Henry for his short story \"The Caballero's Way,\" first published in 1907. Four actors portrayed this Western hero in 25 films during the sound era. In 1928, the first all-talking western starred Warner Baxter as the Cisco Kid, followed by Cesar Romero, Duncan Renaldo, and Gilbert Roland.\n\n🍕Are you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "addedAt": "2025-12-24T01:05:01.666Z",
      "thumbnail": "https://i.ytimg.com/vi/ZcWgrgQdIyw/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBrUpFm9i-8xqcpVjDKKMYQlHa0-w",
      "duration": 3913,
      "language": "en",
      "year": 1945,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "64 min",
    "imdbRating": 7.1,
    "imdbVotes": 47,
    "Genre": "Drama, Western",
    "Plot": "The Cisco Kid and Pancho stop the marriage of Rosita to Harris by claiming that Cisco is already married to her, and exhibit a borrowed child, Nancy as proof. Cisco carries off the furious Rosita, but finds, when returning Nancy, that her real father has been shot to death. Assuming responsibility for Nancy, Cisco sends her and Rosita to stay with Tia, and he visits the local padre. Harris and Conway scheme to get custody of the child, so they can obtain the money left to her by her father. As part of the plot, an actress, comes to town posing as the girl's mother, accompanied by her maid Jeanette. Rosita, jealous of the attention Cisco is paying to Jeanette, tells Harris where the child is being kept in hiding. Cisco sends Pancho to the sheriff with a message promising to give himself up for \"kidnapping\" Nancy if the sheriff will bring along \"Mrs. Page\" and Conway.",
    "Director": "John P. McCarthy",
    "Writer": "Betty Burbridge, O. Henry",
    "Actors": "Duncan Renaldo, Martin Garralaga, Roger Pryor",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037599",
    "tt0021202",
    "tt0023914",
    "tt0023164",
    "tt0038552",
    "tt0037050",
    "tt0039771",
    "tt0037535",
    "tt0037728",
    "tt0038107",
    "tt0038212",
    "tt0037969"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:35:04.475Z"
}