{
  "movieId": "tt0020806",
  "title": "Danger Lights",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Dangerous_Lights",
      "id": "Dangerous_Lights",
      "title": "Danger Lights",
      "description": "Title: Danger Lights Summary: The tough boss of a railroad yard befriends a young hobo, and unwittingly places in jeopardy his relationship with the woman he loves. Directed by: George B. Seitz Actors: Production Company: RKO Radio Pictures Release Date: 21 August 1930 (USA) Aspect Ratio: 1.20 : 1 Head railroad man Dan is as ugly as he is honorable. When he spots a drifter who'd hopped a freight held up by a landslide, Dan offers the man a job; then he finds the man was a railroader, too, and takes him under his wing. Engaged to Mary, Dan doesn't notice the growing attraction between his protégé and his intended, but focuses instead on running the railroad.",
      "fileSize": 439031151,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/Dangerous_Lights",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 1452
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/danger-lights-1930",
      "id": "danger-lights-1930",
      "title": "Danger Lights (1930)",
      "description": "Head railroad man Dan is as ugly as he is honorable. When he spots a drifter who'd hopped a freight held up by a landslide, Dan offers the man a job; then he finds the man was a railroader, too, and takes him under his wing. Engaged to Mary, Dan doesn't notice the growing attraction between his protégé and his intended but focuses instead on running the railroad. Watch on RetroFlix:  https://retroflix.org/danger-lights-1930/",
      "fileSize": 343523047,
      "addedAt": "2026-01-07T00:07:51.628Z",
      "thumbnail": "https://archive.org/services/img/danger-lights-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 137
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/danger-lights-1930_202506",
      "id": "danger-lights-1930_202506",
      "title": "Danger Lights (1930)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. This railroad drama was filmed in Montana, and also takes place in the state. It follows two railway men as they fight for the love of a woman. The film has rare \"tug-of-war\" footage between two steam locomotives, as well as the only known surviving film footage to show a dynamometer maintenance car from this era. More intriguingly, Danger Lights was the only film to be recorded in a costly widescreen format that wasn't used again until the 1950's. ",
      "fileSize": 2785786166,
      "addedAt": "2026-01-07T00:07:51.628Z",
      "thumbnail": "https://archive.org/services/img/danger-lights-1930_202506",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 85
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/danger-lights-4-k",
      "id": "danger-lights-4-k",
      "title": "Danger Lights (1930) [Colorized, 4K, 60FPS]",
      "description": "danger Lights is a 1930 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 5282493091,
      "addedAt": "2026-01-07T00:07:51.628Z",
      "thumbnail": "https://archive.org/services/img/danger-lights-4-k",
      "collection": "feature_films",
      "downloads": 244
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/danger_lights",
      "id": "danger_lights",
      "title": "Danger Lights",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4579115888,
      "addedAt": "2026-01-07T00:07:51.628Z",
      "thumbnail": "https://archive.org/services/img/danger_lights",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 100894
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iY2vAy0-uKg",
      "id": "iY2vAy0-uKg",
      "title": "Danger Lights (1930) | Colorized Public Domain Railroad Drama with Jean Arthur and Louis Wolheim",
      "description": "Danger Lights (1930) is an American pre-Code drama film directed by George B. Seitz and produced by RKO Radio Pictures. This restored and colorized public domain edition revives a thrilling story centered on railroad life, loyalty, love, and rivalry in the early 20th century. Notable for its authentic on-location railroad sequences and an early performance by Jean Arthur, the film remains one of the great examples of railroading drama from the transition period between silent and sound cinema.\n\nPlot Summary:\nSet in a bustling Montana railroad town, the story follows Dan Thorn (Louis Wolheim), a tough and respected railroad yardmaster known for his discipline and leadership. He oversees his men with strict authority, commanding both loyalty and fear. Into this world enters Larry Doyle (Robert Armstrong), a confident young railroad worker whose ambition and courage quickly make him stand out. Doyle earns the respect of the men and captures the attention of Mary Ryan (Jean Arthur), Thorn’s companion, sparking a rivalry between the two men.\n\nThe tension grows as Thorn realizes that Mary’s affection is shifting toward Doyle. Their personal conflict soon becomes entangled with their work on the railroad, where precision, bravery, and discipline mean the difference between safety and disaster. The film reaches its dramatic high point with a spectacular railroad accident and a race against time to save Thorn’s life, showcasing not just the physical risks of the industry but also the moral complexities of loyalty, sacrifice, and love.\n\nCast and Crew:\n• Director: George B. Seitz\n• Producer: RKO Radio Pictures\n• Cinematography: J. Roy Hunt\n• Editing: Otto Ludwig\n\nStarring:\n• Louis Wolheim as Dan Thorn\n• Jean Arthur as Mary Ryan\n• Robert Armstrong as Larry Doyle\n• Hugh Herbert as Fred\n• Frank Sheridan as Ryan\n• Robert Edeson as President\n\nFilm Significance:\nDanger Lights is remembered for its authentic railroad sequences filmed on location in Montana, which provided audiences of the 1930s with a realistic glimpse into the lives of railroad workers. The film captures the transition from the silent era to early sound productions, balancing melodrama with gritty industrial realism. Jean Arthur, who would later become one of Hollywood’s most celebrated leading ladies, gives an early performance that hints at her future stardom.\n\nThe movie is also significant as one of the first features released by RKO Radio Pictures, a studio that would go on to become a major force in Hollywood’s Golden Age. Its combination of romance, danger, and industrial spectacle made it both a crowd-pleaser and a unique time capsule of railroad America.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Danger Lights remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1930 release was in black and white, consistent with early sound cinema. While authentic, many modern viewers are less likely to engage with black-and-white films. By colorizing and restoring Danger Lights, the railroad sequences gain new visual depth, making the drama more immersive and the performances more immediate for today’s audience. This edition bridges historical authenticity with modern accessibility, honoring the film’s legacy while opening it to new generations of viewers.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant features. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#DangerLights #JeanArthur #LouisWolheim #RobertArmstrong #PublicDomainMovie #RailroadDrama #ColorizedClassic #1930sCinema #FilmRestoration #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:49:51.044Z",
      "thumbnail": "https://i.ytimg.com/vi/iY2vAy0-uKg/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBdKEAwDw==&rs=AOn4CLDaVhJzUrrZtxrRi8OTjxpCah-gVA",
      "duration": 4361,
      "language": "en",
      "year": 1930,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/danger-lights-1930-colorized-movie-576p-sd",
      "id": "danger-lights-1930-colorized-movie-576p-sd",
      "title": "Danger Lights (restored, colorized) (1930, pre-code drama, imdb score: 6.1)",
      "description": "Danger Lights is a 1930 American Pre-Code drama film , directed by George B. Seitz , from a screenplay by James Ashmore Creelman . It stars Louis Wolheim , Robert Armstrong , and Jean Arthur . The plot concerns railroading on the Chicago, Milwaukee, St. Paul and Pacific Railroad (Milwaukee Road), and the movie was largely filmed along that railroad's lines in Montana . The railway yard in Miles City, Montana , was a primary setting, while rural scenes were shot along the railway line through Sixteen Mile Canyon, Montana. Additional footage was shot in Chicago, Illinois (where the Milwaukee Road was headquartered until 1986, when it went out of business). The film was the first ever shot in the new Spoor-Berggren Natural Vision Process . In 1958, the film entered the public domain in the United States because the claimants did not renew its copyright registration in the 28th year after publication.",
      "fileSize": 999756873,
      "addedAt": "2026-01-07T00:07:51.628Z",
      "thumbnail": "https://archive.org/services/img/danger-lights-1930-colorized-movie-576p-sd",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 195
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "74 min",
    "imdbRating": 6.1,
    "imdbVotes": 671,
    "Genre": "Adventure, Drama",
    "Plot": "Head railroad man Dan is as ugly as he is honorable. When he spots a drifter who'd hopped a freight held up by a landslide, Dan offers the man a job; then he finds the man was a railroader, too, and takes him under his wing. Engaged to Mary, Dan doesn't notice the growing attraction between his protégé and his intended, but focuses instead on running the railroad.",
    "Director": "George B. Seitz",
    "Writer": "James Ashmore Creelman",
    "Actors": "Louis Wolheim, Jean Arthur, Robert Armstrong",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021820",
    "tt0022206",
    "tt0022826",
    "tt0021281",
    "tt0020691",
    "tt0020959",
    "tt0021374",
    "tt0020030",
    "tt0018908",
    "tt0019699",
    "tt0022242",
    "tt0020320"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:14:16.674Z"
}