{
  "imdbId": "tt0059448",
  "title": "Mirage",
  "year": 1965,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mirage-1965",
      "id": "mirage-1965",
      "title": "Mirage (1965) Gregory Peck, Diane Baker",
      "description": "Gregory Peck witnessed a murder but doesn't remember it.",
      "fileSize": 1706192787,
      "addedAt": "2026-01-07T00:09:54.328Z",
      "thumbnail": "https://archive.org/services/img/mirage-1965",
      "language": "eng",
      "year": 1965,
      "collection": "feature_films",
      "downloads": 471
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "108 min",
    "imdbRating": 7.2,
    "imdbVotes": 6488,
    "Genre": "Mystery, Thriller",
    "Plot": "Walking down twenty-seven flights of stairs after the power goes out in the New York City office building he is in, David Stillwell emerges outside on the ground level to find that a man he didn't know either jumped or was pushed out a window to his death. That man was Charles Calvin, the head of Unidyne, a humanitarian organization that works toward world peace. David notices other unusual goings-on. What he considers his normal routine that others he knows should recognize, don't. People that he doesn't know seem to know him, such as the beautiful young woman with who he walked down the stairs but who ran off when they got to the bottom. And things that he thought he saw or thought he knew end up not being the case, such as the multiple sub-basement levels he thought were in that office building which don't seem to exist in the clear light of day. When he finally thinks about it, he believes he has some form of amnesia. As an example, he knows that he works as a cost accountant, but he has no idea what a cost accountant is or does. He soon learns that some people are following him and are after something that he has, he not knowing what it is, and that they will shoot to kill if they don't get it. Conversely, the young woman, who he learns is named Shela and was once a love of his, is trying to convince him to cooperate with the people after him if only to save his life. Every direction David turns for official assistance, he comes up not trusting anyone, with the exception of a novice private detective he hires named Ted Caselle. Shela and the people after David all refer to \"the major\" as the person at the top who wants what David has. David may have to look deep into his troubled psyche to come out of his amnesia to learn who the major is, what he wants, whether David is willing to give it up if he indeed does have it, and that the death of Charles Calvin had some part to play. But David may be dead before he can even make an informed decision to cooperate or not.",
    "Director": "Edward Dmytryk",
    "Writer": "Peter Stone, Howard Fast",
    "Actors": "Gregory Peck, Diane Baker, Walter Matthau",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0058405",
    "tt0061811",
    "tt0057495",
    "tt0041460",
    "tt0055470",
    "tt0058620",
    "tt0060095",
    "tt0057917",
    "tt0150524",
    "tt0064186",
    "tt0056923",
    "tt9214844"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.328Z"
}