{
  "imdbId": "tt0072379",
  "title": "Vos gueules les mouettes!",
  "year": 1974,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/vos-gueules-les-mouettes-1974",
      "id": "vos-gueules-les-mouettes-1974",
      "title": "Vos Gueules Les Mouettes (1974)",
      "description": "Vos gueules, les mouettes ! Film français Réalisation : Robert Dhéry Scénario : Colette Brosset, d'après une idée de Robert Dhéry Genre : Comédie Date de sortie : 30 octobre 1974 La famille Kenavec habite « Saint-On », tout petit port de Bretagne. Passionnés de photographie et de tournage cinéma, ils apprennent que la télévision nationale ORTF organise un grand concours primé pour réaliser des films amateurs, dont le lot principal s'élève à 5 000 francs. Le film récompensé doit également être diffusé à l'antenne nationale. Ils décident alors de filmer le quotidien de leur « pays » et mettent toute la population à contribution, sous la houlette de Bibi... Avec l'aide du député local, ami du directeur de l'ORTF, ils gagnent le concours. Mais le film projeté le soir de la récompense ne sera pas tout à fait celui attendu... Casting : Robert Dhéry : Benoît Kenavec Colette Brosset : Annick Pierre Mondy : Bibi Kenavec Jacques Legras : Monsieur le Marlec / Le prêtre / Le trompettiste Micheline Dax : Madame le Marlec Christian Duvaleix : Maman Kenavec / Un marin / Le mendiant Robert Rollis : Le cul-de-jatte Robert Castel : Antoine, le patron de la \"Crêpe d'Alger\" Pierre Tornade : Le capitaine / Le musicien Bernard Mongourdin : un marin Maurice Ducasse : un marin Tola Koukoui : le marin noir Jacques Marin : Le porte-bannière Jacques Rouland : Le présentateur TV Pierre Olaf : Pierrot François Nadal : Le capitaine du jumping Jacques Duby : Le gardien de phare Jacques Eyser : Le PDG de l'ORTF Isabelle Duby : Anne Fernand Berset : Le chauffeur Michel Le Bihan : l'amant d'une bigoudène Alain Le Bihan : l'amant de la femme du capitaine Joël Felzines : un membre du jury Jean Michel Raffy : un membre du Jury Jean Paul Galy : un membre du jury Annie Clément : une danseuse du cercle celtique Sophie Destaing : une danseuse du cercle celtique Claude Jourdan : un danseur du cercle celtique Régine Moreau : une danseuse du cercle celtique Jean Perrot : un danseur du cercle celtique Voltigeur : le cheval monté par Annick Eugénie Goadec : elle-même Maryvonne Goadec : elle-même Anastasie Goadec : elle-même G M T Y Détecter la langueAfrikaansAlbanaisAllemandAmhariqueAnglaisArabeArménienAzériBasqueBengaliBiélorusseBirmanBosniaqueBulgareCatalanCebuanoChichewaChinois SimpChinois TradCingalaisCoréenCorseCréole haïtienCroateDanoisEspagnolEspérantoEstonienFinnoisFrançaisFrisonGaélique ÉcosseGalicienGalloisGéorgienGrecGudjaratiHaoussaHawaïenHébreuHindiHmongHongroisIgboIndonésienIrlandaisIslandaisItalienJaponaisJavanaisKannadaKazakhKhmerKirghizKurdeLaotienLatinLettonLituanienLuxembourgeoisMacédonienMalaisienMalayalamMalgacheMaltaisMaoriMarathiMongolNéerlandaisNépalaisNorvégienOuzbekPachtôPanjabiPersanPolonaisPortugaisRoumainRusseSamoanSerbeSesothoShonaSindhîSlovaqueSlovèneSomaliSoudanaisSuédoisSwahiliTadjikTagalogTamoulTchèqueTeluguThaïTurcUkrainienUrduVietnamienXhosaYiddishYoroubaZoulou AfrikaansAlbanaisAllemandAmhariqueAnglaisArabeArménienAzériBasqueBengaliBiélorusseBirmanBosniaqueBulgareCatalanCebuanoChichewaChinois SimpChinois TradCingalaisCoréenCorseCréole haïtienCroateDanoisEspagnolEspérantoEstonienFinnoisFrançaisFrisonGaélique ÉcosseGalicienGalloisGéorgienGrecGudjaratiHaoussaHawaïenHébreuHindiHmongHongroisIgboIndonésienIrlandaisIslandaisItalienJaponaisJavanaisKannadaKazakhKhmerKirghizKurdeLaotienLatinLettonLituanienLuxembourgeoisMacédonienMalaisienMalayalamMalgacheMaltaisMaoriMarathiMongolNéerlandaisNépalaisNorvégienOuzbekPachtôPanjabiPersanPolonaisPortugaisRoumainRusseSamoanSerbeSesothoShonaSindhîSlovaqueSlovèneSomaliSoudanaisSuédoisSwahiliTadjikTagalogTamoulTchèqueTeluguThaïTurcUkrainienUrduVietnamienXhosaYiddishYoroubaZoulou Fonction Sound est limitée à 200 caractères Options : Historique : Commentaires : Donate Fermer",
      "fileSize": 1184610473,
      "addedAt": "2026-01-07T00:13:06.700Z",
      "thumbnail": "https://archive.org/services/img/vos-gueules-les-mouettes-1974",
      "language": "fre",
      "year": 1974,
      "collection": "feature_films",
      "downloads": 11216
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "82 min",
    "imdbRating": 5.5,
    "imdbVotes": 83,
    "Genre": "Comedy",
    "Plot": "A TV channel organizes a super-8 competition, and Kenavec family decides to film their small village in Brittany.",
    "Director": "Robert Dhéry",
    "Writer": "Colette Brosset, Gérard Calvi, Robert Dhéry",
    "Actors": "Le Bagad Ar-Re-Goz, Fernand Berset, Colette Brosset",
    "Language": "French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0070439",
    "tt0311354",
    "tt0188526",
    "tt0068595",
    "tt0168838",
    "tt0070651",
    "tt0195242",
    "tt0184986",
    "tt0071216",
    "tt0184057",
    "tt0072431",
    "tt0179848"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.700Z"
}