{
  "imdbId": "tt0053250",
  "title": "First Spaceship on Venus",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FirstSpaceshipOnVenusMPEG",
      "title": "FirstSpaceshipOnVenusMPEG",
      "description": "A spaceship on a mission to Venus uncovers an increasingly sinister secret. You can find out more about this film on its IMDB page .",
      "id": "FirstSpaceshipOnVenusMPEG"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FirstSpaceshipOnVenus_586",
      "title": "FirstSpaceshipOnVenus 586",
      "description": "Filmoteca Stanislaw Lem (Revista de Letras)",
      "id": "FirstSpaceshipOnVenus_586"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/first-spaceship-on-venus-remastered-classic-full-sci-fi-movie-english-hd-2021",
      "title": "First Spaceship On Venus Remastered Classic Full Sci Fi Movie English Hd",
      "description": "International astronauts (Yôko Tani, Oldrich Lukes, Ignacy Machowski) go to Venus and find remnants of a race that destroyed itself.",
      "id": "first-spaceship-on-venus-remastered-classic-full-sci-fi-movie-english-hd-2021"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bXe-fv-K24k",
      "title": "First Spaceship On Venus (1960) [Science Fiction] [Adventure]",
      "description": "First Spaceship on Venus, (a.k.a. in German: Der Schweigende Stern; in Polish: Milcząca Gwiazda; in English: The Silent Star (also Planet of the Dead and Spaceship Venus Does Not Reply) is a 1960 East German/Polish color science fiction film, directed by Kurt Maetzig, that stars Günther Simon, Julius Ongewe, and Yoko Tani. The film was first released by VEB Progress Film-Vertrieb in East Germany. It is based on the science fiction novel The Astronauts by Stanisław Lem.\n\nIn 1962 the much-shortened, 79 minute, dubbed release from Crown International Pictures substituted the title \"First Spaceship on Venus\" for the English-speaking market. The film was released theatrically in the U.S. in 1962 on a double bill with the 1958 Japanese film Varan the Unbelievable. First Spaceship On Venus was later featured in episodes of both Mystery Science Theater 3000 and Cinema Insomnia.\n\nThe movie starts in 1985 when engineers involved in an industrial project to irrigate the Gobi Desert accidentally unearth a mysterious and apparently artificial \"spool\". When found to be made of a material unknown on Earth, the spool is circumstantially linked to the Tunguska explosion of 1908. The spool is seized on as evidence that the explosion, originally blamed on a meteor, was actually caused by an alien spaceship.\n\nProfessor Harringway deduces the craft must have come from Venus. The spool itself is determined to be a flight recorder and is partially decoded by an international team of scientists led by Professor Sikarna and Dr. Tchen Yu. When radio greetings sent to Venus go unanswered, Harringway announces that a journey to Venus is the only alternative. The recently completed Soviet spaceship Cosmostrator intended to voyage to Mars, is redirected to Venus, a 30- to 31-day journey. During the voyage, Sikarna works furiously to translate the alien message using the spaceship's computer.\n\nWhen their spaceship nears Venus, radio interference from the planet cuts the crew off from Earth. By then, Sikarna's efforts lead to a stunning discovery: The spool describes a Venusian plan to irradiate the Earth's surface, with the extermination of mankind being the prelude to an invasion. Rather than containing a \"cosmic document\", as had been expected, the spool bears a cold-blooded message of destruction. Harringway convinces the crew to press on towards Venus rather than return to Earth with news that would panic mankind.\n\nWith the ship's robot, Omega, American astronaut Brinkman pilots a one-man landing craft. On the ground, he encounters an industrial complex and finds small recording devices that look like insects. The rest of the crew follows when Cosmostrator lands, but they find no Venusian life forms. Journeying across the planet, they find the remains of a deserted and blasted city centered around a huge crater, signs of a catastrophic explosion so intense that shadowy forms of humanoid Venusians are permanently burned on to the walls of the surviving buildings.\n\nThe Venusians are gone, but their machines remain functioning, including the radiation-bombardment machine intended for Earth. One of the scientists accidentally triggers the weapon, leading to a frantic effort by the Earthmen to disarm it. Tchen Yu lowers Talua, the ship's communication officer, into the Venusian command center. When Tchen Yu's suit is punctured, Brinkman ventures out to save him. Before he can reach Yu, Talua succeeds in reversing the weapon. Unfortunately, this also reverses Venus' gravitational field, flinging Cosmostrator into space. Brinkman is also repelled off the planet, beyond the reach of the spaceship, while Talua and Tchen Yu remain marooned on Venus. The surviving crew members must return to Earth, where they warn humanity about the dangers of atomic weapons.\n\n---\n\nDirected by Kurt Maetzig, written by J. Fethke, W. Kohlhasse, G. Reisch, G. Rücker and A. Stenbock-Fermor, screenplay by Kurt Maetzig and J. Barkhauer, based on \"Astronauci\" by Stanisław Lem, starring  Günther Simon, Julius Ongewe and Yoko Tani.\n\n---\n\nSource: \"First_Spaceship_on_Venus\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 15 April 2017. Web. 02 May 2017. https://en.wikipedia.org/wiki/First_Spaceship_on_Venus\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "id": "bXe-fv-K24k",
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XO_a8hlEdfI",
      "title": "First Spaceship on Venus (1960) SCI-FI",
      "description": "Stars: Yoko Tani, Oldrich Lukes, Ignacy Machowski\nDirector: Kurt Maetzig\n\nWhen an alien artifact discovered on Earth is found to have come from Venus, an international team of astronauts embarks to investigate its origins!",
      "id": "XO_a8hlEdfI",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VpTz3V03AKE",
      "title": "First Spaceship on Venus (1960) Cosmic Sci-Fi Catastrophe Awaits! 4K",
      "description": "When Earth decodes a radioactive relic from Venus, an international crew blasts toward the Morning Star—only to discover a dead world armed with planet-killing tech that could still erase humanity.\nAfter linguist Dr. Tchen Yu deciphers an alien artifact revealing Venus' invasion plans, Professor Harringway Hawling leads astronauts Robert Brinkmann and Dr. Sumiko Ogimura on a perilous mission. They find a civilization obliterated by its own doomsday weapon... now accidentally reactivated by their arrival.\n\nOriginal Title: Der schweigende Stern (1960) | AKA: The Silent Star, First Spaceship to Venus\n\n⭐️ STARRING\nYôko Tani - Dr. Sumiko Ogimura\nOldřich Lukes - Prof. Harringway Hawling\nIgnacy Machowski - Prof. Durand\nGünther Simon - Robert Brinkmann\nJulius Ongewe - Talua\nTang Hua-Ta - Dr. Tchen Yu\nLucyna Winnicka - Joan Moran\n\n🎬 CREW\nDirected by Kurt Maetzig \nBased on Stanisław Lem's novel The Astronauts \nMusical score by Andrzej Markowski\nCinematography by Joachim Hasler\n\n🎯 WHY WATCH?\n• 🪐 Retro-futuristic spectacle  🤖 Robot sidekick alert  ☢️ Chillingly relevant – A pacifist parable about tech hubris that predicted nuclear anxiety (without doomscrolling!)\n\n00:00 – Full movie with subtitles.\n09:45 – John discovers a mysterious map hidden in an old chest.\n18:30 – Sarah and John team up to uncover the first clue in a dense forest.\n28:10 – A hermit provides cryptic warnings about the dangers ahead.\n39:00 – John and Sarah navigate treacherous traps in the ancient ruins.\n50:20 – The pair uncovers the treasure chamber but faces a shocking betrayal.\n1:03:10 – A tense showdown leads to the truth about the treasure’s origin.\n1:12:30 – John ensures the treasure is preserved and returns home transformed.\n\n🔔 Craving more vintage sci-fi?  Subscribe @CultCinemaClassics\nSci-Fi • Cold War Cinema • Space Exploration • Vintage Futurism",
      "id": "VpTz3V03AKE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "JP"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "79 min",
    "imdbRating": "4.6",
    "imdbVotes": "3,221",
    "Genre": "Sci-Fi",
    "Plot": "(U.S. Version) A mysterious magnetic spool found during a construction project is discovered to have originated from Venus. A rocket expedition to Venus is launched to discover the origin of the spool and the race that created it.",
    "Director": "Kurt Maetzig",
    "Writer": "Stanislaw Lem, Jan Fethke, Wolfgang Kohlhaase",
    "Actors": "Yôko Tani, Oldrich Lukes, Ignacy Machowski",
    "Language": "German",
    "Country": "East Germany, Poland",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0054415",
      "title": "12 to the Moon",
      "year": 1960,
      "imdbRating": "3.3",
      "imdbVotes": "1,502",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054330",
      "title": "Assignment: Outer Space",
      "year": 1960,
      "imdbRating": "3.6",
      "imdbVotes": "1,066",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054285",
      "title": "Atom Age Vampire",
      "year": 1960,
      "imdbRating": "3.9",
      "imdbVotes": "1,759",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053593",
      "title": "The Amazing Transparent Man",
      "year": 1960,
      "imdbRating": "4.1",
      "imdbVotes": "2,798",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053651",
      "title": "Beyond the Time Barrier",
      "year": 1960,
      "imdbRating": "5.3",
      "imdbVotes": "2,086",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054099",
      "title": "Mill of the Stone Women",
      "year": 1960,
      "imdbRating": "6.5",
      "imdbVotes": "2,187",
      "language": "Italian, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054020",
      "title": "The Leech Woman",
      "year": 1960,
      "imdbRating": "4.8",
      "imdbVotes": "2,330",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054387",
      "title": "The Time Machine",
      "year": 1960,
      "imdbRating": "7.5",
      "imdbVotes": "47,044",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053337",
      "title": "Teenagers from Outer Space",
      "year": 1959,
      "imdbRating": "3.9",
      "imdbVotes": "3,938",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053611",
      "title": "Attack of the Giant Leeches",
      "year": 1959,
      "imdbRating": "3.7",
      "imdbVotes": "5,018",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053103",
      "title": "Battle Beyond the Sun",
      "year": 1959,
      "imdbRating": "4.4",
      "imdbVotes": "1,165",
      "language": "Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054950",
      "title": "Battle of the Worlds",
      "year": 1961,
      "imdbRating": "4.3",
      "imdbVotes": "1,020",
      "language": "Italian",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:33:30.775Z"
}