{
  "imdbId": "tt0023935",
  "title": "The Death Kiss",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheDeathKiss",
      "title": "TheDeathKiss",
      "description": "Actor killed by a bullet while filming. Was it murder? Bela Lugosi has a small role.",
      "id": "TheDeathKiss"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Death_Kiss",
      "title": "The Death Kiss",
      "description": "The Death Kiss re-unites three of the stars of Dracula in a Hollywood movie-set murder mystery",
      "id": "The_Death_Kiss"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=okiNme3G1UU",
      "title": "The Death Kiss (1933) | Colorized Public Domain Mystery with Bela Lugosi and David Manners",
      "description": "The Death Kiss (1933) is a Pre-Code mystery film directed by Edwin L. Marin and produced by KBS Productions. Originally released in black and white, this restored and colorized public domain classic breathes new life into a cleverly self-referential Hollywood murder mystery. Featuring Bela Lugosi and David Manners—fresh off their success in Dracula (1931)—the film combines suspense, satire, and intrigue in a way that modern audiences in the United States, Europe, and worldwide can still enjoy. By presenting this forgotten gem in high-quality color, Colorized Public Domain ensures a cinematic experience that bridges 1930s storytelling with contemporary viewing expectations.\n\nPlot Summary:\nThe story begins at a film studio during the shooting of a murder scene for a movie called The Death Kiss. Suddenly, fiction turns into reality when lead actor Myles Brent (Edmund Burns) is shot and killed on set. What initially appears to be an accident quickly reveals deeper layers of conspiracy. Reporter Franklyn Drew (David Manners), who also happens to be the studio’s scenario writer, takes it upon himself to investigate. He grows suspicious of the cast and crew, uncovering rivalries, jealousies, and hidden motives among the actors and production staff.\n\nStudio manager Joseph Steiner (Bela Lugosi) tries to control the chaos, but the deeper Drew digs, the more dangerous the mystery becomes. With staged scenes, planted evidence, and real bullets mixed into the production, the line between film and reality blurs. Tension rises as suspects include the ambitious starlet Marcia Lane (Adrienne Ames), the bitter supporting actors, and even Brent’s off-screen enemies. The climax builds toward a shocking revelation, exposing both the killer and the cynical underbelly of Hollywood’s Golden Age studio system.\n\nCast and Crew:\n• Director: Edwin L. Marin\n• Producer: Trem Carr\n• Screenplay: Gordon Kahn, Barry Barringer\n• Cinematography: Norbert Brodine\n• Editing: Jack Ogilvie\n\nStarring:\n• David Manners as Franklyn Drew\n• Adrienne Ames as Marcia Lane\n• Bela Lugosi as Joseph Steiner\n• Edmund Burns as Myles Brent\n• Edward Van Sloan as Tom Avery\n• Alexander Carr as Leon A. Grossmith\n• Vince Barnett as Officer Gulliver\n\nFilm Significance:\nThe Death Kiss is notable for reuniting Bela Lugosi, David Manners, and Edward Van Sloan, who starred together in Dracula (1931). Unlike traditional horror, this film blends Hollywood satire with a murder mystery, providing a rare behind-the-scenes look at the movie industry of the early 1930s. While considered a B-picture, its witty script, atmospheric studio setting, and clever use of “film within a film” structure make it stand out among early sound-era mysteries. For fans of Lugosi, it also showcases his versatility beyond the horror genre.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Death Kiss remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1933 release was in black and white, typical of early Pre-Code productions. While historically authentic, black-and-white visuals can alienate modern audiences, particularly in first-world markets like the USA and Europe. By colorizing this film, we revive its suspense and dark humor for contemporary viewers, offering a fresh way to enjoy Bela Lugosi and David Manners outside of their iconic Universal horror roles.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from Hollywood’s Golden Age, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences worldwide.\n\n#TheDeathKiss #BelaLugosi #DavidManners #AdrienneAmes #1930sMystery #PublicDomainMovie #ColorizedClassic #PreCodeHollywood #ClassicCinema #FilmRestoration #1933Movies #GoldenAgeHollywood #MurderMystery",
      "id": "okiNme3G1UU",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-death-kiss-1932",
      "title": "The Death Kiss (1932)",
      "description": "When a movie actor is shot and killed during production, the true feelings about the actor begin to surface. As the studio heads worry about negative publicity, one of the writers tags along as the killing is investigated and clues begin to surface. Watch on RetroFlix:  https://retroflix.org/the-death-kiss-1932/",
      "id": "the-death-kiss-1932"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Zn4lgjh0hH4",
      "title": "The Death Kiss (1932) BELA LUGOSI",
      "description": "Stars: Bela Lugosi, David Manners, Adrienne Ames\nDirector: Edwin L. Marin\n\nWhile filming the closing scene of \"The Death Kiss,\" the leading man is actually killed. Having been married to or played around with most of the women connected with the movie studio, there are lots of suspects. When the leading lady is arrested for the killing, her boyfriend starts an investigation to prove her innocence.",
      "id": "Zn4lgjh0hH4",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iLDg9Tm7RHg",
      "title": "The Death Kiss (1932) Bela Lugosi | Comedy, Crime, Pre-Code Film",
      "description": "LOVE was her only alibi! The evidence was all against her! A Hollywood story that tells you more than the headlines! A ROMANCE OF MYSTERY AND LOVE IN THE \"MOVIES!\nWhile performing the final scene of \"The Kiss of Death,\" the protagonist is murdered. There are many suspects, as he has flirted, acted, or married nearly all the women in the studio.\n\nOriginal title: The Death Kiss (1932)\n\n\nDirector: Edwin L. Marin\nWriters: Madelon St. Dennis, Barry Barringer, Gordon Kahn\nStars: Bela Lugosi, David Manners, Adrienne Ames\nGenres: Classics, Comedy, Crime, Drama\n\n00:00 Full length movie.\n05:15 A murder mystery unfolds on a film set after a star actor is shot dead.\n08:21  Murder investigation unfolds on a film set after a fatal shooting incident involving real bullets.\n14:31  Investigation into a murder on a film set reveals multiple suspects and motives, leading to a twist in the case.\n19:20 Murder mystery unfolds on a film set, involving sabotage and intrigue among the cast and crew.\n28:46 Murder investigation unfolds on a film set, implicating the chief electrician. Detective Drew follows leads to apprehend the suspect.\n33:32 Murder mystery unfolds as clues point to a staged suicide through poisoned gin and altered crime scene.\n40:34 Murder investigation reveals car sabotage, leading to suspect fleeing to Malibu for safety.\n47:32 Murder investigation implicates actress, sparking studio turmoil and media frenzy.\n53:22 Intrigue unfolds as a mysterious incident at a hotel leads to a film retake involving a murder scene.\n1:02:19 Murder mystery unravelled through clues found in victim's belongings, leading to suspects within film studio.\n1:05:12 Murder mystery unraveled with clever detective work, revealing the culprit behind a staged accident.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYT_Zk0DHuuOUVtCef1TewS\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "iLDg9Tm7RHg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "75 min",
    "imdbRating": "6.0",
    "imdbVotes": "1,546",
    "Genre": "Comedy, Crime, Drama",
    "Plot": "While filming the closing scene of \"The Death Kiss\", leading man Myles Brent is actually killed. Having played around with, or been married to, most of the women connected with the movie studio, there are lots of suspects. When leading lady Marcia Lane is arrested for the killing, her suiter, a studio writer, starts to investigate the killing in order to prove her innocence.",
    "Director": "Edwin L. Marin",
    "Writer": "Madelon St. Dennis, Barry Barringer, Gordon Kahn",
    "Actors": "Bela Lugosi, David Manners, Adrienne Ames",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0024065",
      "title": "The Girl in 419",
      "year": 1933,
      "imdbRating": "6.1",
      "imdbVotes": "107",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024904",
      "title": "Bombay Mail",
      "year": 1934,
      "imdbRating": "7.1",
      "imdbVotes": "110",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023271",
      "title": "Night World",
      "year": 1932,
      "imdbRating": "6.9",
      "imdbVotes": "496",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021890",
      "title": "The Front Page",
      "year": 1931,
      "imdbRating": "6.7",
      "imdbVotes": "3,541",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024679",
      "title": "Tomorrow at Seven",
      "year": 1933,
      "imdbRating": "5.6",
      "imdbVotes": "393",
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023896",
      "title": "Clear All Wires!",
      "year": 1933,
      "imdbRating": "6.0",
      "imdbVotes": "185",
      "language": "French, Russian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027784",
      "title": "I'd Give My Life",
      "year": 1936,
      "imdbRating": "5.8",
      "imdbVotes": "52",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024985",
      "title": "City Park",
      "year": 1934,
      "imdbRating": "5.4",
      "imdbVotes": "46",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021198",
      "title": "Officer O'Brien",
      "year": 1930,
      "imdbRating": "5.0",
      "imdbVotes": "63",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0021508",
      "title": "Up the River",
      "year": 1930,
      "imdbRating": "5.9",
      "imdbVotes": "1,386",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039266",
      "title": "Christmas Eve",
      "year": 1947,
      "imdbRating": "5.7",
      "imdbVotes": "830",
      "language": "English, Spanish, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022789",
      "title": "Crooner",
      "year": 1932,
      "imdbRating": "5.9",
      "imdbVotes": "186",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:58:22.047Z"
}