{
  "imdbId": "tt0002282",
  "title": "Iola's Promise",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewIolasPromise",
      "id": "PreviewIolasPromise",
      "title": "\"Iola's Promise\" (1912) director D. W. Griffith with Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"Iola's Promise\" is a short Indian drama, included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame.   Directed by               D. W. Griffith Produced by             Biograph Company Scenario by                Belle Taylor       Starring                     Mary Pickford, Alfred Paget, Frank Evans, Charles Hill Mailes, Dorothy Bernard Cinematography        Billy Bitzer Distributed by           General Film Company Release date               March 14, 1912 Running time             15 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 21585315,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewIolasPromise",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 3629
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "18 min",
    "imdbRating": 5.8,
    "imdbVotes": 54,
    "Genre": "Short, Romance, Western",
    "Plot": "Iola, the little Indian girl, is held captive by a gang of cutthroats, from whose clutches and abuse she is rescued by Jack Harper, a prospector. She is truly grateful to Jack, for she regards him as something different from the white people she has seen. Jack's sweetheart and her father are parties of a wagon-train headed for this place, and as luck has been against him, he is somewhat gloomy. Iola learns the reason, and promises to help him find gold. He is amused at this and says \"Will you?\" \"Yes.\" \"Cross your heart?\" This cross-your-heart action mystifies the little Indian. She thinks it is a sort of tribe insignia and tells her people that \"Crossheart\" people are all right. Iola surely pays her debt of gratitude, not only in finding gold, but in giving her life to protect Jack's sweetheart from her own people, who are embittered against all whites.",
    "Director": "D.W. Griffith",
    "Writer": "Belle Taylor",
    "Actors": "Mary Pickford, Alfred Paget, Frank Evans",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001387",
    "tt0002197",
    "tt0002497",
    "tt0002302",
    "tt0002176",
    "tt0002357",
    "tt0001978",
    "tt0003662",
    "tt0001896",
    "tt0001452",
    "tt0001371",
    "tt0001458"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}