{
  "imdbId": "tt0007613",
  "title": "The Adventurer",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CC_1917_10_22_TheAdventurer",
      "title": "Charlie Chaplin's \"The Adventurer\"",
      "description": [
        "Charlie Chaplin's 62nd Film Released Oct. 22 1917 The Adventurer is a short comedy film written and directed by Charlie Chaplin. It is the last out of the twelve films made while he was under contract for the Mutual Film Corportation. Chaplin plays an escaped convict on the run from prison guards. He falls into favor with a wealthy family after he saves a young lady (Edna Purviance) from drowning, but her suitor (Eric Campbell) does everything he can to have Chaplin apprehended by the officials. The film also stars Henry Bergman, and Albert Austin, and marked the final film of his co-star Eric Campbell who would be dead before the end of the year in a drunk driving accident. http://www.imdb.com/title/tt0007613/",
        "Charlie Chaplin In The Internet Archive http://www.archive.org/details/CC_1914_02_02_MakingALiving http://www.archive.org/details/CC_1914_02_07_KidsAutoRaceAtVenice http://www.archive.org/details/CC_1914_02_09_MabelsStrangePredicament http://www.archive.org/details/CC_1914_02_28_BetweenShowers http://www.archive.org/details/CC_1914_03_02_FilmJohnny http://www.archive.org/details/CC_1914_03_16_HisFavoritePasttime http://www.archive.org/details/CC_1914_03_26_CruelCruelLove http://www.archive.org/details/CC_1914_04_04_TheLandladysPet http://www.archive.org/details/CC_1914_04_20_TwentyMinutesofLove http://www.archive.org/details/CC_1914_04_27_CaughtinaCaberet http://www.archive.org/details/CC_1914_05_07_ABusyDay http://www.archive.org/details/CC_1914_06_01_TheFatalMallet http://www.archive.org/details/CC_1914_06_11_TheKnockout http://www.archive.org/details/CC_1914_06_13_MabelsBusyDay http://www.archive.org/details/CC_1914_06_20_CharlottEtLeMannequin http://www.archive.org/details/CC_1914_07_09_LaffingGas http://www.archive.org/details/CC_1914_08_01_CharolotGargonDeTheater http://www.archive.org/details/CC_1914_08_10_FaceOnTheBarroomFloor http://www.archive.org/details/CC_1914_08_13_CharliesRecreation http://www.archive.org/details/CC_1914_08_27_TheMasquerader http://www.archive.org/details/CC_1914_08_31_TheGoodforNothing http://www.archive.org/details/CC_1914_09_07_TheRounders http://www.archive.org/details/CC_1914_09_14_TheNewJanitor http://www.archive.org/details/CC_1914_10_10_TheRivalMashers http://www.archive.org/details/CC_1914_10_26_DoughandDynamite http://www.archive.org/details/CC_1914_10_29_CharlottMabelAuxCourses http://www.archive.org/details/CC_1914_11_14_TilliesPuncturedRomance http://www.archive.org/details/CC_1914_11_07_MusicalTramps http://www.archive.org/details/CC_1914_11_09_HisTrystingPlace http://www.archive.org/details/CC_1914_12_05_AFairExchange http://www.archive.org/details/CC_1914_12_07_HisPrehistoricpast http://www.archive.org/details/CC_1915_02_01_HisNewJob http://www.archive.org/details/CC_1915_02_15_ANightOut http://www.archive.org/details/CC_1915_03_01_TheChampion http://www.archive.org/details/CC_1915_03_18_InThePark http://www.archive.org/details/CC_1915_04_11_TheTramp http://www.archive.org/details/CC_1915_04_29_ByTheSea http://www.archive.org/details/CC_1915_06_21_Work http://www.archive.org/details/CC_1915_07_12_AWoman http://www.archive.org/details/CC_1915_08_09_TheBank http://www.archive.org/details/CC_1915_10_04_CharlieShanghaied http://www.archive.org/details/CC_1915_11_20_ANightInTheShow http://www.archive.org/details/CC_1915_12_18_ABurlesqueOnCarmen http://www.archive.org/details/CC_1916_05_15_TheFloorwalker http://www.archive.org/details/CC_1916_05_27_Police http://www.archive.org/details/CC_1916_06_12_TheFireman http://www.archive.org/details/CC_1916_07_10_TheVagabond http://www.archive.org/details/CC_1916_08_07_One_A_M http://www.archive.org/details/CC_1916_09_04_TheCount http://www.archive.org/details/CC_1916_10_02_ThePawnshop http://www.archive.org/details/CC_1916_11_13_BehindtheScreen http://www.archive.org/details/CC_1916_12_04_TheRink http://www.archive.org/details/CC_1917_04_16_TheCure http://www.archive.org/details/CC_1917_06_17_TheImmigrant http://www.archive.org/details/CC_1917_10_22_TheAdventurer http://www.archive.org/details/CC_1918_09_29_TheBond http://www.archive.org/details/CC_1918_10_20_ShoulderArms http://www.archive.org/details/CC_1918_xx_xx_TripleTrouble http://www.archive.org/details/CC_1919_06_15_Sunnyside http://www.archive.org/details/CC_1919_12_15_ADaysPleasure __________________________________________________"
      ],
      "id": "CC_1917_10_22_TheAdventurer"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheAdventurer1917",
      "title": "Charlie Chaplin's \"The Adventurer\" (1917)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Adventurer\" is one of Charlie Chaplin's Mutual short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. The film is very entertaining with a lot of action.  It is the best known of the 12 Mutual comedies and at the time made Charlie Chaplin the most popular screen personality. Directed by               Charlie Chaplin Produced by             Lone Star Corporation Scenario by                Charlie Chaplin           Starring                     Charlie Chaplin, Eric Campbell, Edna Purviance Cinematography        Roland H. Totheroh Distributed by           Mutual Film Corporation Release date               October 23, 1917 Running time             23 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "TheAdventurer1917"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-adventurer",
      "title": "The Adventurer",
      "id": "silent-the-adventurer"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-adventurer-",
      "title": "The Adventurer",
      "description": "Gene Barry",
      "id": "the-adventurer-"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-adventurer-1917",
      "title": "The Adventurer (1917)",
      "description": "The Adventurer is an American short comedy film made in 1917 written and directed by Charlie Chaplin, and is the last of the twelve films made under contract for the Mutual Film Corporation. Watch on RetroFlix.org:  https://retroflix.org/the-adventurer-1917/",
      "id": "the-adventurer-1917"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-adventurer-1917-directed-by-charlie-chaplin",
      "title": "The Adventurer (1917) Directed By Charlie Chaplin",
      "description": "Theatrical release poster Directed by Charlie Chaplin Edward Brewer (technical director) Written by Charlie Chaplin (scenario) Vincent Bryan (scenario) Maverick Terrell (scenario) Produced by John Jasper Starring Charlie Chaplin Edna Purviance Eric Campbell Cinematography Roland Totheroh George C. Zalibra Edited by Charlie Chaplin Distributed by Mutual Film Corporation Release date October 22, 1917 Running time 24 minutes Country United States Language Silent (English intertitles ) The Adventurer is an American short comedy film made in 1917 written and directed by Charlie Chaplin , and is the last of the twelve films made under contract for the Mutual Film Corporation . Plot This film starts with a man-hunt, where the police are hunting for an escaped convict (Charlie Chaplin) who has cleverly eluded the guards so far. One police officer ( Henry Bergman ) is told to guard the beach in case the escaped felon came within sight again. However, unbeknownst to the officer, Charlie is actually buried under sand next to the officer. Fully aware of the danger, he is very cautious regarding his escape. He unburies himself very cautiously, however, Bergman is asleep, and he falls back on the hole which Charlie created while un-burying himself. Of course, Charlie makes a run, but it is too late. The officer fires, missing Charlie by an inch. Charlie hurriedly climbs up a vertical wall of mud and stone, and the officer chases after him. Charlie, however, finishes Bergman off by throwing a rock at him. In vain, he shoots, but it misses Charlie's head by a mile. A few seconds later, however, it seems Charlie is finished when a policeman stealthily creeps up to him. He steps on his hand, presumably to not let him escape, presumably as a reminder that his time is up. However, Charlie thinks it's a stray stone and covers it with mud. When he looks up and sees the officer, however, the chase resumes, and the Tramp eludes the officer. Charlie runs, into a group of officers. Charlie runs all the way up to the top of the dusty cliff. Just when it seems like Charlie is free, another officer leaps in out of nowhere and shoots Charlie. However, the shot missed its mark, and Charlie, feigning death, fools the officer successfully. In the middle of the check-up to make sure the convict was dead, Charlie kicks him down the hill. He takes the officer's hiding place (a disguised hole in the rock) while Bergman and his companion come to that same spot looking for Charlie. Charlie sees them and makes a stealthy escape—however, not stealthy enough to alert them at the last moment. Charlie comes through to the other end of the hole, grabs a police officer's gun, and uses this to threaten the police. Meanwhile, he tiptoes backwards, trips against a stray rock, and accidentally fires at Bergman. The shot was not fatal, but irritates him. Helpless, Charlie swims towards the deep seas. The policemen chase him in a boat. Of course, they are unprepared for the high tide, and a huge wave knocks them over. Charlie swims over towards a boat where a man is desperately trying to take off his wet shirt. The scene cuts towards a girl and her lover ( Edna Purviance and Eric Campbell ). They realize Edna's mother ( Marta Golden ) is drowning. They go over to help her. Edna begs Campbell to help, but he refuses because of his weight. She jumps in, while Campbell leans against the fence and hawks at her. However, this man's weight causes him to fall in the water. Hearing the chaos ensuing between Campbell, Edna and her mother, Charlie, who had just found some dry land, decides to investigate. He jumps back into the water and swims over to where he thinks the chaos is taking place. He finds Edna on the shore, frantic, and Edna, seeing Charlie, begs him to save her mother. Charlie saves Edna first, then her mother, then swims towards Campbell and swims circles around him. Finally, he uses his beard to pull himself back to shore. He then rescues everybody else. The authorities arrive, and Edna's unconscious mother is the first to go into the ambulance. However, she soon gains her consciousness, and Charlie lies to her, and before heading back to rescue Campbell, in the process unintentionally tossing him back into the water. He goes back and rescues Campbell. However, in the process, Charlie hurts himself and lies down on the shore, helpless and unable to walk. However, a policeman saw him, called Edna, and rescues the injured Charlie. Charlie now wakes up in the house of Edna, the woman he now loves. However, him wearing his striped pajamas, and lying in a bed with bars at the head, makes him think he is in prison, which is cleared when the butler enters with a towel. Edna and Charlie go to the balcony to socialize, where Charlie accidentally kicks Campbell. Campbell thinks it is intentional, however, and kicks him back. They go on kicking each other for a while, till a lady intervenes between Charlie and Campbell. Since Campbell and Charlie had their backs to each other, Campbell couldn't see the lady intervening. Therefore, he kicks her buttock, thinking it's Charlie's he's kicked. He gets embarrassed by his blunder, and the others are bothered by it. Inside, while Edna plays the piano, Campbell tries getting revenge but to no avail. Charlie sloshes a whole lot of beer on him, and he retreats. However, when he does, he sees Charlie's face on the newspaper, under the headline \"Criminal Escapes: Convict Still at Large\". Of course, this was a good way of getting revenge. Therefore, when Charlie talks away with Edna's father, who was Judge Brown, the man who sentenced him to prison, Charlie is scared. But he acts calm, going under the alias \"Commodore Slick\". However, at the worst possible moment, Campbell barges in, shoves Charlie out and tells Judge Brown to come look at the newspaper. When Charlie comes across the headline, he is scared stiff and nervous. As a last resort, he takes out his pen and draws a beard, so (hopefully) Judge Brown thinks Campbell is the convict. Of course, Brown falls for the trap. When a determined Campbell stalks in with the judge, he grabs the paper and shows it to Brown. Of course, Brown thinks that this man has got it wrong, and shows it to Charlie. Charlie looks at the paper, and looks back at Bergman. He talks to everybody inside, trying to blend in after that near brush with Judge Brown. He talks to everybody, including Edna, and then decides to go to the kitchen with Edna. But in the kitchen, the cook is giving a meal to her policeman friend, so when the knock sounds, the policeman hurriedly goes towards the closet. Charlie and Edna enter just as she is closing the door, so Charlie is curious. He opens the closet, sees the policeman and, in an instant, closes the door and darts out of the room. What follows is a nerve-wracking chase with some slapstick overtures. Several times, Charlie comes close to getting caught. Several times, he survives by the skin of his teeth. And, in the end, one police officer corners him. It looks like the end, like Charlie will finally be apprehended—until Charlie outwits him. He introduces the policeman and Edna, and when the policeman is taking his police hat off, Charlie breaks away from his grasp and runs away, the police chasing him. Cast Charlie Chaplin - The Convict Edna Purviance - The Girl Eric Campbell - The Suitor Henry Bergman - The Father Albert Austin - The Butler Marta Golden - The Girl's Mother May White - Lady Frank J. Coleman - Prison Guard (uncredited) Critical reception Chaplin broadened the scope of his comedic delivery considerably during his time with Mutual, and this picture is another wherein he made bold choices that departed from the old format of his films. This was acknowledged by a reviewer from The Moving Picture World that began with the byline: \"Latest Mutual-Chaplin Comedy Moves Upward in Grade But Loses None of Comedian's Usual Amount of Laughs.\" He continued: \"There is very little of the old slapstick, custard pie type of comedy used in this picture, but the comedian has introduced a generous share of sure-fire comedy business, and he still retains his unmatchable ability to plant a swift kick at any and all times where it will do the most good and the least harm.\" [ 1 ] A re-release of the film inspired this enthusiastic review in the August 16, 1920 New York Times . This was written during a period in which Chaplin's film output was practically nonexistent. \"On the Rivoli program, and also at the Rialto, is a Chaplin revival. The Adventurer , which makes one wish, between laughs, that the screen's best comedian would get to work and do what everyone knows he is capable of. There is a slap-stick coarse humor in The Adventurer , but also some of Chaplin's most irresistible pantomime .\" [ 2 ] Sound version In 1932, Amedee Van Beuren of Van Beuren Studios, purchased Chaplin's Mutual comedies for $10,000 each, added music by Gene Rodemich and Winston Sharples and sound effects, and re-released them through RKO Radio Pictures . Chaplin had no legal recourse to stop the RKO release. [ 3 ] References 1 Chalmers Publishing Company (1917). Moving Picture World (Nov 1917) . New York The Museum of Modern Art Library. New York, Chalmers Publishing Company. 2 Movies2.nytimes.com 3 SilentComedians entry Archived 2014-01-12 at the Wayback Machine",
      "id": "the-adventurer-1917-directed-by-charlie-chaplin"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "24 min",
    "imdbRating": "7.3",
    "imdbVotes": "4,613",
    "Genre": "Comedy, Short",
    "Plot": "Charlie escapes from prison. After rescuing a girl and her mother from drowning, Charlie is invited to their home where a big party is held and he is treated like a hero. However, as a result Charlie's photo is printed in the newspapers and the prison guards come after him.",
    "Director": "Charles Chaplin",
    "Writer": "Vincent Bryan, Charles Chaplin, Maverick Terrell",
    "Actors": "Charles Chaplin, Edna Purviance, Eric Campbell",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0008133",
      "title": "The Immigrant",
      "year": 1917,
      "imdbRating": "7.5",
      "imdbVotes": "9,530",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007832",
      "title": "The Cure",
      "year": 1917,
      "imdbRating": "7.1",
      "imdbVotes": "3,960",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007880",
      "title": "Easy Street",
      "year": 1917,
      "imdbRating": "7.4",
      "imdbVotes": "5,934",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006548",
      "title": "The Count",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,527",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006689",
      "title": "The Floorwalker",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,839",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007507",
      "title": "The Vagabond",
      "year": 1916,
      "imdbRating": "6.8",
      "imdbVotes": "3,287",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007194",
      "title": "Police",
      "year": 1916,
      "imdbRating": "6.4",
      "imdbVotes": "2,047",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006684",
      "title": "The Fireman",
      "year": 1916,
      "imdbRating": "6.5",
      "imdbVotes": "3,032",
      "language": "English, None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008907",
      "title": "The Bond",
      "year": 1918,
      "imdbRating": "5.4",
      "imdbVotes": "1,213",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007162",
      "title": "The Pawnshop",
      "year": 1916,
      "imdbRating": "7.0",
      "imdbVotes": "3,922",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009018",
      "title": "A Dog's Life",
      "year": 1918,
      "imdbRating": "7.6",
      "imdbVotes": "10,161",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:46.532Z"
}