{
  "imdbId": "tt0024727",
  "title": "The Vampire Bat",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheVampireBat",
      "title": "TheVampireBat",
      "description": "The city of Kleinschloss is infected with a dark scourge from the past. A Legion of bloodsucking creatures who can assume human form have returned to prey upon the unsuspecting citizens. Detective Karl Brettschneider begins investigating numerous gory deaths at the request of the burgomaster. Despite the obvious evidence, he refuses to accept the existence of vampiric human bats, but soon their existence proves all too real.",
      "id": "TheVampireBat"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheVampireBat1933",
      "title": "TheVampireBat1933",
      "description": "The Vampire Bat takes a different route from most other vampire films of its day and there is as much science in the story as their is supertition. In this film though the science is no bad thing because where there is science there is usually a scientist and scientists often need an assitant. In this film the assistant, Ruth Bertin, is played by the lovely Fay Wray who is also the love interest of the local police chief, Karl Brettschneider and when Karl's hands are not full with his investigtion his arms are filled with Ruth. Busy man! You can find out more about The Vampire Bat at A Passion For Horror .",
      "id": "TheVampireBat1933"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheVampireBat1933_68",
      "title": "TheVampireBat1933 68",
      "description": "Villagers are turning up dead and vampires are suspected. A man who is fond of bats is suspected and a angry mob gets rid of him. But the attacks don't stop. Mystic Nights Videos",
      "id": "TheVampireBat1933_68"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheVampireBatcompleteVersion",
      "title": "TheVampireBatcompleteVersion",
      "description": "An unknown and unstopable vampire terrorizes a middle-European village. The featured players are Lionel Atwill, Fay Wray, Melvyn Douglas and Dwight Frye. Directed by Frank R. Strayer. Released in 1933",
      "id": "TheVampireBatcompleteVersion"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Vampire_Bat_1933",
      "title": "The Vampire Bat",
      "description": "\"These are the TALONS of The Vampire Bat\" This copy is sharper than the others that appear on the Internet Archive. Copyright Status: PUBLIC DOMAIN Registered: THE VAMPIRE BAT. 1933. 7 reels. Credits: Producer, Phil Goldstone; director, Frank Strayer; screen story, Edward T. Lowe; film editor, Otis Garrett. (c) Majestic Pictures Corp.; 19Jan33; LP3579. NO RENEWALS FOUND. There are two versions available for download: - NTSC (480p @ 24 fps) Run Time: 1:02:37 - PAL (576p @ 25 fps) Run Time: 1:00:08 They are both transferred from the same complete, uncut print of the film. All footage and scene transitions are present in this print.",
      "id": "The_Vampire_Bat_1933"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1YjFBmuuVGE",
      "title": "The Vampire Bat (1933) [Horror]",
      "description": "The Vampire Bat (1933) is an American horror movie starring Lionel Atwill, Fay Wray, Melvyn Douglas and Dwight Frye.\n\nWhen the villagers of Kleinschloss start dying of blood loss, the town fathers suspect a resurgence of vampirism. While police inspector Karl remains skeptical, scientist Dr. von Niemann cares for the vampire's victims one by one, and suspicion falls on simple-minded Herman Gleib because of his fondness for bats. A blood-thirsty mob hounds Gleib to his death, but the vampire attacks don't stop.\n\n---\n\nDirected by Frank R. Strayer, produced by Phil Goldstone and Larry Darmour, written by Edward T. Lowe Jr., starring Lionel Atwill, Fay Wray, Melvyn Douglas, Dwight Frye and Maude Eburne.\n\n---\n\nSource: \"The Vampire Bat\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 6 June 2012. Web. 9 July 2012. http://en.wikipedia.org/wiki/The_Vampire_Bat.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "1YjFBmuuVGE",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3eSONCo4PKA",
      "title": "The Vampire Bat (1933) | Colorized Public Domain Horror Classic with Fay Wray and Lionel Atwill",
      "description": "The Vampire Bat (1933) is a chilling American horror film from the pre-Code era, directed by Frank R. Strayer and produced by Majestic Pictures. This restored and colorized public domain classic brings fresh intensity to one of the early 1930s horror gems, blending atmospheric suspense, gothic terror, and scientific intrigue. By reviving this film in high-quality color, Colorized Public Domain makes it accessible for modern audiences across the United States, Europe, and beyond, ensuring a deeper appreciation for a film that once stood alongside Universal’s legendary horror productions.\n\nPlot Summary:\nIn a small German village, terror grips the townsfolk after a string of mysterious deaths. Victims are found drained of blood, and superstitious whispers quickly blame vampires for the horror. As panic spreads, villagers turn against each other, with fear driving suspicion and violence. Karl (Melvyn Douglas), a rational-minded inspector, doubts the supernatural explanation and begins searching for a more logical cause behind the killings. His investigation brings him face-to-face with Dr. Otto von Niemann (Lionel Atwill), a respected physician whose sinister experiments reveal shocking truths. Alongside Karl is Ruth Bertin (Fay Wray), Niemann’s assistant and Karl’s love interest, who becomes entangled in the mystery as events spiral toward a deadly climax. At the center of suspicion is Herman Gleib (Dwight Frye), a bat-loving outcast whose eccentric behavior makes him an easy target for the fearful villagers. The story builds to a dramatic conclusion that combines gothic horror with early science-fiction elements, making The Vampire Bat a fascinating entry in pre-Code horror cinema.\n\nCast and Crew:\n• Director: Frank R. Strayer\n• Producer: Phil Goldstone\n• Screenplay: Edward T. Lowe Jr.\n• Cinematography: Ira H. Morgan\n• Editing: Otis Garrett\n\nStarring:\n• Lionel Atwill as Dr. Otto von Niemann\n• Fay Wray as Ruth Bertin\n• Melvyn Douglas as Karl Brettschneider\n• Dwight Frye as Herman Gleib\n• Maude Eburne as Gussie Schnappmann\n• George E. Stone as Emil Borst\n• Lionel Belmore as Bürgermeister Gustave Schoen\n\nFilm Significance:\nThe Vampire Bat stands as a key example of independent horror filmmaking during the 1930s. Produced outside of Universal’s studio system, it nevertheless captured the same eerie gothic tone that audiences loved in Dracula (1931) and Frankenstein (1931). Fay Wray, already known as the “Scream Queen” of the era for her work in King Kong (1933), gives another memorable performance, while Lionel Atwill cements his reputation as one of horror cinema’s most sinister figures. Dwight Frye, famous for his roles in Dracula and Frankenstein, adds further credibility, playing a tragic outsider haunted by his obsession with bats. Today, the film is remembered for its moody atmosphere, strong performances, and its ability to blend gothic horror with early scientific themes, offering modern audiences both thrills and cultural insight into pre-Code Hollywood.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Vampire Bat remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1933 release was presented in black and white, a standard of its time. While historically authentic, modern audiences often overlook black-and-white films. By offering a colorized edition, we bridge the gap between historical preservation and contemporary viewing habits, creating a version that feels immersive and engaging while staying faithful to the original atmosphere of classic horror.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheVampireBat #1930sHorror #PublicDomainMovie #ColorizedClassic #FayWray #LionelAtwill #DwightFrye #ClassicCinema #PreCodeHollywood #FilmRestoration #1933Movies #GothicHorro",
      "id": "3eSONCo4PKA",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-vampire-bat",
      "title": "The Vampire Bat",
      "description": "This film has fallen into the Public Domain.",
      "id": "the-vampire-bat"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-vampire-bat-1933-colorized",
      "title": "The Vampire Bat (1933) Colorized",
      "description": "The Vampire Bat (1933) Colorized",
      "id": "the-vampire-bat-1933-colorized"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-vampire-bat-1933_202312",
      "title": "The Vampire Bat (1933)",
      "description": "When the villagers of Kleinschloss start dying of blood loss, the town fathers suspect a resurgence of vampirism. While police inspector Karl Brettschneider remains skeptical, scientist Dr. Otto von Niemann cares for the vampire's victims one by one, and suspicion falls on simple-minded Herman Gleib because of his fondness for bats. A blood-thirsty mob hounds Gleib to his death, but the vampire attacks don't stop. Watch on RetroFlix:  https://retroflix.org/the-vampire-bat-1933/",
      "id": "the-vampire-bat-1933_202312"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/vampire_bat_50fps_4k",
      "title": "The Vampire Bat (1933) [Colorized, 4K, 60FPS]",
      "description": "Dr Jekyll and Mr Hyde is a 1920 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   The Vampire Bat a 1933 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "vampire_bat_50fps_4k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qyPwas-JEnk",
      "title": "The Vampire Bat (1933) FAY WRAY",
      "description": "Stars: Lionel Atwill, Fay Wray, Melvyn Douglas\nDirector: Frank R. Strayer\n\nWhen the villagers of Klineschloss start dying of blood loss, the town fathers suspect a resurgence of vampirism. While police inspector Karl remains skeptical, scientist Dr. von Niemann cares for the vampire's victims one by one, and suspicion falls on simple-minded Herman Gleib because of his fondness for bats. A blood-thirsty mob hounds Gleib to his death, but the vampire attacks don't stop.",
      "id": "qyPwas-JEnk",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IctQwO6YYpQ",
      "title": "The Vampire Bat (1933) Drama, Horror, Mystery | Full Movie | Subtitled",
      "description": "When corpses drained of blood begin to show up in a European village, vampirism is suspected to be responsible.\n\nColorized version: https://youtu.be/5ZwKV-ST7NE\n\n\nOriginal title: The Vampire Bat (1933) \n\nDirector: Frank R. Strayer \nWriter: Edward T. Lowe Jr. \nStars: Lionel Atwill, Fay Wray, Melvyn Douglas\nGenres: Classics, Cult Film, Horror, Mystery, Drama\n\n\n@CultCinemaClassics \nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "IctQwO6YYpQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "65 min",
    "imdbRating": "5.7",
    "imdbVotes": "3,180",
    "Genre": "Drama, Horror, Mystery",
    "Plot": "When the villagers of Klineschloss start dying of blood loss, the town fathers suspect a resurgence of vampirism. While police inspector Karl remains skeptical, scientist Dr. von Niemann cares for the vampire's victims one by one, and suspicion falls on simple-minded Herman Gleib because of his fondness for bats. A blood-thirsty mob hounds Gleib to his death, but the vampire attacks don't stop.",
    "Director": "Frank R. Strayer",
    "Writer": "Edward T. Lowe Jr.",
    "Actors": "Lionel Atwill, Fay Wray, Melvyn Douglas",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026230",
      "title": "Condemned to Live",
      "year": 1935,
      "imdbRating": "4.8",
      "imdbVotes": "569",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023187",
      "title": "Manhattan Tower",
      "year": 1932,
      "imdbRating": "6.4",
      "imdbVotes": "257",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025169",
      "title": "The Ghost Walks",
      "year": 1934,
      "imdbRating": "5.6",
      "imdbVotes": "663",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023236",
      "title": "The Monster Walks",
      "year": 1932,
      "imdbRating": "4.1",
      "imdbVotes": "1,126",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024368",
      "title": "Mystery of the Wax Museum",
      "year": 1933,
      "imdbRating": "6.8",
      "imdbVotes": "7,365",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023583",
      "title": "The Thirteenth Guest",
      "year": 1932,
      "imdbRating": "5.7",
      "imdbVotes": "937",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025064",
      "title": "Double Door",
      "year": 1934,
      "imdbRating": "6.8",
      "imdbVotes": "381",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025062",
      "title": "Two Monks",
      "year": 1934,
      "imdbRating": "7.0",
      "imdbVotes": "674",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026759",
      "title": "Phantom Ship",
      "year": 1935,
      "imdbRating": "5.4",
      "imdbVotes": "1,092",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023859",
      "title": "By Appointment Only",
      "year": 1933,
      "imdbRating": "5.4",
      "imdbVotes": "131",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037711",
      "title": "Fog Island",
      "year": 1945,
      "imdbRating": "5.3",
      "imdbVotes": "1,065",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025921",
      "title": "Twin Husbands",
      "year": 1933,
      "imdbRating": "6.4",
      "imdbVotes": "115",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T03:00:56.626Z"
}