{
  "imdbId": "tt0001892",
  "title": "Den sorte drøm",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-den-sorte-drm",
      "id": "silent-den-sorte-drm",
      "title": "Den sorte drøm",
      "fileSize": 904213395,
      "addedAt": "2026-01-07T00:10:59.116Z",
      "thumbnail": "https://archive.org/services/img/silent-den-sorte-drm",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 255
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "53 min",
    "imdbRating": 5.8,
    "imdbVotes": 254,
    "Genre": "Drama",
    "Plot": "Two men of high rank are both wooing the beautiful and famous equestrian acrobat Stella. While Stella ignores the jeweler Hirsch, she accepts Count von Waldberg's offer to follow her home, where she falls in his arms. At her party some days later Hirsch turns up uninvited. He says he wants to give Stella a piece of jewelry, but she repulses his advances. When Waldberg sees this he knocks Hirsch down. Hirsch challenges him to a duel by cards. Waldberg loses all his money, and in the end also has to sign a promissory note on 85.000, which should be paid within 24 hours. To help Waldberg solve his debt Stella goes to Hirsch to receive the brooch he has promised her. While he turns away, she steals a precious necklace from him, but he happens to see the theft in a mirror. He tails her to a park, where he sees Stella giving the necklace to Waldberg. Hirsch tells Stella to come to him at midnight, if she wants him to be silent about the theft. When Waldberg finds out that Stella is going to Hirsch in the night, he becomes jealous and goes there as well. By mistake he happens to shoot Stella, who reveals her sacrifice for him before she dies.",
    "Director": "Urban Gad",
    "Writer": "Urban Gad, Gebhard Schätzler-Perasini",
    "Actors": "Asta Nielsen, Valdemar Psilander, Gunnar Helsengreen",
    "Language": "None",
    "Country": "Germany, Denmark",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001105",
    "tt0001987",
    "tt0001510",
    "tt0001593",
    "tt0001915",
    "tt1207008",
    "tt0001615",
    "tt0001753",
    "tt0001499",
    "tt0001701",
    "tt0001733",
    "tt0001741"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.116Z"
}