{
  "imdbId": "tt0040779",
  "title": "Shed No Tears",
  "year": 1948,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5Gbz2v9kQdU",
      "title": "Shed No Tears (1948) [Film Noir] [Crime] [Drama]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | Edna Grover (Vincent) convinces her older husband Sam (Ford) to fake his own death so they can collect on the life insurance. He hides in another city under an assumed name while she identifies a burned body found after a hotel fire as her husband. Edna collects the money but she has been having an affair for some time and double-crosses her husband. The whole situation rouses the suspicions of the Sam's son from a previous marriage who hires a private investigator to look into it. Unfortunately the PI is crooked and Edna pays him to stay silent. In the end, when Sam finds out about Edna's secret lover (Roberts), he is so distraught that he commits suicide.\n\n---\n\nDirected by Jean Yarbrough, produced by Robert Frost, written by Brown Holmes and Virginia M. Cooke, story by Don Martin, starring Wallace Ford as Sam Grover, June Vincent as Edna Grover, Mark Roberts as Ray Belden, Frank Albertson as Lt. Hutton, Richard Hogan as Tom Grover, Elena Verdugo as Marilyn, Johnstone White as Huntington Stewart.\n\n---\n\nSource: \"Shed No Tears\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 5 September 2013. Web. 20 October 2013. http://en.wikipedia.org/wiki/Shed_No_Tears.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "5Gbz2v9kQdU",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Shed_No_Tears_1948",
      "title": "Shed No Tears",
      "description": "A suspenseful movie starring Wallace Ford and June Vincent. Don't bother downloading the h.264 file. The Cinepack file from which it is derived is smaller.",
      "id": "Shed_No_Tears_1948"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CfQAe0iGpxM",
      "title": "Shed No Tears (1948) | Colorized Public Domain Film Noir Crime Drama | Wallace Ford and June Vincent",
      "description": "Shed No Tears (1948) is an American film noir crime drama directed by Jean Yarbrough and distributed by Film Classics. This tense, low-budget thriller exemplifies the postwar noir tradition, where greed, betrayal, and desperation collide in a web of lies and double-crosses. Restored and colorized by Colorized Public Domain, this edition revives a shadowy and overlooked gem, making it visually engaging for modern audiences in the United States, Europe, and worldwide. With its moody atmosphere, cynical tone, and twisting narrative, it stands as a strong example of the type of mid-century noir films that thrived outside the big studios yet captured the anxieties of the era.\n\nPlot Summary:\nSam Grover (Wallace Ford) is a middle-aged man trapped in a passionless marriage to Edna (June Vincent), an ambitious woman yearning for money and excitement. When Edna convinces Sam to fake his death in a phony car accident, the scheme promises them an insurance payout of $50,000. But like all noir plans, things quickly unravel. Sam soon realizes that Edna’s intentions are darker than he expected—she intends to claim the money for herself while pursuing a younger lover, reporter Ray Belden (Mark Roberts).\n\nMeanwhile, insurance investigator Huntington Stewart (Milburn Stone) grows suspicious of the supposed accident and follows a trail of clues that begin to close in on the conspirators. As deceit piles upon deceit, Sam finds himself trapped in a dangerous game where trust evaporates, loyalties shift, and the line between victim and villain blurs. The film builds toward a suspenseful climax filled with betrayal, shifting motives, and the inescapable downfall of characters consumed by greed.\n\nCast and Crew:\n• Director: Jean Yarbrough\n• Producer: Walter Mirisch\n• Screenplay: Brown Holmes\n• Cinematography: Fred Jackman Jr.\n• Editing: W. Donn Hayes\n\nStarring:\n• Wallace Ford as Sam Grover\n• June Vincent as Edna Grover\n• Mark Roberts as Ray Belden\n• Milburn Stone as Huntington Stewart\n• Roland Drew as Craig Reynolds\n• Frank Wilcox as Dr. Porter\n• Claire Whitney as Mrs. Porter\n\nFilm Significance:\nShed No Tears captures the essence of the 1940s noir era with its themes of lust, greed, and betrayal set against the shadows of postwar America. Unlike the glossy productions of major studios, this independently produced feature thrived on raw storytelling and moral ambiguity. Wallace Ford, a veteran character actor, delivers one of his standout later performances, while June Vincent embodies the archetypal femme fatale. The film is notable as part of Walter Mirisch’s early career before he became one of Hollywood’s most influential producers. Its efficient runtime and taut pacing make it a quintessential B-noir, delivering suspense and atmosphere without excess.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Shed No Tears remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1948 version was filmed in black and white, a style that defined film noir’s identity but can be alienating for casual modern audiences. This restored and colorized edition preserves the shadowy tone of noir while making the story visually accessible and attractive to a new generation of viewers. The colorization enhances the tension-filled atmosphere, highlighting details often lost in the darkness of black and white. For fans of classic crime films and vintage Hollywood, it provides both a thrilling story and an important piece of noir history.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#ShedNoTears #FilmNoir #1940sCrimeDrama #PublicDomainMovie #ColorizedClassic #WallaceFord #JuneVincent #ClassicCrimeFilm #FilmRestoration #1948Movie",
      "id": "CfQAe0iGpxM",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shed-no-tears-1948",
      "title": "Shed No Tears (1948)",
      "description": "A man listens to his wife and fakes his own death so that she can get her hands on his insurance policy. Watch on RetroFlix:  https://retroflix.org/shed-no-tears-1948/",
      "id": "shed-no-tears-1948"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eRwToVIeuyw",
      "title": "Shed No Tears (1948) FILM NOIR",
      "description": "Stars: Wallace Ford, June Vincent, Mark Roberts\n Director: Jean Yarbrough\n\n A wife convinces her husband to fake his death so they can collect on the life insurance. However, he doesn't know that she has been having an affair for some time, and she has plans for the money - and they don't include him.",
      "id": "eRwToVIeuyw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": "6.3",
    "imdbVotes": "473",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Edna Grover convinces her husband, Sam, to enter a scheme where they can defraud his insurance company out of $50,000, so they can live in luxury. Sam forgets to ask Edna who 'they' is. Edna's definition of 'they' is herself and her lover, Ray Belden. There is a hotel fire, and Edna identifies the body in the fire as her husband Sam. Meanwhile, Sam flees to another city under an assumed name, where he waits for his loving-spouse to join him and they can live a life of luxury. He waits. And waits some more. And returns to ask Edna just what the delay is, and learns that the delay is another man. Before long, there is another dead man, and then a blackmailing private detective shows up, and then a police detective starts nosing around, and Sam still hasn't seen any money nor a life of luxury.",
    "Director": "Jean Yarbrough",
    "Writer": "Brown Holmes, Virginia M. Cooke, Don Martin",
    "Actors": "Wallace Ford, June Vincent, Mark Roberts",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0038643",
      "title": "Inside Job",
      "year": 1946,
      "imdbRating": "5.6",
      "imdbVotes": "213",
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034621",
      "title": "Criminal Investigator",
      "year": 1942,
      "imdbRating": "5.2",
      "imdbVotes": "58",
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039220",
      "title": "Brighton Rock",
      "year": 1948,
      "imdbRating": "7.3",
      "imdbVotes": "7,156",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041187",
      "title": "Blonde Ice",
      "year": 1948,
      "imdbRating": "6.0",
      "imdbVotes": "1,410",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040237",
      "title": "Close-Up",
      "year": 1948,
      "imdbRating": "5.7",
      "imdbVotes": "199",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040257",
      "title": "Cry of the City",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "3,838",
      "language": "English, Italian, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040366",
      "title": "Force of Evil",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "8,043",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040444",
      "title": "Hollow Triumph",
      "year": 1948,
      "imdbRating": "6.7",
      "imdbVotes": "3,284",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040512",
      "title": "Kiss the Blood Off My Hands",
      "year": 1948,
      "imdbRating": "6.8",
      "imdbVotes": "2,308",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040647",
      "title": "No Orchids for Miss Blandish",
      "year": 1948,
      "imdbRating": "6.0",
      "imdbVotes": "782",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040160",
      "title": "The Big Clock",
      "year": 1948,
      "imdbRating": "7.6",
      "imdbVotes": "10,549",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040947",
      "title": "Walk a Crooked Mile",
      "year": 1948,
      "imdbRating": "6.3",
      "imdbVotes": "1,188",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:50.366Z"
}