{
  "imdbId": "tt0006405",
  "title": "Kitchener's Great Army in the Battle of the Somme",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-kitcheners-great-army-in-the-battle-of-the-somme",
      "title": "Kitchener's Great Army in the Battle of the Somme",
      "id": "silent-kitcheners-great-army-in-the-battle-of-the-somme"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-wwi-battle-of-the-somme-summary-audio-1080p-s-ai-p-3",
      "title": "WWI, Battle Of The Somme in color (1916) [ Summary]",
      "description": "The Battle of the Somme took place between 1 July 1916 and 18 November 1916. It was one of the major battles of World War 1, fought between the armies of the British Empire and French Third Republic against the German Empire and took place along the banks of the French river Somme, East of the town of Albert. The full 72 minute enhanced and colorized version of this film can be viewed here :     • Stunning footage ...   This film concentrates on the battles around the 1 July 1916 and is viewed entirely from a British perspective with a substantial amount of glorification of the battle results. The army of the British Empire is often referred to as \"Kitchener's Army\" or even \"Kitchener's mob\" in view of the fact that it largely comprised of volunteers drafted as the result of an agressive \"Call to Arms\" campain setup by Field Marshall Lord Kitchener in August 1914. Kitchener who originally was a succesful British commander of the Egyptian army, had been appointed as Secretary of State for War by prime minister Herbert Asquith. His army initially consisted of traditional batallions manned by lower class soldiers. However, after forming socalled \"Pals\" battalions, huge numbers of middle class recruits joined as well to form groups that were separate from the lower class battalions. By the summer of 1916 the recruitment had been so successful that the British were able to form no less than 5 armies comprising of approximately 2 million men. Unalike WWII there was no role for women in WWI. To avoid a misconception, Lord Kitchener was never directly involved in the Battle of the Somme, simply because he was already dead at that time. Kitchener was on his way to Russia on HMS Hampshire to attend negotiations with Tsar Nicholas II when on 5 June 1916 it was struck by a German mine near the Orkney islands, Scotland. It sank taking Kitchener down to a seamans grave as one of the 737 casualties. Preceeding the main attack on 1 July, a severe bombardement of the German lines started on 24 June, the so called drum fire or Trommelfeuer, which lasted until it peaked at \"Zero Hour\" on 1 July. Kitchener's men could only hope that this bombardement had stunned the enemy into submission. Once the attack started, the British and French soldiers were pushed towards \"no mans land\" into a stream of machine gun fire and under continuous bombardements from both sides of the line. Kitchener's men underwent a fate of mixed success and failure, largely related to the leadership, terrain, the width of no-mans land and other local circumstances. The losses on the British side were staggering, with 19,420 men dead and 35,493 wounded in that first day. 2,737 men went missing or became POW resulting in a total number of losses of 57.000 men. It was the bloodiest day in British military history ever. In particular at Serre, and at La Boisselle heavy losses were due to strong German resistance. In the months thereafter the battle continued, but at a less intense level until it died down on 18th November due to rain and winter conditions. This film starts with splended shots of battallions preparing for the attack at the end of June followed by many shots behind the combat lines of men preparing for attacks, resting after the attacks on 1 July, wounded being carried away from the battle scene, being treated for their injuries and soldiers marching away to regroup for new attacks in the days and weeks ahead. The original B&W film was clearly shot in the lee of the actual battle as it hardly contained any close up views of the atrocities that took place. In view of Youtube's rules, the remaining scort scenes with combat fatalities are not shown. It is quit obvious that the results of the British army were glorified in the making of this film. This is a 16 minute summary. Music: - Bonnie Grace - \"March Towards The End\" - Jon Björk - \"The Great War\" - Bonnie Grace - \"Heroes Will Fall\" - Bonnie Grace - \"In The Red Soil\" - Gerald Franklin - \"For The Greater Good\" - Jon Björk - \"The Launch\" - Bonnie Grace - \"March Towards The End\".",
      "id": "de-oldify-wwi-battle-of-the-somme-summary-audio-1080p-s-ai-p-3"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "74 min",
    "imdbRating": "6.6",
    "imdbVotes": "469",
    "Genre": "Documentary, War",
    "Plot": "Documentary (with some re-enacted footage) of the British army's participation in the Battle of the Somme in France during World War I.",
    "Director": "Geoffrey Malins",
    "Writer": "N/A",
    "Actors": "Beauvoir De Lisle",
    "Language": "None, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0008807",
      "title": "El último malón",
      "year": 1917,
      "imdbRating": "6.4",
      "imdbVotes": "109",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1515754",
      "title": "Chateau Thierry and Beyond",
      "year": 1919,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010375",
      "title": "The Log of the U-35",
      "year": 1919,
      "imdbRating": "6.6",
      "imdbVotes": "64",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0059529",
      "title": "Triumph Over Violence",
      "year": 1965,
      "imdbRating": "8.1",
      "imdbVotes": "2,137",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0225448",
      "title": "A Cry from the Grave",
      "year": 1999,
      "imdbRating": "7.8",
      "imdbVotes": "352",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0214483",
      "title": "Appointment in Tokyo",
      "year": 1945,
      "imdbRating": "6.6",
      "imdbVotes": "256",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0185893",
      "title": "Attack! Battle of New Britain",
      "year": 1944,
      "imdbRating": "6.3",
      "imdbVotes": "116",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0276783",
      "title": "Attack in the Pacific",
      "year": 1944,
      "imdbRating": "6.5",
      "imdbVotes": "80",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034498",
      "title": "The Battle of Midway",
      "year": 1942,
      "imdbRating": "6.1",
      "imdbVotes": "2,325",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035745",
      "title": "Combat America",
      "year": 1943,
      "imdbRating": "6.0",
      "imdbVotes": "143",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035796",
      "title": "Desert Victory",
      "year": 1943,
      "imdbRating": "6.3",
      "imdbVotes": "405",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0905617",
      "title": "Kampf um Norwegen - Feldzug 1940",
      "year": 1940,
      "imdbRating": "6.8",
      "imdbVotes": "129",
      "language": "German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T19:20:36.582Z"
}