{
  "imdbId": "tt0026854",
  "title": "The Passing of the Third Floor Back",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThePassingOfTheThirdFloorBack",
      "id": "ThePassingOfTheThirdFloorBack",
      "title": "The Passing of the Third Floor Back",
      "description": "“It certainly is unusual’ “Unique story” “Interesting characters, entertaining”   “Brilliant portrayal, neglected film” (IMDB reviews quotes). A compelling seriocomic fantasy about a mysterious stranger who manipulates the lives of tenants in a London lodging house. An offbeat film with an excellent cast headed by Conrad Veidt. Remake of the 1918 silent (which also is PD if you can find the DVD). IMDB rating 7.0. Directed by Berthold Viertel. Released in 1935. Complete print. CAST NOTE: Dedicated anti-Nazi Conrad Viedt’s second British film after he had permanently exited Germany.",
      "fileSize": 1293925063,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/ThePassingOfTheThirdFloorBack",
      "collection": "feature_films",
      "downloads": 16314
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 6.9,
    "imdbVotes": 323,
    "Genre": "Comedy, Drama, Fantasy",
    "Plot": "In a London boarding house, a number of lives exist precariously on the edge of disaster or despair. Stasia, the housemaid, hungers for happiness but is treated like a drudge and constantly threatened with a return to the punishments of her youth. Vivian, a beautiful young girl, loves the architect Chris, but must marry the repugnant Mr. Wright in order to erase her parents' debts. Miss Kite derides all around her out of fear of aging and loss of beauty, while her friend Mr. Larkcom sells mediocre phonograph records though he'd secretly love to be a concert pianist. Into the lives of these and other unhappy residents comes a mysterious stranger, under whose influence they each begin to see the possibility of happiness. But the cynical Mr. Wright prefers to see them in misery and plots to thwart the angelic stranger who lives in the back room of the third floor.",
    "Director": "Berthold Viertel",
    "Writer": "Jerome K. Jerome, Michael Hogan, Alma Reville",
    "Actors": "Conrad Veidt, Rene Ray, Frank Cellier",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029322",
    "tt0026593",
    "tt0027053",
    "tt0035938",
    "tt0092850",
    "tt0042472",
    "tt0071867",
    "tt0066181",
    "tt14717832",
    "tt2547172",
    "tt0042546",
    "tt3228702"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.034Z"
}