{
  "movieId": "tt0014967",
  "title": "The Hansom Cabman",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheHansomCabman",
      "id": "TheHansomCabman",
      "title": "\"The Hansom Cabman\" (1924) starring Harry Langdon and Marceline Day",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Hansom Cabman\" is a short comedy. This film illustrates the work of Marceline Day, a star of Silent Hall of Fame. Directed by                      Harry Edwards Produced by                    Mack Sennett Comedies Starring                           Harry Langdon, Marceline Day, Andy Clyde, Charlotte Mineau, Madeline Hurlock Cinematography             Vernon Walker and Lee Davis Distributed by                 Pathé Exchange, Inc. Release date                      October 12, 1924 Running time                   19 minutes Country                            United States Language                          Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 383799820,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheHansomCabman",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 1811
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "20 min",
    "imdbRating": 6.8,
    "imdbVotes": 125,
    "Genre": "Short, Comedy",
    "Plot": "Harry Doolittle wakes up on the day he's to marry Betty Bright. He has a terrible hangover. A strange woman appears in his room saying that he married her the night before, and just then, his fiancée and her mother arrive. There's anger all around, leading to Harry's arrest. He's jailed while awaiting trial in front of Betty's father, a judge. She visits him in the clink. He escapes and disguises himself as a cabman. The police are looking for him, as are his fiancée and her mother. Will it get straightened out in time for wedding bells to ring?",
    "Director": "Harry Edwards",
    "Writer": "John A. Waldron",
    "Actors": "Harry Langdon, Marceline Day, Charlotte Mineau",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015096",
    "tt0014667",
    "tt0014882",
    "tt0016851",
    "tt0017944",
    "tt0018744",
    "tt0279784",
    "tt0014992",
    "tt0014903",
    "tt0020152",
    "tt0015228",
    "tt0159286"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}