{
  "imdbId": "tt0007832",
  "title": "The Cure",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CharlieChaplinsTheCure1917",
      "title": "CharlieChaplinsTheCure1917",
      "id": "CharlieChaplinsTheCure1917"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-cure",
      "title": "The Cure",
      "id": "silent-the-cure"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-cure-1917",
      "title": "The Cure (1917)",
      "description": "The Cure is a 1917 short comedy film written and directed by Charlie Chaplin. The plot revolves around alcohol, being made just prior to prohibition but during a period where the politicians were debating the evils of alcohol. Watch on RetroFlix.org:  https://retroflix.org/the-cure-1917/",
      "id": "the-cure-1917"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-cure-1917-directed-by-charlie-chaplin",
      "title": "The Cure (1917) Directed By Charlie Chaplin",
      "description": "Theatrical poster for 1932 sound re-release by RKO Radio Pictures Directed by Charlie Chaplin Edward Brewer (technical director) Written by Charlie Chaplin (scenario) Vincent Bryan (scenario) Maverick Terrell (scenario) Produced by Henry P. Caulfield Starring Charlie Chaplin Edna Purviance Eric Campbell Cinematography Roland Totheroh George C. Zalibra Edited by Charlie Chaplin Distributed by Mutual Film Corporation Release dates April 16, 1917 August 19, 1932 (sound release by Van Beuren Studios / RKO Radio Pictures ) Running time 31 minutes Country United States Languages Silent film English intertitles The Cure is a 1917 short comedy film written and directed by Charlie Chaplin . The plot revolves around alcohol, being made just prior to prohibition but during a period where the politicians were debating the evils of alcohol. Synopsis Chaplin plays a drunkard who is attending a hydropathic hotel, presumably to dry out, but brings along a big suitcase full of alcohol. He gets trapped in a spinning revolving door then traps the foot of a large man with a bandaged foot, suffering from gout. He encounters a beautiful young woman and sits between her and a man who keeps offering him the spa water (which he keeps pouring away). The girl encourages him to stop drinking. He meets the big man again who tries to get the hotel manager to throw him out. Instead he gets taken for a Turkish massage. When the hotel owner learns employees are getting drunk from Charlie's liquor, he orders one man to throw the liquor out. The drunk employee hurls the bottles through the window, straight into the spa's health waters. Meanwhile Charlie is not happy to be massaged by the large man in the bath house and tries to dodge this. Outside, the well is contaminated with alcohol, sending the spa's inhabitants into a dancing stupor. Chaplin, encouraged by his new love to get sober, drinks from the spurious spa, gets drunk and offends her. She leaves him in anger and walks away. Charlie walks back to the door unsteadily, when he bumps into the large man, tripping him off his wheel chair and landing him into the alcoholic well. The next morning there are plenty of hangovers, but Chaplin turns sober, walks out and finds the lady. Realizing what had happened, she forgives him. They walk ahead, just then he accidentally steps into the liquor-laden well. Alternative Version An alternative introduction which was added to the film (during prohibition) explains that in 1917 drunkenness was a serious problem in the working class, so to keep it funny Chaplin changed from his \"Little Tramp\" character to an upper-class fop. Gout was at the time believed to be a disease of the wealthy, which is why Eric Campbell 's character has it. Chaplin as bellhop Clips from the documentary Unknown Chaplin show that Chaplin originally cast himself as a bellhop at the spa and shot at least one scene with him in that role. (The bellhop was directing pedestrian and wheelchair traffic in the lobby as a traffic cop would at a busy intersection.) Chaplin eventually discarded the idea, instead casting himself as a patient at the health spa. Reviews A reviewer from the Louisville Herald praised the film, writing, \"It's a cinch that as long as pictures like The Cure are offered to make folks forget their troubles, Chaplin will always be worth the money he gets.\" Similarly, a reviewer from Variety noted, \" The Cure is a whole meal of laughs, not merely giggles, and ought to again emphasize that fact that Charlie is in a class by himself.\" The reviewer from The Moving Picture World offered a more balanced review: \" To lovers of Chaplin comedy 'The Cure' will appeal, not as the best Chaplin effort, but as contrasting favorably with previous efforts. It cannot, for instance, compete with 'Easy Street,' but contains in the second reel some excruciatingly funny moments, particularly in the scenes at the baths.\" [ 1 ] Sound version In 1932, Amedee Van Beuren of Van Beuren Studios , purchased Chaplin's Mutual comedies for $10,000 each, added music by Gene Rodemich and Winston Sharples and sound effects, and re-released them through RKO Radio Pictures . Chaplin had no legal recourse to stop the RKO release. [ 2 ] Preservation status On September 4, 2013 a missing part of the end of the film was found and will be released on a future DVD [ citation needed ] . A restored version of The Cure was presented at the San Francisco Silent Film Festival on January 11, 2014. Cast Charlie Chaplin as The Inebriate Edna Purviance as The Girl Eric Campbell as The Man with the Gout Henry Bergman as Masseur John Rand as Sanitarium Attendant James T. Kelley as Sanitarium Attendant Albert Austin as Sanitarium Attendant Frank J. Coleman as Head of Sanitarium References 1 New York, Chalmers Publishing Company (1917). Moving Picture World (Apr-Jun 1917) . Media History Digital Library. New York, Chalmers Publishing Company. 2 SilentComedians entry Archived January 12, 2014, at the Wayback Machine",
      "id": "the-cure-1917-directed-by-charlie-chaplin"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "24 min",
    "imdbRating": "7.1",
    "imdbVotes": "3,960",
    "Genre": "Short, Comedy",
    "Plot": "Charlie goes to a spa to dry out, but he takes a trunk of liquor with him. He tangles with another's gouty foot in a revolving door. Later he thinks the gouty man is making love signs to him (he doesn't Edna, the real object of the man's efforts), so he signs back. He interpets a massage to be a wrestling match. When management throws his liquor into the fountain, when flow the healthful waters, everyone gets drunk.",
    "Director": "Charles Chaplin",
    "Writer": "Vincent Bryan, Charles Chaplin, Maverick Terrell",
    "Actors": "Charles Chaplin, Edna Purviance, Eric Campbell",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0008133",
      "title": "The Immigrant",
      "year": 1917,
      "imdbRating": "7.5",
      "imdbVotes": "9,530",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007613",
      "title": "The Adventurer",
      "year": 1917,
      "imdbRating": "7.3",
      "imdbVotes": "4,613",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007880",
      "title": "Easy Street",
      "year": 1917,
      "imdbRating": "7.4",
      "imdbVotes": "5,934",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006548",
      "title": "The Count",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,527",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006689",
      "title": "The Floorwalker",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,839",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007507",
      "title": "The Vagabond",
      "year": 1916,
      "imdbRating": "6.8",
      "imdbVotes": "3,287",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007194",
      "title": "Police",
      "year": 1916,
      "imdbRating": "6.4",
      "imdbVotes": "2,047",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006684",
      "title": "The Fireman",
      "year": 1916,
      "imdbRating": "6.5",
      "imdbVotes": "3,032",
      "language": "English, None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008907",
      "title": "The Bond",
      "year": 1918,
      "imdbRating": "5.4",
      "imdbVotes": "1,213",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007162",
      "title": "The Pawnshop",
      "year": 1916,
      "imdbRating": "7.0",
      "imdbVotes": "3,922",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009018",
      "title": "A Dog's Life",
      "year": 1918,
      "imdbRating": "7.6",
      "imdbVotes": "10,161",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:54:20.887Z"
}