{
  "imdbId": "tt0044864",
  "title": "Made in Heaven",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mih77646477",
      "title": "Mih77646477",
      "description": "Title: Made in Heaven Summary: A young couple enter the Dunmow Flitch Trial, in which a side of bacon can be won if a couple do not regret their marriage after a year, but the arrival of an attractive new housemaid throws everything into chaos. Directed by: John Paddy Carstairs Actors: David Tomlinson, Petula Clark, Sonja Ziemann Production Company: George H. Brown Productions Release Date: November 1952 (UK) Aspect Ratio: 1.37 : 1 The historic market town of Dunmow, England is famous for the Dunmow Flitch, a mock trial to find the married couple epitomizing fidelity by proving they have had thoughts of no other for a year and a day, with the winning couple receiving a flitch of bacon, especially welcome and hard to come by during the post-war era. The Tophams have lived in Dunmow for fifteen years, but are still seen as outsiders by the Dunmow traditionalists, especially Miss Rosabelle Honeycroft, the elder domineering sister of the mild-mannered vicar, Hayworth Honeycroft. That is why Miss Honeycroft is so irked that Marjorie Topham has nominated her son, Basil Topham, and Basil's wife, Julie Topham, as the only entrants in this year's Flitch. Basil and Julie's young married life is not perfect as they live with Basil's parents, Marjorie and Aubrey Topham, and Basil's grandfather, Hillary Topham - which is a little too cozy for Julie's tastes - while their house is being built by local contractor Stanley ...",
      "id": "mih77646477"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "81 min",
    "imdbRating": "5.3",
    "imdbVotes": "135",
    "Genre": "Comedy",
    "Plot": "The historic market town of Dunmow, England is famous for the Dunmow Flitch, a mock trial to find the married couple epitomizing fidelity by proving they have had thoughts of no other for a year and a day, with the winning couple receiving a flitch of bacon, especially welcome and hard to come by during the post-war era. The Tophams have lived in Dunmow for fifteen years, but are still seen as outsiders by the Dunmow traditionalists, especially Miss Rosabelle Honeycroft, the elder domineering sister of the mild-mannered vicar, Hayworth Honeycroft. That is why Miss Honeycroft is so irked that Marjorie Topham has nominated her son, Basil Topham, and Basil's wife, Julie Topham, as the only entrants in this year's Flitch. Basil and Julie's young married life is not perfect as they live with Basil's parents, Marjorie and Aubrey Topham, and Basil's grandfather, Hillary Topham - which is a little too cozy for Julie's tastes - while their house is being built by local contractor Stanley Grimes, who seems in no hurry to get the job done. Basil and Julie didn't want to enter the Flitch as it places their life under a microscope. The lives of the Tophams and of all the men in town are turned upside down with the arrival of the Topham's new housekeeper, the exotically beautiful Marta, a Hungarian who had ulterior motives for wanting the job and who has expensive and refined tastes. Basil and Aubrey are both as captivated by Marta as any man in town, which doesn't sit well with Julie. Miss Honeycroft's attempts to disqualify Basil and Julie from the Flitch for any reason, Marta kissing Basil and whether anyone saw, and the missing flitch (which was pilfered but many who feel directly responsible for what they believe is them losing it) add to the confusion as the trial proceeds.",
    "Director": "John Paddy Carstairs",
    "Writer": "George H. Brown, William Douglas-Home",
    "Actors": "David Tomlinson, Petula Clark, Sonja Ziemann",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0046464",
      "title": "Trouble in Store",
      "year": 1953,
      "imdbRating": "6.6",
      "imdbVotes": "1,173",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048346",
      "title": "Man of the Moment",
      "year": 1955,
      "imdbRating": "6.3",
      "imdbVotes": "591",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047298",
      "title": "One Good Turn",
      "year": 1955,
      "imdbRating": "6.5",
      "imdbVotes": "683",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050580",
      "title": "Just My Luck",
      "year": 1957,
      "imdbRating": "6.1",
      "imdbVotes": "710",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052233",
      "title": "The Square Peg",
      "year": 1958,
      "imdbRating": "6.8",
      "imdbVotes": "1,629",
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044925",
      "title": "Vampire Over London",
      "year": 1952,
      "imdbRating": "3.8",
      "imdbVotes": "1,012",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0044908",
      "title": "Miss Robin Hood",
      "year": 1952,
      "imdbRating": "6.1",
      "imdbVotes": "333",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044370",
      "title": "April in Paris",
      "year": 1952,
      "imdbRating": "5.9",
      "imdbVotes": "1,540",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044406",
      "title": "Bela Lugosi Meets a Brooklyn Gorilla",
      "year": 1952,
      "imdbRating": "3.7",
      "imdbVotes": "2,596",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044414",
      "title": "The Curious Adventures of Mr. Wonderbird",
      "year": 1952,
      "imdbRating": "7.2",
      "imdbVotes": "286",
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044762",
      "title": "Jack and the Beanstalk",
      "year": 1952,
      "imdbRating": "5.8",
      "imdbVotes": "3,741",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045094",
      "title": "Road to Bali",
      "year": 1952,
      "imdbRating": "6.4",
      "imdbVotes": "5,358",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T07:06:07.813Z"
}