{
  "imdbId": "tt0023649",
  "title": "Vampyr",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Vampyr1932",
      "id": "Vampyr1932",
      "title": "VAMPYR (1932)",
      "description": "Classic surreal horror movie. An arthouse type of film. This is an unrestored print with non English subtitles. CASTLE OF DOOM an Americanize version dubbed in English is also here in the Archives.",
      "fileSize": 1610227246,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/Vampyr1932",
      "collection": "feature_films",
      "downloads": 97820
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "75 min",
    "imdbRating": 7.4,
    "imdbVotes": 21418,
    "Genre": "Fantasy, Horror",
    "Plot": "Allan Gray arrives late in the evening to a secluded riverside inn in the hamlet of Courtempierre. An old man enters his room, puts a sealed parcel on the table, blurts out that some woman mustn't die, and disappears. Gray senses in this a call for help. He puts the parcel in his pocket, and goes out. Eerie shadows lead him into an old house, where he encounters a weird village doctor. The doctor receives a bottle of poison from a strange, old woman. Through the window of an old castle Gray recognizes the old man from the inn. A shadow shoots the man, who drops dead. Inside the house Gray finds his two daughters, Gisèle and Léone, and some servants. He opens the parcel, and finds an old book about vampires. Léone is seriously ill after being bitten by a vampire. Instead of helping her, the village doctor places the bottle of poison at her bedside table, and then abducts her sister Gisèle. An old servant starts reading the old book, and finds out that the vampire in Courtempierre is a dead woman called Marguerite Chopin. He goes to the cemetery, opens her grave and strikes a thick iron stick through her body. The curse is broken, Léone recovers, Gray liberates Giséle.",
    "Director": "Carl Theodor Dreyer",
    "Writer": "Sheridan Le Fanu, Christen Jul, Carl Theodor Dreyer",
    "Actors": "Julian West, Maurice Schutz, Rena Mandel",
    "Language": "German, English",
    "Country": "Germany, France",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0023245",
    "tt0021814",
    "tt0011607",
    "tt0020530",
    "tt0018770",
    "tt0016039",
    "tt0001223",
    "tt2784936",
    "tt14292086",
    "tt0013257",
    "tt0062453",
    "tt0000301"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-11T02:28:42.150Z"
}