{
  "imdbId": "tt0047146",
  "title": "Khyber Patrol",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/khyber-patrol-1954-",
      "id": "khyber-patrol-1954-",
      "title": "Khyber Patrol (1954)",
      "description": "Richard Egan, Dawn Addams, Raymond Burr, Laura Mason",
      "fileSize": 1052493278,
      "addedAt": "2026-01-07T00:09:24.699Z",
      "thumbnail": "https://archive.org/services/img/khyber-patrol-1954-",
      "collection": "feature_films",
      "downloads": 1345
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 5.5,
    "imdbVotes": 133,
    "Genre": "Adventure, History, War",
    "Plot": "Captain Kyle Cameron, a Canadian not overly impressed by discipline and diplomacy, dismisses both and loses half of his British Lancers in a battle to maintain their hold on India's Khyber Pass. Cameron incurs the wrath of his superiors---small wonder considering the KIA count---when he violates Afghan neutrality in pursuit of the guerrillas. But he has been duped. Seems that the evil Russians have been financing some guerrilla warfare in hopes of provoking a border incident and thusly justifying a move into neutral Afghanistan, the key to British-held India. Chief plotters are Captain Ahmed Shir, s \"friendly\" Afghan border guard and Prince Ishak Kahn, a sheik being held in protective custody by the British. Cameron, more than a little bit irked, gets himself thrown out of the regiment (on purpose for plot reasons), joins up with the plotters and wrecks them from within. He returns to full honors... and the hand of the Colonel's daughter, a little matter that was aided greatly when he got her fiancée killed in the early battle. For those sensing a sense of deja vu, insert Texas, Mexico, the Texas Rangers and Mexican bandits in the above and you'll have the western version done many times before at Columbia with either Buck Jones, Charles Starrett or Russell Hayden. Plus the names and places are easier to pronounce (and spell) in the westerns this one was taken from.",
    "Director": "Seymour Friedman",
    "Writer": "Jack DeWitt, Richard Schayer",
    "Actors": "Richard Egan, Dawn Addams, Raymond Burr",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0048603",
    "tt0133850",
    "tt0047376",
    "tt0048818",
    "tt0045682",
    "tt0046054",
    "tt0046029",
    "tt0045487",
    "tt0048287",
    "tt0044466",
    "tt0044936",
    "tt0045039"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.699Z"
}