{
  "movieId": "tt0034027",
  "title": "'Pimpernel' Smith",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PimpernelSmith",
      "id": "PimpernelSmith",
      "title": "Pimpernel Smith",
      "description": "Leslie Howard again has the title role in this seriocomic world war 2 updating of the classic adventure yarn of the napoleonic wars, \"The Scarlet Pimpernel.\" Directed by Leslie Howard UK release 1941 US release 1942 a.k.a. \"The Fighting Pimpernel\" & \"Mr V\" (US) Complete print NOTE: \"The Scarlet Pimpernel\" and its direct sequel, \"Return of the Scarlet Pimpernel,\" are also available here at IA in the Feature Films Collection.",
      "fileSize": 946324314,
      "addedAt": "2026-01-07T00:06:45.466Z",
      "thumbnail": "https://archive.org/services/img/PimpernelSmith",
      "collection": "feature_films",
      "downloads": 18714
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pimpernel-smith-1941",
      "id": "pimpernel-smith-1941",
      "title": "'Pimpernel' Smith (1941)",
      "description": "Eccentric Cambridge archaeologist Horatio Smith takes a group of British and American archaeology students to pre-war Nazi Germany to help in his excavations. His research is supported by the Nazis, since he professes to be looking for evidence of the Aryan origins of German civilisation. However, he has a secret agenda: to free inmates of the concentration camps. Watch on RetroFlix:  https://retroflix.org/pimpernel-smith-1941/",
      "fileSize": 1071303819,
      "addedAt": "2026-01-07T00:10:12.700Z",
      "thumbnail": "https://archive.org/services/img/pimpernel-smith-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 91
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "120 min",
    "imdbRating": 7.2,
    "imdbVotes": 1893,
    "Genre": "Adventure, Drama, Thriller",
    "Plot": "Spring, 1939. The Nazis are frustrated that a number of men, German nationals and non-nationals alike that have refused to work for them, have managed to escape from the country with the aid of unknown rescuers or perhaps a sole rescuer. As such, the Nazis have begun to round up such men who have remained in Germany to house them in concentration camps as enemies of the Reich, all this information quashed by the Ministry of Propaganda. Meanwhile, Horatio Smith, a mild-mannered, pacifistic, often absent-minded and seemingly misogynistic Professor of Archaeology at Cambridge University, has recruited six of his male students to accompany him to Germany on his latest three-month post-term expedition into his research of whether an Aryan race did ever exist in Central Europe, work supported by the German government. What they and everyone else is unaware of is that Smith is that rescuer, this trip to Germany just a cover for his latest mission to free whoever needs to be freed from the Nazis. He realizes that his outward demeanor to the world makes him the perfect person for such work in no one ever suspecting him. He wants to retain his secret identity as the rescuer as the fewer people who know or need to know, the safer it is for all concerned. Coinciding with Smith's expedition, Nazi General von Graum, who is leading the investigation into the escapes, believes the rescuer is not only British, but will be attending a reception at the British Embassy in Berlin. As such, he enlists the assistance of a young woman by the name of Ludmilla Kohls to help identify the perpetrator at the reception, she who he is certain can and will assist and may be more perceptive about such matters to Smith's detriment than von Graum, he suspecting the typical strong, masculine type.",
    "Director": "Leslie Howard",
    "Writer": "Anatole de Grunwald, A.G. Macdonell, Wolfgang Wilhelm",
    "Actors": "Leslie Howard, Francis L. Sullivan, Allan Jeayes",
    "Language": "English, German, French",
    "Country": "United Kingdom",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0034538",
    "tt0034857",
    "tt0033031",
    "tt0034056",
    "tt0034188",
    "tt0034405",
    "tt0044827",
    "tt0033930",
    "tt2232578",
    "tt0164085",
    "tt0057115",
    "tt0034337"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.700Z"
}