{
  "imdbId": "tt0047209",
  "title": "Man in the Attic",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ManInTheAttic",
      "title": "Man in the Attic",
      "description": "With Jack the Ripper killing women in the Whitechapel district of London, people are on edge. Enter the mysterious Mr. Slade who arrives at the home of Helen and William Harley looking to rent rooms. Slade is a strange man. He is a respected pathologist and researcher at a major hospital but very much keeps to himself. He also happens to out of the house every time the Ripper strikes. Mrs. Harley becomes convinced that Slade is the Ripper but with tensions mounting across the city, the evidence is anything but clear.",
      "id": "ManInTheAttic"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ManInTheAtticwithSpanishSubtitles",
      "title": "Man In The Attic (with spanish subtitles)",
      "description": "The Life...The Loves...The Crimes of Jack the Ripper!. Audio: English, Subtitles: Spanish",
      "id": "ManInTheAtticwithSpanishSubtitles"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Man_in_the_Attic_movie",
      "title": "Man in the Attic",
      "description": "Jack Palance in a film involving Jack the Ripper.",
      "id": "Man_in_the_Attic_movie"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k1lim8DU2KI",
      "title": "Man in the Attic (1953) | Colorized Public Domain Thriller with Jack Palance and Constance Smith",
      "description": "Man in the Attic (1953) is an American suspense thriller directed by Hugo Fregonese, starring Jack Palance, Constance Smith, Byron Palmer, and Frances Bavier. Based on the famous 1913 novel The Lodger by Marie Belloc Lowndes, this film is one of the most atmospheric retellings of the Jack the Ripper legend ever produced in classic Hollywood. Colorized and restored by Colorized Public Domain, this edition brings renewed life to its eerie Victorian setting and psychological depth, making it captivating for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nSet in 1888 London during the terror of the Jack the Ripper murders, the story follows Mr. Slade (Jack Palance), a quiet, secretive pathologist who rents rooms in the home of William and Helen Harley. While he claims to be conducting medical experiments in the attic, his odd nocturnal habits, mysterious comings and goings, and detached demeanor soon draw suspicion. When a series of brutal murders spreads fear across the city, Mrs. Harley (Frances Bavier) becomes convinced their tenant is the killer. The tension deepens as Slade forms a strange bond with the Harleys’ niece, Lily Bonner (Constance Smith), a music hall performer whose beauty and independence fascinate him. Inspector Paul Warwick (Byron Palmer) begins his investigation, closing in as the psychological and moral threads of the story unravel. The climax reveals a haunting blend of tragedy, fear, and misunderstood obsession, offering one of Jack Palance’s most memorable early performances.\n\nCast and Crew:\n• Director: Hugo Fregonese\n• Producer: Robert L. Jacks\n• Screenplay: Barré Lyndon, Robert Presnell Jr.\n• Based on: The Lodger by Marie Belloc Lowndes\n• Cinematography: Leo Tover\n• Editing: Marjorie Fowler\n• Art Direction: Leland Fuller, Lyle Wheeler\nStarring:\n• Jack Palance as Mr. Slade\n• Constance Smith as Lily Bonner\n• Byron Palmer as Inspector Paul Warwick\n• Frances Bavier as Helen Harley\n• Rhys Williams as William Harley\n• Sean McClory as Constable Joe Ricks\n• Tita Phillips as Daisy\n\nFilm Significance:\nMan in the Attic stands out for its chilling atmosphere and slow-burning tension. Released by 20th Century Fox, it was one of several postwar psychological thrillers that blurred the line between horror and mystery. Jack Palance’s portrayal of Slade offers an unsettling intensity, combining intelligence and menace with moments of empathy that keep audiences guessing until the final frame. The film also features Frances Bavier, later famous as Aunt Bee in The Andy Griffith Show, in a rare serious role. Shot in black and white, its visual style enhances the fog-shrouded streets and shadowed interiors of Victorian London, making it an excellent candidate for colorization.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Man in the Attic remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1953 release captured the eerie essence of Victorian mystery with remarkable performances and haunting visuals. The colorized edition deepens this immersion by enhancing details such as the gaslit streets, shadowed attics, and subtle expressions that define Palance’s complex portrayal. For audiences watching primarily on television, the color restoration improves contrast and atmosphere, increasing visual clarity and emotional impact. This makes it ideal for both classic film enthusiasts and new viewers discovering vintage suspense for the first time.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\nHashtags:\n#ManInTheAttic #JackPalance #1953Thriller #PublicDomainMovie #ColorizedClassic #JackTheRipper #ClassicCinema #GoldenAgeHollywood #FilmRestoration #VintageMystery",
      "id": "k1lim8DU2KI",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RqqyT9NJUSI",
      "title": "Man in the Attic (1953) JACK PALANCE",
      "description": "Stars: Jack Palance, Constance Smith, Byron Palmer\nDirector: Hugo Fregonese\n\nIn foggy London circa 1888, Jack the Ripper is loose leaving a trail of grisly, bloody murders! A beautiful showgirl is drawn to a reserved pathologist conducting late-night experiments in his attic. Could this mysterious man be the notorious, knife-wielding killer?",
      "id": "RqqyT9NJUSI",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "82 min",
    "imdbRating": "6.1",
    "imdbVotes": "2,000",
    "Genre": "Mystery, Thriller",
    "Plot": "London, 1888: on the night of the third Jack the Ripper killing, soft-spoken Mr. Slade, a research pathologist, takes lodgings with the Harleys, including a gloomy attic room for \"experiments.\" Mrs. Harley finds Slade odd and increasingly suspects the worst; her niece Lily (star of a decidedly Parisian stage revue) finds him interesting and increasingly attractive. Is Lily in danger, or are her aunt's suspicions merely a red herring?",
    "Director": "Hugo Fregonese",
    "Writer": "Robert Presnell Jr., Barré Lyndon, Marie Belloc Lowndes",
    "Actors": "Jack Palance, Constance Smith, Byron Palmer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0045931",
      "title": "Jennifer",
      "year": 1953,
      "imdbRating": "5.8",
      "imdbVotes": "482",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0271483",
      "title": "Eight Witnesses",
      "year": 1954,
      "imdbRating": "5.9",
      "imdbVotes": "85",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048301",
      "title": "A Life in the Balance",
      "year": 1955,
      "imdbRating": "6.1",
      "imdbVotes": "256",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045563",
      "title": "Blowing Wild",
      "year": 1953,
      "imdbRating": "6.4",
      "imdbVotes": "1,291",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048919",
      "title": "23 Paces to Baker Street",
      "year": 1956,
      "imdbRating": "6.9",
      "imdbVotes": "3,020",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042935",
      "title": "The Secret Fury",
      "year": 1950,
      "imdbRating": "6.6",
      "imdbVotes": "1,246",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045205",
      "title": "Sudden Fear",
      "year": 1952,
      "imdbRating": "7.5",
      "imdbVotes": "7,830",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046790",
      "title": "Black Tuesday",
      "year": 1954,
      "imdbRating": "6.7",
      "imdbVotes": "1,024",
      "language": "English, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041628",
      "title": "The Man on the Eiffel Tower",
      "year": 1949,
      "imdbRating": "5.8",
      "imdbVotes": "1,066",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt9214844",
      "title": "12 Suicidal Teens",
      "year": 2019,
      "imdbRating": "5.8",
      "imdbVotes": "1,181",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037179",
      "title": "A Place of One's Own",
      "year": 1945,
      "imdbRating": "6.2",
      "imdbVotes": "904",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024625",
      "title": "A Study in Scarlet",
      "year": 1933,
      "imdbRating": "5.6",
      "imdbVotes": "1,237",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:38.751Z"
}