{
  "movieId": "tt0009234",
  "title": "It's a Wild Life",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/its-a-wild-life-1918-directed-by-gilbert-pratt",
      "id": "its-a-wild-life-1918-directed-by-gilbert-pratt",
      "title": "It’s A Wild Life (1918) Directed By Gilbert Pratt",
      "description": "It's a Wild Life Directed by Gilbert Pratt Produced by Hal Roach Starring Harold Lloyd Release date April 21, 1918 Country United States Languages Silent English intertitles It's a Wild Life is a 1918 American short comedy film featuring Harold Lloyd . Plot Harold attempts to court Bebe but he is turned away from Bebe's home by her mother who tells Harold that her daughter will only date a banker or a councilman. Bebe's father arranges for Snub to date his daughter as he fits the criteria for an acceptable suitor. Harold follows Bebe, Snub and Bebe's parents to a dance hall where Bebe is pleased to see him. Harold distracts the others long enough to have an energetic dance with Bebe. Harold then gets into a extended fight with both Snub and Bebe's father. Eventually all the dance hall patrons become involved in the fighting. The police are summoned. The dance hall manager eventually turns out the lights on the brawlers as the fight shows no signs of subsiding. Cast Harold Lloyd Snub Pollard Bebe Daniels William Blaisdell Sammy Brooks Lige Conley Helen Gilmore Lew Harvey Bud Jamison Fred C. Newmeyer James Parrott Charles Stevenson",
      "fileSize": 94600521,
      "addedAt": "2026-01-07T00:08:54.188Z",
      "thumbnail": "https://archive.org/services/img/its-a-wild-life-1918-directed-by-gilbert-pratt",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 60
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbRating": 5.6,
    "imdbVotes": 34,
    "Genre": "Short, Comedy",
    "Plot": "Harold invades the \"Gilded Guzzle\" café, where he appropriates a lady's roll of money, hides under a table and impersonates a cigar store Indian.",
    "Director": "Gilbert Pratt",
    "Writer": "N/A",
    "Actors": "Harold Lloyd, 'Snub' Pollard, Bebe Daniels",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008844",
    "tt0009689",
    "tt0009434",
    "tt0010181",
    "tt0009099",
    "tt0009071",
    "tt0009082",
    "tt0009171",
    "tt0009316",
    "tt0009678",
    "tt0009806",
    "tt0009631"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.188Z"
}