{
  "imdbId": "tt0052782",
  "title": "Hercules Unchained",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HerculesUnchained",
      "title": "Hercules Unchained",
      "description": "Hercules returns to Thebes to find the land on the brink of civil war. While trying to deliver a treaty to prevent the war, Hercules drinks from the fountain of forgetfulness and is seduced by the evil Omphale. An AVI of this movie is available here on the archive . You can find out more about this movie on its IMDB page .",
      "id": "HerculesUnchained"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HerculesUnchained_361",
      "title": "Hercules Unchained",
      "description": "While negotiating peace between two brothers contesting the throne of Thebes, an amnesiac Hercules is seduced by the evil Queen Omphale.",
      "id": "HerculesUnchained_361"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Hercules_Unchained",
      "title": "Hercules Unchained",
      "description": "\"Hercules Unchained\", [Format is XviD avi (Website needs to add XviD to format types, is way better than DivX!!!)] second and last film with Steve Reeves as Hercules (our favorite hunky Hercules actor). A Joseph E. Levine film, (an Italian-French co-production). Also starring Sylvia Lopez, Gabriele Antonini, Sylva Koscina, Sergio Fantoni. If you are a \"Spaghetti Sandal\" action and adventure fan, you are sure to like this film. It picks up after the first Steve Reeves \"Hercules\" movie... Hercules is now married to his beloved princess wife, and friend Ulysses tags along. They are traveling and encounter two warring brothers, fighting over rights to the thrown. Hercules gets pulled into things, but not before they try killing him, then getting rid of him with an amnesia giving drug. We enjoyed this film. Color is in Eastman Color by Pathe. Sound quality is very good. Visual quality is mostly good, with some choppiness, especially in fast action sequences; as the original film print gotten was only 23 frames per second, and when changed from mpeg to XviD avi, frame rate was changed to 29.976 frames per second. Still is a good film, and in my opinion is well worth watching! **************************************************** COOLBRITS IS WRONG BELOW!!! THIS FOOLISH PERSON GAVE FILM A LOW RATING AND SAID IT WAS INCOMPLETE. IT IS COMPLETE. IT JUST HAS AN UNUSUAL FILM START WITH OPENING ACTION, THEN THE FILM CREDITS START AFTER SEVERAL MINUTES. PEOPLE SHOULD NOT POST INACCURACIES, AND THIS FILM DESERVES A 4 OR 5 FILM RATING, NOT A ONE! BLUTO TO YOU COOLBRITS! **************************************************** NOTE: Film is really 305 MB AND NOT 320 MB. (Website reads it differently... maybe they use kb at 1000 bytes instead of KB at 1024 bytes? - In which case would be a size difference. Don't ask me, I didn't design this sight... or do it's script coding...) Anyways... >>>>> When downloaded, < < < < < Total size of film is: >>>>> 305 MB (320,455,656 bytes) < < < < < Film Runtime: 1 hr 36 min 9 seconds. (1:36:09) (Anything less means you have an incomplete download.)",
      "id": "Hercules_Unchained"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MROwUO1Ob6k",
      "title": "Hercules Unchained (1959) [Action] [Adventure] [Fantasy]",
      "description": "\"Hercules Unchained\" (Italian: \"Ercole e la regina di Lidia\", translated; \"Hercules and the Queen of Lydia\") is an Italian-French epic fantasy feature film starring Steve Reeves and Sylva Koscina in a story about two warring brothers and Hercules' tribulations in the court of Queen Omphale. The film's screenplay is loosely based upon various Greek myths.\n\nWhile travelling, Hercules is asked to intervene in a quarrel between two brothers, Eteocles and Polynices, over who should rule Thebes. Before he can complete this task, Hercules drinks from a magic spring and is hypnotized by a harem girl who dances the \"Dance of Shiva\", loses his memory and becomes the captive of Queen Omphale of Lydia. The Queen keeps men until she tires of them, then has them made into statues. While young Ulysses tries to help him regain his memory, Hercules' wife, Iole, finds herself in danger from Eteocles, current ruler of Thebes, who plans on throwing her to the wild beasts in his entertainment arena. Hercules slays three tigers in succession and rescues his wife, then assists the Theban army in repelling mercenary attackers hired by Polynices. The two brothers ultimately fight one another for the throne and end up killing each other; the good high priest Creon is elected by acclaim.\n\n---\n\nDirected by Pietro Francisci, produced by Bruno Vailati and Ferruccio De Martino, written by Ennio De Concini and Pietro Francisci, starring Steve Reeves as Hercules, Sylvia Lopez as Queen Omphale of Lydia, Sylva Koscina as Iole, Sergio Fantoni as Eteocles, Mimmo Palmara as Polynices, Gabriel Antonini as Ulysses, Fulvio Carrara and Willi, Colombini as Castor and Pollux, Gian Paolo Rosmino as Aesculapius, Gino Mattera as Orpheus, Primo Carnera as Antaeus, Cesare Fantoni as King Oedipus, Carlo D'Angelo as High Priest Creon and Colleen Bennett as the prima ballerina.\n\n---\n\nSource: \"Hercules Unchained\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 8 June 2013. Web. 22 July 2013. http://en.wikipedia.org/wiki/Hercules_Unchained.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "id": "MROwUO1Ob6k",
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5RDcY-6ktyo",
      "title": "Hercules Unchained (1959) Starring Steve Reeves | Directed by Pietro Francisci & Mario Bava",
      "description": "Spectacles of the world's mightiest man Beyond Any Ever Known Before!\nEn route to Thebes for an important diplomatic mission, Hercules drinks from a magic spring and loses his memory. He spends most of the movie in the pleasure gardens of Queen Omphale of Lydia. While young Ulysses tries to help him regain his memory, political tensions escalate in Thebes, and Hercules’ new wife Iole finds herself in mortal danger.\n\nOriginal title: Ercole e la regina di Lidia (1959)\nAlternative titles: Hercule et la Reine de Lydie, Herkules und die Königin der Amazonen, Hércules y la reina de Lidia, Kahraman ve Melike, Подвиги Геракла: Геракл и царица Лидии, ヘラクレスの逆襲, 大力神, 大力士和吕底亚女王, Hércules e a Rainha da Lídia, Herkules i królowa Lidia\n\nDirectors: Pietro Francisci, Mario Bava\nWriters: Pietro Francisci, Sophocles, Aeschylus\nStars: Steve Reeves, Sylva Koscina, Gabriele Antonini\nGenres: Action, Adventure, Fantasy\nBox Office Gross:  $5,450,000\n\nNext: Hercules and the Captive Women (1961) https://youtu.be/lWdvpv-BF90\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdbG3qWIWu2HZkdI6nJCWaqj\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "5RDcY-6ktyo",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "105 min",
    "imdbRating": "4.6",
    "imdbVotes": "2,382",
    "Genre": "Adventure, Fantasy",
    "Plot": "En route to Thebes for an important diplomatic mission, Hercules drinks from a magic spring and loses his memory. He spends most of the movie in the pleasure gardens of Queen Omphale of Lydia. While young Ulysses tries to help him regain his memory, political tensions escalate in Thebes, and Hercules' new wife Iole finds herself in mortal danger.",
    "Director": "Pietro Francisci, Mario Bava",
    "Writer": "Pietro Francisci, Sophocles, Aeschylus",
    "Actors": "Steve Reeves, Sylva Koscina, Gabriele Antonini",
    "Language": "Italian, Spanish",
    "Country": "Italy, France, Spain",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0052948",
      "title": "Journey to the Center of the Earth",
      "year": 1959,
      "imdbRating": "7.0",
      "imdbVotes": "20,760",
      "language": "English, Swedish, French, Italian, Russian, Icelandic",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054237",
      "title": "Colossus and the Amazon Queen",
      "year": 1960,
      "imdbRating": "3.7",
      "imdbVotes": "537",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053861",
      "title": "The Giants of Thessaly",
      "year": 1960,
      "imdbRating": "5.1",
      "imdbVotes": "395",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051638",
      "title": "From the Earth to the Moon",
      "year": 1958,
      "imdbRating": "5.1",
      "imdbVotes": "1,875",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051434",
      "title": "The Bride and the Beast",
      "year": 1958,
      "imdbRating": "3.4",
      "imdbVotes": "712",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0050084",
      "title": "20 Million Miles to Earth",
      "year": 1957,
      "imdbRating": "6.3",
      "imdbVotes": "8,727",
      "language": "English, Italian, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0055117",
      "title": "Mole Men Against the Son of Hercules",
      "year": 1961,
      "imdbRating": "4.8",
      "imdbVotes": "382",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054924",
      "title": "The Giant of Metropolis",
      "year": 1961,
      "imdbRating": "4.7",
      "imdbVotes": "467",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054851",
      "title": "Hercules and the Captive Women",
      "year": 1961,
      "imdbRating": "4.4",
      "imdbVotes": "1,652",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054850",
      "title": "Hercules in the Haunted World",
      "year": 1961,
      "imdbRating": "6.2",
      "imdbVotes": "2,478",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050622",
      "title": "The Land Unknown",
      "year": 1957,
      "imdbRating": "5.7",
      "imdbVotes": "2,092",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052604",
      "title": "The Giant of Marathon",
      "year": 1959,
      "imdbRating": "5.1",
      "imdbVotes": "1,112",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:25.401Z"
}