{
  "imdbId": "tt0046348",
  "title": "South Sea Woman",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/south-sea-woman-1953",
      "id": "south-sea-woman-1953",
      "title": "South Sea Woman (1953) Burt Lancaster · Virginia Mayo",
      "description": "War and love adventures of two US Navy sergeants who win victories with their left hand in the South Seas theater of war. ..",
      "fileSize": 1023379615,
      "addedAt": "2026-01-07T00:11:35.626Z",
      "thumbnail": "https://archive.org/services/img/south-sea-woman-1953",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 297
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "99 min",
    "imdbRating": 6.2,
    "imdbVotes": 856,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "Marine Sergeant James O'Hearn is being tried at the San Diego Marine base for desertion, theft, scandalous conduct and destruction of property in time of war. He refuses to testify or plead guilty or not guilty to the charges. Showgirl Ginger Martin takes the stand against his protest. She testifies O'Hearn won't talk because he is protecting the name of his pal, Marine Private Davey White. Ginger tells how she, broke and stranded, met the two marines in Shanghai two weeks before Pearl Harbor. White proposes marriage so that Ginger can be evacuated from China as his wife. Before the ceremony, the two Marines get into a fight with the natives and escape with Ginger aboard a small motor boat. They wind up in Namou, a Vichy French island, and are quartered in a run-down hotel. O'Hearn discovers a Nazi yacht delivering radar supplies to the island, and plans to seize it with the help of the Free French. White refuses to join and says he is deserting and intends to remain on the island with Ginger, who calls him a coward. O'Hearn forces White on board the commandeered vessel bound for Guadalcanal.",
    "Director": "Arthur Lubin",
    "Writer": "Edwin Blum, Earl Baldwin, Stanley Shapiro",
    "Actors": "Burt Lancaster, Virginia Mayo, Chuck Connors",
    "Language": "English, French, Japanese, Mandarin",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0044517",
    "tt0046414",
    "tt0046210",
    "tt0045125",
    "tt0047795",
    "tt0030449",
    "tt0026487",
    "tt0041971",
    "tt0046719",
    "tt0046995",
    "tt0041098",
    "tt0043562"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.626Z"
}