{
  "imdbId": "tt0040980",
  "title": "Women of the Night",
  "year": 1948,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ygKFpqTQIZU",
      "title": "Women In The Night (1948) [Action] [Drama] [Thriller]",
      "description": "Women in the Night is a 1948 American film directed by William Rowland shot in Mexico. The film is also known as \"When Men Are Beasts\". The film depicts activities of German and Japanese who wish revenge on the Allies with a cosmic ray weapon. As World War II nears its end, beautiful women forced to serve as sex slaves in a German officer's club, do what they can to destroy the plans of a cosmic death ray.\n\n---\n\nDirected by William Rowland, produced by Louis K. Ansell and Joseph C. Ansell, written by Gyles Adams, Louis K. Ansell (additional dialogue), Maude Emily Glass (adaptation), Ali Ipar (screenplay), Arthur V. Jones (additional dialogue), William Rowland (story), Robert St. Claire (screenplay) and Edwin V. Westrate (screenplay), starring Tala Birell as Yvette Aubert, William Henry as Philip Adams / Maj. von Arnheim, Richard Loo as Col. Noyama, Virginia Christine as Claire Adams, Bernadene Hayes as Frau Thaler, Gordon Richards as Col. von Meyer, Frances Chung as Li Ling, Jean Brooks as Maya, Kathy Frye as Helen James, Helen Mowery as Sheila Hallett, Benson Fong as Chang, Helen Brown as Angela James, Frederick Giermann as Major Eisel, Philip Ahn as Prof. Kunioshi, Arno Frey as Field Marshal von Runzel, Beal Wong as General Mitikoya, Iris Flores as Maria Gonzales, Frederic Brunn as Lt. Kraus, Harry Hays Morgan as General Hundman, Paula Allen as Nurse, Joy Gwynell as Suicide Girl, William Yetter Sr. as German Officer, Noel Cravat as Japanese Officer and Wolfgang Zilzer as German Doctor.\n\n---\n\nSource: \"Women in the Night\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 4 October 2016. Web. 01 December 2016. https://en.wikipedia.org/wiki/Women_in_the_Night .\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "ygKFpqTQIZU",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/witn4477852",
      "title": "Women in the Night",
      "description": "Title: Women in the Night Summary: As World War II nears its end, beautiful women forced to serve as sex slaves in a German officer's club, do what they can to destroy the plans of a cosmic death ray. Directed by: William Rowland Actors: Tala Birell, William Henry, Richard Loo Production Company: Louis K. Ansell Productions Release Date: 2 January 1948 (USA) The war in Europe is over, the Japanese are about to surrender after the Nagasaki bombing, but a group of die-hard German Nazis are holding on in Shanghai, protecting an ingenious invention of mass destruction - a cosmic ray generator that is 1000 times more deadly than the A-bomb. Col. Von Meyer is about to pass the secret of the weapon to Col. Noyoma, as Japan is still at war, and will use it to revenge their recent losses. However, Field Marshal Von Runzel arrives with precise orders to the contrary: the Japanese shall not have the secret weapon, for an underground Nazi ring is to use it later in another attempt to destroy all the Allied Nations, and conquer the world in a third Worl War. Von Meyer decides to create a diversion, and to offer the Japanese scientist and officers some \"evening entertainment\" at the German Officers' Club. Thaler, the female German Officer, is to bring in a number of women - arrested on trumped up charges at the Shanghai University - dress them up, and ...",
      "id": "witn4477852"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/women-in-the-night-1948",
      "title": "Women in the Night (1948)",
      "description": "During WW2 six allied nations women at Shanghai University are arrested by the Germans accused of killing a German officer and forced to entertain the Japanese. Watch on RetroFlix:  https://retroflix.org/women-in-the-night-1948/",
      "id": "women-in-the-night-1948"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/women-of-the-night",
      "title": "Women Of The Night",
      "description": "After World War II, Mizoguchi was inspired by Italian neorealism to make one of the most emotionally and visually raw films of his career. Filmed on location in Osaka,  Women of the Night  concerns two sisters—Fusako, a war widow, and Natsuko, having an affair with a narcotics smuggler—who along with their younger friend Kumiko descend into prostitution and moral chaos amid the postwar devastation surrounding them.",
      "id": "women-of-the-night"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/women_in_the_night",
      "title": "Women In the Night",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "women_in_the_night"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/women_in_the_night_ipod",
      "title": "Women in the Night",
      "description": "A group of women (one from each of the bigger Allied countries) is held by Nazis in Shanghai, who have developed a super weapon more devastating than the atomic bomb. A flash video version of this film is also available from the URLs below. Web Page FLV file Right Click to Download",
      "id": "women_in_the_night_ipod"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yPPTck6zHGE",
      "title": "Women in the Night (1948) WWII THRILLER",
      "description": "Stars: Tala Birell, William Henry, Richard Loo\n Director: William Rowland\n\n Six women during WWII are arrested by the Germans at Shanghai University under the false accusation that they are accomplices of the killing of a German officer. Two Asian women will join the group, and eventually it is revealed that there are at least three underground spies among the small group. Some will survive, others will die heroic deaths for their religious beliefs, nationalist ideals, or the sake of humankind.",
      "id": "yPPTck6zHGE",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "75 min",
    "imdbRating": "7.2",
    "imdbVotes": "1,542",
    "Genre": "Drama",
    "Plot": "In the post-war Japan, Fusako Owada lives in the home of her mother-in-law with her baby that is ill while waits for the return of her husband from the war. When she learns that her husband has died and her baby also dies, she moves to another city with her neighbor Kumiko Owada to work as secretary executive for the opium dealer Kenzô Kuriyama. One day, she stumbles upon her missed sister Natsuko Kimijima that has returned from the Korea on the street and she learns that Natsuko works as a dancer in a night-club. Natsuko moves to Fusako and Kumiko's apartment and soon she has a love affair with Fusako's boss. However Fusako is secretly Kuriyama's mistress and upset, she vanishes. One day, a client of Natsuko in the night-club tells to her that he saw Fusako in the Red Light District. Natsuko that is pregnant decides to seek her sister out in the prostitution area. Will she find Fusako?",
    "Director": "Kenji Mizoguchi",
    "Writer": "Eijirô Hisaita, Yoshikata Yoda",
    "Actors": "Kinuyo Tanaka, Sanae Takasugi, Tomie Tsunoda",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0045112",
      "title": "The Life of Oharu",
      "year": 1952,
      "imdbRating": "8.1",
      "imdbVotes": "7,787",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046478",
      "title": "Ugetsu",
      "year": 1953,
      "imdbRating": "8.1",
      "imdbVotes": "27,766",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047445",
      "title": "Sansho the Bailiff",
      "year": 1954,
      "imdbRating": "8.4",
      "imdbVotes": "18,809",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033654",
      "title": "The 47 Ronin",
      "year": 1941,
      "imdbRating": "7.2",
      "imdbVotes": "2,739",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040505",
      "title": "A Hen in the Wind",
      "year": 1948,
      "imdbRating": "7.4",
      "imdbVotes": "1,864",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046851",
      "title": "A Story from Chikamatsu",
      "year": 1954,
      "imdbRating": "8.0",
      "imdbVotes": "5,044",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028021",
      "title": "Osaka Elegy",
      "year": 1936,
      "imdbRating": "7.2",
      "imdbVotes": "2,641",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015847",
      "title": "Furusato no uta",
      "year": 1926,
      "imdbRating": "5.9",
      "imdbVotes": "158",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027672",
      "title": "Sisters of the Gion",
      "year": 1936,
      "imdbRating": "7.4",
      "imdbVotes": "3,103",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048933",
      "title": "Street of Shame",
      "year": 1956,
      "imdbRating": "7.8",
      "imdbVotes": "5,150",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032156",
      "title": "The Story of the Last Chrysanthemum",
      "year": 1939,
      "imdbRating": "7.8",
      "imdbVotes": "4,538",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020510",
      "title": "Tôkyô kôshinkyoku",
      "year": 1929,
      "imdbRating": "6.6",
      "imdbVotes": "331",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T01:59:26.548Z"
}