{
  "imdbId": "tt0033113",
  "title": "Sued for Libel",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sued-for-libel-1939-l",
      "id": "sued-for-libel-1939-l",
      "title": "Sued For Libel (1939)",
      "description": "Kent Taylor",
      "fileSize": 918405015,
      "addedAt": "2026-01-07T00:11:35.633Z",
      "thumbnail": "https://archive.org/services/img/sued-for-libel-1939-l",
      "collection": "feature_films",
      "downloads": 417
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": 6.2,
    "imdbVotes": 183,
    "Genre": "Comedy, Crime, Film-Noir",
    "Plot": "The trial of Albert Pomeroy on the charge of murdering Edward Webster,arouses interest because Webster's widow, Muriel insists Pomeroy is innocent. Meanwhile, back to radio station NYEB, owned by the Evening Bulletin, Steve Lonegan waits for a flash from Smiley Dugan so he can broadcast the verdict---But Dugan leaves and asks reporter Maggie Dugan to tip him off it something happens...and something happens when the jury comes in unexpectedly,and this jury comes in with a \"Not Guilty\" verdict. But fun-loving Maggie, as a gag, phones Smiley and tells him Pomeroy was found guilty, and unreliable Smiley relays this false information to Lonegan who tells a waiting world that Pomeroy was found guilty, signs off the air, locks up the station and goes home...and leaves the station wide open for a million-dollar libel suit. Lonegan and Colonel White decide that the only out from paying Pomeroy a million bucks in a libel-suit is to dig up something on Pomeroy that will force him to drop the suit, and the Colonel dispatches Lonegan out to get this done. Lonegan discovers that a former Pomeroy secretary, Stella Trent , had committed suicide three years earlier, and that a Dr. Bailer was involved. Lonegan and Maggie go to Bailer's office, and discover Bailer has been murdered.Lawyer Justin Walsh drops by the Evening Bulletin and informs Steve and Colonel White that he has just learned that Pomeroy did indeed kill Webster, and he has withdrawn as Pomeroy's attorney. He cites Widow Webster as his source of this information,although, when least heard from, Widow Webster was proclaiming that Pomeroy was innocent.",
    "Director": "Leslie Goodwins",
    "Writer": "Wolfe Kaufman, Jerome Cady",
    "Actors": "Kent Taylor, Linda Hayes, Lilian Bond",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037100",
    "tt0027627",
    "tt0030968",
    "tt0037735",
    "tt0029207",
    "tt0030025",
    "tt0029810",
    "tt0027517",
    "tt0031245",
    "tt0037859",
    "tt0031490",
    "tt0031709"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.633Z"
}