{
  "imdbId": "tt0059252",
  "title": "Harlow",
  "year": 1965,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HARLOW1965",
      "id": "HARLOW1965",
      "title": "Harlow",
      "description": "Title: Harlow Summary: Loosely based biography of 1930s star Jean Harlow as she begins her climb to stardom. Directed by: Alex Segal Actors: Carol Lynley, Efrem Zimbalist Jr., Ginger Rogers Production Company: Theatrofilm Release Date: 14 May 1965 (USA) Aspect Ratio: 1.33 : 1 One of two \"Harlow\" film biographies that appeared in 1965, this one stars Carol Lynley in the title role that begins as Jean Harlow, a bit player in Laurel and Hardy comedies, is invited to test for director Jonathan Martin for the lead in Howard Hughes's \"Hell's Angels.\" She is an instantaneous sensation, and in a series of films devoted more to her body than her talent, she becomes Hollywood's \"Platanum Blonde.\"",
      "fileSize": 980878315,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/HARLOW1965",
      "year": 1965,
      "collection": "feature_films",
      "downloads": 3700
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "125 min",
    "imdbRating": 5.5,
    "imdbVotes": 1121,
    "Genre": "Biography, Drama, Romance",
    "Plot": "In this story, Jean Harlow (Carroll Baker) starts in the movies as set dressing, the pretty girl who is used for the glamor shots. Refusing to descend to the casting couch for work, she finds that she is soon blacklisted from the industry. But an agent named Arthur Landau (Red Buttons) sees something in Jean and begins representing her. For a long time, the jobs are scarce and consist mostly of receiving the pie in the face in low budget comedies. But Arthur's belief in Jean never wavers and when she finally graduates to featured roles, the critics say that she cannot act, but she is unforgettable. Polishing the image as the girl next door, but with some fire, she begins her climb to the top and becomes the girl every woman wants to look like and every man wants to have. But her own life is a disaster - unlike her screen life.",
    "Director": "Gordon Douglas",
    "Writer": "Irving Shulman, Arthur M. Landau, John Michael Hayes",
    "Actors": "Carroll Baker, Red Buttons, Raf Vallone",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0053399",
    "tt0037701",
    "tt0050204",
    "tt0071481",
    "tt0116621",
    "tt0118892",
    "tt0108101",
    "tt0007698",
    "tt4642192",
    "tt5716464",
    "tt0059788",
    "tt0059232"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}