{
  "movieId": "tt0041616",
  "title": "Madness of the Heart",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MADNESSOFTHEHEART1949",
      "id": "MADNESSOFTHEHEART1949",
      "title": "Madness of the Heart",
      "description": "Title: Madness of the Heart Summary: Lydia Garth meets Paul de Vandiere, a French nobleman, but their romance is plagued by Lydia's complaint of recurring spells of blurred vision. Paul leaves for France, promising to return ... Directed by: Charles Bennett Actors: Margaret Lockwood, Paul Dupuis, Kathleen Byron Production Company: Two Cities Films Release Date: 20 September 1950 (USA) Aspect Ratio: 1.37 : 1 Lydia Garth meets Paul de Vandiere, a French nobleman, but their romance is plagued by Lydia's complaint of recurring spells of blurred vision. Paul leaves for France, promising to return and marry Lydia, but she loses her sight while he is gone. Given no hope of recovery, she enters a convent and quickly finds that she has no vocation for life in a nunnery. She finally marries Paul, but encounters strong opposition from Verite Faimont, a neighbor who is very fond of Paul. The latter constantly plots against Lydia and is successful in temporarily breaking up the marriage, but can a miracle of restored vision be seen?",
      "fileSize": 648677725,
      "addedAt": "2026-01-07T00:06:38.751Z",
      "thumbnail": "https://archive.org/services/img/MADNESSOFTHEHEART1949",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 1505
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "91 min",
    "imdbRating": 6.1,
    "imdbVotes": 258,
    "Genre": "Drama, Mystery, Romance",
    "Plot": "Lydia Garth meets Paul de Vandiere, a French nobleman, but their romance is plagued by Lydia's complaint of recurring spells of blurred vision. Paul leaves for France, promising to return and marry Lydia, but she loses her sight while he is gone. Given no hope of recovery, she enters a convent, but the Abbess decides that she has no vocation for life in a nunnery. She finally marries Paul, but encounters strong opposition from Verite Faimont, a neighbour who is very fond of Paul. The latter constantly plots against Lydia and is successful in temporarily breaking up the marriage, but can a miracle of restored vision be seen?",
    "Director": "Charles Bennett",
    "Writer": "Flora Sandstrom, Charles Bennett",
    "Actors": "Margaret Lockwood, Maxwell Reed, Kathleen Byron",
    "Language": "French, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041182",
    "tt0043409",
    "tt0041886",
    "tt0044937",
    "tt0038492",
    "tt0029855",
    "tt0040071",
    "tt0041959",
    "tt0022989",
    "tt0032976",
    "tt0030727",
    "tt0041179"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.751Z"
}