{
  "movieId": "tt0018505",
  "title": "Bed and Sofa",
  "year": 1927,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iX-UCLF-pnY",
      "id": "iX-UCLF-pnY",
      "title": "Bed and Sofa | LOVE MOVIE",
      "description": "The years of the NEP. Print worker Vladimir comes to Moscow from the province and temporarily lodges in the room of his battlefield friend Nikolai on 3rd Meshchanskaya Street. Lyudmila, the host’s wife, is fond of her guest, who, unlike her husband, is very kind to her. She makes no secret of her affection for Vladimir - and now the three of them will live together...\nOne of the riskiest Soviet romance films about new life. The first title of the picture is Menage a Trois. In the West, it was released as Three in a Cellar, and as Bed and Sofa in Germany. The movie was a great success but caused a string of scandals. Screenwriter Viktor Shklovsky was criticized for being disrespectful towards poet Mayakovsky and the Briks family, whom he knew well and whose love story supposedly inspired the film. The film was called immoral, and in the late 1920s it was banned. \n\nYear of production: 1927\n\nDirected by: Abram Room\nWritten by: Viktor Shklovsky, Abram Room \nDirector of photography: Gregory Giber\nProduction designers: Vasily Rakhals, Sergei Yutkevich\nStarring: Nikolai Batalov, Lyudmila Semyonova, Vladimir Fogel\n\nSubscribe to our YouTube channel, and be sure to click the bell so that you won’t miss the best Soviet movies! \n\n\n#love_triangle #USSR #roaring twenties #FullMoviesWithEngSubs",
      "addedAt": "2025-12-23T03:46:00.068Z",
      "thumbnail": "https://i.ytimg.com/vi/iX-UCLF-pnY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBgSS9k23bE4myWETzf5SgU-LUN1w",
      "duration": 4109,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "86 min",
    "imdbRating": 7.3,
    "imdbVotes": 1343,
    "Genre": "Comedy, Drama",
    "Plot": "A married couple have a small apartment in Moscow. When an old friend of the husband's arrives in the city, he is unable to find lodgings. Kolia, the husband, invites his friend to move in with them. While Kolia is away on business, sensual Liuda and attractive Volodia fall in love and have an affair. After his initial outrage, the husband calms down. Kolia winds up on the sofa, and the three settle into a menage-a-trois until the wife finds herself pregnant. The two men are trying to decide what to do, but Liuda is strong enough to make her own decisions. Considered a landmark film because of humor, naturalism, and its sympathetic portrayal of the woman.",
    "Director": "Abram Room",
    "Writer": "Viktor Shklovskiy, Abram Room",
    "Actors": "Vladimir Fogel, Nikolay Batalov, Lyudmila Semyonova",
    "Language": "None, Russian",
    "Country": "Soviet Union",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0017765",
    "tt0019339",
    "tt0017750",
    "tt0017886",
    "tt0018297",
    "tt0018051",
    "tt0018530",
    "tt0019421",
    "tt0017457",
    "tt0018742",
    "tt0019057",
    "tt0019067"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:34:28.734Z"
}