{
  "imdbId": "tt0045258",
  "title": "Tree for Two",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tree-for-two-1952",
      "id": "tree-for-two-1952",
      "title": "Tree for Two (1952)",
      "description": "A rough and tough bulldog named Spike sets out with his admirer, a small dog named Chester, to rough up a cat. They encounter Sylvester and chase him into a junkyard, where a black panther that escaped from a zoo just happens to be hiding out. Every time Spike goes into the junkyard to thrash Sylvester, he is clawed into pieces by the panther, which he, in a dark maze of crates, thinks is Sylvester. Chester has no problem pummelling Sylvester before Spike's eyes, which convinces Spike that Chester must be tougher than him. Watch on RetroFlix:  https://retroflix.org/tree-for-two-1952/",
      "fileSize": 94865206,
      "addedAt": "2026-01-07T00:12:44.286Z",
      "thumbnail": "https://archive.org/services/img/tree-for-two-1952",
      "language": "eng",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 268
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 7.4,
    "imdbVotes": 325,
    "Genre": "Animation, Family, Short",
    "Plot": "A rough and tough bulldog named Spike sets out with his admirer, a small dog named Chester, to rough up a cat. They encounter Sylvester and chase him into a junkyard, where a black panther that escaped from a zoo just happens to be hiding out. Every time Spike goes into the junkyard to thrash Sylvester, he is clawed into pieces by the panther, which he, in a dark maze of crates, thinks is Sylvester. Chester has no problem pummelling Sylvester before Spike's eyes, which convinces Spike that Chester must be tougher than him.",
    "Director": "Friz Freleng",
    "Writer": "Warren Foster",
    "Actors": "Mel Blanc, Stan Freberg",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032298",
    "tt0028724",
    "tt0034756",
    "tt0036874",
    "tt0030300",
    "tt0033962",
    "tt0032931",
    "tt0035203",
    "tt0035314",
    "tt0036546",
    "tt0148603",
    "tt0043082"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.286Z"
}