{
  "imdbId": "tt0034252",
  "title": "Swamp Woman",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Swamp_Woman_1941",
      "id": "Swamp_Woman_1941",
      "title": "Swamp Woman",
      "description": "Another swamp movie.",
      "fileSize": 1163899342,
      "addedAt": "2026-01-07T00:06:58.270Z",
      "thumbnail": "https://archive.org/services/img/Swamp_Woman_1941",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 5619
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2MiLSBeieS4",
      "id": "2MiLSBeieS4",
      "title": "Swamp Woman (1941) ADVENTURE-DRAMA",
      "description": "Stars: Ann Corio, Jack La Rue, Mary Hull \n Director: Elmer Clifton\n\nInto the vast swamplands and only a few steps ahead of the bloodhounds, an escaped convict is aided by a honky-tonk dancer.",
      "addedAt": "2025-12-26T23:53:52.281Z",
      "thumbnail": "https://i.ytimg.com/vi/2MiLSBeieS4/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCVKUIkoAvYdYoKSE-hVNW-MvrX7A",
      "duration": 3595,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "68 min",
    "imdbRating": 4.4,
    "imdbVotes": 93,
    "Genre": "Drama",
    "Plot": "Into the vast swamplands hurry three people; honky tonk dancer Annabelle Tollington (Ann Corio), cheap promoter \"Flash\" Bland (Jay Novello) trying to catch Annabelle, and escaping convict Jeff Carter (Richard Deane), only a few steps ahead of the bloodhounds of Police Lieutenant Rance (Ian MacDonald). Jeff reaches the cabin of Lizbet Tollington (Mary Hull), Annabelle's niece, and fiancée of trapper Pete Oliver (Jack La Rue), Annabelle's ex-sweetheart. Lizbet, seeing Jeff in the mirror as she tries on her wedding gown, believes him to be the man she will eventually marry, as stipulated in an old proverb of the swamps. She hides Jeff from the law. Annabelle, determined to break Lizbet's engagement to Pete, tells him that Lizbet is hiding a man in her cabin. The enraged Pete cools off when he realizes that Lizbet loves Jeff and determines to help him. Rance arrives and recognizes Annabelle as \"The Swamp Woman\" of the honky tonk, whose testimony saved \"Flash\" from a prison sentence on the murder charge that sent the innocent Jeff to the chain gang. Rance locates Lizbet's cabin and arrests Jeff. \"Flash\" comes out of hiding to talk to Annabelle. Having experienced a gradual regeneration through the efforts of Pete, Annabelle makes \"Flash\" admit to her that he was the actual killer. Jeff is cleared of the crime and remains to marry Lizbet, while Pete and Annabelle resume their old romance. Corio keeps all of her clothes on most of the time, and most of her clothes on all the time. Sorry.",
    "Director": "Elmer Clifton",
    "Writer": "Fred McConnell, George Arthur Durlam",
    "Actors": "Ann Corio, Jack La Rue, Mary Hull",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033688",
    "tt0033747",
    "tt0033469",
    "tt0032642",
    "tt0031190",
    "tt0028589",
    "tt0037304",
    "tt0037460",
    "tt0029578",
    "tt0033998",
    "tt0027654",
    "tt0041532"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.270Z"
}