{
  "imdbId": "tt0010072",
  "title": "Don't Shove",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dont-shove-1919-directed-by-alfred-j.-goulding",
      "id": "dont-shove-1919-directed-by-alfred-j.-goulding",
      "title": "Don't Shove (1919) Directed By Alfred J. Goulding",
      "description": "Don't Shove Directed by Alfred J. Goulding Written by H.M. Walker Produced by Hal Roach Starring Harold Lloyd Cinematography Walter Lundin Production company Rolin Films Distributed by Pathé Exchange Release date August 31, 1919 Running time 11 minutes Country United States Language Silent (English intertitles ) Don't Shove is a 1919 American short comedy film featuring Harold Lloyd . [ 1 ] Prints of the film exist at the Library of Congress , the UCLA Film and Television Archive , the Museum of Modern Art , and the Cinémathèque québécoise . [ 2 ] Cast Harold Lloyd as Harold Bebe Daniels as Bebe Bud Jamison as Harold's rival Noah Young as Tough guy Eddie Boland Sammy Brooks as Party Guest Lige Conley (as Lige Cromley) Wallace Howe (as W. Howe) Dee Lampton as Fat Rival Marie Mosquini Fred C. Newmeyer (as Fred Newmeyer) James Parrott Snub Pollard Gus Leonard as Old man (uncredited) Plot Harold arrives as Bebe's birthday party bearing a large gift. His rival, however, changes the box's contents so that when Bebe opens the box it contains a pipe and a whisky flask. Upset, she orders Harold to leave the party. Upon leaving the premises, Harold gets into a prolonged scuffle with another party guest who wants to make sure Harold does leave. A teenage boy eventually knocks out Harold's pursuer. Harold asks the boy to teach him boxing basics. In doing so, Harold accidentally strikes a policeman. Harold flees from the officer and ends up in a roller rink. By coincidence, the attendees at Bebe's birthday party visit the same roller rink. Harold ends up back in Bebe's good graces after he wins a \"hurdle race\" on roller skates that features numerous obstacles, jumps and ramps. References 1 Progressive Silent Film List: Don't Shove at silentera.com 2 SilentEra entry",
      "fileSize": 97163306,
      "addedAt": "2026-01-07T00:08:15.374Z",
      "thumbnail": "https://archive.org/services/img/dont-shove-1919-directed-by-alfred-j.-goulding",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 72
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.6,
    "imdbVotes": 220,
    "Genre": "Comedy, Short",
    "Plot": "A popular young woman is celebrating her birthday by having a large party. An eager young man arrives with a large box for her, but jealous rivals switch the gift inside, and get the young man thrown out. Soon afterwards, he is in a roller skating rink when he again encounters the party guests, who have come to do some skating after the party.",
    "Director": "Alfred J. Goulding",
    "Writer": "H.M. Walker",
    "Actors": "Harold Lloyd, Bebe Daniels, Bud Jamison",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010023",
    "tt0010516",
    "tt0010632",
    "tt0010435",
    "tt0009099",
    "tt0009071",
    "tt0009082",
    "tt0009171",
    "tt0009316",
    "tt0009678",
    "tt0009631",
    "tt0009732"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.374Z"
}