{
  "movieId": "tt0071532",
  "title": "The Gambler",
  "year": 1974,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-gambler.-1974",
      "id": "the.-gambler.-1974",
      "title": "The Gambler (1974)",
      "description": "\"The Gambler,\" directed by Karel Reisz and starring James Caan, follows the life of Axel Freed, a literature professor with a dangerous addiction to gambling. Freed is intelligent and charismatic but struggles with his compulsive behavior, leading him into a downward spiral. Axel lives a double life as both an educator and a gambler. Despite his academic success, he is trapped by his addiction, which causes tension in his personal and professional relationships.As the story unfolds, Axel's gambling leads to substantial financial problems. He borrows money from a gangster named Hips (played by Paul Sorvino), which entangles him further in the world of crime and debt. The film also explores Axel's interactions with various figures in his life, including his family, a love interest named Billie (played by Lauren Hutton), and his students, all of whom are affected by his reckless behavior.Axel faces critical decisions regarding his addiction. His journey delves into themes of self-destruction, the allure of gambling, and the impact of personal choices. The film culminates in a tense finale, emphasizing the high stakes of Axel's gambling addiction and the resulting consequences on his life and relationships.",
      "fileSize": 2979377022,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-gambler.-1974",
      "language": "eng",
      "year": 1974,
      "collection": "feature_films",
      "downloads": 272
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "111 min",
    "imdbRating": 7.1,
    "imdbVotes": 6785,
    "Genre": "Crime, Drama",
    "Plot": "Axel Freed, a college professor and very successful at his job, is addicted to gambling, who wins big, but loses it all just as fast. He borrowed from his girlfriend, his wealthy mother, and last but not least a loan shark. It just gets worse for him because he can't stop. But when his girlfriend decides to leave him, his mom decides to disown him, and the mob wants to kill him, Axel decides to make a big score to win big and pay off everyone to stay alive and keep his dignity and come out ahead.",
    "Director": "Karel Reisz",
    "Writer": "James Toback",
    "Actors": "James Caan, Paul Sorvino, Lauren Hutton",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0076060",
    "tt0071840",
    "tt0071402",
    "tt0071877",
    "tt0073755",
    "tt0070930",
    "tt0071721",
    "tt0070578",
    "tt0158714",
    "tt0143428",
    "tt0073396",
    "tt0073092"
  ],
  "collections": [
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}