{
  "movieId": "tt0035125",
  "title": "Night Plane from Chungking",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night-plane-from-chungking-1943",
      "id": "night-plane-from-chungking-1943",
      "title": "Night Plane From Chungking (1943) ,",
      "description": "Robert Preston",
      "fileSize": 1269602533,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/night-plane-from-chungking-1943",
      "collection": "feature_films",
      "downloads": 518
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "69 min",
    "imdbRating": 6.4,
    "imdbVotes": 69,
    "Genre": "Drama",
    "Plot": "Without lights and in a driving rain, a bus is lumbering along the muddy Assam Road en route from Chunking to the Indian border. Passengers include Albert Pasavy (Otto Kruger), a European of unknown nationality; a missionary, the Rev. Dr. Van Der Liden (Steven Geray);a French officer Major Raoul Brissac (Ernst Deutsch as Ernest Dorian), and Countess Olga Karagin (Tamara Geva), a White Russian. There is also Madame Woo (Soo Yong), an ancient Chinese lady on an important diplomatic mission to India, and her traveling companion, Ann Richards (Ellen Drew), an American Red Cross nurse. The trip is halted when Japanese planes bomb the road and hit a munitions truck and kill many Chinese soldiers. The Chinese commander puts the wounded soldiers on the bus and directs it to a nearby secret airport where the officer in charge is Captain Nick Stanton (Robert Preston), an American attached to the Chinese Air Force. Stanton is ordered to fly the bus passengers to India and, before the take-off, he discovers that the Countess is a spy and he has her sent back to Chungking. Flying high over the mountainous, Japanese-infested country, the plane is attacked by Zero fighter planes and makes a crash landing in the jungle. Just before the radio goes dead, Stanton is informed by Chungking of Olga's suicide after confessing that her superior is aboard the India-bound plane. Stanton still has to get Madame Wu to India and Van Der Linden suggests that the Buddist monks in a near-by monastery will be happy to help. Or, perhaps, maybe they won't.",
    "Director": "Ralph Murphy",
    "Writer": "Earl Fenton, Theodore Reeves, Lester Cole",
    "Actors": "Robert Preston, Ellen Drew, Otto Kruger",
    "Language": "English, Chinese",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035755",
    "tt0043848",
    "tt0040586",
    "tt0036743",
    "tt0035432",
    "tt0165938",
    "tt0037361",
    "tt0037388",
    "tt0031232",
    "tt0037678",
    "tt0037505",
    "tt0037820"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.898Z"
}