{
  "imdbId": "tt0001545",
  "title": "Cinderella",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Cinderella1911",
      "title": "\"Cinderella\" (1911) starring Florence La Badie",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Cinderella\" (1911) is a short fantasy film, based on the fairy tale by Charles Perrault. It is included in our program to illustrate the work and contributions of Florence La Badie, a star of Silent Hall of Fame. Let's all give our thanks to Ned Thanhouser for the outstanding work he has done for the past 25+ years in archives around the globe to acquire and publish on DVD and online Thanhouser films starring Florence La Badie.  Directed by                    George Nichols Produced by                  Thanhouser Company Written by                     Charles Perrault Starring                         Florence La Badie Release date                   December 22, 1911 Running time                 15 minutes Country                          United States Language                        Silent film Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 276769468,
      "id": "Cinderella1911"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "14 min",
    "imdbRating": 6.1,
    "imdbVotes": 149,
    "Genre": "Short, Fantasy",
    "Plot": "A meek, mild Baron, with one motherless daughter, married again, and his second choice was an unlucky one. For not only did the woman browbeat her husband and make his life unhappy, but she beat and ill-treated poor little Cinderella, and made her a servant. The cruel stepmother had two daughters of her own, who were given every luxury, and they aided their mother to make the life of their stepsister very sad indeed. The King's son gave a grand ball, and the Baron and his family were among the invited guests. But when Cinderella wanted to go, she was cuffed and jeered at, and told that she must stay in the kitchen, her proper place, so the stepmother said. Little Cinderella helped the others to get ready for their night of enjoyment, and then sat in the kitchen alone in her rags. Really no one could blame her if she cried. Fortunately for the poor child she had a Fairy Godmother, but up to this time she had never been in evidence. But the Fairy Godmother, who had been keeping an eye on the Baron's household, decided that it was about time for her to make her influence felt. So she dropped into the kitchen via the fireplace (Fairy Godmothers seldom use doors: it is hard to say why, but they don't) and told Cinderella that not only was she going to the ball, but she was going in style. Her magic wand enabled her to provide a coach, coachman, footman and horses out of a pumpkin, a lizard, some mice and a rat. Then another turn of the wand changed Cinderella's rags into a fine ball gown, and she started for the castle in high spirits. But she was told that she must be home by midnight and like a dutiful little girl she promised. Also, the Fairy Godmother told her that at midnight all her finery would revert to its former state. Cinderella created a sensation at the ball, and the Prince devoted all his attention to her. The wicked stepmother and her daughters did not recognize in the gorgeous guest the forlorn child that they had treated like a slave. In fact, Cinderella had such a good time that it was midnight before she knew it. She ran away as fast as she could, but half way down the steps her gay garb turned into rags, and the coach and attendants became mice, pumpkins and lizards. As she fled she dropped one of her slippers, and the Prince found it. Then he caused proclamation to be made that he would marry the lady who could wear the slipper it she could produce the mate to it. The stepsisters tried it on, with other dames, but failed to prove that it could fit. Then Cinderella asked for a test. She proved that the slipper was hers, and as she did so her rags turned back to a ball gown again, and the Prince married her, and they lived happily together forever afterward. What became of the wicked sisters no one knows or cares. But probably the father of Cinderella had a happier life, for the chances were that his wicked wife was afraid to annoy him, fearing that the Fairy Godmother might get busy again.",
    "Director": "George Nichols",
    "Writer": "Charles Perrault",
    "Actors": "Florence La Badie, Harry Benham, Anna Rosemond",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0417062",
      "title": "The Portrait of the Lady Anne",
      "year": 1912,
      "imdbRating": 6.8,
      "imdbVotes": 88,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002122",
      "title": "The Cry of the Children",
      "year": 1912,
      "imdbRating": 6.2,
      "imdbVotes": 326,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002851",
      "title": "Fatty Joins the Force",
      "year": 1913,
      "imdbRating": 5.4,
      "imdbVotes": 437,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003961",
      "title": "A Film Johnnie",
      "year": 1914,
      "imdbRating": 5.6,
      "imdbVotes": 1796,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004091",
      "title": "His Favorite Pastime",
      "year": 1914,
      "imdbRating": 5,
      "imdbVotes": 1253,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003969",
      "title": "A Flirt's Mistake",
      "year": 1914,
      "imdbRating": 5.2,
      "imdbVotes": 255,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004637",
      "title": "The Star Boarder",
      "year": 1914,
      "imdbRating": 5.2,
      "imdbVotes": 1067,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001223",
      "title": "Frankenstein",
      "year": 1910,
      "imdbRating": 6.4,
      "imdbVotes": 5022,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001544",
      "title": "A Christmas Carol",
      "year": 1910,
      "imdbRating": 6,
      "imdbVotes": 902,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002302",
      "title": "Lena and the Geese",
      "year": 1912,
      "imdbRating": 5.7,
      "imdbVotes": 61,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001463",
      "title": "The Wonderful Wizard of Oz",
      "year": 1910,
      "imdbRating": 5.7,
      "imdbVotes": 1652,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002160",
      "title": "Entente cordiale",
      "year": 1912,
      "imdbRating": 6.2,
      "imdbVotes": 141,
      "language": "None, French",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.366Z"
}