{
  "imdbId": "tt0004707",
  "title": "Tillie's Punctured Romance",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TilliesPuncturedRomance1914--1939SoundRe-issue",
      "id": "TilliesPuncturedRomance1914--1939SoundRe-issue",
      "title": "TILLIE'S PUNCTURED ROMANCE (1914) -- 1939 sound re-issue",
      "description": "TILLIE'S PUNCTURED ROMANCE Mack Sennett Productions 6000 ft., rel. Nov. 14, 1914 (Dressler No. 1) dir. Mack Sennett cast: Marie Dressler (Tillie Banks), Charlie Chaplin (Charlie, a City Slicker), Mabel Normand (Mabel, his girl friend), Mack Swain (John Banks, Tillie's Father), Charles Bennett (Douglas Banks, Tillie's Uncle), Charles Murray (Detective), Charley Chase (Detective), Edgar Kennedy (Restaurant Proprietor), Harry McCoy (Pianist), Minta Durfee (Maid), Phyllis Allen (Wardress), Alice Davenport (Guest), Slim Summerville (Policeman), Al St. John (Policeman), Wallace MacDonald (Policeman), Joe Bordeaux (Policeman), G. G. Ligon (Policeman), Gordon Griffith (Newsboy), Billie Bennett (Girl), Rev. D. Simpson (Himself), William Hauber (Policeman) Location: Keystone studio, Los Angeles, CA finished: 7/25/1914 copyright: Mar. 23, 1915 This is the 1939 sound re-issue with lively score and sound effects track. Note. The version for .avi download here is somewhat better in picture quality than the one presented on video.",
      "fileSize": 1332214147,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/TilliesPuncturedRomance1914--1939SoundRe-issue",
      "collection": "feature_films",
      "downloads": 2648
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JJ55L9m8ZjI",
      "id": "JJ55L9m8ZjI",
      "title": "Tillie’s Punctured Romance (1914) | Colorized Public Domain Comedy | Charlie Chaplin & Mabel Normand",
      "description": "Tillie’s Punctured Romance (1914) is a colorized and restored public domain silent comedy film directed by Mack Sennett and produced by Keystone Studios. It holds the historic distinction of being the first-ever feature-length comedy in cinema history and one of the earliest examples of narrative comedy before Hollywood’s studio system matured. Starring Charlie Chaplin, Marie Dressler, and Mabel Normand, this film represents the birth of feature-length cinematic humor and remains one of the most influential works of the silent era.\n\nPlot Summary:\nThe story follows Tillie Banks (Marie Dressler), a naive country girl who inherits a fortune and becomes the target of a greedy city conman (Charlie Chaplin). After stealing her money and running off with another woman (Mabel Normand), Chaplin’s character leaves Tillie heartbroken and penniless. Fate intervenes when the trio cross paths again in a string of comic misunderstandings and chaotic reversals that culminate in slapstick mayhem.\n\nThe film’s humor lies in its outrageous exaggerations and physical gags — drunken brawls, mistaken identities, and wild chases — yet beneath the antics, Tillie’s Punctured Romance reveals an early feminist undercurrent. Tillie evolves from a gullible victim to a strong, self-assertive woman who takes control of her destiny. Dressler’s commanding performance, paired with Chaplin’s anarchic charm and Normand’s wit, helped define the emerging language of film comedy.\n\nCast and Crew:\n• Director: Mack Sennett\n• Producer: Mack Sennett\n• Writers: Mack Sennett and Hampton Del Ruth\n• Studio: Keystone Film Company\n• Distributor: Alco Film Corporation\n\nStarring:\n• Marie Dressler as Tillie Banks\n• Charlie Chaplin as The City Slicker\n• Mabel Normand as The Other Woman\n• Charles Bennett as Tillie’s Father\n• Chester Conklin as A Waiter\n• Mack Swain as A Policeman\n\nFilm Significance:\nTillie’s Punctured Romance is a cornerstone of film history. Released in 1914, it predates the Golden Age of Hollywood and stands as the first feature-length comedy ever made, setting the stage for narrative comedies worldwide. It was also one of Charlie Chaplin’s earliest films, released before he developed full creative control at Essanay and Mutual Studios.\n\nMarie Dressler’s performance broke new ground, proving that a woman could carry a film as its central comedic lead — something unprecedented at the time. Her exaggerated gestures, expressive face, and commanding energy bridged the gap between stage vaudeville and screen performance. Mabel Normand, one of the first female directors and producers in Hollywood, added another layer of depth as Chaplin’s co-star and creative equal.\n\nFrom a cinematic perspective, the film merged the spontaneity of Keystone’s slapstick with a structured plotline, setting the template for modern comedy features. For students of cinema, Tillie’s Punctured Romance represents both a milestone and a rare window into the experimental chaos of early Hollywood.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Tillie’s Punctured Romance remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. \n\nWhy Watch This Colorized Edition:\nThe 1914 original was a black-and-white, grainy print typical, often filmed outdoors with inconsistent lighting. For today’s audiences — especially those aged 55–64 who primarily view on large TV screens — such films can appear visually flat and distant. This restored colorized edition revitalizes the visual impact, enhancing facial expressions, costume detail, and physical comedy that once relied solely on exaggerated movement.\n\nBy adding color, stabilizing frames, and balancing contrast, this edition gives a new emotional resonance to Dressler’s and Chaplin’s performances. Viewers can now experience the historic first comedy feature as both a vivid artifact and an entertaining work of art. The restoration not only preserves cinematic history but transforms it into something approachable and visually dynamic for modern audiences across the USA and Europe.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TilliesPuncturedRomance #CharlieChaplin #MarieDressler",
      "addedAt": "2025-12-24T00:49:31.167Z",
      "thumbnail": "https://i.ytimg.com/vi/JJ55L9m8ZjI/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBlKGUwDw==&rs=AOn4CLCn9S74VoYCZG2sZZ2yCSO5MD3tiA",
      "duration": 4933,
      "language": "en",
      "year": 1914,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-tillies-punctured-romance",
      "id": "silent-tillies-punctured-romance",
      "title": "Tillie's Punctured Romance",
      "fileSize": 1432169617,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-tillies-punctured-romance",
      "language": "English",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 1138
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tillies-punctured-romance-1914_202304",
      "id": "tillies-punctured-romance-1914_202304",
      "title": "Tillie's Punctured Romance (1914)",
      "description": "Tillie’s Punctured Romance is a 1914 American silent comedy film directed by Mack Sennett and starring Marie Dressler, Mabel Normand, Charlie Chaplin, and the Keystone Kops. The picture was the only feature-length comedy made by the Keystone Film Company. Watch on RetroFlix.org:  https://retroflix.org/tillies-punctured-romance-1914/",
      "fileSize": 893525057,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/tillies-punctured-romance-1914_202304",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 283
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tillies-punctured-romance-1914_202408",
      "id": "tillies-punctured-romance-1914_202408",
      "title": "Tillie's Punctured Romance (1914) Directed by Mack Sennett",
      "description": "Tillie's Punctured Romance 1999 Image Entertainment DVD Directed by Mack Sennett Written by Hampton Del Ruth Craig Hutchinson Mack Sennett Based on Tillie's Nightmare by A. Baldwin Sloane and Edgar Smith Produced by Mack Sennett Starring Marie Dressler Mabel Normand Charles Chaplin Mack Swain Charles Bennett Chester Conklin The Keystone Cops Charley Chase (uncredited) Cinematography Hans F. Koenekamp (uncredited) Frank D. Williams (uncredited) Production company Keystone Film Company Distributed by Alco Film Corporation [ 1 ] Release date December 21, 1914 (United States) Running time 74 minutes 82 minutes (2003 restoration) Country United States Languages Silent English intertitles Budget $50,000 Tillie's Punctured Romance is a 1914 American silent comedy film directed by Mack Sennett and starring Marie Dressler , Mabel Normand , Charlie Chaplin , and the Keystone Cops . The picture is the first feature-length comedy [ 2 ] and was the only feature-length comedy made by the Keystone Film Company . At the time of production Marie Dressler was a major stage star, and in this film Chaplin and Normand support her as leads within Keystone's stock company of actors. The film, based on Dressler's stage play Tillie's Nightmare by A. Baldwin Sloane and Edgar Smith , is the first feature-length slapstick comedy in all of cinema . This was the last time Charlie Chaplin acted in a film that he neither wrote nor directed. He plays a slightly different role from his Tramp character, which was relatively new at the time. However, he retains a moustache (here a pencil-thin \"dude\" type rather than his usual \"toothbrush\"), thin cane and distinctive walk. Tillie provides an early example of film within a film , when the couple go to the cinema to watch A Thief's Fate , large sections of which are seen. [ 3 ] Plot Charles Chaplin portrays a womanizing city man who meets Tillie ( Marie Dressler ) in the country after a fight with his girlfriend ( Mabel Normand ). When he sees that Tillie's father ( Mack Swain ) has a very large bankroll for his workers, he persuades her to elope with him. In the city, he meets the woman he was seeing already, and tries to work around the complication to steal Tillie's money. He gets Tillie drunk in a restaurant and asks her to let him hold the pocketbook. Since she is drunk, she agrees, and he escapes with his old girlfriend and the money. Later that day, they see a Keystone film in a nickelodeon entitled \"A Thief's Fate\" (which is, ironically, a melodrama, a type of film Keystone did not produce) which illustrates their thievery in the form of a morality play . They both feel guilty and leave the theater. While sitting on a park bench, a paperboy ( Gordon Griffith ) asks him to buy a newspaper . He does so, and reads the story about Tillie's Uncle Banks ( Charles Bennett ), a millionaire who died while on a mountain-climbing expedition. Tillie is named sole heir and inherits three million dollars. The man leaves his girlfriend on the park bench and runs to the restaurant, where Tillie is now forced to work to support herself as she is too embarrassed to go home. He begs her to take him back and although she is skeptical at first, she believes that he truly loves her and they marry. They move into the uncle's mansion and throw a big party, which ends horribly when Tillie finds her husband with his old girlfriend, smuggled into the house and working as one of their maids. The uncle is found on a mountaintop, alive after all. He goes back to his mansion, in disarray after Tillie instigated a gunfight (a direct result of the husband smuggling the old girlfriend into the house) which, luckily, did not harm anyone. Uncle Banks insists that Tillie be arrested for the damage she has caused to his house. The three run from the cops all the way to a dock, where a car \"bumps\" Tillie into the water. She flails about, hoping to be rescued. She is eventually pulled to safety, and both Tillie and the man's girlfriend realize that they are too good for him. He leaves, and the two girls become friends. Cast [ 4 ] Description of Marie Dressler's character. Description of Charlie Chaplin's character. Re-release poster with different billing and picture featuring Chaplin's Tramp, who does not appear in the film. Scene with Normand, Chaplin and Dressler. Marie Dressler ... Tillie Banks, Country Girl Mabel Normand .. Mabel, Charlie's Girl Friend Charles Chaplin ... Charlie, City Slicker Mack Swain ... John Banks, Tillie's Father Charles Bennett ... Uncle Banks, Tillie's millionaire uncle Dan Albert ... Party Guest/Cop Phyllis Allen ... Prison Matron/Restaurant patron Billie Bennett ... Maid/Party Guest Joe Bordeaux ... Policeman (appearance is not verified) Glen Cavender ... First Pianist in Restaurant Charley Chase ... Detective in Movie Theater Dixie Chene ... Guest Nick Cogley ... Keystone Cop Desk Sergeant Chester Conklin ... Mr. Whoozis/Singing Waitor Alice Davenport ... Guest Hampton Del Ruth ... Bank's tall Secretary searching for Tillie Frankie Dolan ... Movie Spectator/Party Guest Minta Durfee ... Maid [ 5 ] Ted Edwards ... Waiter Edwin Frazee ...Movie Spectator/Guest/Cop Billy Gilbert ... Policeman Gordon Griffith ... Newsboy William Hauber ... Servant/Cop Fred Fishback ... Servant Alice Howell ...Guest Edgar Kennedy ... Restaurant Owner/Butler Grover Ligon ... Keystone Cop Wallace MacDonald ... Keystone Cop Hank Mann ... Keystone Cop Harry McCoy ... Second Pianist in Restaurant/Pianist in Theater/Servant Rube Miller ... Tillie's Visitor Charles Murray ... Detective in \"A Thief's Fate\" Eva Nelson ... Disgusted Guest in 2nd Restaurant Edward Nolan ... Restaurant Dancer/Policeman/Mountain Innkeeper/Party Guest Frank Opperman ... Rev. D. Simpson Hugh Saxon ...Bank's shorter Secretary searching for Tillie Fritz Schade ... Waiter/Diner Al St. John ... Keystone Cop Slim Summerville ... Keystone Cop Josef Swickard ... Movie Spectator Morgan Wallace ... Thief in \"A Thief's Fate\" Production Mack Sennett, whilst working with a degree of autonomy, was working for the larger company of Kessel and Baumann. [ 6 ] When slapstick impresario Mack Sennett proposed to adapt the 1910 Broadway comedy Tillie's Nightmare to the screen in 1914, he enlisted the immensely successful star of the stage production, the then 45-year-old Marie Dressler, to play the guileless ingenue, Tillie Banks. [ 7 ] Dressler was paid a huge fee of £2500 per week and was also meant to have a share of the profits of Kessler and Baumann but they passed the distribution contract to Alco, voiding Dressler's contract with K & B and forcing Dressler to sue them. The situation was further complicated by Alco going bust, mainly due to overpaying for the distribution rights: £100,000. Chaplin's salary was far less than Dressler, certainly under $1000 a week, as he demanded an increase to $1000 a week early in 1915. [ 8 ] Comedian Charles Chaplin, who had been with Sennett's studio since December 1913, was selected to play opposite Dressler as Charlie, an unscrupulous playboy and bounder. Though Chaplin's signature \" The Tramp \" character was already well-developed in other Sennett one- and two-reel films (he had already appeared in more than 30 shorts as the Tramp by the time), here he abandons the sweet-natured hobo to play a villain. The contrast between the diminutive, \"bow-legged\" Chaplin and the bovine and \"bulky\" Dressler, adds to the absurdity of their pairing. [ 9 ] Sennett's augmentation of the film length from two reels to six reels provided him with sufficient scope to showcase his ensemble of talented players in numerous venues: \"...many scenes are shot on location, and Sennett intercuts deftly to four different locations. The film’s final reel is a comedic crescendo, building from a brief pie fight to mayhem caused by Tillie firing a pistol indiscriminately, culminating with a farcical chase on a pier featuring the Keystone Cops on land and sea\". [ 10 ] The film, which costs roughly $50,000 ($1.2 million in 2015) to make, was based on the Broadway play Tillie's Nightmare , [ 11 ] which Dressler had great success in, on Broadway, and on tour in the United States, from 1910 to 1912. [ 12 ] Dressler would revive the play with her own touring company. Milton Berle always claimed that he played the five-year-old paperboy in the film. [ 13 ] but the role was actually portrayed by Gordon Griffith . This is one of only two films (the other is Making a Living , his first film, where he also plays a \"dude\" non-Tramp character) in which both Chaplin and the Keystone Cops appear. Reception Following its December 21, 1914 premiere at the Los Angeles Republic Theatre, [ 14 ] the film was a tremendous success. [ 15 ] As the Mutual Film Corporation , distributors of all Keystone shorts, was not equipped to handle features from them, Tillie became the only Keystone production to be distributed by the newly formed (and short-lived) Alco Film Corporation. It remained in theatrical release for years, being continually re-edited and shortened, and much later having optical soundtracks added featuring music, sound effects and narration. Home media For decades the film was only available in poor quality, truncated prints, but eventually David Shepard of Film Preservation Associates released his restoration on LaserDisc (1997) and DVD (1999) via Image Entertainment . It was coupled with Mabel's Married Life (1914), another Keystone film featuring Normand, Chaplin and Swain. In 2003 a second restoration, a collaboration between UCLA Film and Television Archive and the British Film Institute , used more complete, higher quality materials and saw Tillie returned almost to its original length. This version has been released in the fully restored Chaplin at Keystone 4-DVD box set (2010) by various labels worldwide. [ 16 ] Sequels Dressler appeared as Tillie in three more films, Tillie's Tomato Surprise (1915), Tillie Wakes Up (1917), and The Scrub Lady (1917), aka Tillie the Scrub Lady . In Tillie Wakes Up , the Tillie character is married and so has a different surname. The 1928 film Another comedy called Tillie's Punctured Romance was released in 1928 starring W. C. Fields as a circus ringmaster. Although often erroneously cited as a remake , the later film actually bears no resemblance to the 1914 film aside from the shared title and that Chester Conklin and Mack Swain appear in both films. In popular culture In The Simpsons episode American History X-cellent , one of Mr. Burns ' belongings includes a ticket stub for Tillie's Punctured Romance . From Wikipedia, the free encyclopedia",
      "fileSize": 526950223,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/tillies-punctured-romance-1914_202408",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 405
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "82 min",
    "imdbRating": 6.2,
    "imdbVotes": 3775,
    "Genre": "Comedy",
    "Plot": "Charlie talks wealthy farmer's daughter Tillie into eloping with him (and taking her father's money). In the city Tillie gets drunk and lands in jail while Charlie runs off with her money and his old girlfriend Mabel. Later Charlie reads that Tillie (now working as a waitress) has inherited the estate of her multi-millionaire uncle. Charlie dumps Mabel and talks Tillie into moving into her uncle's villa, and Mabel arranges to become a housemaid there. The uncle (never really dead) returns and summons the police to have them all thrown out.",
    "Director": "Mack Sennett, Charles Bennett",
    "Writer": "Hampton Del Ruth, Craig Hutchinson, Mack Sennett",
    "Actors": "Charles Chaplin, Marie Dressler, Mabel Normand",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0003758",
    "tt0003934",
    "tt0004280",
    "tt0004108",
    "tt0004282",
    "tt0004284",
    "tt0004007",
    "tt0004277",
    "tt0003679",
    "tt0004288",
    "tt0003805",
    "tt0004736"
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.284Z"
}