{
  "imdbId": "tt0004284",
  "title": "Mabel's Strange Predicament",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MabelsStrangePredicament1914",
      "title": "MABEL'S STRANGE PREDICAMENT (1914)",
      "description": "MABEL'S STRANGE PREDICAMENT Keystone-Mutual 1015 ft., rel. Feb. 9, 1914 (Pajamas) dir. Henry Lehrman and Mack Sennett, auth. Henry Lehrman, cam. Hans Koenekamp cast: Mabel Normand, Charlie Chaplin, Chester Conklin, Alice Davenport, Harry McCoy, Al St. John, William Hauber finished: 1/20/1914",
      "id": "MabelsStrangePredicament1914"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mabels-strange-predicament-1914-directed-by-mabel-normand-colorized",
      "title": "Mabel’s Strange Predicament (1914) Directed By Mabel Normand",
      "description": "Mabel’s Strange Predicament (1914) Directeor: Mabel Normand Mabel's Strange Predicament is a 1914 American film starring Mabel Normand and Charles Chaplin, notable for being the first film for which Chaplin donned the costume of The Tramp, although his appearance in the costume in Kid Auto Races at Venice was released first. The film was directed by Normand and produced by Mack Sennett Plot: An inebriated Charlie annoys several hotel guests while sitting in the lobby. In her hotel room, Mabel is playfully tossing a ball to her dog. The noise disturbs Alice who occupies the room across the hall from Mabel. She informs Chester that she is going to the lobby to make a complaint to the manager. Not long after Alice leaves her room, Mabel accidentally locks herself out of her room while wearing only pajamas. Charlie happens by and tries to woo her. Mabel flees in embarrassment and eventually enters Alice and Chester's room to hide. Mabel crawls under the bed. Mabel's beau, Harry, brings a bouquet of flowers to Mabel and has a bellhop unlock her room. Finding Mabel absent, Harry decides to wait for her in the room occupied by his friends—Chester and Alice! When Harry finds Mabel hiding under Chester's bed, he assumes the worst and starts a fight with Chester. Alice returns and, upon seeing Mabel, also assumes the worst and starts a fight with her husband. By the movie's end, Harry and Mabel have reconciled, but Alice and Chester have escalated their fight. Review: A reviewer for Exhibitors' Mail saw the genius of Charles Chaplin in what was only his third film, and predicted great things for the former English stage comedian, writing: \"The Keystone Company never made a better contract than when they signed on Chas. Chaplin, the Karno performer. It is not every variety artiste who possesses the ability to act before the camera. Chaplin not only shows that talent, he shows it in a degree which raises him at once to the status of star performer. We do not often indulge in prophecy, but we do not think we are taking a great risk in prophesying that in six months Chaplin will rank as one of the most popular screen performers in the world. Certainly there has never been before quite so successful a first appearance\" First \"Tramp\" appearance filmed: The Tramp was first presented to the public in Chaplin's second film Kid Auto Races at Venice (released February 7, 1914), though Mabel's Strange Predicament, his third film in order of release (released February 9, 1914), was produced a few days earlier. It was for this film that Chaplin first conceived of and played The Tramp. As he recalled in his autobiography:     \"I had no idea what makeup to put on. I did not like my get-up as the press reporter [in Making a Living]. However on the way to the wardrobe I thought I would dress in baggy pants, big shoes, a cane and a derby hat. I wanted everything to be a contradiction: the pants baggy, the coat tight, the hat small and the shoes large. I was undecided whether to look old or young, but remembering Sennett had expected me to be a much older man, I added a small mustache, which I reasoned, would add age without hiding my expression. I had no idea of the character. But the moment I was dressed, the clothes and the makeup made me feel the person he was. I began to know him, and by the time I walked on stage he was fully born.\"     — Chaplin, My Autobiography, p. 154 Mabel's Strange Predicament is one of more than a dozen early films that writer/director/comedian Mabel Normand made with Chaplin. Normand, who had written and directed films before Chaplin, mentored the young comedian. Chaplin's Tramp is shown swigging from a flask toward the beginning of the film and subsequently becoming so drunk that he staggers when he walks and falls down repeatedly near the end. His portrayal of drunkenness remains convincingly realistic. The Tramp also keeps his derby cocked throughout the action, a touch that Chaplin abandoned later in his career. Cast:     Mabel Normand as Mabel     Charles Chaplin as The Tramp     Chester Conklin as Husband     Alice Davenport as Wife     Harry McCoy as Lover     Hank Mann as Hotel Guest     Al St. John as Bellboy -From Wikipedia",
      "id": "mabels-strange-predicament-1914-directed-by-mabel-normand-colorized"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-mabels-strange-predicament",
      "title": "Mabel's Strange Predicament",
      "id": "silent-mabels-strange-predicament"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "17 min",
    "imdbRating": "5.6",
    "imdbVotes": "2,038",
    "Genre": "Short, Comedy",
    "Plot": "In a hotel lobby, an inebriated Charlie runs into an elegant lady, gets tied up in her dog's leash, and falls down. He later runs into her in the hotel corridor, locked out of her room. They run through various rooms. Mabel ends up in one, hiding under the bed of an elderly husband. Enter the jealous wife and Mabel's lover.",
    "Director": "Mabel Normand",
    "Writer": "Charles Chaplin, Henry Lehrman",
    "Actors": "Mabel Normand, Charles Chaplin, Chester Conklin",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0003758",
      "title": "Caught in a Cabaret",
      "year": 1914,
      "imdbRating": "5.7",
      "imdbVotes": "1,537",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004279",
      "title": "Mabel's Blunder",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "428",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003679",
      "title": "Between Showers",
      "year": 1914,
      "imdbRating": "5.4",
      "imdbVotes": "1,857",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003934",
      "title": "The Fatal Mallet",
      "year": 1914,
      "imdbRating": "5.4",
      "imdbVotes": "1,115",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004280",
      "title": "Mabel's Busy Day",
      "year": 1914,
      "imdbRating": "5.4",
      "imdbVotes": "1,081",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004311",
      "title": "The Masquerader",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,564",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003863",
      "title": "Dough and Dynamite",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,197",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004108",
      "title": "His Trysting Place",
      "year": 1914,
      "imdbRating": "6.2",
      "imdbVotes": "1,010",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004282",
      "title": "Mabel's Married Life",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "1,466",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004007",
      "title": "Gentlemen of Nerve",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "969",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004277",
      "title": "Mabel at the Wheel",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "1,085",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004693",
      "title": "Those Love Pangs",
      "year": 1914,
      "imdbRating": "5.4",
      "imdbVotes": "1,197",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:07.409Z"
}