{
  "imdbId": "tt0057952",
  "title": "Circus World",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/circus-world-1964",
      "id": "circus-world-1964",
      "title": "Circus World (1963) John Wayne · Rita Hayworth",
      "description": "A circus-themed spectacle overloaded with showmanship; the plot revolves around the search for an acrobat who disappeared years ago. The lavishly but conventionally staged film, featuring a top-notch cast, was intended to mark Rita Hayworth's comeback and is not without its sentimentality..",
      "fileSize": 1321417422,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/circus-world-1964",
      "language": "eng",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 444
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "135 min",
    "imdbRating": 6.1,
    "imdbVotes": 3064,
    "Genre": "Drama, Western",
    "Plot": "In the early years of the 20th century, Matt Masters takes his rambling Wild West Show to Europe. His decision is prompted by his desire to find Lili Alfredo, who disappeared fourteen years earlier following the death of her husband, The Flying Alfredo. At the time it was believed that Alfredo dived to his death deliberately when he realized his wife loved Matt and not him. Toni, a beautiful trapeze performer, raised by Matt is actually Lili's daughter, and she is in love with Steve McCabe, one of the stars on Matt's show. Doing their first show in Barcelona, aboard a ship, the ship keels over and Matt loses his show. Now broke, he leaves for Paris with Toni, Steve and his long-time friend, Cap Carson, to seek a job with Colonel Purdy's Wild West Show. But a year later, Matt has rebuilt his own show. First to be signed is a remarkable 12-year-old wire-walker named Giovana, and her guardian, Tojo the Clown, whose real named is Aldo Alfredo, formerly of the Flying Alfredos. Continuing his search for Lili, Matt's show plays Brussels, Vienna, Prague, Copenhagen, Rome, Milan, and finally Madrid, where Lili is part of the audience.",
    "Director": "Henry Hathaway",
    "Writer": "Ben Hecht, Julian Zimet, James Edward Grant",
    "Actors": "John Wayne, Rita Hayworth, Claudia Cardinale",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 2 nominations"
  },
  "relatedMovies": [
    "tt0060748",
    "tt0043959",
    "tt0024674",
    "tt0054127",
    "tt0050629",
    "tt0054757",
    "tt0062472",
    "tt0059178",
    "tt0059093",
    "tt0215842",
    "tt0060067",
    "tt0059232"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.623Z"
}