{
  "movieId": "tt0068358",
  "title": "Charley-One-Eye",
  "year": 1973,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dtqBK4vwXA4",
      "id": "dtqBK4vwXA4",
      "title": "Charley One Eye (1973) Western Movie | Somebody lied. Somebody is going to pay.",
      "description": "British-American Western with Richard Roundtree, Roy Thinnes, Nigel Davenport, Jill Pearson, Aldo Sambrell, Luis Aller, Rafael Albaicín",
      "addedAt": "2025-12-24T01:00:49.464Z",
      "thumbnail": "https://i.ytimg.com/vi/dtqBK4vwXA4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAi61sQTbuUFABTIB_baKxlobrPDw",
      "duration": 5178,
      "language": "en",
      "year": 1973,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "96 min",
    "imdbRating": 6,
    "imdbVotes": 304,
    "Genre": "Western",
    "Plot": "After killing an officer, a black soldier deserts and heads for the Mexican border. In the wilderness, he encounters a crippled wandering Indian. Initially, the Union soldier forces the Indian to be his man-servant, verbally abusing and threatening him with a big knife, occasionally mocking the Indian for his handicap. Later, an uneasy alliance forms between the two men as they travel south. They eventually find decent shelter and a water-well at an old abandoned Spanish church. They also find the dead bodies of a prospector and his mule. They scavenge the belongings of the deceased prospector and end-up with a crate of live chickens, a few firearms, ammunition, food, jugs of moonshine, clothing and other items. The next few days are relatively enjoyable, as the two unlikely friends cement their partnership, eat fried chicken and drink booze. The soldier even offers a revolver to the Indian, as a gift. Among the live chickens there is one bird that only has one-eye. The Indian adopts it as his pet, feeding it grain, vowing to never eat the chicken and calling it Charley One Eye. As they pass the days, the two men are unaware that a brutal and vicious bounty-hunter is after the deserting soldier in order to cash a 500 dollar bounty for his capture and return to the army fort. Also, gangs of murderous Mexican bandits roam the region. Eventually, things come to a dramatic and violent end.",
    "Director": "Don Chaffey",
    "Writer": "Keith Leonard",
    "Actors": "Richard Roundtree, Roy Thinnes, Nigel Davenport",
    "Language": "English",
    "Country": "United Kingdom, United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0066955",
    "tt0072651",
    "tt0070687",
    "tt0069825",
    "tt0068393",
    "tt0071589",
    "tt0073059",
    "tt0068539",
    "tt0071593",
    "tt0070569",
    "tt0066907",
    "tt0068885"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:32:53.610Z"
}