{
  "movieId": "tt0032335",
  "title": "Chingolo",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/chingolo-1940",
      "id": "chingolo-1940",
      "title": "Chingolo (1940)",
      "description": "Chingolo   es una película de   Argentina   en blanco y negro dirigida por   Lucas Demare   según la guía de   Carlos A. Olivari   y   Sixto Pondal Ríos   que se estrenó el 18 de septiembre de 1940 y que tuvo como protagonistas a   Luis Sandrini ,   Homero Cárpena ,   Nury Montsé   y   Haydée. Larroca . Fue la primera obra de importancia en la filmografía de Lucas Demare. (Wikipedia) Sinopsis Un simpático vagabundo apodado \"Chingolo\" ( Luis Sandrini ) salva a un niño de morir ahogado. Cuando la familia acaudalada del chico desea recompensarlo con dinero, se sorprenden ante la negativa del singular personaje, que aceptaría solo algo de comida. Es entonces adoptado por la madre del niño, que se empeña en transformar a Chingolo en un hombre trabajador, lo que motiva a los más disparatados e hilarantes enredos. La alocada familia trata de imponer sus valores y él responde de la misma manera. Se corrompe, pero al enamorarse, reencuentra su pureza original. Reparto Rosa Catá ..... Leocadia Homero Cárpena  ... Carbonillo Cirilo Etulain  ... Fernando Carlos Fioriti Haydée Larroca  ... empleada Nuri Montsé ..... Elvira Carlos Morganti Edgardo Morilla Héctor Méndez ..... Eduardo Luis Sandrini ..... Chingolo",
      "fileSize": 1203293890,
      "addedAt": "2026-01-07T00:07:51.622Z",
      "thumbnail": "https://archive.org/services/img/chingolo-1940",
      "language": "spa",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 67
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "79 min",
    "imdbRating": 7.7,
    "imdbVotes": 20,
    "Genre": "Comedy",
    "Plot": "Un joven vagabundo de sobrenombre \"Chingolo\" salva la vida a un niño al rescatarlo al caer a las aguas, sus padres son muy adinerados, al enterarse intentan darle una recompensa, pero Chingolo se niega aduciendo que la espontánea acción.En compensación la madre del niño organiza una fiesta para reconocerlo ante sus amistades, incorporandolo al grupo familiar para reencausar su vida, dandole un trabajo como oportunidad pero de la mano de ello imponiendole un estricto código de conducta.A young tramp of nickname \"Chingolo\" saves a child's life by rescuing him when he falls into the waters, his parents are very wealthy, upon learning they try to give him a reward, but Chingolo refuses by claiming that the spontaneous action.In compensation the mother of the child organizes a party to recognize him in front of his friends, incorporating him into the family group to redirect his life, giving him a job as an opportunity but hand in hand with it imposing a strict code of conduct.",
    "Director": "Lucas Demare",
    "Writer": "Carlos A. Olivari, Nicolas Olivari, Sixto Pondal Ríos",
    "Actors": "Luis Sandrini, Nuri Montsé, Homero Cárpena",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0185836",
    "tt0030071",
    "tt0178824",
    "tt0185998",
    "tt0061482",
    "tt0048370",
    "tt0178264",
    "tt0178827",
    "tt0178302",
    "tt0178883",
    "tt0032599",
    "tt0032343"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.622Z"
}