{
  "imdbId": "tt0010747",
  "title": "Sunnyside",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Sunnyside",
      "title": "Charlie Chaplin's \"Sunnyside\" (1919)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"Sunnyside\" is one of Charlie Chaplin's First National short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             First National Pictures Scenario by                Charlie Chaplin      Starring                     Charlie Chaplin, Edna Purviance, Tom Wilson Cinematography        Roland Totheroh Distributed by           First National Exhibitors' Circuit Release date               June 15, 1919 Running time             28 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"",
      "id": "Sunnyside"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-sunnyside",
      "title": "Sunnyside",
      "id": "silent-sunnyside"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sunnyside-1918-directed-by-charlie-chaplin-colorized",
      "title": "Sunnyside (1918) Directed By Charlie Chaplin",
      "description": "Sunnyside (1919) Film poster Directed by Charlie Chaplin Written by Charlie Chaplin Starring Charlie Chaplin Edna Purviance Henry Bergman Tom Wilson Olive Ann Alcorn Cinematography Roland Totheroh Edited by Charlie Chaplin Distributed by First National Pictures Release date June 15, 1919 Running time 34 minutes Country United States Language Silent (English intertitles ) Sunnyside is a 1919 American short silent film written by, directed by and starring Charlie Chaplin . It was his third film for First National Pictures . Plot Charlie works on a farm from 4 a.m. until late at night at the run-down Evergreen Hotel in the rural village of Sunnyside. He has endless duties inside the hotel as well as farm chores to undertake. Chaplin's boss is the local preacher who mistreats him badly. He gets his food and the boss' on the run (milking a cow into his coffee, holding a chicken over the frying pan to get fried eggs). Charlie has to lead the cows to an upper pasture on a Sunday. He wanders off-road on a dusty corner and loses the cows. They materialise in the village: mainly in the church. Charlie rides a longhorn out of the church and falls off as they cross a bridge. In his daze he sees dancing nymphs. His boss kicks him all the way home. Charlie's love interest in the village is the girl played by Edna Purviance. He loves her, but is disliked by her father. He waits for the father to leave the house then enters and gives her a posy of flowers. Their tryst is disturbed by brother Willie. He blindfolds Willie and says they are playing blind man's buff - leading him out of the front door. Charlie plays piano with his girl. A goat and kid appear behind the piano and Charlie thinks it is a flat note. The father returns and he has to leave. A city slicker is hurt in a car crash and is carried into the hotel by the fat boy. He is placed on the reception desk and Charlie tries to check him in. The fat boy brings the doctor. The doctor's bag mainly contains whisky and crude implements of amputation. The doctor writes a prescription and the city slicker pays him. The doctor leaves and the fat boy puts the slicker in a bedroom. Charlie returns to the hotel lounge, where he has to mop the floor around the doctor, the fat boy, and the boy's tiny father. The screen title says \" Lounge lizards \", an early printed use of the term. The city slicker recovers. He stands at the reception smoking a cigarette. The hotel has a small area selling groceries. A woman stands at the grocery counter and gets her hand stuck on fly paper . She has forgotten what she came in to buy: Charlie proffers a series of items including a razor. Smelly cheese makes her remember she wanted socks. She pays with a dollar bill which gets stuck to the fly paper. She leaves and the slicker follows her out, returning a cent which she dropped. Charlie despairs as they walk off together. Charlie spies through her window and sees her with the slicker with her father in the room, seemingly accepting this new suitor. The slicker has a unique style: a handkerchief up his sleeve and a cigarette lighter in the head of his walking cane. Charlie dons spats and a walking cane. The locals laugh as he passes. At the girl's house he draws attention to the spats and his DIY attempt at a cane-top cigarette lighter. The slicker arrives and Charlie leaves, outdone. Back in the hotel his boss shouts at him. The slicker checks out of the hotel and gives Charlie a tip. Charlie embraces his girl as the slicker drives off. Critics have long argued as to whether the final scene is real or a dream. Deleted scene The 1983 documentary Unknown Chaplin contains a deleted scene in which Charlie also serves as the hotel's hapless barber. Albert Austin plays a man who has come in for a shave and gets more than he expected from the Evergreen Hotel's inept barber. Cast Charlie Chaplin - Farm handyman Edna Purviance - Village Belle Tom Wilson - Boss Henry Bergman - Villager and Edna's Father Olive Ann Alcorn - Nymph Tom Wood - Fat Boy Loyal Underwood - Fat Boy's Father Tammie Harding Barlow - Dancer #1 Helen McDonough - Dancer #2 Albert Austin - Village Doctor Reception The June 16, 1919 issue of The New York Times contains this review: \"Charlie Chaplin is at the Strand in his latest—\"Sunnyside\"—so, of course, those who go there will laugh. Chaplin is a farm hand and country hotel clerk this time. He is at his best when depending upon his inimitable pantomime , and least amusing when indulging in slap-stick , in which he is not distinguished from countless other comedians. There is cleverness in \"Sunnyside\" and good pantomime, but, also, too much slap-stick. [ 1 ] The nymph dance in the dream sequence has been described as a tribute to or parody of the ballet L'après-midi d'un faune by Vaslav Nijinsky . [ 2 ] [ 3 ] References 1 \"THE SCREEN\". The New York Times. June 16, 1919. Retrieved April 24, 2020. 2 Chaplin, Lita Grey; Vance, Jeffrey (1998). Wife of the Life of the Party: A Memoir. Lanham, Maryland: Scarecrow Press. p. 24. ISBN 0-8108-3432-4. 3 Porter, Jenelle (2010). Dance with Camera. University of Pennsylvania: Institute of Contemporary Art. p. 148. -From Wikipedia",
      "id": "sunnyside-1918-directed-by-charlie-chaplin-colorized"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sunnyside-1919",
      "title": "Sunnyside (1919)",
      "description": "Sunnyside is a 1919 American short silent film written by, directed by and starring Charlie Chaplin. It was his third film for First National Pictures. Watch on RetroFlix.org:  https://retroflix.org/sunnyside-1919/",
      "id": "sunnyside-1919"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "34 min",
    "imdbRating": "6.6",
    "imdbVotes": "3,404",
    "Genre": "Comedy, Short",
    "Plot": "Charlie works on a farm from 4am to late at night. He gets his food on the run (milking a cow into his coffee, holding an chicken over the frying pan to get fried eggs). He loves the neighbor's daughter Edna but is disliked by her father. He rides a cow into a stream and is kicked off. Unconscious, he dreams of a nymph dance. Back in reality a city slicker is hurt in a car crash and is being cared for by Edna. When Charlie is rejected after attempting to imitate the slicker, the result is ambiguous--either tragic or a happy ending. Critics have long argued as to whether the final scene is real or a dream.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Edna Purviance, Olive Ann Alcorn",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0008907",
      "title": "The Bond",
      "year": 1918,
      "imdbRating": "5.4",
      "imdbVotes": "1,213",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009018",
      "title": "A Dog's Life",
      "year": 1918,
      "imdbRating": "7.6",
      "imdbVotes": "10,161",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009611",
      "title": "Shoulder Arms",
      "year": 1918,
      "imdbRating": "7.3",
      "imdbVotes": "7,583",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008133",
      "title": "The Immigrant",
      "year": 1917,
      "imdbRating": "7.5",
      "imdbVotes": "9,530",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007613",
      "title": "The Adventurer",
      "year": 1917,
      "imdbRating": "7.3",
      "imdbVotes": "4,613",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007832",
      "title": "The Cure",
      "year": 1917,
      "imdbRating": "7.1",
      "imdbVotes": "3,960",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007880",
      "title": "Easy Street",
      "year": 1917,
      "imdbRating": "7.4",
      "imdbVotes": "5,934",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012304",
      "title": "The Idle Class",
      "year": 1921,
      "imdbRating": "7.2",
      "imdbVotes": "4,241",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0410477",
      "title": "The Professor",
      "year": 1919,
      "imdbRating": "6.0",
      "imdbVotes": "770",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007194",
      "title": "Police",
      "year": 1916,
      "imdbRating": "6.4",
      "imdbVotes": "2,047",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006684",
      "title": "The Fireman",
      "year": 1916,
      "imdbRating": "6.5",
      "imdbVotes": "3,032",
      "language": "English, None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:35.633Z"
}