{
  "movieId": "tt0089348",
  "title": "Invasion U.S.A.",
  "year": 1985,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/InvasionUsa",
      "id": "InvasionUsa",
      "title": "Invasion USA",
      "description": "The Commies are coming! The Commies are coming! A paranoid red-scare delusion in which America in invaded and defeated by an unnamed country (but we know it's really Russia). Stars Gerald Mohr and Peggie Castle. Produced during a time when the House Un-American Activities Committee and Joe McCarthy were looking for Reds under every coffee table. TRIVIA: Noel Neill and Phyllis Coates (both of whom played Lois Lane on TV's Superman) are in this film. Directed by Alfred E Green Released in 1952 complete print",
      "fileSize": 1002345599,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/InvasionUsa",
      "collection": "feature_films",
      "downloads": 20010
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "107 min",
    "imdbRating": 5.4,
    "imdbVotes": 11591,
    "Genre": "Action, Thriller",
    "Plot": "A terrorist, Rostov, is planning to unleash a reign of terror on the U.S.. But before he does he decides to go after Matt Hunter, a former CIA agent who lives in Florida. Hunter once had Rostov's life in his hands, but on orders took him alive, and now Rostov is plagued by nightmares of Hunter killing him. So Rostov goes after him but misses, so Hunter, who has already been approached by his former employers to go after Rostov, after initially turning down the job, because he believed that they should have let him terminate Rostov when he had the chance, decides to go after him. But he is only one man and Rostov has hundreds of men ripping the country apart, so how will he stop it?",
    "Director": "Joseph Zito",
    "Writer": "James Bruner, Chuck Norris, Aaron Norris",
    "Actors": "Chuck Norris, Richard Lynch, Melissa Prophet",
    "Language": "English, Russian, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0087805",
    "tt0088359",
    "tt0083941",
    "tt0099978",
    "tt0094843",
    "tt13423326",
    "tt0167194",
    "tt0116374",
    "tt1060255",
    "tt1411232",
    "tt1161861",
    "tt0074383"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}