{
  "movieId": "tt0032497",
  "title": "Frontier Crusader",
  "year": 1940,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8OLLX_wAZKU",
      "id": "8OLLX_wAZKU",
      "title": "Frontier Crusader (1940) TIM McCOY🍕 COWBOY WESTERN",
      "description": "Stars: Tim McCoy,  Dorothy Short, Frank LaRue, George Chesebro\nDirector: Sam Newfield\n\nA marshal is sent to clean up a mining town being terrorized by an organized gang that is killing miners and stealing their claims.\n\nSaddle up for another action-packed classic cowboy western featuring the legendary Tim McCoy, one of the silver screen’s most iconic Western stars! In this thrilling tale of justice and heroism, McCoy leads the charge against outlaws, corruption, and frontier danger. Joining him is Dorothy Short, a fan-favorite of the era, along with familiar Western faces like Frank LaRue and George Chesebro, who round out an unforgettable cast.\n\nFans of classic Western movies, 1930s and 1940s cowboy films, and old-school Hollywood Westerns won’t want to miss this cinematic gem. With its gripping story, rugged action, and timeless themes of good versus evil, Frontier Crusader is a must-watch for lovers of vintage Westerns and the Golden Age of cinema.\n\nWhether you’re a die-hard Tim McCoy fan, a collector of classic cowboy adventures, or simply searching for full-length Western films to enjoy, PizzaFLIX delivers another unforgettable ride through the Old West. Subscribe for more classic movies, Western action, and timeless Hollywood entertainment! Dust off your boots, grab your hat and enjoy the ride.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#TimMcCoy #FrontierCrusader #ClassicWesterns #CowboyMovies #VintageCinema #OldHollywood#ClassicWesterns #TimMcCoy #CowboyMovies #1940sCinema #VintageFilms",
      "addedAt": "2025-12-24T01:05:12.434Z",
      "thumbnail": "https://i.ytimg.com/vi/8OLLX_wAZKU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCOA6sR4odnoqMqjN26C3BO3wOYmg",
      "duration": 3728,
      "language": "en",
      "year": 1940,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": 7.3,
    "imdbVotes": 21,
    "Genre": "Western",
    "Plot": "The first Producers Releasing Corporation western as the first few 1939-40 entries (from the same production people) were made as Producers Pictures Corporation films distributed by Producers Distributing Corporation, and from this point on were Producers Releasing Corporation (P.R.C.) films also distributed by Producers Releasing Corporation. This one, actually the second film in this series with Tim McCoy following the inital PPC entry, finds that a bandit gang whose ranks include experts in claim-jumping, high-grading and other specialities, has created a reign of terror in Monument City, a Mexican border mining and cattle town. Saloon owner Barney Bronson (Karl Hackett, billed in the film, the posters and the pressbook as (a typo) Carl Hackett, leading some sources to think he actually used that as an AKA name) is suspected of being the ringleader but, behind Bronson, is the real leader, the local express agent, a traitor to the company which employs him. Sheriff Sam Dolan (Hal Price) enlists the aid of Trigger Tim Rand (Tim McCoy), famous gunman and Marshal. The gang sends The Mesa Kid (Kenne Duncan as Ken Duncan) to get rid of Trigger Tim, but Trigger makes short work of dispatching the Kid and begins his quest to clean up the town.",
    "Director": "Sam Newfield",
    "Writer": "George Arthur Durlam, William Lively",
    "Actors": "Tim McCoy, Dorothy Short, Lou Fulton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032563",
    "tt0031164",
    "tt0033141",
    "tt0032989",
    "tt0033104",
    "tt0031306",
    "tt0032055",
    "tt0032014",
    "tt0034270",
    "tt0031769",
    "tt0030581",
    "tt0030366"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:35:13.986Z"
}