{
  "imdbId": "tt0025861",
  "title": "El tango en Broadway",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-tango-en-broadway-1934",
      "id": "el-tango-en-broadway-1934",
      "title": "El Tango En Broadway(1934)",
      "description": "El tango en Broadway  es un largometraje musical protagonizado por el cantante de  tangos   Carlos Gardel , dirigido por el francés  Louis J. Gasnier , que constituye la segunda de la serie de películas estadounidenses de Gardel realizadas por la empresa  Paramount  en los estudios Kaufman Astoria ubicados en  Astoria (Queens)  en  Nueva York . La película cuenta con el guion de  Alfredo Le Pera . Gardel canta los temas « Rubias de Nueva York », «Golondrinas», «Soledad» y «Caminito soleado», mientras que Agustín Cornejo canta «Chinita» y «Qué me importa». Fue estrenada el 28 de diciembre de 1934 en  Nueva York . (Wikipedia) Argumento El argumento trata de un grupo de artistas latinos en Nueva York reunidos alrededor de Gardel, cuando llega el tío, frente a quien intenta aparentar que es un hombre de negocios. Laurita entonces se hace pasar por la novia de Carlos, y su novia, Celia, se hace pasar por su secretaria, generándose sucesivos enredos. Carlos se da cuenta de que en realidad ama a Laurita en una de las escenas culminantes de la película, cuando canta el tango \"Soledad\" (\"En la doliente sombra de mi cuarto al esperar, sus pasos que quizás no volverán...\"). Las canciones que interpreta Gardel en la película son \"Soledad\", el  foxtrot  \" Rubias de New York \", \"Golondrinas\" y \"Caminito soleado\". En las tres primeras fue acompañado por la orquesta de Terig Tucci y en la última por el piano de Castellano con las guitarras de Cáceres, Ayala y Cornejo Reparto Carlos Gardel (Alberto Bazán) Trini Ramos (Celia) Blanca Vischer (Laurita) Vicente Padula (Juan Carlos) Jaime Devesa (Don Indalecio Bazán) Suzanne Dulier (Susana) Manuel Peluffo (El hombre blanco) Don Alberto (Morales) Agustín Cornejo (Cornejo) Carlos Spaventa (Carlos) Carlos Gianotti (El gaucho) José Moriche (Piñata) Dan Duryea (Bob, el novio de Laurita, fuera de créditos)",
      "fileSize": 1217960635,
      "addedAt": "2026-01-07T00:08:15.379Z",
      "thumbnail": "https://archive.org/services/img/el-tango-en-broadway-1934",
      "language": "spa",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 327
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 7.1,
    "imdbVotes": 47,
    "Genre": "Drama, Musical",
    "Plot": "Alberto Bazán (Carlos Gardel) plays a young man living the good life in NY at the expense of his rich uncle Don Indalecio Bazán (Jaime Devesa). When his uncle suddenly arrives in NY soon discovers the money he regularly sends to his nephew is used in women and drinks instead of in business as he was told. So Alberto decides -with the cooperation of his fiancée, his secretary and his manager- to turn his uncle into a good life fond too in order to keep the same way of living.",
    "Director": "Louis J. Gasnier",
    "Writer": "Alfredo Le Pera",
    "Actors": "Carlos Gardel, Trini Ramos, Blanca Vischer",
    "Language": "Spanish",
    "Country": "United States, Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025021",
    "tt0023205",
    "tt0026301",
    "tt0028346",
    "tt0028607",
    "tt0023845",
    "tt0026775",
    "tt0024083",
    "tt0024159",
    "tt0024486",
    "tt0021359",
    "tt0139639"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.379Z"
}