{
  "movieId": "tt0016804",
  "title": "Don Juan",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/don-juan-1926-dvd-mkv",
      "id": "don-juan-1926-dvd-mkv",
      "title": "Don Juan (1926) DVD MKV",
      "description": "DVD remux of the 1926 Vitaphone film \"Don Juan.\" IMDb TMDB Wikipedia Don Juan is a 1926 synchronized sound American romantic adventure film directed by Alan Crosland. It is the first feature-length film to utilize the Vitaphone sound-on-disc sound system with a synchronized musical score and sound effects, though it has no spoken dialogue. The film is inspired by Lord Byron's 1821 epic poem of the same name. The screenplay was written by Bess Meredyth with intertitles by Maude Fulton and Walter Anthony. Don Juan stars John Barrymore as the hand-kissing womanizer.",
      "fileSize": 5869839768,
      "addedAt": "2026-01-07T00:08:15.374Z",
      "thumbnail": "https://archive.org/services/img/don-juan-1926-dvd-mkv",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 377
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/don-juan-1926_202507",
      "id": "don-juan-1926_202507",
      "title": "Don Juan (1926)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The first full length film to ever feature a prerecorded soundtrack, Don Juan stars John Barrymore as a cynical womanizer who finds true love, before others try to sabotage him. Critics were mostly unimpressed with the picture, but audiences came out in droves to see and hear the film with the attached soundtrack. ",
      "fileSize": 7055448745,
      "addedAt": "2026-01-07T00:08:15.374Z",
      "thumbnail": "https://archive.org/services/img/don-juan-1926_202507",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 63
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Drtku2STWrM",
      "id": "Drtku2STWrM",
      "title": "Don Juan (1926) JOHN BARRYMORE🍕 MARY ASTOR",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: John Barrymore, Mary Astor, Estelle Taylor, AND Myrna Loy\nDirector: Alan Crosland\n🍕Presented with the original synchronized orchestral score and sound effects🍕\nIn Renaissance-era Italy, the world's greatest lover is pursued by many women, but Don Juan is haunted by the one he cannot possess.  In the quest for her love, he runs afoul of Caesar, Lucrezia, and Count Donati of the tyrannical Borgia clan.\n\nTRIVIA: The first feature-length film to use Vitaphone's sound-on-disc system which synchronized the musical score and sound effects to the film’s playback projection.",
      "addedAt": "2025-12-24T01:06:56.470Z",
      "thumbnail": "https://i.ytimg.com/vi/Drtku2STWrM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLACmMTZ7dd0Nzgy0BkMFBDkkv6P4w",
      "duration": 6786,
      "language": "en",
      "year": 1926,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "110 min",
    "imdbRating": 7,
    "imdbVotes": 1007,
    "Genre": "Adventure, Romance",
    "Plot": "If there was one thing that Don Juan de Marana learned from his father Don Jose, it was that women gave you three things - life, disillusionment and death. In his father's case it was his wife, Donna Isobel, and Donna Elvira who supplied the latter. Don Juan settled in Rome after attending the University of Pisa. Rome was run by the tyrannical Borgia family consisting of Caesar, Lucrezia and the Count Donati. Juan has his way with and was pursued by many women, but it is the one that he could not have that haunts him. It will be for her that he suffers the wrath of Borgia for ignoring Lucrezia and then killing Count Donati in a duel. For Adriana, they will both be condemned to death in the prison on the river Tigre.",
    "Director": "Alan Crosland",
    "Writer": "Bess Meredyth, Walter Anthony, Lord Byron",
    "Actors": "Jane Winton, John Roche, Warner Oland",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    "tt0018566",
    "tt0017667",
    "tt0018218",
    "tt0017416",
    "tt0020238",
    "tt0015687",
    "tt0015758",
    "tt0200457",
    "tt0016550",
    "tt0017918",
    "tt0018037",
    "tt0015310"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.374Z"
}