{
  "movieId": "tt0007809",
  "title": "Clubs Are Trump",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/clubs-are-trump-1917-directed-by-hal-roach-watermarked",
      "id": "clubs-are-trump-1917-directed-by-hal-roach-watermarked",
      "title": "Clubs Are Trump (1917) Directed By Hal Roach",
      "description": "Clubs Are Trump Directed by Hal Roach Written by H.M. Walker Produced by Hal Roach Starring Harold Lloyd Release date November 18, 1917 Country United States Languages Silent English intertitles Clubs Are Trump is a 1917 American short comedy film featuring Harold Lloyd . [ 1 ] Plot Harold Lloyd and Snub Pollard are \"two famous lascars\" who annoy several wooing couples in a public park. Eventually their antics enrage a large suitor who violently tosses them into a shallow lake. Lloyd and Pollard emerge from the lake and fall asleep on a park bench where they simultaneously dream of living in caveman times. While there, they try to woo a royal harem and run afoul of the caveman king and his club-swinging minions. Lloyd and Pollard divert their pursuers into a pond where a crocodile resides and have the harem to themselves. As they embrace the females, they both wake up on the park bench embracing each other. A park policeman breaks up their embrace. Lloyd and Snub eventually trap the policemen in the crook of a low tree, but are soon on the run from dozens more officers of the law. Cast Harold Lloyd as The Boy Snub Pollard Bebe Daniels Gilbert Pratt Fred C. Newmeyer Billy Fay Bud Jamison Charles Stevenson (as Charles E. Stevenson) Sammy Brooks David Voorhees Virginia Baynes Ruth Rowan Grace McLernon Ruth Churchill References 1 \"Progressive Silent Film List: Clubs Are Trump\" . Silent Era . Retrieved April 3, 2010 . From Wikipedia, the free encyclopedia",
      "fileSize": 502199685,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/clubs-are-trump-1917-directed-by-hal-roach-watermarked",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 100
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "25 min",
    "imdbRating": 5.2,
    "imdbVotes": 62,
    "Genre": "Comedy, Short",
    "Plot": "In pre-historic times (dream sequence), our hero, in a loin cloth, battles other cavemen over the opposite sex.",
    "Director": "Hal Roach",
    "Writer": "H.M. Walker",
    "Actors": "Harold Lloyd, 'Snub' Pollard, Bebe Daniels",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006963",
    "tt0010311",
    "tt0010656",
    "tt0009887",
    "tt0008860",
    "tt0009932",
    "tt0009973",
    "tt0009986",
    "tt0010006",
    "tt0010382",
    "tt0010508",
    "tt0010522"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.623Z"
}