{
  "imdbId": "tt0003167",
  "title": "Home, Sweet Home",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Home.Sweet.Home",
      "title": "Home, Sweet Home",
      "description": "John Howard Payne (Henry B. Walthall) leaves home and begins a career in the theater. Despite encouragement from his mother and his sweetheart (Lillian Gish), Payne begins to lead a life of dissolute habits, and this soon leads to ruin and misery. In deep despair, he thinks of better days, and writes a song that later provides inspiration to several others in their own times of need.",
      "id": "Home.Sweet.Home"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HomeSweetHome1914",
      "title": "\"Home, Sweet Home\" (1914) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Home, Sweet Home\" is a drama, included in our program to illustrate the work of two of our stars: actor Robert Harron and cinematographer Billy Bitzer.  In order to appreciate this film the viewers should know that it consists of four independent stories with their own different plots and casts of actors. The four shorts are apparently united by a common theme. Directed by               D. W. Griffith Produced by             Reliance Motion Picture Corporation and Majestic Motion Picture Company Scenario by               D. W. Griffith and Harry E. Aitken         Starring                     Robert Harron, Mae Marsh, Henry Walthall, Josephine Crowell, Lillian Gish, Dorothy Gish,  Donald Crisp, James Kirkwood, Jack Pickford, Courtenay Foote, Blanche Sweet, Owen Moore Cinematography        Billy Bitzer Editing by                  James Smith and Rose Richtel Distributed by           Continental Feature Film Corporation (Mutual Film Corporation) Release date               May 17, 1914 Running time             55 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "HomeSweetHome1914"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HomeSweetHome720p1914",
      "title": "Home, Sweet Home",
      "description": "Title: Home, Sweet Home Summary: John Howard Payne at his most miserable point in life, writes a song which becomes popular and inspires other people at some point in their lives. Directed by: D.W. Griffith Actors: Production Company: Majestic Motion Picture Company Release Date: 17 May 1914 (USA) Aspect Ratio: 1.33 : 1 Over the protests of his mother and sweetheart, writer John Howard Payne leaves home seeking adventure. In England, he becomes involved with The Worldly Woman who rebukes him after he returns penniless from debtors' prison. He travels to France and then Tunis, where he dies, leaving only the song \"Home, Sweet Home\" as his legacy. In another story, Apple Pie Mary, a cook in a mining camp, loves a young man who goes East to marry a wealthy woman. He hears the song, however, and returns to Mary. The next story concerns a widow with three sons. When one son kills another over money, the grief-stricken widow wants to commit suicide, but she hears the song and decides to live for the sake of her third son. The final story involves a young wife who plans to leave her older husband for a younger man. As she hears the melody played by a violinist in another apartment, she decides to stay with her husband and the two raise a family. Finally, Payne is seen in a pit, imprisoned by Lust and Greed....",
      "id": "HomeSweetHome720p1914"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-home-sweet-home",
      "title": "Home, Sweet Home",
      "id": "silent-home-sweet-home"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "55 min",
    "imdbRating": "5.8",
    "imdbVotes": "274",
    "Genre": "Drama",
    "Plot": "Over the protests of his mother and sweetheart, writer John Howard Payne leaves home seeking adventure. In England, he becomes involved with The Worldly Woman who rebukes him after he returns penniless from debtors' prison. He travels to France and then Tunis, where he dies, leaving only the song \"Home, Sweet Home\" as his legacy. In another story, Apple Pie Mary, a cook in a mining camp, loves a young man who goes East to marry a wealthy woman. He hears the song, however, and returns to Mary. The next story concerns a widow with three sons. When one son kills another over money, the grief-stricken widow wants to commit suicide, but she hears the song and decides to live for the sake of her third son. The final story involves a young wife who plans to leave her older husband for a younger man. As she hears the melody played by a violinist in another apartment, she decides to stay with her husband and the two raise a family. Finally, Payne is seen in a pit, imprisoned by Lust and Greed. His sweetheart appears as an angel in the sky and Payne is finally free to join her because of the good that has resulted from \"Home, Sweet Home.\"",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith, H.E. Aitken",
    "Actors": "Henry B. Walthall, Josephine Crowell, Lillian Gish",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0004972",
      "title": "The Birth of a Nation",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "26,892",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004181",
      "title": "Judith of Bethulia",
      "year": 1914,
      "imdbRating": "6.2",
      "imdbVotes": "1,469",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003643",
      "title": "The Avenging Conscience: or 'Thou Shalt Not Kill'",
      "year": 1914,
      "imdbRating": "6.4",
      "imdbVotes": "1,502",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "625",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003516",
      "title": "The Wanderer",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "65",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003170",
      "title": "The Mothering Heart",
      "year": 1913,
      "imdbRating": "6.4",
      "imdbVotes": "849",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002381",
      "title": "The Musketeers of Pig Alley",
      "year": 1912,
      "imdbRating": "6.6",
      "imdbVotes": "2,540",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002082",
      "title": "The Burglar's Dilemma",
      "year": 1912,
      "imdbRating": "6.0",
      "imdbVotes": "429",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002121",
      "title": "A Cry for Help",
      "year": 1912,
      "imdbRating": "4.9",
      "imdbVotes": "49",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006864",
      "title": "Intolerance",
      "year": 1916,
      "imdbRating": "7.7",
      "imdbVotes": "17,618",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002212",
      "title": "The God Within",
      "year": 1912,
      "imdbRating": "5.6",
      "imdbVotes": "44",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002546",
      "title": "Two Daughters of Eve",
      "year": 1912,
      "imdbRating": "7.4",
      "imdbVotes": "27",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}