{
  "movieId": "tt0050699",
  "title": "Men in War",
  "year": 1957,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z2l3HemVezU",
      "id": "Z2l3HemVezU",
      "title": "Men in War (1957) Directed by Anthony Mann - The part of the military machine that bleeds !",
      "description": "Brothers in arms, enemies in chaos—war has no rules of engagement.\nLieutenant Benson and Sergeant Montana lead a small platoon of soldiers through hostile enemy territory during the Korean War, with orders to march to Hill 465 in hopes of finding relief.\n\nOriginal title: Men in War\n\nDirector: Anthony Mann\nWriters: Philip Yordan, Ben Maddow, Van Van Praag\nStars: Robert Ryan, Aldo Ray, Robert Keith\nGenres: Action, Drama, War\n\n\n00:00 Full Movie with subtitles\n01:35 Lieutenant Benson's platoon, isolated behind enemy lines, struggles to maintain communication.\n10:15 Sergeant Montana and a catatonic Colonel join Benson's unit, adding tension to the group's dynamics.\n25:30 Montana instinctively kills a surrendering enemy sniper, revealing a concealed weapon and justifying his actions.\n40:45 The platoon navigates a treacherous minefield, leading to Sergeant Lewis's tragic death.\n55:00 Montana captures a North Korean soldier who is subsequently used as bait, highlighting the harsh realities of war.\n1:10:15 The Colonel regains his senses, joins an assault on an enemy-held hill, and is killed in action.\n1:25:30 Montana and Benson destroy enemy fortifications using grenades and a flamethrower, showcasing their resilience.\n1:36:00 With reinforcements arriving, Benson solemnly calls the roll of his fallen men as Montana distributes medals to the dead.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:32:13.315Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Z2l3HemVezU/maxresdefault.webp",
      "duration": 6142,
      "language": "en",
      "year": 1957,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "AU",
          "ES",
          "GB",
          "IT",
          "PH"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "102 min",
    "imdbRating": 7.1,
    "imdbVotes": 3162,
    "Genre": "Action, Drama, War",
    "Plot": "In Korea, on 6 September 1950, Lieutenant Benson's platoon finds itself isolated in enemy-held territory after a retreat. Soon they are joined by Sergeant Montana, whose overriding concern is caring for his catatonic colonel. Benson and Montana can't stand each other, but together they must get the survivors to Hill 465, where they hope the division is waiting. It's a long, harrowing march, fraught with all the dangers the elusive enemy can summon. Who will survive?",
    "Director": "Anthony Mann",
    "Writer": "Philip Yordan, Ben Maddow, Van Van Praag",
    "Actors": "Robert Ryan, Aldo Ray, Robert Keith",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0048667",
    "tt0051666",
    "tt0050252",
    "tt0048966",
    "tt0052151",
    "tt0052415",
    "tt0052294",
    "tt0048593",
    "tt0043547",
    "tt0043137",
    "tt0059263",
    "tt0058085"
  ],
  "collections": [
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:32:41.751Z"
}