{
  "imdbId": "tt0033787",
  "title": "King of the Zombies",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/KingOfTheZombies",
      "title": "King of the Zombies",
      "description": "A plane flying to the Bahamas gets blown off course and crashes on the island of the mysterious Dr. Sangare. Jefferson Jackson (Mantan Moreland) tries to warn his fellow survivors that the island's haunted but they all soon learn there's more going on than they initially supposed... Find out more about this movie on its IMDB page .",
      "id": "KingOfTheZombies"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/KingOfTheZombies_201508",
      "title": "King Of The Zombies",
      "description": "This film has fallen into the Public Domain.",
      "id": "KingOfTheZombies_201508"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/King_of_the_Zombies",
      "title": "King of the Zombies",
      "description": "Three men in a plane searching the Caribbean for a missing admiral crash-land on an island where voodoo is practiced and zombies roam. They soon find a mansion occupied by a family of Austrian refugees, headed by Dr. Sangre. Dr. Sangre is up to no good, and when he learns of the men's mission they begin to disappear. Stars: Dick Purcell, Joan Woodbury, and Mantan Moreland IMDb Page Wikipedia Page The 688MB MPEG4 file was derived from the 3.1GB MPEG2 found on this page to provide a smaller, quality copy for downloading.",
      "id": "King_of_the_Zombies"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xs4ApsGryPo",
      "title": "King of the Zombies (1941) [Horror]",
      "description": "During World War II, a Capelis XC-12 plane somewhere over the Caribbean runs low on fuel and is blown off course by a storm. Guided by a faint radio signal, they crash-land on an island. The passenger, his manservant and the pilot take refuge in a mansion owned by a doctor. The quick-witted yet easily-frightened manservant (Mantan Moreland) soon becomes convinced the mansion is haunted by zombies, and confirms this with some of the doctor's hired help. Exploring, the three stumble upon a voodoo ritual being conducted in the cellar, where the doctor, who is in reality a foreign spy, is trying to acquire war intelligence from a captured US Admiral whose plane had crashed in a similar fashion on the island. But the interruption causes the zombies to turn on their master.\n\n---\n\nDirected by Jean Yarbrough, produced Lindsley Parsons, written by Edmond Kelso, starring Dick Purcell as James \"Mac\" McCarthy, Joan Woodbury as Barbara Winslow, Mantan Moreland as Jefferson \"Jeff\" Jackson, Henry Victor as Dr. Miklos Sangre, John Archer as Bill Summers, Patricia Stacey as Alyce Sangre, Guy Usher as Admiral Arthur Wainwright, Marguerite Whitten as Samantha (the Maid), Leigh Whipper as Momba (the Butler), Madame Sul-Te-Wan as Tahama (the Cook and High Priestess), James Davis as Lazarus (a Zombie) and Laurence Criner as Dr. Couillie. \n\n---\n\nSource: \"King of the Zombies\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 8 April 2013. Web. 20 April 2013. http://en.wikipedia.org/wiki/King_of_the_Zombies.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "xs4ApsGryPo",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q8M3w0oEWDA",
      "title": "King of the Zombies (1941) | Colorized Public Domain Horror Comedy Classic with Mantan Moreland",
      "description": "King of the Zombies (1941) is an American horror comedy film directed by Jean Yarbrough and produced by Monogram Pictures. Combining spooky atmosphere, voodoo lore, and lighthearted humor, this early zombie-themed movie became a cult favorite for its unique blend of scares and laughs. This restored and colorized edition brings new life to the eerie yet comedic tone of the film, making it more engaging for today’s audiences in the United States, Europe, and around the world.\n\nPlot Summary:\nSet during World War II, the story begins when a plane carrying pilot James “Mac” McCarthy (Dick Purcell), his passenger Bill Summers (John Archer), and comedic valet Jeff Jackson (Mantan Moreland) crashes on a remote island in the Caribbean. Seeking shelter, they stumble upon a mysterious mansion owned by Dr. Miklos Sangre (Henry Victor), a sinister scientist rumored to be involved in espionage and the occult.\n\nAs the stranded men explore the mansion, they uncover Sangre’s dark secret: he is using voodoo rituals to create zombies, enslaving the dead to do his bidding. While the situation grows increasingly dangerous, Jeff provides comic relief with his witty one-liners and hilarious reactions to the terrifying events. The blend of supernatural horror and comedy builds toward a thrilling climax where the truth about Sangre and his experiments is revealed.\n\nCast and Crew:\n• Director: Jean Yarbrough\n• Producer: Lindsley Parsons\n• Screenplay: Edmond Kelso\n• Cinematography: Mack Stengler\n\nStarring:\n• Dick Purcell as James “Mac” McCarthy\n• Joan Woodbury as Barbara Winslow\n• Mantan Moreland as Jefferson “Jeff” Jackson\n• Henry Victor as Dr. Miklos Sangre\n• John Archer as Bill Summers\n• Patricia Stacey as Alyce Sangre\n\nFilm Significance:\nKing of the Zombies is notable for being among the earliest zombie comedies in American cinema, released decades before the zombie craze popularized by George A. Romero. While the film portrays voodoo-inspired zombies rather than the flesh-eating undead seen in modern horror, it helped establish early tropes of zombie lore in Hollywood.\n\nMantan Moreland’s performance as Jeff Jackson is a highlight of the film. Known for his impeccable comedic timing, Moreland became one of the most popular African-American comedians of the 1940s, and his role here is often cited as one of his most memorable. The film’s balance of suspense and comedy, combined with a wartime espionage subplot, makes it a fascinating cultural artifact from the early 1940s.\n\nThe film’s atmosphere—dark mansions, eerie chanting, and mysterious island settings—reflects the era’s fascination with exoticism and supernatural thrills. Despite its low budget, King of the Zombies effectively blends horror and humor, securing its place as a cult classic in the public domain.\n\nEnhanced Public Domain Explanation:\nKing of the Zombies (1941) is part of the public domain, meaning it is free from copyright restrictions and can be preserved, restored, and shared worldwide. At Colorized Public Domain, we specialize in reviving such classics through digital cleaning and careful colorization. By adding color to the shadowy sets, eerie rituals, and Caribbean island atmosphere, this version enhances the film’s spooky charm and helps connect modern viewers to a film that might otherwise be overlooked in black-and-white.\n\nWhy Watch This Colorized Edition:\nOriginally shot in black and white, King of the Zombies relied heavily on lighting and shadows to create atmosphere. The colorized edition amplifies its unique mood, making the creepy mansion, voodoo ceremonies, and zombie figures more immersive for modern audiences. By combining historical preservation with visual enhancement, this version provides both the authenticity of 1940s horror and the accessibility of contemporary presentation.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more restored and colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nAt Colorized Public Domain, we restore and enhance horror, mystery, comedy, and classic genre films from Hollywood’s Golden Age. Our mission is to preserve these timeless works and introduce them to new generations of viewers across the USA, Europe, and beyond.\n\n#KingOfTheZombies1941 #MantanMoreland #ClassicHorrorComedy #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #ZombieMovieHistory #FilmRestoration #1940sMovies #CultClassicHorror",
      "id": "q8M3w0oEWDA",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=N8NM7LOng44",
      "title": "King Of The Zombies (1941) MANTAN MORELAND ♣ JOAN WOODBURY",
      "description": "Stars: Dick Purcell, Joan Woodbury, Mantan Moreland\nDirector: Jean Yarbrough\n\nOn a spooky island, three stranded travelers find an evil doctor working with foreign spies and in control of zombies.",
      "id": "N8NM7LOng44",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "67 min",
    "imdbRating": "5.2",
    "imdbVotes": "2,578",
    "Genre": "Adventure, Comedy, Horror",
    "Plot": "Pilot James \"Mac\" McCarthy goes off course somewhere between Cuba and Puerto Rico and is unable to pick up any radio transmissions. When he and his passengers, Bill Summers and his black valet, Jefferson Jackson, hear a lone transmission in a foreign language, they crash land the plane on the island below. The lost men discover themselves in a graveyard, and follow the sound of drums to a nearby mansion. There they are greeted by Viennese Dr. Sangre, who treats Mac's minor head wound with the warning that untreated injuries are easy prey for evil spirits. Sangre says there are no radios on the island and allows the men to spend the night as his guests, although he insists that Jeff stay in the servants quarters in the basement. Jeff becomes alarmed when the maid, Samantha, and the cook, Tahama, call forth two \"zombies,\" but when he runs upstairs to tell his boss, Sangre dismisses the idea as ludicrous. Sangre's wife Alyce also appears to be in a trance-like state, which Sangre attributes to jungle fever. Sangre appears surprised when Bill tells him about American Admiral Wainwright, whose plane disappeared in the same location. Sangre then tells the men that no one in his family, which includes his beautiful niece, Barbara Winslow, can leave the island because they are Austrian refugees lacking passports. Later that night, Jeff confides in Samantha that Bill is a government agent on a secret mission. Sangre's butler, Momba, Samantha and Tahama leave Jeff alone in the kitchen just before midnight, with the admonition not to pay notice to anything unusual. When two zombies nearly attack Jeff, he runs to Bill and Mac's room for safety. Jeff is later awakened by the appearance of a woman who seems to come and go through a wall, and when he awakens Bill and Mac, they believe him only after finding an earring. The three men split up to search the house, and Bill finds Barbara in the library reading a book on hypnotism. Barbara says that she is reading the book to help her aunt, who has been in the trance-like state since arriving at the island, and Bill confides his belief that Sangre is hiding a radio. Bill and Mac finally believe Jeff's stories about zombies after Mac is attacked by one. The next morning, Mac and Bill discover a freshly dug grave in the cemetery, and that someone has stolen the plane's radio. Mac goes in search of a generator, while Bill returns to the house, unaware that the admiral is being held hostage in a cellar and that Tahama is trying to pry military secrets from him with the use of voodoo. After Sangre calls in a report to his German allies, Mac disappears. Sangre then lures Jeff into the cellar, where he hypnotizes him into believing that he is a zombie. While Bill is searching for Mac, he finds Barbara using hypnotism on her aunt, and assumes that she is collaborating with Sangre, despite her protests that she is trying to restore her aunt's memory. Mac returns in a zombie-like state, and a physician called by Sangre says that he has been dead for hours. When Momba receives orders by radio for Sangre to transmit the stolen military information, he and Tahama prepare a special ceremony to wrest the information from the admiral. Jeff lines up with the other zombies for dinner, but Samantha breaks his spell. Jeff then meets with Bill and moments later, they hear a woman's scream and find Alyce dead. Bill and Jeff follow the sound of drums into the cellar, where Sangre is holding a ceremony during which the admiral's thoughts are to be transmitted into Barbara's brain. Bill breaks up the ceremony and when Sangre orders the zombies to attack Bill, they instead follow Mac, and turn on Sangre. Sangre shoots Mac and, while backing away from the zombies, falls to his death into a firepit. After Wainwright phones the Coast Guard, and Mac's injuries are treated, Wainwright tells Bill that Sangre forced his plane to land with a false radio signal, then killed his crew and tortured him for Canal Zone fortification plans. When his torture did not work, he used Alyce and Barbara as test subjects with other methods.",
    "Director": "Jean Yarbrough",
    "Writer": "Edmond Kelso",
    "Actors": "Dick Purcell, Joan Woodbury, Mantan Moreland",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0035028",
      "title": "Man from Headquarters",
      "year": 1942,
      "imdbRating": "5.8",
      "imdbVotes": "102",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033646",
      "title": "The Gang's All Here",
      "year": 1941,
      "imdbRating": "5.4",
      "imdbVotes": "228",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034968",
      "title": "Law of the Jungle",
      "year": 1942,
      "imdbRating": "5.0",
      "imdbVotes": "245",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034754",
      "title": "Freckles Comes Home",
      "year": 1942,
      "imdbRating": "4.9",
      "imdbVotes": "203",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038621",
      "title": "House of Horrors",
      "year": 1946,
      "imdbRating": "6.1",
      "imdbVotes": "1,351",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033827",
      "title": "Let's Go Collegiate",
      "year": 1941,
      "imdbRating": "5.0",
      "imdbVotes": "185",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035051",
      "title": "So's Your Aunt Emma!",
      "year": 1942,
      "imdbRating": "5.8",
      "imdbVotes": "258",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0032390",
      "title": "The Devil Bat",
      "year": 1940,
      "imdbRating": "5.4",
      "imdbVotes": "3,607",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034009",
      "title": "Pedro soll hängen",
      "year": 1941,
      "imdbRating": "4.2",
      "imdbVotes": "25",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032511",
      "title": "Gasbags",
      "year": 1941,
      "imdbRating": "5.4",
      "imdbVotes": "182",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034831",
      "title": "Harvard, Here I Come!",
      "year": 1941,
      "imdbRating": "5.4",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034089",
      "title": "Reg'lar Fellers",
      "year": 1941,
      "imdbRating": "5.2",
      "imdbVotes": "80",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:30.622Z"
}