{
  "imdbId": "tt0009611",
  "title": "Shoulder Arms",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shoulder-arms-1918",
      "title": "Shoulder Arms (1918)",
      "description": "Shoulder Arms is Charlie Chaplin’s second film for First National Pictures. Released in 1918, it is a silent comedy film set in France during World War I, the first of three films he made on the subject of war. It co-starred Edna Purviance and Sydney Chaplin, Chaplin’s elder brother. In this film, Chaplin is never in his Little Tramp outfit. Watch on RetroFlix.org:  https://retroflix.org/shoulder-arms-1918/",
      "id": "shoulder-arms-1918"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shoulder-arms-1918-directed-by-charlie-chaplin",
      "title": "Shoulder Arms (1918) Directed By Charlie Chaplin",
      "description": "Shoulder Arms Theatrical poster Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Charlie Chaplin Starring Edna Purviance Sydney Chaplin Cinematography Roland Totheroh Edited by Charlie Chaplin Distributed by First National Pictures Release date October 20, 1918 Running time 36 minutes Country United States Language Silent (English intertitles ) Box office $700,000-$1 million [ 1 ] Shoulder Arms is Charlie Chaplin 's second film for First National Pictures . Released in 1918 , it is a silent comedy film set in France during World War I , the first of three films he made on the subject of war. [ 2 ] It co-starred Edna Purviance and Sydney Chaplin , Chaplin's elder brother. In this film, Chaplin is never in his Little Tramp outfit. Plot Some time during World War I , Doughboy ( Charlie Chaplin ) begins his service in the war amongst \"the awkward squad\" a group of American soldiers. [ 3 ] He is bow-legged, unbalanced, and uncoordinated during bootcamp in contrast to the other soldiers who all have excellent coordination. He does move on to the front in France though, amongst the shells and trenches, and bunks amongst comrades ( Sydney Chaplin ). Doughboy is charged with guard duty and begins daydreaming of bars, cities, and home before being dismissed back to his bunk. News/mail for soldiers is brought out for the soldiers, but there is nothing for Doughboy. Though his fellow soldiers offer him food from their mail he refuses and walks out to find there is a package for him; Limburger cheese and incredibly hard crackers. Due to the pungent smell of the cheese, he decides to throw it over the trench, hitting the Germans, rather than eat it. Later, Doughboy struggles to sleep in waist high water, with his comrades all sleeping with no particular trouble in the conditions. In the morning, they are given the order to advance over the top. After hyping himself up against a backdrop of exploding artillery, Doughboy somewhat reluctantly goes over and manages to capture the enemy trench and 13 German troops the same as his identification number. Doughboy becomes much more confident after these events, and is no longer frazzled by the artillery or scared to take shots over the trench. Doughboy volunteers for a secret mission and is advised that he may not return. His mission is to infiltrate enemy lines, disguised as a tree. When one of his comrades is captured spying on the enemy, Doughboy helps him to escape and is chased by a large German soldier ( Henry Bergman ) into the woods. Losing his tree disguise he is able to escape to a bombed out building wherein he meets a French girl ( Edna Purviance ) who tends to his wounds. Shortly after meeting, the large German soldier finds them. Both the French girl and Doughboy run, however the French girl is caught and arrested for aiding the Allies. Before the French girl is assaulted by a German soldier, Doughboy manages to save her. Then the Kaiser shows up and Doughboy, disguised as a German officer, saves his comrade from capture again. All three of them now disguised as German officers chauffeur the Kaiser and his allies towards the Allied front. At the front they are greeted with applause and praise from the Allied troops. Doughboy then wakes up back at bootcamp, revealing all was his dream. Credited cast Charlie Chaplin as Charlie, the Doughboy Edna Purviance as French girl Sydney Chaplin as The sergeant, Charlie's Comrade / The Kaiser Jack Wilson as German Crown Prince Henry Bergman as Fat German sergeant / Field Marshal von Hindenburg / Bartender Albert Austin as American Officer / Clean Shaven German Soldier / Bearded German Soldier Tom Wilson as Dumb German Wood-Cutter John Rand as U.S. soldier J. Parks Jones as U.S. soldier (credited as Park Jones) Loyal Underwood as Small German officer W.J. Allen as Motorcyclist L.A. Blaisdell as Motorcyclist Wellington Cross as Motorcyclist C.L. Dice as Motorcyclist G.A. Godfrey as Motorcyclist W. Herron as Motorcyclist Reception Shoulder Arms proved to be Chaplin's most popular film, critically and commercially, up to that point. A review in the October 21, 1918 New York Times was typical: \"'The fool's funny,' was the chuckling observation of one of those who saw Charlie Chaplin's new film. Shoulder Arms , at the Strand yesterday—and, apparently, that's the way everybody felt. There have been learned discussions as to whether Chaplin's comedy is low or high, artistic or crude, but no one can deny that when he impersonates a screen fool he is funny. Most of those who go to find fault with him remain to laugh. They may still find fault, but they will keep on laughing.\" The film was very revolutionary for its time, introducing a new genre of comedy. Previously, films had treated war as a serious subject. This is believed to be the first comedy film about war. [ 4 ] References 1  \"Happy New Year\" . Variety . 27 December 1918. p. 11 . Retrieved 9 August 2024 . 2 Wes D. Gehring (2014). Chaplin's War Trilogy: An Evolving Lens in Three Dark Comedies, 1918-1947 . McFarland, Incorporated, Publishers. p. 49. ISBN   9781476616308 . 3 Gerald Mast (1979). The comic mind: comedy and the movies . University of Chicago Press. p. 89. ISBN   9780226509785 . 4 Flom, Eric L. (July 11, 2015). Chaplin in the Sound Era: An Analysis of the Seven Talkies (reprint ed.). McFarland. p. 25. ISBN   978-1476607986 . Retrieved February 23, 2021 .",
      "id": "shoulder-arms-1918-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shoulderarms4k",
      "title": "Shoulder Arms (1918) [Colorized, 4K, 60FPS]",
      "description": "Shoulder Arms is a 1918 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io A.I. Upscaling to 4K:  https://ffmpeg.org GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "shoulderarms4k"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "36 min",
    "imdbRating": "7.3",
    "imdbVotes": "7,583",
    "Genre": "Short, Comedy, War",
    "Plot": "Charlie is in boot camp in the \"awkward squad.\" Once in France he gets no letters from home. He finally gets a package containing limburger cheese which requires a gas mask and which he throws over into the German trench. He goes \"over the top\" and captures thirteen Germans (\"I surrounded them\"), then volunteers to wander through the German lines disguised as a tree trunk. With the help of a French girl he captures the Kaiser and the Crown Prince and is given a statue and victory parade in New York and then ... fellow soldiers wake him from his dream.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Edna Purviance, Syd Chaplin",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0008907",
      "title": "The Bond",
      "year": 1918,
      "imdbRating": "5.4",
      "imdbVotes": "1,213",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009018",
      "title": "A Dog's Life",
      "year": 1918,
      "imdbRating": "7.6",
      "imdbVotes": "10,161",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008133",
      "title": "The Immigrant",
      "year": 1917,
      "imdbRating": "7.5",
      "imdbVotes": "9,530",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007613",
      "title": "The Adventurer",
      "year": 1917,
      "imdbRating": "7.3",
      "imdbVotes": "4,613",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007832",
      "title": "The Cure",
      "year": 1917,
      "imdbRating": "7.1",
      "imdbVotes": "3,960",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007880",
      "title": "Easy Street",
      "year": 1917,
      "imdbRating": "7.4",
      "imdbVotes": "5,934",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010747",
      "title": "Sunnyside",
      "year": 1919,
      "imdbRating": "6.6",
      "imdbVotes": "3,404",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007194",
      "title": "Police",
      "year": 1916,
      "imdbRating": "6.4",
      "imdbVotes": "2,047",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006684",
      "title": "The Fireman",
      "year": 1916,
      "imdbRating": "6.5",
      "imdbVotes": "3,032",
      "language": "English, None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006548",
      "title": "The Count",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,527",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006689",
      "title": "The Floorwalker",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,839",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:09:54.038Z"
}