{
  "imdbId": "tt0006751",
  "title": "The Habit of Happiness",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-movie_20201213",
      "id": "my-movie_20201213",
      "title": "\"The Habit of Happiness\" (1916) starring Douglas Fairbanks",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Habit of Happiness\" is a comedy. A cheerful fellow teaches gloomy old men how to laugh and be happy. Directed by                Allan Dwan Produced by              Fine Arts Film Company Scenario by                Allan Dwan, Shannon Fife          Starring                     Douglas Fairbanks, George Fawcett, Macey Harlam, Dorothy West, George Backus Cinematography        Victor Fleming Distributed by           Triangle Distributing Release date               March 12, 1916 Running time             37 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"",
      "fileSize": 694423075,
      "addedAt": "2026-01-07T00:09:54.333Z",
      "thumbnail": "https://archive.org/services/img/my-movie_20201213",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 3629
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "50 min",
    "imdbRating": 5.8,
    "imdbVotes": 72,
    "Genre": "Comedy",
    "Plot": "Sunny Wiggins is regarded as worthless by the other members of his family, who have risen to the social station where they are snubbed by the best people. The morning of the day the play begins his sister is preparing to entertain a party of butterflies, among whom is the mentally lacking beanpole she intends to marry. Sunny is in bed with as queer a lot of associates as could be collected. He has recruited his following from the bread line; two of them are in bed with him while the others are sleeping on the carpet, and one has even gone to rest in the bathtub. Not too willingly do all hands go to the shower, but it is a wash or no breakfast. Downstairs goes the motley array and into the dining room. Sunny thinks it fine that such a spread has been prepared for his guests and there is little left when sister enters with her guests. Of course, Sis at once tells father and Sunny is called to book. Dismissing his own guests, he finds that he has only one friend in the place, one of his sister's guests, and he doesn't know her name. She thinks Sunny is splendid and when his father has sent him out to try his sociological theories along the Bowery, she wishes him luck. There in a cheap lodging house Sunny teaches the derelicts to laugh, and with such success that an eminent specialist drafts him to cure a millionaire grouch of dyspepsia. In the rich home of the dyspeptic he finds that the girl is the millionaire's daughter. She enters heartily into his plans but an aged 'cellist, whose favorite music is Chopin's \"Funeral March,\" exerts more influence in the household than he. But when father has discovered his daughter and the supposed physician in fond embrace there is a fight, which ends with father a prisoner in his room, to be cured by starvation. Meanwhile a broker, whose offer of marriage has been refused by the daughter, is plotting to ruin her father in Wall Street. How Sunny thwarts the attempt, cures the grouch, becomes his son-in-law and partner and thereby is reinstated in the good graces of his own family, is the story this comedy tells.",
    "Director": "Allan Dwan",
    "Writer": "Allan Dwan, Shannon Fife",
    "Actors": "Douglas Fairbanks, George Fawcett, Macey Harlam",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0007031",
    "tt0008309",
    "tt0009142",
    "tt0006736",
    "tt0010162",
    "tt0006357",
    "tt0006688",
    "tt0006809",
    "tt0031387",
    "tt0007108",
    "tt0015116",
    "tt0007047"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.333Z"
}