{
  "imdbId": "tt0000498",
  "title": "Rescued by Rover",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rescued-by-rover-1905-directed-by-cecil-m.-hepworth-lewin-fitzhamon",
      "id": "rescued-by-rover-1905-directed-by-cecil-m.-hepworth-lewin-fitzhamon",
      "title": "Rescued By Rover (1905) Directed By Cecil M. Hepworth, Lewin Fitzhamon",
      "description": "Rescued by Rover (1905) Director: Cecil M. Hepworth, Lewin Fitzhamon Rescued by Rover is a 1905 British short silent drama film, directed by Lewin Fitzhamon, about a dog who leads its master to his kidnapped baby, which was the first to feature the Hepworth's family dog Blair in a starring role; following the release, the dog became a household name and he is considered to be the first dog film star. The film, which according to Michael Brooke of BFI Screenonline, \"marks a key stage in the medium's development from an amusing novelty to the seventh art,\" and, \"possibly the only point in film history when British cinema unquestionably led the world,\" was an advance in filming techniques, editing, production and story telling. Four hundred prints were sold, so many that the negatives wore out twice, requiring the film to be re-shot each time. Two professional actors were paid to appear, and the film is cited as the first film to have used paid actors. The style of shooting and editing would bridge the gap between the styles of directors Edwin Stanton Porter and D. W. Griffith,[4] and prints have been preserved in both the United States and the United Kingdom. Production: Rescued by Rover was predominantly a family affair – Cecil Hepworth's wife, Margaret, wrote the scenario and played the role of the mother on screen. Hepworth himself directed, painted the scenery and acted as the father. Their child was the baby on screen, and the part of Rover was played by the family dog, Blair. Two professional actors were paid to appear, Sebastian Smith as the soldier, and his wife Lindsay Gray as the old woman who stole the baby. The two actors were paid half a guinea each; Hepworth would recall \"We couldn't get them for less\". The film is often cited as the first film to have used paid actors.[10] Completing the cast was May Clark, who had previously played Alice in Hepworth's version of Alice in Wonderland, as the child's nurse. Clark was also the cutting room assistant. The movie was so successful that Hepworth had to re-shoot the entire film twice. The first two negatives wore out in meeting the demand for prints. Release: Rescued by Rover is often considered to be the United Kingdom's first major fiction film.Released in 1905,some four hundred prints were sold at a price of £8 each, and they circulated for at least four or five years. The character of Rover the dog, played by Hepworth's family dog Blair, became a household name and is considered the world's first canine film star. This first appearance of a dog in a narrative based film caused the uncommon name of Rover to become popular for dogs. -From Wikipedia",
      "fileSize": 144555234,
      "addedAt": "2026-01-07T00:10:30.754Z",
      "thumbnail": "https://archive.org/services/img/rescued-by-rover-1905-directed-by-cecil-m.-hepworth-lewin-fitzhamon",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 128
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-rescued-by-rover",
      "id": "silent-rescued-by-rover",
      "title": "Rescued by Rover",
      "fileSize": 113245089,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-rescued-by-rover",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 644
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "7 min",
    "imdbRating": 6.6,
    "imdbVotes": 1295,
    "Genre": "Short, Crime, Drama",
    "Plot": "Rescued by Rover is a film about a dog. Not only is it a film about a dog it is also a film about the kidnaping of a young baby by an old woman. With these two classical Hollywood ingredients and some stunning dialogue, (It's silent!), Rescued by Rover really hits a nerve. The repeated shots provide some interest in what, surprisingly, is an entertaining example of early cinema, canine heroics and a man wearing mascara.",
    "Director": "Lewin Fitzhamon, Cecil M. Hepworth",
    "Writer": "Mrs. Hepworth",
    "Actors": "Blair, May Clark, Barbara Hepworth",
    "Language": "None",
    "Country": "United Kingdom",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0233823",
    "tt0000519",
    "tt0445338",
    "tt0132077",
    "tt0000728",
    "tt0000832",
    "tt0000942",
    "tt0000831",
    "tt0002381",
    "tt0233391",
    "tt0234029",
    "tt0001789"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}