{
  "imdbId": "tt0030138",
  "title": "Flash Gordon's Trip to Mars",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/flash-gordons-trip-to-mars-chapter-10",
      "id": "flash-gordons-trip-to-mars-chapter-10",
      "title": "Flash Gordon's Trip to Mars - Chapter 10 (1938) colorized",
      "description": "Flash Gordon's Trip to Mars (1938) Universal Pictures Chapter 10 \"Incense of Forgetfulness\" AI colorized and image enhanced, mostly by Iain Petrie. Flash, Dale, and Dr. Zarkov return from their former space adventures only to find that their enemy, Ming the Merciless of planet Mongo, has a new weapon: a deadly ray that crosses space to wreak havoc on earth. Earth's only hope is for our heroes to take off again and stop the ray at its source on Mars, where they (and a stowaway) must battle Ming's ally, Queen Azura, who turns her enemies into lumpish clay people. Buster Crabbe as Flash Gordon Jean Rogers as Dale Arden Charles Middleton as Emperor Ming Frank Shannon as Dr. Alexis Zarkov Beatrice Roberts as Queen Azura Donald Kerr as Happy Hapgood Richard Alexander as Prince Barin",
      "fileSize": 147961172,
      "addedAt": "2026-01-07T00:08:24.396Z",
      "thumbnail": "https://archive.org/services/img/flash-gordons-trip-to-mars-chapter-10",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 3704
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "299 min",
    "imdbRating": 6.9,
    "imdbVotes": 1106,
    "Genre": "Action, Adventure, Family",
    "Plot": "Flash, Dale, and Dr. Zarkov return from their former space adventures only to find that their enemy, Ming the Merciless of planet Mongo, has a new weapon: a deadly ray that crosses space to wreak havoc on earth. Earth's only hope is for our heroes to take off again and stop the ray at its source on Mars, where they (and a stowaway) must battle Ming's ally, Queen Azura, who turns her enemies into lumpish clay people. Can they survive 15 chapters of deadly perils? Find out next week...",
    "Director": "Ford Beebe, Robert F. Hill, Frederick Stephani",
    "Writer": "Ray Trampe, Norman S. Hall, Wyndham Gittens",
    "Actors": "Buster Crabbe, Jean Rogers, Charles Middleton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027623",
    "tt0032475",
    "tt0030832",
    "tt0029081",
    "tt0033317",
    "tt0034928",
    "tt0057197",
    "tt0029847",
    "tt0029952",
    "tt0030650",
    "tt0012752",
    "tt0029898"
  ],
  "collections": [],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:08:24.396Z"
}