{
  "movieId": "tt0055478",
  "title": "Stark Fear",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Stark_Fear_1962",
      "id": "Stark_Fear_1962",
      "title": "Stark Fear",
      "description": "\"Did you ever see a woman with her nose cut off?\"",
      "fileSize": 1524536306,
      "addedAt": "2026-01-07T00:06:51.870Z",
      "thumbnail": "https://archive.org/services/img/Stark_Fear_1962",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 13007
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZR3BMDsqJjA",
      "id": "ZR3BMDsqJjA",
      "title": "Stark Fear (1962) | Colorized Public Domain Thriller with Beverly Garland and Skip Homeier",
      "description": "Stark Fear (1962) is an American independent psychological thriller directed by Ned Hockman and produced by Dwight V. Swain. Known for its raw portrayal of emotional abuse, suspense, and rural American settings, the film has developed a reputation as a hidden gem in the public domain library of early 1960s thrillers. This colorized and restored edition revitalizes the story, making it more accessible to modern audiences in the United States, Europe, and beyond, while preserving its gritty authenticity.\n\nPlot Summary:\nThe film follows Ellen Winslow (Beverly Garland), a devoted and hardworking wife trapped in a toxic and abusive marriage with her controlling husband, Gerald Winslow (Skip Homeier). Gerald is manipulative, cruel, and relentlessly oppressive, using intimidation and psychological torment to keep Ellen under his control.\n\nEllen’s life takes a dramatic turn when she meets Cliff Kane (Kenneth Tobey), a kind and supportive man who offers her both understanding and the possibility of escape. As Ellen begins to regain her sense of hope and independence, Gerald becomes increasingly paranoid and violent, determined to crush her spirit and prevent her from leaving.\n\nThe story escalates into a tense psychological battle, where Ellen must summon inner strength to confront not only her husband’s cruelty but also her own fears of breaking free. The suspense builds toward a climax that explores themes of courage, survival, and the fight for personal dignity in the face of relentless oppression.\n\nCast and Crew:\n• Director: Ned Hockman\n• Producer: Dwight V. Swain\n• Screenplay: Dwight V. Swain\n• Cinematography: Gerald Hirschfeld\n• Editing: Donn Cambern\n\nStarring:\n• Beverly Garland as Ellen Winslow\n• Skip Homeier as Gerald Winslow\n• Kenneth Tobey as Cliff Kane\n• Hannah Stone as Wilma\n• Peter Jennings as Minor Role\n\nFilm Significance:\nWhile not a mainstream studio release, Stark Fear stands out for its willingness to address marital abuse and psychological manipulation, subjects rarely tackled directly in early 1960s American cinema. Beverly Garland delivers a powerful and empathetic performance as a woman struggling to reclaim her freedom, while Skip Homeier’s portrayal of Gerald provides a chilling look at toxic masculinity.\n\nThe film is notable for its low-budget, independent production qualities that add to its raw authenticity. Gerald Hirschfeld’s cinematography, combined with Donn Cambern’s editing, heightens the sense of unease and realism. For film historians, the movie reflects the cultural tensions of early 1960s America, where domestic issues were beginning to surface in popular media but often disguised within genre filmmaking.\n\nStark Fear has since gained interest among fans of cult cinema, psychological thrillers, and public domain discoveries. Its thematic boldness, combined with the performances of Garland and Homeier, ensures its relevance as both entertainment and a social commentary of its time.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Stark Fear remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1962 release was filmed in black and white, a practical choice for many independent productions of the era. While historically accurate, black-and-white presentation often deters casual modern viewers. By offering a colorized version, we adapt the film to contemporary viewing habits while preserving its original intensity and atmosphere. This edition allows today’s audiences — particularly in the USA and Europe — to experience the raw suspense and emotional depth of Stark Fear with new vibrancy and accessibility.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood and beyond — including thrillers, noir mysteries, dramas, and forgotten cult classics. Our mission is to ensure these films remain discoverable, enjoyable, and preserved for worldwide audiences.\n\n#StarkFear #BeverlyGarland #SkipHomeier #KennethTobey #1960sThriller #PublicDomainMovie #ColorizedClassic #PsychologicalThriller #ClassicHollywood #FilmRestoration",
      "addedAt": "2025-12-24T00:47:16.928Z",
      "thumbnail": "https://i.ytimg.com/vi/ZR3BMDsqJjA/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBYKEkwDw==&rs=AOn4CLDWOFlK9lkRmqsGcpi0bcg7Mtqwyw",
      "duration": 5030,
      "language": "en",
      "year": 1962,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "86 min",
    "imdbRating": 5.5,
    "imdbVotes": 502,
    "Genre": "Drama, Horror, Thriller",
    "Plot": "\"Stark Fear\" is the story of Ellen Winslow, who hungers for affection but finds herself chained to a hate-warped husband Gerald. Ellen gets a job, which is more than George seems to be able to do, but he disappears in a jealous rage, but Ellen's sense of loyalty and duty won't let her abandon him, so she goes looking for him in his home town. Gerald attacks her anew, and she is subjected to painful humiliation and abuse by Gerald's best friend, lecherous old Harvey Suggett, at a Comanche tribal dance. The hidden Gerald watches with sadistic delight. Ellen buries herself in her work, to forget her anguish, and falls in love with her employer, Cliff Kane, and they both take a business weekend at the \"Little Switzerland\" resort in Arkansas. Ellen tells Gerald that he is too emotionally warped for marriage and divorces him, and to prove she is wrong he tries to kill her.",
    "Director": "Ned Hockman, Skip Homeier",
    "Writer": "Dwight V. Swain",
    "Actors": "Beverly Garland, Skip Homeier, Kenneth Tobey",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0058283",
    "tt0058430",
    "tt0058620",
    "tt0059821",
    "tt0059646",
    "tt1149606",
    "tt2741564",
    "tt0079082",
    "tt0090197",
    "tt0036307",
    "tt0054807",
    "tt0082497"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.870Z"
}