{
  "movieId": "tt0010195",
  "title": "The Grim Game",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Grim_Game_1919_starring_Harry_Houdini",
      "id": "The_Grim_Game_1919_starring_Harry_Houdini",
      "title": "The_Grim_Game_(1919)_starring_Harry_Houdini",
      "description": "This is the famous and, as of 2011, only surviving excerpt from The Grim Game, a 1919 silent film starring the world renowned escape artist and magician Harry Houdini. Framed for murder and unjustly imprisoned, Harvey Hanford, played by Houdini, uses his powers of escape to flee prison and pursue those who set him up and hold his fiancee hostage. This scene, filmed in Santa Monica, California, calls for Hanford to transfer from one plane to another in mid-air in an attempt to rescue his fiancee from her kidnappers. The planned stunt, however, goes awry, resulting in a real life crash, when the two planes collide, become entangled and nose dive into an empty field as a third plane captures the event. Nobody is fatally injured, and, as the official story goes, the screenplay is rewritten to incorporate this accident, which Paramount Pictures subsequently exploits to sell the movie to the public, dubbing it the most dramatic moment ever âcaught on film,â and insisting that it is really Houdini attempting the mid-air exchange. In reality, the person filmed is his stunt double, Robert E. Kennedy, though some say it is stuntman and actor Monte Blue, while the famed magician is safely on the ground. Was this a legitimate accident or a hoax? Writing of this scene in February, 2011, screenwriter John Cox, widely regarded as an authority on Harry Houdini, states the crash just âas it occurred by accident in real lifeâ is actually written in the original script, including the use of â\"miniature planes falling to earth.ââ This, he suggests, may serve as âfresh fodder for conspiracy theorists.' Currently, the film is categorized as \"lost;\" in 2010, however, 2 new fragments of the film, each about 2 seconds long, surfaced; they may be viewed on Cox's website here: http://www.wildabouthoudini.com/2010/12/fresh-fragments-from-grim-game.html More information about The Grim Game is available at the links below: http://www.imdb.com/title/tt0010195/ http://en.wikipedia.org/wiki/The_Grim_Game http://www.wildabouthoudini.com/2011/02/ive-seen-grim-game.html (also contains movie stills and behind the scenes photos)",
      "fileSize": 65138242,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Grim_Game_1919_starring_Harry_Houdini",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 7474
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "71 min",
    "imdbRating": 6.7,
    "imdbVotes": 313,
    "Genre": "Adventure, Drama",
    "Plot": "Jailed unjustly for a murder he did not commit, a young man uses his amazing powers of escape to free himself and pursue the actual killers, who hold his fiancée captive.",
    "Director": "Irvin Willat",
    "Writer": "Arthur B. Reeve, John Grey, Walter Woods",
    "Actors": "Harry Houdini, Thomas Jefferson, Ann Forrest",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0009915",
    "tt0010112",
    "tt0010418",
    "tt0010726",
    "tt0011387",
    "tt0197903",
    "tt0011078",
    "tt0011779",
    "tt0014112",
    "tt0008519",
    "tt0012657",
    "tt0012675"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}