{
  "imdbId": "tt0029005",
  "title": "Hittin' the Trail",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HittintheTrail",
      "title": "Hittin' the Trail",
      "description": "Tex Randall (Tex Ritter) gets arrested for murder and horse rustling but it's all a case of mistaken identity. The town's big-shot gets him off the hook and offers a horse-trading deal to Tex with the intention of double crossing him just like he did the Tombstone Kid (Archie Ricks).",
      "fileSize": 1578806603,
      "id": "HittintheTrail"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=W5spiZTfp20",
      "title": "Hittin' the Trail (1937) TEX RITTER",
      "description": "Stars: Tex Ritter, Earl Dwire, Jerry Bergh\n Director: Robert N. Bradbury\n\n Clark is unable to move his stolen horses. When Tex arrives in town, Clark tricks him into moving them for him. He stakes him at roulette, has his crony let him win, and then sells him the horses. When Tex gets the horses across the state line, he plans to have his henchmen take care of Tex and take repossession of the horses.",
      "id": "W5spiZTfp20",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "58 min",
    "imdbRating": 5.4,
    "imdbVotes": 126,
    "Genre": "Drama, Music, Western",
    "Plot": "This was one of the earlier uses of Robert Tansey's favorite plot (only the 3rd time he had trotted it out of the stable, but he got six more films out of it in later years) in which a group of outlaws (wrongly jailed this time) are let out to join up with the good guys against a worse bunch of outlaws. And, not unusual in the B-western genre, most of the production crew wore several hats; director Robert N. Bradbury and supervisor Lindsley Parsons wrote a song for Tommy Bupp, one of the actually good kid actors of the time who proved real quick-like that singing wasn't his strong suit, while Robert Emmett Tansey worked three jobs under three names... Robert Emmett on story and screenplay, Robert Tansey as the production manager and Al Lane as the assistant director. And, for a change, music director Frank Sanucci actually earned a composers' credit as he did write a song, as opposed to the multi-times some source keeps insisting on crediting him as a composer when he was really the musical director serving up canned music. Roving horse-trader Tex Randall (Tex Ritter) and Hank Hank Worden swap horses with a fleeing outlaw, The Tombstone Kid (Archie Ricks), and the pursuing Sheriff Grey (Ed Cassidy) comes along and arrests Tex as the man he was pursuing. But the man who framed the Tombstone Kid , saloon owner and leader of a horse-theft gang, James Clark (Earl Dwire), clears Tex and he is released. Clark then rigs the wheel at his saloon so Tex can win some money and buy the stolen herd of horses Clark can't get across the border, then has a henchman steal the receipt and also has plans to get the horses back. Tex and Hank swap herds with Dad Reed (Jack C. Smith), so Clark has him arrested for horse theft also. Things don't get much better for Tex and Hank until the Tombstone Kid shows up and shoots henchman Slug (Charles King just as he is about to shoot Tex. This is because when Tex swapped Tombstone a fresh horse back in the first reel, Tombstone thanks him and says something about casting \"bread upon the water\" (which Tex has to explain to Hank is from the Bible). They ride back to town with proof of Clark's double-dealing, and the sheriff lets Tombstone's six men out of jail, and they join Tex, their ranks now swollen to about fifty riders, to chase Clark and his gang across the plains in a chase-type scene much favored by director Bradbury over the years. That only leaves time for Tex to explain to Jean Reed (Jerry Bergh), the rancher's daughter, that he is really an agent for the Soutland Railraod, commissioned to pay a large price for the right-of-way through her father's ranch.",
    "Director": "Robert N. Bradbury",
    "Writer": "Robert Emmett Tansey",
    "Actors": "Tex Ritter, Earl Dwire, White Flash",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0029694",
      "title": "Trouble in Texas",
      "year": 1937,
      "imdbRating": 5.1,
      "imdbVotes": 310,
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028582",
      "title": "Arizona Days",
      "year": 1937,
      "imdbRating": 4.4,
      "imdbVotes": 177,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029289",
      "title": "The Mystery of the Hooded Horsemen",
      "year": 1937,
      "imdbRating": 4.7,
      "imdbVotes": 170,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030849",
      "title": "Tex Rides with the Boy Scouts",
      "year": 1937,
      "imdbRating": 5.1,
      "imdbVotes": 97,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030689",
      "title": "Rollin' Plains",
      "year": 1938,
      "imdbRating": 4.5,
      "imdbVotes": 159,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031247",
      "title": "Down the Wyoming Trail",
      "year": 1939,
      "imdbRating": 5.3,
      "imdbVotes": 60,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031860",
      "title": "Riders of the Frontier",
      "year": 1939,
      "imdbRating": 6.2,
      "imdbVotes": 51,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028940",
      "title": "God's Country and the Man",
      "year": 1937,
      "imdbRating": 6.9,
      "imdbVotes": 64,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0029696",
      "title": "The Trusted Outlaw",
      "year": 1937,
      "imdbRating": 5.6,
      "imdbVotes": 81,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0029485",
      "title": "Riders of the Rockies",
      "year": 1937,
      "imdbRating": 4.7,
      "imdbVotes": 83,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029568",
      "title": "Sing, Cowboy, Sing",
      "year": 1937,
      "imdbRating": 4.5,
      "imdbVotes": 192,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033132",
      "title": "Take Me Back to Oklahoma",
      "year": 1940,
      "imdbRating": 5.8,
      "imdbVotes": 106,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.402Z"
}