{
  "movieId": "tt0023580",
  "title": "There Goes the Bride",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheregoestheBride",
      "id": "TheregoestheBride",
      "title": "There Goes the Bride",
      "description": "A businessman's daughter (Jessie Matthews) runs away from an arranged marriage, only to find herself penniless and suspected of theft after she becomes the victim of a bag thief (Owen Nares) in the train. When she refuses to tell him who she really is, her accuser decides to take her home where he can keep an eye on her until 12 o'clock the next day, the time at which she has calculated that it will be safe to tell the truth! But when his fiancée arrives unexpectedly and then his 'guest' is mistaken for her, it all gets rather embarrassing. In this movie David Niven appear for the first time on screen in a small and uncredited role",
      "fileSize": 1937776658,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/TheregoestheBride",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 61910
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "79 min",
    "imdbRating": 6.7,
    "imdbVotes": 163,
    "Genre": "Comedy, Musical, Romance",
    "Plot": "A businessman's daughter runs away from an arranged marriage, only to find herself penniless and suspected of theft after she becomes the victim of a bag thief in the train. When she refuses to tell him who she really is, her accuser decides to take her home where he can keep an eye on her until 12 o'clock the next day, the time at which she has calculated that it will be safe to tell the truth! But when his fiancée arrives unexpectedly and then his 'guest' is mistaken for her, it all gets rather embarrassing...",
    "Director": "Albert de Courville",
    "Writer": "Henry Koster, Wolfgang Wilhelm, W.P. Lipscomb",
    "Actors": "Jessie Matthews, Owen Nares, Carol Goodner",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025094",
    "tt0023158",
    "tt0027090",
    "tt0022000",
    "tt0022263",
    "tt0023740",
    "tt0024640",
    "tt0025349",
    "tt0021057",
    "tt0025493",
    "tt0021334",
    "tt0025784"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.886Z"
}