{
  "imdbId": "tt0002898",
  "title": "Germinal; or, The Toll of Labor",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-germinal-or-the-toll-of-labor",
      "title": "Germinal; or, The Toll of Labor",
      "id": "silent-germinal-or-the-toll-of-labor"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "150 min",
    "imdbRating": "6.9",
    "imdbVotes": "181",
    "Genre": "Drama",
    "Plot": "The mechanic Etienne Lantier is a competent workman out of a job, whose tempestuous disposition is more than atoned for by a good heart. With bundle in hand he looks for work from town to town and in vain until he comes to the coal mines of Montsou. Luckily for him there is a vacancy because of a workman being absent, and the foreman, Maheu, hires him at the suggestion of his daughter, Catherine, who dressed as a man is wont to work like a man in the mine. Lantier creates an impression on her and she takes his part much to the chagrin of her accepted lover, Chaval, an unworthy and violent man. Lantier fails to recognize her as a woman until after sharing her lunch with him in the depths of the mine, her hair falls from under her miner's headgear. From that moment he devotes his whole heart to her. At the end of the day's labor Lantier, who has excited a fierce jealousy in Chaval, is invited by Maheu to become a boarder at his house and he joyfully accepts. The engineer, Negrel, making his daily descent into the mine finds the shoring timbers holding up the earth in a bad state and ready to fall. He makes a report recommending that the woodwork he immediately and properly repaired so as to avoid accident. The company, however, posts a notice saying that because the woodwork has to be repaired the price received by the miners per car of coal mined will be decreased. This arbitrary and unfair notice causes much discontent and anger among the miners. A mass meeting is called for at the Cabaret Rasseneur; Souvarine, an anarchistic workman, advocates violent measures. Lantier opposes this and suggests concerted action. The anger of the workmen breaks out afresh when they begin to receive their reduced wages and urged on by Lantier, whose influence is growing, they vote to strike. In the meantime Catherine, though in love with Lantier, dares not go back on her word to Chaval and marries him. Chaval treacherously carries full information of the strike proceedings to Mr. Hennebeau, the chief director of the company, and accepts pay for being a spy. The strike is now on amid general enthusiasm. In the meantime, Negrel, the engineer, who is in love with Hennebeau's daughter, pleads with Hennebeau to answer the miners' requests. Miss Hennebeau also pleads with her father, but in vain. The stores refuse to extend credit to the striking workmen and famine soon stalks among them. Lantier discovers to his surprise that Chaval is an exception and that he has plenty of food and money. As yet he has not discovered that Chaval is the paid spy of the company. Catherine brings secretly to her starving relative food and money. Chaval follows her, drives her from the house and strikes her. Lantier seeing it interferes in her behalf, and being attacked by Chaval thoroughly thrashes him. Chaval, taking advantage of the growing misery among the miners, urges some of them back to work. While they are in the mines the other strikers cut the elevator ropes. There is a panic in the mine depths. The imprisoned miners finally escape by ladders, but have to run the gauntlet of the enraged strikers, who still hold out. When Chaval is dragged from the mine Lantier rashes at him, but Catherine steps in between and prevents harm being done to her husband. Blinded by hatred Chaval goes to Hennebeau and denounces the miners' leaders, especially Lantier. The police are called upon to arrest him, but warned in time he escapes to the abandoned shaft of Voroux. The strike becomes violent and the troops are called in to reinforce the police. In the absence of Lantier, Souvarine is called in to head the strikers. Hennebeau's house is attacked and stoned. Seeing the soldiers preparing to fire on the mob, the director's daughter rushes from the house to try and avert the coming calamity. She is caught in the storm of bullets and dies together with many of the miners and their wives, among them Catherine's father. This crushes the strikers' movement and instigated by Chaval they vote to resume work. Lantier, emerged from his refuge, tries in vain to dissuade them, but his influence is gone and bowing to the majority he also goes back to work. Souvarine, alone implacable, determines upon desperate measures. He releases the bolts binding the barriers that hold back water from flooding the mine and the flood breaks loose. He is drowned in the cataclysm that follows. The miners, caught like rats in a trap, run madly hither and thither. Some escape, others, among them Lantier, Catherine and Chaval, are caught. These latter three find themselves imprisoned in an abandoned working pit, where they sit in despair with the water up to their knees. They have little food and when after long hours Catherine attempts to give a little of her lunch to Lantier. Chaval furiously opposes. Chaval finally attempts to deprive his wife by force of her morsel of food. In righteous rage Lantier strikes him and kills him. His dead body, floating on the water, haunts them. Forgetting their animosities, directors and workmen unite in the work of rescue. Through an abandoned pit they come near to Catherine and Lantier. Their signals being answered by the prisoners they redouble their exertions. By imprudence, however, an explosion takes place, which kills many of the rescuers and sets back the work. Among those killed is Catherine's brother. When the workers finally pierce the intervening walls they find only Lantier alive, for Catherine lies dead in his arms. When the unconscious man is brought into the daylight and at last opens his eyes it is the bereaved Negrel who, with a heart of sympathy, comforts him in his grief when he sees the body of his dead sweetheart. Broken in spirit he sees injustice rule and the poor pay the piper.",
    "Director": "Albert Capellani",
    "Writer": "Albert Capellani, Émile Zola",
    "Actors": "Mévisto, Jean Jacquinet, Henry Krauss",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0461304",
      "title": "Le pain des petits oiseaux",
      "year": 1911,
      "imdbRating": "5.8",
      "imdbVotes": "30",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0460831",
      "title": "L'intrigante",
      "year": 1911,
      "imdbRating": "5.2",
      "imdbVotes": "39",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0434198",
      "title": "The Death of the Duke D'Enghien",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "32",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0482887",
      "title": "A Slave's Love",
      "year": 1907,
      "imdbRating": "4.9",
      "imdbVotes": "60",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0164493",
      "title": "Cinderella",
      "year": 1907,
      "imdbRating": "5.9",
      "imdbVotes": "100",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0433791",
      "title": "L'Arlésienne",
      "year": 1908,
      "imdbRating": "6.4",
      "imdbVotes": "56",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0434455",
      "title": "L'âge du coeur",
      "year": 1906,
      "imdbRating": "4.8",
      "imdbVotes": "69",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0434199",
      "title": "Mortelle idylle",
      "year": 1906,
      "imdbRating": "5.2",
      "imdbVotes": "81",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0434157",
      "title": "The Law of Pardon",
      "year": 1906,
      "imdbRating": "4.6",
      "imdbVotes": "48",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0432624",
      "title": "Anne Boleyn",
      "year": 1912,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002784",
      "title": "Cymbeline",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "50",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "625",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}