{
  "movieId": "tt0033802",
  "title": "Ladies in Retirement",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ladies-in-retirement-1941",
      "id": "ladies-in-retirement-1941",
      "title": "Ladies in Retirement (1941)",
      "description": "Ellen Creed is a housekeeper who looks after Leonora Fiske, a retired actress living in the English countryside. When Ellen's eccentric sisters visit their sibling at Leonora's home, tensions soon lead to murder. Watch on RetroFlix.org: https://retroflix.org/ladies-in-retirement-1941/",
      "fileSize": 499888999,
      "addedAt": "2026-01-07T00:09:24.703Z",
      "thumbnail": "https://archive.org/services/img/ladies-in-retirement-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 683
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ladiesinretirement1941usafeaturingidalupinolouishaywardfilmnoirfullmovie",
      "id": "ladiesinretirement1941usafeaturingidalupinolouishaywardfilmnoirfullmovie",
      "title": "Ladies In Retirement (1941) Ida Lupino, Louis Hayward - Film Noir Full Movie",
      "description": "Ladies in Retirement is an American 1941 film noir directed by Charles Vidor, and starring Ida Lupino, Louis Hayward, Evelyn Keyes. It is based on a 1940 Broadway play of the same title which in turn was based upon a true story from 1886.   The New York Times reviewed the film favorably: \"The film is an exercise in slowly accumulating terror with all the psychological trappings of a Victorian thriller. It has been painstakingly done, beautifully photographed and tautly played, especially in its central role, and for the most part it catches all the script's nuances of horror quite as effectively as did the original play version ... It is a film for a proper and patient mood. It doesn't race through its story; it builds its terror step by step Wikipedia: https://en.wikipedia.org/wiki/Ladies_in_Retirement Suggested Film Noirs: http://bit.ly/36oLNCR The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.  ",
      "fileSize": 259364230,
      "addedAt": "2026-01-07T00:09:24.703Z",
      "thumbnail": "https://archive.org/services/img/ladiesinretirement1941usafeaturingidalupinolouishaywardfilmnoirfullmovie",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 7849
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1941-ladies-in-retirement-el-misterio-de-fiske-manor-charles-vidor-vose",
      "id": "1941-ladies-in-retirement-el-misterio-de-fiske-manor-charles-vidor-vose",
      "title": "1941 - Ladies in Retirement - El misterio de Fiske Manor - Charles Vidor - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "fileSize": 511279296,
      "addedAt": "2026-01-07T00:06:03.995Z",
      "thumbnail": "https://archive.org/services/img/1941-ladies-in-retirement-el-misterio-de-fiske-manor-charles-vidor-vose",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 2553
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LadiesInRetirement1941BwFilm13215",
      "id": "LadiesInRetirement1941BwFilm13215",
      "title": "Ladies in Retirement (1941 B/W Film 1:32:15)",
      "description": "**PUBLIC DOMAIN** Ladies in Retirement (1941 B/W Film 1:32:15) (1941-09-18) Ladies in Retirement is an American 1941 film noir directed by Charles Vidor, and starring Ida Lupino and Louis Hayward. It is based on a 1940 Broadway play of the same title by Reginald Denham and Edward Percy which starred Flora Robson in the lead role. **PLOTLINE:: Ellen Creed, a proud spinster fallen on hard times, has been housekeeper/companion to her old friend Miss Leonora Fiske, a wealthy retiree who in her youth had been a chorus girl \"of easy virtue\", for about two years.One day when Ellen's away, a handsome young stranger called Albert Feather turns up, in need of money, and claiming to be Ellen's nephew. ** REVIEW: The New York Times reviewed the film favorably, \"For the film that opened yesterday at the Capitol is an exercise in slowly accumulating terror with all the psychological trappings of a Victorian thriller. It has been painstakingly done, beautifully photographed and tautly played, especially in its central role, and for the most part it catches all the script's nuances of horror quite as effectively as did the original play version ... Despite all its excellence, however, it must be added that Ladies in Retirement is a film for a proper and patient mood. It doesn't race through its story; it builds its terror step by step Academy Award nominations: 1) Best Art Direction-Interior Decoration, Black-and-White: Lionel Banks & George Montgomery. 2) Best Music, Scoring of a Dramatic Picture: Morris Stoloff and Ernst Toch 23-year-old Ida Lupino played the 40-year-old sinister Ellen to ice cold perfection, with no small help from her make-up. Though stage-bound, this Gothic melodrama is well-crafted and involving\". 1969 REMAKE as ''The Mad Room'' SOURCE: Wikipedia https://en.wikipedia.org/wiki/Ladies_in_Retirement *** I OWN NO RIGHTS TO ANY PART OF THIS MOVIE. I receive NO FINANCIAL GAIN, NOR GAIN IN ANY FORM, for this upload, nor any other item I upload to archive.org. I upload for educational purposes and for the enjoyment of all generations (present & future). I do so with the belief the item is now in the Public Domain. If anything I upload is found to not be in the Public Domain, I do understand that it (sadly) may be pulled from this educational and priceless website. ** Should you have any problems with downloading, please inform this volunteer up-loader (DEF GP or DEF GP ddh) by posting message below. **Public Domain**",
      "fileSize": 680680020,
      "addedAt": "2026-01-07T00:06:30.622Z",
      "thumbnail": "https://archive.org/services/img/LadiesInRetirement1941BwFilm13215",
      "collection": "feature_films",
      "downloads": 6979
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "91 min",
    "imdbRating": 7.1,
    "imdbVotes": 1845,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "In the late nineteenth century, Ellen Creed works as the live-in companion to Miss Leonora Fiske, a retired actress who lives in the English countryside and who still retains her theatrical mannerisms. Ellen receives notice that the landlady of her two sisters, Emily Creed and Louisa Creed, who currently live in London, is threatening to call the police to haul them away to an asylum because of their disruptive behavior due to their mentally deranged state. Ellen will not allow her sisters to be institutionalized, and convinces Miss Fiske to allow them to stay with them for a couple of days. Miss Fiske was unaware of their deranged mental state when she agreed and is also unaware that Ellen hopes to make their stay permanent. Both issues eventually become apparent to Miss Fiske, who cannot tolerate how Emily and Louisa disrupt her home life. However, Ellen \"convinces\" Miss Fiske to take an extended leave from the house, while Ellen tells her sisters that she bought the house from Miss Fiske, which the sisters are not to tell anyone else. The secrets that Ellen is keeping about the situation threaten to bring her and her sisters' lives down when they receive a visit from their distant nephew Albert Feather, a cad who has his own financial well being as his main priority.",
    "Director": "Charles Vidor",
    "Writer": "Garrett Fort, Reginald Denham, Edward Percy",
    "Actors": "Ida Lupino, Louis Hayward, Evelyn Keyes",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 2 Oscars. 2 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt0033582",
    "tt0035082",
    "tt0033740",
    "tt0033998",
    "tt0034175",
    "tt0125737",
    "tt0034173",
    "tt0034959",
    "tt0034941",
    "tt0035388",
    "tt0034798",
    "tt0035432"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:12:50.141Z"
}