{
  "imdbId": "tt0004825",
  "title": "The Wishing Ring: An Idyll of Old England",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-wishing-ring-an-idyll-of-old-england",
      "title": "The Wishing Ring: An Idyll of Old England",
      "id": "silent-the-wishing-ring-an-idyll-of-old-england"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "54 min",
    "imdbRating": "6.5",
    "imdbVotes": "323",
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Sally, a parson's daughter, though in rags and well-ventilated shoes, had artistic instincts and the two vases, though far too rich for her father's church, were flowerless. In her innocence she argued \"That man Annesley has an immense rose garden and surely he can spare a few roses for our church,\" and gathered an armful without the formality of saying, \"By your leave, sir.\" Annesley was annoyed, even to the point of anger, at these mysterious disappearances, and finally, during a quarrel with his gardener, the latter threw his apron in Annesley's face and left. Again, if Giles, the son of the gouty, testy Earl of Bateson, had applied himself more assiduously to his studies instead of making night hideous for the village by his carousals with his boon companions, he would not have been arrested, and expelled from college. On his return home to father, the latter placed him in the hands of a tutor, from whom Giles escaped and arrived at his friend Annesley's rose garden at the psychological moment when the gardener had tendered his resignation. Annesley gave him the apron and placed him in charge of the garden. Sally makes another raid, is caught by Giles, who, from threats, took pity and accompanied her to the forlorn church, where his better nature is aroused. Returning to the garden, they breakfasted al fresco. This acquaintanceship finally ripened into a friendship. During one of their wanderings they happened upon a gypsy camp, where she was told that she will marry a nobleman's son. Giles bought a wishing ring from the gypsies which he gave to Sally. Naturally superstitious, Sally easily construed coincidences as replies to her wishes on the ring. At Annesley's party, Sally and the parson discovered through a letter which the Earl sent, that Giles is his son and must earn a half crown before he can hope for forgiveness. They were astounded and treated him quite deferentially. Sally resolved to bring father and son together. She visited the old gent and the Earl was quite impressed with her. She played chess with him, amused him, in fact she became quite essential to him. Her quixotic nature was aroused by the sight of his suffering and wished his cure on the ring. Getting no results, she consulted the gypsies who told her that a certain herb plucked by the light of the moon at midnight and made into a tea is a sure cure for gout. She obeyed the instructions and in reaching down the face of the cliff, fell down and was injured. The following morning a party led by her little dog found her at the bottom of the cliff and took her to her home. The next morning at ten, when the Earl's little visitor failed to appear, he sent his butler to inquire. On learning that she was injured, he forgot his gout, ordered his horse and set forth to see her. His horse became lame; he stopped at the inn, ordered a fresh horse, which, by a coincidence, was furnished by Giles, who received a half crown. As the innkeeper gave Giles the money, he told him that Sally had been injured. Giles took a short cut, arrived before his father, told her of the half crown, hid when his father appeared, and when beckoned on by Sally (who in the meantime had earned the gratitude of the Earl by telling how she was injured) he emerged from his place of concealment, and she brought about the reconciliation.",
    "Director": "Maurice Tourneur",
    "Writer": "Owen Davis, Maurice Tourneur",
    "Actors": "Vivian Martin, Alec B. Francis, Chester Barnett",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0008443",
      "title": "The Poor Little Rich Girl",
      "year": 1917,
      "imdbRating": "6.7",
      "imdbVotes": "1,573",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004872",
      "title": "Alias Jimmy Valentine",
      "year": 1915,
      "imdbRating": "6.6",
      "imdbVotes": "247",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006826",
      "title": "Hoodoo Ann",
      "year": 1916,
      "imdbRating": "5.9",
      "imdbVotes": "903",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010844",
      "title": "Victory",
      "year": 1919,
      "imdbRating": "6.5",
      "imdbVotes": "473",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002198",
      "title": "Le friquet",
      "year": 1914,
      "imdbRating": "6.4",
      "imdbVotes": "29",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013332",
      "title": "Lorna Doone",
      "year": 1922,
      "imdbRating": "6.6",
      "imdbVotes": "316",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0493556",
      "title": "La bergère d'Ivry",
      "year": 1913,
      "imdbRating": "6.2",
      "imdbVotes": "38",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032599",
      "title": "His Girl Friday",
      "year": 1940,
      "imdbRating": "7.8",
      "imdbVotes": "66,904",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027311",
      "title": "As You Like It",
      "year": 1936,
      "imdbRating": "5.8",
      "imdbVotes": "882",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033891",
      "title": "Meet John Doe",
      "year": 1941,
      "imdbRating": "7.6",
      "imdbVotes": "16,080",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027286",
      "title": "The Amazing Adventure",
      "year": 1936,
      "imdbRating": "6.3",
      "imdbVotes": "2,215",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt3101386",
      "title": "The Christmas Spirit",
      "year": 2013,
      "imdbRating": "5.8",
      "imdbVotes": "1,104",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:36:26.251Z"
}