{
  "movieId": "tt0047976",
  "title": "Dementia",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DEMENTIA_201508",
      "id": "DEMENTIA_201508",
      "title": "Dementia",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 2604594441,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/DEMENTIA_201508",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 2021
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dementia-1955",
      "id": "dementia-1955",
      "title": "Dementia (1955)",
      "description": "Shot entirely without dialogue and filled with suggestive violence and psycho-sexual imagery, it’s a surrealist film noir expressionist horror following the nocturnal prowling of a young woman haunted by homicidal guilt. Watch on RetroFlix:  https://retroflix.org/dementia-1955/",
      "fileSize": 326406294,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/dementia-1955",
      "language": "eng",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 253
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dementia-1955_202407",
      "id": "dementia-1955_202407",
      "title": "Dementia/Daughter Of Horror 1955 ★★★½ CC: Film-Noir/Mystery/Thriller [00:55:18]",
      "description": "Dementia is a 1955 American black-and-white experimental horror film produced, written, and directed by John Parker, and starring Adrienne Barrett and Bruno Ve Sota. As the narrator invites us to explore the horrors of an insane mind, a young woman wakes from a nightmare in a cheap hotel room. We follow her through the skid-row night and encounters with an abusive husband; a wino; a pimp and the rich man he panders for; a flashback to her traumatic childhood; violence; pursuit through dark streets; dementia. Filmed in film-noir style throughout; only the narrator speaks. Dementia was conceived as a short film by writer-director Parker and was based on a dream relayed to him by his secretary, Barrett. He cast Barrett in the film, along with Ve Sota, and ultimately decided to expand it into a longer feature. The film received a troubled release, being banned in 1953 by the New York State Film Board before finally being released in December 1955. It was later acquired by Jack H. Harris, who edited it and incorporated voice over narration by Ed McMahon before re-releasing it in 1957 under the alternate title Daughter of Horror. Dementia was briefly released in 1953 before it was banned by the New York State Film Board, who deemed it \"inhuman, indecent, and the quintessence of gruesomeness\". Two years later, it was re-released in New York City on December 22, 1955, with four edits demanded by the censors. As a promotional stunt for the 1955 release, theater employees were required to submit medical examinations of patrons by \"heart specialists\" to assure that theatergoers would not be frightened to the point of harming their health. Cast: Adrienne Barrett as the Gamin Bruno Ve Sota as Rich Man Ben Roseman as Law Enforcer / Father Richard Barron as Evil One Edward Hinkle as Butler Lucille Howland as Mother Jebbie Ve Sota as Flower Girl Faith Parker as Nightclub Dancer Gayne Sullivan as Wino Shorty Rogers as himself Angelo Rossitto as Newsboy Shelley Berman as Stoned Beatnik Soundtracks Wig Alley Music by Shorty Rogers Performed by The Giants",
      "fileSize": 991065151,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/dementia-1955_202407",
      "language": "eng",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 1363
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "61 min",
    "imdbRating": 6.7,
    "imdbVotes": 2746,
    "Genre": "Drama, Film-Noir, Horror",
    "Plot": "As the narrator invites us to explore the horrors of an insane mind, a young woman wakes from a nightmare in a cheap hotel room. We follow her through the skid-row night and encounters with an abusive husband; a wino; a pimp and the rich man he panders for; a flashback to her traumatic childhood; violence; pursuit through dark streets; dementia. Filmed in film-noir style throughout; only the narrator speaks.",
    "Director": "John Parker, Bruno VeSota",
    "Writer": "John Parker, Bruno VeSota",
    "Actors": "Adrienne Barrett, Bruno VeSota, Ben Roseman",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0047178",
    "tt0047878",
    "tt0047934",
    "tt0047958",
    "tt0047904",
    "tt0049204",
    "tt0048064",
    "tt0048160",
    "tt0048182",
    "tt0048254",
    "tt0048261",
    "tt0049801"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:21:52.469Z"
}