{
  "movieId": "tt0066549",
  "title": "Waterloo",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/waterloo.-1970",
      "id": "waterloo.-1970",
      "title": "Waterloo (1970)",
      "description": "A large-scale historical war film directed by Sergey Bondarchuk that dramatizes Napoleon Bonaparte’s final campaign and the Battle of Waterloo (June 18, 1815). The film alternates between broad army movements and intimate portraits of commanders and soldiers. After escaping exile on Elba, Napoleon returns to France and rebuilds his army, prompting the Seventh Coalition (Britain, Prussia, Netherlands, etc.) to mobilize under leaders including the Duke of Wellington (Arthur Wellesley) and Prussian Field Marshal Gebhard von Blücher. Tension mounts as both sides prepare for a decisive confrontation. The film follows Napoleon (Rod Steiger) as he plans and executes maneuvers to divide and defeat the Coalition before they can unite. It shows his charisma, strategic brilliance, concern about troop quality, and mounting doubt as luck and logistics begin to turn against him. Wellington (Christopher Plummer) is portrayed as a cautious, professional commander defending a coalition line across the Mont-Saint-Jean ridge, while Blücher—portrayed with blunt determination—focuses on keeping the Prussian army intact and in the fight despite injuries and exhausted troops.With Prussian pressure and exhausted French troops, Napoleon orders the Imperial Guard in a last effort. The Guard’s failure and subsequent rout mark the collapse of French resistance. Napoleon flees the field; the Coalition claims victory, ending his rule. The film closes on the aftermath: the devastation of battle, captured standards, and the leaders facing the consequences of defeat.",
      "fileSize": 3425317273,
      "addedAt": "2026-01-07T00:13:06.701Z",
      "thumbnail": "https://archive.org/services/img/waterloo.-1970",
      "language": "eng",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 307
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "123 min",
    "imdbRating": 7.3,
    "imdbVotes": 13623,
    "Genre": "Action, Biography, Drama",
    "Plot": "After defeating France and imprisoning Napoleon on Elba, ending two decades of war, Europe is shocked to find Napoleon has escaped and has caused the French Army to defect from the King back to him. The best of the British generals, the Duke of Wellington, beat Napolean's best generals in Spain and Portugal, but has never faced Napoleon. Wellington stands between Napoleon with a makeshift Anglo-Allied army and the Prussians. A Napoleon victory will plunge Europe back into a long term war. An allied victory could bring long term peace to Europe. The two meet at Waterloo where the fate of Europe will be decided.",
    "Director": "Sergey Bondarchuk",
    "Writer": "H.A.L. Craig, Sergey Bondarchuk, Vittorio Bonicelli",
    "Actors": "Rod Steiger, Christopher Plummer, Orson Welles",
    "Language": "English",
    "Country": "Italy, Soviet Union",
    "Awards": "Won 2 BAFTA 3 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt0067069",
    "tt0029850",
    "tt0066970",
    "tt3829920",
    "tt0065474",
    "tt0065374",
    "tt0065966",
    "tt3844876",
    "tt0216546",
    "tt0065593",
    "tt0064571",
    "tt0064137"
  ],
  "collections": [
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.701Z"
}