{
  "imdbId": "tt0055830",
  "title": "Carnival of Souls",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalofSouls",
      "id": "CarnivalofSouls",
      "title": "Carnival of Souls",
      "description": "Atmospheric 60s B-horror film with a cult following. Mary Henry is enjoying the day by riding around with two friends but everything goes wrong when challenged to a drag race and their car gets forced off of a bridge. The car sinks into the murky depths, and all three women are assumed drowned. Some time later Mary emerges unscathed from the river. She tries to start a new life by becoming a church organist but Mary finds herself haunted by a ghostly figure that instills fear and dread into her. You can find more information regarding this film on its IMDb page . The director Herk Harvey was also a prolific industrial/educational filmmaker for Centron Productions. Some of those films can be found here",
      "fileSize": 3498014809,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalofSouls",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 451612
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/carnival-of-souls-1962-cult-film-horror",
      "id": "carnival-of-souls-1962-cult-film-horror",
      "title": "Carnival Of Souls (1962) Cult Film ｜ Horror",
      "description": "Mary Henry (Candace Hilligoss) ends up the sole survivor of a fatal car accident through mysterious circumstances. Trying to put the incident behind her, she moves to Utah and takes a job as a church organist. But her fresh start is interrupted by visions of a fiendish man (Herk Harvey). As the visi ons begin to occur more frequently, Mary finds herself drawn to the deserted carnival on the outskirts of town. The strangely alluring carnival may hold the secret to her tragic past.",
      "fileSize": 857927241,
      "addedAt": "2026-01-07T00:07:45.167Z",
      "thumbnail": "https://archive.org/services/img/carnival-of-souls-1962-cult-film-horror",
      "collection": "feature_films",
      "downloads": 572
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/carnival-of-souls-1962_202312",
      "id": "carnival-of-souls-1962_202312",
      "title": "Carnival of Souls (1962)",
      "description": "Mary Henry ends up the sole survivor of a fatal car accident through mysterious circumstances. Trying to put the incident behind her, she moves to Utah and takes a job as a church organist. But her fresh start is interrupted by visions of a fiendish man. As the visions begin to occur more frequently, Mary finds herself drawn to the deserted carnival on the outskirts of town. The strangely alluring carnival may hold the secret to her tragic past. Watch on RetroFlix:  https://retroflix.org/carnival-of-souls-1962/",
      "fileSize": 458429811,
      "addedAt": "2026-01-07T00:07:45.167Z",
      "thumbnail": "https://archive.org/services/img/carnival-of-souls-1962_202312",
      "language": "eng",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 315
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/co-s-4-k",
      "id": "co-s-4-k",
      "title": "Carnival Of Souls (1962) [Colorized, 4K, 60FPS]",
      "description": "Carnival Of Souls is a 1962 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 7447180333,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/co-s-4-k",
      "collection": "feature_films",
      "downloads": 481
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9bUePiQJJCI",
      "id": "9bUePiQJJCI",
      "title": "Carnival Of Souls (1962) [Horror]",
      "description": "\"Carnival of Souls\" is a 1962 independent horror film starring Candace Hilligoss. Produced and directed by Herk Harvey for an estimated $33,000, the film did not gain widespread attention when originally released, as a B film; today, however, it is a cult classic. Set to an organ score by Gene Moore, Carnival of Souls relies more on atmosphere than on special effects to create a mood of unease and foreboding. The film has a large cult following and is occasionally screened at film and Halloween festivals. It has been cited as an important influence on the films of both David Lynch and George A. Romero.\n\nHarvey was a director and producer of industrial and educational films based in Lawrence, Kansas, where he worked for the Centron Corporation. While vacationing in Salt Lake City, he developed the idea for the film after driving past the abandoned Saltair Pavilion. Hiring an unknown actress, Lee Strasberg-trained Candace Hilligoss, and otherwise employing mostly local talent, he shot Carnival of Souls in three weeks on location in Lawrence and Salt Lake City.\n\nMary Henry (Candace Hilligoss) is riding in a car with two other young women when some men challenge them to a drag race. As they speed across a bridge, the women's car plunges over the side into the river. The police spend three hours dragging the murky, fast-running water without success. Then Mary miraculously surfaces. She cannot remember how she survived. Mary then drives to Utah, where she has been hired as a church organist. Odd things happen along the way. At one point, she can get nothing on her car radio but strange organ music. She passes a large, abandoned pavilion sitting all by itself on the shores of the Great Salt Lake. It seems to beckon to her in the twilight. Shortly thereafter, while speeding along a deserted stretch of road, a ghoulish, pasty-faced figure (The Man, played by director Herk Harvey) replaces her reflection in the passenger window and stares at her. When The Man suddenly appears in front of her, she swerves off the road. She manages to get back on the road. At a gas station, the attendant tells her the pavilion was first a bathhouse, then a dance hall, and finally a carnival before shutting down.\n\nIn town, Mary rents a room from Mrs. Thomas; John Linden, the only other lodger, wants to become better acquainted with the blonde newcomer, but she is not interested. That night, she becomes upset when she sees The Man downstairs in the large house and retreats to her room. Mrs. Thomas, who kindly brings her some food, says she did not pass anyone. Soon, Mary begins experiencing terrifying interludes when she becomes invisible and inaudible to the rest of the world, as if she simply is not there. When The Man appears briefly in front of her in a park, she flees, right into the arms of Dr. Samuels. Samuels, though he acknowledges he is not a psychiatrist, tries to help her. Her new employer, the minister (Art Ellison), is a bit put off when she declines his suggestion of a reception to meet the congregation. When she practices for the first time, she finds herself shifting from a hymn to eerie music. In a trance, she sees The Man and others of his ilk dancing. The minister, hearing the strange music, denounces it as \"profane\" and insists upon her resignation.\n\nTerrified of being alone, Mary agrees to go out on a date with Linden. When they return home, he talks his way into her room, but when she sees The Man in the mirror, she becomes upset and tries to tell him what has been happening to her. He leaves, believing she is losing her mind. After talking with Samuels again, Mary believes she has to go to the pavilion. There, however, she finds no answers. Other ghouls join The Man. Mary tries frantically to escape, at one point boarding a bus to leave town, only to find that all the passengers are ghouls. Then she wakes up, showing that she dreamed this sequence at least. In the end, she is drawn back to the pavilion, where she finds her tormenters dancing. A pale version of herself is paired with The Man. When she runs away, they chase her out onto the beach. She collapses, and they close in. The minister, the doctor, and the police investigate afterward, but are baffled. Her bare footprints in the sand (the only ones) end abruptly, but there is no trace of her. In the final scene, the car is finally located and pulled from the river. Mary's body is in the front seat.\n\n---\n\nDirected and produced by Herk Harvey, written by Herk Harvey and John Clifford, starring Candace Hilligoss, Frances Feist, Sidney Berger and Art Ellison.\n\n---\n\nSource: \"Terror by Night\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 4 September 2012. Web. 18 September 2012. http://en.wikipedia.org/wiki/Carnival_Of_Souls.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:46.361Z",
      "thumbnail": "https://i.ytimg.com/vi/9bUePiQJJCI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDOG3C7nnlmU2DRQT0PqoKqDxPt7Q",
      "duration": 4980,
      "language": "en",
      "year": 1962,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalOfSouls1962",
      "id": "CarnivalOfSouls1962",
      "title": "Carnival of Souls (1962)",
      "description": "A car crashes through the railings of a bridge and down into the cold waters below. Of the three girls in the car only Mary survives, but from that moment on she is haunted by a strange and sinister looking apparition. You can find out more about Carnival of Souls at A Passion For Horror .",
      "fileSize": 1049625602,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalOfSouls1962",
      "collection": "feature_films",
      "downloads": 152776
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalOfSouls_201508",
      "id": "CarnivalOfSouls_201508",
      "title": "Carnival Of Souls",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 1274895286,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalOfSouls_201508",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 5752
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalOfSouls_823",
      "id": "CarnivalOfSouls_823",
      "title": "Carnival of Souls",
      "description": "After a traumatic accident, a woman becomes drawn to a mysterious abandoned carnival where she discloses a dark secret. - IMDB Description",
      "fileSize": 2032268385,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalOfSouls_823",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 10377
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalOfSouls_ipod",
      "id": "CarnivalOfSouls_ipod",
      "title": "Carnival of Souls",
      "description": "After a traumatic accident, a woman becomes drawn to a mysterious abandoned carnival.",
      "fileSize": 1616154076,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalOfSouls_ipod",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 203384
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ay20EjDy_cE",
      "id": "ay20EjDy_cE",
      "title": "Carnival of Souls (1962) Horror | Colorized | HD Quality | Full Movie | Subtitled",
      "description": "She Escaped Death. Now It Wants Her Back!\nAfter a traumatic accident, a woman becomes drawn to a mysterious abandoned carnival.\n\nOriginal title: Carnival of Souls (1962) \nBlack & White version: https://youtu.be/vNYg4YWkp0k \n\nDirector: Herk Harvey\nWriter: John Clifford \nStars: Candace Hilligoss, Frances Feist, Sidney Berge\nGenres: Classics, Cult, Horror, Mystery & Suspense \nBudget : $30,000\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:42:18.663Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ay20EjDy_cE/maxresdefault.webp?v=64cb5642",
      "duration": 4665,
      "language": "en",
      "year": 1962,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vNYg4YWkp0k",
      "id": "vNYg4YWkp0k",
      "title": "Carnival of Souls (1962) Cult Film | Horror, Mystery | Full Length Movie",
      "description": "Mary Henry ends up the sole survivor of a fatal car accident through mysterious circumstances. Trying to put the incident behind her, she moves to Utah and takes a job as a church organist. But her fresh start is interrupted by visions of a fiendish man. As the visions begin to occur more frequently, Mary finds herself drawn to the deserted carnival on the outskirts of town. The strangely alluring carnival may hold the secret to her tragic past.\n\nOriginal title: Carnival of Souls (1962) \nColorized version: https://youtu.be/ay20EjDy_cE\nDirector: Herk Harvey\nWriter: John Clifford \nStars: Candace Hilligoss, Frances Feist, Sidney Berge\nGenres: Classics, Cult, Horror, Mystery & Suspense \nBudget : $30,000\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:52:15.473Z",
      "thumbnail": "https://i.ytimg.com/vi/vNYg4YWkp0k/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLDSnka_7dvATDWBHaAh9ptuB8mIPg",
      "duration": 4663,
      "language": "en",
      "year": 1962,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalOfSouls720p1962",
      "id": "CarnivalOfSouls720p1962",
      "title": "Carnival Of Souls 720p 1962",
      "description": "After a traumatic accident, a woman becomes drawn to a mysterious abandoned carnival. - IMDB 720p version.",
      "fileSize": 920691392,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalOfSouls720p1962",
      "collection": "feature_films",
      "downloads": 14780
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalOfSoulsTrailer",
      "id": "CarnivalOfSoulsTrailer",
      "title": "Carnival Of Souls Trailer",
      "description": "Original Theatrical Trailer",
      "fileSize": 20775279,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalOfSoulsTrailer",
      "collection": "feature_films",
      "downloads": 4576
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalOfSoulsUpgrade",
      "id": "CarnivalOfSoulsUpgrade",
      "title": "Carnival Of Souls Upgrade",
      "description": "A cleaner, crisper version of \"Carnival of Souls.\"",
      "fileSize": 1429463460,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalOfSoulsUpgrade",
      "collection": "feature_films",
      "downloads": 4761
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarnivalOfSoulsVideoQualityUpgrade",
      "id": "CarnivalOfSoulsVideoQualityUpgrade",
      "title": "CARNIVAL OF SOULS video quality upgrade",
      "description": "This version was sourced from a high quality 1.3GB Windows Media file found elsewhere at IA which didn't fully derive, and so there wasn't a streaming version. This new upload has been converted to a 642MB mpeg4 (mp4) file with no loss in apparent video quality. A low-key supernatural horror that proved you don't need mega bucks or a Hollywood studio to make a highly effective genre film. Directed by Herk Harvey Released in 1962 a.k.a. \"Corridors of Evil\" Complete print",
      "fileSize": 1075848982,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarnivalOfSoulsVideoQualityUpgrade",
      "collection": "feature_films",
      "downloads": 105430
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/carnival_of_souls",
      "id": "carnival_of_souls",
      "title": "Carnival of Souls ( iPod Video Version )",
      "description": "During a drag race, Mary Henry and her two friends are forced off of a bridge. Their car sinks into the depths of a river. Mary emerges unharmed from the river, the sole survivor of the crash. She begins a new life as a church organist. Mary suddenly finds herself haunted by a ghostly figure that seems to stalk her. This horror / thriller film is part of the Feature Film Archives and has been reformatted to work with the Video iPod.",
      "fileSize": 1181532254,
      "addedAt": "2026-01-07T00:07:45.167Z",
      "thumbnail": "https://archive.org/services/img/carnival_of_souls",
      "collection": "feature_films",
      "downloads": 12271
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "78 min",
    "imdbRating": 7,
    "imdbVotes": 29622,
    "Genre": "Horror, Mystery",
    "Plot": "Mary Henry is enjoying the day by riding around in a car with two friends. When challenged to a drag, the women accept, but are forced off of a bridge. It appears that all are drowned, until Mary, quite some time later, amazingly emerges from the river. After recovering, Mary accepts a job in a new town as a church organist, only to be dogged by a mysterious phantom figure that seems to reside in an old run-down pavilion. It is here that Mary must confront the personal demons of her spiritual insouciance.",
    "Director": "Herk Harvey",
    "Writer": "John Clifford, Herk Harvey",
    "Actors": "Candace Hilligoss, Frances Feist, Sidney Berger",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0055470",
    "tt0057692",
    "tt0055106",
    "tt0056285",
    "tt0056219",
    "tt0057859",
    "tt0057401",
    "tt0055304",
    "tt0057608",
    "tt0055650",
    "tt0053719",
    "tt0057156"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:10:03.522Z"
}