{
  "imdbId": "tt0040457",
  "title": "I Love Trouble",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/I_Love_Trouble_movie",
      "id": "I_Love_Trouble_movie",
      "title": "I Love Trouble",
      "description": "A noirish detective yarn. The script is by Roy Huggins. Please be aware that the video quality is poor.",
      "fileSize": 2278139104,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/I_Love_Trouble_movie",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 119184
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/i-love-trouble-1",
      "id": "i-love-trouble-1",
      "title": "I Love Trouble (1948)",
      "description": "Significantly better print of Roy Huggin's I Love Trouble based on his book Double Take (he also wrote the screenplay). I Love Trouble is the first appearance of his private detective Stuart G. Bailey (Franchot Tone) who would later be played by Efrem Zimbalist Jr. on the hit TV show 77 Sunset Strip. Also on board is Janet Blair, John Ireland and Glenda Farrell (who is hilarious playing Bailey's secretary and assistant). Also watch for a short appearance by Raymond Burr as one of John Ireland's henchmen. It's a terrific noir thriller with enough twists to keep you guessing. ",
      "fileSize": 973904913,
      "addedAt": "2026-01-07T00:08:46.615Z",
      "thumbnail": "https://archive.org/services/img/i-love-trouble-1",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 5032
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xOGV24NrLHA",
      "id": "xOGV24NrLHA",
      "title": "I Love Trouble (1948) | Colorized Public Domain Film Noir Mystery with Franchot Tone",
      "description": "I Love Trouble (1948) is a postwar American film noir mystery directed by S. Sylvan Simon and adapted from the novel The Double Take by Roy Huggins, who would later go on to create hit television series such as Maverick and The Rockford Files. This restored and colorized version of the classic public domain film brings renewed vibrancy to a taut detective thriller that blends hard-boiled dialogue, complex plotting, and the stylish atmosphere of late 1940s Hollywood crime cinema. With its intricate web of lies, missing women, and powerful secrets, I Love Trouble stands as an overlooked but defining example of the noir genre’s fascination with duplicity and moral compromise.\n\nPlot Summary:\nThe story follows Stuart Bailey (Franchot Tone), a suave Los Angeles private detective hired by wealthy Oregon politician Ralph Johnston (Tom Powers) to investigate the background of his new wife, Janet Beal. What appears to be a straightforward job quickly turns into a dangerous labyrinth of deceit, corruption, and double identities. Bailey uncovers that Johnston’s glamorous young wife is not who she claims to be. As he digs deeper, he becomes entangled with a network of missing persons, seedy nightclubs, and ruthless figures willing to kill to protect their secrets.\n\nThe film builds its suspense through Bailey’s relentless pursuit of truth, with each discovery leading to new betrayals and shifting alliances. Along the way, he encounters a cast of enigmatic characters — nightclub owners, shady lawyers, and mysterious women — all of whom may hold the key to the mystery. In true film noir fashion, the deeper Bailey goes, the less clear the morality of those around him becomes. The film culminates in a tense revelation that not only exposes the false identities at the center of the case but also highlights the destructive power of ambition, greed, and corruption.\n\nCast and Crew:\n• Director: S. Sylvan Simon\n• Producer: Milton Feld\n• Screenplay: Roy Huggins, based on his novel The Double Take\n• Cinematography: Charles Lawton Jr.\n• Editing: Gene Havlick\n\nStarring:\n• Franchot Tone as Stuart Bailey\n• Janet Blair as Norma Shannon\n• Janis Carter as Reno Blonde\n• Adele Jergens as Sheryl\n• Steven Geray as Keller\n• Tom Powers as Ralph Johnston\n• John Ireland as Lt. Quint\n\nFilm Significance:\nI Love Trouble is an early screen adaptation of Roy Huggins’ work, notable because the protagonist Stuart Bailey would later serve as the inspiration for Huggins’ long-running private detective character featured in the TV series 77 Sunset Strip. The film is steeped in noir tropes — cynical narration, shadow-filled cinematography, morally ambiguous characters, and a twisting plot where nothing is as it seems. While not as famous as contemporaries like The Big Sleep (1946) or Out of the Past (1947), this film captures the postwar noir atmosphere perfectly, offering modern audiences both an engaging mystery and a valuable cultural time capsule.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like I Love Trouble remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1948 release was produced in stark black and white, an aesthetic that defined film noir but often deters modern casual audiences. By offering a colorized edition, we honor the artistic integrity of the film while making it more appealing to contemporary viewers — especially those in the United States and Europe who are accustomed to color-rich storytelling. This balance of preservation and modernization gives audiences the chance to appreciate classic noir with new vitality.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood — mysteries, noir, comedies, westerns, dramas, and science fiction. Our channel ensures these treasures remain discoverable, enjoyable, and preserved for future generations of film lovers in the USA, Europe, and worldwide.\n\n#ILoveTrouble #FilmNoir #FranchotTone #JanetBlair #PublicDomainMovie #ColorizedClassic #1940sMystery #ClassicHollywood #GoldenAgeCinema #RestoredFilm",
      "addedAt": "2025-12-24T00:47:15.292Z",
      "thumbnail": "https://i.ytimg.com/vi/xOGV24NrLHA/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBeKEAwDw==&rs=AOn4CLCs3vJ9lrBPjhUyL01g3QpzO_4BhA",
      "duration": 5629,
      "language": "en",
      "year": 1948,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ttU662xmD0k",
      "id": "ttU662xmD0k",
      "title": "I Love Trouble (1948) FRANCHOT TONE ♠ FILM NOIR",
      "description": "It's Friday@PizzaFLIX\nStars: Franchot Tone, Janet Blair,  John Ireland, and Adele Jergens\nDirector: S. Sylvan Simon\n\nWhen a fast-talking private eye is hired to investigate the past of a rich man's wife,  he learns there is more to the case than meets the eye!",
      "addedAt": "2025-12-24T01:08:05.701Z",
      "thumbnail": "https://i.ytimg.com/vi/ttU662xmD0k/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCTpheTKK3nLrjtqSYEuCo1HUgGcQ",
      "duration": 5694,
      "language": "en",
      "year": 1948,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1948-i-love-trouble-s.-sylvan-simon-vose",
      "id": "1948-i-love-trouble-s.-sylvan-simon-vose",
      "title": "1948 - I Love Trouble - S. Sylvan Simon - VOSE",
      "description": "For Academic - Educational Use Only https://derechonoir.wordpress.com/",
      "fileSize": 793701499,
      "addedAt": "2026-01-07T00:06:03.999Z",
      "thumbnail": "https://archive.org/services/img/1948-i-love-trouble-s.-sylvan-simon-vose",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 5286
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "93 min",
    "imdbRating": 6.7,
    "imdbVotes": 1130,
    "Genre": "Crime, Film-Noir, Mystery",
    "Plot": "A wealthy man hires a detective to investigate his wife's past. The detective (Franchot Tone) discovers that the wife had been a dancer and left her home town with an actor. The latter is killed before he can talk, but, with the help of a showgirl, the detective learns that the wife had used stolen papers from a girl friend to enter college after she had stolen $40,000 from the night club where she worked. The detective eventually learns that the husband had killed his wife when he discovered her past in order to avoid a scandal, and had hired the detective to try and frame him for the killing.",
    "Director": "S. Sylvan Simon",
    "Writer": "Roy Huggins",
    "Actors": "Franchot Tone, Janet Blair, Janis Carter",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039439",
    "tt0037078",
    "tt0038640",
    "tt0042640",
    "tt0042582",
    "tt0038828",
    "tt0038958",
    "tt0037691",
    "tt0037752",
    "tt0038110",
    "tt0037985",
    "tt0041523"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T17:42:09.024Z"
}