{
  "imdbId": "tt0034371",
  "title": "Wanderers of the West",
  "year": 1941,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r-rUMDMWo-Y",
      "id": "r-rUMDMWo-Y",
      "title": "Wanderers of the West (1941) TOM KEENE🍕 COWBOY WESTERN",
      "description": "Stars: Tom Keene, Sugar Lee, Slim Andrews\nDirector: Robert F. Hill\n\nRide into classic frontier justice with this action-packed 1941 Western, starring legendary cowboy hero Tom Keene, alongside Sugar Lee and Slim Andrews. Directed by veteran filmmaker Robert F. Hill, this gripping tale of revenge and undercover justice is a must-watch for fans of Cowboy Westerns and the golden age of Classic Western films.\n\nWhen a brave rancher takes on the identity of a wanted outlaw, he infiltrates the ruthless gang responsible for his father’s murder. Blending suspense, shootouts, and classic Western grit, this vintage treasure captures the spirit of the Old West like no other.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPresented by PizzaFLIX, this hidden gem from the 1940s features powerful performances, authentic Western atmosphere, and an unforgettable showdown between good and evil. Whether you're a lifelong fan of Tom Keene Westerns, exploring the works of Robert F. Hill, or discovering classic cinema legends like Sugar Lee and Slim Andrews, this film delivers timeless cowboy action and drama.\n\nDon’t forget to like, comment, and subscribe for more classic Western movies, restored for today’s audience.\n\n#TomKeene #ClassicWesterns #CowboyMovies #VintageWesterns #SugarLee #SlimAndrews #RobertFHill #PizzaFLIX #OldWesternMovies #WesternRevenge #1940sWestern",
      "addedAt": "2025-12-24T01:02:57.265Z",
      "thumbnail": "https://i.ytimg.com/vi/r-rUMDMWo-Y/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDv0R5bDah0-JNJ1yO3xAIG4ThyUg",
      "duration": 3534,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 5.4,
    "imdbVotes": 41,
    "Genre": "Western",
    "Plot": "Tom Mallory, posing as a wanted man known as Arizona,is searching the west for the cattle rustler who killed his father, and his only clue is the name Westy Mack. He and his pal Slim meet a ranch foreman, Waco Dean, who is a cattle rustler on the side and is also the hunted Westy Mack. Waco tells Tom he can lead him to Mack if he will help Jake Benson and his men rustle the herd from the ranch Waco works for. Tom learns that the ranch is owned by an old friend of his, Laura Lee, and her ten-year-old sister Sugar.",
    "Director": "Robert F. Hill",
    "Writer": "Robert Emmett Tansey",
    "Actors": "Tom Keene, Sugar Dawn, Slim Andrews",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031772",
    "tt0030972",
    "tt0028712",
    "tt0028865",
    "tt0027789",
    "tt0027874",
    "tt0034108",
    "tt0027167",
    "tt0025006",
    "tt0026260",
    "tt0028491",
    "tt0027006"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:10.010Z"
}