{
  "imdbId": "tt0055256",
  "title": "One, Two, Three",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/one.-two.-three.-1961.720p.-billy-wilder-film-james-cagney-howard-st.-john-pamel",
      "id": "one.-two.-three.-1961.720p.-billy-wilder-film-james-cagney-howard-st.-john-pamel",
      "title": "One Two Three (1961)",
      "description": "C.R. MacNamara will do anything to get a promotion within the Coca-Cola company, including looking after boss W.P. Hazeltine’s rebellious teenage daughter, Scarlett. When Scarlett visits Berlin, where C.R. is stationed, she reveals that she is married to a communist named Otto Piffl – and C.R. recognizes that Otto’s anti-establishment stance will clash with his boss’s own political views, possibly jeopardizing his promotion.",
      "fileSize": 3883712794,
      "addedAt": "2026-01-07T00:10:12.692Z",
      "thumbnail": "https://archive.org/services/img/one.-two.-three.-1961.720p.-billy-wilder-film-james-cagney-howard-st.-john-pamel",
      "collection": "feature_films",
      "downloads": 38034
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "104 min",
    "imdbRating": 7.8,
    "imdbVotes": 23993,
    "Genre": "Comedy",
    "Plot": "Berlin is the epitome of political and economic polarization. A microcosm of that polarization is the life of American C.R. MacNamara, known as Mac to his friends. He is Coca-Cola's head of West Berlin operations, although he feels he deserves to be Coca-Cola's head of European operations based in London. His wife Phyllis wants him to get a steady, stable job back in head office in Atlanta. His West Berlin staff is still used to treating him like their old master, the Führer. The one exception is his secretary Ingeborg, who is the latest in his long line of secretary mistresses. And he's working on a trade agreement of getting Coca-Cola into the Russian market. His life goes into a tailspin when he hosts Scarlett Hazeltine, 17-year-old spoiled partygirl daughter of his Atlanta-based boss, Wendell Hazeltine. Unlike most of the stops she's made on her European trip, Scarlett seems to like West Berlin and stays longer than expected. On the day that Mac learns that Mr. and Mrs. Hazeltine will be in Berlin in 24 hours to retrieve their daughter, he learns that Scarlett has married Otto Ludwig Piffl, a staunch East German Communist. Mac feels this marriage will ruin his career and does whatever he can to get rid of Otto for good and wipe any record of the marriage off the official books. But when Mac further learns that Scarlett is pregnant, he must get Otto back, which is more difficult than getting rid of his was, and to make him respectable in Mr. Hazeltine's eyes. Meanwhile, Phyllis has her own ideas of what is right and wrong in both Scarlett's and Mac's lives and takes appropriate action.",
    "Director": "Billy Wilder",
    "Writer": "Billy Wilder, I.A.L. Diamond, Ferenc Molnár",
    "Actors": "James Cagney, Horst Buchholz, Pamela Tiffin",
    "Language": "English, German, Russian",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 win & 8 nominations total"
  },
  "relatedMovies": [
    "tt0053291",
    "tt0047437",
    "tt0046359",
    "tt0054768",
    "tt0056293",
    "tt0056285",
    "tt0054698",
    "tt0054851",
    "tt0054700",
    "tt0054877",
    "tt0054709",
    "tt0190696"
  ],
  "collections": [
    {
      "id": "billy-wilder",
      "name": "Billy Wilder"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.692Z"
}