{
  "movieId": "tt0054058",
  "title": "Man on a String",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1960-man-on-a-string-pendiente-de-un-hilo-andre-de-toth-vose",
      "id": "1960-man-on-a-string-pendiente-de-un-hilo-andre-de-toth-vose",
      "title": "1960 - Man on a String - Pendiente de un hilo - André De Toth - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "fileSize": 683872644,
      "addedAt": "2026-01-07T00:06:06.564Z",
      "thumbnail": "https://archive.org/services/img/1960-man-on-a-string-pendiente-de-un-hilo-andre-de-toth-vose",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 1603
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/man-on-a-string-1960",
      "id": "man-on-a-string-1960",
      "title": "Man on a String (1960)",
      "description": "U.S. spies catch a Moscow-born U.S. citizen helping spies, and they force him to counterspy. Watch on RetroFlix:  https://retroflix.org/man-on-a-string-1960/",
      "fileSize": 509723885,
      "addedAt": "2026-01-07T00:09:46.425Z",
      "thumbnail": "https://archive.org/services/img/man-on-a-string-1960",
      "language": "eng",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 298
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "92 min",
    "imdbRating": 6.2,
    "imdbVotes": 506,
    "Genre": "Action, Crime, Drama",
    "Plot": "After 1919, Russian Boris Mitrov immigrates to the USA where he becomes an American citizen. Over the decades he builds a career in the film industry. In 1959, Mitrov is a movie producer with many rich influential friends. He continues to cultivate other Russian émigrés like himself and even some members of the Soviet Embassy in Washington. One of his Soviet friends is Embassy official Vladimir \"Vadja\" Kubelov. In reality, Kubelov is a KGB colonel who finds Mitrov useful to the Soviet cause by providing certain services. For instance, Mitrov provides reference letters of employment for various Soviet sleeper agents in the USA. Mitrov throws parties for Soviet diplomats, spies and American Communists such as millionaire bankers Adrian and Helen Benson. All these activities catch the attention of American intelligence agency CBI which places Mitrov and his entourage under close surveillance. When the CBI confronts Mitrov about his activities, he admits it but claims naivete. Eager to loyally serve the USA, Mitrov agrees to be a double-spy for the CBI. Under CBI's guidance Mitrov continues to play useful host to the Soviets to gain their total confidence and penetrate the Kremlin. Thus, Mitrov receives a bogus assignment from the US Government to film in West Berlin. He will be assisted by his assistant, Bob Avery, who is a CBI agent. West Berlin is a hotbed of spies and Mitrov hopes that his Communist contacts will recommend him to the Soviet side. His references are the Communist American bankers, the Bensons, and his friend from the Washington Soviet Embassy, KGB colonel Vladimir Kubelov. The game is on.",
    "Director": "André De Toth",
    "Writer": "Boris Morros, Charles Samuels, John H. Kafka",
    "Actors": "Ernest Borgnine, Kerwin Mathews, Colleen Dewhurst",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0054350",
    "tt0053098",
    "tt0244419",
    "tt0050506",
    "tt0053374",
    "tt0055633",
    "tt0051783",
    "tt0134771",
    "tt1248984",
    "tt0048108",
    "tt0052724",
    "tt0048209"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.425Z"
}