{
  "imdbId": "tt0028311",
  "title": "Stormy Trails",
  "year": 1936,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tblek9z-1xA",
      "id": "tblek9z-1xA",
      "title": "Stormy Trails (1936) REX BELL",
      "description": "Stars: Rex Bell, Bob Terry, Lois Wilde \nDirector: Sam Newfield\n\nA rancher caught in the middle of a bank robbery shoots one of the robbers. However, the dead bandit turns out to be a former ranch hand who was suing him. The rancher is arrested for murder.",
      "addedAt": "2025-12-26T23:42:43.718Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/tblek9z-1xA/maxresdefault.webp",
      "duration": 3547,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 5.9,
    "imdbVotes": 87,
    "Genre": "Western",
    "Plot": "Stanton, with the aid of others, has a land-grab scheme going to take over the ranch owned by Tom Storm and his kid-brother Billy, since Stanton knows there is gold on the property. To complicate matters, Stanton has a henchman file a lawsuit against Storm, and has Billy Storm cheated in a poker game and is holding the I.O.Us over Billy in order to get him to aid Stanton's rustlers. Plus, the bank holds a mortgage on the ranch which is due in a few days. In order to get the money needed to buy the ranch when the bank forecloses, Stanton sends three men to rob the bank, one of them being Spain who is the man who filed the lawsuit. Tom is at the bank when it is held-up and kills the third bandit, Spain, but the other two get away with the money and take it to Spain. Stanton then accuses Tom of intentionally murdering Spain. The gang continues to make raids on Tom's cattle-herd so he won't have the money to pay off the mortgage-note. Stanton deposits the stolen money in the bank, and his gang runs Tom's herd over a cliff, and Tom is also injured in the stampede. The banker has no recourse other than to put the property up at public auction. But the banker has checked the serial-numbers on the money Stanton deposited and knows it is the robbery-money. The auction is held---and Tom IS NOT there---but the banker bids against Stanton, foils his plans and then has him charged with robbery and murder, while Tom is wandering around horseless and helpless. There is also one other man who knows the property has gold on it, and he is the father of Tom's sweetheart. This one has a whole bunch of different side-plots, all of which do get tied together.",
    "Director": "Sam Newfield",
    "Writer": "E.B. Mann, Phil Dunham",
    "Actors": "Rex Bell, Bob Terry, Lois Wilde",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027886",
    "tt0028195",
    "tt0027255",
    "tt0027382",
    "tt0027669",
    "tt0028404",
    "tt0029126",
    "tt0028604",
    "tt0028645",
    "tt0026133",
    "tt0026157",
    "tt0028870"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:28:24.275Z"
}