{
  "movieId": "tt0066565",
  "title": "White Sun of the Desert",
  "year": 1970,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Auj_u7wEyw8",
      "id": "Auj_u7wEyw8",
      "title": "White Sun of the Desert",
      "description": "A Soviet ‘Red Western’ classic. The Russian civil war is over, but Basmachi gangs still roam Central Asia. Fyodor Ivanovich Sukhov, a Red Army soldier, intends to return home to his beloved wife Katerina Matveyevna, but unexpected events force him to stay in the desert. The brutal bandit Abdullah and his gang kill everyone in their path and threaten to destroy the women of their leader’s former harem. \n\nFun facts: Film scholars believed that White Sun of the Desert had much in common with such films as The Passenger by Antonioni, The Sheltering Sky by Bertolucci, and Soviet movie The Thirteen by Mikhail Romm. In 2021, a distant Western reference might be Django Unchained by Quentin Tarantino. Therefore, the genre of the movie is vague. Film critics define the movie as a western, a red western (or eastern), and even an action flick. Many quotes from White Sun of the Desert have become catchphrases in Russian culture. The song Your Noble Highness Lady Fortune, written especially for the movie, became a hit.\n\nThe Red Western as a genre, with films such as The Elusive Avengers, Dauria, At Home Among the Strangers, and White Sun of the Desert, to name a few, became a relevant phenomenon in the Soviet film industry, causing a wave of imitations in the 60-70s, both in central studios and in film studios of the Central Asian republics.\n\nYear of production: 1969\n\nDirected by: Vladimir Motyl \nWritten by: Valentin Ezhov, Rustam Ibragimbekov \nDirector of photography: Eduard Rozovsky \nMusic: Isaac Schwartz \nProduction designer: Valery Kostrin, Bella Manevich \nStarring: Anatoly Kuznetsov, Nikolay Godovikov, Galina Luchai, Spartak Mishulin, Kakhi Kavsadze, Pavel Luspekayev, Tatiana Fedotova\n\nThe film was digitally restored by Mosfilm Cinema Concern\nFind out more: https://cg.mosfilm.ru/en\nSubscribe to our YouTube channel, and be sure to click the bell so that you won’t miss the best Soviet movies! \n\n#eastern #your_honor #western #FullMoviesWithEngSubs",
      "addedAt": "2025-12-23T03:45:54.561Z",
      "thumbnail": "https://i.ytimg.com/vi/Auj_u7wEyw8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDrBTA-P-Tkp57mPd0HAzzbBzEhmw",
      "duration": 5007,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WhiteSunOfTheDesert",
      "id": "WhiteSunOfTheDesert",
      "title": "White Sun of the Desert",
      "description": "\"White Sun of the Desert\" (Beloye solntse pustyni). It is the Soviet film, easterly \"western\". In the movie narrate about adventures of Red Army man Fyodor Sukhov. He rescues from gangster Abdullah its harem in days of civil war. One of the most known films in the history of the Soviet cinema. Many critics and spectators name this film as \"cult movie\". Phrases of heroes of a film have steadily entered into colloquial Russian. Director: Vladimir Motyl Authors of the scenario: Valentin Yezhov, Rustam Ibragimbekov, Mark Zakharov In roles: Anatoly Kuznetsov, Pavel Luspekaev, Spartak Mishulin, Kakhi Kavsadze, Nikolay Godovikov Director of photography: Edward Rozovsky Composer: Isaak Schwarz Movie studio: \"Mosfilm\"",
      "fileSize": 1936062305,
      "addedAt": "2026-01-07T00:07:11.888Z",
      "thumbnail": "https://archive.org/services/img/WhiteSunOfTheDesert",
      "language": "russian",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 36651
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "84 min",
    "imdbRating": 7.7,
    "imdbVotes": 8323,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "A soldier of the Red Army named Sukhov has been fighting in the Russian Civil War in Russian Asia for many years. Just as he is about to return home to his wife, Sukhov is chosen to guard and protect the harem of a guerilla leader (Abdulla). Abdulla is wanted by the Red Army and left his harem behind because the women hindered him. Sukhov's task proves to be more difficult than he imagined...",
    "Director": "Vladimir Motyl",
    "Writer": "Rustam Ibragimbekov, Valentin Yezhov, Mark Zakharov",
    "Actors": "Anatoliy Kuznetsov, Pavel Luspekayev, Spartak Mishulin",
    "Language": "Russian",
    "Country": "Soviet Union",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0069095",
    "tt0061550",
    "tt0168838",
    "tt0023243",
    "tt0041098",
    "tt0046414",
    "tt0039133",
    "tt0023808",
    "tt0031124",
    "tt0017925",
    "tt0056026",
    "tt0036161"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-21T02:17:03.932Z"
}