{
  "imdbId": "tt0026216",
  "title": "The Lost City",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheLostCity1935",
      "id": "TheLostCity1935",
      "title": "The Lost City",
      "description": "Title: The Lost City Summary: An evil scientist plots to take over the world from his base in Africa, where he has invented a machine that can cause earthquakes. Directed by: Harry Revier Actors: Production Company: Super Serial Productions Inc. Release Date: 6 March 1935 (USA) Aspect Ratio: 1.37 : 1 After a series of electrical storms disrupts the world, electrical engineer Bruce Gordon develops a machine to trace the cause of the disasters. He discovers that the source is in central Africa and, backed by the nations of the world, sets out on an expedition. Bruce learns that the disturbances emanate from an area called the Magnetic Mountain. But unknown to our hero and his pal Jerry, the Magnetic Mountain also contains a super-advanced secret city ruled by the tyrannical scientific wizard named Zolok, who has unleashed the electrical fury threatening civilization as part of his plan to conquer the world. Zolok has under his control a brilliant inventor, Manyus, Manyus' beautiful daughter Natcha and an army of giant African slaves, who follow the dictates of a strongman, Appolyn, and Gorza, a dwarf. Also in the mix are schemers Reynolds and Colton, who plan to capture Manyus and thereby gain control of Zolok's army, and a double-crossing fellow explorer named Butterfield. Can ...",
      "fileSize": 1688360504,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheLostCity1935",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 5575
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ntfru50GeMM",
      "id": "Ntfru50GeMM",
      "title": "The Lost City (1935) 12-CHAPTER MARATHON of MADNESS",
      "description": "12-CHAPTER SERIAL MARATHON!\nStarring: William \"Stage\" Boyd, Kane Richmond, Claudia Dell, Josef Swickard\nDirected by: Harry Revier\n\nBy far the craziest serial I have ever seen. It's as if Quentin Tarantino stepped into a time machine and returned to 1935 to produce this 12-chapter marathon of madness. \n\n  🍕CHAPTERS🍕\n0:00       PizzaFLIX Intro\n01:08     CHAPTER 1:  Living Dead-Men\n28:58     CHAPTER 2:  The Tunnel of Flame\n49:39     CHAPTER 3:  Dagger Rock\n1:09:33  CHAPTER 4:  Doomed\n1:28:05  CHAPTER 5:  Tiger Prey\n1:47:40  CHAPTER 6:  Human Beasts\n2:06:08  CHAPTER 7:  Spider Men\n2:23:14  CHAPTER 8:  Human Targets\n2:40:51  CHAPTER 9:  Jungle Vengeance\n3:03:57  CHAPTER 10: The Lion Pit\n3:22:22  CHAPTER 11: Death Ray\n3:42:56  CHAPTER 12: The Mad Scientist\n4:01:20  Please Subscribe!",
      "addedAt": "2025-12-24T01:05:27.184Z",
      "thumbnail": "https://i.ytimg.com/vi/Ntfru50GeMM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC6J43ZXpetrJtXv92ZHmMSZdFkww",
      "duration": 14496,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 4.9,
    "imdbVotes": 326,
    "Genre": "Action, Adventure, Romance",
    "Plot": "After a series of electrical storms disrupts the world, electrical engineer Bruce Gordon develops a machine to trace the cause of the disasters. He discovers that the source is in central Africa and, backed by the nations of the world, sets out on an expedition. Bruce learns that the disturbances emanate from an area called the Magnetic Mountain. But unknown to our hero and his pal Jerry, the Magnetic Mountain also contains a super-advanced secret city ruled by the tyrannical scientific wizard named Zolok, who has unleashed the electrical fury threatening civilization as part of his plan to conquer the world. Zolok has under his control a brilliant inventor, Manyus, Manyus' beautiful daughter Natcha and an army of giant African slaves, who follow the dictates of a strongman, Appolyn, and Gorza, a dwarf. Also in the mix are schemers Reynolds and Colton, who plan to capture Manyus and thereby gain control of Zolok's army, and a double-crossing fellow explorer named Butterfield. Can Bruce evade Zolok's \"destroying rays\" and stop his dreams of world conquest?",
    "Director": "Harry Revier",
    "Writer": "Zelma Carroll, George M. Merrick, Robert Dillon",
    "Actors": "William 'Stage' Boyd, Kane Richmond, Claudia Dell",
    "Language": "French, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027007",
    "tt0282813",
    "tt0029130",
    "tt0026038",
    "tt0019194",
    "tt0029847",
    "tt0030798",
    "tt0027517",
    "tt0024245",
    "tt0165992",
    "tt0026772",
    "tt0058589"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}