{
  "imdbId": "tt0037001",
  "title": "Lady in the Death House",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lady_in_the_death_house",
      "id": "lady_in_the_death_house",
      "title": "Lady in the Death House",
      "description": "Mary Logan (Jean Parker) is accused of murdering a blackmailer (Uncredited) who threatens to tell her boss, Mr. Gregory (George Irving), that she was the daughter of Tom Logan, a racketeer he prosecuted. It's up to psychologist/criminologist Charles Finch (Lionel Atwill) to connect the dots when the police take the easy way out and arrest, try, convict, and sentence her to execution. Once he figures out who really dunit he and Mary's sister (Marcia Mae Jones) race against the warden's wall clock to get the governor (Uncredited) to postpone the execution while Mary's girlfriend Dr. Dwight Bradford (Douglass Fowley), the state executioner, procrastinates on throwing the switch and buying some War Bonds. [Synopsis by uniQ .] You can find more information regarding this film on its IMDb page .",
      "fileSize": 4496398102,
      "addedAt": "2026-01-07T00:09:24.703Z",
      "thumbnail": "https://archive.org/services/img/lady_in_the_death_house",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 94271
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mkYXM5LT9bM",
      "id": "mkYXM5LT9bM",
      "title": "Lady in the Death House (1944) [Film Noir] [Drama]",
      "description": "Mary Kirk Logan is led from her cell to the electric chair, to be \"killed by the hand of the man I love.\" A psychologist and criminologist, Charles Finch, tells her story. They first meet in a bar when Mary's dress catches fire. Dr. Bradford, having drinks with Finch, helps extinguish the fire. He takes Mary home and they fall in love.\n\nBradford is a scientist who hopes to develop a way to revive dead tissue. He works as an executioner for the state. Mary won't marry him unless he quits this profession. A blackmailer is killed in Mary's apartment and she is arrested and tried. Her teenaged sister Suzy is the key to the case. Finch gets her to identify the real killer, but a race against time begins to find the governor so he can stop the excution. Bradford holds off the warden and guards until Finch can save the day.\n\n---\n\nDirected by Steve Sekely, produced by Harry D. Edwards (associate producer) and Jack Schwarz (producer), written by Frederick C. Davis (story) and Harry O. Hoyt (screenplay), starring Jean Parker as Mary Kirk Logan, Lionel Atwill as Charles Finch, Douglas Fowley as Dr. Dwight 'Brad' Bradford, Marcia Mae Jones as Suzy Kirk Logan, Robert Middlemass as State's Attorney, Cy Kendall as Detective, John Maxwell as Robert Snell, George Irving as Gregory, Forrest Taylor as Warden, Sam Flint as Governor Harrison and Dick Curtis as Willis Millen. \n\n---\n\nSource: \"Lady in the Death House\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 4 Apil 2013. Web. 05 May 2013. http://en.wikipedia.org/wiki/Lady_in_the_Death_House.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:26.274Z",
      "thumbnail": "https://i.ytimg.com/vi/mkYXM5LT9bM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA5_n0UdEbWoG7qi_boo4_Z0Lmt_A",
      "duration": 3325,
      "language": "en",
      "year": 1944,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4CodRPDmsJc",
      "id": "4CodRPDmsJc",
      "title": "Lady in the Death House (1944) | Colorized Public Domain Crime Noir | Jean Parker and Lionel Atwill",
      "description": "Lady in the Death House (1944) is an American crime noir thriller directed by Steve Sekely, blending psychological tension, mystery, and moral conflict in a haunting story of love and justice. This colorized restoration from Colorized Public Domain revives one of the forgotten gems of 1940s low-budget cinema, originally produced by Producers Releasing Corporation, a studio known for dark, gripping narratives that reflected wartime America’s anxieties and fascination with crime.\n\nPlot Summary:\nMary Kirk Logan (Jean Parker), a brilliant but misunderstood scientist, finds herself on death row for a murder she swears she did not commit. Her alleged victim, a man named Harry Wharton, had been blackmailing her, and when he turns up dead, all evidence points to Mary. Despite her pleas of innocence, the court convicts her, and the clock begins ticking toward her execution.\n\nEnter Dr. Charles Finch (Lionel Atwill), a distinguished criminologist and psychologist who believes in Mary’s innocence. Haunted by his own moral failures and driven by a sense of justice, Dr. Finch races against time to uncover the truth. His investigation reveals a tangle of deceit involving Mary’s estranged sister, a manipulative lover, and corrupt officials who value expediency over truth. The story unfolds through suspenseful twists, hidden motives, and revelations that challenge the boundary between law and morality.\n\nAs Mary’s final hours approach, the film builds to a nerve-wracking climax in the death chamber, with Dr. Finch confronting both the true killer and his own haunted conscience. The tension of the execution sequence captures the moral dilemmas of capital punishment and the fragility of justice during the 1940s wartime era.\n\nCast and Crew:\n• Director: Steve Sekely\n• Producer: Sigmund Neufeld\n• Screenplay: Frederick C. Davis and Leslie T. White\n• Cinematography: Marcel Le Picard\n• Music: Leo Erdody\n\nStarring:\n• Jean Parker as Mary Kirk Logan\n• Lionel Atwill as Dr. Charles Finch\n• Douglas Fowley as Edward Wharton\n• Marcia Mae Jones as Susie Kirk\n• Cy Kendall as District Attorney\n• Herbert Rawlinson as Warden\n• Claire Whitney as Mrs. Finch\n• John Maxwell as Reporter\n\nFilm Significance:\nLady in the Death House stands as a prime example of 1940s noir storytelling: lean, tense, and morally ambiguous. Though made outside the major studios, it rivals many bigger productions in its psychological depth and suspenseful pacing. The film offers one of Jean Parker’s strongest dramatic performances and a late-career highlight for Lionel Atwill, whose brooding presence lends gravity to every scene. Its examination of crime, redemption, and flawed justice mirrors post-war America’s cultural fears and fascination with moral reckoning.\n\nThis public domain classic also captures the aesthetics of the Poverty Row film era — efficient storytelling, shadow-heavy cinematography, and emotional realism. Despite its modest budget, the film’s sharp dialogue and emotional urgency continue to resonate with modern audiences.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Lady in the Death House remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1944 original was filmed in stark black and white, emphasizing noir shadows and moral uncertainty. This new colorized version maintains the atmosphere of tension while enhancing visual clarity for today’s high-definition screens. For viewers watching on televisions — which make up over half of Colorized Public Domain’s audience — this edition provides richer tone contrast and greater immersion, especially during the climactic execution scenes. The color restoration highlights costume details, facial expressions, and the cold realism of the prison setting, bringing new emotional depth to the film’s classic noir tension.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including forgotten noir thrillers, romantic dramas, and suspense classics. Our work preserves cinematic history and keeps it accessible for audiences across the United States, Europe, and around the world.\n\n#LadyInTheDeathHouse #JeanParker #LionelAtwill #1940sNoir #PublicDomainMovie #ColorizedClassic #ClassicHollywood #CrimeThriller",
      "addedAt": "2025-12-24T00:47:01.663Z",
      "thumbnail": "https://i.ytimg.com/vi/4CodRPDmsJc/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBYKEQwDw==&rs=AOn4CLCDO8KHgcgzmZfO32NzKIjdAvn6-w",
      "duration": 3208,
      "language": "en",
      "year": 1944,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y6ZozfsxzXE",
      "id": "Y6ZozfsxzXE",
      "title": "Lady In The Death House (1944) CRIME-THRILLER",
      "description": "Stars: Jean Parker, Lionel Atwill, Douglas Fowley\n Director: Steve Sekely\n\n A young woman is on death row for the murder of a man who was blackmailing her family, although she claims she was framed. Her fiance, a doctor who is conducting experiments on reviving the dead, also happens to be the state's executioner, and is assigned to pull the switch when she is strapped into the electric chair. A famous criminologist, believing her to be innocent, rushes to investigate the case and clear her before her execution date.",
      "addedAt": "2025-12-26T23:53:47.745Z",
      "thumbnail": "https://i.ytimg.com/vi/Y6ZozfsxzXE/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLAhWwJ8LRS0O-JIopp-DB1hk9maMA",
      "duration": 3325,
      "language": "en",
      "year": 1944,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZQyGoCLNWVY",
      "id": "ZQyGoCLNWVY",
      "title": "Lady in the Death House (1944) Crime, Drama, Film Noir Classic",
      "description": "A young woman is on death row for the murder of a man who was blackmailing her family, although she claims she was framed.\n\nDirector: Steve Sekely\nProducer: Harry D. Edwards \nStarring : Jean Parker, Lionel Atwill, Douglas Fowley\nGenre: Crime, Drama, Film-Noir, Romance\n\n@CCC socials:\nFB : https://www.facebook.com/CultCinemaClassics \nIG : https://www.instagram.com/cultcinemaclassics -\nhttps://www.twitch.tv/cultcinema",
      "addedAt": "2025-12-27T00:50:30.514Z",
      "thumbnail": "https://i.ytimg.com/vi/ZQyGoCLNWVY/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLCoi06Zeiw5ZMpYaSEyoHht72bCsA",
      "duration": 3198,
      "language": "en",
      "year": 1944,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1944-lady-in-the-death-house-steve-sekely-vose",
      "id": "1944-lady-in-the-death-house-steve-sekely-vose",
      "title": "1944 - Lady in the Death House - Steve Sekely - VOSE",
      "description": "For Academic - Educational Use Only https://derechonoir.wordpress.com/",
      "fileSize": 858991563,
      "addedAt": "2026-01-07T00:06:03.997Z",
      "thumbnail": "https://archive.org/services/img/1944-lady-in-the-death-house-steve-sekely-vose",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 783
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "56 min",
    "imdbRating": 5.3,
    "imdbVotes": 429,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "A young woman is on death row for the murder of a man who was blackmailing her family, although she claims she was framed. Her fiance, a doctor who is conducting experiments on reviving the dead, also happens to be the state's executioner, and is assigned to pull the switch when she is strapped into the electric chair. A famous criminologist, believing her to be innocent, rushes to investigate the case and clear her before her execution date.",
    "Director": "Steve Sekely",
    "Writer": "Frederick C. Davis, Harry O. Hoyt",
    "Actors": "Jean Parker, Lionel Atwill, Douglas Fowley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037109",
    "tt0037446",
    "tt0036743",
    "tt0036775",
    "tt0037075",
    "tt0036260",
    "tt0037318",
    "tt0037469",
    "tt0036711",
    "tt0036790",
    "tt0037325",
    "tt0038057"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T17:39:33.982Z"
}