{
  "movieId": "tt0029374",
  "title": "Paradise Isle",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sj4qJvbOoQU",
      "id": "sj4qJvbOoQU",
      "title": "Paradise Isle (1937) | Colorized Public Domain Romantic Drama with Movita and Warren Hull Restored",
      "description": "Paradise Isle (1937) is a romantic adventure drama directed by Arthur Greville Collins and produced by Dorothy Davenport for Monogram Pictures. This restored and colorized public domain edition revives a rare gem of 1930s island cinema, blending exotic escapism, human compassion, and cross-cultural romance. Originally filmed in black and white, Paradise Isle reflects Depression-era audiences’ fascination with South Seas adventure and the moral contrast between Western ambition and island innocence. Through high-quality restoration and colorization, Colorized Public Domain brings back the lush beauty and emotional intensity that once captivated moviegoers nearly a century ago.\n\nPlot Summary:\nSet in the breathtaking islands of the South Pacific, Paradise Isle follows Gerald King (Warren Hull), a down-on-his-luck artist who becomes stranded after a shipwreck. Blind and disillusioned, Gerald is rescued by Ida (Movita), a kindhearted native island woman who brings him to her home and nurses him back to health. Despite cultural barriers and his initial despair, a tender connection forms between the two.\n\nAs Gerald recovers, Ida sacrifices much to restore his sight — secretly seeking help from Dr. Matson (Pierre Watkin), a passing physician who can perform a sight-saving operation. Her love is tested when Gerald, once healed, faces a painful choice between returning to his old life or staying with the woman who saved him. The film explores love’s redemptive power, moral duty, and the clash between Western materialism and the island’s purity.\n\nCast and Crew:\n• Director: Arthur Greville Collins\n• Producer: Dorothy Davenport\n• Screenplay: Ray Trampe and Dorothy Reid\n• Cinematography: Gilbert Warrenton\n• Editing: Russell F. Schoengarth\nStarring:\n• Movita as Ida\n• Warren Hull as Gerald King\n• Pierre Watkin as Dr. Matson\n• William Newell as Binky\n• John Rogers as Captain Slade\n\nFilm Significance:\nParadise Isle stands as an early example of Hollywood’s “South Seas romanticism” — a genre that shaped adventure and romance narratives before World War II. Movita, who later gained wider recognition for her roles in Mutiny on the Bounty (1935) and The Hurricane (1937), delivers one of her most emotionally sincere performances here. Her portrayal of Ida carries both dignity and grace, challenging early Hollywood’s limited portrayals of Pacific Islander women.\n\nWhile filmed on modest sets, the film’s tropical atmosphere and heartfelt message resonated with audiences of the 1930s seeking escape from Depression-era struggles. Its exploration of compassion, love, and redemption across cultures makes it a lasting artifact of Hollywood’s fascination with paradise and loss.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Paradise Isle remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1937 release reflected Hollywood’s fascination with escapist romance and moral redemption amid lush island settings. While the black-and-white version conveyed atmosphere, this colorized edition transforms it into a visually vibrant experience. For audiences aged 55 and older — especially in the United States and Europe — the restored version rekindles nostalgia for early Hollywood storytelling while introducing younger viewers to forgotten performances and heartfelt narrative simplicity. Colorization enhances the island beauty, emphasizing its natural serenity and emotional depth.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from Hollywood’s Golden Age — from forgotten romantic dramas to adventure epics. Our mission is to preserve cinematic history while making it visually captivating for modern audiences across the USA, Europe, and beyond.\n\n#ParadiseIsle #1930sRomance #ColorizedClassic #PublicDomainMovie #Movita #WarrenHull #SouthSeasAdventure #ClassicHollywood #FilmRestoration #GoldenAgeCinema #1937Movies #VintageRomance #RestoredClassic #OldHollywoodLoveStory #CulturalDrama",
      "addedAt": "2025-12-24T00:49:25.369Z",
      "thumbnail": "https://i.ytimg.com/vi/sj4qJvbOoQU/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYUSBeKGUwDw==&rs=AOn4CLCpsTNyFdqXRlXnn2g25oweQ4UJlA",
      "duration": 4174,
      "language": "en",
      "year": 1937,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/paradise_isle",
      "id": "paradise_isle",
      "title": "Paradise Isle",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 5300289840,
      "addedAt": "2026-01-07T00:10:12.695Z",
      "thumbnail": "https://archive.org/services/img/paradise_isle",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 68979
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/paradise_isle_ipod",
      "id": "paradise_isle_ipod",
      "title": "Paradise Isle",
      "description": "A blind artist is on his way to Java to see a doctor about an operation to restore his sight when the ship sinks and he washes up on a tropical island.",
      "fileSize": 1393316637,
      "addedAt": "2026-01-07T00:10:12.696Z",
      "thumbnail": "https://archive.org/services/img/paradise_isle_ipod",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 52972
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g5oKGNs7Yro",
      "id": "g5oKGNs7Yro",
      "title": "Paradise Isle (1937) ISLAND ROMANCE",
      "description": "Stars: Movita, Warren Hull, William B. Davidson\nDirector: Arthur Greville\n\nA blind artist is on his way to Java when his ship sinks and he washes up on a tropical island. A beautiful native girl finds him and nurses him back to health.",
      "addedAt": "2025-12-26T23:45:45.583Z",
      "thumbnail": "https://i.ytimg.com/vi/g5oKGNs7Yro/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCcWAnY6nGhA__f0zBkmLrNffaOTA",
      "duration": 4222,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "73 min",
    "imdbRating": 5.2,
    "imdbVotes": 76,
    "Genre": "Adventure, Drama, Music",
    "Plot": "A blind artist is on his way to Java to see a doctor about an operation to restore his sight when the ship sinks and he washes up on a tropical island. A native girl finds him and begins to nurse him back to health. However, the girl's boyfriend wants the artist out of the picture so he can have her to himself, and the only other white man on the island also wants the artist out or the picture so he can cheat the girl out of her prized possession, a large black pearl.",
    "Director": "Arthur Greville Collins",
    "Writer": "Allan Vaughan Elston, Marion Orth",
    "Actors": "Movita, Warren Hull, William B. Davidson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029745",
    "tt0026131",
    "tt0026966",
    "tt0031313",
    "tt0030710",
    "tt0031190",
    "tt0032139",
    "tt0028827",
    "tt0030143",
    "tt0038046",
    "tt0029000",
    "tt0029119"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.696Z"
}