{
  "imdbId": "tt0039020",
  "title": "That Brennan Girl",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/that-brennan-girl-1946_202505",
      "title": "That Brennan Girl (1946)",
      "description": "Raised by Natalie Brennan, a flamboyant and irresponsible mother, Ziggy Brennan gets involved in hustling men at a young age. She hangs around with a wild crowd and learns gets her \"street smarts\" first from her mother, who wants everyone to think they are sisters, and then from Denny Reagan, an older man. He starts teaching her his tricks of the trade and she falls right in line with his crooked ways. Then one night she meets Martin J. 'Mart' Neilson, a tall, handsome, honest farmer boy who's a sailor and they fall in love. While he's away fighting the war, she discovers she's pregnant. Watch on RetroFlix:  https://retroflix.org/that-brennan-girl-1946/",
      "id": "that-brennan-girl-1946_202505"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/that_brennan_girl",
      "title": "That Brennan Girl",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "that_brennan_girl"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YWoI0NKA64A",
      "title": "That Brennan Girl (1946) DRAMA",
      "description": "Stars: Mona Freeman, James Dunn, William Marshall\nDirector: Alfred Santell\n\nA selfish San Franciscan loses a husband in the war and marries a reformed racketeer.",
      "id": "YWoI0NKA64A",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "95 min",
    "imdbRating": "6.4",
    "imdbVotes": "364",
    "Genre": "Drama, Romance",
    "Plot": "The film begins on Mother's Day 1938 when 14-year-old Ziggy Brennan (Mona Freeman) buys a gardenia for her mother. Ziggy's youthful exuberance disappears when she enters their apartment and finds her mother Natalie (June Duprez) drinking with a strange man. Natalie introduces Ziggy as her \"sister\" and quietly cautions Ziggy against calling her \"mother.\" Later, dispensing some motherly advice, Natalie tells Ziggy that if she learns all the tricks, she'll never need to work for a living. Ziggy goes right out and applies parts of this advice by stealing a valuable lapel pin from a fellow high-school student, and is promptly expelled from school. About five years later, Ziggy has made progress and meets Denny Reagan (James Dunn), who persuades her to go into his racket. Ziggy's role is to telephone people who are planning to move and make arrangements to provide a truck to move the furniture. The departing truck is the last that the owners see of their furniture as it is taken to a warehouse and sold by Denny and his gang. Hanging out in a nightclub one evening, circa 1943, the still-underage Ziggy flirts with a young naval officer from Minnesota, Mart Neilson (William Marshall), who promptly falls in love with her and proposes marriage. To ensure that Mart knows her background, Ziggy introduces him to Natalie (at her worst), but Mart still insists on the marriage. Shortly after the wedding ceremony, Mart is shipped out to war-duty and is killed in action. Ziggy learns that she is expecting a baby, while the law catches up to Denny and ships him out to prison. Ziggy is still living with her mother but Natalie, horrified at the prospect of being a grandmother, kicks her out and Ziggy moves into Mrs. Merryman's (Rosalind Ivan) boardinghouse. Ziggy has the baby and some time passes, circa 1944-45, and Ziggy--still making her nightclub rounds--runs into the just-paroled Denny. This Denny is a new-and-thoughtful version, and he does not approve of Ziggy leaving her baby with a sitter while she makes her rounds. Denny shows great interest in the baby and sees more and more of Ziggy. Returning from a date, Ziggy finds the baby's crib vacant. In her absence the babysitter had gone out to her boyfriend's car for some heavy necking and the baby had almost choked to death before being discovered by Mrs. Merryman, who promptly called the police. At the trial, the babysitter denies responsibility (negligence-of-duty) and Ziggy loses custody of her baby. The new-and-thoughtful Denny will have nothing to do with Ziggy, although his mother, knowing that Denny and Ziggy really love each other, tries to bring them together--but Ziggy has disappeared. Having moved to another boardinghouse, she drops by a church and finds an abandoned baby. Denny finds her and the baby sunning in a park and is impressed and thinks she's become the perfect mother. With Denny's help, Ziggy appeals her case to regain custody of her own child, and when the judge learns that she has been caring for an abandoned baby, he is much impressed and returns her own infant to her.",
    "Director": "Alfred Santell",
    "Writer": "Adela Rogers St. Johns, Doris Anderson",
    "Actors": "James Dunn, Mona Freeman, William Marshall",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0029050",
      "title": "Internes Can't Take Money",
      "year": 1937,
      "imdbRating": "6.8",
      "imdbVotes": "823",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018253",
      "title": "The Patent Leather Kid",
      "year": 1927,
      "imdbRating": "6.1",
      "imdbVotes": "554",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036892",
      "title": "The Hairy Ape",
      "year": 1944,
      "imdbRating": "6.1",
      "imdbVotes": "472",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0038342",
      "title": "Bedelia",
      "year": 1946,
      "imdbRating": "6.6",
      "imdbVotes": "397",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038988",
      "title": "The Strange Love of Martha Ivers",
      "year": 1946,
      "imdbRating": "7.4",
      "imdbVotes": "11,780",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038990",
      "title": "The Strange Woman",
      "year": 1946,
      "imdbRating": "6.5",
      "imdbVotes": "2,520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038592",
      "title": "Heartbeat",
      "year": 1946,
      "imdbRating": "5.9",
      "imdbVotes": "853",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039114",
      "title": "Young Widow",
      "year": 1946,
      "imdbRating": "6.0",
      "imdbVotes": "338",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038733",
      "title": "A Matter of Life and Death",
      "year": 1946,
      "imdbRating": "8.0",
      "imdbVotes": "26,640",
      "language": "English, French, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038398",
      "title": "Carnival",
      "year": 1946,
      "imdbRating": "5.9",
      "imdbVotes": "164",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037578",
      "title": "Caravan",
      "year": 1946,
      "imdbRating": "6.2",
      "imdbVotes": "256",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038492",
      "title": "Dragonwyck",
      "year": 1946,
      "imdbRating": "6.9",
      "imdbVotes": "5,595",
      "language": "English, French, Dutch",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}