{
  "imdbId": "tt0012512",
  "title": "Now or Never",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-now-or-never",
      "id": "silent-now-or-never",
      "title": "Now or Never",
      "fileSize": 770219617,
      "addedAt": "2026-01-07T00:11:07.410Z",
      "thumbnail": "https://archive.org/services/img/silent-now-or-never",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 309
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "35 min",
    "imdbRating": 6.7,
    "imdbVotes": 899,
    "Genre": "Comedy, Short",
    "Plot": "Mary is a nanny to an infant girl named Dolly, neglected by her parents in their own self-absorbed lives. Mary is scheduled to go on vacation, she going home to meet her childhood sweetheart, his childhood promise to her to meet her on her eighteenth birthday, which is upcoming. However, feeling Dolly will be all alone, Mary decides to take Dolly with her, Mary not having asked her parents' permission in their neglect. Mary meets her beau on the train to their hometown, unaware of the trials he has had to make it this far, he on board the train without a ticket or money which he lost en route. Mary also sees Dolly's father on board, he who is off to a business meeting. Not wanting to let Dolly's father see Dolly on board the train with her, Mary leaves Dolly with her beau while she spends time with the father. The beau's inexperience with child caring and his attempts to evade the train conductor who is checking for tickets leads to one misadventure after another for the beau and Dolly on the train.",
    "Director": "Fred C. Newmeyer, Hal Roach",
    "Writer": "H.M. Walker, Sam Taylor",
    "Actors": "Harold Lloyd, Mildred Davis, Anna Mae Bilson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0012499",
    "tt0011922",
    "tt0012303",
    "tt0011521",
    "tt0011263",
    "tt0011293",
    "tt0010258",
    "tt0011144",
    "tt0011223",
    "tt0010146",
    "tt0013472",
    "tt0010311"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.410Z"
}