{
  "movieId": "tt0076460",
  "title": "Proof of the Man",
  "year": 1977,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VRjmqyuG2Kg",
      "id": "VRjmqyuG2Kg",
      "title": "GWYNETH PALTROW & ANTHONY HOPKINS in THE PROOF (full movie in German, complete movies in German)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Mehrfach ausgezeichneter Mystery-Film mit absoluter Star-Besetzung – GWYNETH PALTROW (\"Shakespeare in Love\" & \"Iron Man\"), ANTHONY HOPKINS (\"Das Schweigen der Lämmer\" & \"Hitchcock\") & JAKE GYLLENHAAL (\"Prisoners\" & \"Nightcrawler\"): Catherine kämpft nach dem Tod ihres genialen Vaters mit Angst und Zweifel. Als ein bahnbrechendes Manuskript auftaucht, geraten sie, ihr Bruder und ihr Vaterfreund in ein spannendes Ringen um Wahrheit, Vertrauen und Genialität.\n\nDER BEWEIS (2005)\nOriginaltitel: Proof \nMit: Gwyneth Paltrow, Anthony Hopkins, Hope Davis, Jake Gyllenhaal\nRegie: John Madden\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nDer Film erzählt die Geschichte von Catherine (Gwyneth Paltrow), der Tochter eines brillanten, aber geistig labilen Mathematikers (Anthony Hopkins). Nach dessen Tod kämpft sie mit eigenen Ängsten vor geistiger Instabilität und ihrem Talent für Mathematik. Als ein außergewöhnliches Manuskript entdeckt wird, geraten Catherine, ihr entfremdeter Vaterfreund (Jake Gyllenhaal) und ihr Bruder (Hope Davis) in einen emotionalen Konflikt: Wer ist der Autor des bahnbrechenden Beweises, und wie viel von ihrem eigenen Potenzial darf Catherine zeigen? Der Film behandelt Themen wie Genialität, Wahnsinn, Vertrauen und familiäre Bindungen.\n#gwynethpaltrow #jakegyllenhaal #anthonyhopkins\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:35:11.649Z",
      "thumbnail": "https://i.ytimg.com/vi/VRjmqyuG2Kg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA0kNmRjgdQjGN7-XUuN-JbqJ0H-A",
      "duration": 6007,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "100 min",
    "imdbRating": 6.5,
    "imdbVotes": 465,
    "Genre": "Crime, Drama",
    "Plot": "Jonny Hayward, a black American, travels to Japan, but is murdered there. Detective Munusue is one of the team of detectives investigating the killing. Munusue begins to suspect that rising fashion designer Kyoko Yasugi may have either information or actual involvement in the murder. When Yasugi's son Kyohei flees to America after a hit-and-run killing, Detective Munusue goes to New York and teams up uncomfortably with NYPD detective Ken Shuftan to find Kyohei and to get information from Jonny Hayward's father, who was stationed in Japan after the war. Munusue, whose father was beaten to death by American G.I.s when the detective was a boy, must confront his own vengeful antagonism to former U.S. soldiers in order to solve the case.",
    "Director": "Jun'ya Satô",
    "Writer": "Zenzô Matsuyama, Seiichi Morimura",
    "Actors": "George Kennedy, Mariko Okada, Yûsaku Matsuda",
    "Language": "Japanese, English",
    "Country": "Japan, United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0074342",
    "tt0076024",
    "tt0074634",
    "tt0078144",
    "tt0077118",
    "tt0077549",
    "tt0333955",
    "tt0074836",
    "tt0077928",
    "tt0075263",
    "tt0074691",
    "tt0073774"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:26:56.177Z"
}