{
  "imdbId": "tt0016005",
  "title": "Lady of the Night",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-lady-of-the-night",
      "id": "silent-lady-of-the-night",
      "title": "Lady of the Night",
      "fileSize": 1140475611,
      "addedAt": "2026-01-07T00:11:07.407Z",
      "thumbnail": "https://archive.org/services/img/silent-lady-of-the-night",
      "language": "English",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 33652
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "70 min",
    "imdbRating": 6.7,
    "imdbVotes": 784,
    "Genre": "Drama, Romance",
    "Plot": "Lady of the Night ~ the story of two baby girls, born near in proximity, but worlds apart in life, - Molly Helmer, the daughter of a thief, and Florence Banning the daughter of the judge who would send Molly's father to prison. The girls' lives come together as young women at eighteen as Florence leaves the security of the exclusive Girls Select School, and Molly, now orphaned, begins her life free from reform school. Norma Shearer plays both young women, but the apparent differences in their worldliness will also make them most unfamiliar in appearance. Molly's new world consists of nights at Kelly's Dance Hall and her ever-present worshiper, Chunky Dunn. On one of her nightly dance hall outing's Molly meets David Page, an up and coming inventor, whom she quickly falls in love with. Molly persuades David to seek an honest buyer for his new safe-cracking device; against the advice of Chunky whose shadier side see's this as an opportunity for himself, and to corrupt David in the process. Following Molly's advice, David meets with a group of investors, including the now retired Judge Banning, father of Florence. While at the Judges' home, David meets Florence and is instantly engaged by her charm and innocence, a characteristic not so present in Molly, although she tries hard to become such. We then begin to watch the personal struggles of two young women, both in love with David, yet both willing to give him up; Florence thinking the other has a stronger claim and Molly believing she is not good enough. Through strong direction and subtle acting intermixed with false bravado, we see Molly mature into one who sacrifices all for the sake of others, and become the person she so often imitated. -- Very sentimental - Excellent movie for the person who believes there is no good silent film.",
    "Director": "Monta Bell",
    "Writer": "Adela Rogers St. Johns, Alice D.G. Miller",
    "Actors": "Norma Shearer, Malcolm McGregor, George K. Arthur",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0016241",
    "tt0015976",
    "tt0014972",
    "tt0018138",
    "tt0015693",
    "tt0016548",
    "tt0016473",
    "tt0220305",
    "tt0015627",
    "tt0016491",
    "tt0016198",
    "tt0016201"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.407Z"
}