{
  "imdbId": "tt0059680",
  "title": "Satan's Harvest",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SatansHarvest",
      "id": "SatansHarvest",
      "title": "Satan's Harvest",
      "description": "This tells the story of an American private detective who inherits a large estate in South Africa. When he arrives he finds himself a hunted man. He discovers that his land is being used as a plantation for international drug smugglers. This TV schedule filler was shot in South Africa by 20th Century Fox's South African studio, Killarney Studios. The film was written and directed by George Montgomery but the screen credits an alias, Douglas K Stone. This film marks the only acting appearance of British crooner Matt Monro (\"On Days Like These\", \"From Russia With Love\", \"Born Free\") This file is derived from a grainy VHS copy.",
      "fileSize": 1824050766,
      "addedAt": "2026-01-07T00:06:51.868Z",
      "thumbnail": "https://archive.org/services/img/SatansHarvest",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 65139
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SatansHarvest_201511",
      "id": "SatansHarvest_201511",
      "title": "Satan's Harvest",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 1429674057,
      "addedAt": "2026-01-07T00:06:51.868Z",
      "thumbnail": "https://archive.org/services/img/SatansHarvest_201511",
      "collection": "feature_films",
      "downloads": 3130
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "88 min",
    "imdbRating": 3.7,
    "imdbVotes": 164,
    "Genre": "Action",
    "Plot": "When his uncle is killed in a horrible animal attack, American detective Cutter Murdock arrives in South Africa to inherit his ranching empire. Murdock's Johannesburg homecoming begins with an unexpected bang as the Miami-based private eye steps off the plane and a shot rings out - a man standing nearby is killed. Another uncle, Craig, and his son Timothy, were passed over in the will but, in spite of this, have moved into the ranch. Cutter meets up with Marla Oaks, the daughter of an American game trapper and once again an attempt is made on his life. Soon afterward Cutter and his friend Bates are beaten up and left for dead at the bottom of a mine shaft. It turns out that Craig, Timothy and older brother Andrew are part of an international drug-smuggling outfit and the ranch Cutter has inherited is used to grow marijuana. This one makes \"The Birds\" look like \"Citizen Kane.\"",
    "Director": "George Montgomery",
    "Writer": "George Montgomery",
    "Actors": "George Montgomery, Tippi Hedren, Matt Monro",
    "Language": "English",
    "Country": "South Africa",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0066565",
    "tt0065520",
    "tt0066970",
    "tt0065474",
    "tt0065374",
    "tt0065966",
    "tt0066549",
    "tt0216546",
    "tt0055479",
    "tt0066888",
    "tt0067069",
    "tt0062808"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.868Z"
}