{
  "movieId": "tt0036255",
  "title": "The Pay Off",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=J9DCXrvBH-0",
      "id": "J9DCXrvBH-0",
      "title": "The Pay Off (1942) CRIME NOIR",
      "description": "Stars: Lee Tracy, Tom Brown, Tina Thayer, and Pat Costello\nDirector: Arthur Dreifuss\n\nThe city's District Attorney is murdered, and a newspaper reporter investigates. He starts finding out that everything wasn't quite as cut and dried as it appeared to be. Watch for Pat Costello, older brother of film comic Lou.",
      "addedAt": "2025-12-26T23:44:38.814Z",
      "thumbnail": "https://i.ytimg.com/vi/J9DCXrvBH-0/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AGQBYAC4AOKAgwIABABGGUgZShlMA8=&rs=AOn4CLAjsIKwxLiJcWjm5BSqFqqXlYJZoQ",
      "duration": 4317,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "74 min",
    "imdbRating": 5.5,
    "imdbVotes": 263,
    "Genre": "Action, Crime, Film-Noir",
    "Plot": "Special prosecutor Lloyd Pearson has been murdered and there is strong evidence that gambler Moroni committed the crime, but he has an air-tight alibi, spending the evening with Brad McKay, star reporter of the Chronicle. Norris, the publisher, send Brad and his son, Guy Norris, to cover the story. Brad learns that Moroni did commit the murder, but has no way to prove it. Moroni tells Brad that the murdered prosecutor was getting a payoff, and was killed by his assistant Hugh Walker following a quarrel. John Angus, proprietor of the Hi Lo Club, tells Moroni that Brad suspects him. Phyllis Walker tells Brad that her father is in danger from Moroni. Hugh Walker has given her a key to the public locker where some money is hidden. That night, Brad finds Moroni dead. He realizes there is a higher-up that had Moroni kill Pearson, and then has had Moroni killed. He learns that Walker has been kidnapped, but secures the money from the locker and hides it in his apartment. He meets Alma Dorne at the night club, and, while attracted to her, he suspects she is an accomplice of the gang. He surprises her while she is searching his apartment for the money, and agrees to help him. Norris summons Brad to his home for Brad to show him what evidence he has collected so far. Norris, at the point of a gun, tells Brad he has collected too much. Brad gets the upper hand by telling Norris that his son Guy is walking into a death trap. Norris rushes to save his son from the trap he himself had set for Brad.",
    "Director": "Arthur Dreifuss",
    "Writer": "Edward Dein, Arthur Hoerl",
    "Actors": "Lee Tracy, Tom Brown, Tina Thayer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031245",
    "tt0034486",
    "tt0035694",
    "tt0034089",
    "tt0034637",
    "tt0034754",
    "tt0035057",
    "tt0039194",
    "tt0035010",
    "tt0037089",
    "tt0035051",
    "tt0035570"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:30:43.234Z"
}