{
  "movieId": "tt0087803",
  "title": "1984",
  "year": 1984,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1984-1984_202511",
      "id": "1984-1984_202511",
      "title": "1984 (1984)",
      "description": "Nineteen Eighty-Four is a 1984 dystopian film written and directed by Michael Radford, based upon George Orwell's novel of the same name. The  the story follows Winston Smith, a low-ranking member of the totalitarian regime in Oceania, who works at the Ministry of Truth, rewriting history to align with the Party's propaganda. As he begins to question the oppressive system and engages in a forbidden love affair with Julia, he faces the brutal consequences of his rebellion against the Party's control and surveillance.",
      "fileSize": 1885258423,
      "addedAt": "2026-01-07T00:06:06.564Z",
      "thumbnail": "https://archive.org/services/img/1984-1984_202511",
      "language": "eng",
      "year": 1984,
      "collection": "feature_films",
      "downloads": 345
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "113 min",
    "imdbRating": 7,
    "imdbVotes": 85708,
    "Genre": "Drama, Sci-Fi",
    "Plot": "Longing for freedom, the lowly bureaucrat of the Ministry of Truth, Winston Smith, summons up the courage to write down his unspoken desires in his little secret diary. Serving silently at the pleasure of the grim, autocratic hyper-state of Oceania, Smith knows that the English Socialist Party's supreme leader, the omnipotent Big Brother, watches his every move, condemning the already terrified people into a life of slavery. Under those dire circumstances--as the totalitarian government's suffocating stranglehold tightens more and more--Julia, another equally seditious party member, crosses paths with Winston, and a dangerous clandestine affair begins. Now, there's no turning back, and, sooner or later, the illicit couple will have to pay for its hideous crimes against the dictatorial state. What makes a good citizen?",
    "Director": "Michael Radford",
    "Writer": "Michael Radford, George Orwell",
    "Actors": "John Hurt, Richard Burton, Suzanna Hamilton",
    "Language": "English",
    "Country": "United Kingdom, West Germany, Netherlands",
    "Awards": "Nominated for 1 BAFTA Award6 wins & 3 nominations total"
  },
  "relatedMovies": [
    "tt0086429",
    "tt0091166",
    "tt0092530",
    "tt0093791",
    "tt0081989",
    "tt14407336",
    "tt0087821",
    "tt0087878",
    "tt0079944",
    "tt0090368",
    "tt0086877",
    "tt0072730"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "1980s",
      "name": "1980s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.564Z"
}