{
  "movieId": "tt0013719",
  "title": "Under Two Flags",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/UnderTwoFlagsForYT",
      "id": "UnderTwoFlagsForYT",
      "title": "\"Under Two Flags\" (1922) director Tod Browning",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Under Two Flags\" is a tale of drama, romance, adventure and intrigue. The events in the film occur in North Africa during the French colonial rule. The film was created by the renowned director Tod Browning.   Directed by               Tod Browning Produced by             Universal Film Manufacturing Company Scenario                      Edward T. Lowe Jr. and Elliott J. Clawson from the novel Under Two Flags by Ouida Starring                     Priscilla Dean, James Kirkwood, John Davidson, Stuart Holmes, Ethel Grey Terry Cinematography        William Fildew Distributed by           Universal Film Manufacturing Company Release date               November 6, 1922 Running time             73 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 64334796,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/UnderTwoFlagsForYT",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 6651
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "80 min",
    "imdbRating": 6.7,
    "imdbVotes": 31,
    "Genre": "Adventure, Drama",
    "Plot": "An English nobleman, known only as Victor, arrives in Algiers and joins the French Foreign Legion as a private without revealing his true identity. He attracts and is loved by Cigarette, a French-Arab girl and \"daughter of the regiment,\" but does not return her attentions. She is at first furious, and when she learns Victor's past and the name of his true love she goes to the Princess Corona with the intention of killing her. But Cigarette's hate turns to admiration, and she reveals Victor's identity to the princess. Learning of Sheik Ben Ali Hammed's plots against Victor and Algiers, she gives evidence that clears him of treason, makes a wild ride ahead of the Arabs to warn the troops, and dies in Victor's arms after shielding him from the executioner's bullet.",
    "Director": "Tod Browning",
    "Writer": "Tod Browning, Elliott J. Clawson, Edward T. Lowe Jr.",
    "Actors": "Priscilla Dean, James Kirkwood, John Davidson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0014606",
    "tt0010890",
    "tt0287952",
    "tt0016142",
    "tt0016473",
    "tt0014112",
    "tt0012657",
    "tt0012675",
    "tt0014321",
    "tt0130218",
    "tt0014496",
    "tt0014770"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.887Z"
}