{
  "movieId": "tt0050882",
  "title": "Raintree County",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/raintree-county-1957",
      "id": "raintree-county-1957",
      "title": "Raintree County (1957) Montgomery Clift · Elizabeth Taylor",
      "description": "In 1859, idealist John Wickliff Shawnessey, a resident of Raintree County, Indiana, is distracted from his high school sweetheart Nell Gaither by Susanna Drake, a rich New Orleans girl. This love triangle is further complicated by the American Civil War, and dark family history.",
      "addedAt": "2025-12-25T23:08:44.149Z",
      "thumbnail": "https://archive.org/services/img/raintree-county-1957",
      "collection": "feature_films",
      "downloads": 423
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "182 min",
    "imdbRating": 6.3,
    "imdbVotes": 4428,
    "Genre": "Drama, Romance, War",
    "Plot": "In mid-19th-century Freehaven, Raintree County, Indiana, John Wickliff Shawnessy (Montgomery Clift) has just graduated from high school at the top of his class, with a promising career as a writer. He is a romantic, principled idealist, believing the story of the golden raintree after which the county is named growing somewhere, most likely in the county's swamp area, searching for it because locating it would provide all the answers to life's questions--an idea passed down from his father. John also has a strong sense of place as belonging, and there is much anticipation in the probable marriage between him and his sweetheart Nell Gaither (Eva Marie Saint), a born-and-bred Raintree girl. However, there is an undeniable mutual attraction on first sight between him and Susanna Drake (Dame Elizabeth Taylor), a visiting southern belle. Despite Susanna's temporary stay in Raintree County suggesting that she and John have a limited future, they eventually do marry out of circumstance, leaving behind a heartbroken Nell. As their relationship progresses, differences in their outlooks mirroring the differences between the north and the south emerge and charge to to the forefront, both personally and on a global level with the onset of the American Civil War. Their relationship issues are also exacerbated by secrets, both facts and beliefs, Susanna is keeping about her family history, including her parents and her Black nanny being killed in a mysterious house fire when she was a child.",
    "Director": "Edward Dmytryk",
    "Writer": "Millard Kaufman, Ross Lockridge Jr., Freddy Savdié",
    "Actors": "Montgomery Clift, Elizabeth Taylor, Eva Marie Saint",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 4 Oscars. 1 win & 8 nominations total"
  },
  "relatedMovies": [
    "tt0052415",
    "tt0050634",
    "tt0050379",
    "tt0050204",
    "tt0046816",
    "tt0049783",
    "tt0051476",
    "tt0049871",
    "tt0049934",
    "tt0049014",
    "tt0045793",
    "tt0052600"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T15:35:38.958Z"
}