{
  "movieId": "tt0008891",
  "title": "The Blue Bird",
  "year": 1918,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Nf4ePxMRI1Y",
      "id": "Nf4ePxMRI1Y",
      "title": "The Blue Bird (1918) | Colorized Public Domain Silent Fantasy Classic by Maurice Tourneur",
      "description": "The Blue Bird (1918) is a silent fantasy film directed by Maurice Tourneur, based on the celebrated 1908 play by Belgian playwright Maurice Maeterlinck. This restored and colorized edition revitalizes a visually stunning allegorical tale that once enchanted audiences with its dreamlike cinematography, ethereal sets, and magical storytelling. Originally released during the silent era, the film remains a cornerstone of early cinema artistry, praised for its imaginative style and symbolic depth. By bringing this forgotten treasure back in color, Colorized Public Domain introduces a century-old fantasy to new audiences in the United States, Europe, and around the world.\n\nPlot Summary:\nThe story follows two siblings, Tyltyl (Robin Macdougall) and Mytyl (Tula Belle), who embark on a fantastical quest to find the mythical Blue Bird of Happiness. Guided by the fairy Bérylune (Lillian Cook), the children travel through magical realms filled with personified forces of nature, memories, and allegories of human experience. They encounter the Palace of Night, where dangers lurk in shadow, the Kingdom of the Future, where unborn children wait for their time on Earth, and the Palace of Happiness, where joy manifests in human form.\n\nThroughout their journey, Tyltyl and Mytyl are accompanied by their loyal dog Tylo (Bluebird the Dog) and their cat Tylette (played by a costumed actress), both magically given human traits. Their quest becomes a profound allegory about the pursuit of joy, discovery of inner values, and the realization that true happiness is often found within one’s own home.\n\nCast and Crew:\n• Director: Maurice Tourneur\n• Screenplay: Charles Maigne (adapted from Maurice Maeterlinck’s 1908 play)\n• Cinematography: John van den Broek\n• Producer: Adolph Zukor\n\nStarring:\n• Tula Belle as Mytyl\n• Robin Macdougall as Tyltyl\n• Edwin E. Reed as Daddy Tyl\n• Florence Anderson as Mummy Tyl\n• Lillian Cook as Fairy Bérylune\n• Gertrude McCoy as Light\n• Bluebird the Dog as Tylo\n• Uncredited actress as Tylette the Cat\n\nFilm Significance:\nThe Blue Bird is one of the most visually ambitious silent films of the 1910s, praised for Maurice Tourneur’s mastery of composition, symbolism, and innovative special effects. Tourneur was a French director who brought European artistry to American cinema, influencing later fantasy and surrealist filmmakers. The film’s dreamlike imagery — particularly the Palace of Night and Kingdom of the Future sequences — demonstrates the potential of silent cinema to create worlds of imagination without spoken dialogue.\n\nWhile not as commercially remembered as other silent fantasies, The Blue Bird holds historical importance as a counterpoint to realism, proving cinema’s ability to serve as both allegory and spectacle. Its emphasis on universal themes of happiness, family, and discovery allowed it to resonate with audiences recovering from the trauma of World War I. Modern critics consider it a masterpiece of early American silent fantasy and one of Tourneur’s most accomplished works.\n\nEnhanced Public Domain Explanation:\nThe Blue Bird (1918) is in the public domain, meaning it is free of copyright restrictions and open for restoration, preservation, and sharing worldwide. At Colorized Public Domain, we bring these silent treasures back to life through digital restoration and thoughtful colorization. By adding carefully selected color palettes, we highlight the dreamlike qualities of Tourneur’s vision while preserving the authenticity of the silent era. This ensures that the film can continue to inspire and captivate both seasoned classic cinema fans and new generations discovering silent films for the first time.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white, The Blue Bird relied on lighting, costumes, and set design to create its magical atmosphere. While historically accurate, modern audiences often overlook silent black-and-white cinema. Our colorized edition enhances the visual splendor of its allegorical journey, adding new depth and accessibility while maintaining respect for Maurice Tourneur’s artistry. For today’s viewers, this edition transforms a nearly forgotten 1918 classic into an engaging, immersive experience.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized silent films, early fantasies, dramas, and cultural landmarks from cinema’s earliest decades. Our mission is to preserve timeless works while making them engaging for modern audiences in the USA, Europe, and worldwide.\n\n#TheBlueBird1918 #SilentFilm #MauriceTourneur #PublicDomainMovie #ColorizedClassic #SilentFantasy #ClassicCinema #FilmRestoration #GoldenAgeSilentFilm #1910sCinema #FantasyFilmHistory",
      "addedAt": "2025-12-24T00:47:40.989Z",
      "thumbnail": "https://i.ytimg.com/vi/Nf4ePxMRI1Y/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBOKD8wDw==&rs=AOn4CLALF3Fbq_Axyyy6NoPKjer-Zfzidg",
      "duration": 4809,
      "language": "en",
      "year": 1918,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-blue-bird",
      "id": "silent-the-blue-bird",
      "title": "The Blue Bird",
      "fileSize": 1155957669,
      "addedAt": "2026-01-07T00:11:15.974Z",
      "thumbnail": "https://archive.org/services/img/silent-the-blue-bird",
      "language": "English",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 1220
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QDZMTtPFfsM",
      "id": "QDZMTtPFfsM",
      "title": "The Blue Bird (1918) Fantasy, Silent Film",
      "description": "Two peasant children, Mytyl and Tyltyl, are led by Berylune, a fairy, to search for the Blue Bird of Happiness. Berylune gives Tyltyl a cap with a diamond setting, and when Tyltyl turns the diamond, the children become aware of and conversant with the souls of a Dog and Cat, as well as of Fire, Water, Bread, Light, and other presumably inanimate things. The troupe thus sets off to find the elusive Blue Bird of Happiness.\n\nDirector: Maurice Tourneur\nWriters: Maurice Maeterlinck, Charles Maigne \nStars: Tula Belle, Robin Macdougall, Edwin E. Reed\nGenre:  Classics, Christmas, Drama, Fantasy, Silent, \n\n@CultCinemaClassics \nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:51:41.134Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/QDZMTtPFfsM/maxresdefault.webp?v=6228e4ea",
      "duration": 4478,
      "language": "en",
      "year": 1918,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "75 min",
    "imdbRating": 6.9,
    "imdbVotes": 1047,
    "Genre": "Family, Fantasy",
    "Plot": "Two peasant children, Mytyl and Tyltyl, are led by Berylune, a fairy, to search for the Blue Bird of Happiness. Berylune gives Tyltyl a cap with a diamond setting, and when Tyltyl turns the diamond, the children become aware of and conversant with the souls of a Dog and Cat, as well as of Fire, Water, Bread, Light, and other presumably inanimate things. The troupe thus sets off to find the elusive Blue Bird of Happiness.",
    "Director": "Maurice Tourneur",
    "Writer": "Maurice Maeterlinck, Charles Maigne",
    "Actors": "Tula Belle, Robin Macdougall, Edwin E. Reed",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0008443",
    "tt0004873",
    "tt0440877",
    "tt0010844",
    "tt0008011",
    "tt0008764",
    "tt0004099",
    "tt0004457",
    "tt0013688",
    "tt0050842",
    "tt0036696",
    "tt1217213"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.974Z"
}