{
  "imdbId": "tt0039198",
  "title": "Blonde Savage",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BlondeSavage",
      "title": "Blonde Savage",
      "description": "Yet another poverty row jungle girl adventure to add to your collection. Directed by Steve Sekely. Released in 1947. some missing frames. TRIVIA: A clip from this film is in \"It Came From Hollywood\" (1982)",
      "fileSize": 838128829,
      "id": "BlondeSavage"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xt6O5BXe6tI",
      "title": "Blonde Savage (1947) | Colorized Public Domain Adventure with Leif Erickson and Gale Sherwood",
      "description": "Blonde Savage (1947) is a post-war American adventure film directed by Steve Sekely, combining exotic jungle thrills, hidden tribal kingdoms, and a mysterious romance at its core. Now restored and colorized, this forgotten gem of 1940s adventure cinema is brought back to life for modern audiences. Originally released as a low-budget B-movie, Blonde Savage gained cult appeal for its entertaining mix of pulp storytelling, bold characters, and escapist charm. With its blend of action, drama, and romance, the film offers a glimpse into a style of moviemaking that was popular with mid-20th century audiences looking for larger-than-life adventures.\n\nPlot Summary:\nThe film follows two explorers, Steve Blake (Leif Erickson) and Hoppy Owens (Frank Jenks), who embark on an expedition deep into the jungle. Their mission takes an unexpected turn when they encounter a hidden tribe ruled by a mysterious blonde queen named Lorna (Gale Sherwood).\n\nLorna, raised among the tribe since childhood, has become their respected leader. While her beauty and authority intrigue the explorers, their arrival disrupts the delicate balance of the tribe. Steve soon discovers that Lorna is not just a jungle ruler but a woman torn between her loyalty to the tribe that raised her and her feelings for him.\n\nAs tensions rise, outside forces threaten the safety of the tribe and Lorna’s position as queen. The explorers find themselves caught in a dangerous struggle involving betrayal, power, and survival. Filled with jungle battles, dramatic confrontations, and unexpected romance, the story builds to an action-packed finale that pits loyalty and love against greed and violence.\n\nCast and Crew:\n• Director: Steve Sekely\n• Screenplay: George Callahan\n• Cinematography: Fred Jackman Jr.\n• Editing: Martin G. Cohn\n• Production Company: Pine-Thomas Productions\n• Distributor: Paramount Pictures\n\nStarring:\n• Leif Erickson as Steve Blake\n• Gale Sherwood as Lorna, the Blonde Savage\n• Frank Jenks as Hoppy Owens\n• Douglass Dumbrille as Mark Harper\n• Veda Ann Borg as Marie\n• Trevor Bardette as Cramer\n\nFilm Significance:\nThough a B-picture, Blonde Savage reflects the adventure trends of the 1940s when jungle films, exotic locales, and strong-willed heroines fascinated audiences. It is notable for Gale Sherwood’s rare starring role before she became better known as a singer and stage performer, often associated with Nelson Eddy later in her career. Director Steve Sekely, known for working in multiple genres, brought his sharp pacing to the picture, giving the film energy despite its modest budget.\n\nToday, Blonde Savage holds a place in cinema history as an example of post-war escapist entertainment, where audiences sought thrilling stories far removed from everyday life. It also remains part of the wider tradition of “jungle queen” films, which were popular throughout the 1930s and 1940s.\n\nEnhanced Public Domain Explanation:\nBlonde Savage (1947) is now in the public domain, which means it can be freely viewed, preserved, and distributed. Colorized Public Domain restores these films using modern techniques, cleaning the image and enhancing it with carefully applied colorization. Our mission is to keep these movies alive for contemporary audiences, especially younger viewers who might not engage with black-and-white films. With restored visuals and vibrant color, these classics regain their sense of adventure, romance, and drama for a new era.\n\nWhy Watch This Colorized Edition:\nThe original release was in black-and-white, which, while historically accurate, can make older films less accessible to modern viewers. This colorized version highlights the exotic setting, lush jungles, and Gale Sherwood’s captivating presence, making the story more immersive. By bridging the gap between vintage cinema and modern viewing habits, this edition allows today’s audiences in the United States, Europe, and beyond to rediscover a forgotten adventure classic.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#BlondeSavage #PublicDomainMovie #ColorizedClassic #AdventureFilm #JungleMovie #1940sCinema #FilmRestoration #LeifErickson #GaleSherwood #ClassicAdventure",
      "id": "Xt6O5BXe6tI",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=07zjhmNpOsY",
      "title": "Blonde Savage (1947) JUNGLE ADVENTURE",
      "description": "Stars: Leif Erickson, Gale Sherwood, Veda Ann Borg\nDirector: Steve Sekely\n\nAn expedition into the deep jungle discovers a native tribe led by a tall white blonde woman.",
      "id": "07zjhmNpOsY",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": 4.8,
    "imdbVotes": 212,
    "Genre": "Action, Adventure, Fantasy",
    "Plot": "Diamond mine owner Mark Harper (Douglass Dumbrille) hires pilot Steve Blake (Leif Erickson) and his pal Hoppy Owens (Frank Jenks)to search for a hidden jungle village from which the natives have made trouble for his mine operations. They crash near the village and discover that Meelah (Gale Sherwood), a white girl brought up by the natives after her parents had been killed for their property by Harper, is the head of the village. Returning to the mine, Harper, already suspicious of what they may have learned and jealous of the attention his wife, Connie Harper (Veda Ann Borg), is paying to Steve, has them jailed, while he leads an expedition against the village and Meelah.",
    "Director": "Steve Sekely",
    "Writer": "Gordon Bache",
    "Actors": "Leif Erickson, Gale Sherwood, Veda Ann Borg",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0057547",
      "title": "Sword of Lancelot",
      "year": 1963,
      "imdbRating": 5.7,
      "imdbVotes": 605,
      "language": "Latin, English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039133",
      "title": "Adventure Island",
      "year": 1947,
      "imdbRating": 4.7,
      "imdbVotes": 219,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039218",
      "title": "Brick Bradford",
      "year": 1947,
      "imdbRating": 5.9,
      "imdbVotes": 94,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0383574",
      "title": "Pirates of the Caribbean: Dead Man's Chest",
      "year": 2006,
      "imdbRating": 7.4,
      "imdbVotes": 812753,
      "language": "English, Turkish, Greek, Mandarin, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1386697",
      "title": "Suicide Squad",
      "year": 2016,
      "imdbRating": 5.9,
      "imdbVotes": 749653,
      "language": "English, Japanese, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1594917",
      "title": "Age of the Dragons",
      "year": 2011,
      "imdbRating": 3.4,
      "imdbVotes": 4567,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2784134",
      "title": "Battle for Skyark",
      "year": 2015,
      "imdbRating": 2.7,
      "imdbVotes": 2096,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039231",
      "title": "Bush Christmas",
      "year": 1947,
      "imdbRating": 6.1,
      "imdbVotes": 535,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039339",
      "title": "Dragnet",
      "year": 1947,
      "imdbRating": 7.1,
      "imdbVotes": 42,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0417943",
      "title": "Manticore",
      "year": 2005,
      "imdbRating": 3.7,
      "imdbVotes": 955,
      "language": "English, Arabic",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0120915",
      "title": "Star Wars: Episode I - The Phantom Menace",
      "year": 1999,
      "imdbRating": 6.5,
      "imdbVotes": 910757,
      "language": "English, Sanskrit",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1079372",
      "title": "Midnight Chronicles",
      "year": 2009,
      "imdbRating": 3.6,
      "imdbVotes": 1076,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}