{
  "movieId": "tt0021576",
  "title": "À Propos de Nice",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/A_propos_de_Nice",
      "id": "A_propos_de_Nice",
      "title": "A propos de Nice",
      "description": "À propos de Nice is a 1930 silent short documentary film directed by Jean Vigo and photographed by Boris Kaufman. The film depicts life in Nice, France by documenting the people in the city, their daily routines, a carnival and social inequalities. Vigo described the film in an address to the Groupement des Spectateurs d'Avant-Garde: \"In this film, by showing certain basic aspects of a city, a way of life is put on trial... the last gasps of a society so lost in its escapism that it sickens you and makes you sympathetic to a revolutionary solution.\"[1] À propos de Nice was Vigo's first film. It was followed by Taris, roi de l'eau (1931), Zéro de conduite (1933) and L'Atalante in 1934, the year Vigo died.",
      "fileSize": 453841845,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/A_propos_de_Nice",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 15358
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "24 min",
    "imdbRating": 7.4,
    "imdbVotes": 4591,
    "Genre": "Documentary, Short, Comedy",
    "Plot": "As was the fashion among many directors of the epoch, Jean Vigo's first \"point-of-view\" documentary aimed at capturing the life and the very essence of a city; here, the beautiful seaside resort of early-1930s Nice. However, with the aid of Dziga Vertov's brother, Boris Kaufman, this avant-garde short film evolved from an ordinary depiction of a coastal town into a caustic and sarcastic report of the \"real\" Nice, portraying the contrasting lifestyles of its inhabitants. Starting with a series of captivating aerial takes, Vigo's film continues with scenes that pivot around the sun-kissed Promenade des Anglais, and unexpected juxtapositions of poverty and wealth; modern architecture and garbage; the working poor and the idle rich. In the cosmopolitan city of Nice on the French Côte d'Azur, eye-catching tableaux of sharp and eternal antitheses invite us to take a look at the anatomy of a small world. Does beauty transcend the boundaries of money, language, and social classes?",
    "Director": "Boris Kaufman, Jean Vigo",
    "Writer": "Jean Vigo, Boris Kaufman",
    "Actors": "N/A",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020767",
    "tt0020907",
    "tt0146845",
    "tt0161805",
    "tt0149785",
    "tt0020952",
    "tt0475080",
    "tt0192102",
    "tt0206174",
    "tt0351759",
    "tt0337245",
    "tt0146423"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.633Z"
}