{
  "imdbId": "tt0021231",
  "title": "Paradise Island",
  "year": 1930,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fykBQiO2EB8",
      "title": "Paradise Island (1930) | Colorized Public Domain Romantic Drama with Kenneth Harlan & Marceline Day",
      "description": "Paradise Island (1930) is an American pre-Code romantic drama directed by Bert Glennon and produced by Tiffany Pictures. Starring Kenneth Harlan, Marceline Day, and Tom Santschi, the film is a rare surviving work from a studio that has since faded into history. Set against an exotic tropical backdrop, the movie blends romance, danger, and adventure, reflecting both the stylistic experimentation and storytelling sensibilities of early sound-era Hollywood. Restored and colorized by Colorized Public Domain, this edition enhances the visual experience for modern viewers while preserving the essence of the original.\n\nPlot Summary:\nJim Thorne (Kenneth Harlan), a daring aviator, finds himself stranded on a South Seas island after a forced landing. There he encounters Virginia Selby (Marceline Day), the daughter of a pearl trader who has grown accustomed to life in the remote tropics. Despite their differences, romance blossoms between Jim and Virginia, but their happiness is threatened by looming dangers. Captain Blake (Tom Santschi), a ruthless smuggler, has his eye both on the island’s pearl riches and Virginia herself.\n\nThe film unfolds as a battle of wills and desires—Jim must prove his courage not only in love but also in standing up to Blake’s schemes. The tension rises as deceit, ambition, and betrayal put the characters on a collision course. Blending adventure elements with romantic melodrama, Paradise Island reflects Hollywood’s fascination with exotic settings during the late 1920s and early 1930s.\n\nCast and Crew:\n• Director: Bert Glennon\n• Producer: Tiffany Pictures\n• Screenplay: Finis Fox\n• Cinematography: Arthur Reeves\n\nStarring:\n• Kenneth Harlan as Jim Thorne\n• Marceline Day as Virginia Selby\n• Tom Santschi as Captain Blake\n• Carlton S. King as Mr. Selby\n• Gladden James as Don\n\nFilm Significance:\nParadise Island is noteworthy for several reasons. It was released at a transitional moment when Hollywood was still mastering sound filmmaking, and Tiffany Pictures was among the smaller independent studios struggling to compete with the majors. The film demonstrates the fascination with tropical and exotic themes that characterized many pre-Code productions, where studios could explore romantic passion and moral ambiguity more openly before the strict enforcement of the Production Code in 1934.\n\nMarceline Day, known for her roles in silent films, adapted well into talkies, while Kenneth Harlan’s rugged presence made him a convincing hero. The movie also highlights Bert Glennon’s early directorial work before he became better known as a cinematographer for major directors like John Ford. As one of the few Tiffany Pictures films still available today, Paradise Island provides modern viewers with a window into a lost era of independent filmmaking.\n\nEnhanced Public Domain Explanation:\nThis film has entered the public domain, meaning it is free of copyright restrictions and can be shared, viewed, preserved, and studied without limitation. Colorized Public Domain restores and colorizes forgotten classics like Paradise Island to ensure their survival for future generations. Through advanced digital cleaning and careful use of color, we make early sound films more engaging for contemporary audiences, especially those who might overlook black-and-white productions. Our work preserves both the artistry and the cultural value of films that shaped early Hollywood history.\n\nWhy Watch This Colorized Edition:\nThe original release was shot in black and white, which was the industry standard for most early 1930s productions. By colorizing Paradise Island, we bring out the richness of its tropical setting and the emotional dynamics between characters in a way that resonates with today’s viewers. This edition allows audiences to experience the atmosphere and visual details of the film as never before, creating a stronger emotional connection to the story. For fans of pre-Code cinema, aviation adventure tales, and lost Hollywood gems, this restored and colorized version is a rare opportunity to rediscover an overlooked classic.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood, preserving cinematic treasures from the 1930s through the 1950s for modern audiences across the USA, Europe, and beyond.\n\n#ParadiseIsland #1930sCinema #PublicDomainMovie #ColorizedClassic #PreCodeHollywood #KennethHarlan #MarcelineDay #TiffanyPictures #VintageHollywood #FilmRestoration",
      "id": "fykBQiO2EB8",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sqn5A9nDcTo",
      "title": "Paradise Island (1930) PRE-CODE HOLLYWOOD",
      "description": "Stars: Marceline Day, Kenneth Harlan, Tom Santschi \nDirector: Bert Glennon\n\nWhen a sweet young girl arrives on a sleepy, south sea island to marry her fiancée, she discovers he has gambled away all his money and become a drunk.",
      "id": "sqn5A9nDcTo",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ljDf6lzoriA",
      "title": "Paradise Island (1930) Action, Adventure, Music Pre Code Film",
      "description": "Ellen Bradford comes to the south sea island of Tonga to marry her fiancée and finds out he is a drunk. She also finds has three men taking a deep interest in her.\n\nDirector: Bert Glennon\nWriters: M.B. Deering, Monte M. Katterjohn \nStars: Kenneth Harlan, Marceline Day, Tom Santschi\nGenres: Action, Adventure, Music, Romance, Pre Code\n\n@CCC socials\nFB: https://www.facebook.com/CultCinemaClassics\nIG : https://www.instagram.com/cultcinemaclassics -\nhttps://www.twitch.tv/cultcinema",
      "id": "ljDf6lzoriA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "68 min",
    "imdbRating": "4.6",
    "imdbVotes": "150",
    "Genre": "Action, Adventure, Music",
    "Plot": "Ellen Bradford comes to the south sea island of Tonga to marry her fiancée and finds out he is a drunk. She also finds out that she is the only white woman on the island and, as such, has three men taking a deep interest in her. She has written off her fiancée, and has learned real quick like that \"Dutch Mike\" Lutze is not to be trusted in any way. That leaves Jim Thorne, the only man who has ever bested Lutze in anything and, while Jim is an adventurer and pirate-at-heart, he knows how to be a gentleman, especially to the only white woman in town or on the island. Lutze is offended. They play poker for a plantation, Ellen, and all the pearls in the Pacific. Loser gets Poppi. Lutz has a marked deck of cards.",
    "Director": "Bert Glennon",
    "Writer": "M.B. Deering, Monte M. Katterjohn",
    "Actors": "Kenneth Harlan, Marceline Day, Tom Santschi",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0022028",
      "title": "King of the Wild",
      "year": 1931,
      "imdbRating": "6.0",
      "imdbVotes": "141",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0020470",
      "title": "Syncopation",
      "year": 1929,
      "imdbRating": "6.8",
      "imdbVotes": "91",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021233",
      "title": "Pardon My Gun",
      "year": 1930,
      "imdbRating": "4.3",
      "imdbVotes": "67",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031122",
      "title": "The Bronze Buckaroo",
      "year": 1939,
      "imdbRating": "4.9",
      "imdbVotes": "259",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021555",
      "title": "Wings of Adventure",
      "year": 1930,
      "imdbRating": "4.7",
      "imdbVotes": "58",
      "language": "English, Spanish",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0021792",
      "title": "Defenders of the Law",
      "year": 1931,
      "imdbRating": "4.8",
      "imdbVotes": "47",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1268864",
      "title": "The Blonde Captive",
      "year": 1931,
      "imdbRating": "4.4",
      "imdbVotes": "85",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020500",
      "title": "Thundering Thompson",
      "year": 1929,
      "imdbRating": "5.5",
      "imdbVotes": "48",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019711",
      "title": "Border Romance",
      "year": 1929,
      "imdbRating": "5.2",
      "imdbVotes": "51",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019884",
      "title": "Flight",
      "year": 1929,
      "imdbRating": "6.0",
      "imdbVotes": "420",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019987",
      "title": "His First Command",
      "year": 1929,
      "imdbRating": "5.9",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021945",
      "title": "Headin' for Trouble",
      "year": 1931,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:58:15.539Z"
}