{
  "movieId": "tt0038593",
  "title": "Heldorado",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Heldorado",
      "id": "Heldorado",
      "title": "Heldorado",
      "description": "Roy Rogers, a Nevada State Ranger Captain in charge of the Rangers Reclamation Service, makes a trip to Las Vegas for the annual Heldorado Frontier Days Festival, as he wants to help his old friend Gabby Whittaker who originated the idea. In Las Vegas, Roy meets heiress Carol Randall, who has been selected as the Queen of the Heldorado. Roy is informed that the F.B.I. wants an immediate investigation of the counterfeit thousand dollar bills that are being passed over the gambling tables at the casino.",
      "fileSize": 1481112955,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/Heldorado",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 80143
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5Bbh1VAskME",
      "id": "5Bbh1VAskME",
      "title": "Heldorado (1946) | Colorized Public Domain Western Classic with Roy Rogers and Dale Evans",
      "description": "Heldorado (1946) is an American Western film directed by William Witney and starring Roy Rogers in one of his most iconic Republic Pictures roles. This colorized and restored edition of the public domain classic revives a patriotic Western tale set in post-World War II America, combining action, music, and Americana themes that continue to resonate with audiences today. Colorized Public Domain presents this forgotten gem with enhanced visual quality, tailored for modern viewers in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story unfolds during the annual Helldorado Days celebration in Las Vegas, a festival filled with parades, pageantry, and Western pride. Roy Rogers stars as himself, a deputy sheriff and singing cowboy, who is tasked with investigating suspicious financial dealings tied to local crime. When underworld figures begin exploiting the Helldorado festivities for money laundering and corruption, Roy steps in to protect the integrity of both the law and the community.\n\nDale Evans plays Carol Randall, a journalist who works alongside Roy while covering the festival, bringing charm and intelligence to her role. The film also features the beloved comedic sidekick George \"Gabby\" Hayes, whose humor and down-to-earth wisdom balance the action and suspense. Together, they confront a powerful gang of racketeers determined to manipulate the celebration for profit, forcing Roy to combine his courage, quick gun skills, and unshakable moral compass to restore justice.\n\nTrue to the Republic Pictures formula, Heldorado blends action sequences, light romance, and musical performances, including several songs by Roy Rogers and The Sons of the Pioneers. It showcases the idealized American West and patriotic pride in the years following World War II, making it not only entertainment but also a cultural time capsule.\n\nCast and Crew:\n• Director: William Witney\n• Producer: Donald H. Brown\n• Screenplay: Gerald Geraghty\n• Cinematography: William Bradford\n• Editing: Tony Martinelli\n\nStarring:\n• Roy Rogers as Himself\n• Dale Evans as Carol Randall\n• George \"Gabby\" Hayes as Gabby Whittaker\n• Paul Harvey as Governor McKay\n• William Haade as Hendricks\n• Marc Lawrence as R. J. Renchler\n• Bob Nolan as Himself with Sons of the Pioneers\n\nFilm Significance:\nHeldorado is significant as a patriotic Western released in the immediate aftermath of World War II, reflecting both optimism and concerns of American society in the late 1940s. It highlights Las Vegas before its explosive transformation into a global entertainment capital, capturing the unique blend of Western tradition and early urban spectacle. Roy Rogers, known as the “King of the Cowboys,” was at the height of his popularity, and this film reinforced his reputation as a wholesome hero. For modern audiences, it provides a nostalgic look at an era where morality tales were told through music, action, and Western iconography.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Heldorado remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1946 release was in black and white, typical of Republic Pictures Westerns. While historically authentic, many modern audiences overlook older films. By offering a colorized edition, we bridge the gap between preservation and modern accessibility, making Heldorado both a historical document and an enjoyable viewing experience for audiences today.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Heldorado #RoyRogers #DaleEvans #WesternClassic #PublicDomainMovie #ColorizedClassic #RepublicPictures #GoldenAgeHollywood #1946Movies #FilmRestoration #ClassicWestern",
      "addedAt": "2025-12-24T00:48:52.404Z",
      "thumbnail": "https://i.ytimg.com/vi/5Bbh1VAskME/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYciBZKEAwDw==&rs=AOn4CLCbt1BF9ypomNBvhyOkIqql6-k2GQ",
      "duration": 4123,
      "language": "en",
      "year": 1946,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BCwaOpTCjZI",
      "id": "BCwaOpTCjZI",
      "title": "Heldorado (1946) ROY ROGERS",
      "description": "Stars: Roy Rogers, Trigger, George 'Gabby' Hayes\n Director: William Witney\n\n Roy Rogers, a Nevada State Ranger Captain in charge of the Rangers Reclamation Service, makes a trip to Las Vegas for the annual Heldorado Frontier Days Festival, as he wants to help his old friend Gabby Whittaker who originated the idea (at least, in this film).In Las Vegas, Roy meets heiress Carol Randall, who has been selected as the Queen of the Heldorado. Roy is informed that the F.B.I. wants an immediate investigation of the counterfeit thousand dollar bills that are being passed over the gambling tables at the casino.",
      "addedAt": "2025-12-26T23:54:02.772Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/BCwaOpTCjZI/maxresdefault.webp",
      "duration": 4185,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UJyM1XMu6rc",
      "id": "UJyM1XMu6rc",
      "title": "Heldorado (1946) Roy Rogers, Dale Evans, George 'Gabby' Hayes | Western Movie, Subtitles",
      "description": "Roy \"goes to town\" in the HOTTEST town of all!\nRoy Rogers, a Nevada State Ranger Captain in charge of the Rangers Reclamation Service, makes a trip to Las Vegas for the annual Heldorado Frontier Days Festival, as he wants to help his old friend Gabby Whittaker.  In Las Vegas, Roy meets heiress Carol Randall, who has been selected as the Queen of the Heldorado. Roy is informed that the F.B.I. wants an immediate investigation of the counterfeit thousand dollar bills that are being passed over the gambling tables at the casino\n\nColorized version: https://youtu.be/vxHzuGoNUDA\nDirector: William Witney\nWriters: Gerald Geraghty, Julian Zimet\nCast: Roy Rogers, Dale Evans, George 'Gabby' Hayes, & Trigger\nGenres: Drama, Music, Western\n\nThis film comes with original English audio, and also subtitles in more than 30+ languages. Click on ⚙️   and choose your preferred language.",
      "addedAt": "2025-12-27T00:43:07.872Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/UJyM1XMu6rc/maxresdefault.webp?v=647845dc",
      "duration": 4187,
      "language": "en",
      "year": 1946,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": 6,
    "imdbVotes": 187,
    "Genre": "Drama, Music, Western",
    "Plot": "Roy Rogers, a Nevada State Ranger Captain in charge of the Rangers Reclamation Service, makes a trip to Las Vegas for the annual Heldorado Frontier Days Festival, as he wants to help his old friend Gabby Whittaker who originated the idea (at least, in this film).In Las Vegas, Roy meets heiress Carol Randall, who has been selected as the Queen of the Heldorado. Roy is informed that the F.B.I. wants an immediate investigation of the counterfeit thousand dollar bills that are being passed over the gambling tables at the casino.",
    "Director": "William Witney",
    "Writer": "Gerald Geraghty, Julian Zimet",
    "Actors": "Roy Rogers, Trigger, George 'Gabby' Hayes",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038611",
    "tt0039157",
    "tt0039861",
    "tt0039180",
    "tt0040333",
    "tt0041347",
    "tt0040644",
    "tt0040399",
    "tt0040385",
    "tt0038968",
    "tt0043626",
    "tt0037535"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.401Z"
}