{
  "imdbId": "tt0030359",
  "title": "Letter of Introduction",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LetterofIntroduction",
      "id": "LetterofIntroduction",
      "title": "Letter of Introduction",
      "description": "An aging actor (Adolphe Menjou), trying to make a comeback on Broadway, is surprised when his estranged daughter (Andrea Leeds) shows up. It seems that she is an actress and is also trying to make it on Broadway. He tries to re-establish his relationship with her while also trying to hide the fact that she is his daughter from the press.",
      "fileSize": 1818569865,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LetterofIntroduction",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 23295
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/letter-of-introduction-4-k",
      "id": "letter-of-introduction-4-k",
      "title": "Letter Of Introduction (1938) [Colorized, 4K, 60FPS]",
      "description": "Letter Of Introduction is a 1938  black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 9282578747,
      "addedAt": "2026-01-07T00:09:38.890Z",
      "thumbnail": "https://archive.org/services/img/letter-of-introduction-4-k",
      "collection": "feature_films",
      "downloads": 240
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JZ3g24ubmzw",
      "id": "JZ3g24ubmzw",
      "title": "Letter of Introduction (1938) | Colorized Public Domain Classic with Adolphe Menjou and Andrea Leeds",
      "description": "Letter of Introduction (1938) is an American drama film directed by John M. Stahl and distributed by Universal Pictures. This restored and colorized edition of the public domain classic revives a forgotten Hollywood story about fame, regret, and the fragile ties between estranged family members. With its strong performances and emotional complexity, the film resonates with modern viewers while preserving the atmosphere of late 1930s cinema.\n\nPlot Summary:\nJohn Mannering (Adolphe Menjou) is a once-celebrated stage actor whose career has fallen into decline as his reputation and health deteriorate. Living in seclusion, he is haunted by mistakes of the past and hesitant to face the world again. Into his life comes Kay Martin (Andrea Leeds), a young aspiring actress carrying a letter of introduction that reveals her true identity as his daughter. Kay’s mother, once connected to Mannering, has encouraged her to meet him, hoping reconciliation might be possible.\n\nAt first, Mannering resists involvement with Kay, fearful of scandal and protective of his pride. However, Kay’s determination, warmth, and sincerity gradually break through his defenses. As she begins her own career in theater, she faces challenges of credibility, competition, and the shadow of her father’s reputation. Mannering, wrestling with guilt and a sense of responsibility, must decide whether to remain in the shadows or step forward to help his daughter succeed.\n\nThe emotional tension builds toward a powerful climax in which past mistakes collide with present choices. Themes of redemption, legacy, and generational connection anchor the story, reflecting Hollywood’s fascination with both the glamour and the cost of fame. The narrative also offers a subtle critique of reputation-driven society, exposing the difficulty of rebuilding trust once it has been broken.\n\nCast and Crew:\n• Director: John M. Stahl\n• Producer: Universal Pictures\n• Cinematography: Karl Freund\n• Editing: Milton Carruth\n\nStarring:\n• Adolphe Menjou as John Mannering\n• Andrea Leeds as Kay Martin\n• George Murphy as Barry Paige\n• Edgar Bergen as Himself\n• Rita Johnson as Honey\n• Frank Jenks as Joe Bartlett\n• Ernest Cossart as Frobisher\n• Polly Walters as Belle\n• Harry Davenport as Dr. Webster\n\nFilm Significance:\nLetter of Introduction (1938) is notable for its blend of dramatic tension and Hollywood backstage storytelling, offering a glimpse into the complexities of fame and personal sacrifice during the Golden Age of cinema. Adolphe Menjou delivers a compelling portrayal of a fallen star haunted by pride and regret, while Andrea Leeds captures the struggles of a young actress seeking independence and identity. The film also features a unique appearance by ventriloquist Edgar Bergen, who appears as himself alongside his famous dummy Charlie McCarthy, reflecting the crossover appeal of stage and radio acts in 1930s Hollywood.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Letter of Introduction remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1938 release was in black and white, consistent with the technology and style of its time. While authentic, many modern audiences skip over black-and-white films. By offering a colorized edition, we help bridge the gap between historic preservation and contemporary viewing preferences. This restoration highlights the performances, costumes, and sets with a clarity that connects more directly to today’s viewers while honoring the film’s legacy.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant studio releases. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#LetterOfIntroduction #AdolpheMenjou #AndreaLeeds #1930sDrama #PublicDomainMovie #ColorizedClassic #ClassicHollywood #FilmRestoration #GoldenAgeCinema #1938Movies",
      "addedAt": "2025-12-24T00:49:49.400Z",
      "thumbnail": "https://i.ytimg.com/vi/JZ3g24ubmzw/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBfKFMwDw==&rs=AOn4CLAypRVayOW_nmlv4yHSKDlO4VSDOA",
      "duration": 6120,
      "language": "en",
      "year": 1938,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_tETt-lkySc",
      "id": "_tETt-lkySc",
      "title": "Letter of Introduction (1938) CHARLIE McCARTHY",
      "description": "Stars: Adolphe Menjou, Edgar Bergen, Charlie McCarthy\n Director: John M. Stahl\n\n An aging actor, trying to make a comeback on Broadway, is surprised when his estranged daughter shows up. It seems that she is an actress and is also trying to make it on Broadway. He tries to re-establish his relationship with her while also trying to hide the fact that she is his daughter from the press.",
      "addedAt": "2025-12-26T23:52:08.193Z",
      "thumbnail": "https://i.ytimg.com/vi/_tETt-lkySc/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhiIGIoYjAP&rs=AOn4CLC7PD6EzrHujKUqdRUV1YVRLQC_CQ",
      "duration": 6183,
      "language": "en",
      "year": 1938,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IMuNluOZbBI",
      "id": "IMuNluOZbBI",
      "title": "Letter of Introduction (1938) Comedy Drama Full Length Movie",
      "description": "An aging actor, about to marry for the fourth time, is surprised when a young woman, who is the daughter he never knew he had, appears with a \"letter of introduction\". It seems that she is an actress and is trying to make it on Broadway. He tries to establish a relationship with her but finds it difficult to tell the world of their true relationship. \n\nDirector: John M. Stahl\nWriters:  Bernice Boone (story), Sheridan Gibney\nStars: Adolphe Menjou, Andrea Leeds, George Murphy, Edgar Bergen & Charlie McCarthy                                                                                                                                                                 Genres: Comedy, Drama \n                                                                                                                                                                                                                                                                                            CCC CHAPTERS: \n00:00 Full Length Movie\n01:03 New Years Eve on Broadway\n02:34 Fire\n03:16 Random Seal\n03:42 Rescuing Charlie \n05:01 Rescuing the letter\n06:41 Rooftop confessions\n10:14 Meet smart mouthed dummy Charlie McCarthy\n11:03 Midnight NYE kisses\n23:05 The contents of letter\n26:54 Daddy issues\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:46:19.076Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/IMuNluOZbBI/maxresdefault.webp?v=63b59c64",
      "duration": 6177,
      "language": "en",
      "year": 1938,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "104 min",
    "imdbRating": 6.1,
    "imdbVotes": 449,
    "Genre": "Comedy, Drama, Mystery",
    "Plot": "An aging actor, about to marry for the fourth time, is surprised when a young woman, who is the daughter he never knew he had, appears with a \"letter of introduction\". It seems that she is an actress and is trying to make it on Broadway. He tries to establish a relationship with her but finds it difficult to tell the world of their true relationship.",
    "Director": "John M. Stahl",
    "Writer": "Bernice Boone, Sheridan Gibney, Leonard Spigelgass",
    "Actors": "Adolphe Menjou, Andrea Leeds, George Murphy",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031831",
    "tt0032608",
    "tt0032686",
    "tt0022651",
    "tt0027053",
    "tt0031865",
    "tt0036695",
    "tt0029939",
    "tt0045620",
    "tt0030445",
    "tt0030063",
    "tt0030637"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.890Z"
}