{
  "movieId": "tt0002381",
  "title": "The Musketeers of Pig Alley",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/12TheMusketeersOfPigAlley",
      "id": "12TheMusketeersOfPigAlley",
      "title": "\"The Musketeers Of Pig Alley\" (1912) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Musketeers of Pig Alley\" is a short crime drama. This film illustrates the work of actor Robert Harron and cinematographer Billy Bitzer, stars of Silent Hall of Fame. \"The Musketeers of Pig Alley\" is the first gangster film in history.  It has some excellent acting by a very strong cast and a lot of suspense. The film is also a predecessor of what would become known a quarter of a century later as \"the film noir\".  In 2016 the film was selected for preservation in the National Film Registry as being deemed \"culturally, historically, or aesthetically significant.\" Directed by                          D.W. Griffith Produced by                        Biograph Company Cinematography                Billy Bitzer Starring                               Elmer Booth, Lillian Gish, Robert Harron Distributed by                     The General Film Company Release date                         October 31, 1912 Running time                      17 min. Country                               United States Language                             Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 297697768,
      "addedAt": "2026-01-07T00:06:00.051Z",
      "thumbnail": "https://archive.org/services/img/12TheMusketeersOfPigAlley",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 16505
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMusketeersOfPigAlley",
      "id": "TheMusketeersOfPigAlley",
      "title": "The Musketeers of Pig Alley.",
      "description": "The title, is Probably an Americanization of the French, Les Mousquetaire de Pigalle, This is one of the better Griffith shorts. Made in 1913, it has a lovely performance by Lilian Gish which should remind you why she became a great star. Harry Cary who later did unbelievable stunts for John Ford and other Western directors is also in the picture. He is the tough looking gang member. Notice the interesting crowd scenes in the alley and on the street where every member of the crowd has a part to play. With Griffith pictures, always look fr the AB which protects their copyright. Also notice the clear suggestion of corruption in the police at the end.",
      "fileSize": 386184980,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheMusketeersOfPigAlley",
      "collection": "feature_films",
      "downloads": 7126
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-musketeers-of-pig-alley",
      "id": "silent-the-musketeers-of-pig-alley",
      "title": "The Musketeers of Pig Alley",
      "fileSize": 364040068,
      "addedAt": "2026-01-07T00:11:15.978Z",
      "thumbnail": "https://archive.org/services/img/silent-the-musketeers-of-pig-alley",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 606
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "17 min",
    "imdbRating": 6.6,
    "imdbVotes": 2540,
    "Genre": "Short, Crime, Drama",
    "Plot": "A young wife and her musician husband live in poverty in a New York City tenement. The husband's job requires him to go away for for a number of days. On his return, he is robbed by the neighborhood gangster. Sometime later, an unrelated mob shoot-out ensues. The husband happens upon the melee, recognizing the crook who robbed him. Can the husband retrieve his money?",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith, Anita Loos",
    "Actors": "Elmer Booth, Lillian Gish, Clara T. Bracy",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0002415",
    "tt0002553",
    "tt0001789",
    "tt0002121",
    "tt0002386",
    "tt0000832",
    "tt0000942",
    "tt0000831",
    "tt0001733",
    "tt0003170",
    "tt0000728",
    "tt0001326"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.978Z"
}