{
  "movieId": "tt0055520",
  "title": "Then There Were Three",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=m8bGWi7YLYo",
      "id": "m8bGWi7YLYo",
      "title": "Then There Were Three (1961) WORLD WAR II MYSTERY",
      "description": "Movie Class by PizzaFLIX: Alex Nicol produced, directed, and starred in this lost War Mystery gem.  Nicol was discovered in 1950 by Universal director George Sherman, who cast him in his film THE SLEEPING CITY. After the filming Red Ball Express (1952), Nicol went to the Universal front office and asked to be released from his contract. Ironically, he returned frequently to film at Universal at a much larger fee than he was getting as a contract player.\n\nStars: Alex Nicol, Barry Cahill, Frank Latimore\nDirector: Alex Nicol\n\n When an American attack on the German-held town of San Corrado results in the Germans being forced out of the town, they don't have time to take along a top Italian partisan leader they have captured and imprisoned. Fearing that the Americans will turn the man loose to organize more partisan attacks on their forces, the Germans send one of their top agents to infiltrate the town, posing as an American soldier cut off from his unit, and assign him to re-capture the partisan leader and bring him back for interrogation--or, if that's not possible, to kill him. Also known as Three Came Back",
      "addedAt": "2025-12-26T23:53:01.477Z",
      "thumbnail": "https://i.ytimg.com/vi/m8bGWi7YLYo/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB9ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDzyOJqwzsdeBSvHJhrwGQWPidADQ",
      "duration": 4893,
      "language": "en",
      "year": 1961,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "82 min",
    "imdbRating": 5.3,
    "imdbVotes": 140,
    "Genre": "War, Drama",
    "Plot": "When an American attack on the German-held town of San Corrado results in the Germans being forced out of the town, they don't have time to take along a top Italian partisan leader they have captured and imprisoned. Fearing that the Americans will turn the man loose to organize more partisan attacks on their forces, the Germans send one of their top agents to infiltrate the town, posing as an American soldier cut off from his unit, and assign him to re-capture the partisan leader and bring him back for interrogation--or, if that's not possible, to kill him.",
    "Director": "Alex Nicol",
    "Writer": "Frank Gregory, Allan Lurie",
    "Actors": "Frank Latimore, Alex Nicol, Barry Cahill",
    "Language": "English",
    "Country": "Italy, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0053712",
    "tt0055031",
    "tt0055270",
    "tt0055479",
    "tt0168492",
    "tt0056063",
    "tt0054749",
    "tt2461750",
    "tt0056447",
    "tt0056676",
    "tt0056111",
    "tt0052600"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T01:57:49.600Z"
}