{
  "imdbId": "tt0008884",
  "title": "The Big Idea",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-big-idea-1917-directed-by-hal-mohr-gilbert-pratt",
      "id": "the-big-idea-1917-directed-by-hal-mohr-gilbert-pratt",
      "title": "The Big Idea (1917) Directed By Gilbert Pratt",
      "description": "The Big Idea Directed by Gilbert Pratt Produced by Hal Roach Starring Harold Lloyd Cinematography Hal Mohr Production company Rolin Films Distributed by Pathé Exchange Release date December 30, 1917 Running time 1 reel Country United States Language Silent (English intertitles ) The Big Idea is a 1917 American short comedy film starring Harold Lloyd . [ 1 ] The film has been preserved and is available online. [ 2 ] Plot Harold, Snub and Bebe are employees at a pawn shop that is having trouble attracting customers. The boss informs Bebe that business is so slow that he will have to let her go. Both Harold and Snub are smitten by Bebe. Harold comes up with a clever way to save Bebe's job. He circulates a fake telegram stating there is an item in the pawn shop marked with a double X that contains $10,000. Harold proceeds to mark numerous items in the shop with the double X and makes sure that several people on the street accidentally see the bogus telegram. Very soon the hopeful customers come into the antique store and buy almost everything on the floor. The happy proprietor rehires Bebe. She and Snub see the phony telegram too. Snub sees the only unsold item left in the shop—a large vase—has a double X on it and buys it. Snub eagerly buys the vase before Harold can tell him about the ruse. Snub angrily smashes the vase—and finds a large sack containing $10,000. Snub and Bebe happily leave the antique shop arm in arm with the huge amount of money. Cast Harold Lloyd Snub Pollard Bebe Daniels William Blaisdell Sammy Brooks Lige Conley (credited as Lige Cromley) Billy Fay William Gillespie Gus Leonard Norman Napier Fred C. Newmeyer Dorothea Wolbert Reception Like many American films of the time, The Big Idea was subject to cuts by city and state film censorship boards . For example, the Chicago Board of Censors required a cut of a closeup of hands holding U.S. currency. [ 3 ] See also List of American films of 1917 Harold Lloyd filmography References 1 \"Progressive Silent Film List: The Big Idea \" . silentera.com . Retrieved July 6, 2010 . 2 The Big Idea , vimeo.com 3 \"Official Cut-Outs by the Chicago Board of Censors\" . Exhibitors Herald . 6 (8). New York City: Exhibitors Herald Company: 29. February 16, 1918.",
      "fileSize": 305950815,
      "addedAt": "2026-01-07T00:11:46.533Z",
      "thumbnail": "https://archive.org/services/img/the-big-idea-1917-directed-by-hal-mohr-gilbert-pratt",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 85
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 6.5,
    "imdbVotes": 222,
    "Genre": "Short, Comedy",
    "Plot": "Harold and Snub are both trying to court the same girl, who works in the same antiques store as Harold. When Harold and the girl's boss may fire the girl due to poor business leading to Harold no longer seeing her, Harold, without telling anyone including his boss, enacts a plan to bring not only customers into the store but make them purchase items they never would have otherwise. While Harold's plan does achieve this specific goal, it also has an unexpected consequence with regard to his and Snub's rivalry over the girl.",
    "Director": "Hal Mohr, Gilbert Pratt",
    "Writer": "Hal Mohr",
    "Actors": "Harold Lloyd, 'Snub' Pollard, Bebe Daniels",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0007709",
    "tt0007764",
    "tt0007809",
    "tt0007686",
    "tt0008331",
    "tt0008401",
    "tt0008432",
    "tt0008493",
    "tt0007956",
    "tt0008844",
    "tt0009099",
    "tt0009071"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}