{
  "imdbId": "tt0042392",
  "title": "Destination Big House",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/destination-big-house",
      "id": "destination-big-house",
      "title": "Destination Big House",
      "description": "Title: Destination Big House Summary: School teacher Janet Brooks innocently involves herself in a scandal while spending the week-end alone in the mountain cabin of her fiancée, Dr. Walter Phillips. She gives first aid to a ... Directed by: George Blair Actors: Dorothy Patrick, Robert Rockwell, Jimmy Lydon Production Company: Republic Pictures (I) Release Date: 1 June 1950 (USA) Aspect Ratio: 1.37 : 1 School teacher Janet Brooks innocently involves herself in a scandal while spending the week-end alone in the mountain cabin of her fiancée, Dr. Walter Phillips. She gives first aid to a wounded racketeer, Joe Bruno, who is running out on his mob with eighty thousand dollars in cash. Unknown to Janet, Bruno hides the money in the cabin. She goes on an errand and two mobsters, Ed Somers and \"Stubby\" Moore), make a call on Bruno and then depart after delivering a couple of soon-to-be-fatal gunshot wounds. Bruno manages to get to the highway and hitches a ride from a passing motorist who drives him to the Coniston hospital. In front of a number of doctors as witnesses, Bruno draws up a will leaving the eighty-thousand bucks to Janet, but dies before he can reveal where the money is located. The story hits the local headlines the next day and Janet's denials of any previous acquaintance with Bruno or knowledge of the money are disbelieved. Janet, her mother, Celia, and her brother, Fred, ...",
      "fileSize": 4298156489,
      "addedAt": "2026-01-07T00:07:59.607Z",
      "thumbnail": "https://archive.org/services/img/destination-big-house",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 974
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "60 min",
    "imdbRating": 6.9,
    "imdbVotes": 43,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "School teacher Janet Brooks innocently involves herself in a scandal while spending the week-end alone in the mountain cabin of her fiancée, Dr. Walter Phillips. She gives first aid to a wounded racketeer, Joe Bruno, who is running out on his mob with eighty thousand dollars in cash. Unknown to Janet, Bruno hides the money in the cabin. She goes on an errand and two mobsters, Ed Somers and \"Stubby\" Moore), make a call on Bruno and then depart after delivering a couple of soon-to-be-fatal gunshot wounds. Bruno manages to get to the highway and hitches a ride from a passing motorist who drives him to the Coniston hospital. In front of a number of doctors as witnesses, Bruno draws up a will leaving the eighty-thousand bucks to Janet, but dies before he can reveal where the money is located. The story hits the local headlines the next day and Janet's denials of any previous acquaintance with Bruno or knowledge of the money are disbelieved. Janet, her mother, Celia, and her brother, Fred, are ostracized by the town. Only Walter, who is having trouble of his own trying to raise money to complete a polio wing for the hospital, stands by Janet. Janet publicly announces that if the money ever comes into her possession, she will turn it over to the hospital fund. Somers and Moore intensify their search. But Fred, under pressure from Pete Weiss, local racketeer to whom he owes a large gambling debt, finally succeeds in finding the money, but his conscience forces him to hide it again rather than turning it over to Weiss.",
    "Director": "George Blair",
    "Writer": "Eric Taylor, Mortimer Braus",
    "Actors": "Dorothy Patrick, Robert Rockwell, Jimmy Lydon",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043144",
    "tt0128271",
    "tt0041765",
    "tt0040561",
    "tt0042685",
    "tt0036790",
    "tt0042453",
    "tt0042869",
    "tt0043142",
    "tt0042274",
    "tt0042394",
    "tt0043292"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.607Z"
}