{
  "movieId": "tt0055597",
  "title": "Victim",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/v615585",
      "id": "v615585",
      "title": "Victim",
      "description": "Title: Victim Summary: The death of a young man leads to the discovery of a blackmail plot against a number of gay men in 1960s London. Directed by: Basil Dearden Actors: Dirk Bogarde, Sylvia Syms, Dennis Price Production Company: Allied Film Makers (AFM) Release Date: 11 October 1961 (Denmark) Aspect Ratio: 1.75 : 1 A plea for reform of England's anti-sodomy statutes, Melville Farr, a married lawyer, tries to locate a blackmailer who has photos of Farr and a crying young gay man (who is being blackmailed and later commits suicide) in Farr's car. After the suicide, Farr tracks down other gay men being extorted for money by the same blackmail scheme. Worldly police Detective Inspector Harris considers the sodomy law nothing more than an license to blackmailers, and eventually is contacted by Farr to capture the malicious blackmailer. The movie, far ahead of its time, ends with Farr and his loving wife coming to terms with his homosexual tendencies in advance of the public exposure he will faces in the team of blackmailers' trial.",
      "fileSize": 723396541,
      "addedAt": "2026-01-07T00:12:55.133Z",
      "thumbnail": "https://archive.org/services/img/v615585",
      "year": 1961,
      "collection": "feature_films",
      "downloads": 2489
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/victim-1961_202506",
      "id": "victim-1961_202506",
      "title": "Victim (1961)",
      "description": "Victim is a 1961 British neo-noir suspense film directed by Basil Dearden and starring Dirk Bogarde and Sylvia Syms. Watch on RetroFlix:  https://retroflix.org/victim-1961/",
      "fileSize": 1454308852,
      "addedAt": "2026-01-07T00:12:55.133Z",
      "thumbnail": "https://archive.org/services/img/victim-1961_202506",
      "language": "eng",
      "year": 1961,
      "collection": "feature_films",
      "downloads": 170
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "100 min",
    "imdbRating": 7.7,
    "imdbVotes": 7574,
    "Genre": "Drama, Thriller",
    "Plot": "A plea for reform of England's anti-sodomy statutes, Melville Farr (Sir Dirk Bogarde), a married lawyer, tries to locate a blackmailer who has photos of Farr and a crying young gay man (who is being blackmailed and later commits suicide) in Farr's car. After the suicide, Farr tracks down other gay men being extorted for money by the same blackmail scheme. Worldly Police Detective Inspector Harris (John Barrie) considers the anti-sodomy law nothing more than a license to blackmailers, and eventually is contacted by Farr to capture the malicious blackmailer. The movie, far ahead of its time, ends with Farr and his loving wife coming to terms with his homosexual tendencies in advance of the public exposure he will face in the team of blackmailers' trial.",
    "Director": "Basil Dearden",
    "Writer": "Janet Green, John McCormick",
    "Actors": "Dirk Bogarde, Sylvia Syms, Dennis Price",
    "Language": "English, Latin",
    "Country": "United Kingdom",
    "Awards": "Nominated for 2 BAFTA 3 nominations total"
  },
  "relatedMovies": [
    "tt0058754",
    "tt0039398",
    "tt0057415",
    "tt0053242",
    "tt0054627",
    "tt0054687",
    "tt0054254",
    "tt0150524",
    "tt0055630",
    "tt0054295",
    "tt0054380",
    "tt2017464"
  ],
  "collections": [
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.133Z"
}