{
  "imdbId": "tt0030273",
  "title": "International Crime",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/InternationalCrime1938",
      "title": "International Crime",
      "description": "Title: International Crime Summary: Lamont Cranston ( Rod La Rocque ), amateur criminologist and detective, with a daily radio program, sponsored by the Daily Classic newspaper, has developed a friendly feud that sometimes ... Directed by: Charles Lamont Actors: Rod La Rocque, Astrid Allwyn, Thomas E. Jackson Production Company: M & A Alexander Productions Inc. Release Date: 23 April 1938 (USA) Aspect Ratio: 1.37 : 1 Lamont Cranston (",
      "fileSize": 739061376,
      "id": "InternationalCrime1938"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/international-crime-1938",
      "title": "International Crime (1938)",
      "description": "The second and final Grand National Pictures film to feature The Shadow, played again by Rod La Rocque. In this version, Lamont Cranston is an amateur detective and host of a radio show with his assistant Phoebe (not Margo) Lane. Cabbie Moe Shrevnitz and Commissioner Weston also appear. Watch on RetroFlix:  https://retroflix.org/international-crime-1938/",
      "fileSize": 179288785,
      "id": "international-crime-1938"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/international_crime",
      "title": "International Crime",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4572687590,
      "id": "international_crime"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/international_crime_1938",
      "title": "International Crime",
      "description": "Taken from IMDB: Lamont Cranston, amateur criminologist and detective, with a daily radio program, sponsored by the Daily Classic newspaper, has developed a friendly feud that sometimes passes the friendly stage with Police Commissioner Weston. He complains to his managing editor, Edward Heath, over the problems that have developed in his department since Phoebe Lane has been hired as his assistant. He is advised to forget it since she is the publisher's niece. During his broadcast about Honest John, a famous safe cracker who has served his time, Phoebe gives him a note that the Metropolitan Theatre is to be robbed at eight o'clock and she is so insistent that he adds it as his closing note. Off the air, he learns she got the information from a man she met in a café who had an honest face. Cranston goes to the theatre where Weston and his men have gathered and, of course, nothing happens but, across town, a safe is blown at the home of international banker Gerald Morton and the banker is killed. Cranston arrives there ahead of the police and discovers enough evidence to show him that it wasn't just a simple robbery with the banker accidentally killed. The irate Weston has him jailed as a material witness, but Phoebe comes through with a habeas corpus in time for him to make his broadcast. Honest John crashes into the studio with a gun and demands that Cranston exonerates him over the air from the police suspicion that he committed the robbery. Weston rushes to the studio but Honest John has escaped. Cranston takes Phoebe on a tour of night clubs hoping she will spot the man who gave her the robbery message. She does and Cranston poses as a new arrival from Europe and learns that the man is Flotow and his companion is Starkov. They make a date for lunch the next day. While they are waiting for him to join them for lunch, Cranston breaks into Flathow's apartment where he meets Phoebe who also has had the same idea. A phone call is answered and Morton's butler says there is a meeting at the Morton home that afternoon. Written by Les Adams longhorn1939@suddenlink.net",
      "fileSize": 1350201252,
      "id": "international_crime_1938"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k5MW-zexL4o",
      "title": "International Crime (1938) THE SHADOW",
      "description": "Stars: Rod La Rocque, Astrid Allwyn, Thomas E. Jackson\nDirector: Charles Lamont\n\nLamont Cranston aka The Shadow is an amateur criminologist and detective who hosts a daily radio news program. A tip about impending robbery detours the cops and Cranston from the real bank burglary across town, which results in the death of the bank owner!",
      "id": "k5MW-zexL4o",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R0Q3KDBXFIs",
      "title": "International Crime (1938) Adventure, Crime, Mystery",
      "description": "CRIME DIDN'T PAY WHEN THIS MASTER DETECTIVE STEPPED IN!  The Shadow Magazine ceased publication with the Summer 1949 issue, but Walter B. Gibson wrote three new \"official\" stories between 1963 and 1980.\n \nDirector: Charles Lamont\nWriters: Theodore A. Tinsley, Jack Natteford\nStars: Rod La Rocque, Astrid Allwyn, Thomas E. Jackson\nGenres: Classics, Adventure, Crime, Mystery\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "R0Q3KDBXFIs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": 5.4,
    "imdbVotes": 503,
    "Genre": "Drama",
    "Plot": "Lamont Cranston (Rod La Rocque), amateur criminologist and detective, with a daily radio program, sponsored by the Daily Classic newspaper, has developed a friendly feud that sometimes passes the friendly stage with Police Commissioner Weston (Thomas E. Jackson). He complains to his managing editor, Edward Heath (Oscar O'Shea), over the problems that have developed in his department since Phoebe Lane (Astrid Allwyn) has been hired as his assistant. He is advised to forget it since she is the publisher's niece. During his broadcast about Honest John (William Pawley), a famous safe cracker who has served his time, Phoebe gives him a note that the Metropolitan Theatre is to be robbed at eight o'clock and she is so insistent that he adds it as his closing note. Off the air, he learns she got the information from a man she met in a café who had an honest face. Cranston goes to the theatre where Weston and his men have gathered and, of course, nothing happens but, across town, a safe is blown at the home of international banker Gerald Morton (John St. Polis) and the banker is killed. Cranston arrives there ahead of the police and discovers enough evidence to show him that it wasn't just a simple robbery with the banker accidentally killed. The irate Weston has him jailed as a material witness, but Phoebe comes through with a habeas corpus in time for him to make his broadcast. Honest John crashes into the studio with a gun and demands that Cranston exonerates him over the air from the police suspicion that he committed the robbery. Weston rushes to the studio but Honest John has escaped. Cranston takes Phoebe on a tour of night clubs hoping she will spot the man who gave her the robbery message. She does and Cranston poses as a new arrival from Europe and learns that the man is Flotow (Wilhelm von Brincken) and his companion is Starkov (Tenen Holtz'). They make a date for lunch the next day. While they are waiting for him to join them for lunch, Cranston breaks into Flathow's apartment where he meets Phoebe who also has had the same idea. A phone call is answered and Morton's butler says there is a meeting at the Morton home that afternoon.",
    "Director": "Charles Lamont",
    "Writer": "Theodore A. Tinsley, Jack Natteford, John W. Krafft",
    "Actors": "Rod La Rocque, Astrid Allwyn, Thomas E. Jackson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0030736",
      "title": "Shadows Over Shanghai",
      "year": 1938,
      "imdbRating": 5.5,
      "imdbVotes": 163,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030763",
      "title": "Slander House",
      "year": 1938,
      "imdbRating": 5.3,
      "imdbVotes": 86,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031778",
      "title": "Panama Patrol",
      "year": 1939,
      "imdbRating": 5.1,
      "imdbVotes": 104,
      "language": "English, Mandarin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029745",
      "title": "Wallaby Jim of the Islands",
      "year": 1937,
      "imdbRating": 4.8,
      "imdbVotes": 77,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027316",
      "title": "August Weekend",
      "year": 1936,
      "imdbRating": 5.1,
      "imdbVotes": 107,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027406",
      "title": "Bulldog Edition",
      "year": 1936,
      "imdbRating": 5.5,
      "imdbVotes": 93,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027896",
      "title": "The Little Red Schoolhouse",
      "year": 1936,
      "imdbRating": 5,
      "imdbVotes": 45,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028186",
      "title": "Ring Around the Moon",
      "year": 1936,
      "imdbRating": 6.1,
      "imdbVotes": 66,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027501",
      "title": "The Dark Hour",
      "year": 1936,
      "imdbRating": 5.4,
      "imdbVotes": 337,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027348",
      "title": "Below the Deadline",
      "year": 1936,
      "imdbRating": 5.5,
      "imdbVotes": 169,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027863",
      "title": "Lady Luck",
      "year": 1936,
      "imdbRating": 5.4,
      "imdbVotes": 54,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0026213",
      "title": "Circumstantial Evidence",
      "year": 1935,
      "imdbRating": 5.5,
      "imdbVotes": 112,
      "language": "Latin, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.187Z"
}