{
  "movieId": "tt0015841",
  "title": "The Freshman",
  "year": 1925,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E0-afdU7Z0w",
      "id": "E0-afdU7Z0w",
      "title": "The Freshman (1925) | Colorized Public Domain Silent Comedy Classic with Harold Lloyd",
      "description": "The Freshman (1925) is one of the greatest silent comedy films of the 1920s, directed by Fred C. Newmeyer and Sam Taylor and starring Harold Lloyd, one of the “big three” silent comedians alongside Charlie Chaplin and Buster Keaton. This restored and colorized edition revives a film that once defined college comedies, sports humor, and Harold Lloyd’s legacy as the “everyman” of silent cinema. For audiences in the United States, Europe, and beyond, The Freshman remains a landmark in early Hollywood storytelling, bridging slapstick comedy with character-driven heart.\n\nPlot Summary:\nHarold Lamb (Harold Lloyd) is an optimistic young man entering college for the first time. Naïve, eager, and desperate to fit in, Harold believes the key to popularity is imitation. He models himself after a movie character, earning the nickname “The Freshman.” His over-the-top enthusiasm makes him the butt of jokes, but he remains determined to win respect and recognition.\n\nHarold falls in love with Peggy (Jobyna Ralston), who admires his sincerity even when others mock him. To prove himself, Harold joins the college football team, though the coach sees him as little more than comic relief. When the big game arrives, Harold unexpectedly becomes the school’s last hope, leading to one of the most iconic sports comedy finales in film history.\n\nCast and Crew:\n• Directors: Fred C. Newmeyer, Sam Taylor\n• Producer: Harold Lloyd\n• Cinematography: Walter Lundin\n• Editor: Allen McNeil\nStarring:\n• Harold Lloyd as Harold Lamb\n• Jobyna Ralston as Peggy\n• Brooks Benedict as The College Cad\n• James Anderson as The Football Coach\n• Joseph Harrington as Harold’s Father\n\nFilm Significance:\nThe Freshman was one of Harold Lloyd’s most successful films and a cultural milestone of the 1920s. It helped popularize the “college comedy” genre that would influence decades of American cinema, from screwball comedies to modern teen films. Beyond humor, it captures the universal themes of fitting in, self-doubt, and personal triumph. Its climactic football sequence is regarded as one of the funniest and most thrilling set pieces of the silent era. Harold Lloyd’s ability to combine physical comedy with emotional sincerity made this film a box office smash and cemented his place in cinema history.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Freshman remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1925 release was a black-and-white silent film. While historically significant, silent films often struggle to capture the attention of modern audiences. By colorizing The Freshman, we make Harold Lloyd’s humor, timing, and heart more approachable and engaging for viewers today. For older audiences in the United States and Europe, it revives nostalgia for the silent era, while younger viewers discover why Harold Lloyd stood alongside Chaplin and Keaton as one of cinema’s pioneers.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including silent comedies, forgotten dramas, and historically significant features. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences worldwide.\n\n#TheFreshman1925 #HaroldLloyd #SilentComedy #PublicDomainMovie #ColorizedClassic #CollegeComedy #1920sCinema #FilmRestoration #ClassicMovies #SilentFilm",
      "addedAt": "2025-12-24T00:48:59.938Z",
      "thumbnail": "https://i.ytimg.com/vi/E0-afdU7Z0w/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBUKFAwDw==&rs=AOn4CLBovSUR2taDa1iw4JAM7nVXiGE0Jw",
      "duration": 4483,
      "language": "en",
      "year": 1925,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-freshman",
      "id": "silent-the-freshman",
      "title": "The Freshman",
      "fileSize": 23843216943,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-freshman",
      "language": "English",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 3021
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thefreshman4k",
      "id": "thefreshman4k",
      "title": "The Freshman (1925) [Colorized, 4K, 60FPS]",
      "description": "The Freshman is a 1925 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 5597749119,
      "addedAt": "2026-01-07T00:12:44.281Z",
      "thumbnail": "https://archive.org/services/img/thefreshman4k",
      "collection": "feature_films",
      "downloads": 119
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "77 min",
    "imdbRating": 7.5,
    "imdbVotes": 6373,
    "Genre": "Comedy, Family, Romance",
    "Plot": "Harold Lamb's dream is to go to college and become the most popular student on campus, much like the character Speedy played by actor Lester Laurel in the movie \"The College Hero\". Accepted into Tate College, Harold plans on emulating Speedy, including giving himself the nickname Speedy, to gain that popularity, not realizing that if he does so, he will be more the buffoon than the hero. To be the most popular student, he will have to outdo the current most popular student, football captain Chet Trask. Unaware Speedy's task is made all the more difficult when one of the upperclassmen, seeing how hard Speedy is trying to impress, does whatever he can to make Speedy look all the more ridiculous, all the while Speedy believing he is achieving his dream. The bully's efforts are made all the more easy as Speedy is able to buy his way to seeming popularity with the small nest egg he was able to accumulate from work. The one thing that Speedy may not be able to buy is his way onto the football team, which he is convinced is the only surefire way to becoming the campus hero, despite not realizing that he truly is not the football type. While Speedy remains unaware how he truly looks to his classmates, Peggy, the daughter of the owner of the rooming house where he is staying, is aware, she who is in love with him, and he with her. The love of a good woman may be able to provide Speedy with a clearer understanding of who he truly should be to impress, and/or get his mind focused on other things other than being everyone's best friend.",
    "Director": "Fred C. Newmeyer, Sam Taylor",
    "Writer": "Sam Taylor, Ted Wilde, John Grey",
    "Actors": "Harold Lloyd, Jobyna Ralston, Brooks Benedict",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    "tt0014945",
    "tt0014611",
    "tt0013075",
    "tt0015002",
    "tt0014429",
    "tt0018051",
    "tt5863634",
    "tt0067818",
    "tt0015559",
    "tt0015563",
    "tt0038704",
    "tt0016332"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.281Z"
}