{
  "movieId": "tt0068997",
  "title": "The New Centurions",
  "year": 1972,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-new-centurions-1972",
      "id": "the-new-centurions-1972",
      "title": "The New Centurions (1972)",
      "description": "The New Centurions (1972) is a crime drama film that explores the lives of Los Angeles police officers as they navigate the complexities and challenges of their demanding profession.The story primarily follows Officer Roy Fehler , played by George C. Scott , a seasoned cop who mentors younger officers, including Officer Chris Kline (played by John Wayne ) and Officer Eileen Haskins (played by Barbara Hershey ). The film portrays their day-to-day experiences on the job, highlighting the emotional toll, moral dilemmas, and dangers they face on the streets.As the film progresses, themes of violence, corruption, and the struggle between personal and professional lives are explored, particularly through the relationships and experiences of the main characters. Each officer deals with the harsh realities of police work, revealing the impact it has on their mental health and personal relationships.The film's narrative combines gritty realism with social commentary, offering a poignant look at the life of police officers during a tumultuous period in America.",
      "fileSize": 995943094,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-new-centurions-1972",
      "language": "eng",
      "year": 1972,
      "collection": "feature_films",
      "downloads": 317
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "103 min",
    "imdbRating": 7,
    "imdbVotes": 3222,
    "Genre": "Action, Crime, Drama",
    "Plot": "A group of new police recruits takes to patrolling the streets of Los Angeles. Roy Fehler is a law student with a family and has joined the LAPD until he can complete his degree. He's partnered with veteran patrolman Kilvinski and they soon develop a good rapport. On the street the policemen are exposed to the seedier side of life but Kilvinski is a fair cop and a good teacher. Over time however, Fehler comes to love the work and both his family and his studies fall by the wayside. Kilvinsky retires and Fehler loses his way, drinking heavily. Fehler's wife leaves him and he soon hits bottom. Just as he begins to get his life in order, fate intervenes.",
    "Director": "Richard Fleischer",
    "Writer": "Stirling Silliphant, Joseph Wambaugh, Robert Towne",
    "Actors": "George C. Scott, Stacy Keach, Jane Alexander",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0069446",
    "tt0158714",
    "tt0143428",
    "tt0069948",
    "tt0066970",
    "tt0071402",
    "tt0073755",
    "tt0070930",
    "tt0048983",
    "tt0048790",
    "tt0041983",
    "tt0040178"
  ],
  "collections": [
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}