{
  "imdbId": "tt0035255",
  "title": "Ridin' Down the Canyon",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RidinDownTheCanyon1942",
      "id": "RidinDownTheCanyon1942",
      "title": "Ridin' Down the Canyon (1942)",
      "description": "Ridin' Down the Canyon (1942) PD - Copyright not renewed",
      "fileSize": 1231053707,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RidinDownTheCanyon1942",
      "collection": "feature_films",
      "downloads": 17305
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RidinDowntheCanyon",
      "id": "RidinDowntheCanyon",
      "title": "Ridin' Down the Canyon",
      "description": "When a gang of rustlers steal a herd from Alice Blake (Linda Hayes), her kid brother Bobbie (Robert 'Buzz' Henry), sets out to get help from his radio favorites, Roy Rogers, King of the Cowboys, and the Sons of the Pioneers, who are en route to Lariat Lodge to play a one-night stand.",
      "fileSize": 1310232688,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RidinDowntheCanyon",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 4656
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=frObF3aLtVM",
      "id": "frObF3aLtVM",
      "title": "Ridin' Down the Canyon (1942) ROY ROGERS",
      "description": "Stars: Roy Rogers, George 'Gabby' Hayes, Bob Nolan\nDirector: Joseph Kane\n\nJim Fellows, is the head of a government experiment in wild horse reclamation for purposes other than war, and his efforts are hampered by Gus Jordan, manager of the swanky Lariat Lodge dude ranch, but actually the leader of a gang of rustlers who steal the horses as fast as the ranchers can round them up for the project.",
      "addedAt": "2025-12-26T23:51:00.720Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/frObF3aLtVM/maxresdefault.webp",
      "duration": 3186,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "55 min",
    "imdbRating": 6.5,
    "imdbVotes": 103,
    "Genre": "Drama, Music, Western",
    "Plot": "Those who might write about this film without seeing it might also question why the government needed horses during WW II (if that is all they knew about it from a short synopsis read somewhere), but viewing it one can learn that Jim Fellows, is the head of a government experiment in wild horse reclamation for purposes other than war, and his efforts are hampered by Gus Jordan, manager of the swanky Lariat Lodge dude ranch, but actually the leader of a gang of rustlers who steal the horses as fast as the ranchers can round them up for the project. When the rustlers steal a herd from Alice Blake, her kid brother Bobbie, sets out to get help from his radio favorites, Roy Rogers, King of the Cowboys, and the Sons of the Pioneers, who are en route to Lariat Lodge to play a one-night stand. While riding down the road with Gabby Whittaker, who has given him a ride in his jalopy, Bobbie sees three men who he recognizes as rustlers and, when he tries to stop them, they begin beating him with whips. His life is saved by the timely arrival of Roy and the Sons of the Pioneers. On the way to take Bobbie back to his sister, who is at the Fellows Ranch, they run into the rustlers on a raid, and take Burt Wooster and Pete prisoners. Wooster, the foreman at the Fellows Ranch, is actually an accomplice working for Jordan. He insists that he is not a gang member and Roy, pretending to believe him, agrees to let him take Pete to Sheriff Brite. Unaware that Roy and the Sons are following, Wooster and Pete go straight to the Lariat Lodge, where Wooster, after announcing that he is quitting, soon learns that he should have gone to the Sheriff with Pete, because Jordan and Pete shoot him. He lives long enough to tell Roy that the signal for a rustler raid is the playing of a certain song over the Lodge's nightly radio program.",
    "Director": "Joseph Kane",
    "Writer": "Robert Creighton Williams, Norman Houston, Albert DeMond",
    "Actors": "Roy Rogers, George 'Gabby' Hayes, Bob Nolan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035396",
    "tt0034832",
    "tt0035364",
    "tt0033367",
    "tt0033771",
    "tt0034088",
    "tt0036033",
    "tt0033944",
    "tt0033287",
    "tt0033286",
    "tt0032274",
    "tt0031051"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}