{
  "imdbId": "tt0004210",
  "title": "Laughing Gas",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/laughing-gas-1914-directed-by-charlie-chaplin",
      "title": "Laughing Gas (1914) Directed By Charlie Chaplin",
      "description": "Laughing Gas Directed by Charlie Chaplin Produced by Mack Sennett Starring Charlie Chaplin Cinematography Frank D. Williams Edited by Charles Chaplin Production company Keystone Studios Distributed by Mutual Film Release date July 9, 1914 Running time 16 minutes Country United States Languages Silent film English intertitles Laughing Gas is a 1914 film starring Charlie Chaplin . [ 1 ] The film is also known as Busy Little Dentist , Down and Out , Laffing Gas , The Dentist , and Tuning His Ivories . It is inspired by the 1907 film with the same name . Plot We are told Charlie is a dental assistant working at Dr. Pain's dental office. He arrives at work where the patients are already waiting. He joins the tiny second dental assistant in the back room. They have a brief squabble then Charlie goes to the waiting room to clean the floor with a carpet sweeper . He bumps into a patient and a squabble starts. The second dental assistant trips over the carpet sweeper and another squabble starts in the back room. The dentist arrives, and his first patient goes in, obviously in pain. The dentist prepares the nitrous oxide anaesthetic (also known commonly as \"laughing gas\" due to its effects prior to and after unconsciousness). With the man unconscious he pulls his tooth, but then he can't get him to wake up, so he calls for Charlie and runs off when the latter arrives. Charlie tries to wake him and eventually tries hitting his head with a mallet. The man revives but starts laughing. Charlie knocks him out with the mallet. The dentist then returns and Charlie is sent to the drug store to get a prescription for the unconscious man. After more fighting with the patients, he goes to the Sunset Pharmacy. He accidentally hits with his cane a man who is standing at a news-stand outside the pharmacy, and the two have a squabble. When Charlie leaves the pharmacy he kicks the man in the rear, and another squabble starts. The squabble is interrupted when they encounter a woman (the dentist's wife) and Charlie kicks him in the stomach before chasing the woman himself. However, Charlie accidentally pulls off her skirt, causing her to run off in embarrassment. He continues fighting with the news-stand man, who receives a brick in the face and thus loses his teeth. Charlie then throws a second brick, which hits a tall passer-by and losing him teeth as well. Meanwhile, the dentist's wife goes home and his maid sees her without her skirt, so she calls the dentist to say that his wife has had an \"accident\". He immediately goes home and Charlie returns to find the surgery empty. He picks the prettier of the two female patients in the waiting room to go in, causing the other lady to leave in indignance. Charlie flirts with her and steals kisses. Meanwhile, the two men injured by Charlie arrive to see the dentist, and the dentist and his wife return to the office. The girl leaves and Charlie has the tall passerby go in next, while the news-stand man recognizes Charlie as the man who has knocked his teeth out. Charlie uses a huge pair of pliers to remove another tooth from the tall man. The news-stand man enters and confronts Charlie. A final fight ensues. Reviews A reviewer from Motion Picture News wrote, \"Besides getting into a fight with two of his master's patients and getting generally in the way, [Chaplin] doesn't do anything except create roars of laughter.\" [ 2 ] Cast Charlie Chaplin - Dentist's Assistant Fritz Schade - Dr. Pain, the Dentist Alice Howell - Mrs. Pain, the Dentist's Wife Joseph Sutherland - Short Assistant Slim Summerville - Patient Josef Swickard - Patient Mack Swain - Patient Gene Marsh - Patient (uncredited) References 1 Walker, Brent E. (2010). Mack Sennett's Fun Factory: A History and Filmography of His Studio and His Keystone and Mack Sennett Comedies, with Biographies of Players and Personnel . McFarland Inc. p. 297. ISBN   9780786457076 . Retrieved 20 February 2024 . 2 The Film Index: A Bibliography . H.W. Wilson Company. p. 379 . Retrieved 21 February 2024 . From Wikipedia, the free encyclopedia",
      "id": "laughing-gas-1914-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-laughing-gas",
      "title": "Laughing Gas",
      "id": "silent-laughing-gas"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": "5.6",
    "imdbVotes": "1,665",
    "Genre": "Short, Comedy",
    "Plot": "Charlie pretends to be a dentist though he is only his assistant. When a patient can't stop laughing from the anesthesia Charlie knocks him out with a club. He is sent to the drug store, gets in a fight with a man who (after a brick in the face) becomes another patient, and pulls the skirt off the dentist's wife (who is out walking). At one point Charlie pulls a tooth (the wrong one) using enormous pliers.",
    "Director": "Charles Chaplin",
    "Writer": "N/A",
    "Actors": "Charles Chaplin, Fritz Schade, Alice Howell",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0003863",
      "title": "Dough and Dynamite",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,197",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004100",
      "title": "His Musical Career",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,171",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003923",
      "title": "The Face on the Barroom Floor",
      "year": 1914,
      "imdbRating": "5.2",
      "imdbVotes": "1,215",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004311",
      "title": "The Masquerader",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,564",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004546",
      "title": "The Rounders",
      "year": 1914,
      "imdbRating": "6.2",
      "imdbVotes": "1,820",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004108",
      "title": "His Trysting Place",
      "year": 1914,
      "imdbRating": "6.2",
      "imdbVotes": "1,010",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004011",
      "title": "A Fair Exchange",
      "year": 1914,
      "imdbRating": "5.5",
      "imdbVotes": "1,032",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004102",
      "title": "His Prehistoric Past",
      "year": 1914,
      "imdbRating": "5.3",
      "imdbVotes": "1,082",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004101",
      "title": "His New Profession",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,417",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003760",
      "title": "Caught in the Rain",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "1,162",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004007",
      "title": "Gentlemen of Nerve",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "969",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004518",
      "title": "Recreation",
      "year": 1914,
      "imdbRating": "5.0",
      "imdbVotes": "1,277",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:07.407Z"
}