{
  "movieId": "tt0075784",
  "title": "A Bridge Too Far",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-bridge-too-far-1977",
      "id": "a-bridge-too-far-1977",
      "title": "A Bridge Too Far (1977)",
      "description": "A Bridge Too Far is a war film that dramatizes the ambitious Allied operation known as Operation Market Garden during World War II. The operation, devised by British Field Marshal Bernard Montgomery, aimed to quickly end the war by seizing key bridges in the Netherlands. The film is set in September 1944, following the D-Day invasion, as Allied forces are looking to exploit their momentum in Europe. The operation involves an aerial assault by paratroopers to capture bridges across the Dutch rivers, facilitating a ground advance by armored units. It comprises two parts: the airborne drops and ground attacks.As the airborne troops are dropped behind enemy lines, they face fierce German resistance. Miscommunications and logistical issues arise, leading to critical delays for ground forces, preventing them from reaching the paratroopers in time. The film accutely portrays the struggles of the soldiers as they fight against overwhelming odds. The operation ultimately fails, with Allied forces suffering heavy casualties. The film concludes with a poignant reflection on the cost of the failed mission, emphasizing themes of bravery, sacrifice, and the complexities of warfare. A Bridge Too Far explores not only the strategic failures of the operation but also the humanity of the soldiers involved, making the film a significant portrayal of WWII and the challenges of military operations.",
      "fileSize": 2609519178,
      "addedAt": "2026-01-07T00:07:18.437Z",
      "thumbnail": "https://archive.org/services/img/a-bridge-too-far-1977",
      "language": "eng",
      "year": 1977,
      "collection": "feature_films",
      "downloads": 335
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "175 min",
    "imdbRating": 7.4,
    "imdbVotes": 66372,
    "Genre": "Drama, History, War",
    "Plot": "The true story of Operation Market Garden, the Allies attempt, in September 1944, to hasten the end of World War II by driving through Belgium and Holland into Germany. The idea was for U.S. airborne divisions to take the towns of Eindhoven and Nijmegen and a British airborne division, reinforced by a Polish airborne brigade, to take the town of Arnhem. They would be reinforced, in due course and in turn, by the British XXX Corps, land-based and driving up from the British lines in the south. The key to the operation was the bridges, as if the Germans held or blew them, the paratroopers could not be relieved. Faulty intelligence, Allied high command hubris, and stubborn German resistance would ensure that Arnhem was a bridge too far.",
    "Director": "Richard Attenborough",
    "Writer": "Cornelius Ryan, William Goldman",
    "Actors": "Siem Vroom, Marlies van Alcmaer, Erik van 't Wout",
    "Language": "English, German, Dutch, Polish, Latin",
    "Country": "United States, United Kingdom",
    "Awards": "Won 4 BAFTA 7 wins & 5 nominations total"
  },
  "relatedMovies": [
    "tt0074400",
    "tt0080310",
    "tt0080979",
    "tt0092978",
    "tt0075404",
    "tt0057811",
    "tt0044400",
    "tt0227607",
    "tt0159476",
    "tt0014672",
    "tt0043590",
    "tt0035958"
  ],
  "collections": [
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.437Z"
}