{
  "movieId": "tt0075956",
  "title": "Double Nickels",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/double-nickels-1977",
      "id": "double-nickels-1977",
      "title": "Double Nickels (1977)",
      "description": "Two highway patrolmen think they are working on the side repossessing cars. But eventually, they realize that they have been tricked and are actually stealing the cars. Watch on RetroFlix:  https://retroflix.org/double-nickels-1977/",
      "fileSize": 1131725591,
      "addedAt": "2026-01-07T00:08:15.374Z",
      "thumbnail": "https://archive.org/services/img/double-nickels-1977",
      "language": "eng",
      "year": 1977,
      "collection": "feature_films",
      "downloads": 423
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/double-nickels",
      "id": "double-nickels",
      "title": "Double Nickels 1977",
      "description": "Two highway patrolmen (Jack Vacek, Ed Abrams) discover their moonlight work as car repossessors is actually grand theft auto.",
      "fileSize": 1131722497,
      "addedAt": "2026-01-07T00:08:15.374Z",
      "thumbnail": "https://archive.org/services/img/double-nickels",
      "collection": "feature_films",
      "downloads": 987
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "89 min",
    "imdbRating": 5.1,
    "imdbVotes": 206,
    "Genre": "Action, Comedy, Crime",
    "Plot": "In California, two highway patrol cops, Smokey and Ed are enforcing the speed limit on the Pacific Coast Highway. Sometimes they race one another, in their police cruisers, to the nearest donuts and coffee restaurant. They also like to give speeding teenagers a break, especially to Cool Breeze and Silver Fox who like to buzz the highway in their customized and tuned-up mini-vans. On their spare time, Smokey and Ed are romancing waitresses from various roadside diners. Their routine existence changes when they stop repo-man George Daniels for speeding. They give him a break and, in return, George offers to take them as partners for his repossession business. Smokey and Ed start their new, after-hours, career repossessing luxury cars with George who teaches them the trade. Things go well and the two cops make extra money from their new job. However, they must avoid the city police because highway patrolmen like Smokey and Ed are not allowed by the regulations to also work as repo-men. One day, George accidentally finds out that the 'financial institution' ordering the repossessions is, in fact, a front for a car-theft ring. George warns Smokey and Ed about this and together they must find a way to destroy the car-theft ring.",
    "Director": "Jack Vacek",
    "Writer": "Jack Vacek, Trice Schubert",
    "Actors": "Jack Vacek, Trice Schubert, Edward Abrahms",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0075260",
    "tt0079480",
    "tt0071216",
    "tt0082516",
    "tt10165952",
    "tt0028359",
    "tt0233142",
    "tt0028574",
    "tt0033510",
    "tt0031245",
    "tt0034754",
    "tt0024573"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:26:22.398Z"
}