{
  "imdbId": "tt0025465",
  "title": "Maniac",
  "year": 1934,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yfDZH0Vr5p8",
      "id": "yfDZH0Vr5p8",
      "title": "Maniac (1934) [Horror] [Exploitation]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | The movie \"Maniac\", also known as \"Sex Maniac\", is a 1934 black-and-white exploitation/horror film, directed by Dwain Esper and written by Hildagarde Stadie, Esper's wife, as a loose adaptation of the Edgar Allan Poe story \"The Black Cat\", with references to his \"Murders in the Rue Morgue\". Esper and Stadie also made the 1936 exploitation film Marihuana.\n\nThe film, which was advertised with the tagline \"He menaced women with his weird desires!\", is in the public domain. A restored version was made available in 1999, as part of a double feature with another Dwain Esper film, Narcotic! (1933). A full length RiffTrax for the movie was released on November 25, 2009, with commentary by Mike Nelson, Kevin Murphy, and Bill Corbett of Mystery Science Theater 3000 fame. John Wilson, the founder of the Golden Raspberry Award, named Maniac as one of the \"100 Most Amusingly Bad Movies Ever Made\" in his book The Official Razzie Movie Guide.\n\nClose-up of Bill Woods as \"Don Maxwell\" pretending to be \"Dr. Meirschultz\" Don Maxwell (William Woods) is a former vaudeville impersonator who is working as the lab assistant to Dr. Meirschultz (Horace B. Carpenter), a mad scientist attempting to bring the dead back to life. When Don kills Meirschultz, he attempts to hide his crime by \"becoming\" the doctor, taking over his work and copying his appearance and manner. In the process, he slowly goes insane.\n\nThe \"doctor\" treats a mental patient, Buckley (Ted Edwards), but accidentally injects him with adrenaline, which causes him to go into violent fits. In one of these fits, Buckley kidnaps a woman, tears her clothes off, and rapes her. Buckley's wife (Phyllis Diller) discovers the body of the real doctor, and blackmails Don into turning her husband into a zombie. The ersatz doctor turns the tables on her by manipulating her into fighting with his estranged wife (Thea Ramsey), a former showgirl. When the cat-breeding neighbor Goof sees what's going on, he calls the police, who stop the fight and, following the sound of Satan the cat, find the body of the real doctor hidden behind a brick wall.\n\n---\n\nDirected by Dwain Esper, produced by Dwain Esper, Louis Sonney and Hildagarde Stadie, written by Hildagarde Stadie, based on the novel \"The Black Cat\" by Edgar Allan Poe, starring Bill Woods as Don Maxwell, Horace B. Carpenter as Dr. Meirschultz, Ted Edwards as Buckley, Phyllis Diller as Mrs. Buckley, Thea Ramsey as Alice Maxwell Jenny Dark as Maizie, Marvel Andre as Marvel Celia, McCann as Jo, John P. Wade as Embalmer and Marian Blackton as Neighbor.\n\n---\n\nSource: \"Maniac (1934 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc..  23 April 2017. Web. 24 April 2017. https://en.wikipedia.org/wiki/Maniac_(1934_film)\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:40:57.149Z",
      "thumbnail": "https://i.ytimg.com/vi/yfDZH0Vr5p8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA6A3mPZL0ihfHVAmENq3Q5OMhlmA",
      "duration": 3057,
      "language": "en",
      "year": 1934,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Maniac",
      "id": "Maniac",
      "title": "Maniac",
      "description": "A failed actor, after killing the mad scientist he works for, decides to take over the scientist's life and continue his work. You can find out more about this movie on its IMDB page . There is an AVI of the movie here .",
      "fileSize": 2209453791,
      "addedAt": "2026-01-07T00:06:38.751Z",
      "thumbnail": "https://archive.org/services/img/Maniac",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 79163
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Maniac1934",
      "id": "Maniac1934",
      "title": "Maniac",
      "description": "Notorious film from early exploitation king Dwain Esper, who brought us such classic early titles as \"Sex Madness,\" \"Narcotic,\" \"Reefer Madness,\" \"How To Undress In Front Of Your Husband,\" and \"Marihuana.\" Film's IMDb page: http://www.imdb.com/title/tt0025465/",
      "fileSize": 1123984864,
      "addedAt": "2026-01-07T00:06:38.751Z",
      "thumbnail": "https://archive.org/services/img/Maniac1934",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 67560
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/maniac-1934_202504",
      "id": "maniac-1934_202504",
      "title": "Maniac (1934)",
      "description": "An ex-vaudeville actor is working as the assistant to a doctor who has Frankenstein aspirations. The ex-vaudeville actor kills the doctor and decides to assume the identity of the dead physician. Watch on RetroFlix:  https://retroflix.org/maniac-1934/",
      "fileSize": 319113938,
      "addedAt": "2026-01-07T00:09:46.426Z",
      "thumbnail": "https://archive.org/services/img/maniac-1934_202504",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 95
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/maniac-4-k",
      "id": "maniac-4-k",
      "title": "Maniac (1934) [Colorized , 4k, 60fps]",
      "description": "Maniac is a 1934 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 4531364938,
      "addedAt": "2026-01-07T00:09:46.426Z",
      "thumbnail": "https://archive.org/services/img/maniac-4-k",
      "collection": "feature_films",
      "downloads": 416
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=y-jlW6oBQaM",
      "id": "y-jlW6oBQaM",
      "title": "Maniac (1934) MASTERPIECE of MADNESS",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nDirector: Dwain Esper\nScreenplay: Hildagarde Stadie\nStars: Bill Woods, Horace B. Carpenter, Ted Edwards\n\n🍕A doctor with a Frankenstein complex and an ex-Vaudeville actor do a Deadly Tango in Dwain Esper's Masterpiece of Madness 🍕\n\nTRIVIA: DWAIN ESPER produced and directed only a handful of films -- Narcotic (1933,) Maniac (1934,) Marihuana (1936,) How to Undress in Front of Your Husband (1937,) Sex Madness (1938.) He is perhaps best remembered for Cult Classic Reefer Madness. The film was originally produced in 1936 by George Hirliman and financed by a church group under the title Tell Your Children. Shortly after its release Dwain Esper re-cut the film, gave it a more catchy title, and the seeds for the Cannabis Culture Classic were planted.\n\n\n\n\n\n\n.",
      "addedAt": "2025-12-24T01:08:21.468Z",
      "thumbnail": "https://i.ytimg.com/vi/y-jlW6oBQaM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCYKjRgvzfwIKnm18C2I52e02D2jw",
      "duration": 3119,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "51 min",
    "imdbRating": 3.7,
    "imdbVotes": 2732,
    "Genre": "Horror, Sci-Fi",
    "Plot": "Don Maxwell is an ex-vaudeville ham, wanted by police, who has now found himself as the unlikely assistant to Dr. Meirschultz, a mad scientist in the business of reanimating corpses. Maxwell's gift of impersonation gets him and Meirschultz past the guards and into a morgue where they use a special serum to revive the corpse of a pretty young woman. But that's nothing. Dr. Meirschultz has a heart beating in a jar of solution and is eager to put it into a corpse that really needs it. Meirschultz gives his assistant a gun and advises him to commit suicide, so that he can put the heart in him, but Maxwell shoots and kills the scientist instead and hides the body. People will miss Meirschultz, Maxwell quickly realizes, but no one will miss his lowly assistant; and so Maxwell dons eyeglasses and a fake beard to become his onetime benefactor. The trouble is, he impersonates the mad doctor too well and goes crazy himself.",
    "Director": "Dwain Esper",
    "Writer": "Hildegarde Stadie",
    "Actors": "Bill Woods, Horace B. Carpenter, Ted Edwards",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025391",
    "tt0026663",
    "tt0024184",
    "tt0024188",
    "tt0027521",
    "tt0147467",
    "tt0022835",
    "tt0021884",
    "tt0026683",
    "tt0070222",
    "tt0047149",
    "tt0053337"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.426Z"
}