{
  "imdbId": "tt0027308",
  "title": "The Arizona Raiders",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheArizonaRaiders",
      "id": "TheArizonaRaiders",
      "title": "The Arizona Raiders",
      "description": "After saving himself from hanging, Laramie Nelson (Buster Crabbe) saves Tracks Williams (Raymond Hatton) from the same fate. They then travel to Lindsay's ranch where they get jobs. There they run into Adams (Grant Withers) who they learn is planning to rustle Lindsay's horses.",
      "fileSize": 1329824982,
      "addedAt": "2026-01-07T00:06:58.272Z",
      "thumbnail": "https://archive.org/services/img/TheArizonaRaiders",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 124099
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kYycSf8pWAU",
      "id": "kYycSf8pWAU",
      "title": "The Arizona Raiders (1936) BUSTER CRABBE🍕ZANE GREY",
      "description": "Stars: Buster Crabbe, Raymond Hatton, Marsha Hunt\nDirector: James P. Hogan\nWriter: Zane Grey (novel)\n\nAfter saving himself from hanging, Laramie Nelson saves Tracks Williams from the same fate. They then travel to Lindsay's ranch where they get jobs. There they run into Adams who they learn is planning to rustle Lindsay's horses.",
      "addedAt": "2025-12-26T23:47:06.686Z",
      "thumbnail": "https://i.ytimg.com/vi/kYycSf8pWAU/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDyzCkvW8C880EOoinXfRqaDISstw",
      "duration": 3440,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "57 min",
    "imdbRating": 5.2,
    "imdbVotes": 104,
    "Genre": "Western",
    "Plot": "Laramie Nelson (Buster Crabbe) falsely accused of horse-stealing, is about to be strung up by a posse when a sudden lurch of his horse knocks down his would-be executioners, and he makes his escape. He soon comes upon another hanging posse and saves \"Honest\" Tracks Williams (Raymond Hatton), accused of a long, long list of minor crimes, and the two ride off together. They come to a small Arizona town, and their first encounter is with attorney Monroe Adams (Grant Withers) and his client, Harriet Lindsay (Marsha Hunt), owner of the large, prosperous Spanish Peaks ranch. Harriet and Adams have come to town to stop the marriage of her young sister, Lenta (Betty Jane Rhodes), to shy young Alonzo \"Lonesome\" Mulhall (Johnny Downs). They are successful, and Alonzo is jailed, along with Tracks, following his attempt to shoot up the town. Tracks offers to arrange an elopement for Alonzo as soon as they are out of jail. Laramie gets them out of jail ahead of schedule by stampeding a herd of cattle through town during a Fourth of July celebration. The three head for Harriet's ranch, where Laramie and Tracks get jobs as ranch hands, while Alonzo hides out in the brush. Laramie soon discovers that Adams is in league with ranch foreman Luke Arledge (Don Rowan) to steal Harriet's herd of fine horses.",
    "Director": "James P. Hogan",
    "Writer": "Zane Grey, Robert Yost, John W. Krafft",
    "Actors": "Buster Crabbe, Raymond Hatton, Marsha Hunt",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027511",
    "tt0033140",
    "tt0027551",
    "tt0028890",
    "tt0028653",
    "tt0028668",
    "tt0029119",
    "tt0030006",
    "tt0031054",
    "tt0029952",
    "tt0027361",
    "tt0027369"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.272Z"
}