{
  "movieId": "tt0047475",
  "title": "The Shanghai Story",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-shanghai-story-1954",
      "id": "the-shanghai-story-1954",
      "title": "The Shanghai Story (1954)",
      "description": "Ruth Roman, Edmond O'Brien, Richard Jaeckel, Whit Bissell, Marvin Miller, Paul Picerni, Philip Ahn, Frank Ferguson, Victor Sen Yung, Richard Loo",
      "fileSize": 3029886925,
      "addedAt": "2026-01-07T00:12:22.159Z",
      "thumbnail": "https://archive.org/services/img/the-shanghai-story-1954",
      "collection": "feature_films",
      "downloads": 1042
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 5.8,
    "imdbVotes": 225,
    "Genre": "Action, Crime, Drama",
    "Plot": "Too many years in the Orient have made a bitter man of Dr. Dan Maynard (Edmond O'Brien), an American surgeon, and too little emotional stability has tarnished the Tangier-born Rita King (Ruth Roman). They meet when a night-raid by Shanghai's police chief brings all westerners together in the Waldorf House Hotel, where they are interned under the guardianship of the coldly cruel Major Ling Wu (Philip Ahn). Only Rita is free to come and go due to her friendship with Shanghai;s new police chief, Colonal Zorek (Marvin Miller. The liberty and luxury in which she lives arouses Maynard's contempt. But his opinion changes when she is instrumental in getting Major Wu replaced and punished, and when she arranges for a young girl, Penny Warren (Jeanne Perreau'), to be taken to a hospital for an emergency operation. But when a spy hunt reaches a bitter climax, and an internee is shot down while trying to escape, Maynard believes the tip-off came from Rita.",
    "Director": "Frank Lloyd",
    "Writer": "Steve Fisher, Seton I. Miller, Lester Yard",
    "Actors": "Ruth Roman, Edmond O'Brien, Richard Jaeckel",
    "Language": "English, Chinese",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0171344",
    "tt0045463",
    "tt0045465",
    "tt0042176",
    "tt0044382",
    "tt0048209",
    "tt0047479",
    "tt0046928",
    "tt0134771",
    "tt1248984",
    "tt0048108",
    "tt0045563"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.159Z"
}