{
  "imdbId": "tt0026903",
  "title": "Queen of the Jungle",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/QueenOfTheJungle",
      "id": "QueenOfTheJungle",
      "title": "Queen of the Jungle",
      "description": "An adventure serial in 12 chapters that is a mind-boggling mix of new sound footage with footage from the silent serial \"The Jungle Goddess.\" All 12 chapters are strung together in one file, which might make this the longest unintentionally hilarious movie in history. Good luck in getting through all 3 hours and 17 minutes with your reason intact! Directed by Robert F Hill. Released in 1935 (and 1922). runtime 197 minutes. complete print. NOTE: Another mix of sound and silent footage with side-splitting results is \"The White Gorilla,\" which is available here at IA.",
      "fileSize": 3870679036,
      "addedAt": "2026-01-07T00:06:45.468Z",
      "thumbnail": "https://archive.org/services/img/QueenOfTheJungle",
      "collection": "feature_films",
      "downloads": 14645
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AlFpfxN7EC8",
      "id": "AlFpfxN7EC8",
      "title": "1955 - Queen of the Jungle - TV's First action heroine swings into chaos!",
      "description": "Sheena, the jungle's fearless guardian, teams up with photographer Bob Rayburn to protect her Jungle domain. Bull Kendall, a wanted criminal, impersonates a guide to steal a tribe's valuable civet musk treasure, using violence, hypnotizing his wife to incite a tribal war, and creating chaos with rogue animals. \n\nColorized version: https://youtu.be/VP9w-IApJgg\n\nDirector: Carl K. Hittleman \nWriter: Based on the comics by Will Eisner & Jerry Iger\nStars:  Irish McCalla, Christian Drake, Neal the Chimp\n\nGenres: Adventure, Comedy, Fantasy\nRelease date: (TV series premiere) September 1955 \nFilming location: Mexico (jungle scenes) & California (studio shots)\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-24T00:59:33.077Z",
      "thumbnail": "https://i.ytimg.com/vi/AlFpfxN7EC8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAblBcltshA5aerxF0vBo0iFl5H7A",
      "duration": 4304,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "197 min",
    "imdbRating": 4,
    "imdbVotes": 83,
    "Genre": "Adventure, Comedy, Fantasy",
    "Plot": "A 12-chapter serial built around stock footage from a 1922 silent serial, \"The Jungle Goddess\",young David Worth and Joan Lawrence are children with a group of explorers that are seeking African radium deposits. They are playing in the basket of the party's air balloon when the bag takes off with Joan aboard, last seen sailing over the back-lot jungle. This puts a chill on the expedition and all hands return to whence they came. The end of chapter 1, \"Lost in the Clouds\", finds Marilyn's balloon being shot down by the flaming arrows of a native tribe. Chapter 2,\"Radium Rays\", reveals that Joan survived her descent and the tribe named \"the child from the sky\" as their queen and priestess.A flash forward of about 18 years finds that the now-adult David has returned to Africa to search for his long-lost childhood friend.He hits the trail and is quickly captured by the tribesmen and is brought to their sadistic ruler,who turns out to be a now-grown Joan. Unaware of his or her own true identity, she orders the stranger sacrificed to the tribal god. David is tied before a huge idol whose eyes shine as a concealed radium cylinder is uncovered. Chapter two ends with David's clothes smoking and burning and the beams intensifying. Dire straits indeed for David, but there is hope since there are ten chapters to go.",
    "Director": "Robert F. Hill",
    "Writer": "Griffin Jay",
    "Actors": "Mary Kornman, Marilyn Spinner, Reed Howes",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032428",
    "tt0028637",
    "tt0030143",
    "tt0031397",
    "tt0038300",
    "tt0031124",
    "tt0054237",
    "tt0055946",
    "tt0104418",
    "tt0045094",
    "tt0031058",
    "tt0054851"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.468Z"
}