{
  "imdbId": "tt0045020",
  "title": "Penny Princess",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pp885527952",
      "id": "pp885527952",
      "title": "Penny Princess",
      "description": "Title: Penny Princess Summary: A ordinary young American woman learns that she has become the owner of a tiny European country. Comedy and romance ensue. Directed by: Val Guest Actors: Yolande Donlan, Dirk Bogarde, A.E. Matthews Production Company: Conquest Productions Release Date: 24 March 1953 (USA) Aspect Ratio: 1.37 : 1 A tiny European country which for years has survived financially only through evading its bills and smuggling is finally facing bankruptcy, when a rich American agrees to save the place by buying it. But before, the deal is closed, he dies. His nearest relative and heir turns out to be a young woman with high ethical and democratic standards, but no experience with money, or affairs of state, or Europe. A charming young English visitor helps her to muddle through. Comedy and romance follow.",
      "fileSize": 732335437,
      "addedAt": "2026-01-07T00:10:21.539Z",
      "thumbnail": "https://archive.org/services/img/pp885527952",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 10934
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "94 min",
    "imdbRating": 6,
    "imdbVotes": 313,
    "Genre": "Comedy, Romance",
    "Plot": "A tiny European country, which for years has survived financially only through evading its bills and smuggling, is finally facing bankruptcy, when a rich American agrees to save the place by buying it. But before the deal is closed, he dies. His nearest relative and heir turns out to be a young woman with high ethical and democratic standards, but no experience with money, or affairs of state, or Europe. A charming young English visitor helps her to muddle through.",
    "Director": "Val Guest",
    "Writer": "Val Guest",
    "Actors": "Yolande Donlan, Dirk Bogarde, A.E. Matthews",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0047434",
    "tt0044853",
    "tt0044000",
    "tt0162342",
    "tt0043983",
    "tt0043651",
    "tt0044962",
    "tt0043721",
    "tt0044125",
    "tt0045670",
    "tt0043313",
    "tt0043526"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.539Z"
}