{
  "imdbId": "tt0028405",
  "title": "Trapped by Television",
  "year": 1936,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mpc3tqxT9pk",
      "title": "Trapped by Television (1936) | Colorized Public Domain Sci-Fi Crime with Mary Astor and Lyle Talbot",
      "description": "Trapped by Television (1936) is a fascinating blend of science fiction, crime drama, and Depression-era industrial intrigue. Directed by Del Lord and distributed by Columbia Pictures, this film stands out as an early cinematic exploration of television technology at a time when TV was still experimental and largely unknown to the public. This restored and colorized edition revitalizes a forgotten gem, making it engaging for modern audiences in the United States, Europe, and worldwide. By adding color and digital restoration, we bridge the gap between the 1930s’ speculative vision of technology and today’s reality, offering a unique historical and cinematic experience.\n\nPlot Summary:\nThe story follows Fred Dennis (Lyle Talbot), a struggling television engineer determined to perfect a new system that will revolutionize broadcasting. Burdened by debt and pursued by creditors, Fred’s ambitions seem doomed until he meets Barbara (Mary Astor), a business-minded entrepreneur who believes in his invention. Together, they face constant financial and industrial challenges, as well as cutthroat competition from rival corporations eager to steal Fred’s breakthrough.\n\nWhen a local gangster learns about Fred’s television innovation, he sees it as a tool for his criminal operations. Drawn into a dangerous web of corruption and greed, Fred must defend his work, his reputation, and his life. Barbara’s determination and courage help balance Fred’s idealism, as the two fight both corporate espionage and underworld interference. The climax combines suspense and technological spectacle, highlighting the dangers and promises of new inventions.\n\nTrapped by Television is more than a crime drama — it’s a cultural artifact capturing the optimism and anxieties surrounding early television, years before it became a household reality in the 1940s and 1950s.\n\nCast and Crew:\n• Director: Del Lord\n• Producer: Jack Fier\n• Screenplay: John W. Krafft and Ewart Adamson\n• Cinematography: Benjamin Kline\n• Editing: Richard Fantl\nStarring:\n• Mary Astor as Barbara\n• Lyle Talbot as Fred Dennis\n• Nat Pendleton as Rocky, the Gangster\n• Thurston Hall as George, Industrial Competitor\n• Joyce Compton as Honey\n• Warren Hymer as Lefty\n• Wallis Clark as Mr. Brown\n\nFilm Significance:\n“Trapped by Television” is notable for its unusual subject matter — television technology — during an era when films were more commonly about gangsters, melodrama, or musicals. It merges crime film tropes with speculative science, making it one of the rare pre-war attempts to dramatize technology that would later reshape culture. Mary Astor, already a respected actress, and Lyle Talbot, known for his steady work across genres, elevate the film’s drama beyond its modest budget. For modern viewers, it provides a glimpse into 1930s optimism and suspicion toward scientific innovation.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Trapped by Television remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1936 release was in black and white, like most Depression-era films. While historically authentic, many viewers today overlook monochrome pictures. By presenting this colorized edition, we preserve the originality of the narrative while enhancing its appeal for contemporary audiences who prefer immersive visuals. This makes the film’s unique combination of science fiction and crime far more engaging.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten science fiction experiments to crime dramas and culturally significant stories. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TrappedByTelevision #MaryAstor #LyleTalbot #1930sMovies #PublicDomainMovie #ColorizedClassic #ScienceFictionClassic #FilmRestoration #GoldenAgeHollywood #CrimeDrama",
      "id": "mpc3tqxT9pk",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4sCka2NfUEw",
      "title": "Trapped By Television (1936) MARY ASTOR",
      "description": "Stars: Mary Astor, Lyle Talbot, Nat Pendleton\nDirector: Del Lord\n\nAn inventor looking for backing for his television invention gets involved with a crooked businessman and gangsters who try to steal his invention.",
      "id": "4sCka2NfUEw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TrappedByTelevision1936",
      "title": "Trapped By Television 1936",
      "description": "Not to be confused with \"Murder By Television\" starring Bela Lugosi. This film is about a young inventor trying to get his television system financed. A gang of crooks are out to stop him. This film is considered science fiction by many because the concept of television was still on the drawing boards in the 30's, but it's also a comedy. Stars Lyle Talbot, Mary Astor, Nat Pendleton, and Joyce Compton. Whether you would consider this scifi or not, you should find it entertaining anyway.",
      "id": "TrappedByTelevision1936"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": "5.8",
    "imdbVotes": "366",
    "Genre": "Comedy, Crime, Drama",
    "Plot": "An inventor looking for backing for his television invention gets involved with a crooked businessman and gangsters who try to steal his invention.",
    "Director": "Del Lord",
    "Writer": "Lee Loeb, Harold Buchman, Sherman L. Lowe",
    "Actors": "Mary Astor, Lyle Talbot, Nat Pendleton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0028346",
      "title": "Reefer Madness",
      "year": 1936,
      "imdbRating": "3.7",
      "imdbVotes": "9,511",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029199",
      "title": "A Man Betrayed",
      "year": 1936,
      "imdbRating": "5.6",
      "imdbVotes": "119",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027501",
      "title": "The Dark Hour",
      "year": 1936,
      "imdbRating": "5.4",
      "imdbVotes": "337",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0182242",
      "title": "I'll Name the Murderer",
      "year": 1936,
      "imdbRating": "5.2",
      "imdbVotes": "205",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028083",
      "title": "Panic on the Air",
      "year": 1936,
      "imdbRating": "5.4",
      "imdbVotes": "121",
      "language": "Cantonese, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027863",
      "title": "Lady Luck",
      "year": 1936,
      "imdbRating": "5.4",
      "imdbVotes": "54",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0029670",
      "title": "Thunder in the City",
      "year": 1937,
      "imdbRating": "6.1",
      "imdbVotes": "436",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028774",
      "title": "The Great Hospital Mystery",
      "year": 1937,
      "imdbRating": "6.1",
      "imdbVotes": "74",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028748",
      "title": "The Crime Nobody Saw",
      "year": 1937,
      "imdbRating": "6.1",
      "imdbVotes": "85",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027214",
      "title": "The Whole Town's Talking",
      "year": 1935,
      "imdbRating": "7.3",
      "imdbVotes": "3,405",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029728",
      "title": "What Price Vengeance",
      "year": 1937,
      "imdbRating": "4.8",
      "imdbVotes": "73",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024985",
      "title": "City Park",
      "year": 1934,
      "imdbRating": "5.4",
      "imdbVotes": "46",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T18:41:02.986Z"
}