{
  "movieId": "tt0023293",
  "title": "The Old Dark House",
  "year": 1932,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1aU7KjAiR4Y",
      "id": "1aU7KjAiR4Y",
      "title": "The Old Dark House (1932) | Colorized Public Domain Horror Mystery Classic Directed by James Whale",
      "description": "The Old Dark House (1932) is a pre-Code American horror film directed by James Whale, best known for his work on Frankenstein (1931) and The Invisible Man (1933). Originally produced and distributed by Universal Pictures, this atmospheric classic blends gothic horror, suspense, and dark comedy. Presented here in a restored and colorized edition, it revives one of the greatest haunted-house thrillers of early Hollywood for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nA group of weary travelers seek shelter from a violent storm in a remote Welsh mansion owned by the mysterious and eccentric Femm family. Inside, they encounter bizarre and unsettling hosts: Horace Femm, a nervous recluse; his religiously fanatical sister Rebecca; the mute and scarred butler Morgan; and the sinister presence of a locked-away family member whose danger grows as the night unfolds. As the storm rages, secrets, madness, and murder emerge from the shadows of the house.\n\nThe film stands out for its chilling atmosphere, razor-sharp dialogue, and a mix of horror and satire that keeps audiences both uneasy and amused. Its gothic setting and strange characters established a blueprint for countless haunted-house films that followed.\n\nCast and Crew:\n• Director: James Whale\n• Producer: Carl Laemmle Jr.\n• Screenplay: Benn W. Levy, R. C. Sherriff\n• Based on: The novel \"Benighted\" (1927) by J. B. Priestley\n• Cinematography: Arthur Edeson\n• Editing: Clarence Kolster\n\nStarring:\n• Boris Karloff as Morgan, the brutish butler\n• Melvyn Douglas as Roger Penderel\n• Charles Laughton as Sir William Porterhouse\n• Raymond Massey as Philip Waverton\n• Gloria Stuart as Margaret Waverton\n• Ernest Thesiger as Horace Femm\n• Eva Moore as Rebecca Femm\n• Lilian Bond as Gladys DuCane Perkins\n• Brember Wills as Saul Femm\n\nFilm Significance:\nThe Old Dark House is a landmark in early horror cinema. With James Whale’s signature mix of gothic atmosphere and witty irreverence, the film redefined the haunted house genre. Boris Karloff’s terrifying performance as the mute butler cemented his horror legend after his success as Frankenstein’s monster. Charles Laughton and Gloria Stuart (later known for Titanic in 1997) add depth to the cast, making the ensemble unforgettable. Although initially overlooked, the film has since been recognized as a cult classic and an essential piece of Universal’s horror legacy.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Old Dark House remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1932 release was filmed in black and white, which contributed to its moody gothic atmosphere but can deter modern audiences. By colorizing this edition, we preserve the tension and shadowy suspense while making the film more visually accessible to today’s viewers. This approach helps bridge the gap between historical authenticity and contemporary viewing habits, ensuring that James Whale’s unique mix of horror and wit reaches new audiences worldwide.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheOldDarkHouse #JamesWhale #BorisKarloff #1930sHorror #PublicDomainMovie #ColorizedClassic #ClassicCinema #UniversalHorror #GoldenAgeHollywood #CultClassicHorror #HauntedHouseMovie",
      "addedAt": "2025-12-24T00:49:41.828Z",
      "thumbnail": "https://i.ytimg.com/vi/1aU7KjAiR4Y/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYRyBVKGUwDw==&rs=AOn4CLD_zlX1A3pS_-7IaZFnsm2o_NGNHw",
      "duration": 4216,
      "language": "en",
      "year": 1932,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-old-dark-house-1932-colorized",
      "id": "the-old-dark-house-1932-colorized",
      "title": "The Old Dark House (1932) Colorized",
      "description": "The Old Dark House (1932) Colorized",
      "fileSize": 674645109,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-old-dark-house-1932-colorized",
      "collection": "feature_films",
      "downloads": 265
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-old.-dark.-house.-1932",
      "id": "the.-old.-dark.-house.-1932",
      "title": "The Old Dark House (1932)",
      "description": "The Old Dark House is a 1932 American pre-Code comedy horror film directed by James Whale. Based on the 1927 novel Benighted by J. B. Priestley. It follows  five travelers seek refuge from a violent storm in a decaying Welsh mansion owned by the eccentric Femm family. As the night unfolds, they encounter bizarre characters and dangerous situations, including a mute butler and a crazed pyromaniac, leading  to a mix of horror and dark comedy.",
      "fileSize": 1195013556,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-old.-dark.-house.-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 317
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 7,
    "imdbVotes": 13736,
    "Genre": "Adventure, Comedy, Drama",
    "Plot": "Seeking shelter from a pounding rainstorm in a remote region of Wales, several travellers are admitted to a gloomy, foreboding mansion belonging to the extremely strange Femm family. Trying to make the best of it, the guests must deal with their sepulchral host, Horace Femm and his obsessive, malevolent sister Rebecca. Things get worse as the brutish manservant Morgan gets drunk, runs amuck and releases the long pent-up brother Saul, a psychotic pyromaniac who gleefully tries to destroy the residence by setting it on fire.",
    "Director": "James Whale",
    "Writer": "J.B. Priestley, Benn W. Levy, R.C. Sherriff",
    "Actors": "Boris Karloff, Melvyn Douglas, Charles Laughton",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0025639",
    "tt0025015",
    "tt0023271",
    "tt0019887",
    "tt0021884",
    "tt0024222",
    "tt0329531",
    "tt0021013",
    "tt0023243",
    "tt4364194",
    "tt1582465",
    "tt0060584"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}