{
  "imdbId": "tt0047178",
  "title": "A Life at Stake",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Lsc9OlFzyzo",
      "title": "A Life at Stake (1954) [Film Noir] [Drama]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"A Life at Stake\" is an American Film Noir directed by Paul Guilfoyle. The film is also known as \"Key Man\".\n\nDown-on-his-luck Los Angeles architect and builder Edward Shaw (Keith Andes) is approached by Doris Hillman (Angela Lansbury) with a business proposal: buying land together, on which he would build houses that she would then sell, using her experience as a former real estate broker. Her husband, Gus Hillman, a wealthy businessman, would be willing to contribute half a million dollars as capital for the venture.\n\nDoris quickly seems interested in more than a purely professional relationship. Shaw starts an affair with her and accepts the business offer. However, an accidental discovery leaves him convinced that the Hillmans' interest lies less in the long-term profits of the venture than in the $175,000 key man insurance policy he took on himself as a precondition for the deal, and that an attempt on his life is imminent.\n\nMadge, the younger sister of Doris, develops a romantic interest in Shaw as well. Without knowing what Doris has planned, she reveals to Shaw that her sister was married previously to a man who died in Wyoming when his car crashed over a bridge. Shaw ends up drugged by Gus Hillman and barely keeps his car from going off a cliff.\n\nThe police are skeptical about his story and the insurance company refuses to cancel the policy, Hillman having portrayed Shaw as a man who is trying to steal his wife. Madge teams with Shaw to try to foil her sister's scheme, but Doris lures him to a mountain cabin and shoots him with a gun. A wounded Shaw sees both Hillmans struggle then fall to their deaths through a clifftop doorway, just minutes before Madge and the cops arrive.\n\n---\n\nDirected by Paul Guilfoyle, produced by A.C. Burger (associate producer), Charles Maxwell (executive producer) and Hank McCune (producer), written by Russ Bender (screenplay) and Hank McCune (story idea), starring Angela Lansbury as Doris Hillman, Keith Andes as Edward Shaw, Douglass Dumbrille as Gus Hillman, Claudia Barrett as Madge Neilan, Jane Darwell as Landlady, Gavin Gordon as Sam Pearson, Charles Maxwell as Lt. Hoff, William Henry as Myles Norman, Kathleen Mulqueen as Mary, Dan Sturkie as Officer Biff, Jeane Wood as Mabel, the maid and Robert Haver as Mechanic.\n\n---\n\nSource: \"A Life at Stake\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 June 2013. Web. 16 August 2013. http://en.wikipedia.org/wiki/A_Life_at_Stake.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "Lsc9OlFzyzo",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-life-at-stake-1955",
      "title": "A Life at Stake (1955)",
      "description": "An out-of-work architect meets a married woman who has a business proposition for him. The architect begins to suspect the woman's interest in him is not just financial and may actually be deadly. Watch on RetroFlix.org: https://retroflix.org/a-life-at-stake-1955/",
      "fileSize": 604849085,
      "id": "a-life-at-stake-1955"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/life_at_stake",
      "title": "Life at Stake",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4525618793,
      "id": "life_at_stake"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mLUetS1vy-E",
      "title": "A Life at Stake (1955) | Colorized Public Domain Noir Thriller with Angela Lansbury & Keith Andes",
      "description": "A Life at Stake (1955) is an American independent film noir thriller directed by Paul Guilfoyle, starring Angela Lansbury, Keith Andes, and Douglass Dumbrille. Originally released during the mid-1950s peak of noir filmmaking, this suspenseful public domain classic weaves a tale of seduction, greed, and deception. Colorized Public Domain has restored and colorized the film, offering a fresh visual dimension that makes its shadowy atmosphere and psychological tension even more compelling for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story follows Edward Shaw (Keith Andes), a struggling architect whose career is at a dead end. Desperate for a financial lifeline, he becomes entangled with the wealthy and alluring Doris Hillman (Angela Lansbury), the wife of a successful businessman. Doris proposes that Shaw join her in a lucrative real estate venture backed by her husband, Gus Hillman (Douglass Dumbrille). Initially skeptical, Shaw’s desperation drives him to accept the offer.\n\nBut Shaw soon realizes that Doris’s intentions are not as straightforward as they seem. When he discovers that she has secretly taken out a life insurance policy on him, his unease turns into outright paranoia. What begins as a chance at financial redemption spirals into a deadly game of manipulation and betrayal. Suspicion, lust, and greed collide as Shaw races to protect his life from those he can no longer trust. The film’s dark themes and tense atmosphere reflect the core trademarks of film noir — moral ambiguity, femme fatale seduction, and the dangers of desperation.\n\nCast and Crew:\n• Director: Paul Guilfoyle\n• Writer: Russell Birdwell\n• Producer: Hank McCune\n• Cinematography: Ted Allan\n• Editing: John F. Schreyer\n\nStarring:\n• Angela Lansbury as Doris Hillman\n• Keith Andes as Edward Shaw\n• Douglass Dumbrille as Gus Hillman\n• Claudia Barrett as Madge\n• Jane Darwell as Mrs. Mary Shaw\n\nFilm Significance:\n“A Life at Stake” is notable as one of Angela Lansbury’s early forays into darker, adult-themed roles, years before her international fame with “Murder, She Wrote.” Though made outside the major Hollywood studio system, the film captures the essence of independent noir filmmaking of the 1950s. Its themes of greed and betrayal echo Alfred Hitchcock’s influence and the era’s fascination with psychological thrillers. Today, the film holds cultural value as both a classic B-noir and a glimpse into Lansbury’s versatility as an actress.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like A Life at Stake remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1955 release was shot in black and white, consistent with film noir aesthetics of the period. While authentic, many modern viewers are less inclined to watch black-and-white films. This colorized version highlights details in costume, set design, and character interaction that make the suspense more gripping and visually immersive. By bridging the gap between historical authenticity and modern expectations, this edition ensures that audiences in the USA and Europe can rediscover a noir thriller that deserves a new spotlight.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#ALifeAtStake #AngelaLansbury #FilmNoir #PublicDomainMovie #ColorizedClassic #1950sThriller #ClassicCinema #FilmRestoration #NoirThriller #1955Movie",
      "id": "mLUetS1vy-E",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=t4uDAaQB0ew",
      "title": "A Life at Stake (1955) Drama, Film-Noir Full Length Movie",
      "description": "A Cheat At Heart From Her Painted Toes To Her Plunging Neckline!\nAn out-of-work architect meets a married woman who has a business proposition for him. The architect begins to suspect the woman's interest in him is not just financial and may actually be deadly.\n\nDirector: Paul Guilfoyle\nWriters:Russ Bender, Hank McCune \nStars: Angela Lansbury, Keith Andes, Douglass Dumbrille \nGenre:Drama, Film-Noir\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "t4uDAaQB0ew",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1955-a-life-at-stake-paul-guilfoyle-vose",
      "title": "1955 - A Life at Stake - Paul Guilfoyle - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "fileSize": 643591668,
      "id": "1955-a-life-at-stake-paul-guilfoyle-vose"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-life-at-stake-1955-colorized-movie-576p-sd",
      "title": "A Life at Stake (restored, colorized) (1955, film noir, imdb score: 5.8)",
      "description": "A Life at Stake is a 1955 American film noir directed by Paul Guilfoyle and starring Angela Lansbury , Keith Andes and Claudia Barrett . It was an independent production, made and distributed outside the Hollywood studio system .",
      "fileSize": 1026440520,
      "id": "a-life-at-stake-1955-colorized-movie-576p-sd"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/alifeatstake1955",
      "title": "A Life At Stake ( 1955) Featuring Angela Lansbury Film Noir",
      "description": "A Life at Stake is a 1955 American film noir directed by Paul Guilfoyle. It stars Angela Lansbury and Keith Andes. Wikipedia: https://en.wikipedia.org/wiki/A_Life_at_Stake Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 332588710,
      "id": "alifeatstake1955"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "78 min",
    "imdbRating": 5.8,
    "imdbVotes": 997,
    "Genre": "Drama, Film-Noir",
    "Plot": "An unemployed architect meets a married woman with a business proposition. The architect soon suspect her interest isn't just financial - and might be deadly.",
    "Director": "Paul Guilfoyle",
    "Writer": "Russ Bender, Hank McCune",
    "Actors": "Angela Lansbury, Keith Andes, Douglass Dumbrille",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0049621",
      "title": "Please Murder Me!",
      "year": 1956,
      "imdbRating": 6.5,
      "imdbVotes": 1693,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045604",
      "title": "Captain Scarface",
      "year": 1953,
      "imdbRating": 4.8,
      "imdbVotes": 279,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047878",
      "title": "The Big Combo",
      "year": 1955,
      "imdbRating": 7.3,
      "imdbVotes": 9203,
      "language": "English, Swedish, Latin, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047934",
      "title": "Chicago Syndicate",
      "year": 1955,
      "imdbRating": 6.5,
      "imdbVotes": 661,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047958",
      "title": "Crashout",
      "year": 1955,
      "imdbRating": 7,
      "imdbVotes": 791,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047976",
      "title": "Dementia",
      "year": 1955,
      "imdbRating": 6.7,
      "imdbVotes": 2746,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047904",
      "title": "A Bullet for Joey",
      "year": 1955,
      "imdbRating": 6,
      "imdbVotes": 1322,
      "language": "English, Spanish, Italian, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049204",
      "title": "Female Jungle",
      "year": 1955,
      "imdbRating": 5.5,
      "imdbVotes": 630,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048064",
      "title": "Female on the Beach",
      "year": 1955,
      "imdbRating": 6.4,
      "imdbVotes": 1550,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048160",
      "title": "Hell's Island",
      "year": 1955,
      "imdbRating": 5.9,
      "imdbVotes": 415,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048182",
      "title": "House of Bamboo",
      "year": 1955,
      "imdbRating": 6.8,
      "imdbVotes": 4367,
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048254",
      "title": "Killer's Kiss",
      "year": 1955,
      "imdbRating": 6.5,
      "imdbVotes": 27240,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:50:41.981Z"
}