{
  "imdbId": "tt0064699",
  "title": "Mosquito Squadron",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mosquito-squadron-1969_202507",
      "id": "mosquito-squadron-1969_202507",
      "title": "Mosquito Squadron (1969) David McCallum · Suzanne Neve",
      "description": "During World War II, an English air squadron must destroy a German V-rocket base in France, where their downed comrades are being held captive.",
      "fileSize": 3586892001,
      "addedAt": "2026-01-07T00:09:54.330Z",
      "thumbnail": "https://archive.org/services/img/mosquito-squadron-1969_202507",
      "language": "eng",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 262
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "90 min",
    "imdbRating": 5.7,
    "imdbVotes": 1703,
    "Genre": "Drama, War",
    "Plot": "Squadron Leader Quint Munroe, an RAF pilot in World War II, has a hard time dealing with the presumed death in action of fellow Sq. Leader David 'Scotty' Scott, whose family practically raised him when he was orphaned, so they were like brothers. RAF Air Commodore Hufford has a crucial task for Quint, who is no longer serving in the squadron: a reconnaissance flight over the château de Charlon, a castle in occupied France, where the Nazis are probably developing a new generation of flying bombs; the defenses are indeed suspiciously tight. When analyzed, the photos show the castle grounds harbor an underground launching tunnel, and Quint gets a nearly impossible precision top-secret mission: select and train a team in only 10 days, when the French underground believes the first launch is planned, to 'aim' a new type of bouncing bomb into the tunnel, to blow up the whole Luftwaffe installation. Quint falls in love with Scotty's young widow Beth Scott, whose crippled brother, Flight Lieutenant Douglas Shelton, is on his team. After the Gestapo catches and tortures a French underground member, the Luftwaffe drops a film showing the castle being filled with captured RAF men, one of which is, to Quint and Doug's shock, Scotty, not dead after all, causing a dilemma for which Quint presents an even more daring solution, to be prepared in a few days...",
    "Director": "Boris Sagal",
    "Writer": "Donald S. Sanford, Joyce Perry",
    "Actors": "David McCallum, Suzanne Neve, Charles Gray",
    "Language": "French, English, German",
    "Country": "United Kingdom, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0065093",
    "tt0064571",
    "tt0064110",
    "tt0062673",
    "tt0062688",
    "tt0064135",
    "tt0062819",
    "tt0065825",
    "tt0062357",
    "tt0062886",
    "tt0065966",
    "tt0061913"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.330Z"
}