{
  "imdbId": "tt0039757",
  "title": "The Red House",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1947-the-red-house-la-casa-roja-delmer-daves-ve",
      "title": "1947 The Red House La Casa Roja Delmer Daves Ve",
      "id": "1947-the-red-house-la-casa-roja-delmer-daves-ve"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1947-the-red-house-la-casa-roja-delmer-daves-vo",
      "title": "1947 The Red House La Casa Roja Delmer Daves Vo",
      "id": "1947-the-red-house-la-casa-roja-delmer-daves-vo"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1947-the-red-house-la-casa-roja-delmer-daves-vose",
      "title": "1947 The Red House La Casa Roja Delmer Daves Vose",
      "id": "1947-the-red-house-la-casa-roja-delmer-daves-vose"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheRedHouse",
      "title": "TheRedHouse",
      "description": "\"Middle-aged farmer goes to extreme lengths to protect the dark secret associated with a deserted house on his property. Murky psychological thriller with resonant settings and an emotive Miklos Rozsa score.\" - noir expert Spencer Selby",
      "id": "TheRedHouse"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheRedHouse_123",
      "title": "TheRedHouse 123",
      "description": "Pete and Ellen have reared Meg as their own, ever since she was a baby and her parents took off. Now a teen, Meg convinces her friend Nath to come help with chores on the farm. When Nath insists on using a short cut home through the woods, Pete gets quite agitated and warns him of screams in the night, of terrors associated with the red house. Curious, Meg and Nath ignore his warnings and begin exploring, getting closer to real danger and the dark secret of the red house.",
      "id": "TheRedHouse_123"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L6HZnUTPyho",
      "title": "The Red House (1947) [Thriller]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"The Red House\" is a 1947 psychological thriller starring Edward G. Robinson. It is adapted from the novel \"The Red House\" by George Agnew Chamberlain, published in 1943 by Popular Library. The novel was serialized in five consecutive issues of Saturday Evening Post, 10 March 1945 through 7 April 1945.\n\nHandicapped farmer Pete (Robinson) and sister Ellen (Anderson) have raised ward Meg as their own on a reclusive farm. Now a teen, Meg (Roberts) convinces her friend Nath to come help with chores on the farm. When Nath insists on using a shortcut home through the woods, Pete warns the young man of screams in the night and the terrors associated with the abandoned red house. Curious, Meg and Nath ignore his warnings and begin exploring and troubling secrets are revealed.\n\n---\n\nDirected by Delmer Daves, produced by Sol Lesser, written by George Agnew, Chamberlain (novel) and Delmer Daves, starring Edward G. Robinson, Lon McCallister, Judith Anderson and Rory Calhoun.\n\n---\n\nSource: \"The Red House (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 6 July 2012. Web. 29 July 2012. http://en.wikipedia.org/wiki/The_Red_House_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "L6HZnUTPyho",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FsXVxdkpR3w",
      "title": "The Red House (1947) | Colorized Public Domain Thriller with Edward G. Robinson and Julie London",
      "description": "The Red House (1947) is an American psychological thriller directed by Delmer Daves, blending mystery, suspense, and rural noir in a chilling tale of hidden secrets. This restored and colorized edition revives one of Edward G. Robinson’s most haunting performances, supported by a strong cast including Lon McCallister, Judith Anderson, Rory Calhoun, and Julie London. A film once overshadowed by Robinson’s gangster classics, The Red House endures as a gripping example of postwar paranoia and small-town gothic mystery, now revitalized in full color for modern audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe story follows Pete Morgan (Edward G. Robinson), a reclusive farmer who lives with his sister Ellen (Judith Anderson) and their adopted daughter Meg (Allene Roberts). Their isolated life begins to unravel when Meg convinces her schoolmate Nath Storm (Lon McCallister) to help with chores at the farm. Pete warns Nath to stay away from the woods nearby, claiming the land is haunted by strange cries and a sinister presence linked to a mysterious “Red House.” His increasingly paranoid and violent behavior sparks Nath’s curiosity, leading him to uncover dark secrets buried in the forest.\n\nAs Nath investigates further, he discovers a trail of lies, cover-ups, and long-hidden crimes. Pete’s obsession with the forbidden Red House exposes the truth about his past, involving jealousy, unrequited love, and a tragic act of violence that forever scarred the community. Meg, caught between loyalty to her adoptive father and growing feelings for Nath, must confront her own fears as the shocking truth behind the Red House is revealed. The suspense escalates to a disturbing climax where psychological terror collides with rural gothic atmosphere, cementing the film as one of the more unique thrillers of the 1940s.\n\nCast and Crew:\n• Director: Delmer Daves\n• Producer: Sol Lesser\n• Screenplay: Delmer Daves\n• Based on: Novel The Red House by George Agnew Chamberlain\n• Music: Miklós Rózsa\n• Cinematography: Bert Glennon\n• Editing: Merrill G. White\n\nStarring:\n• Edward G. Robinson as Pete Morgan\n• Lon McCallister as Nath Storm\n• Judith Anderson as Ellen Morgan\n• Allene Roberts as Meg Morgan\n• Rory Calhoun as Teller\n• Julie London as Tibby\n\nFilm Significance:\nThe Red House reflects the post-World War II fascination with psychological thrillers that explored guilt, repression, and hidden trauma. Edward G. Robinson, widely known for his gangster roles in Little Caesar (1931) and Key Largo (1948), here delivers a nuanced portrayal of a man consumed by guilt and paranoia. Judith Anderson, famous for her chilling role in Hitchcock’s Rebecca (1940), heightens the film’s atmosphere of menace, while composer Miklós Rózsa provides a haunting score that adds to the suspense. Though independently produced, the film’s gothic overtones, rural setting, and psychological depth make it stand out as one of the era’s most underrated thrillers. Its continued survival in the public domain has helped it gain cult recognition, especially among fans of classic noir and suspense.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Red House remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1947 release was in black and white, which reinforced the film’s moody, gothic tone. While effective, many modern viewers often pass over black-and-white films. By colorizing The Red House, we heighten its rural gothic atmosphere, enhance visual details in the woods and farm settings, and bring fresh dimension to Edward G. Robinson’s performance. This version bridges the gap between historical authenticity and contemporary accessibility, ensuring the film continues to resonate with modern audiences.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheRedHouse #EdwardGRobinson #JulieLondon #JudithAnderson #1940sThriller #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #MiklosRozsa #PsychologicalThriller #1947Movies",
      "id": "FsXVxdkpR3w",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/red-house-4-k",
      "title": "The Red house (1947) [Colorized, 4K, 60FPS]",
      "description": "The Red house is a 1947 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "red-house-4-k"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-red-house-1947",
      "title": "The Red House (1947)",
      "description": "An old man and his sister are concealing a terrible secret from their adopted teen daughter, concerning a hidden abandoned farmhouse, located deep in the woods. Watch on RetroFlix:  https://retroflix.org/the-red-house-1947/",
      "id": "the-red-house-1947"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-red.-house.-1947",
      "title": "The Red House (1947)",
      "description": "The Red House is a 1947 American psychological horror film directed by Delmer Daves and starring Edward G. Robinson , Lon McCallister, Judith Anderson, Rory Calhoun, Allene Roberts, and Julie London. It  follows a reclusive farmer, Pete Morgan, who lives with his sister and adopted daughter, Meg. When Meg convinces her classmate Nath to help on their farm, they become curious about a mysterious abandoned farmhouse in the woods, leading to dark secrets and tragic events involving Pete's past and his obsessive control over Meg.",
      "id": "the.-red.-house.-1947"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R_n39j05r1Q",
      "title": "The Red House (1947) EDWARD G. ROBINSON",
      "description": "Stars: Edward G. Robinson, Lon McCallister, Judith Anderson\nWriter/Director: Delmer Daves\n\nA reclusive farmer goes to extreme lengths to protect the dark secret of a decaying house on his property.",
      "id": "R_n39j05r1Q",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rJW_C5YO7aU",
      "title": "The Red House (1947) Edward G. Robinson, Lon McCallister | Movie, Subtitles",
      "description": "What I cannot have... I'll destroy!\nAn old man and his sister are concealing a terrible secret from their adopted teen daughter, concerning a hidden abandoned farmhouse, located deep in the woods. \n\nColorized version: https://youtu.be/m51N1GoQyoY\nDirector: Delmer Daves \nWriters: George Agnew Chamberlain, Delmer Daves\nStars: Edward G. Robinson, Lon McCallister, Judith Anderson\nGenre:  Classics, Drama, Film-Noir, Mystery\n\n@CultCinemaClassics",
      "id": "rJW_C5YO7aU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "100 min",
    "imdbRating": "6.7",
    "imdbVotes": "5,167",
    "Genre": "Drama, Film-Noir, Mystery",
    "Plot": "Pete (Edward G. Robinson) and Ellen Morgan (Dame Judith Anderson) have reared Meg (Allene Roberts) as their own, ever since she was a baby and her parents took off. Now a teen, Meg convinces her friend Nath Storm (Lon McCallister) to come help with chores on the farm: Pete isn't getting around on his wooden leg like he used to. When Nath insists on using a short cut home through the woods, Pete gets quite agitated and warns him of screams in the night, of terrors associated with the red house. Curious, Meg and Nath ignore his warnings and begin exploring. Meg begins falling in love with Nath, but his girlfriend Tibby Rinton (Julie London) has other plans for him. Meanwhile, they all get closer to real danger and the dark secret of the red house.",
    "Director": "Delmer Daves",
    "Writer": "George Agnew Chamberlain, Delmer Daves, Albert Maltz",
    "Actors": "Edward G. Robinson, Lon McCallister, Judith Anderson",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0039768",
      "title": "Ride the Pink Horse",
      "year": 1947,
      "imdbRating": "7.2",
      "imdbVotes": "3,532",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038346",
      "title": "Behind Green Lights",
      "year": 1946,
      "imdbRating": "6.4",
      "imdbVotes": "1,068",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040798",
      "title": "Sleep, My Love",
      "year": 1948,
      "imdbRating": "6.8",
      "imdbVotes": "2,259",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040823",
      "title": "Sorry, Wrong Number",
      "year": 1948,
      "imdbRating": "7.3",
      "imdbVotes": "12,863",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040002",
      "title": "A Woman's Vengeance",
      "year": 1948,
      "imdbRating": "6.9",
      "imdbVotes": "908",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040338",
      "title": "The Fallen Idol",
      "year": 1948,
      "imdbRating": "7.6",
      "imdbVotes": "9,854",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041959",
      "title": "The Third Man",
      "year": 1949,
      "imdbRating": "8.1",
      "imdbVotes": "191,736",
      "language": "English, German, Russian, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037693",
      "title": "The Fatal Witness",
      "year": 1945,
      "imdbRating": "5.9",
      "imdbVotes": "139",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038109",
      "title": "Spellbound",
      "year": 1945,
      "imdbRating": "7.5",
      "imdbVotes": "53,812",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036886",
      "title": "Guest in the House",
      "year": 1944,
      "imdbRating": "6.2",
      "imdbVotes": "1,087",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042593",
      "title": "In a Lonely Place",
      "year": 1950,
      "imdbRating": "7.9",
      "imdbVotes": "36,803",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044013",
      "title": "The Second Woman",
      "year": 1950,
      "imdbRating": "6.3",
      "imdbVotes": "1,477",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T03:01:44.186Z"
}