{
  "movieId": "tt0044078",
  "title": "The Strange Door",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-strange.-door.-1951",
      "id": "the.-strange.-door.-1951",
      "title": "The Strange Door (1951)",
      "description": "he Strange Door is a 1951 American horror film directed by Joseph Pevney . It is based on the short story \"The Sire de Maletroit's Door\" by Robert Louis Stevenson . The film features notable performances by Charles Laughton and Boris Karloff , among others. The storyline revolves around Sire Alain de Maletroit (played by Laughton), who seeks revenge on his younger brother, Edmond (played by Paul Cavanagh ), for stealing his childhood sweetheart. Alain has imprisoned Edmond in a dungeon for 20 years and convinces Edmond's daughter, Blanche (portrayed by Sally Forrest ), that her father is dead. Alain plots to further torment Blanche by arranging a marriage with the irresponsible Denis de Beaulieu (played by Richard Stapley ).As the story unfolds, Denis discovers the dark past of the Maletroit family and attempts to escape with Blanche, while Alain's malicious plans threaten to crush them all.",
      "fileSize": 1451222300,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-strange.-door.-1951",
      "language": "eng",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 350
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "81 min",
    "imdbRating": 6.2,
    "imdbVotes": 1328,
    "Genre": "Horror, Thriller",
    "Plot": "Noble-born cad Denis (Stapley) has been tricked into a forced stay at the eerie manor of the Sire de Maletroit (Laughton), an evil madman who can't get over the death of his beloved, twenty years after she married his brother (Cavanagh) instead and subsequently passed away during childbirth. Maletroit is determined to have his revenge: the brother has been stowed away in the dungeon for two decades, while he's convinced his disreputable house guest will make a suitably hellish husband for his niece. As luck would have it, the young couple manage to fall in love, and with the help of manservant Voltan (Karloff), they try to make their escape, but not before a final confrontation with Maletroit in the dungeon's crushing deathtrap.",
    "Director": "Joseph Pevney",
    "Writer": "Jerry Sackheim, Robert Louis Stevenson",
    "Actors": "Charles Laughton, Boris Karloff, Sally Forrest",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0057569",
    "tt0038343",
    "tt0037549",
    "tt0043678",
    "tt0040829",
    "tt0044423",
    "tt0044622",
    "tt0042953",
    "tt0043087",
    "tt0041085",
    "tt0041628",
    "tt0053337"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}