{
  "imdbId": "tt0003235",
  "title": "An Old Man's Love Story",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-an-old-mans-love-story",
      "id": "silent-an-old-mans-love-story",
      "title": "An Old Man's Love Story",
      "fileSize": 1060732739,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-an-old-mans-love-story",
      "language": "English",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 598
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.1,
    "imdbVotes": 39,
    "Genre": "Short, Drama",
    "Plot": "Although their means are limited, the Marshams put on a great show of wealth, but skimp themselves in real necessaries in order to keep up appearances. Mrs. Marsham is rather a cold, hard woman, and looks to her daughter Ethel to make a rich marriage and so help out the family. Neither she nor her husband look with favor on the suit of Cyril Blythe, a young man without prospects, but with whom Ethel is very much in love. The Marshams are visited by James Graythorne, an old friend, who has made a large fortune in East India trade, and who has recently retired. He very much admires Ethel and when he asks her parents for her hand they are greatly pleased. They coerce Ethel into accepting his proposal and pack Cyril off about his business. Greythorne had no idea that Ethel was not absolutely willing, but her manner leads him to suspect that something is not right. Meeting Ethel in the woods one day sobbing over a letter from Cyril, who says he is going to America, he asks her to confide in him as a friend and tell him what is the matter. She does so, won by his gentleness, and he tells her to be of good cheer; he will help her. He feels that it would not be right for him to marry Ethel against her will and decides that, although he loves her, he will give her up in favor of the man she really loves. He goes to London and hunts up Cyril. Finding him all right, he offers, as he is without kith or kin, to adopt him as his son and heir. Then, writing to Mrs. Marsham, he says that he has come to the conclusion that ho is too old to marry her daughter and suggests that his adopted son take his place. Eager only for money, she readily consents to the new proposal. Mr. Marsham is greatly surprised when he sees Cyril, but his objections are quickly silenced by his wife, who does not care whom Ethel may marry providing it is someone with money. Greythorne sees the happiness of the young people with a smile of joy intermingled, however, with sighs of regret for his own lost youth. He finds contentment in the thought that he was able to bring happiness to the young people instead of plunging them into life-long misery and regret.",
    "Director": "Van Dyke Brooke",
    "Writer": "W.A. Tremayne",
    "Actors": "James Lackaye, Florence Radinoff, Norma Talmadge",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002784",
    "tt0002795",
    "tt0002910",
    "tt0003075",
    "tt0003497",
    "tt0003516",
    "tt0778062",
    "tt0464694",
    "tt0002816",
    "tt0470339",
    "tt0463594",
    "tt0003170"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}