{
  "imdbId": "tt0039503",
  "title": "It's a Joke, Son!",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/its-a-joke-son-1947",
      "id": "its-a-joke-son-1947",
      "title": "It's a Joke, Son! (1947)",
      "description": "Claghorn gets into some financial difficulties and is forced by a machine-political gang to enter a race for state senator against his wife (Una Merkel) who appears to have a good chance to beat the political hack backed by the machine. Claghorn is in to siphon votes and ensure his wife's opponent will win and is expected to run a campaign that will defeat himself and his wife. But, he runs to win and the machine's henchies abduct him. Watch on RetroFlix:  https://retroflix.org/its-a-joke-son-1947/",
      "fileSize": 393999970,
      "addedAt": "2026-01-07T00:08:54.188Z",
      "thumbnail": "https://archive.org/services/img/its-a-joke-son-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 54
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/its_a_joke_son",
      "id": "its_a_joke_son",
      "title": "It's A Joke, Son",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 5261346431,
      "addedAt": "2026-01-07T00:08:54.188Z",
      "thumbnail": "https://archive.org/services/img/its_a_joke_son",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 158345
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ag1t_YxFe9I",
      "id": "Ag1t_YxFe9I",
      "title": "It’s a Joke, Son! (1947) | Colorized Public Domain Southern Political Comedy with Kenny Delmar",
      "description": "It’s a Joke, Son! (1947) is an American political satire comedy directed by Benjamin Stoloff and released by Eagle-Lion Films. This restored and colorized edition revives one of the most unusual political comedies of the 1940s, inspired by the voice of Senator Claghorn, a popular Southern radio character from the Fred Allen Show. The film stands as a fascinating mix of slapstick humor, regional caricature, and postwar political satire. By presenting it in full color, Colorized Public Domain makes this forgotten film more accessible and entertaining for audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story follows Beauregard Claghorn (Kenny Delmar), a blustery, stubborn Southern gentleman obsessed with tradition and states’ rights. When his daughter Mary Lou (Una Merkel) becomes romantically involved with a young lawyer, Jeff Davis (June Lockhart), who is working with a reform candidate in a local political campaign, Claghorn finds himself reluctantly involved in politics. Despite his bumbling ways, Claghorn’s loud personality and exaggerated Southern pride win over voters, leading him into unexpected political prominence. The film’s humor derives from exaggerated regional stereotypes, satirical commentary on small-town elections, and Claghorn’s unshakable pride in being a Southerner above all else.\n\nCast and Crew:\n• Director: Benjamin Stoloff\n• Producer: Bryan Foy\n• Story: Robert Kent\n• Cinematography: Marcel Le Picard\n• Editing: Richard Heermance\nStarring:\n• Kenny Delmar as Beauregard Claghorn\n• Una Merkel as Mrs. Claghorn\n• June Lockhart as Mary Lou Claghorn\n• Kenneth Farrell as Jeff Davis\n• Jimmy Conlin as Uncle Cicero\n• Douglass Dumbrille as Northerner\n• Lew Kelly as Small-Town Politician\n\nFilm Significance:\nIt’s a Joke, Son! is unique as the only feature-length film built entirely around Kenny Delmar’s radio persona, Senator Claghorn. The character’s catchphrases, such as “That’s a joke, son!” became part of American pop culture and were later parodied in the Warner Bros. cartoon character Foghorn Leghorn. While the film was not a major commercial success, it serves as a cultural artifact that highlights postwar American humor, Southern caricature, and the early blending of radio comedy into cinema. For fans of political satire, radio history, and vintage comedy, this film offers a rare glimpse into mid-20th-century entertainment trends.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like It’s a Joke, Son! remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1947 release was in black and white, typical for its modest budget and comedic style. While historically authentic, modern viewers often pass over such films. By colorizing this comedy, we bridge the gap between cultural preservation and modern viewing habits. This edition allows audiences to experience both the humor and political satire with a fresh vibrancy that highlights its place in postwar American film history.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#ItsAJokeSon #1940sComedy #PublicDomainMovie #ColorizedClassic #ClassicCinema #PoliticalSatire #SouthernComedy #GoldenAgeHollywood #RadioComedy #FilmRestoration #CultCinemaClassic",
      "addedAt": "2025-12-24T00:48:16.615Z",
      "thumbnail": "https://i.ytimg.com/vi/Ag1t_YxFe9I/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYQiBUKGUwDw==&rs=AOn4CLB0I1__fflmf_svtPq-3w1WitOZ6w",
      "duration": 3724,
      "language": "en",
      "year": 1947,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CT2vqunJnh8",
      "id": "CT2vqunJnh8",
      "title": "It's a Joke Son (1947) JUNE LOCKHART",
      "description": "Stars: Kenny Delmar, June Lockhart, Una Merkel\nDirector: Benjamin Stoloff\n\nBigwigs want Beauregard Claghorn, a blustery Southern with no tolerence for anything north of the Mason-Dixon line, to run for state senator against his own wife! \n\nBeauregard Claghorn was a popular 1940s fictional radio show character, which inspired the creation of one of the most popular of the Warners' cartoons, Foghorn Leghorn!",
      "addedAt": "2025-12-26T23:45:43.532Z",
      "thumbnail": "https://i.ytimg.com/vi/CT2vqunJnh8/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB7gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDjOOQ01P0Ez0dH1fvO4oJh5RzvDg",
      "duration": 3776,
      "language": "en",
      "year": 1947,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dVlqCCLvdwA",
      "id": "dVlqCCLvdwA",
      "title": "It's a Joke, Son! (1947) by Benjamin Stoloff | Romantic Comedy | Colorized Movie",
      "description": "The funniest man of the year in the happiest hit in years!\nWhen the Daughters of Dixie nominate a candidate for State Senator, the local political machine run by Northerners fears its candidate will be defeated, and chooses her husband as a candidate in order to split the anti-machine vote.\n\nOriginal title: It's a Joke, Son! (1947)\nThis film is subtitled in many languages\n\nBlack & White version: version https://youtu.be/8K6ICEku5xA\n\n\nDirector: Benjamin Stoloff \nWriters: Robert E. Kent, Paul Gerard Smith\nStars: Kenny Delmar, Una Merkel, June Lockhart\nGenres: Colorized classics, Comedy, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:49 Discussion about regional differences, political satire, and family dynamics.\n06:24 A humorous interaction between characters unfolds during a visit to a food truck.\n12:42 A series of comedic misunderstandings unfold as characters navigate a mix-up involving a special delivery letter.\n19:50 Discussion on women's involvement in politics and the importance of grape juice at a social event.\n27:37 Unexpected political campaign leads to humorous chaos and misunderstandings in a Southern family.\n32:25 A comedic situation unfolds as characters navigate through a political campaign and financial dilemma.\n37:37 Political threats and negotiations unfold in a Southern election campaign.\n40:13 Political satire on election campaign, highlighting independence and self-awareness.\n48:41 Political chaos ensues as a candidate mysteriously disappears before the election.\n50:55 Chaos ensues as characters navigate a political campaign, with unexpected twists and humorous interactions.\n55:22 Eventful day unfolds as Beauregard Claghorn goes missing before crucial election, sparking chaos and search efforts.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:48.641Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/dVlqCCLvdwA/maxresdefault.webp",
      "duration": 3774,
      "language": "en",
      "year": 1947,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "63 min",
    "imdbRating": 5.9,
    "imdbVotes": 280,
    "Genre": "Comedy",
    "Plot": "The first Eagle-Lion film stars Kenny Delmar as Senator Beauregard Claghorn, his \"Allen's Alley\" resident-character heard on Fred Allen's radio program. Claghorn was a blustery, one-man-Chamber-of-Commerce for all things Southern, who had no tolerence for anything north of the Mason-Dixon line, although he made allowances for South Philly. The character inspired the creation of one of the most popular of the Warners' cartoon characters, Foghorn Leghorn, who re-worked most of the originals material and style. The title of this movie is a stock line- \"it's a joke, son\"---he would feed a befuddled Fred Allen each week. In the film, Claghorn gets into some financial difficulties and is forced by a machine-political gang to enter a race for state senator against his wife (Una Merkel) who appears to have a good chance to beat the political hack backed by the machine. Claghorn is in to siphon votes and ensure his wife's opponent will win and is expected to run a campaign that will defeat himself and his wife. But, he runs to win and the machine's henchies abduct him.",
    "Director": "Benjamin Stoloff",
    "Writer": "Robert E. Kent, Paul Gerard Smith",
    "Actors": "Kenny Delmar, Una Merkel, June Lockhart",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025619",
    "tt0025905",
    "tt0029622",
    "tt0034850",
    "tt0039645",
    "tt0039133",
    "tt0039219",
    "tt0039266",
    "tt0039370",
    "tt0039521",
    "tt0039522",
    "tt0039530"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.188Z"
}