{
  "imdbId": "tt0039515",
  "title": "Johnny O'Clock",
  "year": 1947,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gb2FC1sudHU",
      "title": "Johnny O'Clock (1947) [Film Noir] [Drama] [Crime]",
      "description": "Johnny O'Clock (Dick Powell) is a junior partner in a posh casino with Guido Marchettis (Thomas Gomez). Complicating their longtime working relationship is Guido's wife Nelle (Ellen Drew), who is still in love with former boyfriend Johnny. She gives Johnny an expensive custom pocket watch, the twin of a birthday present she gave her husband, except Johnny's has a romantic engraving on the back.\n\nJohnny gives the watch, along with a rejection note, to Harriet Hobson (Nina Foch), a hat-check girl at the casino, to return to Nelle. Harriet, however, apparently commits suicide using gas. Her sister Nancy (Evelyn Keyes) shows up to find out what happened. She becomes attracted to Johnny. They eventually learn from Police Inspector Koch (Lee J. Cobb) that Harriet was killed by poison.\n\nHarriet was dating Chuck Blayden (Jim Bannon), a crooked cop who is trying to persuade Guido to let him take Johnny's place. When Blayden also turns up dead, Koch suspects that either Johnny or Marchettis is responsible.\nThough Johnny tries to resist, little by little, he falls for Nancy. When Koch shows both Johnny and Marchettis Johnny's watch and note, Johnny tells Nancy their relationship is through and takes her to the airport. As he is driving away, however, he narrowly survives a drive-by shooting, and Nancy realizes he was only trying to protect her. She refuses to leave him.\n\nJohnny decides to flee to South America with Nancy, but not before brazenly cashing in his share of the casino. Marchettis pulls out a gun when Johnny's back is turned. They shoot it out; Marchettis is killed and Johnny wounded. Afterward, Nelle offers to testify it was self-defense, but only if he will come back to her. He refuses, so she tells Koch it was cold-blooded murder. Johnny's first instinct is to run away, but Nancy convinces him to give himself up.\n\n---\n\nDirected by Robert Rossen, produced by Edward G. Nealis and Jerry Giesler, story by Milton Holmes, screenplay by Robert Rossen, starring Dick Powell as Johnny O'Clock, Evelyn Keyes as Nancy Hobson, Lee J. Cobb as Inspector Koch, Ellen Drew as Nelle Marchettis, Nina Foch as Harriet Hobson, Thomas Gomez as Pete Marchettis, John Kellogg as Charlie (Johnny's traitorous flunky), Jim Bannon as Chuck Blayden, Mabel Paige as Slatternly Woman Tenant, Phil Brown as Phil, Hotel Clerk and Jeff Chandler as Turk.\n\n---\n\nSource: \"Johnny O'Clock\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 20 July 2013. Web. 26 August 2013. http://en.wikipedia.org/wiki/Johnny_O%27Clock.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "gb2FC1sudHU",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JohnnyOclock1947_321",
      "title": "Johnny O'Clock (1947)",
      "description": "I high class gambler gets into trouble with the Law.",
      "id": "JohnnyOclock1947_321"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/johnny-o-clock-1947",
      "title": "Johnny O'Clock (1947)",
      "description": "When an employee at an illegal gambling den dies suspiciously, her sister, Nancy, looks into the situation and falls for Johnny O'Clock, a suave partner in the underground casino. Selfish and non-committal by nature, Johnny slowly begins to return Nancy's affection and decides to run away with her, but conflict within his business threatens their plans. As Johnny tries to distance himself from the casino, his shady past comes back to haunt him. Watch on RetroFlix.org:  https://retroflix.org/johnny-oclock-1947/",
      "id": "johnny-o-clock-1947"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JohnnyOClock1947_780",
      "title": "Johnny O' Clock (1947)",
      "description": "Johnny O'Clock (1947) High-class gambler gets in trouble with the law. http://www.imdb.com/title/tt0039515/",
      "id": "JohnnyOClock1947_780"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "96 min",
    "imdbRating": "6.8",
    "imdbVotes": "2,969",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "New York gambling house operator Johnny O'Clock is junior partner in a posh casino with Guido Marchettis and Chuck Blayden, a crooked cop. But Blayden is trying to cut into the casino's profits and warns Johnny not to interfere with his intention of becoming Marchettis' full partner. Blayden ends his relationship with coat check girl Harriet Hobson, then disappears. Later, Harriet is found dead in her apartment, apparently from suicide. Police Inspector Koch begins an investigation.He questions Johnny, Harriet's sister Nancy, who is infatuated with Johnny, and Johnny's associate, Charlie. When Blayden's body turns up in a nearby river, and when it is learned that Harriet death wasn't suicide but murder by poison, Johnny and Marchettis become prime suspects in both cases.To make matters worse, Pete Marchettis discovers that his wife Nelle may be having an affair with Johnny. Out of jealousy, he sends hired gunmen to kill Johnny in a drive-by shooting while Johnny is driving Nancy to the airport. Johnny, now certain that Marchettis has betrayed him, goes to the casino to end their business partnership.",
    "Director": "Robert Rossen",
    "Writer": "Robert Rossen, Milton Holmes",
    "Actors": "Dick Powell, Evelyn Keyes, Lee J. Cobb",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0039204",
      "title": "Body and Soul",
      "year": 1947,
      "imdbRating": "7.6",
      "imdbVotes": "5,514",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041958",
      "title": "Thieves' Highway",
      "year": 1949,
      "imdbRating": "7.5",
      "imdbVotes": "7,130",
      "language": "English, Italian, Greek",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041113",
      "title": "All the King's Men",
      "year": 1949,
      "imdbRating": "7.4",
      "imdbVotes": "17,850",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039335",
      "title": "A Double Life",
      "year": 1947,
      "imdbRating": "6.9",
      "imdbVotes": "4,170",
      "language": "English, Italian, Swedish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039224",
      "title": "Brute Force",
      "year": 1947,
      "imdbRating": "7.5",
      "imdbVotes": "12,259",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039311",
      "title": "Desert Fury",
      "year": 1947,
      "imdbRating": "6.5",
      "imdbVotes": "2,289",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039482",
      "title": "I Walk Alone",
      "year": 1947,
      "imdbRating": "7.0",
      "imdbVotes": "3,652",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039536",
      "title": "Kiss of Death",
      "year": 1947,
      "imdbRating": "7.4",
      "imdbVotes": "10,143",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039217",
      "title": "The Brasher Doubloon",
      "year": 1947,
      "imdbRating": "6.5",
      "imdbVotes": "1,420",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040525",
      "title": "The Lady from Shanghai",
      "year": 1947,
      "imdbRating": "7.5",
      "imdbVotes": "35,285",
      "language": "English, Cantonese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039730",
      "title": "The Pretender",
      "year": 1947,
      "imdbRating": "6.4",
      "imdbVotes": "392",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039389",
      "title": "For You I Die",
      "year": 1947,
      "imdbRating": "6.0",
      "imdbVotes": "274",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T18:10:51.451Z"
}