{
  "movieId": "tt0036135",
  "title": "The Man in Grey",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tmig4535435111",
      "id": "tmig4535435111",
      "title": "The Man in Grey",
      "description": "Title: The Man in Grey Summary: After a brutish, hedonistic Marquis marries a pretty young Clarissa to act as a 'brood sow,' he begins an affair with her friend who plots to take her place. Directed by: Leslie Arliss Actors: Margaret Lockwood, James Mason, Phyllis Calvert Production Company: Gainsborough Pictures Release Date: 13 March 1946 (USA) Aspect Ratio: 1.37 : 1 At an estate auction in WWII England, two strangers meet and muse about their families' history and possible connections. Flashbacks reveal the story of the sweet, rich, and beautiful Clarissa Richmond and her friendship with bitter, impoverished Hesther Snow. Their fates are intertwined even as their paths diverge. Clarissa marries the handsome but cruel Marquis of Rohan while Hesther becomes an actress. Eventually, the two women meet again and Clarissa brings the scheming Hesther into her household. As Clarissa searches for true love, Hesther plots to take away everything that belongs to her.",
      "fileSize": 856489876,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/tmig4535435111",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 2668
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheManInGrey",
      "id": "TheManInGrey",
      "title": "The Man in Grey",
      "description": "“The first and the best” “He whips to glory” “High drama and escapism” “One of the greatest melodramas of all time” (IMDB reviews quotes). A superb romantic melodrama with an excellent cast which includes James Mason in one of his most villainous roles. Good period-piece production. An adaptation of the novel by Lady Eleanor Smith. A true classic. Highly recommended. IMDB rating 6.7. Directed by Leslie Arliss. Released in 1943. Complete print (original full-length UK release)",
      "fileSize": 936628264,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheManInGrey",
      "collection": "feature_films",
      "downloads": 14949
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 6.5,
    "imdbVotes": 1647,
    "Genre": "Drama, History, Romance",
    "Plot": "At an estate auction in WWII England, two strangers meet and muse about their families' history and possible connections. Flashbacks reveal the story of the sweet, rich, and beautiful Clarissa Richmond and her friendship with bitter, impoverished Hesther Shaw. Their fates are intertwined even as their paths diverge. Clarissa marries the handsome but cruel Marquis of Rohan while Hesther becomes an actress. Eventually, the two women meet again and Clarissa brings the scheming Hesther into her household. As Clarissa searches for true love, Hesther plots to take away everything that belongs to her.",
    "Director": "Leslie Arliss",
    "Writer": "Margaret Kennedy, Leslie Arliss, Doreen Montgomery",
    "Actors": "Margaret Lockwood, James Mason, Phyllis Calvert",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0035294",
    "tt0034272",
    "tt0135746",
    "tt0027727",
    "tt0035612",
    "tt0122396",
    "tt0035958",
    "tt0012532",
    "tt0014854",
    "tt0015022",
    "tt0030675",
    "tt0035931"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-11T21:36:51.542Z"
}