{
  "imdbId": "tt0012763",
  "title": "Tol'able David",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TolableDavid",
      "id": "TolableDavid",
      "title": "Tol'able David",
      "description": "Silent (no soundtrack) From the Wikipedia entry for \"Tol'able David\": \"Tol'able David is a 1921 American silent film based on the Joseph Hergesheimer short story. It was adapted to the screen by Edmund Goulding and directed by Henry King for Inspiration Pictures. A major box office success, the acclaimed film was voted a Photoplay Magazine 1921 \"medal of honor\" and is seen by critics and viewers as one of the classics of silent film. In 2007, Tol'able David was selected for preservation in the United States National Film Registry by the Library of Congress as being 'culturally, historically, or aesthetically significant'.\" Original text can be found at http://en.wikipedia.org/wiki/Tol%27able_David License terms may be found at http://creativecommons.org/licenses/by-sa/3.0/",
      "fileSize": 2083706517,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/TolableDavid",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 53766
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TolableDavid_201407",
      "id": "TolableDavid_201407",
      "title": "\"Tol'able David\" (1921) starring Richard Barthelmess",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Tol'able David\" is a rousing drama of small-town America, in which Richard Barthelmess plays one of his most memorable roles. David (Richard Barthelmess) is a young fellow, who is constantly reminded that he is not mature enough for a grown-man's job.  Then dramatic events occur and he has the opportunity to prove himself when he is pushed to the limit in circumstances, which very few \"real men\" can handle. \"Tol'able David\" was added to the National Film Registry in 2007 as being deemed \"culturally, historically, or aesthetically significant\". Directed by                      Henry King Produced by                    Inspiration Pictures Scenario by                     Edmund Goulding and Henry King Based on                         the short story “Tol’able David” by Joseph Hergesheimer Starring                           Richard Barthelmess, Gladys Hulette, Ernest Torrence, Forrest Robinson, Marion Abbott, Edmund Gurney, Warner Richmond Cinematography             Henry Cronjager Distributed by                 First National Exhibitors’ Circuit Release date                     December 31, 1921 Running time                   93 minutes Country                            United States Language                         Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 1203836750,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/TolableDavid_201407",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 2493
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-tolable-david",
      "id": "silent-tolable-david",
      "title": "Tol'able David",
      "fileSize": 1519006131,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-tolable-david",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 346
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "99 min",
    "imdbRating": 7.1,
    "imdbVotes": 1926,
    "Genre": "Drama",
    "Plot": "When three thuggish men are responsible for the death of his father and the crippling of his brother, young David must choose between supporting his family or risking his life and exacting vengeance.",
    "Director": "Henry King",
    "Writer": "Joseph Hergesheimer, Edmund Goulding, Henry King",
    "Actors": "Richard Barthelmess, Gladys Hulette, Walter P. Lewis",
    "Language": "None",
    "Country": "United States",
    "Awards": "3 wins"
  },
  "relatedMovies": [
    "tt0013590",
    "tt0010729",
    "tt0015289",
    "tt0025472",
    "tt0036377",
    "tt0037534",
    "tt0034405",
    "tt0043455",
    "tt0040281",
    "tt0029047",
    "tt0041767",
    "tt0034092"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}