{
  "movieId": "tt0042378",
  "title": "Darah dan doa",
  "year": 1950,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9Bpld0nGL2I",
      "id": "9Bpld0nGL2I",
      "title": "D.O.A. (1950) [Film Noir] [Drama]",
      "description": "The film begins with what a BBC reviewer called \"perhaps one of cinema's most innovative opening sequences.\" The scene is a long, behind-the-back tracking sequence featuring Frank Bigelow (Edmond O'Brien) walking through the hallway of a police station to report his own murder. Oddly, the police almost seem to have been expecting him and already know who he is. A flashback begins with Bigelow in his hometown of Banning, California where he is an accountant and notary public. He decides to take a one-week vacation in San Francisco, but this does not sit well with Paula Gibson (Pamela Britton), his confidential secretary and girlfriend, as he does not want her to accompany him.\n\nBigelow accompanies a group from a sales convention on a night on the town. At a \"jive\" nightclub called \"The Fisherman\", unnoticed by Bigelow, a stranger swaps his drink for another. The nightclub scene includes one of the earliest depictions of the Beat subculture. The next morning, Bigelow feels ill. He visits a doctor, where tests reveal he swallowed a \"luminous toxin\" for which there is no antidote. A second opinion confirms the grim diagnosis, and the other doctor implies that the poisoning must have been deliberate. Bigelow remembers his drink tasted strange. With a few days to live at most, Bigelow sets out to untangle the events behind his impending death, interrupted occasionally by phone calls from Paula. She provides the first clue: a man named Eugene Philips had tried to contact him, but died the previous day, purportedly a suicide. Bigelow travels to Philips' import-export company in Los Angeles, first meeting Miss Foster (Beverly Garland) (whose on-screen credit reads \"Beverly Campbell\"), the secretary, then Mr Halliday (William Ching), the company's comptroller, who tells him Eugene Philips committed suicide. From there the trail leads to Philips' widow (Lynn Baggett) and brother Stanley (Henry Hart).\n\nThe key to the mystery is a bill of sale for what turns out to be stolen iridium. Bigelow had notarized the document for Eugene Philips six months earlier. He connects Philips' mistress, Marla Rakubian (Laurette Luez), to gangsters led by Majak (Luther Adler). They capture Bigelow. Since Bigelow has learned too much, Majak orders his psychotic henchman Chester (Neville Brand) to kill him. However, Bigelow manages to escape. Bigelow thinks Stanley and Miss Foster are his killers but when he confronts them, he finds Stanley has been poisoned too - after having dinner with Mrs. Philips. He tells them to call an ambulance and what poison has been ingested so that, in Stanley's case at least, prompt treatment may save his life. Stanley tells Bigelow he found evidence that Halliday and Mrs. Philips were having an affair. Bigelow realizes that the theft was merely a diversion. Eugene discovered the affair and Halliday killed him.\n\nHalliday and Mrs. Philips used the investigation of the iridium as a cover for their crime, making it seem that Eugene Philips had killed himself out of shame. However, when they discovered that there was evidence of his innocence in the notarized bill of sale, Halliday murdered anyone who had knowledge of the bill of sale. Bigelow tracks Halliday down and shoots him to death in an exchange of gunfire. The flashback comes to an end. Bigelow finishes telling his story at the police station and dies, his last word being \"Paula.\" The police detective taking down the report instructs that his file be marked \"D.O.A.\"\n\n---\n\nDirected by Rudolph Maté, produced by Leo C. Popkin, written by Russell Rouse and Clarence Greene, starring Edmond O'Brien as Frank Bigelow, Pamela Britton as Paula Gibson, Luther Adler as Majak, Lynn Baggett as Mrs. Philips, William Ching as Halliday, Henry Hart as Stanley Philips, Beverly Garland as Miss Foster, Neville Brand as Chester, Laurette Luez as Marla Rakubian and Virginia Lee as Jeannie.\n\n---\n\nSource: \"D.O.A. (1950 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 9 March 2013. Web. 11 March 2013. http://en.wikipedia.org/wiki/D.O.A._(1950_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:45.356Z",
      "thumbnail": "https://i.ytimg.com/vi/9Bpld0nGL2I/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBW9zNd9Fx6r37yav7vvAux0uyVZA",
      "duration": 4990,
      "language": "en",
      "year": 1950,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yI1dIRAUuw4",
      "id": "yI1dIRAUuw4",
      "title": "D.O.A. (1950) FILM NOIR",
      "description": "Movie Class by PizzaFLIX: a classic of the Film Noir genre, D.O.A.(1950) was directed by Rudolph Maté (1898-1964) and shot by Ernest Laszlo (1998-1984). Both were Austro-Hungarian born filmmakers, who found recognition and acclaim in Hollywood, U.S.A.\n\nStars: Edmond O'Brien, Pamela Britton, Luther Adler, Neville Brand\nDirector: Rudolph Maté\n\nIn this ultra-noir masterpiece, a vacationing accountant desperately retraces the last 24 hours of his life to solve his own murder from a deadly slow-acting poison!",
      "addedAt": "2025-12-26T23:43:22.017Z",
      "thumbnail": "https://i.ytimg.com/vi/yI1dIRAUuw4/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLCQhPszM4tTetxxrmA7qCziuOFHOQ",
      "duration": 5021,
      "language": "en",
      "year": 1950,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "150 min",
    "imdbRating": 6.7,
    "imdbVotes": 46,
    "Genre": "Drama, War",
    "Plot": "It tells the story of an Indonesian revolutionary who falls in love with one of his Dutch prisoners.",
    "Director": "Usmar Ismail",
    "Writer": "Usmar Ismail, Sitor Situmorang",
    "Actors": "Ella Bergen, Faridah, R.D. Ismail",
    "Language": "Indonesian",
    "Country": "Indonesia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0042249",
    "tt0043041",
    "tt0042195",
    "tt0043147",
    "tt0306057",
    "tt0043590",
    "tt0041481",
    "tt0043547",
    "tt0043887",
    "tt0044085",
    "tt0044106",
    "tt0041996"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:29:02.226Z"
}