{
  "imdbId": "tt0019195",
  "title": "The Mysterious Lady",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-mysterious-lady-1928",
      "id": "the-mysterious-lady-1928",
      "title": "The Mysterious Lady (1928)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. Greta Garbo vehicle The Mysterious Lady was a massive hit on release, with even an exorbitant budget being recovered and then some. Modern reviews find a lot to enjoy from the film outside of Garbo's performance as well. In the picture, Garbo plays a spy who must choose between her new romance or her country, with drama and conflict arising constantly.",
      "fileSize": 2008550444,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-mysterious-lady-1928",
      "language": "eng",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 101
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "96 min",
    "imdbRating": 7.2,
    "imdbVotes": 1480,
    "Genre": "Drama, Romance",
    "Plot": "In Vienna, in the beginning of the Twentieth Century, Captain Karl von Raden and his partner Captain Max Heinrich learn in the box office that the ticket for the opera is sold-out. Out of the blue, a man returns his ticket and Karl buys it and shares a box with a gorgeous woman that is waiting for her cousin. Karl gives a ride home to the lady and they spend the night together. On the next day, they spend a wonderful day in the countryside together. Karl is assigned to travel to Berlin by train to deliver secret plans to the German government. His uncle, Colonel Eric von Raden, who is the chief of the Austrian secret service, advises Karl the woman with whom he had spent the previous day is the notorious Russian spy Tania Fedorova. While in the train, Tania meets Karl to tell that she is in love with him, but he rejects her telling that he knows who she is. On the next morning, Karl wakes up and finds that the plans have been stolen and he receives a message from Tania telling that she came as a woman in love with him and left as his enemy. Karl is expelled and imprisoned by the army as traitor but his uncle offers him the chance to clean his name, traveling to Warsaw to find who the traitor is. Karl poses as pianist and meets Tania and her lover, the powerful General Boris Alexandroff. What will Karl and Tania do?",
    "Director": "Fred Niblo",
    "Writer": "Ludwig Wolff, Bess Meredyth, Marian Ainslee",
    "Actors": "Greta Garbo, Conrad Nagel, Gustav von Seyffertitz",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0021659",
    "tt0020062",
    "tt0018836",
    "tt0018297",
    "tt0019754",
    "tt0020410",
    "tt0020589",
    "tt0018972",
    "tt0019067",
    "tt0018618",
    "tt0018862",
    "tt0018846"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}