{
  "movieId": "tt0001840",
  "title": "The Primal Call",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThePrimalCall",
      "id": "ThePrimalCall",
      "title": "\"The Primal Call\" (1911) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Primal Call\" is a short drama. This film illustrates the work of cinematographer Billy Bitzer and Florence La Badie, stars of Silent Hall of Fame. A woman engaged to a wealthy society man, whom she does not love, unexpectedly meets and falls hard for a tough sailor. Directed by                          D.W. Griffith Produced by                        Biograph Company Cinematography                G.W. Bitzer Starring                               Claire McDowell, Wilfred Lucas, Joseph Graybill, Florence La Badie Distributed by                     The General Film Company Release date                        June 22, 1911 Running time                      13 min. Country                               United States Language                             Silent, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 8439874,
      "addedAt": "2026-01-07T00:07:05.035Z",
      "thumbnail": "https://archive.org/services/img/ThePrimalCall",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 1239
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5,
    "imdbVotes": 39,
    "Genre": "Romance, Short",
    "Plot": "A society mother, whose creditors are becoming insistent, and wishing to keep up her ostentation, sees relief in her daughter marrying a low-charactered, pusillanimous millionaire. Hence, she persuades her daughter to accept his proposal, arguing that they must have money. The girl goes to the seashore to rest before the wedding, and there meets the mate of a tramp schooner anchored in the bay. This man appeals to her as being so different from others, a primal type of man. She indulges in that dangerous pastime of flirting with this sincere fellow and when her fiancée visits her, the seaman realizes he has been made the dupe, so he seizes the girl and is carrying her off by force. However, he suddenly reasons that she isn't worth it and recoils from her, but she now realizes that she truly loves him and begs him to take her away, so grabbing her up in one arm, and a minister who is passing by, in the other, he hustles aboard his boat, where the marriage is performed.",
    "Director": "D.W. Griffith",
    "Writer": "Emmett C. Hall",
    "Actors": "Wilfred Lucas, Claire McDowell, Grace Henderson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001598",
    "tt0001459",
    "tt0002512",
    "tt0001978",
    "tt0001740",
    "tt0001987",
    "tt0001913",
    "tt0001680",
    "tt0001681",
    "tt0002497",
    "tt0002282",
    "tt0002302"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.035Z"
}