{
  "movieId": "tt0004499",
  "title": "The Property Man",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-property-man",
      "id": "silent-the-property-man",
      "title": "The Property Man",
      "fileSize": 359334589,
      "addedAt": "2026-01-07T00:11:24.923Z",
      "thumbnail": "https://archive.org/services/img/silent-the-property-man",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 554
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-property-man-1914-directed-by-charlie-chaplin",
      "id": "the-property-man-1914-directed-by-charlie-chaplin",
      "title": "The Property Man (1914) Directed By Charlie Chaplin",
      "description": "The Property Man Theatrical poster Directed by Charlie Chaplin Produced by Mack Sennett Starring Charlie Chaplin Phyllis Allen Alice Davenport Charles Bennett Mack Sennett Norma Nichols Joe Bordeaux Harry McCoy Lee Morris Cinematography Frank D. Williams Production company Keystone Studios Distributed by Mutual Film Release date August 1, 1914 Running time 31 minutes Country United States Languages Silent film English (Original titles) The Property Man is a short 1914 American comedy silent film made by Keystone Studios starring Charlie Chaplin . Plot Charlie is in charge of stage props at a vaudeville theater. These are the performances for tonight: The Goo-Goo Sisters: two young women dancing Garlico in “Feets of Strength”: a strong-man (Garlico) aided by his bride \"Sorrow\": a drama performed by a man and a woman. The woman from “Sorrow” decides to take the star’s dressing room, which Garlico has claimed by drawing his caricature on the wall. When his bride appears, an argument begins over who gets the room. The dressing-room issue is resolved when Garlico knocks out the man from “Sorrow” and gets the room for himself. Next, Charlie has to move Garlico’s trunk, but he falls onto the ground due to the heavy weight. When he gets up, he starts chatting happily with the Goo-Goo Sisters. Garlico finds him idling and makes him go back to work. Charlie makes his old colleague lift the trunk, causing the latter to fall onto the ground with the trunk on top of him. While Charlie is trying to lift it off, Garlico’s bride summons Charlie and they start flirting. Garlico finds out and angrily throws Charlie back onto the old man. Eventually Charlie calls for help in lifting the trunk, which Garlico easily lifts off. Back in the dressing room, Garlico makes his bride ask Charlie to sew up his tights. Meanwhile, the matinee begins. During the Goo-Goo Sisters’ performance, the old man and Charlie start fighting, which is interrupted when Garlico’s bride asks Charlie for the tights. Realising he has forgotten about them, Charlie tries to postpone Garlico’s performance, but the confused old man asks Garlico to come over to the stage and pulls up the backdrop, thus revealing a sight of him without his tights. The audience burst into laughter, but Garlico begins his performance anyway. In the wings, Charlie and his old colleague fight and the latter accidentally knocks out Garlico’s bride, prompting Charlie to step in as Garlico’s assistant. Proving to be an unhelpful assistant, he goes backstage while Garlico continues to flop on stage. Garlico’s performance is disrupted when the old man suddenly pulls down the backdrop for “Sorrow”. Frustrated, he leaves the stage and throws a tantrum. He starts attacking Charlie, who then kicks him in the rear. When “Sorrow” begins, a member of the audience (portrayed by Mack Sennett ) boos and leaves, while Charlie and Garlico’s fight disrupts the onstage performance. Eventually Charlie pulls out a hose and squirts water over everyone. Reviews A reviewer from Bioscope wrote, \"There are so many uproariously absurd situations in this Chaplin comic, all consequent upon the ardent desire of our friend 'Props' to run the whole of the affairs 'behind' that the vaudeville entertainment becomes one long chapter of unrehearsed happenings, much to the delight of an audience of which comical Mack Sennett forms a distinguished member.\" [ This quote needs a citation ] A negative review of The Property Man came from Moving Picture World regarding some of the slapstick action in the two reels. The reviewer opined, \"There are very few people who don't like these Keystones. They are thoroughly vulgar and touch the homely strings of our own vulgarity. They are not the best pictures for parlor entertainment, that is true. There is some brutality in this picture and we can't help feeling that this is reprehensible. What human being can see an old man kicked in the face and count it fun?\" [ 1 ] Cast Charlie Chaplin - The Property Man Phyllis Allen - Lena Fat Alice Davenport - Actress Charles Bennett - George Ham, Lena's husband Mack Sennett - Man in audience Norma Nichols - Vaudeville artist Joe Bordeaux - Old actor Harry McCoy - Drunk in audience Lee Morris - Man in audience References 1 Cresswell, Tim (2004). The Tramp in America . Reaktion Books. ISBN   978-1-86189-568-4 . From Wikipedia, the free encyclopedia",
      "fileSize": 170949792,
      "addedAt": "2026-01-07T00:12:22.157Z",
      "thumbnail": "https://archive.org/services/img/the-property-man-1914-directed-by-charlie-chaplin",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 209
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "28 min",
    "imdbRating": 5.6,
    "imdbVotes": 980,
    "Genre": "Comedy, Short",
    "Plot": "Charlie has trouble with actors' luggage and conflicts over who gets the star's dressing room. There are further difficulties with frequent scene changes, wrong entries and a fireman's hose. At one point he juggles an athlete's supposed weights. The humor is still rough: he kicks an older assistant in the face and allows him to be run over by a truck.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Phyllis Allen, Charles Bennett",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0004546",
    "tt0004011",
    "tt0004518",
    "tt0005812",
    "tt0003923",
    "tt0004311",
    "tt0003863",
    "tt0004108",
    "tt0004102",
    "tt0004101",
    "tt0003760",
    "tt0004007"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.157Z"
}