{
  "movieId": "tt0036855",
  "title": "Gaslight",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Gaslight_628",
      "id": "Gaslight_628",
      "title": "Gaslight",
      "description": "Title: Gaslight Summary: Years after her aunt was murdered in her home, a young woman moves back into the house with her new husband. However, he has a secret that he will do anything to protect, even if it means driving his wife insane. Directed by: George Cukor Actors: Charles Boyer, Ingrid Bergman, Joseph Cotten Production Company: Metro-Goldwyn-Mayer (MGM) Release Date: 30 October 1944 (Sweden) Aspect Ratio: 1.37 : 1 After the death of her famous opera-singing aunt, Paula is sent to study in Italy to become a great opera singer as well. While there, she falls in love with the charming Gregory Anton. The two return to London, and Paula begins to notice strange goings-on: missing pictures, strange footsteps in the night and gaslights that dim without being touched. As she fights to retain her sanity, her new husband's intentions come into question.",
      "fileSize": 743660732,
      "addedAt": "2026-01-07T00:06:25.399Z",
      "thumbnail": "https://archive.org/services/img/Gaslight_628",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 83601
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "114 min",
    "imdbRating": 7.8,
    "imdbVotes": 36259,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "After the death of her famous opera-singing aunt, Paula Alquist (Ingrid Bergman) is sent to study in Italy to become a great opera singer as well. While there, she falls in love with the charming Gregory Anton (Charles Boyer). The two return to London, and Paula begins to notice strange goings-on: missing pictures, strange footsteps in the night, and gaslights that dim without being touched. As she fights to retain her sanity, her new husband's intentions come into question.",
    "Director": "George Cukor",
    "Writer": "John Van Druten, Walter Reisch, John L. Balderston",
    "Actors": "Charles Boyer, Ingrid Bergman, Joseph Cotten",
    "Language": "English, Italian",
    "Country": "United States",
    "Awards": "Won 2 Oscars. 10 wins & 7 nominations total"
  },
  "relatedMovies": [
    "tt0037007",
    "tt0039335",
    "tt0037515",
    "tt0038494",
    "tt0035694",
    "tt0035448",
    "tt0038452",
    "tt0043782",
    "tt0033595",
    "tt0033469",
    "tt0033758",
    "tt0033966"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1940s",
      "name": "1940s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}