{
  "imdbId": "tt0045888",
  "title": "House of Wax",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house-of-wax-1953_202510",
      "id": "house-of-wax-1953_202510",
      "title": "House of Wax (1953)",
      "description": "House of Wax is a 1953 American mystery-horror film directed by Andre de Toth and  stars Vincent Price. The film follows  Professor Henry Jarrod, a talented sculptor whose wax museum is destroyed by his business partner, Matthew Burke, who sets it on fire for insurance money. Surviving the blaze with severe injuries, Jarrod creates a new museum featuring lifelike wax figures, but he secretly uses the bodies of his murder victims, leading to a series of gruesome events as a young woman uncovers the horrifying truth.",
      "fileSize": 787735544,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/house-of-wax-1953_202510",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 344
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "88 min",
    "imdbRating": 7,
    "imdbVotes": 21903,
    "Genre": "Horror",
    "Plot": "Professor Henry Jarrod is a true artist whose wax sculptures are lifelike. He specializes in historical tableau's such a Marie Antoinette or Joan of Arc. His business partner, Matthew Burke, needs some of his investment returned to him and pushes Jarrod to have more lurid exposes like a chamber of horrors. When Jarrod refuses, Burke set the place alight destroying all of his beautiful work in the hope of claiming the insurance. Jarrod is believed to have died in the fire but he unexpectedly reappears some 18 months later when he opens a new exhibit. This time, his displays focus on the macabre but he has yet to reproduce his most cherished work, Marie Antoinette. When he meets his new assistant's beautiful friend, Sue Allen, he knows he's found the perfect model - only unbeknown to anyone, he has a very particular way of making his wax creations.",
    "Director": "André De Toth",
    "Writer": "Crane Wilbur, Charles Belden",
    "Actors": "Vincent Price, Frank Lovejoy, Phyllis Kirk",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 3 nominations total"
  },
  "relatedMovies": [
    "tt0047200",
    "tt0045184",
    "tt0048204",
    "tt0046066",
    "tt0046186",
    "tt0045826",
    "tt0045920",
    "tt0045546",
    "tt0047149",
    "tt0044925",
    "tt0044406",
    "tt0046907"
  ],
  "collections": [
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.614Z"
}