{
  "imdbId": "tt0005810",
  "title": "A Night Out",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ANightOut_201406",
      "id": "ANightOut_201406",
      "title": "Charlie Chaplin's \"A Night Out\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"A Night Out\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame.  This is the film, in which Edna Purviance made her debut as a leading lady for Charlie Chaplin. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin           Starring                     Charlie Chaplin, Edna Purviance, Ben Turpin, Bud Jamison, Leo White Cinematography        Harry Ensign Distributed by           General Film Company Release date               February 15, 1915 Running time             34 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 438208827,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/ANightOut_201406",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 14822
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-night-out-1915",
      "id": "a-night-out-1915",
      "title": "A Night Out (1915)",
      "description": "A Night Out is a 1915 Charlie Chaplin comedy short. It was Chaplin’s first film with Edna Purviance, who would continue as his leading lady for the following eight years. It was also Chaplin’s first film with Essanay Film Company in Niles, California. Chaplin’s first Essanay film, His New Job, was made in the Chicago studio, after which he moved to Niles Studios. He found Purviance in San Francisco when he was searching for a leading lady for his films. A Night Out also stars Ben Turpin, Leo White and Bud Jamison. Watch on RetroFlix.org:  https://retroflix.org/a-night-out-1915/",
      "fileSize": 162197503,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-night-out-1915",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 193
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-night-out-1915-directed-by-charlie-chaplin",
      "id": "a-night-out-1915-directed-by-charlie-chaplin",
      "title": "A Night Out (1915) Directed By Charlie Chaplin",
      "description": "A Night Out French theatrical poster to A Night Out Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Ben Turpin Bud Jamison Edna Purviance Leo White Cinematography Harry Ensign Edited by Charlie Chaplin Distributed by Essanay Studios General Film Company Release date February 15, 1915 Running time 33 minutes Country United States Languages Silent film English (original intertitles) A Night Out is a 1915 Charlie Chaplin comedy short. It was Chaplin's first film with Edna Purviance , who would continue as his leading lady for the following eight years. It was also Chaplin's first film with Essanay Film Company in Niles, California . Chaplin's first Essanay film, His New Job , was made in the Chicago studio, after which he moved to Niles Studios. He found Purviance in San Francisco when he was searching for a leading lady for his films. A Night Out also stars Ben Turpin , Leo White and Bud Jamison . Cast Charlie Chaplin - Reveller Ben Turpin - Fellow Reveller Bud Jamison - Headwaiter Edna Purviance - Headwaiter's Wife Leo White - 'French' Dandy/Desk clerk Fred Goodwins - Old clerk at the hotel Production Some exterior scenes take place in front of still-existing buildings in Oakland, such as the Peralta Apartments on 13th Street, the Sierra Apartments on Alice Street, and the Hotel Oakland on Harrison Street. [ 1 ] References 1 Davis, Ann Leslie (1 January 2014). \"The Birth of Charlie Chaplin's Little Tramp\" . The Monthly .com . Retrieved 17 July 2024 .",
      "fileSize": 927872368,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-night-out-1915-directed-by-charlie-chaplin",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 209
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-night-out",
      "id": "silent-a-night-out",
      "title": "A Night Out",
      "fileSize": 1664579921,
      "addedAt": "2026-01-07T00:10:50.367Z",
      "thumbnail": "https://archive.org/services/img/silent-a-night-out",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 591
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "34 min",
    "imdbRating": 5.9,
    "imdbVotes": 1915,
    "Genre": "Comedy, Short",
    "Plot": "Charlie and Ben pay a visit to a pub, then decide to visit a swanky restaurant. Now intoxicated, they come into conflict with a French dandy and his ladyfriend. The large head waiter violently ejects Ben, and later ejects Charlie also. The pair pay another visit to a pub, then make their way to their hotel. They become interested in a pretty young woman staying in the room across the hall, but when Charlie spies on her through the keyhole a bellboy makes him stop. Charlie is taken aback to realize that the young woman's husband is the head waiter from the restaurant. He promptly checks out and moves to another hotel. Meanwhile, the head waiter and his wife, dissatisfied with the service, also decide to move to another hotel-- and, unfortunately, choose the same one Charlie has chosen, and once more wind up in the room across the hall from him. When the young woman's dog runs into Charlie's room she follows in her pajamas. Her husband returns to find his wife with Charlie in an apparently compromising position.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Ben Turpin, Charles Allen Dealey",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005812",
    "tt0004936",
    "tt0005571",
    "tt0006309",
    "tt0005044",
    "tt0005489",
    "tt0005542",
    "tt0006313",
    "tt0005074",
    "tt0006177",
    "tt0006032",
    "tt0006414"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}