{
  "imdbId": "tt0008401",
  "title": "Over the Fence",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/over-the-fence-1917-directed-by-j.-farrell-mac-donald-harold-lloyd",
      "id": "over-the-fence-1917-directed-by-j.-farrell-mac-donald-harold-lloyd",
      "title": "Over The Fence (1917) Directed By J. Farrell Mac Donald, Harold Lloyd",
      "description": "Over the Fence Directed by Harold Lloyd J. Farrell MacDonald Produced by Hal Roach Starring Harold Lloyd Release date September 9, 1917 Country United States Language Silent with English intertitles Over the Fence is a 1917 American short comedy film directed by and starring Harold Lloyd . The film is notable as the debut of Lloyd's \"Glasses\" or \"Boy\" character. Prints of the film survive at the film archive of the Museum of Modern Art . [ 1 ] Plot Ginger, a tailor, finds two tickets to a baseball game in the pocket of a customer's garment. He calls his girlfriend to tell her to meet him at the ballpark. Ginger is unaware that a fellow tailor, Snitch, sneakily lifted the tickets from his pocket. When Ginger and his girl arrive at the ballpark for the game, Ginger realizes the tickets are gone. He has no money, so his attempt to buy tickets proves fruitless. Snitch sees Ginger's girl and takes her into the ballpark with him using the tickets he stole. Ginger manages to enter the ballpark using the players' entrance where he is mistaken for the home team's new \"fuzzball\" pitcher. He stars in the game and is on his way to completing a game-winning home run when he sees his girl with Snitch in field-level seats. A major fight breaks out that involves members of both teams. Cast Harold Lloyd as Ginger, a tailor Snub Pollard as Snitch, another Bud Jamison as The Boss Bebe Daniels as Ginger's girl J. Darcie 'Foxy' Lloyd as Umpire (as James Darsie Lloyd) Sammy Brooks Margaret Joslin (as Margaret Joslin Todd) Gus Leonard as Gus Fred C. Newmeyer Dorothea Wolbert References 1 \"Progressive Silent Film List: Over the Fence\" . Silent Era . Retrieved January 9, 2010 . From Wikipedia, the free encyclopedia",
      "fileSize": 91867092,
      "addedAt": "2026-01-07T00:10:12.694Z",
      "thumbnail": "https://archive.org/services/img/over-the-fence-1917-directed-by-j.-farrell-mac-donald-harold-lloyd",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 55
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-over-the-fence",
      "id": "silent-over-the-fence",
      "title": "Over the Fence",
      "fileSize": 323241194,
      "addedAt": "2026-01-07T00:11:07.410Z",
      "thumbnail": "https://archive.org/services/img/silent-over-the-fence",
      "language": "English",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 765
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "5 min",
    "imdbRating": 5.7,
    "imdbVotes": 244,
    "Genre": "Short, Comedy, Sport",
    "Plot": "Snitch steals Ginger's baseball tickets and takes Ginger's girl to the game. Finding himself without tickets, Ginger dresses as a baseball player and wins the game.",
    "Director": "Harold Lloyd, J. Farrell MacDonald",
    "Writer": "N/A",
    "Actors": "Harold Lloyd, Bebe Daniels, 'Snub' Pollard",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0007709",
    "tt0007764",
    "tt0007809",
    "tt0007686",
    "tt0008331",
    "tt0008432",
    "tt0008493",
    "tt0008884",
    "tt0007956",
    "tt0008844",
    "tt0009099",
    "tt0009071"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.410Z"
}