{
  "movieId": "tt0026727",
  "title": "Monte Criollo",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/monte-criollo-1935",
      "id": "monte-criollo-1935",
      "title": "Monte Criollo(1935)",
      "description": "Monte criollo  es una película  argentina  en blanco y negro de género dramático y policial dirigida y guionada por  Arturo S. Mom  que se estrenó el 22 de mayo de 1935 y tiene como principales protagonistas a  Nedda Francy ,  Francisco Petrone ,  Florindo Ferrario ,  Domingo Sapelli  y  Marcelo Ruggero . Esta ópera prima del director, se refiere a la relación entre una mujer y dos hombres, dueños de una casa de baile y juego clandestino, y al conflicto que le pone fin. El nombre de la película alude al juego de  monte , original de  España  y muy popular hasta mediados del siglo  xx  en los lugares de Argentina donde se practicaba el juego clandestino. Una segunda versión de su argumento original la dirigió en 1946 con el nombre de  Vidas marcadas  el director  Daniel Tinayre , quien justamente había actuado como asesor técnico en la película de Mom (Wikipedia) Sinopsis Lucy, la protagonista femenina encarnada por Nedda Francy, es una mujer de turbio pasado que convence Argüello y Carlos –representados por Francisco Petrone y Florindo Ferrario para que instalen un salón de juego ilegal sobre un cabaret que funcionaba legalmente. Cuando Argüello se interesa románticamente en ella, lo rechaza pues está atraída por Carlos, un cantor mujeriego. La obsesión por ella lleva a Argüello a hacer trampa en la partida de juego que sostiene con Carlos y consigue arruinarlo, pero finalmente ambos pelean y Argüello muere apuñalado pero sin denunciar a su agresor para recobrar así su autoestima como jugador profesional Reparto Nedda Francy  …Lucy Francisco Petrone …Argüello Florindo Ferrario …Carlos Domingo Sapelli …Mendieta Marcelo Ruggero …Cañita Oscar Villa Olga Mom  …Lolita Azucena Maizani …Ella misma Héctor Fioriti Marino Seré  …Policía Juan Siches de Alarcón Agustín Magaldi Pedro Noda Miguel Mileo Carlos Fioriti",
      "fileSize": 1116461290,
      "addedAt": "2026-01-07T00:09:54.330Z",
      "thumbnail": "https://archive.org/services/img/monte-criollo-1935",
      "language": "spa",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 130
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "60 min",
    "imdbVotes": 6,
    "Genre": "N/A",
    "Plot": "Lucy is a woman of shady past who convinces Argüello and Carlos to install an illegal gambling hall on a cabaret that worked legally. When Argüello is interested romantically in her, it rejects it because it is attracted by Carlos, a womanizer singer. The obsession for her leads Argüello to cheat in the game that he holds with Carlos and manages to ruin him, but finally both fight and Argüello dies stabbed but without denouncing his aggressor to recover his self-esteem as a professional player.",
    "Director": "Arturo S. Mom",
    "Writer": "Arturo S. Mom",
    "Actors": "Nedda Francy, Francisco Petrone, Florindo Ferrario",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0304516",
    "tt0192663",
    "tt0191855",
    "tt0228081",
    "tt0026440",
    "tt0252021",
    "tt0027179",
    "tt0027195",
    "tt0237484",
    "tt0026587",
    "tt0026589",
    "tt0026626"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.330Z"
}