{
  "imdbId": "tt0021785",
  "title": "Daughter of the Dragon",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/daughter-of-the-dragon_202112",
      "id": "daughter-of-the-dragon_202112",
      "title": "Daughter Of The Dragon (1931)",
      "description": "Anna May Wong, Sessue Hayawaka, Warner Oland",
      "fileSize": 1342537560,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/daughter-of-the-dragon_202112",
      "collection": "feature_films",
      "downloads": 2573
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/daughter-of-the-dragon_202502",
      "id": "daughter-of-the-dragon_202502",
      "title": "Daughter Of The Dragon ★★★½ CC: pre-Code Crime/Mystery [1:10:18] Warner Oland",
      "description": "Somewhat of a dark print in spots, but still very watchable. Daughter of the Dragon is a 1931 American pre-Code crime mystery film directed by Lloyd Corrigan, and starring Anna May Wong as Princess Ling Moy, Sessue Hayakawa as Ah Kee, and Warner Oland as Dr. Fu Manchu (for his third and final feature appearance in the role. Plot: The film is set in London. Fu Manchu (Warner Oland) is thought to have died 20 years ago, wrongly believing that Sir John Petrie (Holmes Herbert) was responsible for the death of his family during the Boxer Rebellion. He swore revenge on Sir John and his family. Princess Ling Moy, a young and beautiful Chinese aristocrat lives next door, unbeknownst to her, to Dr. Fu Manchu, a brilliant but twisted genius who is out to rule the world. She is involved with Ah Kee, a handsome young man, who also unbeknownst to her, is a secret agent out to thwart the heinous plots of Fu Manchu. As it turns out, Fu is not only her next-door neighbor, he is also, (unbeknownst to her), her father. When she finds out, will she take her father's part and fight the men out to get him, or will she become a brave heroine and save the world even if it is from the devious doings of her own father? The movie moves along at a decent pace, and has a lot of action, Anna May Wong and Sessue Hayakawa were both fine actors that did a very nice job in their roles. Warner Oland's character adds to a well acted, well written and well produced movie that is definitely worth a watch. ",
      "fileSize": 1407854866,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/daughter-of-the-dragon_202502",
      "language": "eng",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 961
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "70 min",
    "imdbRating": 5.6,
    "imdbVotes": 866,
    "Genre": "Crime, Drama",
    "Plot": "Princess Ling Moy, a young and beautiful Chinese aristocrat lives next door, unbeknownst to her, to Dr. Fu Manchu, a brilliant but twisted genius who is out to rule the world. She is involved with Ah Kee, a handsome young man, who also unbeknownst to her, is a secret agent out to thwart the heinous plots of Fu Manchu. As it turns out, Fu is not only her next-door neighbor, he is also, (unbeknownst to her), her father. When she finds out, will she take her father's part and fight the men out to get Fu, or will she become a brave heroine and save the world even if it is from the devious doings of her own Dad? Yes, it's dated, and there isn't nearly enough of Warner Oland in it; but it moves along well, has a lot of action, Wong and Hayakawa were fine actors, and if you're a Charley Chan fan, it's worth it to how much, if any, of Fu Oland used when creating Charley Chan.",
    "Director": "Lloyd Corrigan",
    "Writer": "Lloyd Corrigan, Monte M. Katterjohn, Sax Rohmer",
    "Actors": "Anna May Wong, Warner Oland, Sessue Hayakawa",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021820",
    "tt0021659",
    "tt0020810",
    "tt0019765",
    "tt0023790",
    "tt0022836",
    "tt0021770",
    "tt0022206",
    "tt0022418",
    "tt0022469",
    "tt0021890",
    "tt0021743"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:14:48.211Z"
}