{
  "movieId": "tt0033141",
  "title": "Texas Renegades",
  "year": 1940,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RGMLP1dmcdY",
      "id": "RGMLP1dmcdY",
      "title": "Texas Renegades (1940) TIM McCOY🍕 COWBOY WESTERN",
      "description": "Stars: Tim McCoy, Nora Lane, Kenneth Duncan\nDirector: Sam Newfield\n\nWhen rustlers threaten the lawless town of Rawhide, Marshal Tim Smith (Tim McCoy) is sent to bring order. But when the gang tries to eliminate the Marshal, they kill the wrong man. Thinking fast, Tim switches identities and infiltrates the gang, posing as an outlaw, now impersonating himself! This thrilling twist delivers nonstop cowboy action, gun-slinging showdowns, and old-school Western grit.\n\nFans of Tim McCoy Westerns, vintage 1940s cowboy films, and rare public domain Westerns will love this digitally restored version of Texas Renegades. This is a must-watch for lovers of classic Western movies, Golden Age cinema, and fans of Sam Newfield’s iconic direction. Presented by PizzaFLIX, your destination for full-length, hard-to-find classic movies.\n\nFrom Sigmund Neufeld Productions and distributed by Producers Releasing Corp., this gem captures the essence of 1940s Westerns, blending mistaken identity, outlaw deception, and frontier justice!\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPerfect for fans of Tim McCoy classics, Western outlaws, and PizzaFLIX, Texas Renegade is a must-watch for anyone who loves timeless cowboy adventures and tales of justice in the Old West. Don’t miss this thrilling ride!\n\n#TimMcCoy #CowboyWestern #TexasRenegades #NoraLane #KennethDuncan #SamNewfield #PizzaFLIX #FullWesternMovie #ClassicWestern #1940sMovies",
      "addedAt": "2025-12-24T01:04:22.055Z",
      "thumbnail": "https://i.ytimg.com/vi/RGMLP1dmcdY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA4bgTuOGtiSdu5V7Q9lqToZfk3KA",
      "duration": 3461,
      "language": "en",
      "year": 1940,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "59 min",
    "imdbRating": 5.4,
    "imdbVotes": 16,
    "Genre": "Western",
    "Plot": "Marshal Tim Smith is sent to Rawhide to battle rustlers. When the outlaw gang attempts to kill the new Marshal, they get the wrong man. Tim puts his identification on the dead man and poses as a known outlaw. This gets him into the gang where he is given the job of posing as the new Marshal.",
    "Director": "Sam Newfield",
    "Writer": "Joseph O'Donnell, Robert Emmett Tansey",
    "Actors": "Tim McCoy, Nora Lane, Kenne Duncan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030756",
    "tt0032989",
    "tt0032563",
    "tt0032497",
    "tt0033104",
    "tt0031164",
    "tt0031306",
    "tt0032055",
    "tt0032014",
    "tt0034270",
    "tt0031769",
    "tt0030581"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:34:27.073Z"
}