{
  "movieId": "tt0040806",
  "title": "The Snake Pit",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-snake-pit-1948",
      "id": "the-snake-pit-1948",
      "title": "The Snake Pit (1948)",
      "description": "A COVA DA SERPENTE (The Snake Pit, 1948) (Filme Completo / Legendado em Português) Data de Lançamento: 4 November 1948 » SINOPSE: Uma crônica detalhada da estadia de uma mulher em uma instituição mental. Virginia Cunningham se encontra em um asilo de loucos... E não consegue se lembrar de como chegou lá. Em flashback, seu marido Robert relata seu namoro, casamento e seus sintomas em desenvolvimento. O pessoal do asilo não é demonizado, mas o medo, a ignorância e os preconceitos mantêm a Virgínia em um estado de miséria, enquanto o Dr. Mark Kik luta para encontrar a raiz de seu problema. Mas uma recaída leva Virgínia de volta para a angustiante 'Cova da Serpente' ... . SOBRE O FILME: The Snake Pit foi escrito por Mary Jane Ward, baseado em suas memórias. O livro semi biográfico narra o processo de tratamento de Vírginia, uma mulher que é diagnosticada esquizofrênica e internada em um manicômio. Snake era antes de mais nada uma denúncia sobre as condições de tratamento dos pacientes, entregues muitas vezes à hospitais sem estrutura e tratamento desumano, contribuindo para que houvesse uma reforma no sistema de hospitais mentais dos Estados Unidos. . Na época em que o livro foi lançado, Ward chegou a negar que a história refletia suas próprias experiências. Mas o fato é que ela seria internada mais algumas vezes ao longo de sua vida e realmente teve um colapso nervoso que a levou a um hospital psiquiátrico em Nova York. A autoria teria sido erroneamente diagnosticada como esquizofrênica e submetida a tratamentos como o temido eletrochoque e a hidroterapia. O livro acabou se tornando rapidamente um best-seller e teve os direitos comprados para um filme que seria dirigido pelo ucraniano Anatole Litvak. » DIREÇÃO: Anatole Litvak ROTEIRO: Frank Partos & Millen Brand (screen play) GÊNERO: Drama, Mystery  ORIGEM: USA DURAÇÃO: 1h 48min » » ELENCO PRINCIPAL:  Olivia de Havilland ... Virginia Stuart Cunningham Mark Stevens ... Robert Cunningham Leo Genn ... Dr. Mark Kik Celeste Holm ... Grace Glenn Langan ... Dr. Terry Helen Craig ... Nurse Davis Leif Erickson ... Gordon Beulah Bondi ... Mrs. Greer Lee Patrick ... Asylum Inmate Howard Freeman ... Dr. Curtis",
      "fileSize": 4141720974,
      "addedAt": "2026-01-07T00:12:22.159Z",
      "thumbnail": "https://archive.org/services/img/the-snake-pit-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 11002
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "108 min",
    "imdbRating": 7.6,
    "imdbVotes": 8803,
    "Genre": "Drama, Mystery",
    "Plot": "Virginia Cunningham finds herself in a state insane asylum...and can't remember how she got there. In flashback, her husband Robert relates their courtship, their marriage, and her developing symptoms. The asylum staff are not demonized, but fear, ignorance, and regimentation keep Virginia in a state of misery as pipe-smoking Dr. Mark Kik struggles through wheels within wheels to find the root of her problem. Then a relapse plunges Virginia back into the harrowing 'Snake Pit.'",
    "Director": "Anatole Litvak",
    "Writer": "Frank Partos, Millen Brand, Mary Jane Ward",
    "Actors": "Olivia de Havilland, Mark Stevens, Leo Genn",
    "Language": "English, German, Russian",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 13 wins & 10 nominations total"
  },
  "relatedMovies": [
    "tt0040823",
    "tt0062038",
    "tt0039581",
    "tt0040798",
    "tt0040002",
    "tt0201074",
    "tt0040687",
    "tt0040799",
    "tt0040764",
    "tt0040338",
    "tt0039757",
    "tt0039768"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1940s",
      "name": "1940s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.159Z"
}