{
  "imdbId": "tt0000880",
  "title": "The Girls and Daddy",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheGirlsAndDaddy",
      "id": "PreviewTheGirlsAndDaddy",
      "title": "\"The Girls and Daddy\" (1909) director D. W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Girls and Daddy\"  is a short crime drama directed by D.W. Griffith.  We have a whole constellation of our stars taking part in this film: Billy Bitzer, Arthur V. Johnson, Robert Harron and Florence Lawrence. Billy Bitzer shares the cinematography credit with Arthur Marvin. Arthur V. Johnson plays a policeman, Robert Harron is a messenger and Florence Lawrence is the first daughter. D.W. Griffith gets an acting credit as well, apart from the director's job. He is somewhere in the ball scene, but it is difficult to spot him. When their father leaves for business, Florence Lawrence and her sister become the victims of two consecutive, but separate burglaries. Ironically, when they seek help to counter the second more violent criminal, the only person available is the first thief.   Directed by                       D.W. Griffith Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Florence Lawrence, Dorothy West, David Miles, Arthur V. Johnson, Robert Harron Distributed by                   Biograph Company Release date                      February 1, 1909 Country                             United States Running time                    9 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 18133141,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheGirlsAndDaddy",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 1533
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "15 min",
    "imdbRating": 5.8,
    "imdbVotes": 90,
    "Genre": "Short, Drama",
    "Plot": "Two young women who live with their father are home alone, and are guarding a significant sum of money. While they are sleeping, a thief climbs in through the window and begins to rob their home. Even before he has left the premises, the two young women are confronted by another, more violent intruder.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "David Miles, Florence Lawrence, Dorothy West",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001091",
    "tt0000828",
    "tt0000942",
    "tt0001016",
    "tt0000821",
    "tt0000833",
    "tt0000946",
    "tt0001088",
    "tt0001150",
    "tt0000752",
    "tt0001388",
    "tt0000764"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}