{
  "movieId": "tt0055239",
  "title": "Not Tonight Henry",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NotTonightHenry",
      "id": "NotTonightHenry",
      "title": "Not Tonight Henry",
      "description": "One of the early color near-nudie films and was re-shown often by, mostly, drive-in theatre owners in need of a quick cash fix. They would hang out the \"Adults Only\" sign, thereby ensuring that every high school and junior high boy (and more than a few dads) within an hour's drive would storm the gate, and turn on the popcorn machine and then hot-foot it to the night-deposit at the bank. Hank Henry is more than a little frustrated at the \"lack of attention\" he is getting at home from his wife and starts dreaming up amorous escapades with sirens from the past... Cleopatra, Josephine, Delilah and others. Most end in some old burlesque skit or blackout gag, but Henry makes the history rounds. While he is dreaming, his wife is reading a book about the great lovers of history. When he \"returns\" the wife tells him he doesn't have to sleep on the couch any more... and amends that to \"at least, not tonight, Henry.\" **I believe the movie was narrated by Paul Frees. According to oldbones, no registration was found for this 1960 release.**",
      "fileSize": 1473895586,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/NotTonightHenry",
      "collection": "feature_films",
      "downloads": 97432
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "75 min",
    "imdbRating": 5.3,
    "imdbVotes": 104,
    "Genre": "Comedy",
    "Plot": "One of the early color near-nudie films and was re-shown often by, mostly, drive-in theatre owners in need of a quick cash fix. They would hang out the \"Adults Only\" sign, thereby ensuring that every high school and junior high boy (and more than a few dads) within an hour's drive would storm the gate, and turn on the pop corn machine and then hot-foot it to the night-deposit at the bank. \"Not Tonight, Henry\" (the actual title and not an alternate title as some seem to think) was a large step up in quality for director W. Merle Connell in that it was in color and also not just a static-camera filming of a burlesque show inside of one of L. A.'s smoky, grind house burlesques. The girls were still out of burlesque, as were Hank Henry and Little Jack Little: Hank Henry is more than a little frustrated at the \"lack of attention\" he is getting at home from his wife and starts dreaming up amorous escapades with sirens from the past... Cleopatra, Josephine, Delilah and others. Most end in some old burlesque skit or blackout gag, but Henry makes the history rounds. While he is dreaming, his wife is reading a book about the great lovers of history. When he \"returns\" the wife tells him he doesn't have to sleep on the couch any more... and amends that to---\"at least, not tonight, Henry.\"",
    "Director": "W. Merle Connell",
    "Writer": "John Herbert, Harold Lime, Bob Heiderich",
    "Actors": "Hank Henry, Joni Day, Babe McDonnell",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0053683",
    "tt0166983",
    "tt0054230",
    "tt0054237",
    "tt0054033",
    "tt0054195",
    "tt0053699",
    "tt0178316",
    "tt0315357",
    "tt0144150",
    "tt0053579",
    "tt0054127"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.465Z"
}