{
  "imdbId": "tt0001054",
  "title": "Sweet and Twenty",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewSweetAndTwenty1909",
      "id": "PreviewSweetAndTwenty1909",
      "title": "\"Sweet And Twenty\" (1909) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Sweet and Twenty\" is a short comedy directed by D. W. Griffith. This film illustrates the work of Florence Lawrence and Billy Bitzer, stars of Silent Hall of Fame.   Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          unknown Cinematography                G.W. Bitzer Starring                                Mary Pickford, James Kirkwood, Florence Lawrence, Billy Quirk Distributed by                     Biograph Company Release date                         July 22, 1909 Running time                       7 min. Country                                United States Language                              Silent, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 10251241,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewSweetAndTwenty1909",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 2551
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.8,
    "imdbVotes": 37,
    "Genre": "Short, Romance",
    "Plot": "A pretty little comedy of love's young dream, presented in the most dainty manner imaginable. 'Tis late Spring, the flowers are in bloom and the birds are in tune to the lover's song, when Alice and Frank romp among the wildflowers. Frank is desperately in love with pretty little Alice, but she, while loving him in return, is a tantalizing mite of femininity and enjoys the sensation of keeping him guessing. However, as faint heart ne'er won fair lady, he persists so stubbornly that he finally wins her response. Frank is now in the very zenith of ecstatic bliss. They part at the door and Alice goes inside. Frank is too happy to lose her company so soon, so follows after. Entering the drawing-room, he espies what appears to be the object of his visit standing at the window closing the shades. Approaching stealthily, he kisses the braids of her hair and then turning her head around imprints a kiss on the lips of: \"Great Scott! her sister.\" Here is trouble, for Alice had entered just in time to see the performance. It is all off between them, despite his explanation, and in desperation he resolves to go and throw himself into the lake and end it all. At the lakeside his determination receives a chill, and he is cogitating when he hears Alice approaching in pursuit to dissuade him from his dire design. He now makes the bluff at self-destruction, which goes; Alice doing her utmost to drag him from the spot. As his resistance is but mild, she succeeds, and they are once more folded in each others' arms, she accusing herself of being unreasonable and hasty, while he is proudly slapping himself on the back with the assumption that he is simply irresistible. They are just a couple of kids who will kiss and make up, only to quarrel again soon for the fun of making up.",
    "Director": "D.W. Griffith",
    "Writer": "N/A",
    "Actors": "Mary Pickford, James Kirkwood, Billy Quirk",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000877",
    "tt0001452",
    "tt0001371",
    "tt0001458",
    "tt0001387",
    "tt0001978",
    "tt0000972",
    "tt0001002",
    "tt0001014",
    "tt0002497",
    "tt0002282",
    "tt0002302"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}