{
  "imdbId": "tt0013427",
  "title": "Nanook of the North",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nanook4k",
      "id": "nanook4k",
      "title": "Nanook Of The North (1922) [Colorized, 4K, 60FPS]",
      "description": "Nanook Of The North is a 1922 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io A.I. Upscaling to 4K:  https://ffmpeg.org GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 5594846242,
      "addedAt": "2026-01-07T00:10:02.896Z",
      "thumbnail": "https://archive.org/services/img/nanook4k",
      "collection": "feature_films",
      "downloads": 244
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QxGdqa-1tyY",
      "id": "QxGdqa-1tyY",
      "title": "Nanook of the North (1922) | Colorized Public Domain Silent Documentary Classic Restored",
      "description": "Nanook of the North (1922) is one of the most influential films in cinema history, widely recognized as the first feature-length documentary. Directed by Robert J. Flaherty, this silent film presents the life of an Inuk hunter named Nanook and his family as they struggle to survive in the harsh Arctic environment of northern Canada. This restored and colorized public domain edition brings new vitality to the groundbreaking documentary that helped define ethnographic and documentary filmmaking for the 20th century.\n\nInuit[a] (singular: Inuk) are a group of culturally and historically similar Indigenous peoples traditionally inhabiting the Arctic and Subarctic regions of North America and Russia, including Greenland, Labrador, Quebec, Nunavut, the Northwest Territories, Yukon (traditionally), Alaska, and the Chukotsky District of Chukotka Autonomous Okrug. The Inuit languages are part of the Eskaleut languages, also known as Inuit-Yupik-Unangan, and also as Eskimo–Aleut.\n\nRobert Joseph Flaherty, FRGS was an American filmmaker who directed and produced the first commercially successful feature-length documentary film, Nanook of the North (1922). The film made his reputation and nothing in his later life fully equaled its success, although he continued the development of this new genre of narrative documentary with Moana (1926), set in the South Seas, and Man of Aran (1934), filmed in Ireland's Aran Islands. Flaherty is considered the father of both the documentary and the ethnographic film.\n\nPlot and Content Summary:\nFilmed between 1920 and 1921, Nanook of the North follows Nanook, his wife Nyla, their children, and extended kin in their daily lives, offering audiences of the 1920s an unprecedented look at Inuit culture. Key sequences include:\n• Building an igloo from blocks of snow, complete with an interior living space\n• Hunting seals at breathing holes in the ice using harpoons\n• Trading at a Hudson’s Bay Company post\n• Fishing, sled-dog travel, and traditional survival techniques\nThe film captures both the difficulty and dignity of Inuit life, showing resourcefulness and joy amid extreme conditions.\n\nHistorical Significance:\nNanook of the North was released in 1922 by Pathé and is considered the first commercially successful feature-length documentary. It was selected for preservation in the United States National Film Registry for its cultural, historical, and aesthetic importance. Although some scenes were staged or re-enacted rather than purely observational, the film was groundbreaking in its attempt to depict the lives of Indigenous peoples on screen. It paved the way for documentary film as an art form and influenced generations of filmmakers worldwide.\n\nControversy and Criticism:\nModern scholars acknowledge that while Nanook of the North is pioneering, it is not a fully authentic record of Inuit life in the 1920s. Director Robert Flaherty asked participants to use traditional tools instead of rifles, and even arranged certain scenes for dramatic effect. Nanook himself, whose real name was Allakariallak, died two years after filming, making the movie a lasting tribute to his role and culture. Despite its staged elements, the film retains immense historical value as an artifact of early ethnographic cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, meaning it is entirely free of copyright restrictions and can be shared, studied, preserved, and enjoyed without limitation. Colorized Public Domain restores, cleans, and colorizes these important works to bring them to modern audiences in engaging form. By adding color and digital enhancements, we provide fresh accessibility while preserving the authenticity of the original content. This ensures that future generations continue to engage with these pioneering works of film history.\n\nWhy Watch This Colorized Edition:\nNanook of the North was originally released as a silent black-and-white feature. While historically important, its original form may feel inaccessible to some modern viewers. This colorized restoration allows audiences to connect more vividly with the world of Nanook, highlighting Arctic landscapes, clothing, and daily life with new depth. While colorization is interpretive, it creates a stronger bridge between historical reality and modern viewing expectations.\n\nFilm Credits:\n• Directed and produced by Robert J. Flaherty\n• Distributed by Pathé Exchange\n• Starring Allakariallak as Nanook and family\n• Filmed on location in northern Quebec, Canada\n\nSubscribe for More Classics:\n📌 Subscribe to Colorized Public Domain for more restored films: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nOur channel revives historic silent films, lost gems, and forgotten B-movies, bringing them back to life with modern clarity and accessibility.\n\n#NanookOfTheNorth #1922Documentary #SilentFilm #PublicDomainMovie #ColorizedClassic #RobertFlaherty #EthnographicFilm #InuitCulture #SilentCinema #FilmRestoration",
      "addedAt": "2025-12-24T00:49:16.020Z",
      "thumbnail": "https://i.ytimg.com/vi/QxGdqa-1tyY/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBUKE0wDw==&rs=AOn4CLCSgga_D0wEzUxVlzQjGouXPgJD0Q",
      "duration": 3932,
      "language": "en",
      "year": 1922,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-nanook-of-the-north",
      "id": "silent-nanook-of-the-north",
      "title": "Nanook of the North",
      "fileSize": 1143147631,
      "addedAt": "2026-01-07T00:11:07.409Z",
      "thumbnail": "https://archive.org/services/img/silent-nanook-of-the-north",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 731
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NanookOfTheNorth-HD",
      "id": "NanookOfTheNorth-HD",
      "title": "Nanook Of The North-hd",
      "description": "nanook of the north , with a new royalty free music score in 720 hd.",
      "fileSize": 4508680091,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NanookOfTheNorth-HD",
      "collection": "feature_films",
      "downloads": 19668
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NanookOfTheNorth1922english",
      "id": "NanookOfTheNorth1922english",
      "title": "NanookOfTheNorth1922english",
      "description": "NanookOfTheNorth1922english Silent. No music.",
      "fileSize": 599515055,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NanookOfTheNorth1922english",
      "collection": "feature_films",
      "downloads": 310
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "78 min",
    "imdbRating": 7.6,
    "imdbVotes": 14039,
    "Genre": "Documentary",
    "Plot": "Documents one year in the life of Nanook, an Eskimo (Inuit), and his family. Describes the trading, hunting, fishing and migrations of a group barely touched by industrial technology. Nanook of the North was widely shown and praised as the first full-length, anthropological documentary in cinematographic history.",
    "Director": "Robert J. Flaherty",
    "Writer": "Frances H. Flaherty, Robert J. Flaherty",
    "Actors": "Allakariallak, Alice Nevalinga, Cunayou",
    "Language": "English",
    "Country": "France, United States",
    "Awards": "2 wins total"
  },
  "relatedMovies": [
    "tt0208526",
    "tt0013257",
    "tt13166260",
    "tt0229789",
    "tt0138446",
    "tt0294857",
    "tt1029374",
    "tt1764657",
    "tt0131468",
    "tt0306032",
    "tt0988639",
    "tt0263823"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:20:05.379Z"
}