{
  "imdbId": "tt0041733",
  "title": "Parole, Inc.",
  "year": 1948,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xW1ngf4QOTE",
      "id": "xW1ngf4QOTE",
      "title": "Parole, Inc. (1948) [Film Noir] [Crime]",
      "description": "The film opens with a scene of FBI agent Richard Hendricks (Michael O'Shea) bedridden in a hospital bed, dictating the results of his investigation for a report to the California Governor. The dictation scenes are interrupted by long flashbacks scenes showing how the investigation proceeded. After a number of paroles granted to dangerous career criminals, the California Governor and State Attorney General suspected corruption in the state parole board. They called upon Hendricks to investigate and expose those involved. Hendricks decided to go undercover as an ex-convict wanting to buy a parole for a criminal partner currently in jail. He then proceeded to infiltrate the social circle of another recent parolee of dubious character, Harry Palmer, and ask him how to purchase a parole. However, the people operating the parole purchase ring were quite secretive and ready to take extreme measures to prevent their exposure.\n\n---\n\nDirected by Alfred Zeisler, produced by Constantin J. David (producer) and Anthony Z. Landi (associate producer), written by Sherman L. Lowe (story), Royal K. Cole (story)\nand Sherman L. Lowe (screenplay), starring Michael O'Shea as Richard Hendricks, Turhan Bey as Barney Rodescu, Evelyn Ankers as Jojo Dumont, Virginia Lee as Glenda Palmer, Charles Bradstreet as Harry Palmer, Lyle Talbot as Police Commissioner Hughes, Michael Whalen as Kid Redmond, Charles Williams as Titus Jones, James Cardwell as Duke Vigili, Paul Bryar as Charley Newton, Noel Cravat as Blackie Olson and Charles Jordan as Monty Cooper.\n\n---\n\nSource: \"Parole, Inc.\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 14 December 2012. Web. 22 March 2013. http://en.wikipedia.org/wiki/Parole,_Inc..\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:38.325Z",
      "thumbnail": "https://i.ytimg.com/vi/xW1ngf4QOTE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAXbwor6Hu7pXWHkXuLojNAe2qvTg",
      "duration": 4268,
      "language": "en",
      "year": 1948,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/parole-inc",
      "id": "parole-inc",
      "title": "Parole Inc.",
      "description": "Taken from IMDB: When several notorious criminals are unjustifiably released on parole, the Federal Government smells a rat and sends ace agent Richard Hendricks to investigate. Hendricks infiltrates the gang, responsible for the parole racket by posing as a much-wanted convict Rick Carson. However, the wily Barney Rodescu, who is the brain behind the racket, soon finds out Carson's true identity. Carson's life is now in grave danger.",
      "fileSize": 1141532186,
      "addedAt": "2026-01-07T00:10:12.696Z",
      "thumbnail": "https://archive.org/services/img/parole-inc",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 17795
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/parole-inc.-1948",
      "id": "parole-inc.-1948",
      "title": "Parole, Inc. (1948)",
      "description": "A federal agent's life is in danger when he's exposed while investigating a parole scheme. Watch on RetroFlix:  https://retroflix.org/parole-inc-1948/",
      "fileSize": 203825688,
      "addedAt": "2026-01-07T00:10:12.696Z",
      "thumbnail": "https://archive.org/services/img/parole-inc.-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 121
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/parole_inc",
      "id": "parole_inc",
      "title": "Parole Inc",
      "description": "\"Low budget exposé thriller of corruption being uncovered in the parole system.\" - Spencer Selby, Dark City: The Film Noir | You can find more information regarding this film on its IMDb page .",
      "fileSize": 4258454650,
      "addedAt": "2026-01-07T00:10:12.696Z",
      "thumbnail": "https://archive.org/services/img/parole_inc",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 92998
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fABvwjggWpc",
      "id": "fABvwjggWpc",
      "title": "Parole, Inc. (1948) FILM NOIR",
      "description": "Stars: Turhan Bey, Michael O'Shea, Evelyn Ankers\nDirector: Alfred Zeisler\n\nParole officers fight against gangsters trying to infiltrate the parole system.",
      "addedAt": "2025-12-26T23:57:02.358Z",
      "thumbnail": "https://i.ytimg.com/vi/fABvwjggWpc/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLAwOt694MQY4FjgElskhPNcPu2kWA",
      "duration": 4268,
      "language": "en",
      "year": 1948,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "71 min",
    "imdbRating": 5.7,
    "imdbVotes": 421,
    "Genre": "Crime, Film-Noir, Thriller",
    "Plot": "When several notorious criminals are unjustifiably released on parole, the Federal Government smells a rat and sends ace agent Richard Hendricks to investigate. Hendricks infiltrates the gang, responsible for the parole racket by posing as a much-wanted convict Rick Carson. However, the wily Barney Rodescu, who is the brain behind the racket, soon finds out Carson's true identity. Carson's life is now in grave danger.",
    "Director": "Alfred Zeisler",
    "Writer": "Sherman L. Lowe, Royal K. Cole",
    "Actors": "Michael O'Shea, Turhan Bey, Evelyn Ankers",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040427",
    "tt0040270",
    "tt0040887",
    "tt0040695",
    "tt0041460",
    "tt0042648",
    "tt0040829",
    "tt0043503",
    "tt0121515",
    "tt0041109",
    "tt0038529",
    "tt0040779"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.696Z"
}