{
  "movieId": "tt0001091",
  "title": "What Drink Did",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WhatDrinkDid",
      "id": "WhatDrinkDid",
      "title": "\"What Drink Did\" (1909) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"What Drink Did\" is a short drama. The film is included in our program to illustrate the work of three of our stars: actress Florence Lawrence, actor Arthur V. Johnson and cinematographer Billy Bitzer. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             David Miles, Florence Lawrence, Gladys Egan and Adele DeGarde (children), Arthur V. Johnson Distributed by                   Biograph Company Release date                      June 3, 1909 Country                             United States Running time                    12 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 236995524,
      "addedAt": "2026-01-07T00:07:11.888Z",
      "thumbnail": "https://archive.org/services/img/WhatDrinkDid",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 1835
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-what-drink-did",
      "id": "silent-what-drink-did",
      "title": "What Drink Did",
      "fileSize": 179118688,
      "addedAt": "2026-01-07T00:11:24.927Z",
      "thumbnail": "https://archive.org/services/img/silent-what-drink-did",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 446
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "12 min",
    "imdbRating": 5.3,
    "imdbVotes": 224,
    "Genre": "Short, Drama",
    "Plot": "A man leaves his wife and two daughters for work in a carpentry shop. At work, he initially refuses a beer with lunch, then gives in. After work, two friends take a little while to convince him to go for a refreshing malt beverage, then to have another and another. Meanwhile, the family waits. He arrives home late and abusive. The next day, hung over, he takes much less convincing to have the drinks; he's gone so long that his wife sends a daughter looking for him. She eventually finds him, can't convince him to return home, goes home, sees her mother's distress, and returns to the bar. This time, her father gets more abusive, a fight ensues, a shot is fired, and tragedy strikes.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "David Miles, Florence Lawrence, Gladys Egan",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000880",
    "tt0000833",
    "tt0000752",
    "tt0001072",
    "tt0000828",
    "tt0000942",
    "tt0001016",
    "tt0000821",
    "tt0000946",
    "tt0001088",
    "tt0001431",
    "tt0000764"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.927Z"
}