{
  "imdbId": "tt0049856",
  "title": "Time Without Pity",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1957-time-without-pity-tiempo-sin-piedad-joseph-losey-vose",
      "id": "1957-time-without-pity-tiempo-sin-piedad-joseph-losey-vose",
      "title": "1957 - Time without Pity - Tiempo sin piedad - Joseph Losey - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com t.me/agendasociocultural",
      "fileSize": 1643905571,
      "addedAt": "2026-01-07T00:06:06.563Z",
      "thumbnail": "https://archive.org/services/img/1957-time-without-pity-tiempo-sin-piedad-joseph-losey-vose",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 5762
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/time-without-pity-1957",
      "id": "time-without-pity-1957",
      "title": "Time Without Pity (1957) Michael Redgrave, Ann Todd, Leo Mc Kern, Paul Daneman, Peter Cushing, Alec Mc Cowen, Renee Houston",
      "description": "Time Without Pity is a 1957 British FILM NOlR thriller film about a father trying to save his son from execution for murder. The film was directed by expatriate American Joseph Losey after he was blacklisted in the U.S. during the McCarthyism era. Time Without Pity was Losey's second film in Britain and his first under his own name. The film stars Michael Redgrave, Ann Todd, Leo McKern, Paul Daneman, Peter Cushing, Alec McCowen and Renee Houston.  The screenplay was written by fellow blacklisted writer Ben Barzman and adapted from the play Someone Waiting by Emlyn Williams. You can find out more about this movie from Wikipedia .",
      "fileSize": 1985555584,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/time-without-pity-1957",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 1081
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/time-without-pity-1957_202506",
      "id": "time-without-pity-1957_202506",
      "title": "Time Without Pity (1957)",
      "description": "Alec Graham is sentenced to death for the murder of his girlfriend Jennie, with whom he spent a weekend at the English country home of the parents of his friend Brian Stanford. Alec’s father, David Graham, a not-so-successful writer and alcoholic who has neglected his son in the past, flies in from Canada to visit his son on death row. David then goes on a quest to try and clear his son’s name while battling “the bottle.” Watch on RetroFlix:  https://retroflix.org/time-without-pity-1957/",
      "fileSize": 2364681047,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/time-without-pity-1957_202506",
      "language": "eng",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 178
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 6.8,
    "imdbVotes": 2011,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Alec Graham (Alec McCowen) is sentenced to death for the murder of his girlfriend Jennie Cole (Christina Lubicz), with whom he was spending the night at the flat of the parents of his friend Brian Stanford (Paul Daneman). Alec's father, David Graham (Sir Michael Redgrave), a not-so-successful writer and alcoholic who has neglected his son in the past, flies in the day before the planned execution from Canada to visit his son on death row. Alec is resigned to his fate and not amenable to his father's attempts for a final reconciliation. David Graham, convinced of his son's innocence and, despite his preoccupation with himself and his own alcoholism, mounts a last-ditch effort to find the true murderer in the twenty-four hours remaining until the planned execution. Graham encounters the wealthy and famous car manufacturer Robert Stanford (Leo McKern), tyrant at home and in the office, and an apparent womanizer, Stanford's young, curiously troubled wife Honor (Ann Todd), their ill-at- ease adopted son Brian, himself disturbed by his parents' relationship, and Vickie Harker (Lois Maxwell), a young, brazen secretary at Stanford's factory who received a promotion following Alec's conviction.",
    "Director": "Joseph Losey",
    "Writer": "Ben Barzman, Emlyn Williams",
    "Actors": "Michael Redgrave, Ann Todd, Leo McKern",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "Nominated for 1 BAFTA Award1 nomination total"
  },
  "relatedMovies": [
    "tt0042669",
    "tt0052634",
    "tt0048393",
    "tt0050241",
    "tt0051713",
    "tt0050526",
    "tt0050847",
    "tt0050964",
    "tt0050213",
    "tt0050424",
    "tt0050704",
    "tt0051058"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.284Z"
}