{
  "movieId": "tt0068695",
  "title": "Heroína",
  "year": 1972,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/heroina-1972",
      "id": "heroina-1972",
      "title": "Heroina ( 1972)",
      "description": "Heroína  es una película filmada en colores de  Argentina  dirigida por  Raúl de la Torre  sobre su propio guion escrito en colaboración con  Emilio Rodrigué  según la novela homónima de Rodrigué que se estrenó el 29 de junio de 1972 y que tuvo como protagonistas a  Graciela Borges ,  Pepe Soriano ,  Lautaro Murúa  y  María Vaner . (Wikipedia) Sinopsis Peny es una joven de veintiséis años que vive en un apartamento de  Buenos Aires  y trabaja como traductora. Cuando se celebra el vigésimo congreso nacional de psicología, Peny conoce a un médico puertorriqueño, Gonzáles, con quien tiene una pequeña aventura, pero éste se da cuenta de la inestabilidad emocional de Peny cuando ella reacciona a gritos en la asamblea como producto de un juego terapéutico. Peny vive traumatizada por un oscuro pasado y le cuesta entablar vínculos con la gente. Posteriormente, es diagnosticada con  esquizofrenia  e internada en un hospital psiquiátrico. Su situación parece cambiar y dar un giro cuando el Doctor Gonzáles le envía una carta y ella está dispuesta volver a verlo. Reparto Graciela Borges  como María Penélope Crespo \"Peny\" Pepe Soriano Lautaro Murúa  como el Dr. Javier González María Vaner  como Susana Eduardo Pavlovsky  como el médico psiquiatra y terapeuta de Peny China Zorrilla  como Marta Héctor Pellegrini  como Juan, compañero de la terapia de grupo de Peny Emilio Rodrigué Manuel Rey Millares Adrián Ghío  como José María, compañero de la terapia de grupo de Peny Sergio Renán Domingo Basile Rubén Tobías Carlos Muñoz",
      "fileSize": 1002136007,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/heroina-1972",
      "language": "spa",
      "year": 1972,
      "collection": "feature_films",
      "downloads": 462
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "110 min",
    "imdbRating": 7.1,
    "imdbVotes": 23,
    "Genre": "Drama",
    "Plot": "A woman who has been traumatized by her brother's accidental death from electrocution in the subways of Buenos Aires learns to readjust.",
    "Director": "Raúl de la Torre",
    "Writer": "Emilio Rodrigué, Raúl de la Torre",
    "Actors": "Graciela Borges, Lautaro Murúa, Pepe Soriano",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0064522",
    "tt0124082",
    "tt0180638",
    "tt0193602",
    "tt0171661",
    "tt0071085",
    "tt0067038",
    "tt0068539",
    "tt8739606",
    "tt0069446",
    "tt0070569",
    "tt0068174"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}