{
  "movieId": "tt0025586",
  "title": "Of Human Bondage",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/humanbondage",
      "id": "humanbondage",
      "title": "Of Human Bondage",
      "description": "The 1934 film was the first film to bring real critical success to its star Bette Davis, her over-the-top, theatrical performance was passed over for a Best Actress Oscar nomination, although she was an unofficial write-in candidate. The RKO film, directed by John Cromwell, tells the story of a club-footed, sensitive artist Philip Carey (Leslie Howard), an Englishman who has been studying painting in Paris for four years, but is advised by his art teacher that his work is mediocre and second-rate, and that he lacks promise. So he returns to London, England to take up studies to become a medical doctor, but his older age and introspection make it difficult for him to keep up in his scholastic work. In England, he becomes infatuated - and then obsessed by a blonde, lower-class, slatternly and vulgar, Cockney-accented, illiterate tearoom waitress named Mildred Rogers (Bette Davis).",
      "fileSize": 3355985408,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/humanbondage",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 101770
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/of-human-bondage-1934",
      "id": "of-human-bondage-1934",
      "title": "Of Human Bondage (1934)",
      "description": "A young man finds himself attracted to a cold and unfeeling waitress who may ultimately destroy them both. Watch on RetroFlix:  https://retroflix.org/of-human-bondage-1934/",
      "fileSize": 3409530304,
      "addedAt": "2026-01-07T00:10:02.900Z",
      "thumbnail": "https://archive.org/services/img/of-human-bondage-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 508
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ohb4354351",
      "id": "ohb4354351",
      "title": "Of Human Bondage",
      "description": "Title: Of Human Bondage Summary: A young man finds himself attracted to a cold and unfeeling waitress who may ultimately destroy them both. Directed by: John Cromwell Actors: Bette Davis, Leslie Howard, Frances Dee Production Company: RKO Radio Pictures Release Date: 20 July 1934 (USA) Aspect Ratio: 1.37 : 1 Abandoning artistic ambitions, sensitive and club-footed Philip Carey enrolls in medical school and falls in love with a waitress Mildred Rogers. She rejects him, runs off with a salesman and returns unmarried and pregnant. Philip gets her an apartment and they become engaged. Mildred runs off with another medical student. Philip takes her back again when she returns with her baby. She wrecks his apartment and burns the securities he needs to pay tuition. He gets a job as a salesman, has surgery on his foot, receives an inheritance, and returns to school where he learns Mildred is dying.",
      "fileSize": 625280158,
      "addedAt": "2026-01-07T00:10:02.901Z",
      "thumbnail": "https://archive.org/services/img/ohb4354351",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 2627
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2tkIjtQ2TwQ",
      "id": "2tkIjtQ2TwQ",
      "title": "Of Human Bondage (1935) [Drama] [Romance]",
      "description": "\"Of Human Bondage\" is a 1934 American drama film directed by John Cromwell and is widely regarded by critics as the film that made Bette Davis a star. The screenplay by Lester Cohen is based on the 1915 novel of the same title by W. Somerset Maugham.\n\nSensitive, club-footed artist Philip Carey is an Englishman who has been studying painting in Paris for four years. His art teacher tells him his work lacks talent, so he returns to London to become a medical doctor, but his moodiness and chronic self-doubt make it difficult for him to keep up in his schoolwork. Philip falls passionately in love with vulgar tearoom waitress Mildred Rogers, even though she is disdainful of his club-foot and his obvious interest in her. Although he is attracted to the anemic and pale-faced woman, she is manipulative and cruel toward him when he asks her out. Her constant response to his romantic invitations is \"I don't mind,\" an expression so uninterested that it infuriates him - which only causes her to use it all the more. His daydreams about her (her image appears over an illustration in his medical school anatomy textbook, and a skeleton in the classroom is transformed into Mildred) cause him to be distracted from his studies, and he fails his medical examinations.\n\nWhen Philip proposes to her, Mildred declines, telling him she will be marrying a loutish salesman Emil Miller instead. The self-centered Mildred vindictively berates Philip with nasty insults for becoming romantically interested in her. Philip begins to forget Mildred when he falls in love with Norah, an attractive and considerate romance writer working under a male pseudonym. She slowly cures him of his painful addiction to Mildred. But just when it appears that Philip is finding happiness, Mildred returns, pregnant and claiming that Emil has abandoned her. Philip provides an apartment for her, arranges to take care of her financially, and breaks off his relationship with Norah. Norah and Philip admit how bondages exist between people (Philip was bound to Mildred, as Norah was to Philip, and as Mildred was to Miller). Philip's intention is to marry Mildred after her child is born, but a bored and restless Mildred is an uninterested mother, and gives up the baby's care to a nurse. \n\nAt a dinner party celebrating their engagement, one of Philip's medical student friends, Harry Griffiths, flirts with Mildred, who somewhat reciprocates. After Philip confronts Mildred, she runs off with Griffiths for Paris. A second time, Philip again finds some comfort in his studies, and with Sally Athelny, the tender-hearted daughter of one of his elderly patients in a charity hospital. The Athelny family is caring and affectionate, and they take Philip into their home. Once again, Mildred returns with her baby, this time expressing remorse for deserting him. Philip cannot resist rescuing her and helping her to recover from another failed relationship. Things take a turn for the worse when Mildred moves in, spitefully wrecks his apartment and destroys his paintings and books, and burns the securities and bonds he was given by an uncle to finance his tuition. Philip is forced to quit medical school, but before he leaves the institution, an operation corrects his club foot. The Athelnys take Philip in when he is unable to find work and is locked out of his flat, and he takes a job with Sally's father as a window dresser.\n\nAs time progresses, a letter is sent to Philip which informs him that his uncle has died, leaving a small inheritance. With the inheritance money, Philip is able to return to medical school and pass his examinations to become a qualified doctor. Later, Philip meets up with Mildred, now sick, destitute, and working as a prostitute. Mildred's baby has died, and she has become distraught and sick with tuberculosis. Before he can visit her again, she dies in a hospital charity ward. With Mildred's death, Philip is finally freed of his obsession, and he makes plans to marry Sally.\n\n---\n\nDirected by John Cromwell, produced by Pandro S. Berman, written by Lester Cohen, \nbased on the novel by W. Somerset Maugham, starring Leslie Howard, Bette Davis and Frances Dee.\n\n---\n\nSource: \"Of Human Bondage (1934 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 15 August 2012. Web. 31 August 2012. http://en.wikipedia.org/wiki/Of_Human_Bondage_(1934_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:50.378Z",
      "thumbnail": "https://i.ytimg.com/vi/2tkIjtQ2TwQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC_Vqw9NM0pvfTrqGmtxlT3kDGvWg",
      "duration": 4959,
      "language": "en",
      "year": 1935,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VFFAHGDhv30",
      "id": "VFFAHGDhv30",
      "title": "Of Human Bondage (1934) | Colorized Public Domain Classic Drama with Bette Davis and Leslie Howard",
      "description": "Of Human Bondage (1934) is a pre-Code American drama directed by John Cromwell, based on the 1915 novel by W. Somerset Maugham. This public domain masterpiece is remembered as the breakout role of Bette Davis, whose raw and emotionally charged performance as Mildred Rogers established her as one of Hollywood’s greatest actresses. With Leslie Howard portraying Philip Carey, the story explores themes of love, obsession, rejection, and personal redemption. Now fully restored and colorized, this edition revives a cornerstone of Golden Age cinema for today’s audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nPhilip Carey (Leslie Howard) is a sensitive, clubfooted medical student in London, struggling with feelings of inadequacy and loneliness. His life changes when he becomes infatuated with Mildred Rogers (Bette Davis), a coarse and manipulative waitress. Despite her indifference, cruelty, and repeated betrayals, Philip becomes emotionally enslaved by his obsession with her.\n\nAs the narrative unfolds, Mildred alternates between using Philip for financial and emotional support and abandoning him for other men. Each return leaves him more broken, yet unable to sever ties with her destructive influence. Philip’s journey through humiliation, heartbreak, and poverty highlights the novel’s central theme: human beings bound by passion, weakness, and their own self-destructive choices.\n\nThe turning point comes as Mildred’s life deteriorates due to illness and destitution. Philip, after years of torment, finally finds strength to move beyond his obsession and chooses a healthier, more hopeful path. This resolution affirms the possibility of personal freedom, even after deep suffering and bondage of the soul.\n\nCast and Crew:\n• Director: John Cromwell\n• Producer: Pandro S. Berman\n• Screenplay: Lester Cohen (adaptation), based on the novel by W. Somerset Maugham\n• Cinematography: Henry W. Gerrard\n• Editing: William Morgan\n• Music: Max Steiner (uncredited, themes)\n\nStarring:\n• Leslie Howard as Philip Carey\n• Bette Davis as Mildred Rogers\n• Kay Johnson as Norah Nesbit\n• Reginald Denny as Griffiths\n• Alan Hale as Emil Miller\n• Frances Dee as Sally Athelny\n• Reginald Owen as Thorpe Athelny\n• Laura Hope Crews as Mrs. Carey\n• Tempe Pigott as Mrs. Athelny\n\nFilm Significance:\n“Of Human Bondage” was groundbreaking for its frank portrayal of destructive love and emotional dependency, shocking audiences of the 1930s with its raw intensity. Bette Davis’s fearless performance — including scenes where she appeared deliberately unattractive — earned widespread acclaim, even though she was controversially snubbed for an Academy Award nomination. Leslie Howard’s sensitive portrayal of Philip Carey added depth to this adaptation, making it one of the most memorable dramas of the pre-Code era.\n\nToday, the film is valued not only for its performances but also as an example of Hollywood’s transition toward more psychological and character-driven storytelling. Its restoration and colorization allow modern audiences to connect with the story’s emotional power while experiencing the artistry of 1930s cinema in a fresh and vivid format.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Of Human Bondage remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1934 release was originally black and white, typical of the pre-Code Hollywood era. While historically authentic, black-and-white cinematography can distance modern audiences. By offering a colorized edition, we preserve the emotional depth of the story while making it visually engaging for contemporary viewers. This approach bridges the gap between historical preservation and present-day viewing habits, ensuring that Bette Davis’s landmark performance continues to resonate with new generations.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#OfHumanBondage #BetteDavis #LeslieHoward #ClassicDrama #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #PreCodeHollywood #Film",
      "addedAt": "2025-12-24T00:48:24.929Z",
      "thumbnail": "https://i.ytimg.com/vi/VFFAHGDhv30/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYTiBKKGUwDw==&rs=AOn4CLAiA7rcuTRzq68cAj50cV4zwjfH0A",
      "duration": 4868,
      "language": "en",
      "year": 1934,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4PXo8QFG5F0",
      "id": "4PXo8QFG5F0",
      "title": "Of Human Bondage (1934), with Bette Davis",
      "addedAt": "2025-12-24T00:56:31.527Z",
      "thumbnail": "https://i.ytimg.com/vi/4PXo8QFG5F0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCaPatnKE0vtfnoInUX7oYWS5Otkg",
      "duration": 4967,
      "language": "en",
      "year": 1934,
      "channelName": "Public Domain Movies - Classic Old Movies",
      "channelId": "UCT6gOjzXtqeb_oE-wZVHlFA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hQQDMVOsR74",
      "id": "hQQDMVOsR74",
      "title": "Of Human Bondage (1934) BETTE DAVIS",
      "description": "Stars: Bette Davis, Leslie Howard, Frances Dee \nDirector: John Cromwell\nWriter: W. Somerset Maugham (Novel)\n\nIn this Pre-Code Hollywood melodrama, a young man's quest to win the love of a cold-hearted waitress may ultimately destroy them both. Widely regarded as the film that made Bette Davis a star!",
      "addedAt": "2025-12-26T23:44:51.104Z",
      "thumbnail": "https://i.ytimg.com/vi/hQQDMVOsR74/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLCODkQ6ImVSXKpICmoie5eWctIVsg",
      "duration": 4928,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "83 min",
    "imdbRating": 7,
    "imdbVotes": 8650,
    "Genre": "Drama, Film-Noir, Romance",
    "Plot": "Abandoning artistic ambitions, sensitive and club-footed Philip Carey enrolls in medical school and falls in love with a waitress Mildred Rogers. She rejects him, runs off with a salesman and returns unmarried and pregnant. Philip gets her an apartment and they become engaged. Mildred runs off with another medical student. Philip takes her back again when she returns with her baby. She wrecks his apartment and burns the securities he needs to pay tuition. He gets a job as a salesman, has surgery on his foot, receives an inheritance, and returns to school where he learns Mildred is dying.",
    "Director": "John Cromwell",
    "Writer": "Lester Cohen, W. Somerset Maugham, Ann Coleman",
    "Actors": "Bette Davis, Leslie Howard, Frances Dee",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0027331",
    "tt0029855",
    "tt0039305",
    "tt0031602",
    "tt0035360",
    "tt0026104",
    "tt0027893",
    "tt0022628",
    "tt0025178",
    "tt0025016",
    "tt0037865",
    "tt0038988"
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.901Z"
}