{
  "imdbId": "tt0000828",
  "title": "Confidence",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Confidence_201404",
      "title": "\"Confidence\" (1909) starring Florence Lawrence and Arthur V. Johnson",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"Confidence\" is a short drama. The film is included in our program to illustrate the work of three of our stars: actress Florence Lawrence, actor Arthur Johnson and cinematographer Billy Bitzer. A young woman escapes from her troubled life in a bar to become a nurse. Two years later she is happily married when someone from her past recognizes her and starts a repeated blackmail for money. Her husband (Arthur Johnson) eventually finds out about her predicament and has a choice to make: either reject his wife or throw away the blackmailer. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Florence Lawrence, Arthur V. Johnson Distributed by                   Biograph Company Release date                      April 15, 1909 Country                             United States Running time                    12 m Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 154043584,
      "id": "Confidence_201404"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-confidence",
      "title": "Confidence",
      "fileSize": 153636987,
      "id": "silent-confidence"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.3,
    "imdbVotes": 114,
    "Genre": "Short, Drama",
    "Plot": "A beautiful romance of a girl from the Golden West. Confidence is the flower grown from the seed of true friendship, watered by the tears of adversity, and often assailed by the blight of calumny. For as Shakespeare says', \"be thou as chaste as ice, as pure as snow, thou shalt not escape calumny.\" So it was with little Nellie Burton, the orphan girl of the rancho, who budding into womanhood, realizes her position and appreciates the low brutal character of the habitués of the Dive, even discerning the true nature of her fancied sweetheart, Jim Colt, who was to say the least an unconscionable villain. Tiring of her present environments she decides to leave the place seek a nobler and higher life. To this end she makes her way eastward and applies for a position as nurse at a New York hospital, and we next find her engaged in that work of mercy \"ministering to the sick.\" Her mild manners and pure nature impress the head surgeon, a man of eminence in his profession, to such an extent that he finds himself deeply in love with this poor self-sacrificing girl. He proposes marriage, which she at first mildly declines, but he at length persuades her, and they are married. However, there must come a cloud, and this is in the shape of her girlhood sweetheart, Colt, who has migrated East, and living on his wits. He runs across Nellie in the company with her husband as she enters her own home. The low conniving nature at once asserts itself and he plans a scheme of blackmail, using as capital her pure innocent love letters. Waiting a favorable opportunity, Jim Colt \"visits'' her and with a threat of showing these letters to her husband he extorts money from her. This gone he comes for more, and as she has no ready cash he takes her jewels. The money raised on these goes the same way, so he calls to make another demand. This the poor helpless girl finds unable to meet, and during their argument the surgeon enters. Colt then hands the missives over to the husband who, taking the packet throws them into the tire and has Colt forcibly ejected from the place, with the positive injunction never to return.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Florence Lawrence, Charles Inslee, Arthur V. Johnson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001016",
      "title": "Resurrection",
      "year": 1909,
      "imdbRating": 5.1,
      "imdbVotes": 152,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001088",
      "title": "The Way of Man",
      "year": 1909,
      "imdbRating": 5,
      "imdbVotes": 78,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000785",
      "title": "Where the Breakers Roar",
      "year": 1908,
      "imdbRating": 5.2,
      "imdbVotes": 65,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001032",
      "title": "The Sealed Room",
      "year": 1909,
      "imdbRating": 6,
      "imdbVotes": 985,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000852",
      "title": "A Drunkard's Reformation",
      "year": 1909,
      "imdbRating": 5.7,
      "imdbVotes": 261,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001050",
      "title": "A Strange Meeting",
      "year": 1909,
      "imdbRating": 4.9,
      "imdbVotes": 90,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000797",
      "title": "At the Altar",
      "year": 1909,
      "imdbRating": 5.4,
      "imdbVotes": 177,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000854",
      "title": "Edgar Allan Poe",
      "year": 1909,
      "imdbRating": 5.9,
      "imdbVotes": 573,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000986",
      "title": "Nursing a Viper",
      "year": 1909,
      "imdbRating": 5,
      "imdbVotes": 120,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000880",
      "title": "The Girls and Daddy",
      "year": 1909,
      "imdbRating": 5.8,
      "imdbVotes": 90,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000800",
      "title": "The Awakening",
      "year": 1909,
      "imdbRating": 5.3,
      "imdbVotes": 115,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000821",
      "title": "The Cardinal's Conspiracy",
      "year": 1909,
      "imdbRating": 4.7,
      "imdbVotes": 125,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}