{
  "imdbId": "tt0034825",
  "title": "Halfway to Shanghai",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/halfway-to-shanghai-1942",
      "id": "halfway-to-shanghai-1942",
      "title": "Halfway To Shanghai (1942)",
      "description": "Kent Taylor, George Zucco",
      "fileSize": 1834572950,
      "addedAt": "2026-01-07T00:08:39.343Z",
      "thumbnail": "https://archive.org/services/img/halfway-to-shanghai-1942",
      "collection": "feature_films",
      "downloads": 634
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": 6.3,
    "imdbVotes": 73,
    "Genre": "Adventure, Mystery",
    "Plot": "Since the film credit frames and pressbooks were often finished before the film was completed there was quite often data shown there that didn't match what was often seen or heard in the film, especially when players were replaced during production, or character names were changed, for whatever reasons, during production. This film contains many character names on the cast and pressbook credits that were not the character names used in the film. The film itself concerns a train hurtling through the night toward Rangoon (which must be half-way to Shanghai from some point) and the efforts of two Nazi agents to acquire a map showing the location of Chinese Army munitions buried at the terminus of the Burma Road. Kent Taylor and Irene Hervey are lovers reunited after a two year period in which she thought he was dead and, other than Taylor getting knocked on the head when George Zucco murders the man carrying the munitions map, have little to do with the plots and counterplots taking place on the train. A somewhat mousey secretary, played by Fay Helm, brings the culprits to justice at the end.",
    "Director": "John Rawlins",
    "Writer": "Stuart Palmer",
    "Actors": "Kent Taylor, Irene Hervey, Henry Stephenson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035070",
    "tt0034537",
    "tt0033924",
    "tt0035318",
    "tt0033509",
    "tt0033903",
    "tt0033930",
    "tt0034081",
    "tt0036529",
    "tt0018867",
    "tt0036439",
    "tt0033574"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.343Z"
}