{
  "imdbId": "tt0053944",
  "title": "The Incredible Petrified World",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheIncrediblePetrifiedWorld",
      "id": "TheIncrediblePetrifiedWorld",
      "title": "The Incredible Petrified World",
      "description": "It's supposed to be cutting edge science: a diving bell that can descend the depths of the ocean. However, when a cable snaps, the crew fears that they may perish inside. After the crew leaves the bell to explore, they soon find a large network of caves and a survivor who has been there for over a decade. The survivor reveals the horrible truth: there is no way to get out of the caves. Or is there a way? You can find more information regarding this film on its IMDb page .",
      "fileSize": 2575512616,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheIncrediblePetrifiedWorld",
      "language": "English",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 154612
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UbIA9X3X2xo",
      "id": "UbIA9X3X2xo",
      "title": "The Incredible Petrified World (1959) | Colorized Public Domain Sci-Fi Adventure with John Carradine",
      "description": "The Incredible Petrified World (1959) is an American science fiction adventure film directed by Jerry Warren. Featuring John Carradine, Phyllis Coates, and Robert Clarke, this restored and colorized edition revives a cult B-movie from the late 1950s — an era defined by low-budget sci-fi films that blended imagination, danger, and campy charm. By enhancing this public domain classic in modern color, we allow today’s viewers in the United States, Europe, and worldwide to rediscover its unique place in Cold War-era cinema history.\n\nPlot Summary:\nThe film follows a daring undersea expedition led by Professor Millard Wyman (John Carradine), who sends a group of explorers deep into the ocean aboard an experimental diving bell. The team — including Craig Randall (Robert Clarke), Dale Marshall (Phyllis Coates), and Paul Whitmore (Allen Windsor) — descends into the ocean depths on a mission of discovery. However, when disaster strikes, the diving bell malfunctions and the crew becomes stranded far beneath the surface. Instead of perishing, they find themselves inside a strange network of underground caverns filled with air, allowing them to survive.\n\nInside this eerie subterranean world, the group discovers the remnants of previous castaways, including a hermit-like survivor who has lived in isolation for years. As tensions mount between survival and hopelessness, the explorers must contend with their dwindling resources, their fear of being trapped forever, and the psychological toll of isolation. While the film avoids monster-driven spectacle typical of the 1950s sci-fi genre, it instead delivers suspense through atmosphere, human drama, and the unsettling vastness of an unknown underground world.\n\nCast and Crew:\n• Director: Jerry Warren\n• Producer: Jerry Warren\n• Screenplay: John W. Steiner\n• Music: Gordon Zahler (stock)\n• Cinematography: William Troiano\n\nStarring:\n• John Carradine as Professor Millard Wyman\n• Phyllis Coates as Dale Marshall\n• Robert Clarke as Craig Randall\n• Allen Windsor as Paul Whitmore\n• George Skaff as Dr. Wayne\n\nFilm Significance:\nThough produced on a limited budget, The Incredible Petrified World is emblematic of late-1950s American sci-fi cinema, when studios and independent filmmakers capitalized on the public’s fascination with exploration, space, and the unknown. Director Jerry Warren became infamous for his low-budget productions, but this film has since gained cult status among fans of B-movie science fiction. It stands as a curious time capsule of the era — more focused on claustrophobic survival than action spectacle — and is remembered today as a quintessential example of how imaginative storytelling thrived even with limited resources.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Incredible Petrified World remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1959 release was filmed in black and white, consistent with the budget-conscious production standards of its era. While historically authentic, black-and-white presentation can be a barrier to modern audiences. By offering this colorized version, we bring renewed visual depth to the underwater and cavern sequences, making the adventure more vivid and immersive for today’s viewers. This edition bridges the gap between historical preservation and contemporary entertainment.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheIncrediblePetrifiedWorld #JohnCarradine #PhyllisCoates #RobertClarke #1950sSciFi #PublicDomainMovie #ColorizedClassic #CultBMovie #ClassicScienceFiction #FilmRestoration #JerryWarren #1959Movies #SciFiAdventure",
      "addedAt": "2025-12-24T00:48:19.705Z",
      "thumbnail": "https://i.ytimg.com/vi/UbIA9X3X2xo/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBXKFQwDw==&rs=AOn4CLCn-ECnePDQZDUyOzUvEXf1x0XIcg",
      "duration": 3825,
      "language": "en",
      "year": 1959,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-incredible-petrified-world-1959",
      "id": "the-incredible-petrified-world-1959",
      "title": "The Incredible Petrified World (1959)",
      "description": "When the cable breaks on their diving bell four people find themselves trapped in a hidden underwater world. Watch on RetroFlix:  https://retroflix.org/the-incredible-petrified-world-1959/",
      "fileSize": 2403660186,
      "addedAt": "2026-01-07T00:12:10.588Z",
      "thumbnail": "https://archive.org/services/img/the-incredible-petrified-world-1959",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 237
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theincrediblepetrifiedworld1959",
      "id": "theincrediblepetrifiedworld1959",
      "title": "THE INCREDIBLE PETRIFIED WORLD (1959)",
      "description": "Four people lowered in a scientist's (John Carradine) diving bell are trapped in an underwater cave.",
      "fileSize": 1203185214,
      "addedAt": "2026-01-07T00:12:44.281Z",
      "thumbnail": "https://archive.org/services/img/theincrediblepetrifiedworld1959",
      "collection": "feature_films",
      "downloads": 4020
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_M9nr0T-TUY",
      "id": "_M9nr0T-TUY",
      "title": "The Incredible Petrified World (1960) JOHN CARRADINE",
      "description": "Stars: John Carradine, Robert Clarke, Phyllis Coates \nDirector: Jerry Warren\n\nFour adventurers descend to the depths of the ocean when the cable on their underwater diving bell snaps. The rest of their expedition, believing them to be lost, abandons hope of finding them. NOTE: the film was produced in 1957, but not theatrically released until April 1960.",
      "addedAt": "2025-12-26T23:52:35.955Z",
      "thumbnail": "https://i.ytimg.com/vi/_M9nr0T-TUY/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCrcPZCJA0QXFEEi4PDMmKMV6tLgQ",
      "duration": 3797,
      "language": "en",
      "year": 1960,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": 3.1,
    "imdbVotes": 1349,
    "Genre": "Action, Adventure, Sci-Fi",
    "Plot": "Four adventurers descend to the depths of the ocean when the cable on their underwater diving bell snaps. The rest of their expedition, believing them to be lost, abandons hope of finding them. Exiting the diving bell, the party finds themselves in a network of underwater caverns. They encounter a shipwreck survivor. He tells them he has been there for 14 years and that there is no way out. The two men in the exploring party believe him only after a hike to a volcanic vent that supplies the caverns with oxygen. On the surface, Prof. Millard Wyman, the elder scientist who designed the original diving bell, decides to try again to explore the depths of the ocean. He finds out that there is another diving bell in existence that is identical to the one that was lost...",
    "Director": "Jerry Warren",
    "Writer": "John W. Steiner",
    "Actors": "John Carradine, Robert Clarke, Phyllis Coates",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0055294",
    "tt0052702",
    "tt0051064",
    "tt0050497",
    "tt0006333",
    "tt0039218",
    "tt0052604",
    "tt0036697",
    "tt0052538",
    "tt0481509",
    "tt0059346",
    "tt0079501"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.281Z"
}