{
  "imdbId": "tt0013450",
  "title": "Oliver Twist",
  "year": 1922,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a3Io9WLDkDc",
      "title": "Oliver Twist (1922) | Colorized Public Domain Silent Classic with Jackie Coogan and Lon Chaney",
      "description": "Oliver Twist (1922) is a silent drama film adaptation of Charles Dickens’ timeless novel, directed by Frank Lloyd and produced during the early Golden Age of cinema. This restored and colorized public domain edition brings new vibrancy to one of the most important surviving silent films, offering audiences in the United States, Europe, and worldwide a fresh way to rediscover Dickens’ classic story. Featuring Jackie Coogan as Oliver and Lon Chaney as the sinister Fagin, this version is both historically significant and emotionally powerful.\n\nPlot Summary:\nSet in 19th-century England, Oliver Twist (Jackie Coogan) is a poor orphan born in a workhouse who grows up facing cruelty, neglect, and exploitation. After escaping harsh treatment, he falls into the clutches of Fagin (Lon Chaney), a manipulative criminal who trains children to become pickpockets. Caught between the innocence of his own heart and the corruption of the world around him, Oliver struggles to find safety, kindness, and belonging. His fate takes a turn when Mr. Brownlow (Tully Marshall), a wealthy gentleman, offers him protection, but Fagin and his ruthless accomplices are unwilling to let Oliver go.\n\nThis adaptation is notable for its emotional intensity and the performances of its two leads: Jackie Coogan, one of the greatest child actors of the silent era, and Lon Chaney, known as “The Man of a Thousand Faces,” who delivers one of his most unforgettable portrayals as the sinister Fagin. The film’s visual storytelling, strong performances, and faithful treatment of Dickens’ narrative made it a landmark production in early cinema.\n\nCast and Crew:\n• Director: Frank Lloyd\n• Based on: Oliver Twist by Charles Dickens (1838)\n• Cinematography: Norbert Brodine\n• Editing: Charles J. Hunt\n\nStarring:\n• Jackie Coogan as Oliver Twist\n• Lon Chaney as Fagin\n• Gladys Brockwell as Nancy\n• Estelle Taylor as Rose Maylie\n• George Siegmann as Bill Sikes\n• Tully Marshall as Mr. Brownlow\n• Lionel Belmore as Mr. Bumble\n• Aggie Herring as Mrs. Corney\n\nFilm Significance:\nThis 1922 production is among the most famous silent film versions of Oliver Twist. Released by First National Pictures, it solidified Jackie Coogan’s reputation following his success in Charlie Chaplin’s The Kid (1921) and demonstrated Lon Chaney’s unmatched ability to embody complex villains. Though many silent films have been lost, this version survives and is celebrated for its faithful Dickensian atmosphere, its powerful performances, and its contribution to the legacy of literary adaptations in Hollywood.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Oliver Twist (1922) remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white or silent cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1922 release was a silent, black-and-white production. While historically authentic, many modern audiences skip silent films due to perceived distance in style and pacing. By offering a colorized edition, we bridge the gap between historical preservation and modern accessibility, making Dickens’ powerful story more appealing to new viewers while maintaining respect for its legacy.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten silent dramas to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#OliverTwist #LonChaney #JackieCoogan #SilentFilm #PublicDomainMovie #ColorizedClassic #ClassicCinema #CharlesDickens #FilmRestoration #1920sMovies #SilentDrama",
      "id": "a3Io9WLDkDc",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "98 min",
    "imdbRating": "6.6",
    "imdbVotes": "956",
    "Genre": "Drama",
    "Plot": "Oliver's mother, a penniless outcast, died giving birth to him. As a young boy Oliver is brought up in a workhouse, later apprenticed to an uncaring undertaker, and eventually is taken in by a gang of thieves who befriend him for their own purposes. All the while, there are secrets from Oliver's family history waiting to come to light.",
    "Director": "Frank Lloyd",
    "Writer": "Charles Dickens, Frank Lloyd, Harry Weil",
    "Actors": "Jackie Coogan, James A. Marcus, Aggie Herring",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "2 wins"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0013841",
      "title": "Ashes of Vengeance",
      "year": 1923,
      "imdbRating": "6.7",
      "imdbVotes": "68",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010859",
      "title": "A Tale of Two Worlds",
      "year": 1921,
      "imdbRating": "5.8",
      "imdbVotes": "52",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014721",
      "title": "Black Oxen",
      "year": 1923,
      "imdbRating": "5.8",
      "imdbVotes": "248",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015310",
      "title": "The Sea Hawk",
      "year": 1924,
      "imdbRating": "7.1",
      "imdbVotes": "668",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010920",
      "title": "The World and Its Woman",
      "year": 1919,
      "imdbRating": "6.2",
      "imdbVotes": "32",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037547",
      "title": "Blood on the Sun",
      "year": 1945,
      "imdbRating": "6.0",
      "imdbVotes": "2,330",
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024139",
      "title": "Hoopla",
      "year": 1933,
      "imdbRating": "6.6",
      "imdbVotes": "304",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023323",
      "title": "A Passport to Hell",
      "year": 1932,
      "imdbRating": "6.6",
      "imdbVotes": "124",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026752",
      "title": "Mutiny on the Bounty",
      "year": 1935,
      "imdbRating": "7.6",
      "imdbVotes": "25,741",
      "language": "English, Polynesian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019557",
      "title": "Weary River",
      "year": 1929,
      "imdbRating": "6.1",
      "imdbVotes": "527",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0019824",
      "title": "The Divine Lady",
      "year": 1928,
      "imdbRating": "6.2",
      "imdbVotes": "957",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047475",
      "title": "The Shanghai Story",
      "year": 1954,
      "imdbRating": "5.8",
      "imdbVotes": "225",
      "language": "English, Chinese",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T14:25:20.516Z"
}