{
  "imdbId": "tt0004395",
  "title": "The New Janitor",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-new-janitor",
      "id": "silent-the-new-janitor",
      "title": "The New Janitor",
      "fileSize": 201594984,
      "addedAt": "2026-01-07T00:11:15.978Z",
      "thumbnail": "https://archive.org/services/img/silent-the-new-janitor",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 588
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-new-janitor-1914",
      "id": "the-new-janitor-1914",
      "title": "The New Janitor (1914)",
      "description": "The New Janitor was the 27th comedy from Keystone Studios to feature Charlie Chaplin. The film is arguably one of his best for the studio, and a precursor to a key Essanay Studios short, The Bank. The film also demonstrates the differences that Chaplin had with Keystone comedy in that it is a coherent whole in which the stock characters actually fill some emotional center. Chaplin brings a certain complexity to his janitor, unusual to the comedy factory of Mack Sennett. The film, which stars among Sennett’s bit players Jess Dandy, Al St. John, John T. Dillon, and Helen Carruthers, is far more centered and clear in direction. Comedy mostly flows from the core of the story instead of being a by-product of it. After all this is a typical bank robbery storyline. Watch on RetroFlix.org:   https://retroflix.org/the-new-janitor-1914/",
      "fileSize": 111644644,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-new-janitor-1914",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 201
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-new-janitor-1914-directed-by-charlie-chaplin",
      "id": "the-new-janitor-1914-directed-by-charlie-chaplin",
      "title": "The New Janitor (1914) Directed By Charlie Chaplin",
      "description": "The New Janitor Scene with Dillon and Chaplin Directed by Charlie Chaplin Produced by Mack Sennett Starring Charlie Chaplin Jess Dandy John T. Dillon Al St. John Cinematography Frank D. Williams Production company Keystone Studios Distributed by Mutual Film Release date September 24, 1914 Running time 16 minutes Country United States Languages Silent film English (Intertitles) The New Janitor was the 27th comedy from Keystone Studios to feature Charlie Chaplin . [ 1 ] The film is arguably one of his best for the studio, and a precursor to a key Essanay Studios short, The Bank . The film also demonstrates the differences that Chaplin had with Keystone comedy in that it is a coherent whole in which the stock characters actually fill some emotional center. Chaplin brings a certain complexity to his janitor, unusual to the comedy factory of Mack Sennett . The film, which stars among Sennett's bit players Jess Dandy , Al St. John , John T. Dillon , and Helen Carruthers , is far more centered and clear in direction. Comedy mostly flows from the core of the story instead of being a by-product of it. After all this is a typical bank robbery storyline. Plot The Tramp , a janitor in this film, is fired from work for accidentally knocking his bucket of water out of the window and onto his boss, the chief banker (Dandy). Meanwhile, one of the junior managers (Dillon) is being threatened with exposure by his bookie for his unpaid gambling debts, and thus decides to steal from the company. He is caught in the act of raiding the vault by the bank secretary (Carruthers), who is threatened with a gun and therefore presses the janitor button for help. The Tramp comes to the rescue and gets hold of the manager’s gun, only to be misjudged by the chief banker and a policeman as the thief. The secretary explains the truth to the chief banker. In the end the manager is arrested and the Tramp is rewarded by the chief banker for his heroic act. Reception Moving Picture World commented, \"...A ripping good comedy number with Chas. Champman [sic] playing the part of the janitor. He interpolates a lot of his inimitable funny business and the plot is better than usual.\" Motion Picture News also got Chaplin's surname wrong in its review: \"The comical Charles Chapman [sic] in a laughable farce that will arouse peals of laughter from any audience.\" Cast Charlie Chaplin – Janitor Jess Dandy – Bank president John T. Dillon – Villainous manager Al St. John – Elevator boy Helen Carruthers – Bank secretary References 1 Walker, Brent E. (2010). Mack Sennett's Fun Factory: A History and Filmography of His Studio and His Keystone and Mack Sennett Comedies, with Biographies of Players and Personnel . McFarland Inc. p. 301. ISBN   9780786457076 . Retrieved 20 February 2024 . From Wikipedia, the free encyclopedia",
      "fileSize": 55152194,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-new-janitor-1914-directed-by-charlie-chaplin",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 138
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": 6.1,
    "imdbVotes": 1218,
    "Genre": "Short, Comedy",
    "Plot": "Charlie is janitor for a firm the manager of which receives a threatening note about his gambling debts. He throws a bucket of water out the window which lands on his boss and costs him his job. The boss, attempting to steal the money heeds from the office safe, is caught by his secretary and Charlie comes to save her and the money. He is briefly accused of being the thief but ultimately triumphs.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, John T. Dillon, Al St. John",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0003923",
    "tt0004311",
    "tt0004546",
    "tt0003863",
    "tt0004108",
    "tt0004011",
    "tt0004102",
    "tt0004101",
    "tt0003760",
    "tt0004007",
    "tt0004100",
    "tt0004210"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}