{
  "imdbId": "tt0020217",
  "title": "New York Nights",
  "year": 1929,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FXx9SOo6RDw",
      "id": "FXx9SOo6RDw",
      "title": "New York Nights (1929) NORMA TALMADGE🍕 GILBERT ROLAND",
      "description": "It's Friday @PizzaFLIX \nDirector: Lewis Milestone\nStars: Norma Talmadge, Gilbert Roland, Lilyan Tashman\n\nImmerse yourself in the seductive world of Prohibition-era nightlife with this rare treasure, directed by Academy Award-winning filmmaker Lewis Milestone. Adapted from the stage play Tin Pan Alley, this gripping pre-Code drama captures the tension between love, ambition, and survival in a city that never sleeps.\n\nSilent screen legend Norma Talmadge stars as a chorus girl caught between passion and the harsh realities of making her way in New York. Her loyalty is tested by the struggles of her husband, played by Hollywood heartthrob Gilbert Roland, a struggling songwriter determined to succeed. Their lives are further complicated by John Wray, delivering a standout performance as a ruthless racketeer and nightclub owner whose tough exterior hides a surprising soft spot for Norma’s character.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nWith richly drawn characters and the stylish direction of Lewis Milestone, this early sound feature blends romance, music, and danger into a compelling portrait of Jazz Age glamour and grit. A must for fans of pre-Code cinema, classic Hollywood drama, and the unforgettable talents of Norma Talmadge, Gilbert Roland, and John Wray.\n\n#NewYorkNights #LewisMilestone #NormaTalmadge #GilbertRoland #JohnWray #Lilyan Tashman #ChorusGirls #Pre-code Hollywood #PizzaFLIX #JazzAge #GoldenAgeOfHollywood",
      "addedAt": "2025-12-24T01:03:31.047Z",
      "thumbnail": "https://i.ytimg.com/vi/FXx9SOo6RDw/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDYJwiQh2v-1_84c_n2GFUkIm0JFA",
      "duration": 3876,
      "language": "en",
      "year": 1929,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "82 min",
    "imdbRating": 5.5,
    "imdbVotes": 276,
    "Genre": "Crime, Drama, Music",
    "Plot": "Chorus girl Jill and composer Fred are happily married until he steps out on her with another woman. Tired of his ongoing alcoholism and heartbroken, Jill decides to leave him and live it up, though she must contend with the unwanted advances of a notorious gangster who will stop at nothing to make her his mistress. And when she considers taking Fred back, matters could get deadly fast.",
    "Director": "Lewis Milestone",
    "Writer": "Hugh Stanislaus Stange, Jules Furthman",
    "Actors": "Norma Talmadge, Gilbert Roland, John Wray",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019304",
    "tt0021890",
    "tt0020810",
    "tt0019096",
    "tt0020629",
    "tt0044788",
    "tt0024416",
    "tt0054817",
    "tt0041109",
    "tt0019765",
    "tt0019979",
    "tt0031668"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:40.908Z"
}