{
  "imdbId": "tt0025499",
  "title": "Midnight",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/m45456482",
      "id": "m45456482",
      "title": "Midnight",
      "description": "Title: Midnight Summary: The foreman of a jury asks questions that send a woman to the electric chair for a murder committed in the heat of passion. On the night of the execution, his actions come back to haunt him. Directed by: Chester Erskine Actors: Humphrey Bogart, Sidney Fox, O.P. Heggie Production Company: All Star Productions Release Date: 7 March 1934 (USA) Aspect Ratio: 1.37 : 1 The foreman of a jury asks questions that send a woman to the electric chair for a murder committed in the heat of passion. On the night of the execution, his actions come back to haunt him.",
      "fileSize": 573047011,
      "addedAt": "2026-01-07T00:09:46.420Z",
      "thumbnail": "https://archive.org/services/img/m45456482",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 2183
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6IrSrfoLnBk",
      "id": "6IrSrfoLnBk",
      "title": "Midnight (1934) | Colorized Public Domain Classic Courtroom Crime Drama | Sidney Fox and O.P. Heggie",
      "description": "Midnight (1934), also released under the title Call It Murder, is a pre-Code courtroom crime drama directed by Chester Erskine. This public domain classic stars Sidney Fox, O.P. Heggie, and Henry Hull, with Humphrey Bogart in one of his earliest credited roles. The story explores justice, morality, and hypocrisy within the legal system, centering on a juror whose strict sense of duty collides with his own family’s tragic entanglement in crime. Restored and colorized, this edition allows modern audiences in the United States, Europe, and worldwide to experience a forgotten yet historically significant drama from Hollywood’s early sound era.\n\nPlot Summary:\nThe film begins with jury foreman Edward Weldon (O.P. Heggie) presiding over a sensational murder trial. The defendant, Ethel Saxon (Helen Flint), is accused of killing her wealthy lover. Weldon insists on a guilty verdict, believing that the law must be applied without sympathy. As a result, Ethel is sentenced to death and executed in the electric chair, despite public outcry.\n\nWeldon’s rigid moral code soon faces a devastating test when his own daughter Stella (Sidney Fox) becomes embroiled in scandal. Stella’s secret relationship with a married man, Michael (Humphrey Bogart), leads to a violent confrontation that ends in tragedy. Suddenly, the same principles of justice Weldon once upheld are turned inward against his own family.\n\nThe story builds to a tense climax as Weldon wrestles with his conscience, torn between his devotion to the law and his love for his daughter. His earlier moral certainty unravels as the hypocrisy and limitations of absolute justice are laid bare.\n\nCast and Crew:\n• Director: Chester Erskine\n• Producer: Chester Erskine (uncredited)\n• Screenplay: Chester Erskine, Arthur Hoerl\n• Based on: Juror Number Four (play) by Dawn Powell\n• Cinematography: Leo Rossi\n• Editing: Charles Craft\n\nStarring:\n• Sidney Fox as Stella Weldon\n• O.P. Heggie as Edward Weldon\n• Henry Hull as District Attorney Plunkett\n• Margaret Wycherly as Mrs. Weldon\n• Lynne Overman as Joe Biggers\n• Granville Bates as Mr. Rubens\n• Helen Flint as Ethel Saxon\n• Katherine Wilson as Elizabeth Weldon\n• Humphrey Bogart as Michael (early credited role)\n\nFilm Significance:\nMidnight is a remarkable example of pre-Code Hollywood for its frank depiction of capital punishment, social judgment, and the double standards of morality. Humphrey Bogart’s appearance — though not yet a star — adds historical value, as this film foreshadows his rise in crime and noir cinema of the 1940s.\n\nThe movie also carries weight as an early courtroom drama, a genre that would later dominate both film and television. By examining the flaws in justice and the pressures of public morality, it offers a window into Depression-era American anxieties. Its restoration and colorization preserve both its cultural impact and cinematic artistry for contemporary audiences.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Midnight remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nWhen originally released in 1934, Midnight was filmed in stark black and white, emphasizing its courtroom realism but limiting its reach to modern audiences. By presenting a colorized edition, we retain the film’s dramatic power while making it visually engaging for today’s viewers. This ensures that Sidney Fox’s emotional performance, O.P. Heggie’s moral dilemma, and Humphrey Bogart’s early role remain impactful and relevant.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Midnight1934 #CallItMurder #SidneyFox #OPHeggie #HumphreyBogart #CourtroomDrama #PublicDomainMovie #ColorizedClassic #PreCodeHollywood #FilmRestoration",
      "addedAt": "2025-12-24T00:48:25.739Z",
      "thumbnail": "https://i.ytimg.com/vi/6IrSrfoLnBk/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYSSBZKGUwDw==&rs=AOn4CLAcmJMObrQAfx62QgcsvEuu0taUbA",
      "duration": 4318,
      "language": "en",
      "year": 1934,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "76 min",
    "imdbRating": 5.5,
    "imdbVotes": 1273,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "The foreman of a jury asks questions that send a woman to the electric chair for a murder committed in the heat of passion. On the night of the execution, his actions come back to haunt him.",
    "Director": "Chester Erskine",
    "Writer": "Paul Sifton, Claire Sifton, Chester Erskine",
    "Actors": "Humphrey Bogart, Sidney Fox, O.P. Heggie",
    "Language": "English, Latin",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026416",
    "tt0027697",
    "tt0028004",
    "tt0023520",
    "tt0023042",
    "tt0028433",
    "tt0039305",
    "tt0041555",
    "tt0041967",
    "tt0047985",
    "tt0021750",
    "tt0030266"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.420Z"
}