{
  "imdbId": "tt0011841",
  "title": "Way Down East",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WayDownEast",
      "id": "WayDownEast",
      "title": "Way Down East",
      "description": "One of D.W Griffith's better films. It is particularly noteworthy for the great scene of the rescue from the ice at the end of the film. 1920 It is a silent.",
      "fileSize": 121986847,
      "addedAt": "2026-01-07T00:07:11.888Z",
      "thumbnail": "https://archive.org/services/img/WayDownEast",
      "collection": "feature_films",
      "downloads": 5463
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WayDownEast_201312",
      "id": "WayDownEast_201312",
      "title": "\"Way Down East\" (1920) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Way Down East\" (1920) is a poignant drama. This film illustrates the work of cinematographer Billy Bitzer, a star of Silent Hall of Fame. Directed by               D. W. Griffith Produced by             D. W. Griffith Scenario by               Anthony Paul Kelly           Based on                    Way Down East by Lottie Blair Parker Starring                     Lillian Gish, Richard Barthelmess Cinematography        Billy Bitzer Editing by                  James Smith and Rose Smith Distributed by           United Artists Release date               September 3, 1920 Running time             123 min Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 1915547306,
      "addedAt": "2026-01-07T00:07:11.888Z",
      "thumbnail": "https://archive.org/services/img/WayDownEast_201312",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 19267
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "145 min",
    "imdbRating": 7.3,
    "imdbVotes": 6016,
    "Genre": "Drama, Romance",
    "Plot": "The callous rich, portrayed by Lennox, think only of their own pleasure. Anna is but a poor country girl whom Lennox tricks into a fake wedding. She believes that it is true, but secret, while he has his way with her. When she is pregnant, he leaves her and she must have the baby, named Trust Lennox, on her own. When the baby dies she wanders until she gets a job with Squire Bartlett. David falls for her, but she rejects him due to her past and then Lennox shows up lusting for Kate. Seeing Anna, he tries to get her to leave, but she doesn't, and she tells no one about his past. When Squire Bartlett learns of her past from Martha, the town gossip, he tosses Anna out in a snow storm. But before she goes, she fingers the respected Lennox, as the father of her dead baby and the spoiler of herself.",
    "Director": "D.W. Griffith",
    "Writer": "Lottie Blair Parker, William A. Brady, Joseph R. Grismer",
    "Actors": "Lillian Gish, Richard Barthelmess, Mrs. David Landau",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0009968",
    "tt0009559",
    "tt0012532",
    "tt0010806",
    "tt0012122",
    "tt0011324",
    "tt0011415",
    "tt0014604",
    "tt0010193",
    "tt0015018",
    "tt0009150",
    "tt0002795"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.888Z"
}