{
  "imdbId": "tt0038937",
  "title": "Shock",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Shock_623",
      "title": "Shock 623",
      "description": "A psychologically distraught woman is committed to a private sanitarium by the man whom she witnessed commit a murder. - IMDB Description",
      "id": "Shock_623"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Shock_MPEG2",
      "title": "Shock MPEG2",
      "description": "A woman goes into a catatonic state after witnessing a man murder his wife. The man runs a sanitarium where he has the woman committed so he can monitor her progress, learn what she saw, and take whatever actions may be necessary. Fine out more about this movie on its IMDB page .",
      "id": "Shock_MPEG2"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=45oBsqJ8MGM",
      "title": "Shock (1946) [Film Noir] [Thriller]",
      "description": "The film tells the story of a psychiatrist, Dr. Cross (Vincent Price), who is treating a young woman, Janet Stewart (Anabel Shaw), who is in a coma-state, brought on when she heard loud arguing, went to her window and saw a man strike his wife with a candlestick and kill her. It also stars Lynn Bari as Dr. Cross's nurse/lover, Elaine Jordan.\n\nAs Stewart comes out of her shock, she recognizes Dr. Cross as the killer. He then takes her to his sanitarium and at Elaine's urging, gives Janet an overdose of insulin under the pretense of administering insulin shock therapy. He can't bring himself to murder her in cold blood, though, and asks Elaine to get the medicine to save her. Elaine refuses, they argue, and he strangles her. A colleague of Dr. Cross, Dr. Harvey, saves Janet's life and Dr. Cross is taken into custody by a lawyer from the District Attorney's office.\n\n---\n\nDirected by Alfred L. Werker, produced by Aubrey Schenck, written by Eugene Ling (screenplay), Albert DeMond (story) and Martin Berkeley (dialogue), starring Vincent Price as Dr. Richard Cross, Lynn Bari as Elaine Jordan, Frank Latimore as Lt. Paul Stewart, Anabel Shaw as Janet Stewart, Stephen Dunne as Dr. Stevens, Reed Hadley as O'Neill, Renee Carson as Mrs. Hatfield and Charles Trowbridge as Dr. Franklin Harvey.\n---\n\nSource: \"Shock (1946 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 March 2013. Web. 17 March 2013. http://en.wikipedia.org/wiki/Shock_(1946_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "45oBsqJ8MGM",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2H377auu3Dw",
      "title": "Shock (1946) | Colorized Public Domain Film Noir Psychological Thriller | Vincent Price & Lynn Bari",
      "description": "Shock (1946) is an American film noir psychological thriller directed by Alfred L. Werker and produced by 20th Century Fox during the height of post-war suspense cinema. This restored and colorized edition revives a gripping story of trauma, manipulation, and moral corruption, anchored by the chilling performance of Vincent Price. Through careful restoration and colorization, Colorized Public Domain brings new intensity and modern visual depth to a film that explores the dark side of the human mind and the abuse of medical authority.\n\nPlot Summary:\nThe story follows Janet Stewart (Anabel Shaw), a young woman who arrives at a San Francisco hotel to reunite with her husband, recently returned from war. While waiting, she witnesses a shocking crime through her window—a man brutally murdering his wife. The trauma causes her to collapse into a near-catatonic state, and she is soon placed under psychiatric care. Her doctor, Dr. Richard Cross (Vincent Price), seems caring and professional—until it becomes clear he is the very murderer she saw.\n\nAs Dr. Cross and his assistant, Nurse Elaine Jordan (Lynn Bari), work to keep Janet sedated and silent, a psychological cat-and-mouse game unfolds. Cross’s guilt and obsession deepen, while Janet’s subconscious fights to bring the truth to light. The film builds tension through confined settings, moody lighting, and the creeping fear of medical power turned evil. Its themes of post-war anxiety and emotional trauma resonate with audiences even decades later.\n\nCast and Crew:\n• Director: Alfred L. Werker\n• Producer: Aubrey Schenck\n• Screenplay: Eugene Ling\n• Story: Albert DeMond\n• Cinematography: Joseph MacDonald\n• Editing: Harmon Jones\n• Music: David Raksin\n\nStarring:\n• Vincent Price as Dr. Richard Cross\n• Lynn Bari as Nurse Elaine Jordan\n• Anabel Shaw as Janet Stewart\n• Frank Latimore as Lt. Paul Stewart\n• Michael Dunne as Detective\n• Charles Trowbridge as Dr. Harvey\n• Renee Carson as Miss Hatfield\n• Claire Du Brey as Nurse\n\nFilm Significance:\nShock marked one of Vincent Price’s earliest major roles that foreshadowed his later dominance in the horror and thriller genres. Long before House of Wax and The Fly, Price demonstrated his ability to project refinement, menace, and psychological complexity simultaneously. The film’s atmosphere captures the paranoia of the 1940s—a time when psychiatry was both a fascination and a fear in American culture.\n\nAlfred L. Werker’s direction, combined with David Raksin’s suspenseful score, turns a modestly budgeted production into a tense exploration of post-war instability and suppressed violence. Its moody cinematography and ethical ambiguity make it a classic example of early film noir’s psychological branch. Shock stands as a critical link between the noir detective thrillers of the 1940s and the gothic horror films that Vincent Price would later define.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Hoosier Schoolboy remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1946 release was filmed in black and white to emphasize mood and contrast. This colorized restoration enriches the film’s visual tension—especially the sterile hospital interiors, Vincent Price’s shadowed expressions, and the haunting lighting that symbolizes moral decay. For modern audiences watching on large television screens in the United States and Europe, this version offers a cinematic experience closer to contemporary psychological thrillers while retaining the noir atmosphere that made it iconic.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Shock1946 #VincentPrice #LynnBari #FilmNoir #PsychologicalThriller #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #1940sCinema #ClassicSuspense #VincentPriceMovies #RestoredClassics #VintageHollywood",
      "id": "2H377auu3Dw",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shock",
      "title": "Shock",
      "description": "This post-World War II suspense thriller sets off an emotional roller coaster after the psychologically fragile wife of a POW (Anabel Shaw) witnesses a brutal murder from a hotel window while waiting to be reunited with her husband (Frank Latimer). By the time he arrives, she's nearly comatose with shock. The hotel's psychiatrist (Vincent Price) is called in to help Film noir classic, noted for its dark themes, stark camera angles and high-contrast lighting.",
      "id": "shock"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shock-1946",
      "title": "Shock (1946)",
      "description": "In this thriller, psychiatrist Dr. Cross kills his wife and expects to get away with murder, until he discovers that the slaying was observed by a next-door neighbor, Janet Stewart. As Janet attempts to convince her husband of the doctor's dastardly deed, Cross shows up to advise him that Janet is in dire need of some in-depth counseling. Watch on RetroFlix:  https://retroflix.org/shock-1946/",
      "id": "shock-1946"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shock1946",
      "title": "Shock (1946) Vincent Price, Lynn Bari, Frank Latimore",
      "description": "Shock is a 1946 American film noir directed by Alfred L. Werker and starring Vincent Price, Lynn Bari and Frank Latimore.   It was originally intended as a \"B\" movie but the initial audience response to the film was so positive that the studio, 20th Century Fox, chose to reissue the movie as an \"A\" despite the fact that the running time is only approximately seventy minutes.   Find out more about the movie here .",
      "id": "shock1946"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lYxNFGCHLXk",
      "title": "Shock (1946) VINCENT PRICE",
      "description": "Stars: Vincent Price, Lynn Bari, Frank Latimore\nDirector: Alfred L. Werker\n\nA psychologically distraught woman is committed to a private sanitarium by the man whom she witnessed commit a murder.",
      "id": "lYxNFGCHLXk",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q1LpMXjAL9Q",
      "title": "Shock (1946) Directed Alfred Werker | Vincent Price, Lynn Bari | Film-Noir, Thriller | Colorized",
      "description": "He never dreamed what it would all lead to...and she didn't care!\nA psychologically distraught woman is committed to a private sanitarium by the man she witnessed commit a murder.\n\nOriginal title: Shock (1946)\n\nBlack & White version : https://youtu.be/lZuHHzKdovM\n\nDirector: Alfred L. Werker\nWriters: Eugene Ling\nStars: Vincent Price, Lynn Bari, Frank Latimore \nGenre:  Classics, Cult Film,  Film-Noir, Thriller \nBudget: $375,000\n\nThis film has English, German & Spanish audio, and many subtitle options. Go to video settings ⚙️  to change your audio / subtitle languages. \n\n00:00 Full Movie\n02:53 Dream sequence\n11:33 A man's wife has suffered a nervous collapse and is taken to a private sanatorium for treatment.\n16:00 A doctor tries to help a patient suffering from amnesia recall a traumatic event.\n23:56 A doctor consults with another doctor about the patient's condition and treatment.\n33:55 A woman believes she witnessed a murder and is deemed insane by her husband and doctors.\n39:41 Mrs. Stewart is suffering from delusions and believes that the doctors and nurses at the hospital are trying to kill her.\n46:55 Dr. Cross is approached by a man from the District Attorney's office who suspects foul play in his wife's death and wants to exhume her body.\n51:24 Richard confesses to Elaine about his involvement in the murder and expresses his guilt and desire to end their deceitful actions.\n58:36 Shock treatments are being used on Janet Stewart, but she still believes she witnessed a murder and is being targeted.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "q1LpMXjAL9Q",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": "6.3",
    "imdbVotes": "3,476",
    "Genre": "Drama, Film-Noir, Thriller",
    "Plot": "Dr. Cross, a psychiatrist, is treating a young woman, Janet Stewart, who is in a catatonic state, brought on when she heard loud arguing, went to her window and saw a man strike his wife with a candlestick and kill her. As she comes out of her shock, she recognizes Dr. Cross as the killer. He takes her to his sanitarium and is urged by his nurse/lover, Elaine Jordan, to give Janet an overdose of insulin. Can he bring himself to murder Janet in cold blood?",
    "Director": "Alfred L. Werker",
    "Writer": "Eugene Ling, Albert DeMond, Martin Berkeley",
    "Actors": "Vincent Price, Lynn Bari, Frank Latimore",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0045309",
      "title": "Walk East on Beacon!",
      "year": 1952,
      "imdbRating": "5.7",
      "imdbVotes": "584",
      "language": "English, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038986",
      "title": "Strange Impersonation",
      "year": 1946,
      "imdbRating": "6.3",
      "imdbVotes": "836",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039015",
      "title": "Temptation",
      "year": 1946,
      "imdbRating": "6.5",
      "imdbVotes": "394",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037330",
      "title": "The Suspect",
      "year": 1944,
      "imdbRating": "7.3",
      "imdbVotes": "3,684",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035966",
      "title": "Hangmen Also Die!",
      "year": 1943,
      "imdbRating": "7.4",
      "imdbVotes": "7,016",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041791",
      "title": "The Red Menace",
      "year": 1949,
      "imdbRating": "5.0",
      "imdbVotes": "276",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042046",
      "title": "The Window",
      "year": 1949,
      "imdbRating": "7.4",
      "imdbVotes": "5,025",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0039581",
      "title": "The Long Night",
      "year": 1947,
      "imdbRating": "6.5",
      "imdbVotes": "2,131",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040829",
      "title": "The Amazing Mr. X",
      "year": 1948,
      "imdbRating": "6.4",
      "imdbVotes": "2,312",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038991",
      "title": "The Stranger",
      "year": 1946,
      "imdbRating": "7.3",
      "imdbVotes": "30,317",
      "language": "English, Spanish, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043938",
      "title": "The Prowler",
      "year": 1951,
      "imdbRating": "7.1",
      "imdbVotes": "4,414",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038346",
      "title": "Behind Green Lights",
      "year": 1946,
      "imdbRating": "6.4",
      "imdbVotes": "1,068",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:52:22.968Z"
}