{
  "movieId": "tt0001120",
  "title": "As It Is in Life",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AsItIsInLife1910",
      "id": "AsItIsInLife1910",
      "title": "\"As It Is in Life\" (1910) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"As It Is in Life\" is a short drama, included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame. After raising his daughter alone, a man expects in vain that she will stay with him. Directed by               D. W. Griffith Produced by             Biograph Company Scenario by                Stanner E.V. Taylor       Starring                     George Nichols, Gladys Egan, Mary Pickford, Marion Leonard, Charles West Cinematography        Billy Bitzer Distributed by           The General Film Company, Incorporated Release date               April 4, 1910 Running time             12 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 299748873,
      "addedAt": "2026-01-07T00:06:09.635Z",
      "thumbnail": "https://archive.org/services/img/AsItIsInLife1910",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 14116
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AsItIsInLife",
      "id": "AsItIsInLife",
      "title": "As It Is In Life",
      "description": "As It Is In Life is a short 1910 piece by D W Griffith starring Mary Pickford. It is a slight little piece but easy to watch particularly for the scenes in an actual pigeon farm.",
      "fileSize": 276955050,
      "addedAt": "2026-01-07T00:06:09.635Z",
      "thumbnail": "https://archive.org/services/img/AsItIsInLife",
      "collection": "feature_films",
      "downloads": 2255
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "16 min",
    "imdbRating": 5.6,
    "imdbVotes": 247,
    "Genre": "Drama, Short",
    "Plot": "A grief stricken widowed man, devotes his life to caring and providing for his very young daughter. He quickly secures a job at a nearby pigeon farm. One day he runs into an old sweetheart, but he soon realizes he cannot support a wife and his child too, so he sacrifices his own happiness for his daughter. Years later his daughter returns from school a young woman. She promises her father that she will never leave him. Then one day a young man turns her fancy, and they are both smitten with each other. As they meet secretly, her father finds out and angrily confronts the young man. His daughter explains she is in love and they are going to get married. Heartbroken, the father leaves, not wanting to see them again. A year later, the daughter has a baby of her own. With her husband always busy, she becomes very lonely. Missing her father, she visits him and places the baby in his arms. Upon seeing his daughter and grandchild he is immediately restored with joy and happiness.",
    "Director": "D.W. Griffith",
    "Writer": "Stanner E.V. Taylor",
    "Actors": "George Nichols, Gladys Egan, Mary Pickford",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001118",
    "tt0001431",
    "tt0001326",
    "tt0001245",
    "tt0001262",
    "tt0001315",
    "tt0001401",
    "tt0001439",
    "tt0001371",
    "tt0001385",
    "tt0001072",
    "tt0001510"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-11T21:44:59.097Z"
}