{
  "movieId": "tt0020042",
  "title": "Jazz Heaven",
  "year": 1929,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ncrztFQZQv8",
      "id": "ncrztFQZQv8",
      "title": "Jazz Heaven (1929) JOHN MACK BROWN🍕 SALLY O'NEIL🍕 MUSIC ROMANCE",
      "description": "It's Friday @PizzaFLIX \nStars: John Mack Brown, Sally O'Neil, Clyde Cook\nDirector: Melville Brown\nFrom the dawn of the talkie era comes a delightful blend of romance, ambition, and music, brought to life by RKO Productions and Radio Pictures. Directed by Melville Brown, this charming comedy follows a struggling songwriter and a hopeful singer as they chase success—and each other—through the bustling world of Tin Pan Alley.\n\nSally O’Neil brings warmth and spark to the role of Marge, a spirited young woman with dreams as big as the city skyline. John Mack Brown plays Barry Holmes, a down-on-his-luck composer whose tune might just hit the right note with the help of Marge’s clever improvisation and unwavering faith.\n\nBacked by a cast including Clyde Cook and Joseph Cawthorn, this early musical romance showcases the transitional era of silent-to-sound filmmaking, complete with synchronized songs and urban jazz-age flair.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nA breezy, upbeat portrait of creative hustle and young love, this film reflects the energy and optimism of late 1920s Hollywood, as well as RKO’s early foray into sound cinema. Experience a hidden gem from the early talkie revolution in a beautifully restored presentation.\n\n#SallyONeil #JohnnyMackBrown #MelvilleBrown #OscarLevant #RKO #EarlyTalkies #JazzAgeCinema #PreCodeFilm #ClassicRomance #PizzaFLIX",
      "addedAt": "2025-12-24T01:03:42.325Z",
      "thumbnail": "https://i.ytimg.com/vi/ncrztFQZQv8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCi9Mq0abQzNFq_ybepnPe-U7AmCQ",
      "duration": 4128,
      "language": "en",
      "year": 1929,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "68 min",
    "imdbRating": 5.5,
    "imdbVotes": 173,
    "Genre": "Comedy, Drama, Music",
    "Plot": "Barry Holmes (Johnny Mack Brown), a southern songwriter, come to New York City's Tin-Pan Alley and meets and falls in love with radio-singer Ruth Morgan (Sally O'Neill) and they team up to write a song that will make them rich and famous. And with the help of song publishers Hennan Kemple (Joseph Cawthorn) and Walter Klucke (Albert Conti), they succeed.",
    "Director": "Melville W. Brown",
    "Writer": "Pauline Forney, Dudley Murphy, J. Walter Ruben",
    "Actors": "Sally O'Neil, Johnny Mack Brown, Clyde Cook",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019797",
    "tt0021649",
    "tt0021449",
    "tt0020470",
    "tt0021557",
    "tt0020828",
    "tt0022789",
    "tt0020758",
    "tt0017866",
    "tt3480060",
    "tt0071112",
    "tt0019933"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:50.954Z"
}