{
  "imdbId": "tt0052862",
  "title": "The St. Louis Bank Robbery",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/St.LouisBankRobbery",
      "title": "The St. Louis Bank Robbery",
      "description": "Title: The St. Louis Bank Robbery Summary: A gang's plans for a St. Louis bank robbery are complicated when the sister of one of the thieves starts voicing her well-founded suspicions. Directed by: Charles Guggenheim, John Stix Actors: Production Company: Charles Guggenheim & Associates Release Date: 10 September 1959 (USA) Aspect Ratio: 1.66 : 1 George Fowler is drawn into a gang planning to rob a bank in St. Louis that they expect will have a $100,000 on hand on an upcoming Friday. George is drawn into the plan as the gang's driver by Gino, an old girlfriend's older brother. As the gang goes about its planning, George and Gino have to find a way to live for the next two weeks and they turn to Gino's sister, Ann, for help. George is hoping to go back to college and the money he would make would go a long way to helping him do that. Not trusting George to keep his nerve, the gang's leader John Egan moves him to the inside, but the robbery doesn't go off as planned.",
      "id": "St.LouisBankRobbery"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ickpl67DVTs",
      "title": "The St. Louis Bank Robbery (1959) [Film Noir] [Crime]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"The St. Louis Bank Robbery\" (also called \"The Great St. Louis Bank Robbery\", the film title in the opening credits) is a 1959 heist film shot in black and white. The noir film stars Steve McQueen as a college dropout hired to be the getaway driver in a bank robbery. The film is based on a 1953 bank robbery attempt of Southwest Bank in St. Louis. The film was shot on location in St. Louis and some of the men and woman from the St. Louis Police Department, as well as local residents and bank employees, play the same parts they did in the actual robbery attempt.\n\nGeorge Fowler (Steve McQueen) shows himself as an ex-football hero. He finds himself slowly drawn into the gangster world. With the gang in need of just $50 more, George asks his ex girl, Ann, for that amount in a check, supposedly for her brother Gino. The plan starts to unravel when she sees Gino coming out of a restaurant across the street from the bank. When questioned about it George later reveals he's involved with robbing the bank. She writes 'Warning The bank will be Robbed!' with lipstick on the window, the bank taking it as a joke. As the day of the heist grows nearer the tension within the gang heightens with no one trusting anyone. The robbers burst into George's and Gino's apartment that night and demand who talked to the girl about the robbery, seeing the lipstick warning. Gino breaks about his sister's (George's Ex girl) talking to George. George goes to her apartment with the gang and talks her into going to Chicago. Gino and George go to a park and wait. While Willie and John are taking her down the fire escape, John gets fidgety and hurls her off the escape down to the street below. They return to George and Gino, saying nothing about the murder. The next day the robbery is attempted as planned. Meanwhile the bank has replaced the switchboard, previously inside the bank, downstairs to what seems to be a better control room, a system which the robbers were betting on disabling to prevent calls to the police. John distrusts George and compels Willie to drive, instead of George, who will now be inside robbing the bank even though it's his first time on any illegal job. The robbing goes as planned until George can't find the switchboard they wanted to disable. The switchboard downstairs calls the police and they send a squad car over to the bank. When the police arrive, more arriving every second, the robbery goes astray. John gets killed while trying to take a hostage out and Gino commits suicide down in the vaults. Willie flees with the car, leaving his partners behind. George gets shot in the leg. He tries to take a hostage out, the woman's husband offering himself instead. As the wife is in his headlock, his arm aiming the gun at her husband, she says, \"It's no use, he's vicious.\" Realizing just how far he went, George relaxes his grip and falls to the ground, muttering how he isn't 'vicious'. George is taken away, his last sight looking out the bars of the car.\n\n---\n\nDirected by Charles Guggenheim and John Stix, produced by Jane Bridges, Katherine Drescher, Charles Guggenheim, Helen Hagen, Lee Hammond and Richard T. Heffron, written by Richard T. Heffron, starring Steve McQueen as George Fowler, Crahan Denton as John Egan, the boss, David Clarke as Gino, Ann's brother, James Dukas as Willie (the driver), Mollie McCarthy as George's ex-girlfriend, Martha Gable as Eddie's wife and Larry Gerst as Eddie.\n\n---\n\nSource: \"The Great St. Louis Bank Robbery\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 June 2012. Web. 24 August 2012. http://en.wikipedia.org/wiki/The_Great_St._Louis_Bank_Robbery\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "ickpl67DVTs",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-st.-louis-bank-robbery-1959",
      "title": "The St. Louis Bank Robbery (1959)",
      "description": "Career criminals and a local youth carefully plan and rehearse the robbery of a Missouri bank. Watch on RetroFlix:  https://retroflix.org/the-st-louis-bank-robbery-1959/",
      "id": "the-st.-louis-bank-robbery-1959"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nyxe9DgY-GU",
      "title": "The St. Louis Bank Robbery (1959) STEVE McQUEEN",
      "description": "Stars: Steve McQueen, Crahan Denton, David Clarke\nDirectors: Charles Guggenheim, John Stix\n\nA gang's plans for a St. Louis bank robbery are complicated when the sister of one of the thieves starts voicing her well-founded suspicions. The film was shot in St. Louis, MO, and actual locations, including the real site of the 1954 robbery site, were used.",
      "id": "nyxe9DgY-GU",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "89 min",
    "imdbRating": "5.8",
    "imdbVotes": "1,760",
    "Genre": "Crime, Drama, Thriller",
    "Plot": "George Fowler is introduced to a gang planning to rob a bank in St. Louis that they expect will have $100,000 on hand on an upcoming Friday. George is drawn into the plan as the gang's driver by Gino, an old girlfriend's older brother. As the gang goes about its planning, George and Gino have to find a way to live for the next two weeks and they turn to Gino's sister, Ann, for help. George is hoping to go back to college and the money he would make would go a long way to helping him do that. Not trusting George to keep his nerve, the gang's leader John Egan moves him to the inside, but the robbery doesn't go off as planned.",
    "Director": "Charles Guggenheim, John Stix",
    "Writer": "Richard T. Heffron",
    "Actors": "Steve McQueen, Crahan Denton, David Clarke",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0053133",
      "title": "Odds Against Tomorrow",
      "year": 1959,
      "imdbRating": "7.4",
      "imdbVotes": "6,115",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053850",
      "title": "Gangster Story",
      "year": 1959,
      "imdbRating": "4.7",
      "imdbVotes": "618",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053361",
      "title": "Tiger Bay",
      "year": 1959,
      "imdbRating": "7.5",
      "imdbVotes": "3,347",
      "language": "English, Polish, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052696",
      "title": "City of Fear",
      "year": 1959,
      "imdbRating": "6.4",
      "imdbVotes": "1,810",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052870",
      "title": "Guns Girls and Gangsters",
      "year": 1959,
      "imdbRating": "6.2",
      "imdbVotes": "747",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052943",
      "title": "Jet Over the Atlantic",
      "year": 1959,
      "imdbRating": "5.6",
      "imdbVotes": "202",
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051500",
      "title": "The Cry Baby Killer",
      "year": 1958,
      "imdbRating": "5.1",
      "imdbVotes": "760",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054295",
      "title": "Seven Thieves",
      "year": 1960,
      "imdbRating": "6.5",
      "imdbVotes": "1,795",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054380",
      "title": "The 3rd Voice",
      "year": 1960,
      "imdbRating": "6.8",
      "imdbVotes": "229",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2017464",
      "title": "Intimidation",
      "year": 1960,
      "imdbRating": "7.2",
      "imdbVotes": "928",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054041",
      "title": "Ma Barker's Killer Brood",
      "year": 1960,
      "imdbRating": "5.5",
      "imdbVotes": "383",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052811",
      "title": "The Flesh and the Fiends",
      "year": 1960,
      "imdbRating": "6.9",
      "imdbVotes": "2,431",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:33.202Z"
}