{
  "imdbId": "tt0035622",
  "title": "Alaska Highway",
  "year": 1943,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jpyrB6eDUk8",
      "title": "Alaska Highway (1943) [Drama]",
      "description": "The film begins with the attack on Pearl Harbor. Alaska at the time was weakly defended. Canada had already built the northwest staging route; a series of airfields spread across northwestern Canada. The decision is made to build a highway to Alaska. The workers are divided into three starting camps, Fort Nelson BC., Skagway Alaska, and Valdez Alaska. The workers from Fort Nelson BC begin building a highway north. The workers in Skagway are transported by the White Pass and Yukon Route railway to Whitehorse. From Whitehorse they begin building a road north and south.\n\nThe workers in Valdez Alaska move to a point inland and begin building a road towards Fairbanks and Whitehorse. The movie goes on to show some amazing footage of bulldozers building the highway. The black troops arrive and all work hard building the highway. The highway is opened to traffic. The truck drivers find that the road is better to drive than expected. However, some of the highway is not correctly built and becomes impassable in rain. Flooded rivers wash away some bridges and they have to be rebuilt. Some of the highway is not properly drained and ice builds up on the road. Trucks sink into the mud and are frozen into the mud. Some grades are too steep and accidents happen. Civilian contractors are hired to improve the highway. New bridges are built and telephone lines are added to the route.\n\nSkagway is given a new life by all the troops stationed there. The port is expanded. The White Pass and Yukon Route railway is leased by the army. Supplies flow from Skagway to Whitehorse. One train engineer is given the soldiers medal for risking his life to save his train. The decision is made to build a highway from Hanes Alaska to connect to the Alaska highway. The Indians living in remote Alaska are now connected with the rest of the world by the highways. The airports are upgraded, planes and supplies flow to Russia. The peace river bridge is dedicated. Politicians and army brass from the US and Canada make speeches.\n\nThe highway contractors finish their rebuilding of the highway. This allows supplies to flow into Alaska. The film ends with scenes of massive convoys of trucks headed north into Alaska. \"Now we can press home the attack. This is the road through the brooding wilderness. This is the wedge that has pried open the last great frontier of America. The key which has unlocked the treasure chest of Alaska and the Canadian northwest.\"\n\n---\n\nDirected by Frank McDonald, produced by William H. Pine and William C. Thomas, written by Lewis R. Foster and Maxwell Shane , starring Richard Arlen as Woody Ormsby, Jean Parker as Ann Coswell, Ralph Sanford as Frosty Gimble, William Henry as Steve Ormsby, Joe Sawyer as Roughhouse, Eddie Quillan as Pompadour \"Shorty\" Jones, Jack Wegman as Sergeant Swithers, Harry Shannon as John \"Pop\" Ormsby, Edward Earle as Blair Caswell and Keith Richards as Hank Lincoln.\n\n---\n\nSource: \"Alaska Highway (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 1 October 2013. Web. 20 October 2013. http://en.wikipedia.org/wiki/Alaska_Highway_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "jpyrB6eDUk8",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AlaskaHighway",
      "title": "Alaska Highway",
      "description": "Pop Ormsby (Harry Shannon) wins the contract from the Army Engineer Corps for the construction of the Alaska Highway connecting Alaska to Canada. The elder of his two sons, Woody Ormseby (Richard Arlen), decides he had rather fight with bullets than bulldozers but is assigned by the Army to work on the project. Woody and his younger brother Steve are both rivals for the affection of Ann Caswell (Jean Parker), the daughter of Road Engineer Blair Caswell (Edward Earle).",
      "id": "AlaskaHighway"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VNARSRK0R9c",
      "title": "Alaska Highway (1943) ADVENTURE",
      "description": "Stars: Richard Arlen, Jean Parker, Ralph Sanford\nDirector: Frank McDonald\n\nPop Ormsby wins the contract from the Army Engineer Corps for the construction of a Highway connecting Alaska to Canada. The elder of his two sons, decides he had rather fight with bullets than bulldozers but is assigned by the Army to work on the project. His younger brothers are both rivals for the affection of the daughter of Road Engineer.",
      "id": "VNARSRK0R9c",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": "5.0",
    "imdbVotes": "107",
    "Genre": "Drama",
    "Plot": "Pop Ormsby wins the contract from the Army Engineer Corps for the construction of the Alaska Highway connecting Alaska to Canada. The elder of his two sons, Woody Ormseby, decides he had rather fight with bullets than bulldozers but is assigned by the Army to work on the project. Woody and his younger brother Steve are both rivals for the affection of Ann Caswell, the daughter of Road Engineer Blair Caswell.",
    "Director": "Frank McDonald",
    "Writer": "Maxwell Shane, Lewis R. Foster",
    "Actors": "Richard Arlen, Jean Parker, Ralph Sanford",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0035569",
      "title": "Wrecking Crew",
      "year": 1942,
      "imdbRating": "5.9",
      "imdbVotes": "91",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033611",
      "title": "Flying Blind",
      "year": 1941,
      "imdbRating": "4.6",
      "imdbVotes": "133",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035562",
      "title": "Wildcat",
      "year": 1942,
      "imdbRating": "5.6",
      "imdbVotes": "136",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036440",
      "title": "Timber Queen",
      "year": 1944,
      "imdbRating": "5.9",
      "imdbVotes": "108",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036845",
      "title": "Gambler's Choice",
      "year": 1944,
      "imdbRating": "6.0",
      "imdbVotes": "175",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037535",
      "title": "Bells of Rosarita",
      "year": 1945,
      "imdbRating": "6.1",
      "imdbVotes": "248",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036397",
      "title": "Submarine Alert",
      "year": 1943,
      "imdbRating": "5.3",
      "imdbVotes": "386",
      "language": "Japanese, German, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0038968",
      "title": "Song of Arizona",
      "year": 1946,
      "imdbRating": "5.5",
      "imdbVotes": "185",
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037151",
      "title": "One Body Too Many",
      "year": 1944,
      "imdbRating": "5.4",
      "imdbVotes": "1,582",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034056",
      "title": "Power Dive",
      "year": 1941,
      "imdbRating": "5.2",
      "imdbVotes": "91",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033958",
      "title": "No Hands on the Clock",
      "year": 1941,
      "imdbRating": "6.0",
      "imdbVotes": "228",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035614",
      "title": "Aerial Gunner",
      "year": 1943,
      "imdbRating": "5.5",
      "imdbVotes": "375",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}