{
  "movieId": "tt0065531",
  "title": "Le cercle rouge",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/le-cercle-rouge",
      "id": "le-cercle-rouge",
      "title": "Le Cercle Rouge",
      "description": "Alain Delon plays a master thief, fresh out of prison, who crosses paths with a notorious escapee (Gian Maria Volonté) and an alcoholic ex-cop (Yves Montand). The unlikely trio plot a heist, against impossible odds, until a relentless inspector and their own pasts seal their fates. Jean-Pierre Melville's  Le cercle rouge  combines honorable antiheroes, coolly atmospheric cinematography, and breathtaking set pieces to create a masterpiece of crime cinema.",
      "fileSize": 11535340053,
      "addedAt": "2026-01-07T00:09:38.888Z",
      "thumbnail": "https://archive.org/services/img/le-cercle-rouge",
      "language": "fre",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 55872
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "140 min",
    "imdbRating": 7.9,
    "imdbVotes": 31078,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "On the eve of his release after five years imprisoned, the thief Corey is contacted by one guard of the prison that offers him a jewelry heist. However Corey seeks out his former boss Rico and steals money from him. Rico sends two gangsters to hunt Corey down and retrieve the stolen amount. Meanwhile the criminal Vogel is transported by train by the Police Officer Mattei and succeeds to escape. Corey drives from Marseille to Paris and Vogel hides in the trunk of his car. Corey finds him but does not object to ride Vogel to Paris hidden in the trunk. When the gangsters sent by Rico cut in Corey's car, Vogel saves him from the criminals, but Corey loses the money. Without money, Corey decides to heist the jewelry with Vogel and invites the former police detective Jansen to team-up with them. The trio executes a perfect heist but Rico is seeking revenge and Mattei is an unethical but efficient police officer capable to use any means to resolve the case.",
    "Director": "Jean-Pierre Melville",
    "Writer": "Jean-Pierre Melville",
    "Actors": "Alain Delon, Bourvil, Gian Maria Volontè",
    "Language": "French",
    "Country": "France, Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1440120",
    "tt0307956",
    "tt0083677",
    "tt0061451",
    "tt0061956",
    "tt0069947",
    "tt0071840",
    "tt0062347",
    "tt0071721",
    "tt2543702",
    "tt0116374",
    "tt0086877"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}