{
  "imdbId": "tt0054436",
  "title": "Revenge of the Barbarians",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RevengeOfTheBarbarians",
      "id": "RevengeOfTheBarbarians",
      "title": "Revenge of the Barbarians",
      "description": "Title: Revenge of the Barbarians Summary: 408 AD. The Visigoths led by Alaric invade northern Italy. At Ravenna, they have to battle, and they are stopped by the power of the Roman legions and the cunning of the emperor's sister, ... Directed by: Giuseppe Vari Actors: Daniela Rocca, Anthony Steel, Robert Alda Production Company: Oriental Film Release Date: 23 December 1960 (Italy) Aspect Ratio: 2.35 : 1 408 AD. The Visigoths led by Alaric invade northern Italy. At Ravenna, they have to battle, and they are stopped by the power of the Roman legions and the cunning of the emperor's sister, Galla Placidia. As the Goths lose many warriors in the cruel battle, Alaric vows bloody revenge. When the Visigoths return to Ravenna, Galla Placidia manages to send them against Rome instead, and remains alone in her home city with a handful of soldiers. The Visigoths exert their revenge on Rome, attacked and sacked, but then Placidia is captured by Ataulf. The Roman Emperor of the West, Onorius, sends Olympius, consul of Rome, to negotiate Placidia's freedom. It comes down to a single duel between the courageous consul and Ataulf. Ataulf loses, and is honor bound to let Olympius free one of the women prisoners. The consul chooses Sabina, his lawful wife whom he had married for political reasons but for whom he had become in love. Galla Placidia, who longed for Olympius, is therefore forced to ...",
      "fileSize": 610711055,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RevengeOfTheBarbarians",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 5642
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "104 min",
    "imdbRating": 5.8,
    "imdbVotes": 65,
    "Genre": "Action, Drama, History",
    "Plot": "408 AD. The Visigoths led by Alaric invade northern Italy. At Ravenna, they have to battle, and they are stopped by the power of the Roman legions and the cunning of the emperor's sister, Galla Placidia. As the Goths lose many warriors in the cruel battle, Alaric vows bloody revenge. When the Visigoths return to Ravenna, Galla Placidia manages to send them against Rome instead, and remains alone in her home city with a handful of soldiers. The Visigoths exert their revenge on Rome, attacked and sacked, but then Placidia is captured by Ataulf. The Roman Emperor of the West, Onorius, sends Olympius, consul of Rome, to negotiate Placidia's freedom. It comes down to a single duel between the courageous consul and Ataulf. Ataulf loses, and is honor bound to let Olympius free one of the women prisoners. The consul chooses Sabina, his lawful wife whom he had married for political reasons but for whom he had become in love. Galla Placidia, who longed for Olympius, is therefore forced to accept Ataulf for husband. Her gesture appeases the Visigoth's crave for revenge and the city of Ravenna is spared.",
    "Director": "Giuseppe Vari",
    "Writer": "Enrico Formai, Gastone Ramazzotti",
    "Actors": "Daniela Rocca, Anthony Steel, Robert Alda",
    "Language": "Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0053272",
    "tt0055884",
    "tt0051565",
    "tt0056197",
    "tt0051702",
    "tt0054788",
    "tt0054058",
    "tt0041940",
    "tt1020558",
    "tt0054350",
    "tt5189828",
    "tt6353716"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}