{
  "imdbId": "tt0035640",
  "title": "The Ape Man",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheApeMan",
      "title": "The Ape Man",
      "description": "Conducting weird scientific experiments, crazed Dr. James Brewster (Bela Lugosi), aided by his colleague Dr. Randall (Henry Hall), has managed to transform himself into a hairy, stooped-over ape-man. Desperately seeking a cure, Brewster believes only an injection of recently-drawn human spinal fluid will prove effective. With Randall refusing to help him, it falls to Brewster and his captive gorilla to find appropriate donors",
      "fileSize": 1672589577,
      "id": "TheApeMan"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aQ1MS8GQOVo",
      "title": "The Ape Man (1943) | Colorized Public Domain Horror with Bela Lugosi",
      "description": "The Ape Man (1943) is an American horror film directed by William Beaudine and produced by Monogram Pictures. Starring the legendary Bela Lugosi, this film is one of the most memorable entries from Monogram’s low-budget horror cycle of the 1940s. In this restored and colorized edition, audiences can rediscover Lugosi in one of his most unusual roles, portraying a scientist whose reckless experiments transform him into a terrifying half-human, half-ape creature. Combining mad science, Gothic horror, and pulp adventure, The Ape Man reflects both the strengths and eccentricities of Lugosi’s long career.\n\nPlot Summary:\nThe story follows Dr. James Brewster (Bela Lugosi), a brilliant but misguided scientist who has been conducting experiments with ape spinal fluid. In a horrifying accident, he becomes partially transformed into a monstrous ape-like figure. Desperate to reverse the effects, he relies on his sister Agatha Brewster (Minerva Urecal) and enlists the reluctant help of his colleague Dr. Randall (Henry Hall).\n\nAs Brewster’s condition worsens, he learns that the only way to cure himself is through the use of fresh human spinal fluid. This discovery drives him into madness, and he begins committing a series of gruesome murders to secure the substance he needs. Meanwhile, journalist Jeff Carter (Wallace Ford) and photographer Billie Mason (Louise Currie) investigate the bizarre string of killings, unaware that the culprit is the once-respected Dr. Brewster. The film builds toward a shocking climax where science, morality, and horror collide.\n\nCast and Crew:\n• Director: William Beaudine\n• Producer: Jack Dietz\n• Screenplay: Barney A. Sarecky\n• Studio: Monogram Pictures\n• Cinematography: Marcel Le Picard\n• Editing: Carl Pierson\n• Music: Edward J. Kay\n\nStarring:\n• Bela Lugosi as Dr. James Brewster\n• Minerva Urecal as Agatha Brewster\n• Louise Currie as Billie Mason\n• Wallace Ford as Jeff Carter\n• Henry Hall as Dr. Randall\n• Emil Van Horn as The Ape\n\nFilm Significance:\nThe Ape Man is remembered today as one of Bela Lugosi’s most iconic Monogram horror features, embodying both the brilliance and tragedy of his career. Lugosi, who had risen to fame as Count Dracula in 1931, found himself working in low-budget productions during the 1940s, yet his commitment and commanding presence elevated even the most eccentric material. The film captures his ability to make even a far-fetched premise both chilling and captivating.\n\nDirector William Beaudine, known for his efficiency and speed in filmmaking, delivers a compact horror tale filled with atmosphere, suspense, and bizarre imagery. Monogram Pictures specialized in quickly produced, cost-effective films, but The Ape Man has endured due to its unusual premise, Lugosi’s presence, and its cult appeal among fans of classic horror.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Ape Man (1943) remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white, The Ape Man relied on shadows, fog, and stark lighting to build suspense. This colorized restoration breathes new life into the film, emphasizing the eerie laboratory, the haunting streets where Brewster prowls, and the grotesque features of his monstrous transformation. With color, Lugosi’s performance becomes even more striking, and the film gains a fresh immediacy for modern audiences.\n\nLegacy:\nWhile often considered a “poverty row” horror picture, The Ape Man has gained cult status for its strange blend of science-gone-wrong narrative, Gothic atmosphere, and Bela Lugosi’s unforgettable performance. It stands as a reminder of Lugosi’s enduring appeal and his ability to command the screen under any circumstances. Today, it is celebrated not only as an entertaining horror oddity but also as a vital part of the legacy of classic Hollywood’s Golden Age of horror cinema.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including horror, thrillers, and hidden gems from the archives. Our mission is to preserve and revitalize these works for audiences in the USA, Europe, and worldwide.\n\n#TheApeMan #BelaLugosi #PublicDomainMovie #ColorizedClassic #1940sHorror #FilmRestoration #Golden",
      "id": "aQ1MS8GQOVo",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Dv2ElO0ggIo",
      "title": "The Ape Man (1943) BELA LUGOSI",
      "description": "Stars: Bela Lugosi, Louise Currie, Wallace Ford\nDirector: William Beaudine\n\nConducting weird scientific experiments, a crazed scientist accidentally turns himself into a half ape, half human creature.",
      "id": "Dv2ElO0ggIo",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheApeMan720p1943",
      "title": "The Ape Man 720p 1943",
      "description": "Dr. James Brewster (Bela Lugosi) and his colleague Dr. Randall (Henry Hall) are involved in a series of scientific experiments which have caused him to transform into an ape-man. In an attempt to obtain a cure Brewster believes that it will be necessary to inject himself with recently drawn human spinal fluid. When Randall refuses to help him by providing the fluid, Brewster and his captive gorilla must attempt to find an appropriate donor. - Wikipedia 720p version.",
      "fileSize": 745438547,
      "id": "TheApeMan720p1943"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": 4.4,
    "imdbVotes": 1572,
    "Genre": "Drama, Horror, Sci-Fi",
    "Plot": "Conducting weird scientific experiments, crazed Dr. James Brewster, aided by his colleague Dr. Randall, has managed to transform himself into a hairy, stooped-over ape-man. Desperately seeking a cure, Brewster believes only an injection of recently-drawn human spinal fluid will prove effective. With Randall refusing to help him, it falls to Brewster and his captive gorilla to find appropriate donors.",
    "Director": "William Beaudine",
    "Writer": "Karl Brown, Barney A. Sarecky",
    "Actors": "Bela Lugosi, Louise Currie, Wallace Ford",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0037441",
      "title": "Voodoo Man",
      "year": 1944,
      "imdbRating": 5.2,
      "imdbVotes": 1282,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044406",
      "title": "Bela Lugosi Meets a Brooklyn Gorilla",
      "year": 1952,
      "imdbRating": 3.7,
      "imdbVotes": 2596,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031951",
      "title": "Son of Frankenstein",
      "year": 1939,
      "imdbRating": 7,
      "imdbVotes": 13067,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0060168",
      "title": "Billy the Kid Versus Dracula",
      "year": 1966,
      "imdbRating": 3.8,
      "imdbVotes": 2326,
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036382",
      "title": "Spotlight Scandals",
      "year": 1943,
      "imdbRating": 5.6,
      "imdbVotes": 48,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0035939",
      "title": "Ghosts on the Loose",
      "year": 1943,
      "imdbRating": 5,
      "imdbVotes": 1583,
      "language": "English, Yiddish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0060558",
      "title": "Jesse James Meets Frankenstein's Daughter",
      "year": 1966,
      "imdbRating": 3.4,
      "imdbVotes": 2116,
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035057",
      "title": "Men of San Quentin",
      "year": 1942,
      "imdbRating": 4.8,
      "imdbVotes": 62,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034748",
      "title": "Foreign Agent",
      "year": 1942,
      "imdbRating": 4.7,
      "imdbVotes": 100,
      "language": "German, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034985",
      "title": "The Living Ghost",
      "year": 1942,
      "imdbRating": 5.3,
      "imdbVotes": 695,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034613",
      "title": "The Corpse Vanishes",
      "year": 1942,
      "imdbRating": 4.6,
      "imdbVotes": 3653,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033399",
      "title": "Blonde Comet",
      "year": 1941,
      "imdbRating": 5,
      "imdbVotes": 112,
      "language": "English, Swedish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:32:58.689Z"
}