{
  "movieId": "tt0029580",
  "title": "Small Town Boy",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Small_Town_Boy_1937",
      "id": "Small_Town_Boy_1937",
      "title": "Small Town Boy",
      "description": "Stuart Erwin's life is changed when he finds a $1000 bill.",
      "fileSize": 1168350925,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/Small_Town_Boy_1937",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 7102
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S5zrTFT-wWo",
      "id": "S5zrTFT-wWo",
      "title": "Small Town Boy  (1937) COMEDY",
      "description": "Stars: Stuart Erwin, Joyce Compton, Jed Prouty \nDirector: Glenn Tryon\n\nThe life of an honest country bumpkin is turned up-side down when he finds a $1,000 bill.",
      "addedAt": "2025-12-26T23:47:42.398Z",
      "thumbnail": "https://i.ytimg.com/vi/S5zrTFT-wWo/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gOAAoADigIMCAAQARhlIGUoZTAP&rs=AOn4CLBWUuaomiOOXSUApmlhzkKmJUz3cQ",
      "duration": 3501,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Small_Town_Boy--1937",
      "id": "Small_Town_Boy--1937",
      "title": "Small Town Boy (1937; smallest download)",
      "description": "Actors: Stuart Erwin; Joyce Compton; Jed Prouty; James Blakeley; Clarence Wilson Director: Glenn Tryon Runtime: 59:21 The Matroska (.mkv) file is the smallest download for this movie on the Archive (57 MB).",
      "fileSize": 394146997,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/Small_Town_Boy--1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 565
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "63 min",
    "imdbRating": 5.6,
    "imdbVotes": 40,
    "Genre": "Comedy, Romance",
    "Plot": "Henry Armstrong was past being a spring chicken, still believes in Santa Claus and the maxim that \"honesty is the best policy\", but lack of money keeps him from marrying Molly and buying a little home, and his is threatened with the loss of the petty job he has had for four years with old Curtis French, Molly's uncle, because he can not sell enough insurance policies. And, then, he finds a thousand dollar bill. His honesty makes him advertise the find, but no one claims the money. When he is convinced that the owner will not turn up and that the money is his to keep, he becomes a changed, more aggressive and self-confident person. He begins to make sales as fast as he can make the pitch and he insists that he and Molly be married at once. While getting dressed for the ceremony, he places the $1000 bill in one of his father's old suits, and Pa Armstrong, trying to raise money to buy his son a wedding present, sells the suit to a passing junk man. The wedding is held up while Henry and his father set out to reclaim the suit. They trace the suit to a second-hand store, where it has just been stolen by a couple of tramps. Henry locates the tramp who has the suit, and trades him his new coat for it and is relieved to find the bill still in the pocket. Shortly afterward, the clothing store man arrives with the police and charges Henry with theft. Broght before the justice of peace, Henry explains about the bill and turns it over to him. The latter examines the bill and discovers it to be a fake and just an imitation put out by a furniture store as an advertisement. Henry takes the news philosophically, and decides that since he was successful when he \"thought\" he had a thousand dollars, he can retain the traits he had acquired.",
    "Director": "Glenn Tryon",
    "Writer": "Manuel Komroff, Glenn Tryon",
    "Actors": "Stuart Erwin, Joyce Compton, Jed Prouty",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029266",
    "tt0233667",
    "tt0029521",
    "tt0028999",
    "tt0029165",
    "tt0029611",
    "tt0029605",
    "tt0028557",
    "tt0028575",
    "tt0028662",
    "tt0028816",
    "tt0028876"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:28:25.920Z"
}