{
  "imdbId": "tt0038340",
  "title": "Beauty and the Bandit",
  "year": 1946,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xd6Ax3kquRY",
      "id": "xd6Ax3kquRY",
      "title": "Beauty and the Bandit (1946) THE CISCO KID🍕 GILBERT ROLAND",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Gilbert Roland, Ramsey Ames,  \nDirector: William Nigh\n\nIn Old California, a young Frenchman transporting a chest full of silver by stagecoach is ambushed by a mysterious bandido known as Cisco, who claims the silver was extorted from the poor people of California.\n\nTRIVIA: The Cisco Kid is a fictional character created by O. Henry for his short story \"The Caballero's Way,\" first published in 1907. Four actors portrayed this Western hero in 25 films during the sound era. In 1928 the first all-talking western starred Warner Baxter as the Cisco Kid, followed by Cesar Romero, Duncan Renaldo, and Gilbert Roland.",
      "addedAt": "2025-12-24T01:06:57.502Z",
      "thumbnail": "https://i.ytimg.com/vi/xd6Ax3kquRY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCWKNFZ4FOD_l7HqqSUtWiW1LxXQA",
      "duration": 4215,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": 5.9,
    "imdbVotes": 171,
    "Genre": "Western",
    "Plot": "In Old California, a young Frenchman transporting a chest full of silver travels by stagecoach to San Marino, to complete a complex business deal. The stagecoach is ambushed by a band of men whose leader, a mysterious bandido known as Cisco (Gilbert Roland), claims the silver is money that was extorted over a period of years from the poor people of California. The bandits take the money and escape, but Cisco stays behind with the Frenchman -- who, it turns out, is actually a lovely mademoiselle, Jeanne DuBois (Ramsay Ames). She follows him to the bandit's lair, where Cisco tells her he intends to return the stolen money to the poor people. The two rivals are irresistibly drawn to each other, however, and as a token of love Cisco offers to return the money to Jeanne instead. Now she must decide whether to complete her business deal, or to comply with Cisco's wishes and redistribute the wealth.",
    "Director": "William Nigh",
    "Writer": "Charles Belden, Gilbert Roland, O. Henry",
    "Actors": "Gilbert Roland, Martin Garralaga, Frank Yaconelli",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038971",
    "tt0039771",
    "tt0038552",
    "tt0020884",
    "tt0023703",
    "tt0029122",
    "tt0022705",
    "tt0037600",
    "tt0039533",
    "tt0039779",
    "tt0037599",
    "tt0038106"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:37:20.443Z"
}