{
  "movieId": "tt0058659",
  "title": "The Time Travelers",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-time.-travelers.-1964",
      "id": "the.-time.-travelers.-1964",
      "title": "The Time Travelers (1964)",
      "description": "The Time Travelers follows a group of scientists who successfully develop a time machine. Led by Dr. B.P. Hume, they embark on a journey to the distant future, specifically to the year 2070. However, their adventure takes a dark turn when they arrive in a post-apocalyptic world, ravaged by war and filled with mutants. The film begins with the scientists demonstrating their time travel technology. Their excitement is palpable, but there are underlying concerns about the consequences of their journey.Upon arriving in 2070, they quickly realize that civilization has collapsed. They encounter strange creatures known as \"mutants,\" who are hostile and dangerous.The scientists must navigate this perilous new world while searching for a way back to their own time. Tensions rise as they face the mutants and the implications of their time travel.The film explores themes of technological advancement, the potential for destruction, and the unforeseen consequences of scientific exploration. Ultimately, the survivors face a race against time to return to their original timeline, grappling with their experiences in a world that reflects the darker possibilities of humanity's future.",
      "fileSize": 1498827776,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-time.-travelers.-1964",
      "language": "eng",
      "year": 1964,
      "collection": "feature_films",
      "downloads": 658
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": 5.3,
    "imdbVotes": 3516,
    "Genre": "Sci-Fi",
    "Plot": "In 1964, a team of scientists is trying to develop a view screen into the future. What they in fact get is a portal and they soon find themselves on the other side, 107 years into the future in the year 2071, when the portal collapses. The Earth of the future is barren and they are soon attacked by mutated humans but rescued by a group of scientists who are building a spaceship to take them to a new planet. They learn that much of Earth was destroyed as the result of a nuclear war. When it's determined that the visitors from the past cannot be included in the planned voyage, they work furiously to rebuild the portal and return to their own time before departure day. Meanwhile, always under the threat of attack from the mutants , friendships are formed and they learn of life in the future including the use of robots for menial tasks.",
    "Director": "Ib Melchior",
    "Writer": "Ib Melchior, David L. Hewitt",
    "Actors": "Preston Foster, Philip Carey, Merry Anders",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0058037",
    "tt0057970",
    "tt0058084",
    "tt0058700",
    "tt0230832",
    "tt0048957",
    "tt0059504",
    "tt0055894",
    "tt0057701",
    "tt0059887",
    "tt0059920",
    "tt0059486"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}