{
  "movieId": "tt0025064",
  "title": "Double Door",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/double.-door.-1934",
      "id": "double.-door.-1934",
      "title": "Double Door (1934)",
      "description": "Double Door is a 1934 American pre-Code thriller film directed by Charles Vidor, written by Jack Cunningham and Gladys Lehman, and starring Evelyn Venable, Mary Morris, Anne Revere, and Kent Taylor. The film follows  a young bride, Anne Darrow, who is tormented by her wealthy and abusive spinster sister-in-law, Victoria Van Brett, in their New York City mansion. The plot unfolds as Victoria's controlling nature leads to a dramatic confrontation, culminating in her attempting to lock Anne in a vault, which ultimately backfires on her.",
      "fileSize": 1355897357,
      "addedAt": "2026-01-07T00:08:15.374Z",
      "thumbnail": "https://archive.org/services/img/double.-door.-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 264
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "75 min",
    "imdbRating": 6.8,
    "imdbVotes": 381,
    "Genre": "Drama, Horror, Mystery",
    "Plot": "In New York in 1910, wealthy spinster Victoria Van Brett controls with an iron hand both the family fortune and the lives of her younger sister Caroline and half brother Rip. When Rip marries Anne Darrow, a nurse who saved his life, Victoria does everything in her power to ruin the marriage, asserting that Anne only loves Rip for his money. First, Victoria steals Rip's wedding present to Anne, his mother's pearls, which Victoria claims are not his to give. Next, she secretly writes Rip out of the family will, then calls him home early from his honeymoon to make him executor of the family millions, which leaves him little time for his bride. Victoria then restricts Anne's use of the family's Fifth Avenue mansion and only addresses her indirectly as \"that woman.\" Meanwhile, Victoria tells Caroline that unless she cooperates with her treatment of Anne, she will lock her in the secret soundproof vault where their father died. Caroline's own romantic happiness was spoiled by Victoria years earlier, and she lives in daily terror of her sister's malicious manipulations. After many months of constant battering and humiliation, Anne goes to her friend, Dr. John Lucas, whom she was going to marry before she met Rip, for help. John suggests that Anne fight Victoria's tyranny and start inviting her own friends to the Van Brett home. That night, Anne invites John to dinner, and in the presence of family lawyer Mortimer Neff, Victoria accuses Anne of having an affair with him. Earlier in the day, Anne was forced to lie to Rip about visiting John unchaperoned. Under the weight of Victoria's present accusations, however, she admits her lie, swearing that John has not betrayed Rip's friendship. Finally overcoming Victoria's lifelong tyranny, Rip promises to take Anne from the house that night, forfeiting what he believes is his inheritance. When Anne comes downstairs with her suitcase, however, Victoria lures her into the vault by promising to give her the pearls and shuts the door. Caroline wakes at Anne's cry, but Victoria tells her it was only a dream and threatens to consign her to a mental institution. Victoria then tells Rip that Anne has eloped with John and dismisses the servants, planning to close up the house for a year. When John appears the next morning without any word from Anne, Rip becomes suspicious. The dog then barks at the wall that conceals the vault, and Caroline confesses that she heard a scream the night before and reveals the vault. Rip bends Victoria's arm to make her open the safe and discovers Anne, who has fainted. Although Victoria tries one last time to lure Caroline into the safe, Mortimer stops her, threatening to put her in prison unless she writes Rip back into the will. Caroline leaves the house with Anne and Rip, and after Mortimer leaves, Victoria goes into the safe to get the pearls, and the door locks behind her.",
    "Director": "Charles Vidor",
    "Writer": "Jack Cunningham, Gladys Lehman, Elizabeth McFadden",
    "Actors": "Evelyn Venable, Mary Morris, Anne Revere",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025062",
    "tt0026230",
    "tt0026759",
    "tt0024727",
    "tt0023583",
    "tt0032686",
    "tt0027053",
    "tt0025762",
    "tt3778010",
    "tt1881060",
    "tt0032406",
    "tt0037711"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.374Z"
}