{
  "imdbId": "tt0039566",
  "title": "Life with Father",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LifeWithFather",
      "id": "LifeWithFather",
      "title": "Life with Father",
      "description": "This film's excellent cast brings interest to a story of otherwise routine family events. Almost all of the performers are nicely matched with their characters, especially William Powell and Irene Dunne as the parents.",
      "fileSize": 2535841771,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LifeWithFather",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 94473
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/life-with-father-1947",
      "id": "life-with-father-1947",
      "title": "Life with Father (1947)",
      "description": "A straitlaced turn-of-the-century father presides over a family of boys and the mother who really rules the roost. Watch on RetroFlix:  https://retroflix.org/life-with-father-1947/",
      "fileSize": 969837605,
      "addedAt": "2026-01-07T00:09:38.890Z",
      "thumbnail": "https://archive.org/services/img/life-with-father-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 263
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vcL0rvrsbMg",
      "id": "vcL0rvrsbMg",
      "title": "Life With Father (1947) [Comedy]",
      "description": "\"Life with Father\" tells the true story of Clarence Day, a stockbroker who wants to be master of his house, but finds his wife and his children ignoring him, until they start making demands for him to change his own life. In keeping with the autobiography, all the children in the family (all boys) are redheads. It stars William Powell and Irene Dunne as Clarence and his wife, supported by Elizabeth Taylor as a beautiful teenage girl with whom Clarence's oldest son becomes infatuated, along with Edmund Gwenn, ZaSu Pitts, Jimmy Lydon and Martin Milner.\n\n---\n\nDirected by Michael Curtiz, produced by Robert Buckner, written by Howard Lindsay, Russel Crouse and Donald Ogden Stewart, starring William Powell as Clarence Day, Sr., Irene Dunne as Vinnie Day, Elizabeth Taylor as Mary Skinner, Edmund Gwenn as Rev. Dr. Lloyd, ZaSu Pitts as Cousin Cora Cartwright, Jimmy Lydon as Clarence Day, Jr., Emma Dunn as Margaret (the cook), , Moroni Olsen as Dr. Humphries, Elisabeth Risdon as Mrs. Whitehead (introduces Morley), Derek Scott as Harlan Day, Johnny Calkins as Whitney Day, Martin Milner as John Day, Heather Wilde as Annie (1st maid), Monte Blue as The Policeman, Mary Field as Nora (2nd maid) and Clara Blandick as Miss Wiggins (the Maid Service Employment Agent).\n\n---\n\nSource: \"Life with Father (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 29 July 2016. Web. 28 November 2016. http://en.wikipedia.org/wiki/Life_with_Father_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "addedAt": "2025-12-26T00:26:09.116Z",
      "thumbnail": "https://i.ytimg.com/vi/vcL0rvrsbMg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDV4w2uzg_Tx2O9jlRzwbhM9WG-4w",
      "duration": 6770,
      "language": "en",
      "year": 1947,
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RRR5HiBQpRU",
      "id": "RRR5HiBQpRU",
      "title": "Life With Father (1947) [Comedy]",
      "description": "\"Life with Father\" is an American comedy film. It tells the true story of Clarence Day, a stockbroker who wants to be master of his house, but finds his wife and his children ignoring him, until they start making demands for him to change his own life. In keeping with the autobiography, all the children in the family (all boys) are redheads. It stars William Powell and Irene Dunne as Clarence and his wife, supported by Elizabeth Taylor as a beautiful teenage girl with whom Clarence's oldest son becomes infatuated, along with Edmund Gwenn, ZaSu Pitts, Jimmy Lydon and Martin Milner.\n\n---\n\nDirected by Michael Curtiz, produced by Robert Buckner, written by Howard Lindsay, Russel Crouse and Donald Ogden Stewart, starring William Powell as Clarence Day, Sr., Irene Dunne as Vinnie Day, Elizabeth Taylor as Mary Skinner, Edmund Gwenn as Rev. Dr. Lloyd, ZaSu Pitts as Cousin Cora Cartwright, Jimmy Lydon as Clarence Day, Jr., Emma Dunn as Margaret (the cook), , Moroni Olsen as Dr. Humphries, Elisabeth Risdon as Mrs. Whitehead (introduces Morley), Derek Scott as Harlan Day, Johnny Calkins as Whitney Day, Martin Milner as John Day, Heather Wilde as Annie (1st maid), Monte Blue as The Policeman, Mary Field as Nora (2nd maid) and Clara Blandick as Miss Wiggins (the Maid Service Employment Agent).\n\n---\n\nSource: \"Life with Father (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 August 2013. Web. 16 August 2013. http://en.wikipedia.org/wiki/Life_with_Father_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "addedAt": "2025-12-26T00:26:16.053Z",
      "thumbnail": "https://i.ytimg.com/vi/RRR5HiBQpRU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLASdyatpjlUzEriSE167VhA5YPteA",
      "duration": 7057,
      "language": "en",
      "year": 1947,
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZUbKqgm2AHI",
      "id": "ZUbKqgm2AHI",
      "title": "Life with Father (1947) IRENE DUNNE",
      "description": "Movie Class by PizzaFLIX: The film LIFE WITH FATHER (1947) was adapted from the 1939 Broadway play, which was based on Clarence Day's autobiographical stories about his family and father, a governor on the New York Stock Exchange. The Broadway production ran for 3,224 performances and still holds the record as the longest-running non-musical play in Broadway history. \n\nStars: William Powell, Irene Dunne, Elizabeth Taylor\nDirector: Michael Curtiz\n\nIn late 19th-century NYC, a stockbroker strives to maintain authority over his bustling household, but it's his wife who truly rules the roost.\n\nTRIVIA: Since both leads demanded top billing,  half of the released prints billed Dunne first and the other half listed Powell first. First-run theaters were required to these alternate prints and advertising alternated the same way.",
      "addedAt": "2025-12-26T23:46:08.220Z",
      "thumbnail": "https://i.ytimg.com/vi/ZUbKqgm2AHI/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB9ASAAuADigIMCAAQARhlIE4oTzAP&rs=AOn4CLAlyVAeKOuLPgHZFnL0urLsS54aww",
      "duration": 6772,
      "language": "en",
      "year": 1947,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jc3Vrz4OnY4",
      "id": "jc3Vrz4OnY4",
      "title": "Life with Father (1947) Elizabeth Taylor, William Powell | Comedy, Family | Subtitles",
      "description": "A financier from New York rules his family, consisting of his wife and his four sons, with the meticulous misogyny of a bookkeeper. \n \nDirector: Michael Curtiz\nWriters:  Clarence Day, Donald Ogden Stewart, Howard Lindsay\nStars: William Powell, Irene Dunne, Elizabeth Taylor\nGenre: Classics, Comedy, Family\nBudget: $4,700,000 (estimated)\n\n\n00:00 Full Movie (with subtitles)\n02:19 Family dynamics and morning routine in a household with strict rules and expectations.\n10:55 A humorous portrayal of a family's daily life, focusing on household dynamics and financial management challenges.\n19:14 Daily life challenges unfold in a comedic setting with notable characters.\n27:49 Financial disagreements unfold as guests overstay their welcome in a New York household.\n34:54 A family's dinner plans are disrupted by a baptism revelation, leading to a comedic debate on faith and tradition.\n46:57 A young man struggles with his identity and relationships in a family setting.\n56:25 Financial disagreements and misunderstandings between a husband and wife in a household.\n1:05:23 Family dynamics and financial struggles in a comedic setting with a focus on work ethic and relationships.\n1:13:41 Family faces challenges as mother falls ill, children seek comfort, and father struggles with the situation.\n1:25:54 Mrs. Day falls ill, leading to unexpected decisions and moments of reconciliation.\n1:36:37 A family navigates through comedic situations, including a baptism negotiation and gift exchanges.\n1:42:34 umorous misunderstandings unfold as relatives visit unexpectedly in a bustling household.\n1:51:56 Family chaos ensues as a father resists being baptized despite his wife's persistence.\n\n\n @CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:43:55.151Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/jc3Vrz4OnY4/maxresdefault.webp?v=636caba0",
      "duration": 7065,
      "language": "en",
      "year": 1947,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "118 min",
    "imdbRating": 7.1,
    "imdbVotes": 6550,
    "Genre": "Comedy, Family",
    "Plot": "In late-19th-century New York City, a Wall Street broker likes to think his house runs his way, but finds himself constantly bemused at how much of what happens is down to his wife. His children are also stretching their wings, discovering girls, and making money selling patent medicines. When it comes to light that he has never been baptized and everyone urges him to remedy this, it gets to be too much.",
    "Director": "Michael Curtiz",
    "Writer": "Clarence Day, Donald Ogden Stewart, Howard Lindsay",
    "Actors": "William Powell, Irene Dunne, Elizabeth Taylor",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "Nominated for 4 Oscars. 2 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt0039292",
    "tt0040966",
    "tt0040068",
    "tt0038704",
    "tt0169088",
    "tt0040795",
    "tt0040679",
    "tt0041514",
    "tt0041473",
    "tt0036696",
    "tt0037059",
    "tt0042524"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.890Z"
}