{
  "movieId": "tt0026758",
  "title": "Mystery of Edwin Drood",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mystery.-of.-edwin.-drood.-1935",
      "id": "mystery.-of.-edwin.-drood.-1935",
      "title": "Mystery of Edwin Drood (1935)",
      "description": "The Mystery of Edwin Drood is a 1935 American melodrama film directed by Stuart Walker and based on the unfinished 1870 novel The Mystery of Edwin Drood by Charles Dickens.  In the film,  school choirmaster John Jasper, who is secretly an opium addict, becomes obsessed with his nephew Edwin Drood's fiancée, Rosa Bud. After a dinner party intended to reconcile tensions between Edwin and another suitor, Neville Landless, Edwin mysteriously disappears, leading to accusations and a dark unraveling of secrets.",
      "fileSize": 1555499699,
      "addedAt": "2026-01-07T00:09:54.335Z",
      "thumbnail": "https://archive.org/services/img/mystery.-of.-edwin.-drood.-1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 202
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "87 min",
    "imdbRating": 6.4,
    "imdbVotes": 635,
    "Genre": "Crime, Drama, Horror",
    "Plot": "John Jasper, a brooding, moody choirmaster at a finishing school in Victorian England, maintains a secret life that includes frequenting an opium den. His tortured mind becomes obsessed with a young student, Rosa Bud, who is engaged to his nephew Edwin Drood. When she senses the intensity of Jasper's feelings, she becomes frightened of him and avoids his company. When the mixed-blooded Neville Landless and his twin sister Helena arrive at the school from Ceylon, Neville and Edwin take an immediate dislike to one another over Rosa's affections. Although they quarrel and make up, Edwin disappears, and suspicion logically falls on the quick-tempered Neville.",
    "Director": "Stuart Walker",
    "Writer": "Leopold Atlas, John L. Balderston, Charles Dickens",
    "Actors": "Claude Rains, Douglass Montgomery, Heather Angel",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023790",
    "tt0024538",
    "tt0026458",
    "tt0023247",
    "tt0025009",
    "tt0027590",
    "tt0021820",
    "tt0031208",
    "tt0031449",
    "tt0024771",
    "tt0073537",
    "tt0037761"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.335Z"
}