{
  "imdbId": "tt0030460",
  "title": "Moonlight Sonata",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MoonlightSonata_627",
      "id": "MoonlightSonata_627",
      "title": "Moonlight Sonata",
      "description": "From Imdb; In this romantic tale Paderewski, the famed pianist, and two other plane crash survivors are guests of a Swedish baroness. Interwoven throughout this gentle and charming story are exquisite piano solos performed superbly by the elderly pianist, Paderewski.",
      "fileSize": 1323908935,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/MoonlightSonata_627",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 13859
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "86 min",
    "imdbRating": 6.2,
    "imdbVotes": 118,
    "Genre": "Romance, Drama",
    "Plot": "In this romantic tale, Igor Paderewski, the famed pianist, and two other airplane passengers are the unexpected guests of a Swedish baroness after their pilot is forced to make an emergency landing. One of Mr. Paderewski's flying-companions takes an apparent liking to the baroness's impressionable young granddaughter, but in the end, the arrogantly-outspoken dandy is revealed to be just a self-centered (and incidentally already-married) con-artist. At first, the starry-eyed girl is rebelliously unwilling to believe this bitter fact after the shyster's seemingly adoring courtship of her, and she angrily lashes out at her long-time sweetheart when he tries to warn her of the philanderer's dishonesty, accusing him of merely being jealous. She eventually discovers written proof of the con-artist's treachery, however, and this new knowledge --- coupled with her subsequently hearing Mr. Paderewski play a hauntingly-soothing rendition of Beethoven's \"Moonlight Sonata\" for her benefit --- calms her sufficiently to come back to her senses and re-accept the true-hearted affections of her original country-boy lover. (It is also revealed that Mr. Paderewski's playing of this very same melody two decades earlier had fortuitously brought the girl's own parents together, as well.) Interwoven throughout this gentle and charming story are exquisite piano solos performed superbly by the elderly pianist, Paderewski.",
    "Director": "Lothar Mendes",
    "Writer": "E.M. Delafield, Edward Knoblock, Hans Rameau",
    "Actors": "Ignacy Jan Paderewski, Charles Farrell, Marie Tempest",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020146",
    "tt0029606",
    "tt0028592",
    "tt0028634",
    "tt0029376",
    "tt0030675",
    "tt0140551",
    "tt0030839",
    "tt0028557",
    "tt0028575",
    "tt0028607",
    "tt0028770"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}