{
  "imdbId": "tt0022689",
  "title": "Bird of Paradise",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BirdOfParadise",
      "title": "Bird of Paradise",
      "description": "Title: Bird of Paradise Summary: A native girl falls for a visitor to her island, but she's chosen to be sacrificed to the volcano god. Directed by: King Vidor Actors: Dolores del Rio, Joel McCrea, John Halliday Production Company: RKO Radio Pictures Release Date: 12 August 1932 (USA) Aspect Ratio: 1.37 : 1 A young man falls overboard and is saved by a beautiful Polynesian girl. They fall in love, but their idyll is smashed when the local volcano begins to erupt. The man discovers that the local custom is to sacrifice a young woman to the volcanic gods. They try to escape but realize that \"east is east and west is west, and never the twain shall meet.\"",
      "fileSize": 587882071,
      "id": "BirdOfParadise"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bird-of-paradise-1932",
      "title": "Bird of Paradise (1932)",
      "description": "When a young South Seas sailor falls overboard, the beautiful daughter of a Polynesian king dives in and saves his life. Thus begins the romance of Johnny and Luana. Though Luana is promised to another man, Johnny whisks her away, and for a brief time the lovers live very happily together. But, when a local volcano threatens their lives, Luana knows that she must sacrifice herself to the volcanic gods in order to save her island. Watch on RetroFlix:  https://retroflix.org/bird-of-paradise-1932/",
      "fileSize": 3390608389,
      "id": "bird-of-paradise-1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bird-paradise-4-k",
      "title": "Bird Of Paradise (1932) [Colorized, 4K, 60FPS]",
      "description": "Bird Of Paradise is a 1932 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 5925484896,
      "id": "bird-paradise-4-k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZoPqJOplNzk",
      "title": "Bird of Paradise (1932) | Colorized Public Domain Classic Adventure | Dolores del Río & Joel McCrea",
      "description": "Bird of Paradise (1932) is an American pre-Code romantic adventure film directed by King Vidor, starring Dolores del Río and Joel McCrea. This restored and colorized public domain edition revives one of early Hollywood’s most visually stunning and daring love stories, capturing the exotic fascination and emotional intensity of a forbidden romance between a Polynesian princess and a young American sailor. By colorizing this visually ambitious film, modern audiences in the United States, Europe, and worldwide can rediscover its lush island settings and timeless story of love and tragedy.\n\nPlot Summary:\nA shipwreck brings Johnny Baker (Joel McCrea) to a South Pacific island, where he meets Luana (Dolores del Río), the daughter of a native chief. Despite their cultural differences, they fall deeply in love, defying tribal customs and the expectations of both their worlds. Their love becomes a symbol of human passion clashing with tradition and nature’s unyielding forces. Luana’s father, the island chief, warns her that their love defies sacred law, yet she remains devoted to Johnny. The story reaches its emotional peak when Luana sacrifices her happiness for the good of her people, choosing duty and destiny over desire.\n\nThe film blends adventure and romance with early 1930s Hollywood sensuality. Its depiction of cross-cultural relationships and exotic imagery was bold for its time, pushing against censorship limits before the strict Hays Code was enforced. The lush landscapes, ocean sequences, and musical rhythm of the island life give the film a poetic beauty rare for its era.\n\nCast and Crew:\n• Director: King Vidor\n• Producer: David O. Selznick\n• Screenplay: Wells Root\n• Based on: Play by Richard Walton Tully\n• Cinematography: Robert Kurrle\n• Editing: Lloyd Nosler\n\nStarring:\n• Dolores del Río as Luana\n• Joel McCrea as Johnny Baker\n• John Halliday as The Chief\n• Richard Tucker as The Captain\n• Bert Roach as Chester\n• Arnold Gray as Thornton\n• Lon Chaney Jr. as Kane\n\nFilm Significance:\nBird of Paradise is a landmark in early Hollywood for its daring portrayal of interracial romance, naturalistic settings, and sensual imagery. Dolores del Río, one of the first Mexican actresses to achieve major Hollywood stardom, delivers a hauntingly beautiful performance that cemented her status as an icon of 1930s cinema. Joel McCrea, in one of his first leading roles, captures the spirit of the naive but sincere Westerner drawn into an unfamiliar world. The film’s influence can be seen in later exotic romances and adventure films like South Pacific and Return to Paradise.\n\nKing Vidor’s direction emphasizes emotional sincerity and visual poetry, using wide shots of ocean waves, tropical forests, and ceremonial dances to convey both the beauty and danger of paradise. The pre-Code era allowed Vidor to explore sensual themes and visual daring that would soon be restricted, making this film a time capsule of creative freedom before Hollywood censorship tightened.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Hoosier Schoolboy remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1932 release was filmed in black and white, relying heavily on lighting and texture to convey the tropical island atmosphere. By colorizing this film, we reintroduce its beauty in a way that enhances the island setting, ocean sequences, and emotional tone. This version allows modern audiences, especially those watching on large TV screens in the United States and Europe, to experience the visual vibrancy that early 1930s technology could only hint at.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#BirdOfParadise #DoloresDelRio #JoelMcCrea #KingVidor #PublicDomainMovie #ColorizedClassic #1930sRomance #PreCodeHollywood #FilmRestoration #GoldenAgeHollywood #TropicalRomance #ClassicCinema #AdventureDrama",
      "id": "ZoPqJOplNzk",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mUGBCMkP8Xo",
      "title": "Bird of Paradise (1932)",
      "id": "mUGBCMkP8Xo",
      "channelName": "Public Domain Movies - Classic Old Movies",
      "channelId": "UCT6gOjzXtqeb_oE-wZVHlFA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Bird_of_Paradise_1932",
      "title": "Bird of Paradise",
      "description": "From IMDb: \"A native girl falls for a visitor to her island, but she's chosen to be sacrificed to the volcano god.\"",
      "fileSize": 1017936720,
      "id": "Bird_of_Paradise_1932"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=O4MOU5YRc7c",
      "title": "Bird of Paradise (1932) PRE-CODE HOLLYWOOD",
      "description": "Stars: Dolores del Rio, Joel McCrea, Lon Chaney Jr.\nDirector: King Vidor\n\nWhen a young South Seas sailor falls overboard, he is saved by the beautiful daughter of a Polynesian king. Thus begins their romance, but has been she's chosen to be sacrificed to the volcano god!",
      "id": "O4MOU5YRc7c",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "80 min",
    "imdbRating": 6,
    "imdbVotes": 1646,
    "Genre": "Adventure, Drama, Romance",
    "Plot": "A young man falls overboard and is saved by a beautiful Polynesian girl. They fall in love, but their idyll is smashed when the local volcano begins to erupt. The man discovers that the local custom is to sacrifice a young woman to the volcanic gods. They try to escape but realize that \"east is east and west is west, and never the twain shall meet.\"",
    "Director": "King Vidor",
    "Writer": "Richard Walton Tully, Wells Root, Wanda Tuchock",
    "Actors": "Dolores Del Río, Joel McCrea, John Halliday",
    "Language": "English, Hawaiian",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0022436",
      "title": "Street Scene",
      "year": 1931,
      "imdbRating": 7.6,
      "imdbVotes": 2176,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025610",
      "title": "Our Daily Bread",
      "year": 1934,
      "imdbRating": 7,
      "imdbVotes": 2233,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022242",
      "title": "Pagan Lady",
      "year": 1931,
      "imdbRating": 5.5,
      "imdbVotes": 60,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022537",
      "title": "The Viking",
      "year": 1931,
      "imdbRating": 6,
      "imdbVotes": 185,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018806",
      "title": "The Crowd",
      "year": 1928,
      "imdbRating": 8.1,
      "imdbVotes": 9436,
      "language": "None",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0019258",
      "title": "The Patsy",
      "year": 1928,
      "imdbRating": 7.5,
      "imdbVotes": 2728,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020691",
      "title": "The Big Trail",
      "year": 1930,
      "imdbRating": 7.2,
      "imdbVotes": 4648,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020959",
      "title": "Hell Harbor",
      "year": 1930,
      "imdbRating": 5.4,
      "imdbVotes": 261,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030274",
      "title": "International Settlement",
      "year": 1938,
      "imdbRating": 6.5,
      "imdbVotes": 92,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045109",
      "title": "Ruby Gentry",
      "year": 1952,
      "imdbRating": 6.6,
      "imdbVotes": 1837,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022943",
      "title": "Girl of the Rio",
      "year": 1932,
      "imdbRating": 6,
      "imdbVotes": 32,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049934",
      "title": "War and Peace",
      "year": 1956,
      "imdbRating": 6.7,
      "imdbVotes": 11288,
      "language": "English, Russian, French",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.717Z"
}