{
  "imdbId": "tt0016690",
  "title": "Brown of Harvard",
  "year": 1926,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ar2X1jOYGTk",
      "id": "ar2X1jOYGTk",
      "title": "Brown of Harvard (1926) | Colorized Public Domain Silent College | William Haines and Jack Pickford",
      "description": "Brown of Harvard (1926) is a silent romantic drama directed by Jack Conway and produced by Metro-Goldwyn-Mayer. Adapted from the 1906 stage play by Rida Johnson Young and Gilbert Colman, this film was one of MGM’s most popular campus dramas of the silent era. Restored and colorized for modern audiences, this edition revives the story of love, rivalry, and college pride at one of America’s most prestigious universities. It features William Haines in one of his breakthrough roles, alongside Jack Pickford, Mary Brian, and Francis X. Bushman Jr. By presenting this public domain silent classic in color, Colorized Public Domain makes it accessible to contemporary viewers in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story follows Tom Brown (William Haines), a charming but arrogant freshman at Harvard who immediately clashes with Bob McAndrew (Jack Pickford), the captain of the rowing team. Tom’s reckless behavior and cocky attitude cause friction not only with Bob but also with his fellow classmates and faculty.\n\nComplicating matters is Mary Abbott (Mary Brian), the daughter of a Harvard professor. While Tom pursues her affections with persistence, Mary is drawn toward the more responsible and disciplined Bob McAndrew. As Tom’s arrogance begins to alienate him further, he eventually realizes that he must grow up, take responsibility for his actions, and earn the respect of both his peers and Mary.\n\nThe climax arrives during the highly anticipated Harvard-Yale rowing competition. Through determination and a newfound sense of maturity, Tom redeems himself and proves his worth both as an athlete and as a man. The film ends with Tom winning the love of Mary and the respect of his fellow students.\n\nCast and Crew:\n• Director: Jack Conway\n• Producers: Metro-Goldwyn-Mayer\n• Cinematography: Oliver T. Marsh\n• Based on: Brown of Harvard (1906 play) by Rida Johnson Young and Gilbert Colman\nStarring:\n• William Haines as Tom Brown\n• Jack Pickford as Bob McAndrew\n• Mary Brian as Mary Abbott\n• Francis X. Bushman Jr. as Jim Doolittle\n• David Torrence as Professor Abbott\n• Edward Connelly as John\n• Donald Reed as Reggie Smythe\n\nFilm Significance:\nBrown of Harvard (1926) became a defining silent-era college film, blending sports, romance, and youthful drama. William Haines, one of MGM’s top stars of the late 1920s, solidified his reputation with this performance, which showcased his mix of charm and mischievous humor. Jack Pickford, the younger brother of Mary Pickford, brought emotional depth to Bob McAndrew, creating a strong contrast to Haines’ flashy Tom Brown.\n\nThe film also gained historical importance for its sports scenes. It featured real Harvard athletes and authentic rowing competition footage, adding realism that resonated with audiences of the time. The college rivalry between Harvard and Yale, dramatized here, mirrored broader cultural themes of ambition, class, and youthful competition in 1920s America.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Brown of Harvard remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white silent cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1926 release was a black-and-white silent feature. While authentic to its time, modern viewers often find silent films difficult to engage with. By offering a colorized edition, we bring vitality and clarity to the performances, athletic sequences, and campus atmosphere that defined the film. For U.S. and European audiences, this version highlights how early Hollywood dramatized college life, romance, and sports in ways that continue to influence film and television today.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the silent era to Hollywood’s Golden Age, preserving cinematic treasures and making them accessible for both classic film enthusiasts and new audiences.\n\n#BrownOfHarvard #WilliamHaines #JackPickford #MaryBrian #SilentFilm #PublicDomainMovie #ColorizedClassic #SilentEra #1920sMovies #FilmRestoration #CollegeDrama #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:48:44.580Z",
      "thumbnail": "https://i.ytimg.com/vi/ar2X1jOYGTk/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYXiBeKF4wDw==&rs=AOn4CLB9b23tnZoGf_DdpeYfWoxVLXMrCQ",
      "duration": 5053,
      "language": "en",
      "year": 1926,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "85 min",
    "imdbRating": 6.2,
    "imdbVotes": 1540,
    "Genre": "Action, Drama, Romance",
    "Plot": "Tom Brown shows up at Harvard, confident and a bit arrogant. He becomes a rival of Bob McAndrew, not only in football and rowing crew, but also for the affections of Mary Abbott, a professor's daughter.",
    "Director": "Jack Conway",
    "Writer": "Rida Johnson Young, Donald Ogden Stewart, Andrew Percival Younger",
    "Actors": "William Haines, Jack Pickford, Mary Brian",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0019571",
    "tt0018457",
    "tt0019110",
    "tt0019400",
    "tt0026684",
    "tt0018471",
    "tt0018513",
    "tt0017534",
    "tt0013607",
    "tt0028592",
    "tt0028634",
    "tt0027366"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:25:14.688Z"
}