{
  "imdbId": "tt0030337",
  "title": "A Woman's Face",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-womans-face",
      "id": "a-womans-face",
      "title": "A Woman's Face",
      "description": "In this dramatic thriller, Ingrid Bergman takes on an uncharacteristically vicious role as Anna, a bitter, nefarious blackmailer with a disfigured face. Gustaf Molander directs, meticulously hiding and revealing Bergman’s features as necessary. After Anna is given an operation to restore her looks, she embarks on a scheme that requires her to go undercover as a nanny to a rich family, but as her personality softens and she discovers maternal instincts she never knew she had, her latest plot is put in jeopardy. Joan Crawford would star in the Hollywood remake.",
      "fileSize": 8240369736,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-womans-face",
      "language": "swe",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 4902
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "100 min",
    "imdbRating": 7,
    "imdbVotes": 1188,
    "Genre": "Drama",
    "Plot": "When she was a child, Anna Holm burned her face. This destroyed her looks, and she has become a mean and bitter woman. She and her 'friends' are black-mailers. One of the victims pay her by letting a plastic surgeon, doctor Wegert, make her beautiful again. Anna becomes a new person and leave the others. She becomes a governess for a young boy, who will inherit a fortune. The boy has an evil uncle, who wants to see the boy dead, so that he will inherit the fortune. He hires Anna's former colleagues as assassins.",
    "Director": "Gustaf Molander",
    "Writer": "Francis de Croisset, Gösta Stevens, Stina Bergman",
    "Actors": "Ingrid Bergman, Tore Svennberg, Anders Henrikson",
    "Language": "Swedish",
    "Country": "Sweden",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    "tt0027796",
    "tt0015947",
    "tt0032655",
    "tt0029989",
    "tt0029850",
    "tt0177600",
    "tt0029855",
    "tt0028589",
    "tt0029939",
    "tt0259235",
    "tt0030006",
    "tt0165696"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}