{
  "movieId": "tt0033643",
  "title": "Gabby Goes Fishing",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gabby-1940-ld-rips",
      "id": "gabby-1940-ld-rips",
      "title": "Gabby (1940) LD Rips",
      "description": "[Individual episodes extracted from https://archive.org/details/LV27106 using MKVToolnix.] Gabby is a short-lived Max Fleischer animated cartoon series distributed through Paramount Pictures. Gabby debuted as the town crier in the 1939 animated feature Gulliver’s Travels produced by Fleischer. Shortly afterward, Paramount and Fleischer gave Gabby his own Technicolor spinoff cartoon series, eight entries of which were produced in 1940 and 1941. Gabby was voiced by Pinto Colvig, the voice of Walt Disney's Goofy, Pluto, and Grumpy and Sleepy from the 1937 animated film Snow White and the Seven Dwarfs. Jack Mercer (the voice of Popeye and King Little, Sneak, Snoop, Snitch, and Twinkle Toes in Gulliver’s Travels) was regularly cast alongside Colvig, as either a king, mayor, snitch, fish, castle worker, fire fighter, or sometimes even as Gabby's humming. The Gabby cartoons were sold to U.M. & M. TV Corporation in 1955, which later became part of National Telefilm Associates, which became Republic Pictures, and was then sold to Paramount's current parent ViacomCBS (now currently renamed and rebranded as Paramount Global) in 1999. Today, the Gabby cartoons are in the public domain. For official releases, the cartoons are currently syndicated on television by Trifecta Entertainment & Media (inherited from CBS Television Distribution and other companies), original distributor Paramount owns the theatrical rights, and Olive Films owns the DVD rights. However, most Gabby cartoons can be found in faded public domain television prints, usually featuring National Telefilm Associates openings. Wikipedia TheTVDB",
      "fileSize": 12736211483,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/gabby-1940-ld-rips",
      "language": "eng",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 187
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gabby-goes-fishing-1941",
      "id": "gabby-goes-fishing-1941",
      "title": "Gabby Goes Fishing (1941)",
      "description": "Gabby teaches a young boy how to fish, even though the boy was doing much better without him. Watch on RetroFlix:  https://retroflix.org/gabby-goes-fishing-1941/",
      "fileSize": 42908759,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/gabby-goes-fishing-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 71
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 5.5,
    "imdbVotes": 126,
    "Genre": "Animation, Comedy, Short",
    "Plot": "Short, fat, boastful Gabby finds a boy fishing and offers his advice. Of course, the boy was doing much better before Gabby arrived. In short order, Gabby loses the boy's catch and bait. When Gabby is taunted by a fish, he rents a boat, tackle, and supplies and goes after the fish. Gabby's brief success is cut short when the fish pulls two plugs from the bottom of the boat; with Gabby's hands occupied plugging the holes, the fish raids his lunch box. Time for the secret weapon: a harpoon gun. The fish ties the harpoon line around an old motor, which starts, destroys the boat, and hauls Gabby around like a water-skier. The boy catches him in his net.",
    "Director": "Dave Fleischer, Orestes Calpini",
    "Writer": "Carl Meyer",
    "Actors": "Pinto Colvig, Jack Mercer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033767",
    "tt0032769",
    "tt0033745",
    "tt0033266",
    "tt0032854",
    "tt0033605",
    "tt0034254",
    "tt0032667",
    "tt0032874",
    "tt0032924",
    "tt0032926",
    "tt0033041"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.017Z"
}