{
  "imdbId": "tt0065611",
  "title": "Darling Lili",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/darling-lili-1970_202506",
      "id": "darling-lili-1970_202506",
      "title": "Darling Lili (1970)",
      "description": "Darling Lili (1970) Directed by: Blake Edwards Written by: William Peter Blatty, Blake Edwards Produced by: Owen Crump Starring: Julie Andrews, Rock Hudson, Jeremy Kemp, Lance Percival, Michael Witney, Jacques Marin, André Maranne, Gloria Paul, Bernard Kay, Doreen Keogh, Carl Duering, Vernon Dobtcheff, Laurie Main, Louis Mercier, Arthur Gould-Porter, Ingo Mogendorf Cinematography: Russell Harlan Edited by: Peter Zinner Music by: Henry Mancini; lyrics by Johnny Mercer Production company: Geoffrey Productions Distributed by: Paramount Pictures Release date: June 24, 1970 Running time: 143 minutes (with overture and exit music) Country: United States Language: English Color process: Technicolor Aspect ratio: 2.35:1 (Panavision) MPAA rating: G Budget: $25 million Box office: $3.25 million (Distributor rentals) © 1970 Paramount Pictures Corporation. All rights reserved.",
      "fileSize": 4505576732,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/darling-lili-1970_202506",
      "language": "eng",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 273
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "136 min",
    "imdbRating": 6,
    "imdbVotes": 2584,
    "Genre": "Comedy, Drama, Musical",
    "Plot": "World War I. Lili Smith (Dame Julie Andrews) is a beloved British music hall singer, often providing inspiration for the British and French troops and general populace singing rallying patriotic songs. She is also half German - her real last name being Schmidt - and is an undercover German spy, using her feminine wiles to gather information from the high ranking and generally older military officers and diplomats she seduces. Masquerading as her Swiss uncle, Colonel Kurt Von Ruger (Jeremy Kemp) is not only her German handler, but her lover. Kurt's boss, General Kessler (Carl Duering), doesn't fully trust Lili as she is still half British. That is why it irks him that Kurt has entrusted Lili with the important mission of finding out more about the Allied air defense plans, the air which is becoming a more important battleground of the war. Of the five men who are most privy to such information, Kurt believes the best target is American pilot Major William Larrabee (Rock Hudson), as he is young, single, and a ladies' man. Lili is more than easily able to strike a romantic and sexual relationship with Bill. Lili's mission is threatened when she learns that two French agents believe that Larrabee is passing information to a female German spy. But Lili believes she's also stumbled onto some vital information when she accidentally learns from one of Bill's pilot compatriots, T.C. Carstairs (Lance Percival), of a secret mission code named \"Crepe Suzette\". Crepe Suzette (Gloria Paul) ends up being a game changer for Lili, not only with her position as a spy, but in her relationship with Bill. The outcome of \"Suzette\" also threatens both Bill and Lili's lives.",
    "Director": "Blake Edwards",
    "Writer": "Blake Edwards, William Peter Blatty",
    "Actors": "Julie Andrews, Rock Hudson, Jeremy Kemp",
    "Language": "English, German",
    "Country": "United States",
    "Awards": "Nominated for 3 Oscars. 1 win & 7 nominations total"
  },
  "relatedMovies": [
    "tt0054698",
    "tt0290418",
    "tt0179848",
    "tt0063415",
    "tt0066495",
    "tt0049397",
    "tt0023845",
    "tt0019933",
    "tt0030089",
    "tt0182701",
    "tt0065466",
    "tt0194709"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.603Z"
}