{
  "imdbId": "tt0000816",
  "title": "The Broken Locket",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBrokenLocket1909",
      "title": "\"The Broken Locket\" (1909) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Broken Locket\" is a short drama directed by D. W. Griffith. This film illustrates the work of Arthur V. Johnson, Robert Harron and Billy Bitzer, stars of Silent Hall of Fame. A young woman gives half a locket to her beau when he leaves in search of fortune. Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          D.W. Griffith Cinematography                G.W. Bitzer Starring                                Frank Powell, Mary Pickford, Kate Bruce, Marion Leonard, Arthur V. Johnson, Robert Harron Distributed by                     Biograph Company Release date                         September 16, 1909 Running time                       13 min. Country                                United States Language                              Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 163366926,
      "id": "TheBrokenLocket1909"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-broken-locket",
      "title": "The Broken Locket",
      "fileSize": 226645536,
      "id": "silent-the-broken-locket"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 4.6,
    "imdbVotes": 130,
    "Genre": "Short, Drama",
    "Plot": "George Peabody is a young man who has been giving free rein to his inclinations, the principal one being drink. One might have concluded he was lost, but there was the chance which the hand of Providence always bestows in the person of pretty little Ruth King, who had secretly loved George since their childhood days. She succeeds in persuading him from his reckless life, and he determines to cut off from his old loose companions by going out West and making a man of himself. Bidding Ruth and her mother good-bye, he realizes that he loves his little preserver and promises to return worthy of her love and confidence. They plight their troth with their first kiss and a heart shaped locket, which Ruth wears, she breaking it in two, giving George one side while she retains the other, which symbolized the reunion of their hearts with his return. George is fortunate to strike the West in the midst of a boom, and being an affable, bright chap, meets with success, and is soon a favorite with his employers. His life here up to this is without a blemish, but has he strength? We shall see, for as gold is tested by the fire, so a man is by temptation, and George's trial comes with the persuasion to take a drink. At first he holds out against it, but at last yields, and that drink was his undoing. Once more the craving for liquor is induced and his promise to his little sweetheart in the East is forgotten, he falls an easy victim of a Mexican girl, who pretends to love him, assuming him a rather good catch. Meanwhile, faithful little Ruth is counting the days as they drag on towards the time she imagines he will return. The Mexican girl, to secure him as her own, writes a letter to Ruth purporting to come from one of his male chums to the effect that he had been killed. The shock of this letter throws the poor girl into a delirium of fever, and for a time her life is despaired of. She recovers, however, but is hopelessly blind. What woe a man's weakness may work, but we find he is rewarded for his weakness, and some time later we see George a loathsome parasite, a dirty, ragged, drunken bum a pariah among his former associates. Back East he wanders, ignorant of the misery he has caused, and what a sight greets him. There is the ever faithful little girl, accompanied by her mother, standing at the gate, the beauties of the world forever shut out from her. How dark is everything to her, but then how much darker would this world have been, had she viewed the awful condition of George as he stood there. No, of this, at least, she is blissfully ignorant, and with a subterfuge. George slinks away; she imagining that he will soon return, but, alas, the locket is forever broken.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Frank Powell, Mary Pickford, Kate Bruce",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0000832",
      "title": "A Corner in Wheat",
      "year": 1909,
      "imdbRating": 6.6,
      "imdbVotes": 2796,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000871",
      "title": "Fools of Fate",
      "year": 1909,
      "imdbRating": 5.7,
      "imdbVotes": 119,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001083",
      "title": "The Violin Maker of Cremona",
      "year": 1909,
      "imdbRating": 5,
      "imdbVotes": 157,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000895",
      "title": "The Hessian Renegades",
      "year": 1909,
      "imdbRating": 5.5,
      "imdbVotes": 211,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000942",
      "title": "The Lonely Villa",
      "year": 1909,
      "imdbRating": 6.1,
      "imdbVotes": 1054,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000972",
      "title": "The Mountaineer's Honor",
      "year": 1909,
      "imdbRating": 5.8,
      "imdbVotes": 98,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000986",
      "title": "Nursing a Viper",
      "year": 1909,
      "imdbRating": 5,
      "imdbVotes": 120,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000800",
      "title": "The Awakening",
      "year": 1909,
      "imdbRating": 5.3,
      "imdbVotes": 115,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000821",
      "title": "The Cardinal's Conspiracy",
      "year": 1909,
      "imdbRating": 4.7,
      "imdbVotes": 125,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000833",
      "title": "The Country Doctor",
      "year": 1909,
      "imdbRating": 6.4,
      "imdbVotes": 749,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001088",
      "title": "The Way of Man",
      "year": 1909,
      "imdbRating": 5,
      "imdbVotes": 78,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002400",
      "title": "The Old Actor",
      "year": 1912,
      "imdbRating": 5.7,
      "imdbVotes": 264,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}