{
  "movieId": "tt0092978",
  "title": "Escape from Sobibor",
  "year": 1987,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Escape_From_Sobibor.avi",
      "id": "Escape_From_Sobibor.avi",
      "title": "Escape From Sobibor",
      "description": "Alan Arkin and Rutger Hauer star in this award winning movie about the successful mass escape of 300 prisoners from the Sobibor Nazi death camp. Fine acting and production values make this film a worthwhile viewing experience.",
      "fileSize": 2512320104,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/Escape_From_Sobibor.avi",
      "language": "English",
      "year": 1987,
      "collection": "feature_films",
      "downloads": 908680
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/escape-from-sobibor-1987_202504",
      "id": "escape-from-sobibor-1987_202504",
      "title": "Escape from Sobibor (1987)",
      "description": "The true story of WWII's notorious Sobibor Nazi death camp, where a courageous inmate orchestrates and leads the escape of over 300 prisoners. Watch on RetroFlix:  https://retroflix.org/escape-from-sobibor-1987/",
      "fileSize": 747226247,
      "addedAt": "2026-01-07T00:08:24.392Z",
      "thumbnail": "https://archive.org/services/img/escape-from-sobibor-1987_202504",
      "language": "eng",
      "year": 1987,
      "collection": "feature_films",
      "downloads": 587
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/escape-from-sobibor-1987_202511",
      "id": "escape-from-sobibor-1987_202511",
      "title": "Escape from Sobibor (1987)",
      "description": "Escape from Sobibor is a 1987 television film based on the true story of a mass escape from the Sobibor extermination camp during World War II. The film centers around the experiences of Jewish prisoners in Sobibor, a camp in Nazi-occupied Poland. It portrays the brutal conditions they endured under the command of the sadistic camp staff. As the story unfolds, the protagonist, Leon Feldblum , played by Alan Arkin , alongside other prisoners, formulates a daring plan to escape. They begin to gather resources, relying on their ingenuity and sheer determination to free themselves from the grasp of the Nazis. The plan involves careful coordination among the prisoners, and they face numerous obstacles, including betrayal and the constant threat of discovery. Tension builds as they meticulously prepare for the escape, which culminates in a chaotic yet determined breakout. The film depicts not only the physical challenges of escaping but also the moral dilemmas faced by the characters, highlighting themes of hope, courage, and the will to survive against overwhelming odds. In the end, despite facing severe reprisals and losses, many prisoners successfully flee, with the film leaving viewers with a powerful message about resilience and the human spirit.  Escape from Sobibor serves as a poignant reminder of the atrocities of the Holocaust and the bravery of those who dared to resist.",
      "fileSize": 4259123748,
      "addedAt": "2026-01-07T00:08:24.392Z",
      "thumbnail": "https://archive.org/services/img/escape-from-sobibor-1987_202511",
      "language": "eng",
      "year": 1987,
      "collection": "feature_films",
      "downloads": 173
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "143 min",
    "imdbRating": 7.4,
    "imdbVotes": 10404,
    "Genre": "Drama, History, War",
    "Plot": "During WWII, the death camp at Treblinka had an escape, causing the Commandant at a similar camp in Sobibor to vow that his camp would never experience the same thing. But those who were its captives, the Jewish laborers that had been spared from the ovens, knew that they were on borrowed time and that their only hope was to escape... the only question was how to do it. However, because the Germans would kill an equal number of others whenever a group attempted to escape, the captives knew that if ever an escape was tried, all 600 prisoners in the camp would have to be included... logistically precluding any ideas about tunnels or sneak breakouts. Indeed, to have such a mass escape could only mean that the Ukrainian guards and Germain officers would have to be killed, which many of the Jews felt simply reduced themselves to no better than their captors... thus making it a struggle of conscience. And therein lies the story, with the film being based on a factual account of what then happened at that Sobibor prison.",
    "Director": "Jack Gold",
    "Writer": "Thomas 'Toivi' Blatt, Richard Rashke, Reginald Rose",
    "Actors": "Alan Arkin, Joanna Pacula, Rutger Hauer",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "Nominated for 5 Primetime Emmys. 3 wins & 6 nominations total"
  },
  "relatedMovies": [
    "tt0096243",
    "tt0098437",
    "tt0086251",
    "tt0094683",
    "tt0057811",
    "tt0044400",
    "tt0227607",
    "tt0159476",
    "tt0014672",
    "tt0043590",
    "tt0035958",
    "tt0046029"
  ],
  "collections": [
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1980s",
      "name": "1980s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:08:24.392Z"
}