{
  "movieId": "tt0029799",
  "title": "The Wrong Road",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WrongRoad",
      "id": "WrongRoad",
      "title": "The Wrong Road",
      "description": "Title: The Wrong Road Summary: A young unmarried couple whose plans for their life together haven't turned out as expected decide to rob the bank where the husband works of $100,000, then hide the money in a safe place ... Directed by: James Cruze Actors: Richard Cromwell, Helen Mack, Lionel Atwill Production Company: Republic Pictures (I) Release Date: 11 October 1937 (USA) Aspect Ratio: 1.37 : 1 A young unmarried couple whose plans for their life together haven't turned out as expected decide to rob the bank where the husband works of $100,000, then hide the money in a safe place and return for it after they serve out their sentences. All goes according to plan until they get out of prison, when they find that they're being trailed by an insurance investigator and the husband's old cellmate, who has decided that he wants a cut of the money.",
      "fileSize": 402406391,
      "addedAt": "2026-01-07T00:07:18.436Z",
      "thumbnail": "https://archive.org/services/img/WrongRoad",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 47615
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U47HF5wu9-s",
      "id": "U47HF5wu9-s",
      "title": "The Wrong Road (1937) | Colorized Public Domain Crime Drama with Richard Cromwell and Helen Mack",
      "description": "The Wrong Road (1937) is a crime drama directed by James Cruze and distributed by RKO Radio Pictures during the latter years of the Great Depression. This restored and colorized edition revives a socially conscious film that reflects 1930s America’s moral anxieties about youth, crime, and redemption. By bringing it back in color and modern clarity, Colorized Public Domain ensures that today’s audiences in the United States, Europe, and worldwide can rediscover this cautionary tale about ambition, temptation, and the heavy costs of bad choices.\n\nPlot Summary:\nThe story follows two young lovers, Hugh Sheridan (Richard Cromwell) and Nan Carter (Helen Mack), who dream of escaping their modest lives for wealth and excitement. Tempted by the lure of easy money, they steal $100,000 from a bank where Hugh is employed, believing they can enjoy luxury and later return the money once they have had their adventure. However, the plan quickly unravels. Caught between their desires and the weight of the law, they discover that crime cannot deliver the happiness they sought.\nAs the authorities close in, represented by Federal Agent Matthews (Lionel Atwill), the couple faces moral and emotional reckoning. Their choices not only test their love but also force them to confront the consequences of selfish ambition. The Wrong Road combines romance, suspense, and moral lesson into a compact story that reflects the cultural climate of 1930s America, where the Great Depression had left many tempted by shortcuts to success.\n\nCast and Crew:\n• Director: James Cruze\n• Screenplay: F. Hugh Herbert\n• Producer: Cliff Reid\n• Cinematography: Jack MacKenzie\nStarring:\n• Richard Cromwell as Hugh Sheridan\n• Helen Mack as Nan Carter\n• Lionel Atwill as Agent Matthews\n• Horace McMahon as Joe Tafford\n• Richard Tucker as Bank President\n• Barbara Pepper as Dottie\n• Frank M. Thomas as Detective\n\nFilm Significance:\nThe Wrong Road is part of RKO’s tradition of producing mid-budget dramas that doubled as moral lessons for Depression-era audiences. It highlights society’s tension between youthful optimism and the hard realities of law, responsibility, and accountability. Richard Cromwell, known for roles in The Lives of a Bengal Lancer and Jezebel, delivers a sympathetic performance as a young man who makes the wrong choice for the right reasons. Helen Mack, fresh from roles in His Girl Friday and Son of Kong, brings depth to the role of Nan, a woman torn between love and guilt. Lionel Atwill, a reliable character actor, adds gravitas as the stern yet understanding federal agent. Though overshadowed by bigger productions of its time, this film remains culturally significant as a moral tale that resonates even today, especially in a world where quick success and instant gratification still tempt the young.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Wrong Road remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe Wrong Road was originally released in 1937 in black and white, consistent with the industry standard of its time. While historically authentic, black-and-white films can feel distant to modern audiences. By offering a colorized edition, we bridge the gap between historical preservation and contemporary viewing, keeping the lessons, drama, and artistry alive for today’s audiences. This makes the film more accessible while maintaining its original message and cultural value.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Silent Era through the Golden Age of Hollywood, including forgotten B-movies, social dramas, and culturally significant classics. Our work ensures these films remain discoverable, engaging, and preserved for viewers in the USA, Europe, and worldwide.\n\n#TheWrongRoad #RichardCromwell #HelenMack #LionelAtwill #1930sCrimeDrama #PublicDomainFilm #ColorizedClassic #GoldenAgeHollywood #FilmRestoration #1937Movie",
      "addedAt": "2025-12-24T00:48:13.348Z",
      "thumbnail": "https://i.ytimg.com/vi/U47HF5wu9-s/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBZKEAwDw==&rs=AOn4CLDDp33g4IxlxG9FCpeop1kDYb3NBA",
      "duration": 3135,
      "language": "en",
      "year": 1937,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-wrong-road-1937",
      "id": "the-wrong-road-1937",
      "title": "The Wrong Road (1937)",
      "description": "A young married couple whose plans for their life together haven't turned out as expected decide to rob the bank where the husband works of $100,000, then hide the money in a safe place and return for it after they serve out their sentences. All goes according to plan until they get out of prison, when they find that they're being trailed by an insurance investigator and the husband's old cellmate, who has decided that he wants a cut of the money. Watch on RetroFlix:  https://retroflix.org/the-wrong-road-1937/",
      "fileSize": 132112609,
      "addedAt": "2026-01-07T00:12:33.207Z",
      "thumbnail": "https://archive.org/services/img/the-wrong-road-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 139
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/wrong-road",
      "id": "wrong-road",
      "title": "Wrong Road, The",
      "description": "Taken from IMDB : A young married couple whose plans for their life together haven't turned out as expected decide to rob the bank where the husband works of $100,000, then hide the money in a safe place and return for it after they serve out their sentences. All goes according to plan until they get out of prison, when they find that they're being trailed by an insurance investigator and the husband's old cellmate, who has decided that he wants a cut of the money.",
      "fileSize": 846978312,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/wrong-road",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 9835
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/wrong_road",
      "id": "wrong_road",
      "title": "Wrong Road",
      "description": "Spoiled young lovers rob bank and hide the loot. Lionell Atwill tries to find it. With Richard Cromwell and Helen Mack.",
      "fileSize": 4418774289,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/wrong_road",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 52086
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YD5RQC4FSdg",
      "id": "YD5RQC4FSdg",
      "title": "The Wrong Road (1937) CRIME-THRILLER",
      "description": "Stars: Richard Cromwell, Helen Mack, Lionel Atwill \n Director: James Cruze\n\n After being released from jail, a young couple search for their stolen loot so they can start a new life.",
      "addedAt": "2025-12-26T23:53:31.242Z",
      "thumbnail": "https://i.ytimg.com/vi/YD5RQC4FSdg/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLABBwnA6PvczRDP_baW0559dmKA7g",
      "duration": 3185,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=41jfnjH9tgo",
      "id": "41jfnjH9tgo",
      "title": "The Wrong Road (1937) Crime, Drama Full Length Movie",
      "description": "Bank teller Jimmy Caldwell and his fiance, Ruth Holden, grow weary of struggling to make ends meet and decide to rob Jimmy's bank. \n\nDirector: James Cruze\nWriters: Gordon Rigby, Eric Taylor \nStars: Richard Cromwell, Helen Mack, Lionel Atwill \nGenres: Classics, Crime, Drama \n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:50:23.374Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/41jfnjH9tgo/maxresdefault.webp?v=62684580",
      "duration": 3177,
      "language": "en",
      "year": 1937,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 5.3,
    "imdbVotes": 314,
    "Genre": "Action, Crime, Drama",
    "Plot": "Bank teller Jimmy Caldwell and his fiance, Ruth Holden, grow weary of struggling to make ends meet and decide to rob Jimmy's bank. The selfish young couple agree that even if they spend ten years in prison, it will not matter because they will have the money when they are released. During what appears to be a normal transaction, Jimmy gives Ruth $100,000 that he has taken from the vault, and after they hide the money in a music box, which they mail to Ruth's Uncle Billy for safekeeping, they turn themselves in. Mike Roberts, a detective for the bank's insurance company, tries to convince them to lighten their sentence by returning the money, but they consider the money rightfully theirs and refuse. The judge hearing their case is dismayed by their lack of repentance, and sentences them to one-to-ten years without parole. Jimmy and Ruth are then sent to separate prisons, but communicate by notes. Jimmy's tough cellmate, Blackie Clayton, tries to find out where the money is hidden, but Jimmy gives him misleading information. Sometime later, Roberts arranges for Jimmy and Ruth's paroles and attaches special stipulations that he hopes will make them go straight. The couple are paroled under the conditions that they have no civil rights and cannot marry for eight years. They are crushed by the conditions, but will not give in when Roberts tells them they will be free if they return the money. They try to retrieve the music box from Uncle Billy, but they discover that he has died and that his possessions are to be auctioned. They go to the auction, where they are outbid by auction aficionado Victor J. Holbrook, after which they go to Holbrook's apartment and explain that they need the box. Holbrook tells them he has already sent the box to his aunt, Martha Foster, and when Ruth and Jimmy return to their boardinghouse, they find Blackie waiting for them. He orders them to cut him in on the stolen money, but when Roberts appears, Blackie sneaks out after stealing their money and car. Jimmy and Ruth hop a train to Sunnydale, where Martha lives, and although they are detained by sheriff Ira Foster, Martha's husband, until they show their parole papers, they find Martha's guest farm, check in and locate the music box. After dinner, Roberts, alerted by Ira, shows up to warn Jimmy and Ruth that Blackie is close on their trail. Later that night, Blackie threatens Ruth that he will kill Jimmy unless she gives him the money. Jimmy and Ruth attempt to elude Blackie, but he soon catches up with them and fights with Jimmy. Ruth knocks Blackie out with the music box, after which Roberts appears on the scene. The beleaguered young couple give Roberts the money and determine to live an honest life, in which they will earn their happiness instead of stealing it.",
    "Director": "James Cruze",
    "Writer": "Gordon Rigby, Eric Taylor",
    "Actors": "Richard Cromwell, Helen Mack, Lionel Atwill",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030169",
    "tt0028719",
    "tt0029112",
    "tt0028943",
    "tt0030898",
    "tt0027354",
    "tt0027406",
    "tt0030164",
    "tt0030168",
    "tt0028525",
    "tt0028132",
    "tt0030777"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}