{
  "imdbId": "tt0073686",
  "title": "Seven Alone",
  "year": 1974,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/seven-alone-1974",
      "id": "seven-alone-1974",
      "title": "Seven Alone (1974)",
      "description": "A fictionalized account of the real-life adventure of the Sager family. Travelling with a wagon train from Missouri to Oregon, things are going well for the Sagers, until father Sager dies from blood poisoning following an Indian attack, and mother Sager dies soon afterward from pneumonia. The leaders of the wagon train decide to send the children back, but the oldest, John (who had been described by all the adults as lazy and worthless), decides to lead his siblings through the wilderness to complete the journey their parents started. Watch on RetroFlix:  https://retroflix.org/seven-alone-1974/",
      "fileSize": 598542494,
      "addedAt": "2026-01-07T00:10:50.364Z",
      "thumbnail": "https://archive.org/services/img/seven-alone-1974",
      "language": "eng",
      "year": 1974,
      "collection": "feature_films",
      "downloads": 167
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "97 min",
    "imdbRating": 5.6,
    "imdbVotes": 671,
    "Genre": "Adventure, Drama, Family",
    "Plot": "A fictionalized account of the real-life adventures of the Sager family. Travelling with a wagon train from Missouri to Oregon, things are going well for them, until Henry dies from blood poisoning following an Indian attack, and Naomi dies soon afterward from pneumonia. The leaders of the wagon train decide to send the children back to Missouri, but the oldest, John (who had been described by all the adults as lazy and worthless), decides to lead his siblings through the wilderness to complete the journey their parents started.",
    "Director": "Earl Bellamy",
    "Writer": "Honore Morrow, Douglas C. Stewart, Eleanor Lamb",
    "Actors": "Dewey Martin, Anne Collings, Aldo Ray",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0072615",
    "tt0066987",
    "tt0026164",
    "tt0028827",
    "tt0072231",
    "tt0046672",
    "tt0311354",
    "tt0071566",
    "tt0109279",
    "tt0043067",
    "tt0080531",
    "tt3906724"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.365Z"
}