{
  "movieId": "tt0054756",
  "title": "The Colossus of Rhodes",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-colossus.-of.-rhodes.-1961.272p",
      "id": "the.-colossus.-of.-rhodes.-1961.272p",
      "title": "The Colossus Of Rhodes (1961)",
      "description": "The Colossus of Rhodes is a 1961 Italian sword and sandal film co-written and directed by Sergio Leone. Starring Rory Calhoun. It is a fictional account of the island of Rhodes during its classical period in the late third century BC before coming under Roman control, using the Colossus of Rhodes as a backdrop for the story of a war hero who becomes involved in two different plots to overthrow a tyrannical king: one by Rhodian patriots and the other by Phoenician agents.",
      "fileSize": 1454200963,
      "addedAt": "2026-01-07T00:12:33.207Z",
      "thumbnail": "https://archive.org/services/img/the.-colossus.-of.-rhodes.-1961.272p",
      "language": "ita (English voiced)",
      "year": 1961,
      "collection": "feature_films",
      "downloads": 259
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "127 min",
    "imdbRating": 5.8,
    "imdbVotes": 4571,
    "Genre": "Adventure, Drama, History",
    "Plot": "A Greek military hero named Darios visits his uncle in Rhodes in the year 280 BC. Rhodes has just finished constructing an enormous colossus of Apollo to guard its harbor and is planning an alliance with Phoenicia which would be hostile to Greece. Darios flirts with the beautiful Diala, daughter of the statue's mastermind, while becoming involved with a group of rebels headed by Peliocles. These rebels seek to overthrow the tyrannical King Serse as does Serse's evil second-in-command, Thar. The rebels' revolt seems to fail, with Peliocles and his men being captured and forced to provide amusement in the local arena, but an earthquake eventually upsets, not only the Colossus in the harbor, but the balance of power in Rhodes as well.",
    "Director": "Sergio Leone",
    "Writer": "Ennio De Concini, Sergio Leone, Cesare Seccia",
    "Actors": "Rory Calhoun, Lea Massari, Georges Marchal",
    "Language": "Italian",
    "Country": "Italy, France, Spain",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0055867",
    "tt0056042",
    "tt0056556",
    "tt0055719",
    "tt0053580",
    "tt0057225",
    "tt0051398",
    "tt0020030",
    "tt0017667",
    "tt0003740",
    "tt0055117",
    "tt0060218"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.207Z"
}