{
  "imdbId": "tt0039807",
  "title": "Second Chance",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/second-chance-1947",
      "id": "second-chance-1947",
      "title": "Second Chance (1947)",
      "description": "1947",
      "fileSize": 1200652522,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/second-chance-1947",
      "collection": "feature_films",
      "downloads": 1413
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "63 min",
    "imdbRating": 5.7,
    "imdbVotes": 48,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Joan Summers (Louise Currie) enters the office of jewel merchant Montclaire (Francis Pierlot) closely followed by Kendal Wolf (Kent Taylor). Each recognizes the other to be a jewel thief, and wordlessly they team together to steal a $30,000 diamond. Searched and questioned when the gem is missed, they are released....with the gem. Detective Sharpe (Larry Blake) is still suspicious and so is the head of Jeweler's Indemnity, who puts two underworld men on to retrieve the diamond. Kendal agrees to meet the two but the police are tipped and Sharpe confiscates the gem and the fence's money. Again Kendal and Joan are released, but each suspects the other of being an informer despite a growing romantic attachment. Kendal and Joan attend an exhibition of the Malabar diamonds, leave to follow a diamond-lade guest, overtake her car, shoot the chauffeur and slug the woman. At Kendal's apartment, Joan makes it clear that robbery, not murder, is her game. Two men and the robbed couple arrive and reveal the whole thing to be a hoax to test whether Joan will work with the gang and to assure them she wasn't the informer in the first theft.",
    "Director": "James Tinling",
    "Writer": "Arnold Belgard, Lou Breslow, John Patrick",
    "Actors": "Kent Taylor, Louise Currie, Dennis Hoey",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039787",
    "tt0038956",
    "tt0039515",
    "tt0039335",
    "tt0039224",
    "tt0039311",
    "tt0039482",
    "tt0039536",
    "tt0039217",
    "tt0040525",
    "tt0039730",
    "tt0039389"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.954Z"
}