{
  "imdbId": "tt0050986",
  "title": "Wild Strawberries",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/wild-strawberries",
      "id": "wild-strawberries",
      "title": "Wild Strawberries",
      "description": "Traveling to accept an honorary degree, Professor Isak Borg—masterfully played by the veteran filmmaker and actor Victor Sjöström—is forced to face his past, come to terms with his faults, and make peace with the inevitability of his approaching death. Through flashbacks and fantasies, dreams and nightmares,  Wild Strawberries  dramatizes one man’s remarkable voyage of self-discovery. This richly humane masterpiece, full of iconic imagery, is one of Ingmar Bergman’s most widely acclaimed and influential films.",
      "fileSize": 7445455221,
      "addedAt": "2026-01-07T00:13:06.704Z",
      "thumbnail": "https://archive.org/services/img/wild-strawberries",
      "language": "swe",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 27727
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "92 min",
    "imdbRating": 8.1,
    "imdbVotes": 122286,
    "Genre": "Drama, Romance",
    "Plot": "With the exception of his elderly housekeeper Miss Agda who he treats almost like a surrogate platonic wife, widowed seventy-eight year old Dr. Isak Borg, a former medical doctor and professor, has retreated from any human contact, partly his own want but partly the decision of others who do not want to spend time with him because of his cold demeanor. He is traveling from his home in Stockholm to Lund to accept an honorary degree. Instead of flying as was the original plan, he decides to take the day long drive instead. Along for the ride is his daughter-in-law Marianne, who had been staying with him for the month but has now decided to go home. The many stops and encounters along the way make him reminisce about various parts of his life. Those stops which make him reminisce directly are at his childhood summer home, at the home of his equally emotionally cold mother, and at a gas station where the attendants praise him as a man for his work. But the lives of other people they encounter almost mirror his own, including hitchhikers Sara, Viktor and Anders - who remind him of his cousin Sara who he was going to marry, himself and his irresponsible brother Sigfrid who Sara eventually married - a bickering married couple Sten and Berit Alman, and Marianne and her husband and Isak's son Evald, whose marriage is as strained as was his own.",
    "Director": "Ingmar Bergman",
    "Writer": "Ingmar Bergman",
    "Actors": "Victor Sjöström, Bibi Andersson, Ingrid Thulin",
    "Language": "Swedish, Latin",
    "Country": "Sweden",
    "Awards": "Nominated for 1 Oscar. 16 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt0050976",
    "tt0050782",
    "tt0050634",
    "tt0060827",
    "tt0050379",
    "tt0050204",
    "tt0050208",
    "tt0199395",
    "tt0050882",
    "tt6725014",
    "tt0051090",
    "tt0057358"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}