{
  "imdbId": "tt0032247",
  "title": "Beyond Tomorrow",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BeyondTomorrow720p1940",
      "title": "Beyond Tomorrow",
      "description": "Title: Beyond Tomorrow Summary: The ghosts of three elderly industrialists killed in an airplane crash return to Earth to help reunite a young couple whom they initially brought together. Directed by: A. Edward Sutherland Actors: Production Company: Academy Productions Release Date: 10 May 1940 (USA) Aspect Ratio: 1.37 : 1 Melton, Chadwick and O'Brien, rich but lonely heads of an engineering firm, invite three strangers to dinner on Christmas Eve. Only two show up, James and Jean, they fall in love and become friends with their three benefactors...until the latter are killed in a plane crash and come back to their old home as ghosts. In the coming months, true love encounters some rough spots; can ghostly O'Brien help the young folks?",
      "id": "BeyondTomorrow720p1940"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Www.VDBEYONDTOMORROW1940",
      "title": "BEYOND TOMORROW ( 1940)",
      "description": "George Vale Melton (Harry Carey), Allan Chadwick (C. Aubrey Smith) and Michael O'Brien (Charles Winninger) are rich but lonely, so they invite a pair of strangers, schoolteacher Jean Lawrence (Jean Parker) and cowboy James Houston (Richard Carlson) to their house for dinner on Christmas Eve. Both Ja mes and Jean seem to hit it off, but the next day the three old men are killed in a plane crash. Now ghosts, the three work from the afterworld to make sure the young couple stays together.",
      "id": "Www.VDBEYONDTOMORROW1940"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beyond-tomorrow-1940",
      "title": "Beyond Tomorrow (1940)",
      "description": "The ghosts of three elderly industrialists killed in an airplane crash return to Earth to help reunite a young couple whom they initially brought together. Watch on RetroFlix:  https://retroflix.org/beyond-tomorrow-1940/",
      "id": "beyond-tomorrow-1940"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CE3qv9opw90",
      "title": "Beyond Tomorrow (1940) | Colorized Public Domain Christmas Fantasy Drama",
      "description": "Beyond Tomorrow (1940), also known in some releases as Beyond Christmas, is an American holiday fantasy drama directed by A. Edward Sutherland. This restored and colorized version revives a heartfelt story that blends themes of generosity, love, tragedy, and spiritual redemption. Made on the eve of World War II, the film carries a timeless message about the power of kindness and human connection, making it a treasured seasonal classic. With its unique mix of romance, supernatural elements, and moral reflection, Beyond Tomorrow has endured as one of the most memorable holiday dramas of Hollywood’s Golden Age.\n\nPlot Summary:\nThe story begins with three wealthy but lonely businessmen—Jeremiah (Charles Winninger), George (C. Aubrey Smith), and Allan (Harry Carey)—who invite two strangers to share Christmas Eve dinner after losing faith in their expected guests. The strangers are James (Richard Carlson), a struggling cowboy-turned-radio singer, and Jean (Jean Parker), a kindhearted young teacher. Love blossoms between James and Jean, and the three businessmen find new hope in their company.\n\nBut tragedy soon strikes when the men are killed in a plane crash, leaving James and Jean to carry on without their guiding presence. From beyond the grave, Jeremiah, George, and Allan watch over the young couple. Two of the spirits are able to find peace, but one remains earthbound, troubled by doubt and guilt. The supernatural layer of the story elevates the drama into a meditation on morality, forgiveness, and the importance of living a life guided by kindness.\n\nCast and Crew:\n• Director: A. Edward Sutherland\n• Producers: Adele Rogers, Buddy DeSylva\n• Screenplay: Adele Comandini\n• Cinematography: Lester White\n• Music: Cy Feuer, Edward Ward\n\nStarring:\n• Charles Winninger as Jeremiah\n• C. Aubrey Smith as George Melton\n• Harry Carey as Allan Chadwick\n• Jean Parker as Jean Lawrence\n• Richard Carlson as James Houston\n• Maria Ouspenskaya as Madame Tanya\n\nFilm Significance:\nThough not as widely known as other holiday films, Beyond Tomorrow holds a special place in cinema history as one of the earliest supernatural Christmas dramas. It predates later classics such as It’s a Wonderful Life (1946) and shares thematic similarities about how human kindness echoes beyond death. With its blend of spiritual fantasy and romance, the film continues to resonate with audiences during the holiday season.\n\nThe performances of Winninger, Smith, and Carey as the benevolent businessmen add warmth and depth, while Jean Parker and Richard Carlson embody youthful love and hope. Maria Ouspenskaya provides a poignant supporting role as Madame Tanya, who offers wisdom and guidance. Together, the ensemble brings to life a story that is both intimate and universal.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Beyond Tomorrow remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white, Beyond Tomorrow used shadows and atmosphere to enhance its mood. This new colorized edition brings the rich holiday settings, costumes, and emotions to life, deepening the immersive experience. Audiences can now experience the warmth of Christmas traditions, the sorrow of loss, and the hope of redemption in a way that feels both authentic to the past and relevant today.\n\nLegacy:\nAlthough overshadowed by other Christmas classics, Beyond Tomorrow has steadily grown in recognition for its heartfelt story and unique supernatural element. It embodies the spirit of generosity and reminds audiences that acts of kindness can ripple far beyond one’s lifetime. For fans of classic holiday films, this colorized version ensures the film is preserved and celebrated for generations to come.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including holiday dramas, timeless romances, and unforgettable treasures from Hollywood’s past. Our goal is to preserve and revitalize these works for audiences in the USA, Europe, and worldwide.\n\n#BeyondTomorrow #BeyondChristmas #PublicDomainMovie #ColorizedClassic #ChristmasMovie #HolidayClassic #FilmRestoration #1940sCinema #ClassicHollywood #GoldenAgeDrama",
      "id": "CE3qv9opw90",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BeyondTomorrow_750",
      "title": "Beyond Tomorrow",
      "description": "Title: Beyond Tomorrow Summary: The ghosts of three elderly industrialists killed in an airplane crash return to Earth to help reunite a young couple whom they initially brought together. Directed by: A. Edward Sutherland Actors: Production Company: Academy Productions Release Date: 10 May 1940 (USA) Aspect Ratio: 1.37 : 1 Melton, Chadwick and O'Brien, rich but lonely heads of an engineering firm, invite three strangers to dinner on Christmas Eve. Only two show up, James and Jean, they fall in love and become friends with their three benefactors...until the latter are killed in a plane crash and come back to their old home as ghosts. In the coming months, true love encounters some rough spots; can ghostly O'Brien help the young folks?",
      "id": "BeyondTomorrow_750"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Beyond_Tomorrow",
      "title": "Beyond Tomorrow",
      "description": "Three ghosts try to help two young lovers whom they knew when alive in this Christmas classic. IMDb",
      "id": "Beyond_Tomorrow"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OVXSJGWsMqc",
      "title": "Beyond Tomorrow (1940) CHRISTMAS FANTASY",
      "description": "Stars: Harry Carey, C. Aubrey Smith, Jean Parker, Richard Carlson\nDirector: A. Edward Sutherland\n\nIn this rare holiday treasure, the ghosts of three elderly industrialists return to reunite a young couple they once brought together on Christmas Eve. Be sure to watch for the amazing character actor Maria Ouspenskaya.",
      "id": "OVXSJGWsMqc",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beyond-tomorrow-1940-colorized-movie-576p-sd",
      "title": "Beyond Tomorrow (restored) (1940, fantasy, imdb score: 6.5)",
      "description": "Beyond Tomorrow (also known as And So Goodbye and Beyond Christmas ) is a 1940 American fantasy film directed by A. Edward Sutherland and produced by noted cinematographer Lee Garmes ; Garmes was one of a handful of cinematographers who became film producers. Structured as a B film , the production did not engage any stars who would receive billing above the title, relying instead on a quartet of veteran character actors, Charles Winninger , Maria Ouspenskaya , C. Aubrey Smith and Harry Carey , second-tier young leads Richard Carlson and Jean Parker as well as \"other woman\" Helen Vinson , a minor lead/second lead actress during the early- and mid-1930s, here approaching the end of her career. All seven actors received a \"Featuring\" billing after the title. The remaining supporting cast included Rod La Rocque , a top leading man of the silent era, now reduced to playing minor supporting roles. Because the events of the plot take place during the Christmas season, it is a contemporary, but little-remembered example of the Christmas film . The original print has been digitally remastered and preserved by the National Film Museum, Incorporated.",
      "id": "beyond-tomorrow-1940-colorized-movie-576p-sd"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": "6.5",
    "imdbVotes": "2,497",
    "Genre": "Drama, Fantasy, Romance",
    "Plot": "Melton, Chadwick and O'Brien, rich but lonely heads of an engineering firm, invite three strangers to dinner on Christmas Eve. Only two show up, James and Jean, they fall in love and become friends with their three benefactors, until the latter are killed in a plane crash and come back to their old home as ghosts. In the coming months, true love encounters some rough spots. Can ghostly O'Brien help the young folks?",
    "Director": "A. Edward Sutherland",
    "Writer": "Adele Comandini, Mildred Cram",
    "Actors": "Harry Carey, C. Aubrey Smith, Charles Winninger",
    "Language": "English, Russian",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0033532",
      "title": "The Devil and Daniel Webster",
      "year": 1941,
      "imdbRating": "7.6",
      "imdbVotes": "6,213",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037253",
      "title": "Secret Command",
      "year": 1944,
      "imdbRating": "6.3",
      "imdbVotes": "361",
      "language": "English, Mandarin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032637",
      "title": "The Invisible Woman",
      "year": 1940,
      "imdbRating": "6.0",
      "imdbVotes": "3,517",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031082",
      "title": "Barricade",
      "year": 1939,
      "imdbRating": "5.7",
      "imdbVotes": "158",
      "language": "English, Mandarin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032599",
      "title": "His Girl Friday",
      "year": 1940,
      "imdbRating": "7.8",
      "imdbVotes": "67,176",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032179",
      "title": "21 Days Together",
      "year": 1940,
      "imdbRating": "6.1",
      "imdbVotes": "1,285",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000966",
      "title": "A Midsummer Night's Dream",
      "year": 1909,
      "imdbRating": "5.7",
      "imdbVotes": "355",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032588",
      "title": "Herz ohne Heimat",
      "year": 1940,
      "imdbRating": "6.4",
      "imdbVotes": "15",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033297",
      "title": "Zwischen Hamburg und Haiti",
      "year": 1940,
      "imdbRating": "5.8",
      "imdbVotes": "17",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032428",
      "title": "East Side Kids",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "292",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014249",
      "title": "The Man Without Desire",
      "year": 1923,
      "imdbRating": "6.4",
      "imdbVotes": "23",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032842",
      "title": "Night Train to Munich",
      "year": 1940,
      "imdbRating": "7.2",
      "imdbVotes": "5,888",
      "language": "English, German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T19:05:19.075Z"
}