{
  "imdbId": "tt0004286",
  "title": "The Magic Cloak of Oz",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MagicCloakOfOZ",
      "title": "Magic Cloak Of OZ",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 843835337,
      "id": "MagicCloakOfOZ"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Magic_Cloak_of_Oz_1914",
      "title": "The Magic Cloak of Oz",
      "description": "The Magic Cloak of Oz is a 1914 film directed by J. Farrell MacDonald. It was written by L. Frank Baum and produced by Baum and composer Louis F. Gottschalk. The film is an adaptation of Baum's novel, Queen Zixi of Ix. ***** UPDATE 9 July 2010: The original upload was plagued with problems and has been replaced by a higher quality DivX file encoded directly from a new PAL DVD transfer from the original print.",
      "fileSize": 1003147025,
      "id": "Magic_Cloak_of_Oz_1914"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMagicCloakOfOz1914",
      "title": "The Magic Cloak",
      "description": "Title: The Magic Cloak Summary: The fairies of Oz gather in the forest of Burzee one evening and weave a magic cloak that gives the wearer one wish, so long as it has not been stolen. The man in the moon tells them that ... Directed by: J. Farrell MacDonald Actors: Production Company: The Oz Film Manufacturing Company Release Date: 28 September 1914 (USA) Aspect Ratio: 1.33 : 1 The fairies of Oz gather in the forest of Burzee one evening and weave a magic cloak that gives the wearer one wish, so long as it has not been stolen. The man in the moon tells them that their messenger should give it to the first miserable person she sees. Two children, Fluff and her younger brother \"Bud\" (a child's attempt at \"brother,\" which stuck), have just lost their father and are taken by Aunt Rivette to live in Nole, the capital city of Noland, where the king has just died without heir. The messenger gives Fluff the cloak, who wishes to be happy again, while a legal loophole places Bud on the throne, and they empty the treasury to buy toys. Their pet mule Nickodemus is captured by robbers and puts together a small animal army (including the Cowardly Lion, the Hungry Tiger, the Lonesome Zoop, the Woozy, and others) to battle the Rolly Rogues that have invaded the city. The cloak is nowhere to be found because 683 year old bewitching Queen Zixi of neighboring Ix, has been ...",
      "fileSize": 388950495,
      "id": "TheMagicCloakOfOz1914"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-magic-cloak",
      "title": "The Magic Cloak",
      "fileSize": 575565865,
      "id": "silent-the-magic-cloak"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-magic-cloak-of-oz-1914-directed-by-j.-farrell-mac-donald-36min",
      "title": "The Magic Cloak Of Oz (1914) Directed By J. Farrell Mac Donald",
      "description": "The Magic Cloak of Oz Directed by J. Farrell MacDonald Written by L. Frank Baum Based on Queen Zixi of Ix by L. Frank Baum Produced by L. Frank Baum Louis F. Gottschalk Starring Juanita Hansen Violet MacMillan Mildred Harris Vivian Reed Fred Woodward Cinematography James A. Crosby Music by Louis F. Gottschalk Production company The Oz Film Manufacturing Company Distributed by Paramount Pictures Release date September 28, 1914 Running time c. 38 minutes (short version) 60 minutes (longer version at 18 frames per second) 43 minutes (longer version at 24 frames per second) Country United States Languages Silent Film English intertitles The Magic Cloak of Oz is a 1914 film directed by J. Farrell MacDonald. It was written by L. Frank Baum and produced by Baum and composer Louis F. Gottschalk . The film is an adaptation of Baum's 1905 novel , Queen Zixi of Ix . [ 1 ] This was the second film of the Oz Film Manufacturing Company , following The Patchwork Girl of Oz . The film was followed by His Majesty, the Scarecrow of Oz . [ 2 ] Production The Magic Cloak of Oz had distribution problems, owing to the box office failure of The Patchwork Girl of Oz . Advertisements claimed that the film would be released September 28, 1914, by Paramount Pictures , but this apparently never occurred. It was eventually reduced from a five-reel film to two two-reel films known as The Magic Cloak and The Witch Queen . [ 1 ] The current prints are assembled from these two films, and so the film is incomplete. All of its titles are missing, and The Magic Cloak title card, which is not in The Oz Film Manufacturing Company style, is used without any additional credits. Its only allusion to Oz is a title card's claim that the fairies of Burzee are \"fairies of Oz\". Cast Intertitles confirm that the cast included Violet MacMillan as Timothy, or Bud, who becomes king of Noland due to a legal loophole; Mildred Harris as his sister, Margaret, or Fluff; Fred Woodward as Nicodemus, the mule , and possibly some other animals as well, and Vivian Reed as Quavo, the minstrel. Juanita Hansen appeared in the film, early in her career. 16 mm prints of this film are distributed by Em Gee and have been released on home video in various formats with different, and sometimes no, musical accompaniments. None include that which Gottschalk wrote for the film. Its highest profile release is on the third disc of the 2005 3-disc edition of The Wizard of Oz . One of the surviving prints of the film (housed at the Library of Congress) consists of 3 reels, which translates to 38 minutes runtime, at 18 frames per second ). In 2009, a longer version of the film was released on DVD and Blu-ray (though not in high definition) as part of the Ultimate Collector's Editions of The Wizard of Oz . The presentation runs about seventeen minutes longer than the 2005 version (if it were played at 18 frames, but is played at 24 frames per second and runs at 42 minutes) and does not contain a musical score. Additional scenes were included, and subplots were expanded upon, including Nickodemus getting help from four witches (from His Majesty, the Scarecrow of Oz ), the Roly-Rogues clapping hands on a hill and a sailor making a necktie of a piece of the Magic Cloak he bought. This version was only held in private collections and shown at private conventions prior to the home video release. Blooper One intertitle refers to Jikki as \"silly old Zixi\". Later Zixi is introduced with the same name. The name Jikki is used in the book for the first character, but never in the intertitles as a result of this mistake. References 1 Simpson, Paul (2013). A Brief Guide to Oz . Constable & Robinson Ltd. pp. 72–74. ISBN   978-1-47210-988-0 . Retrieved 10 February 2024 . 2 Swartz, Mark Evan (2002). Oz Before the Rainbow: L. Frank Baum's the Wonderful Wizard of Oz on Stage and Screen to 1939 . Baltimore, Maryland: JHU Press. p. 193. ISBN   978-0801870927 . Retrieved July 20, 2015 . From Wikipedia, the free encyclopedia",
      "fileSize": 783649237,
      "id": "the-magic-cloak-of-oz-1914-directed-by-j.-farrell-mac-donald-36min"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "38 min",
    "imdbRating": 5.2,
    "imdbVotes": 356,
    "Genre": "Short, Adventure, Family",
    "Plot": "The fairies of Oz gather in the forest of Burzee one evening and weave a magic cloak that gives the wearer one wish, so long as it has not been stolen. The man in the moon tells them that their messenger should give it to the first miserable person she sees. Two children, Fluff and her younger brother \"Bud\" (a child's attempt at \"brother,\" which stuck), have just lost their father and are taken by Aunt Rivette to live in Nole, the capital city of Noland, where the king has just died without heir. The messenger gives Fluff the cloak, who wishes to be happy again, while a legal loophole places Bud on the throne, and they empty the treasury to buy toys. Their pet mule Nickodemus is captured by robbers and puts together a small animal army (including the Cowardly Lion, the Hungry Tiger, the Lonesome Zoop, the Woozy, and others) to battle the Rolly Rogues that have invaded the city. The cloak is nowhere to be found because 683 year old bewitching Queen Zixi of neighboring Ix, has been informed by Quavo the minstrel of the cloaks power, and wants to see herself young and beautiful, as others see her, but she cannot.",
    "Director": "J. Farrell MacDonald",
    "Writer": "L. Frank Baum",
    "Actors": "Mildred Harris, Violet MacMillan, Fred Woodward",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0004099",
      "title": "His Majesty, the Scarecrow of Oz",
      "year": 1914,
      "imdbRating": 5.4,
      "imdbVotes": 517,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004457",
      "title": "The Patchwork Girl of Oz",
      "year": 1914,
      "imdbRating": 5.5,
      "imdbVotes": 581,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005482",
      "title": "The Hidden City",
      "year": 1915,
      "imdbRating": 4.8,
      "imdbVotes": 9,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002983",
      "title": "A House Divided",
      "year": 1913,
      "imdbRating": 6,
      "imdbVotes": 569,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004873",
      "title": "Alice in Wonderland",
      "year": 1915,
      "imdbRating": 6.1,
      "imdbVotes": 795,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002113",
      "title": "À la conquête du pôle",
      "year": 1912,
      "imdbRating": 6.9,
      "imdbVotes": 1249,
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002342",
      "title": "Man's Genesis",
      "year": 1912,
      "imdbRating": 5.7,
      "imdbVotes": 112,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007145",
      "title": "One A.M.",
      "year": 1916,
      "imdbRating": 7,
      "imdbVotes": 3688,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0189846",
      "title": "Homer's Odyssey",
      "year": 1911,
      "imdbRating": 6,
      "imdbVotes": 165,
      "language": "None, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002910",
      "title": "Granddad",
      "year": 1913,
      "imdbRating": 6,
      "imdbVotes": 89,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002816",
      "title": "The Drummer of the 8th",
      "year": 1913,
      "imdbRating": 5.9,
      "imdbVotes": 128,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001463",
      "title": "The Wonderful Wizard of Oz",
      "year": 1910,
      "imdbRating": 5.7,
      "imdbVotes": 1652,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}