{
  "movieId": "tt0024055",
  "title": "The Ghoul",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGhoul",
      "id": "TheGhoul",
      "title": "The Ghoul",
      "description": "The Ghoul is a 1933 British Horror film starring Boris Karloff, Cedric Hardwicke, Ernest Thesiger and Ralph Richardson, whose debut film this was. The plot centres around a Professor (Karloff) who is to be buried with an Egyptian jewel in order to attain eternal life. When the jewel is stolen by his servant, the professor rises from the dead to reclaim it. The film, based on the play and novel by Dr. Frank King and Leonard J. Hines, was once considered to be a lost film since the original nitrate negative had succumbed to decomposition and no prints of the film were known to exist. However, an incomplete and partly decomposed Czech release print was discovered which was the only available print for several decades. Then, finally, an excellent quality print was discovered in the archives of the British Film Institute. *****NOTE ABOUT COPYRIGHT STATUS OF THIS WORK***** This version is the Czech print. This item was public domain in the US due to the ommission of a copyright notice and failure to fulfill other copyright formalities. The item remains in the US public domain due to it's public domain status under UK law at the relevant date of GATT/URAA (1 January 1996) rendering it ineligible for restoration of copyright. Transitional terms of UK Copyright legislation stipulate that the copyright term for this film continues to be calculated under the terms of the 1911 UK Copyright Act. This film was released in the UK in 1933. Under the terms of the law at the time, Cinematograph Films were protected as a series of \"Photographs\" with a term of 50 years copyright from the date of publication, a \"sound recording\" with a copyright term of 50 years from recording or publication and a dramatic work of collective authorship with a copyright term of 50 calendar years from the death of the first deceased principal author or the passing of the actual calendar year of the death of the last surviving principal author. The first principle author to die was director T Hayes Hunter (1884-1944). All other principle authors died within 50 years of T Hayes Hunter. As such, under UK Copyright law the film entered the public domain at midnight on 31 December 1994.",
      "fileSize": 1849768574,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGhoul",
      "language": "English",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 417306
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gho484k",
      "id": "gho484k",
      "title": "The Ghoul (1933) [Colorized, 4K, 60FPS]",
      "description": "The Ghoul is a 1933 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com    Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io    A.I. Upscaling to 4K:  https://ffmpeg.org    GPU: Google Colab.  This movie is in public domain category and it is Copyright free.",
      "fileSize": 5124481909,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/gho484k",
      "collection": "feature_films",
      "downloads": 501
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-ghoul-1933",
      "id": "the-ghoul-1933",
      "title": "The Ghoul (1933)",
      "description": "Professor Morlant, a British Egyptologist, seeks immortality through the power of a jewel buried in the tomb of an Oriental idol. Upon his death, Morlant returns to earth to seek vengeance upon those who removed the jewel from his grave. Watch on RetroFlix: ",
      "fileSize": 502598549,
      "addedAt": "2026-01-07T00:11:57.688Z",
      "thumbnail": "https://archive.org/services/img/the-ghoul-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 1143
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-ghoul.-1933",
      "id": "the.-ghoul.-1933",
      "title": "The Ghoul (1933)",
      "description": "The Ghoul is a 1933 British horror film directed by T. Hayes Hunter and starring Boris Karloff. The cast also features Harold Huth, Dorothy Hyson, Ernest Thesiger, Cedric Hardwicke, and Ralph Richardson in his first credited film role.  The film  follows Professor Henry Morlant, an Egyptologist who believes that an ancient jewel called the \"Eternal Light\" will grant him rejuvenation powers when offered to the god Anubis. After his death, his servant steals the jewel, leading to a series of events where Morlant returns from the dead to exact revenge on those who betrayed him.",
      "fileSize": 1437203487,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-ghoul.-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 210
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": 5.8,
    "imdbVotes": 3369,
    "Genre": "Action, Drama, Horror",
    "Plot": "Aga Ben Dragore, a knife-wielding, enigmatic Egyptian Arab, is seeking a sacred jewel which has been stolen from an ancient tomb. The thief tells him that he sold it to Professor Morlant, a fanatical Egyptologist who fervently believes in the pagan power of the ancient Egyptian gods. Dying from a mysteriously disfiguring ailment, Morlant entrusts his faithful manservant to bandage the jewel in his hand and warns him of dire consequences if his dying wishes aren't carried out. After his burial in an Egyptian-type tomb on his estate, an anonymous robber steals the precious stone from the corpse. Although the ghastly-looking dead man rises at the next full moon to seek revenge, neither he nor the audience know which member of the household possesses the powerful jewel.",
    "Director": "T. Hayes Hunter",
    "Writer": "Frank King, Leonard Hines, Roland Pertwee",
    "Actors": "Boris Karloff, Cedric Hardwicke, Ernest Thesiger",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0026047",
    "tt0023938",
    "tt0082338",
    "tt0024176",
    "tt0023984",
    "tt0060168",
    "tt0023893",
    "tt0064240",
    "tt0089269",
    "tt0024245",
    "tt0024339",
    "tt0287733"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}