{
  "imdbId": "tt0081452",
  "title": "San mao liu lang ji",
  "year": 1980,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/san-mao-liu-lang-ji-1980",
      "id": "san-mao-liu-lang-ji-1980",
      "title": "San mao liu lang ji (1980)",
      "description": "San mao liu lang ji is a  1980 directed by Kan-Ping Yu. Watch on RetroFlix:  https://retroflix.org/san-mao-liu-lang-ji-1980/",
      "fileSize": 547706827,
      "addedAt": "2026-01-07T00:10:40.952Z",
      "thumbnail": "https://archive.org/services/img/san-mao-liu-lang-ji-1980",
      "language": "eng",
      "year": 1980,
      "collection": "feature_films",
      "downloads": 92
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "88 min",
    "imdbRating": 5.2,
    "imdbVotes": 88,
    "Genre": "Action, Comedy",
    "Plot": "After his father dies in a war and his master is shot to death by enemy soldiers, San Mao, a wandering orphan, is in search of the mother he never knew in this comical kung fu tale. Before his master's death, San Mao was taught various styles of acrobatic kung fu and uses these skills to showcase his talents on the street for money. While coming to one such town, he encounters a smart-mouthed little beggar named Qu Pu Li, who currently lives with a teenage orphan girl named Zsa Zsa Meng in the forest. When Qu Pu Li and San Mao meet, they don't exactly see eye to eye. But after a chance encounter with a brutal (but clumsy) man named Ironhead and some local thugs, San Mao and Qu Pu Li decide to put aside their differences and fight to take Ironhead down. Qu Pu Li is thankful for San Mao's help. As a result, he and Zsa Zsa Meng let San Mao stay at their straw home in the forest until San Mao is ready to leave town. While staying with them, Qu Pu Li and Zsa Zsa Meng warn San Mao to watch his step while he is in the village because it is run by Mr. Chu, a vicious man who knows rare styles of kung fu and wants to control the entire province. No one has dared to challenge his power. But all of that changes when a mysterious Korean wanderer named Eagle shows up and helps the three Kung Fu Kids when Ironhead and his thugs try to tear down their \"Stunt Show.\" Later, Eagle assassinates an aid for a local general who works with Mr. Chu to control the village. Eagle is caught in the process and tortured by Mr. Chu's thugs. The Kung Fu Kids decide to repay their debt to Eagle by helping him escape. Together with Chao Chin, Mr. Chu's good-hearted son, the four warriors work on a plan to overthrow Mr. Chu and his syndicate, so that they can restore order and peace to the once uncorrupted village.",
    "Director": "Kan-Ping Yu",
    "Writer": "Kan-Ping Yu",
    "Actors": "Ti Ou, Ho Wang, Hai-Fen Chang",
    "Language": "Mandarin",
    "Country": "Taiwan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0121116",
    "tt0189122",
    "tt0189123",
    "tt13423326",
    "tt0082516",
    "tt0079480",
    "tt0081061",
    "tt0079351",
    "tt0079891",
    "tt0430216",
    "tt0083914",
    "tt0086141"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.952Z"
}