{
  "movieId": "tt0076162",
  "title": "House",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house_20210324",
      "id": "house_20210324",
      "title": "House",
      "description": "How to describe Nobuhiko Obayashi’s indescribable 1977 movie  House  ( Hausu )? As a psychedelic ghost tale? A stream-of-consciousness bedtime story? An episode of  Scooby-Doo  as directed by Mario Bava? Any of the above will do for this hallucinatory head trip about a schoolgirl who travels with six classmates to her ailing aunt’s creaky country home and comes face-to-face with evil spirits, a demonic house cat, a bloodthirsty piano, and other ghoulish visions, all realized by Obayashi via mattes, animation, and collage effects. Equally absurd and nightmarish,  House  might have been beamed to Earth from some other planet. Never before available on home video in the United States, it’s one of the most exciting cult discoveries in years.",
      "fileSize": 7221693374,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/house_20210324",
      "language": "jpn",
      "year": 1977,
      "collection": "feature_films",
      "downloads": 25137
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "88 min",
    "imdbRating": 7.2,
    "imdbVotes": 36764,
    "Genre": "Comedy, Horror",
    "Plot": "Oshare (Gorgeous) is excited about spending summer vacation with her father, until she finds out that his beautiful, freakishly serene girlfriend Ryouko would be going as well. Oshare decides she will be going to her aunt's house in the country instead. She brings with her her friends from school - Fanta (who likes to take pictures, and daydreams a lot), KunFuu (who has very good reflexes), Gari/Prof (who is a major nerd), Sweet (who likes to clean), Mac (who eats a lot), and Melody (a musician). However, the girls are unaware that the house is actually haunted. When they arrive at the house, crazy events take place and the girls disappear one by one while slowly discovering the secret behind all the madness.",
    "Director": "Nobuhiko Ôbayashi",
    "Writer": "Chiho Katsura, Chigumi Ôbayashi",
    "Actors": "Kimiko Ikegami, Miki Jinbo, Kumiko Ôba",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0076665",
    "tt0072626",
    "tt0081107",
    "tt0070908",
    "tt0044925",
    "tt0076391",
    "tt0052655",
    "tt0043255",
    "tt0044406",
    "tt0068370",
    "tt0054768",
    "tt0035939"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.614Z"
}