{
  "imdbId": "tt0029522",
  "title": "School for Husbands",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sfh77754567",
      "id": "sfh77754567",
      "title": "School for Husbands",
      "description": "Title: School for Husbands Summary: A couple of lonesome wives, Marion Carter and Diana Cheswick fall for philanderer Leonard Drummon, and arrange to get their husbands, Geoffrey Carter and Morgan Cheswick, off to Paris so ... Directed by: Andrew Marton Actors: Rex Harrison, Diana Churchill, June Clyde Production Company: Richard Wainwright Productions Release Date: 6 February 1939 (USA) Aspect Ratio: 1.37 : 1 A couple of lonesome wives, Marion Carter and Diana Cheswick fall for philanderer Leonard Drummon, and arrange to get their husbands, Geoffrey Carter and Morgan Cheswick, off to Paris so they can be free for one night of fun and frolic. The husbands are all for this as they think it will cure their wives of being infatuated with this man-about-town. And they might run into some fun in Paris. Actually, the philanderer is the one who put the idea in their heads to go away so the coast will be clear for his marauding raid party, with no intentions of curing anybody of anything.",
      "fileSize": 716276662,
      "addedAt": "2026-01-07T00:10:50.365Z",
      "thumbnail": "https://archive.org/services/img/sfh77754567",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 4985
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 5.4,
    "imdbVotes": 27,
    "Genre": "Comedy, Romance",
    "Plot": "A couple of lonesome wives, Marion Carter (Diana Churchill) and Diana Cheswick (June Clyde) fall for philanderer Leonard Drummond (Sir Rex Harrison), and arrange to get their husbands, Geoffrey Carter (Henry Kendall) and Morgan Cheswick (Romney Brent), off to Paris so they can be free for one night of fun and frolic. The husbands are all for this as they think it will cure their wives of being infatuated with this man-about-town. And they might run into some fun in Paris. Actually, the philanderer is the one who put the idea in their heads to go away so the coast will be clear for his marauding raid party, with no intentions of curing anybody of anything.",
    "Director": "Andrew Marton",
    "Writer": "Frederick J. Jackson, Austin Melford, Gordon Sherry",
    "Actors": "Rex Harrison, Diana Churchill, June Clyde",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029611",
    "tt0233667",
    "tt0029521",
    "tt0028999",
    "tt0029165",
    "tt0029580",
    "tt0029605",
    "tt0028557",
    "tt0028575",
    "tt0028662",
    "tt0028816",
    "tt0028876"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.365Z"
}