{
  "imdbId": "tt0000638",
  "title": "At the Crossroads of Life",
  "year": 1908,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewCrossroadsOfLife",
      "id": "PreviewCrossroadsOfLife",
      "title": "\"Crossroads of Life\" (1908)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Crossroads of Life\" is a short drama.  The film is included in our program to illustrate the work of Robert Harron and Billy Bitzer, stars of Silent Hall of Fame.  A woman's stage success is bitter-sweet because of her quarrel with her father. The film is notable for the acting performance of D.W. Griffith as the suitor.   Directed by                       Wallace McCutcheon Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Marion Leonard, D.W. Griffith, Edward Dillon, Florence Auer, Robert Harron Distributed by                   Biograph Company Release date                      July 3, 1908 Country                             United States Running time                    9 m.     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 12468407,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewCrossroadsOfLife",
      "year": 1908,
      "collection": "feature_films",
      "downloads": 12006
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 4.9,
    "imdbVotes": 86,
    "Genre": "Short, Drama",
    "Plot": "The daughter of a staid New England minister is brought up in absolute ignorance of the ways of the outside world, and, when she gets the slightest inkling of its glamour, it makes a decided impression. Into her hands have fallen several theatrical newspapers, and she and her girl chum eagerly digest their contents, recounting in glowing terms what seems to be a golden existence. So wrought up were they that they immediately give vent to their ebullient spirits by indulging in a quasi-dramatic performance. This is a scene of broad burlesque, and, during its enaction, the minister enters and is greatly shocked, not to say incensed. A stormy scene occurs between him and his daughter, which ends with her leaving home. She applies for a position in the chorus of a New York opera company. What a contrast she makes at the trial of voices, but with determination she pulls through the ordeal and is accepted. Owing to her sweet face and manners, together with a beautiful voice, her rise in the profession is rapid. Still, she has found that all is not gold that glitters, and while her artistic success is most agreeable, life for her is empty, cold and cheerless, made more odious by the appearance of the inevitable vile, flattering tempter. Numerous letters has she written to her dear old father, but no response, for he has torn them into shreds before he even broke the seal. \"Oh, God, if I could only go back. If this all would prove but a dream.\" But, no, there is the dark fathomless future before her. The tempter would have her go with him, and there seems to be no alternative. She is now surely at the crossroads of life. She makes a final appeal to her father in a telegram begging him to come to see her performance on the night following, which he does. Down the aisle of the theater comes the old minister in bewilderment, so unaccustomed is he to the surroundings, as through the peekhole in the curtain drops the girl views the scene in ecstasy. After the performance the old man makes his way to the back of the stage, where he once more folds his daughter to his heart, while her would-be lover views the scene with unconcealed chagrin. The story is a most touching one.",
    "Director": "Wallace McCutcheon Jr.",
    "Writer": "D.W. Griffith",
    "Actors": "Linda Arvidson, Florence Auer, Edward Dillon",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000785",
    "tt0000648",
    "tt0000651",
    "tt0000764",
    "tt0000852",
    "tt0000854",
    "tt0000895",
    "tt0000936",
    "tt0000928",
    "tt0001431",
    "tt0001401",
    "tt0001227"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}