{
  "imdbId": "tt0021751",
  "title": "Clearing the Range",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ClearingtheRange",
      "id": "ClearingtheRange",
      "title": "Clearing the Range",
      "description": "Kildare (Hooper Atchley) kills Curt Fremont's (Hoot Gibson) brother Jim (Edward Hearn). When Curt arrives he poses as a coward in public but sneaks out unseen to become the daring El Capitan as he looks for the killer.",
      "fileSize": 1406877456,
      "addedAt": "2026-01-07T00:06:19.367Z",
      "thumbnail": "https://archive.org/services/img/ClearingtheRange",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 25582
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KVsKBWnMXmI",
      "id": "KVsKBWnMXmI",
      "title": "Clearing the Range (1931) HOOT GIBSON",
      "description": "Stars: Hoot Gibson, Sally Eilers, Hooper Atchley \n Director: Otto Brower\n\n Kildare kills Curt Fremont's brother Jim. When Curt arrives he poses as a coward in public but sneaks out unseen to become the daring El Capitan as he looks for the killer.",
      "addedAt": "2025-12-26T23:54:13.638Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/KVsKBWnMXmI/maxresdefault.webp",
      "duration": 3871,
      "language": "en",
      "year": 1931,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "61 min",
    "imdbRating": 5.2,
    "imdbVotes": 154,
    "Genre": "Western",
    "Plot": "In this Hoot Gibson version/swipe of the \"Zorro\" story, sneaky Lafe Kildare, the crooked cashier of a Texas bank, murders the bank president, Jim Fremont, to keep from being exposed as a thief. He covers up his crime, becomes president of the bank and is the leader of a small army of gunmen oppressing the ranchers of Comanche County. Curt Fremont rides in to investigate his brother's murder, and convinces Kildare that he is a harmless, brainless, worthless, no-account lazy drifter--- and might even be a sissy or a fop ---so Kildare decides he isn't worth the trouble of having him killed.Curt's pose also does nothing to impress rancher's daughter Mary Lou Moran as day-by-day he does nothing but lay around and eat and sleep and ignore Mary Lou, and Mary Lou is not use to being ignored. But... night after night, Curt rides out in a Mexican costume as a bandit called \"El Capitan\" and harasses Kildare's business enterprises to the point of becoming a nuisance. Kildare offers a reward for the capture of \"El Capitan.\" Curt, as \"El Capitan\" captures himself, robs Kildare of the reward money and turns it over Senora Conares, a Mexican woman whom Kildare has reduced to poverty.While Kildare and his henchies are out of town on a mission to attach the cattle belonging to Mary Lou's father, Curt has all the citizens busily firing at a shack where \"El Capitan\" is supposedly hiding, while he saunters over to the bank and steals the account books, which prove that Kildare is a crook. He captures Kildare's accomplice, Tom Vache, in the murder of his brother, forces a confession from him and takes him to Sheriff Jim Burke, to whom Curt has already turned over the bank's books. Kildare, in an escape attempt, is thrown from his horse and almost falls over a cliff, but Curt ropes him and turns him over to the sheriff. Along the way, George Mendoza plays \"La Paloma\" on a guitar just to reinforce the \"Zorro\" theme.",
    "Director": "Otto Brower",
    "Writer": "Jack Cunningham, Jack Natteford",
    "Actors": "Hoot Gibson, Sally Eilers, Hooper Atchley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023144",
    "tt0021940",
    "tt0022951",
    "tt0023970",
    "tt0022562",
    "tt0023123",
    "tt0023186",
    "tt0023912",
    "tt0022702",
    "tt0024524",
    "tt0021683",
    "tt0021861"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.367Z"
}