{
  "imdbId": "tt0026259",
  "title": "Danger Ahead",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/danger_ahead",
      "title": "Danger Ahead",
      "description": "Captain Matthews (John Elliot) is paid 40,000 dollars in cash by Nick Conrad (Bryant Washburn, who also played an attorney in 'Prison Mutiny') for his shipment of silk from China. About 15 seconds after he gets the cash, he's lured away on a false pretence and robbed by Conrad's henchmen. Newspaper reporter Jerry Mason (Lawrence Gray) witnesses the robbery and steals the cash from Conrad. Conrad's thugs (all of whom have mustaches and crisp suits) chase him into his friend Fred Klein (Fuzzy Knight)'s delicatessen. The two of them get taken back to Conrad and forced to talk. After fighting their way out of the Green Eagle Cafe again, they hightail it to Jerry's newspaper and tell the world (and the police) about Conrad's true profession. Afterwards Conrad and his henchmen try one gambit after another to get the money back. [Synopsis by uniQ .] You can find more information regarding this film on its IMDb page .",
      "id": "danger_ahead"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/danger_ahead_ipod",
      "title": "Danger Ahead",
      "description": "Captain Matthews (John Elliot) is paid 40,000 dollars in cash by Nick Conrad (Bryant Washburn, who also played an attorney in 'Prison Mutiny') for his shipment of silk from China. About 15 seconds after he gets the cash, he's lured away on a false pretence and robbed by Conrad's henchmen. Newspaper reporter Jerry Mason (Lawrence Gray) witnesses the robbery and steals the cash from Conrad. Conrad's thugs (all of whom have mustaches and crisp suits) chase him into his friend Fred Klein (Fuzzy Knight)'s delicatessen. The two of them get taken back to Conrad and forced to talk. After fighting their way out of the Green Eagle Cafe again, they hightail it to Jerry's newspaper and tell the world (and the police) about Conrad's true profession. Afterwards Conrad and his henchmen try one gambit after another to get the money back. [Synopsis by uniQ .]",
      "id": "danger_ahead_ipod"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AKY2OCWCmeM",
      "title": "Danger Ahead (1935) | Colorized Public Domain Crime Drama with Lawrence Gray & Sheila Bromley",
      "description": "Danger Ahead (1935) is an American crime-drama film directed by Albert Herman, now restored and colorized for a new generation of audiences. Originally released during the Great Depression, this thrilling story of gangsters, stolen money, and courageous reporting reflects the fast-paced entertainment of 1930s Hollywood. This edition breathes new life into a forgotten B-movie crime gem, making it accessible and engaging for audiences in the USA, Europe, and worldwide who want to enjoy vintage cinema in modern quality.\n\nPlot Summary:\nThe film begins as Captain Matthews docks his ship carrying a valuable silk shipment from China. Nick Conrad, a wealthy silk merchant, owes the Captain $40,000 for the cargo. After paying at the Green Eagle Café, Conrad’s henchmen lure the Captain away and orchestrate a robbery. Jerry Mason, a determined newspaper reporter, stumbles upon the crime and manages to recover the stolen cash but holds on to it, determined to expose the crooks and make his mark as a journalist. Conrad and his gang retaliate by using fake phone calls, impersonations, and threats to regain control of the money, leading to betrayals and escalating danger. The story culminates in a high-stakes showdown aboard the ship, where Mason bravely confronts the criminals. Conrad meets a fatal end, justice prevails, and Jerry not only restores the stolen funds but also earns the admiration of Captain Matthews and the affection of Lorraine, the Captain’s daughter.\n\nCast and Crew:\n• Director: Albert Herman\n• Screenplay: Al Martin\n• Based on a story by: Peter B. Kyne\n• Cinematography: William Hyer\n• Editing: Dan Milner\n\nStarring:\n• Lawrence Gray as Jerry Mason, the ambitious reporter\n• Sheila Bromley as Lorraine Matthews, Captain’s daughter\n• J. Farrell MacDonald as Harry Cromwell, the seasoned editor\n• Fuzzy Knight as Fred Klein, the butcher\n• Bryant Washburn as Nick Conrad, the scheming gangster\n• Fred Kelsey as Detective O’Brien\n• John Elliott as Captain Matthews\n• Supporting cast: Eddie Phillips, Arthur Loft, Herschel Mayall, Gordon Griffith, Earl Dwire, Richard Cramer, George Chesebro\n\nFilm Significance:\nDanger Ahead stands as a classic example of 1930s B-movie crime drama, a genre that thrived on suspenseful storytelling and moral themes at a time when audiences needed both escape and reassurance. With its combination of seedy criminals, heroic press figures, and quick-paced plotting, the film mirrors the cultural anxieties of its era while delivering straightforward entertainment. Though made outside the major studio system, it demonstrates the resourcefulness of low-budget productions and provides a valuable look at how independent films contributed to the Golden Age of Hollywood. The performances of Lawrence Gray and Sheila Bromley add emotional weight to the fast-moving story, and the action-driven climax makes it memorable among Depression-era crime films.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Danger Ahead remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1935 release of Danger Ahead was filmed in black and white, as was standard for the era’s low-budget crime features. While historically authentic, many viewers today are less inclined to watch black-and-white films. By offering a colorized and digitally restored edition, we preserve the story while enhancing its visual appeal. This edition sharpens details, enriches character expressions, and revitalizes the suspenseful dockside settings, allowing modern audiences to fully appreciate the energy of a classic Depression-era thriller. This version bridges the gap between cinematic history and modern viewing habits, making the film enjoyable not just as nostalgia, but as a lively piece of entertainment.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our mission is to preserve and share these works with audiences in the USA, Europe, and worldwide. By giving these films new life, we ensure they remain accessible, discoverable, and appreciated for generations to come.\n\n#DangerAhead1935 #PublicDomainMovie #ColorizedClassic #GoldenAgeCrimeDrama #LawrenceGray",
      "id": "AKY2OCWCmeM",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=W_cQ4ZuNFg8",
      "title": "Danger Ahead (1935) CRIME DRAMA",
      "description": "Stars: Lawrence Gray, Sheila Bromley, J. Farrell MacDonald \nDirector: Albert Herman\n\nA reporter witnesses a sea captain getting robbed by crooks after delivering $40,000 in silks. Paid in cash, it is a setup to steal the money back!",
      "id": "W_cQ4ZuNFg8",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c2HDPvQo_6k",
      "title": "Danger Ahead (1935) American crime drama film directed by Albert Herman",
      "description": "Captain Matthews is paid $40,000 for a silk shipment from China. The Green Eagle Café owner has the captain called away for a phone call but is robbed of the money. Local reporter sees the robbery and after a fist fight gets the money back and hides the money. The reporter gets a headline story and gets to meet the captain's daughter. Conrad and his henchman pose as the captain to get the cash returned.\n\nColorized version: https://youtu.be/hRq1lUV2Npg\n\n\nDirector: Albert Herman\nWriters: Peter B. Kyne, Al Martin\nStars: Lawrence Gray, Sheila Bromley, J. Farrell MacDonald\nGenres: Action, Crime, Drama. Pre-Noir\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "id": "c2HDPvQo_6k",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "65 min",
    "imdbRating": "5.5",
    "imdbVotes": "109",
    "Genre": "Action, Drama, Crime",
    "Plot": "A sea captain receives $40,000 from a crook, and the crooks try to steal it from him.",
    "Director": "Albert Herman",
    "Writer": "Peter B. Kyne, Al Martin",
    "Actors": "Lawrence Gray, Sheila Bromley, J. Farrell MacDonald",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0034637",
      "title": "The Dawn Express",
      "year": 1942,
      "imdbRating": "4.5",
      "imdbVotes": "234",
      "language": "German, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027201",
      "title": "What Price Crime",
      "year": 1935,
      "imdbRating": "5.3",
      "imdbVotes": "130",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029544",
      "title": "Shadows of the Orient",
      "year": 1935,
      "imdbRating": "4.6",
      "imdbVotes": "141",
      "language": "English, Mandarin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0169357",
      "title": "Valley of Terror",
      "year": 1937,
      "imdbRating": "5.9",
      "imdbVotes": "102",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0026458",
      "title": "The Headline Woman",
      "year": 1935,
      "imdbRating": "5.8",
      "imdbVotes": "135",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026206",
      "title": "Chinatown Squad",
      "year": 1935,
      "imdbRating": "6.1",
      "imdbVotes": "70",
      "language": "Cantonese, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026563",
      "title": "Kentucky Blue Streak",
      "year": 1935,
      "imdbRating": "4.0",
      "imdbVotes": "44",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026937",
      "title": "Rip Roaring Riley",
      "year": 1935,
      "imdbRating": "5.5",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027354",
      "title": "Beware of Ladies",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "102",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027406",
      "title": "Bulldog Edition",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "93",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030164",
      "title": "Fury Below",
      "year": 1936,
      "imdbRating": "5.3",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028525",
      "title": "You May Be Next!",
      "year": 1936,
      "imdbRating": "6.4",
      "imdbVotes": "68",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:51.628Z"
}