{
  "imdbId": "tt0023634",
  "title": "I Was Born, But...",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/i-was-born-but",
      "id": "i-was-born-but",
      "title": "I Was Born But,...",
      "description": "One of Ozu's most popular films,  I Was Born, But . . .  is a blithe portrait of the financial and psychological toils of one family, as told from the rascally point of view of a couple of stubborn little boys. For two brothers, the daily struggles of bullies and mean teachers is nothing next to the mortification they feel when they realize their good-natured father’s low-rung social status. Reworked decades later as Ozu's Technicolor comedy  Good Morning , it's a poignant evocation of the tumult of childhood, as well as a showcase for Ozu's expertly timed comedy editing.",
      "fileSize": 7451091208,
      "addedAt": "2026-01-07T00:08:46.615Z",
      "thumbnail": "https://archive.org/services/img/i-was-born-but",
      "language": "jpn",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 5861
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "90 min",
    "imdbRating": 7.9,
    "imdbVotes": 6611,
    "Genre": "Comedy, Drama",
    "Plot": "The Yoshi family - husband and wife Kennesuke and Haha, a middle manager at an office and a housewife respectively, and their two adolescent sons Keiji and Ryoichi - have just moved from the inner city to the suburbs of Tokyo, into the same neighborhood where Kennesuke's boss, Iwasaki, and his family live. The boys get off to a rocky start in their new neighborhood as they end up being bullied by a group of similarly aged boys, led by slightly bigger Kamekichi. Keiji and Ryoichi even secretly play hooky from school, not wanting to have to confront the bullies. After befriending Kozou, the older delivery boy at the local store who ends up being their protector of sorts, Keiji and Ryoichi are able to stand up to their tormentors to become the ones among the boys who call the shots. Their newfound pride takes a hit when they end up being at the same social gathering as their father and his coworkers at Iwasaki's house, and see that their father is a proverbial apple-polisher toward Iwasaki and not the important man they previously believed him to be. Kennesuke knows how his behavior looks to his sons, but justifies it to himself by probably being further ahead in life than they would be otherwise. The Yoshis will have to reconcile these two issues for harmony to return within their family.",
    "Director": "Yasujirô Ozu",
    "Writer": "Akira Fushimi, Geibei Ibushiya, Yasujirô Ozu",
    "Actors": "Tatsuo Saitô, Tomio Aoki, Mitsuko Yoshikawa",
    "Language": "None, Japanese",
    "Country": "Japan",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0022485",
    "tt0043313",
    "tt0051720",
    "tt0053134",
    "tt0053579",
    "tt0020563",
    "tt0024120",
    "tt0023937",
    "tt0021406",
    "tt0020980",
    "tt0023537",
    "tt0022628"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.615Z"
}