{
  "imdbId": "tt0011267",
  "title": "Headin' Home",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Heading_Home",
      "title": "Headin Home",
      "description": "Heading Home is a 1920 Silent feature starring Babe Ruth. http://www.imdb.com/title/tt0011267/",
      "id": "Heading_Home"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wZsKwgzrwkY",
      "title": "Headin’ Home (1920) | Colorized Public Domain Silent Sports Comedy with Babe Ruth’s Film Debut",
      "description": "Headin’ Home (1920) is an American silent comedy film directed by Lawrence C. Windom and produced by Kenean Buel. It is best remembered as the first feature film appearance of baseball legend Babe Ruth, then at the height of his popularity as a New York Yankees star. This restored and colorized public domain edition gives modern audiences in the USA, Europe, and beyond a rare chance to experience how Hollywood blended sports celebrity, Americana, and silent-era comedy into a uniquely entertaining piece of early cinema history.\n\nGeorge Herman \"Babe\" Ruth (February 6, 1895 – August 16, 1948) was an American professional baseball player whose career in Major League Baseball (MLB) spanned 22 seasons, from 1914 through 1935. Nicknamed \"the Bambino\" and \"the Sultan of Swat\" he began his MLB career as a star left-handed pitcher for the Boston Red Sox, but achieved his greatest fame as a slugging outfielder for the New York Yankees.\n\nPlot Summary:\nThe story presents a fictionalized version of Babe Ruth’s life. In the film, Ruth portrays himself as a humble small-town boy named Babe who rises from obscurity to baseball stardom. Far removed from the gritty realities of Ruth’s true biography, the plot depicts him as a kindhearted, honest, and modest youth, living with his widowed mother and his younger sister, Pigtails. Babe’s love interest is Mildred, the daughter of a local banker, whose disapproval sets the stage for much of the film’s conflict.\n\nBabe overcomes obstacles both on and off the baseball field. Despite ridicule from locals who underestimate him, his incredible talent as a slugger wins admiration and transforms him into a hero. In classic silent-comedy fashion, the movie combines slapstick humor, small-town antics, and sports spectacle, culminating in Babe’s triumphant success in the big leagues. Though not biographically accurate, Headin’ Home functions as both a star vehicle and a cultural snapshot of America’s fascination with baseball in the 1920s.\n\nCast and Crew:\n• Director: Lawrence C. Windom\n• Producer: Kenean Buel\n• Cinematography: Joseph Ruttenberg (who later became an Academy Award–winning cinematographer at MGM)\nStarring:\n• Babe Ruth as Himself\n• Ruth Taylor as Mildred\n• Frances Victory as Pigtails (Babe’s sister)\n• William Sheer as Squire Butler\n• Margaret Seddon as Babe’s Mother\n• James A. Marcus as Miller, the Banker\n• Creighton Hale as John, Mildred’s Brother\n\nFilm Significance:\nHeadin’ Home is one of the earliest examples of sports figures being used in Hollywood films to capitalize on their fame. At the time of release, Babe Ruth had just joined the New York Yankees in 1920 and was redefining baseball with his home-run hitting power. The film was essentially a promotional tool, shaping his public persona as an all-American hero and role model. Though critically dismissed for its weak script and sentimental tone, it remains an invaluable piece of sports and film history, showing how cinema contributed to the mythmaking of professional athletes. For Ruth, who never pursued a film career beyond novelty appearances, it remains a unique relic of his larger-than-life stardom.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Headin’ Home remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white silent cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1920 release was a silent black-and-white feature. While historically significant, many modern audiences skip silent films entirely. By offering a colorized edition, we bring vitality to Babe Ruth’s only starring film role, making it accessible to baseball fans, sports historians, and general audiences alike. For viewers in the USA, Europe, and beyond, this edition highlights the intersection of cinema and sports culture at a time when Ruth was becoming a global icon.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the silent era through Hollywood’s Golden Age. Our goal is to preserve forgotten gems, from experimental dramas to sports comedies, ensuring they remain discoverable and enjoyable for new generations.\n\n#HeadinHome1920 #BabeRuth #SilentFilm #SportsComedy #BaseballHistory #PublicDomainMovie #ColorizedClassic #SilentCinema #1920sMovies #FilmRestoration #ClassicSportsFilm #GoldenAgeHollywood",
      "id": "wZsKwgzrwkY",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-headin-home",
      "title": "Headin' Home",
      "id": "silent-headin-home"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "71 min",
    "imdbRating": "5.1",
    "imdbVotes": "318",
    "Genre": "Biography, Comedy, Drama",
    "Plot": "Fictional story of a country boy who can't get the hang of playing baseball and is the butt of jokes in his small town. But one day he gets mad and knocks a towering home run. Suddenly he is off and running to fame in the big leagues. When he returns to his home town, everyone sees that he is the same loveable fellow he was before.",
    "Director": "Lawrence C. Windom",
    "Writer": "Arthur 'Bugs' Baer, Earle Browne",
    "Actors": "Babe Ruth, Ruth Taylor, William Sheer",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0007964",
      "title": "Fools for Luck",
      "year": 1917,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0071085",
      "title": "43: The Richard Petty Story",
      "year": 1972,
      "imdbRating": "6.4",
      "imdbVotes": "126",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038390",
      "title": "Caesar and Cleopatra",
      "year": 1945,
      "imdbRating": "6.2",
      "imdbVotes": "3,218",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0084044",
      "title": "Hajji Washington",
      "year": 1983,
      "imdbRating": "7.1",
      "imdbVotes": "785",
      "language": "Persian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0062994",
      "title": "Funny Girl",
      "year": 1968,
      "imdbRating": "7.4",
      "imdbVotes": "26,170",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048312",
      "title": "The Long Gray Line",
      "year": 1955,
      "imdbRating": "7.2",
      "imdbVotes": "3,392",
      "language": "English, Irish Gaelic",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt5442674",
      "title": "The Babymooners",
      "year": 2016,
      "imdbRating": "7.0",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0044735",
      "title": "I Dream of Jeanie",
      "year": 1952,
      "imdbRating": "5.9",
      "imdbVotes": "242",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0011588",
      "title": "Pollyanna",
      "year": 1920,
      "imdbRating": "6.4",
      "imdbVotes": "489",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011741",
      "title": "Suds",
      "year": 1920,
      "imdbRating": "6.3",
      "imdbVotes": "294",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011865",
      "title": "Why Change Your Wife?",
      "year": 1920,
      "imdbRating": "6.7",
      "imdbVotes": "1,487",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011313",
      "title": "Huckleberry Finn",
      "year": 1920,
      "imdbRating": "6.5",
      "imdbVotes": "111",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}