{
  "imdbId": "tt0018464",
  "title": "Tarzan and the Golden Lion",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tarzan-and-the-golden-lion_1927",
      "title": "Tarzan and the Golden Lion",
      "id": "tarzan-and-the-golden-lion_1927"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sT6Vl3Af4xM",
      "title": "Tarzan and the Golden Lion (1927) Classic Silent Film Full Length",
      "description": "Flora Hawks is in love with the overseer of Tarzan's African estate. After a search for a legendary city of diamonds, Tarzan races with his pet lion Jad-bal-ja to save Flora from being sacrificed to a lion-god.\n\nDirector: J.P. McGowan\nWriters: Edgar Rice Burroughs, William E. Wing\nStars: James Pierce, Frederick Peters, Edna Murphy\nGenres: Classics, Action, Adventure, Silent\n\nFollow us on social media :\nhttps://www.facebook.com/CultCinemaClassics\nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "sT6Vl3Af4xM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rUuFemNUOxw",
      "title": "Tarzan and the Golden Lion (1927) | Colorized Public Domain Silent Adventure Classic | James Pierce",
      "description": "Tarzan and the Golden Lion (1927) is a silent adventure film directed by J. P. McGowan and based on the novel by Edgar Rice Burroughs. This rare public domain film holds a unique place in cinematic history, as it is one of the earliest screen adaptations of the Tarzan series and the only film to feature James Pierce in the title role. Restored and colorized by Colorized Public Domain, this classic has been enhanced for modern audiences in the United States, Europe, and worldwide. Through digital cleaning, careful restoration, and respectful colorization, we bring new life to a forgotten treasure of silent-era adventure cinema.\n\nPlot Summary:\nThe story follows Tarzan (James Pierce), the legendary Lord of the Jungle, as he becomes entangled in a perilous quest for a hidden city of gold. Alongside his faithful companion, the majestic lion named Jad-bal-ja, Tarzan battles sinister forces seeking to exploit the riches of the lost civilization. The villains, including ruthless treasure seekers and opportunistic adventurers, attempt to manipulate both Tarzan and the locals to seize the mythical golden treasure. Tarzan must use his strength, cunning, and deep connection to the jungle to protect his people, his allies, and the secret of the city.\n\nFilled with action, jungle spectacle, and the silent-era charm of physical performance, Tarzan and the Golden Lion showcases the adventurous spirit of the 1920s. While limited by the technology of its time, the film captures the enduring appeal of Burroughs’ iconic character — a wild yet noble hero standing against greed and corruption.\n\nCast and Crew:\n• Director: J. P. McGowan\n• Producer: Edgar Rice Burroughs (uncredited involvement as story owner)\n• Based on: Tarzan and the Golden Lion (1923 novel) by Edgar Rice Burroughs\nStarring:\n• James Pierce as Tarzan\n• Edna Murphy as Jane Porter\n• Dorothy Dunbar as Flora Hawks\n• Harold Goodwin as Jack Bradley\n• Boris Karloff as Owaza, a native chief\n• Frederick Peters as Esteban Miranda\n\nFilm Significance:\nTarzan and the Golden Lion is historically significant as the only film to feature James Pierce as Tarzan. Interestingly, Pierce later married Edgar Rice Burroughs’ daughter, Joan, and voiced Tarzan in a long-running 1930s radio series, cementing his association with the role beyond this single silent film. The casting of Boris Karloff, in one of his early roles prior to his fame in Frankenstein (1931), adds further historical value.\n\nThe film illustrates the adventurous energy of the late silent era, when Hollywood was experimenting with exotic settings and larger-than-life heroes. Though overshadowed by later sound-era Tarzan films, Tarzan and the Golden Lion remains a vital artifact of pulp storytelling, jungle adventure cinema, and the early legacy of one of fiction’s most enduring heroes.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Tarzan and the Golden Lion remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1927 release was in black and white and silent, reflective of its time. While historically authentic, many modern viewers overlook silent black-and-white films. By offering a colorized edition, we preserve the historical authenticity while revitalizing its visual appeal for today’s streaming audiences. This makes Tarzan’s thrilling jungle exploits more immersive and approachable for modern viewers while keeping the legacy of Edgar Rice Burroughs alive.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from adventurous pulp adaptations to culturally significant silent classics. Our mission is to preserve these films while making them engaging for modern audiences in the USA, Europe, and worldwide.\n\n#TarzanAndTheGoldenLion #Tarzan #BusterKeaton #SilentAdventure #1920sFilm #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #1927Movies #BorisKarloff #EdgarRiceBurroughs #JungleAdventure #SilentFilmClassic",
      "id": "rUuFemNUOxw",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "57 min",
    "imdbRating": "5.2",
    "imdbVotes": "240",
    "Genre": "Action, Adventure",
    "Plot": "The fever for gold corrupts the hearts of men, and Tarzan, the undisputed lord of the jungle, finds himself betrayed. Now, drugged, and at the mercy of the idolatrous denizens of Opar, Tarzan is with his back to the wall, as Flora Hawks, a one-time London maid to Jane Clayton, and her ally, Spanish actor, Esteban Miranda, the spitting image of Tarzan, head to the hidden city of gold. In the meantime, Queen La, the once-powerful High Priestess of the Flaming God, falls from grace, and she flees with Tarzan into the Valley of Diamonds: a secret realm of inexhaustible riches, and the land of intelligent but savage gorillas. Can Tarzan the great, and the mighty, black-maned Jad-bal-ja, his faithful golden-haired lion, restore La to power, and teach the impostor a lesson?",
    "Director": "J.P. McGowan",
    "Writer": "Edgar Rice Burroughs, William E. Wing",
    "Actors": "James Pierce, Frederick Peters, Edna Murphy",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0016749",
      "title": "Crossed Signals",
      "year": 1926,
      "imdbRating": "5.7",
      "imdbVotes": "51",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018654",
      "title": "Arizona Days",
      "year": 1928,
      "imdbRating": "5.7",
      "imdbVotes": "56",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015201",
      "title": "The Open Switch",
      "year": 1925,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017925",
      "title": "The General",
      "year": 1926,
      "imdbRating": "8.1",
      "imdbVotes": "104,099",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016654",
      "title": "The Black Pirate",
      "year": 1926,
      "imdbRating": "7.0",
      "imdbVotes": "2,190",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019596",
      "title": "Won in the Clouds",
      "year": 1928,
      "imdbRating": "5.6",
      "imdbVotes": "55",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018937",
      "title": "A Girl in Every Port",
      "year": 1928,
      "imdbRating": "6.5",
      "imdbVotes": "864",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019194",
      "title": "The Mysterious Airman",
      "year": 1928,
      "imdbRating": "6.5",
      "imdbVotes": "43",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0019434",
      "title": "Submarine",
      "year": 1928,
      "imdbRating": "6.3",
      "imdbVotes": "319",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0129928",
      "title": "The Flying Ace",
      "year": 1926,
      "imdbRating": "6.1",
      "imdbVotes": "296",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019489",
      "title": "The Trail of '98",
      "year": 1928,
      "imdbRating": "7.0",
      "imdbVotes": "457",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021945",
      "title": "Headin' for Trouble",
      "year": 1931,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T03:02:10.819Z"
}