{
  "imdbId": "tt0025913",
  "title": "Triumph of the Will",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TriumphOfTheWillgermanTriumphDesWillens",
      "id": "TriumphOfTheWillgermanTriumphDesWillens",
      "title": "Triumph of the Will (German: Triumph des Willens)",
      "description": "Triumph of the Will (German: Triumph des Willens) is a propaganda film made by Leni Riefenstahl. It chronicles the 1934 Nazi Party Congress in Nuremberg. The film contains excerpts from speeches given by various Nazi leaders at the Congress, including portions of speeches by Adolf Hitler, interspersed with footage of massed party members. Hitler commissioned the film and served as an unofficial executive producer; his name appears in the opening titles. The overriding theme of the film is the return of Germany as a great power, with Hitler as the True German Leader who will bring glory to the nation. Triumph of the Will was released in 1935 and rapidly became one of the best-known examples of propaganda in film history. Riefenstahl's techniques, such as moving cameras, the use of telephoto lenses to create a distorted perspective, aerial photography, and revolutionary approach to the use of music and cinematography, have earned Triumph recognition as one of the greatest films in history.[1] Riefenstahl won several awards, not only in Germany but also in the United States, France, Sweden, and other countries. The film was popular in the Third Reich and elsewhere, and has continued to influence movies, documentaries, and commercials to this day. English subs",
      "fileSize": 1794327462,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/TriumphOfTheWillgermanTriumphDesWillens",
      "collection": "feature_films",
      "downloads": 353897
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TriumphOfTheWilltriumphDesWillen",
      "id": "TriumphOfTheWilltriumphDesWillen",
      "title": "Triumph Of The Will (Triumph Des Willen)",
      "description": "This is the documentary which chronicles the 1934 Nazi Party Congress in Nuremberg. It was directed by Leni Riefenstahl who had the full support of the Nazi party and is a brilliant but frightening picture of the power of fascism. While it is available elsewhere on the archive it is there only in FLV format. I have uploaded it in MP4 to make it available to many more viewers. http://en.wikipedia.org/wiki/Triumph_of_the_Will",
      "fileSize": 1215379102,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/TriumphOfTheWilltriumphDesWillen",
      "collection": "feature_films",
      "downloads": 76299
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "110 min",
    "imdbRating": 7.1,
    "imdbVotes": 18731,
    "Genre": "Documentary, History",
    "Plot": "This documentary by filmmaker Leni Riefenstahl's is about the Nazi party's 1934 rally in Nuremberg, Germany. Told without narration, it documents all six days of activities from Adolf Hitler's arrival to his departure. It includes speeches by all of the major participants as well as the various activities of the thousands upon thousands who attended. In hindsight, it's a chilling film that shows the power of propaganda.",
    "Director": "Leni Riefenstahl",
    "Writer": "Leni Riefenstahl, Walter Ruttmann, Eberhard Taubert",
    "Actors": "Adolf Hitler, Hermann Göring, Max Amann",
    "Language": "German",
    "Country": "Germany",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0027073",
    "tt0156078",
    "tt0247569",
    "tt0247794",
    "tt2292978",
    "tt0247443",
    "tt1177174",
    "tt0247568",
    "tt0059529",
    "tt1475191",
    "tt0276783",
    "tt0247304"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:41:20.493Z"
}