{
  "imdbId": "tt0021374",
  "title": "The Silver Horde",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SilverHorde1930",
      "title": "SilverHorde1930",
      "description": "Title: The Silver Horde Summary: A salmon fisherman has to choose between a bad girl and a society doll. Directed by: George Archainbaud Actors: Evelyn Brent, Joel McCrea, Louis Wolheim Production Company: RKO Radio Pictures Release Date: 25 October 1930 (USA) Aspect Ratio: 1.33 : 1 Boyd Emerson loves the wealthy Mildred Wayland, but so does Boyd's unscrupulous rival in the Yukon salmon fisheries, Frederick Marsh. The two battle for Mildred's hand and for control of the thriving fishing business.",
      "id": "SilverHorde1930"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g9AXHLgF_RQ",
      "title": "The Silver Horde (1930) | Colorized Public Domain Adventure Drama with Joel McCrea & Evelyn Brent",
      "description": "The Silver Horde (1930) is a pre-Code American adventure drama directed by George Archainbaud and based on Rex Beach’s 1909 novel of the same name. This restored and colorized version brings vivid new life to a story that blends romance, rivalry, and survival against the rugged backdrop of Alaska’s untamed wilderness. By presenting this forgotten classic in color, modern audiences in the United States, Europe, and beyond can rediscover a thrilling tale of ambition and human endurance that defined early 20th-century pulp-inspired cinema.\n\nPlot Summary:\nThe story follows Boyd Emerson (Joel McCrea), a determined young man who ventures to Alaska with his friend Fraser (Raymond Hatton) in hopes of building a successful salmon cannery business. What begins as a bold entrepreneurial dream quickly transforms into a fierce battle for survival and reputation. Their enterprise is threatened by powerful competition from Frederick Marsh (Louis Wolheim), a ruthless businessman who will stop at nothing to crush his rivals.\n\nRomantic tensions add another layer of drama when Boyd’s relationship with Cherry Malotte (Evelyn Brent), a strong-willed woman with a questionable past, clashes with the expectations of his wealthy fiancée, Mildred Wayland (Jean Arthur). Boyd must choose between loyalty to love and ambition for success, all while facing the dangers of Alaska’s harsh environment and the corrupt forces arrayed against him. The climax of the film unfolds in a blend of personal sacrifice, business rivalry, and human resilience that makes The Silver Horde both a gripping drama and a fascinating relic of early Hollywood storytelling.\n\nCast and Crew:\n• Director: George Archainbaud\n• Based on: Novel “The Silver Horde” by Rex Beach\n• Cinematography: Henry Gerrard\n• Editing: Fred W. Berger\nStarring:\n• Joel McCrea as Boyd Emerson\n• Evelyn Brent as Cherry Malotte\n• Jean Arthur as Mildred Wayland\n• Louis Wolheim as Frederick Marsh\n• Raymond Hatton as Fraser\n• Blanche Sweet as Mildred’s mother\n\nFilm Significance:\nThe Silver Horde was released in 1930 during Hollywood’s pre-Code era, a period known for mature themes and frank storytelling before the enforcement of the Hays Code in 1934. The film is noteworthy for featuring future Hollywood star Jean Arthur in an early role, before she rose to fame in the 1930s and 1940s. Joel McCrea, another actor on the rise, delivers a strong performance in one of his early starring roles. The movie also reflects the popularity of Rex Beach’s novels, which often portrayed frontier struggles and larger-than-life conflicts in America’s untamed regions.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Silver Horde remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1930 release was filmed in black and white, reflecting the technical limitations of its era. While authentic to its time, modern audiences often overlook such films. By offering a carefully colorized edition, we bridge the gap between historical preservation and contemporary entertainment. This version highlights the rugged Alaskan landscapes and emotional intensity of the story in ways that resonate with today’s viewers.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, ranging from forgotten B-movies to culturally significant classics. Our mission is to preserve and share these treasures for audiences in the USA, Europe, and worldwide.\n\n#TheSilverHorde #JoelMcCrea #EvelynBrent #JeanArthur #1930sCinema #PublicDomainMovie #ColorizedClassic #FilmRestoration #PreCodeHollywood #AdventureDrama",
      "id": "g9AXHLgF_RQ",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-silver-horde-1930",
      "title": "The Silver Horde (1930)",
      "description": "A salmon fisherman has to choose between a bad girl and a society doll. Watch on RetroFlix:  https://retroflix.org/the-silver-horde-1930/",
      "id": "the-silver-horde-1930"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-silver-horde-4-k",
      "title": "The silver horde (1930) [Colorized,4k,60fps]",
      "description": "The silver horde is a 1930 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com/   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "the-silver-horde-4-k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=N_dnqe4U3P8",
      "title": "The Silver Horde (1930) PRE-CODE HOLLYWOOD",
      "description": "Director: George Archainbaud\nStars: Joel McCrea, Evelyn Brent, Jean Arthur\n\nAdventure and Romance on the harsh Alaskan coast. When a rugged salmon fisherman hooks both a bad girl and a society doll, he must choose which one to throw back!",
      "id": "N_dnqe4U3P8",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "75 min",
    "imdbRating": "5.8",
    "imdbVotes": "610",
    "Genre": "Drama, Romance",
    "Plot": "Boyd Emerson has spent two unsuccessful years in Alaska trying to make his fortune in the gold trade, mostly in an effort to impress his socialite girlfriend Mildred Wayland's father, Wayne Wayland, although Mildred does not care if Boyd is wealthy or not in wanting to marry him regardless. Boyd has literally and figuratively hit the end of the Alaska trail when he meets Cherry Malotte, who convinces him to join her and her associate George Balt in another business, silver, more specifically the burgeoning salmon fishery and cannery. Cherry is up front to him that it is a dangerous business in that Fred Marsh has set up a syndicate to control the salmon fishery in Alaska, he going to the extreme of killing to achieve his goal. As Boyd uses Cherry's connections to try and secure financing to build a cannery while Balt's men operate the fishing side of the business, several issues complicate matters. First, Marsh is Wayne Wayland's preference as a husband for Mildred. Second, Cherry herself has fallen in love with Boyd, something she doesn't want to let him know. And third, Cherry has not informed Boyd why she is so well off and has all her business connections, which was through her former work as a prostitute.",
    "Director": "George Archainbaud",
    "Writer": "Rex Beach, Wallace Smith",
    "Actors": "Evelyn Brent, Louis Wolheim, Jean Arthur",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0022046",
      "title": "The Lady Refuses",
      "year": 1931,
      "imdbRating": "5.9",
      "imdbVotes": "433",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020900",
      "title": "Framed",
      "year": 1930,
      "imdbRating": "6.0",
      "imdbVotes": "320",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023742",
      "title": "After Tonight",
      "year": 1933,
      "imdbRating": "6.1",
      "imdbVotes": "426",
      "language": "English, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019958",
      "title": "Half Way to Heaven",
      "year": 1929,
      "imdbRating": "6.3",
      "imdbVotes": "74",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022242",
      "title": "Pagan Lady",
      "year": 1931,
      "imdbRating": "5.5",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019451",
      "title": "Tempest",
      "year": 1928,
      "imdbRating": "6.7",
      "imdbVotes": "545",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0019071",
      "title": "The Last Command",
      "year": 1928,
      "imdbRating": "7.9",
      "imdbVotes": "4,676",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020806",
      "title": "Danger Lights",
      "year": 1930,
      "imdbRating": "6.1",
      "imdbVotes": "671",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020866",
      "title": "Extravagance",
      "year": 1930,
      "imdbRating": "5.7",
      "imdbVotes": "167",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020988",
      "title": "Hot Curves",
      "year": 1930,
      "imdbRating": "5.0",
      "imdbVotes": "53",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021239",
      "title": "Party Girl",
      "year": 1930,
      "imdbRating": "5.1",
      "imdbVotes": "320",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021044",
      "title": "A Lady to Love",
      "year": 1930,
      "imdbRating": "6.3",
      "imdbVotes": "260",
      "language": "English, Italian",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:30:38.893Z"
}