{
  "movieId": "tt0018825",
  "title": "Detectives",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detectives",
      "id": "detectives",
      "title": "\"Detectives\" (1928) starring Karl Dane, George Arthur and Marceline Day - a trailer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"Detectives\" is a classic comedy.  We have included this film in our program to illustrate the work and contributions of Marceline Day, a star of Silent Hall of Fame. Warner Bros. keeps a copy of the film locked in their vaults. They do not plan to release it on DVD. They have also refused our multiple requests to make a copy of the film available to Silent Hall of Fame, so we can show it to the public. Directed by               Chester M. Franklin Written by                Robert Lord and Chester M. Franklin Starring                    Karl Dane                                    George K. Arthur                                    Marceline Day Cinematography       John Arnold Distributed by          Metro-Goldwyn-Mayer Release date               June 9, 1928 Running time           7 reels Country                     United States Language                    Silent, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 2584246,
      "addedAt": "2026-01-07T00:07:59.607Z",
      "thumbnail": "https://archive.org/services/img/detectives",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 3327
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "70 min",
    "imdbRating": 8.1,
    "imdbVotes": 32,
    "Genre": "Comedy, Mystery",
    "Plot": "Lois, a stenographer at a luxury hotel, is being pursued by the hotel's house detective and a bellhop. When some valuable jewels are stolen, the bellhop--who has always dreamed of being a detective--sees his chance to both solve the jewel robbery and impress the woman he loves. The house detective, however, has other ideas.",
    "Director": "Chester M. Franklin",
    "Writer": "Chester M. Franklin, Robert E. Hopkins, Robert Lord",
    "Actors": "Karl Dane, George K. Arthur, Marceline Day",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019690",
    "tt0017739",
    "tt0020388",
    "tt0406934",
    "tt0020785",
    "tt0021322",
    "tt0018742",
    "tt0228331",
    "tt0016123",
    "tt0020210",
    "tt0018440",
    "tt0018097"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.607Z"
}