{
  "imdbId": "tt0006745",
  "title": "Gretchen the Greenhorn",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-gretchen-the-greenhorn",
      "id": "silent-gretchen-the-greenhorn",
      "title": "Gretchen the Greenhorn",
      "fileSize": 1156353393,
      "addedAt": "2026-01-07T00:10:59.118Z",
      "thumbnail": "https://archive.org/services/img/silent-gretchen-the-greenhorn",
      "language": "English",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 357
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "58 min",
    "imdbRating": 6.4,
    "imdbVotes": 523,
    "Genre": "Crime, Drama, Romance",
    "Plot": "John Van Houck is an old, expert Dutch engraver. He came to this country from Holland. Things have not gone any too well with him, but he sends for his daughter Gretchen to come and join him. In the tenement to which Gretchen goes to make her home is Pietro, a young Italian immigrant who is fast making his way in the new world and who finds Gretchen the inspiration to strive for the best and finest things in the world. Gretchen smiles not unkindly on Pietro. There comes among the good people of the tenement Rodgers, a thoroughly bad man who sees in the old Dutch engraver a tool whereby he can better do his evil work. He works on Van Houck's pride in his skill as an engraver, until the old man one day makes a plate from which Rodgers and his gang are able to print counterfeit bills so well that they defy detection. When the old man learns to what use his engraving is put and, what is far worse, discovers that Gretchen is being made an innocent tool to pass the spurious money, he determines to expose the gang. To frustrate him, he is kidnapped and thrown aboard a vessel. Gretchen is also taken captive and Rodgers, who has long had his eye upon the little Dutch girl, seems more than likely to accomplish his evil intentions towards her. The Garrity kids, however, have to be reckoned with. From the day Gretchen appeared at the tenement, they became her best friends. When they saw her rush off, evidently in great trouble, one of them followed and when he saw his beloved Gretchen being carried aboard the boat he rushed off to give the alarm. Pietro was the first one he sought. The alarm was given and a desperate chase after the boat followed. The fast motorboat overhauled the fugitive and after a real fight, the counterfeiters were captured and the old Dutchman and Gretchen were rescued. The final scene disclosed old John Van Houck hurling the hated engraving and all the counterfeit money overboard.",
    "Director": "Chester M. Franklin, Sidney Franklin",
    "Writer": "Bernard McConville",
    "Actors": "Dorothy Gish, Ralph Lewis, Eugene Pallette",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006509",
    "tt0442148",
    "tt0032179",
    "tt0038342",
    "tt0022662",
    "tt0033526",
    "tt0021770",
    "tt0039694",
    "tt0043830",
    "tt0051987",
    "tt0027568",
    "tt0026436"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}