{
  "imdbId": "tt0041284",
  "title": "De hombre a hombre",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-hombre-a-hombre-1949",
      "id": "de-hombre-a-hombre-1949",
      "title": "De Hombre A Hombre (1949)",
      "description": "De hombre a hombre  es una película  argentina  del género de  drama  filmada en blanco y negro dirigida por  Hugo Fregonese  sobre guion de Carlos Alberto Orlando que se estrenó el 7 de julio de 1949 y que tuvo como protagonistas a  Tito Alonso ,  Josefa Goldar ,  Enrique Muiño ,  Nathán Pinzón ,  Osvaldo Terranova  y  Ricardo Trigo . (Wikipedia) Sinopsis Es un melodrama cuyo tema –la delincuencia juvenil- había sido poco tratado todavía en el cine mundial. Oscar, interpretado por Tito Alonso, es un adolescente con un erróneo sentido de la hombría, hijo de un padre pobre, borracho y golpeador que se opone a que estudie y termina en un hospicio. Muiño, en su última película, interpreta a Carlos Etchart, un viejo  psiquiatra  con rígidos sentidos morales cuyo hijo Alberto es íntimo amigo de Oscar. Padre e hijo tienen una relación conflictiva pues Alberto hace todo lo posible por tratar de proteger y ayudar a Oscar, incluso a costa de sus propios estudios. La situación culmina cuando Etchart descubre que su hijo había dado un examen en lugar de su amigo y lo denuncia al rector haciéndolo expulsar, lo que ocasiona que Alberto se suicide. Cuando posteriormente Etchart sorprende a Oscar, que se ha escapado de un instituto correccional, robando en su casa su primer impulso es llamar a la policía pero no lo hace y le permite pernoctar allí pero al día siguiente el joven se ha ido con lo robado y al tratar de venderlo cae nuevamente preso. Cuando Etchart lo visita, el joven se burla de su intento de ayudarle y tiempo después vuelve a escaparse. El psiquiatra se entera de que la novia de Oscar espera un hijo se interesa por ella, quien muere poco después de dar a luz una nena, que es recogida por Etchart. Se produce finalmente el reencuentro de Oscar, su hija y Etchart; el joven reconoce su mala influencia y pide al psiquiatra que se encargue de su hija mientras vuelve a la cárcel a cumplir su condena. Reparto Tito Alonso  ... Oscar Ramírez Jorge Arias Luis de Lucía Cirilo Etulain Aurelia Ferrer  ... Dueña de la pensión René Fischer Bauer  ... Alberto Etchart Norma Giménez  ... Alicia Josefa Goldar  ... Luisa Raúl Luar Enrique Muiño  ... Prof. Carlos Etchart Nathán Pinzón  ... Apostador Osvaldo Terranova  ... Apostador Ricardo Trigo ... Hermano de Oscar",
      "fileSize": 1147125543,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/de-hombre-a-hombre-1949",
      "language": "spa",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 48
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "77 min",
    "imdbRating": 6.4,
    "imdbVotes": 15,
    "Genre": "N/A",
    "Plot": "N/A",
    "Director": "Hugo Fregonese",
    "Writer": "Carlos Alberto Orlando",
    "Actors": "Tito Alonso, Jorge Arias, Luis de Lucía",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0184740",
    "tt0042809",
    "tt0194839",
    "tt0194153",
    "tt0175941",
    "tt0182267",
    "tt0201886",
    "tt0178884",
    "tt0315614",
    "tt0189591",
    "tt0264698",
    "tt0198332"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.603Z"
}