{
  "imdbId": "tt0004064",
  "title": "Hello, Mabel",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HelloMabel1914",
      "id": "HelloMabel1914",
      "title": "HELLO MABEL (1914)",
      "description": "HELLO MABEL Keystone-Mutual 2 reels, rel. Oct. 8, 1914 (The Hello Girl) dir. Mabel Normand cast: Mabel Normand, Mack Swain, Harry McCoy, Alice Davenport finished: 9/16/1914 Note. Admittedly a poor print and transfer here, but the film's a rarity in any case. The original is with the Killiam collection.",
      "fileSize": 649120726,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HelloMabel1914",
      "collection": "feature_films",
      "downloads": 764
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 5.3,
    "imdbVotes": 29,
    "Genre": "Short, Comedy",
    "Plot": "This Keystone comedy from 1914 follows the usual trajectory of violence from a few accidental bumps all the way up to Alice Davenport beating husband Mack Swain up for being in the wrong place at the wrong time. It's pitched midway between the usual Keystone chaos and Sennett's situational techniques from his days at Biograph, with normal looking people -- except for Mack in full Ambrose mode -- getting into messes and out of them.Mabel works as a hotel switchboard operator. She and Harry McCoy are in love, so when she mistakes some one else for him in the park, it is up to flirtatious, sneezing hotel guest Mack to rescue her. As the sequence of events escalates, we get to see a cynical before-and-after portrait: Harry &amp; Mabel, in a lovey-dovey before situation and Mack and Alice after.As usual, Mack Swain commands all the scenes he is in as he blithely indulges in what are to him harmless flirtations. Mabel, as always, is good, although some of the thoughts she is supposed to communicate through pantomime seem a bit complicated. Although it would be another dozen years before producer Mack Sennett would finally come up with the \"Smith Family\" series in this intermediate vein, he would keep trying. This one is too refined for his usual lower class audience and too cynical for the middle-class audience he was hoping to add. It is, nonetheless, an excellent try.",
    "Director": "Mack Sennett",
    "Writer": "N/A",
    "Actors": "Mabel Normand, Mack Swain, Alice Davenport",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0004282",
    "tt0005674",
    "tt0003733",
    "tt0003934",
    "tt0004280",
    "tt0003177",
    "tt0003417",
    "tt0002663",
    "tt0002755",
    "tt0002956",
    "tt0003104",
    "tt0003106"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.401Z"
}