{
  "movieId": "tt0036395",
  "title": "A Stranger in Town",
  "year": 1943,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=B_n-Z5fiXvo",
      "id": "B_n-Z5fiXvo",
      "title": "A Stranger In Town (1943) FRANK MORGAN",
      "description": "Stars: Frank Morgan, Richard Carlson, Jean Rogers \n Director: Roy Rowland\n\n A Supreme Court Justice wants a vacation hunting ducks in the country, but gets involved with corrupt small town officials. Stars Frank Morgan from The Wizard of Oz!",
      "addedAt": "2025-12-26T23:54:30.770Z",
      "thumbnail": "https://i.ytimg.com/vi/B_n-Z5fiXvo/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB7ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLB1L10oSWvpTO9ka8AcNL8WN79VkQ",
      "duration": 4012,
      "language": "en",
      "year": 1943,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/A_Stranger_in_Town_1943",
      "id": "A_Stranger_in_Town_1943",
      "title": "A Stranger in Town (1943; smallest download)",
      "description": "Actors: Frank Morgan (\"The Wizard of Oz\"); Richard Carlson; Jean Rogers; Olin Howland; Chill Wills; Porter Hall; John Hodiak Runtime: 1:06:50 Vacationing incognito in a small town, a supreme court justice discovers rampant corruption and abuse of governmental powers. This is in the public domain because the copyright wasn't renewed after 28 years.",
      "fileSize": 440166017,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/A_Stranger_in_Town_1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 1203
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AStrangerInTown",
      "id": "AStrangerInTown",
      "title": "A Stranger In Town",
      "description": "A Supreme Court Justice goes fishing in a small town and gets involved with a country lawyer in cleaning up the corrupt town leaders.",
      "fileSize": 1162843380,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/AStrangerInTown",
      "collection": "feature_films",
      "downloads": 11055
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Stranger_in_Town_1943",
      "id": "Stranger_in_Town_1943",
      "title": "A Stranger in Town",
      "description": "Visiting a small town in order to hunt ducks, supreme court judge Frank Morgan (the Wizard of Oz) discovers abuse of power by public servants.",
      "fileSize": 1564624674,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/Stranger_in_Town_1943",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 62490
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zi6t0CCN8nw",
      "id": "zi6t0CCN8nw",
      "title": "A Stranger in Town (1943) | Colorized Public Domain Comedy Drama with Frank Morgan & Richard Carlson",
      "description": "A Stranger in Town (1943) is a patriotic comedy-drama directed by Roy Rowland and released by Metro-Goldwyn-Mayer during World War II. The film stars Frank Morgan, Richard Carlson, and Jean Rogers in a charming and witty story about small-town corruption, civic duty, and democracy in action. Lighthearted yet meaningful, the film combines humor, romance, and social commentary, reflecting the American spirit of its wartime era.\n\nThis restored and colorized edition brings a vivid new look to the classic, making it accessible for modern audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe story follows Supreme Court Justice John Josephus Grant (Frank Morgan), who decides to take a fishing vacation in a small town incognito. Instead of peace and quiet, he discovers a community plagued by petty corruption, political bosses, and a rigged mayoral election.\n\nYoung lawyer Bill Adams (Richard Carlson) is running for mayor on a reform ticket but faces intimidation and dirty tricks from entrenched interests led by Judge Austin Harkley (Porter Hall). Grant, amused yet disturbed, secretly helps Bill by offering sharp legal advice, guiding him in courtroom battles, and inspiring him to stand up for the people.\n\nMeanwhile, romance blossoms between Bill and lawyer Lucy Gilbert (Jean Rogers). With humor, courtroom wit, and a touch of patriotic messaging, the film builds toward a hopeful conclusion where integrity and democracy prevail. In the final scene, Grant quietly returns to Washington, satisfied that justice — in every sense — has been served.\n\nCast and Crew:\n• Director: Roy Rowland\n• Producer: Robert Sisk\n• Screenplay: Isobel Lennart, William Kozlenko\n• Cinematography: Sidney Wagner\n• Editing: Frank E. Hull\n• Studio: Metro-Goldwyn-Mayer (MGM)\n\nStarring:\n• Frank Morgan as Justice John Josephus Grant\n• Richard Carlson as Bill Adams\n• Jean Rogers as Lucy Gilbert\n• Porter Hall as Judge Austin Harkley\n• Robert Barrat as Mayor Connison\n• Chill Wills as Fred Johnson\n• Grant Mitchell as Rev. Norman\n• Donald MacBride as Henry McKell\n• Minor Watson as Sen. Grayson\n\nFilm Significance:\nA Stranger in Town is notable for blending patriotic wartime messaging with a light comic touch. Released in 1943, it reflected American ideals of fairness, civic responsibility, and the fight against corruption at a time when the country was engaged in global conflict.\n\nFrank Morgan, best remembered as the Wizard in The Wizard of Oz (1939), shines here in one of his best later roles, delivering both humor and gravitas. The film’s courtroom speeches and democratic themes connected strongly with audiences of the 1940s, while today it offers insight into how Hollywood supported wartime morale with entertaining yet thoughtful films.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, meaning it is free of copyright restrictions and can be legally shared, viewed, and preserved without limitation. Colorized Public Domain restores and enhances such classics through digital cleaning, visual restoration, and colorization. Our mission is to keep culturally significant works like A Stranger in Town available for audiences around the world. Presenting them in color bridges the gap between past and present, helping new generations appreciate their humor, themes, and performances.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white, the film’s courtroom scenes and small-town settings gain new warmth and vitality through colorization. Frank Morgan’s playful yet wise performance, Richard Carlson’s earnest idealism, and Jean Rogers’ charm shine through more vividly, making the film engaging for today’s audiences while respecting its 1940s spirit.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, ranging from forgotten gems to enduring cultural landmarks. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#AStrangerInTown #FrankMorgan #RichardCarlson #JeanRogers #PublicDomainMovie #ColorizedClassic #CourtroomComedy #1940sCinema #GoldenAgeHollywood #FilmRestoration",
      "addedAt": "2025-12-24T00:48:28.040Z",
      "thumbnail": "https://i.ytimg.com/vi/zi6t0CCN8nw/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYSSBdKGUwDw==&rs=AOn4CLDvadzvIsUSLblCx1PWqSQzr9anvQ",
      "duration": 3971,
      "language": "en",
      "year": 1943,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "67 min",
    "imdbRating": 7.1,
    "imdbVotes": 1099,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "In the small town of Crown Port local attorney Bill Adams is trying to break up the ring of corrupt town officials by running for mayor. The cards seemed stacked against him when he gets help from a visiting hunter who, unknown to Adams and the rest of the town, is actually vacationing supreme court justice John Josephus Grant.",
    "Director": "Roy Rowland",
    "Writer": "Isobel Lennart, William Kozlenko",
    "Actors": "Frank Morgan, Richard Carlson, Jean Rogers",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035931",
    "tt0034976",
    "tt0034420",
    "tt0034961",
    "tt0032132",
    "tt0033891",
    "tt0037588",
    "tt0032599",
    "tt0032428",
    "tt0038592",
    "tt0032846",
    "tt0033038"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-11T21:31:41.531Z"
}