{
  "imdbId": "tt0024724",
  "title": "Ein Unsichtbarer geht durch die Stadt",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1933-ein-unsichtbarer-geht-durch-die-stadt",
      "id": "1933-ein-unsichtbarer-geht-durch-die-stadt",
      "title": "1933 Ein Unsichtbarer Geht Durch Die Stadt",
      "description": "Film aus dem deutschen dritten Reich von 1933.. Von und mit Harry Piel. Ein Unsichtbarer geht durch die stadt ",
      "fileSize": 1467382092,
      "addedAt": "2026-01-07T00:06:00.052Z",
      "thumbnail": "https://archive.org/services/img/1933-ein-unsichtbarer-geht-durch-die-stadt",
      "language": "ger",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 278
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "104 min",
    "imdbRating": 5.4,
    "imdbVotes": 71,
    "Genre": "Adventure, Crime, Drama",
    "Plot": "Harry is an ambitious taxi driver who is fond of flower girl Annie Bergmann. While delivering flowers for Annie one foggy night, he picks up a man carrying a big case who is fleeing from a crowd of pursuers. Forced to pull over by gunshots, he talks to the police while the man disappears. But the large case is left behind. Harry opens it at home and discovers a high-tech device that can render him invisible. His roommate thinks now they can walk into the bank and take as much money as they want. Harry refuses to use it to steal, but sells his cab and places all the money on a long shot at the race track. While invisible, he uses a noise-maker to help his horse win. The race proceeds allow him to move into a mansion. Annie now thinks she is below his station and still will not commit to deepening their relationship. Harry treats the other cabbies to a lavish party and helps the young actress that he takes daily to the theater. His envious roommate swipes the device and proceeds to rob the national bank. A wild chase ensues to recover the device and the stolen money.",
    "Director": "Harry Piel",
    "Writer": "Hans Rameau",
    "Actors": "Harry Piel, Fritz Odemar, Lissy Arna",
    "Language": "German",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026083",
    "tt0024199",
    "tt0024561",
    "tt0024868",
    "tt0021281",
    "tt0128844",
    "tt0035317",
    "tt0040797",
    "tt0030037",
    "tt0023938",
    "tt0038360",
    "tt0017899"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.052Z"
}