{
  "imdbId": "tt0017634",
  "title": "Anything Once!",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AnythingOnce1927",
      "id": "AnythingOnce1927",
      "title": "ANYTHING ONCE! (1927)",
      "description": "ANYTHING ONCE! Hal Roach-Pathe 2 reels, rel. Jan. 2, 1927 dir. F. Richard Jones cast: Mabel Normand, James Finlayson, Max Davidson, Theodore von Eltz, Nora Hayden, Von Sevefertitz, Leo White copyright: Dec. 31, 1926 Note. The version for .avi download here is somewhat better in picture quality than the one presented on video.",
      "fileSize": 594380407,
      "addedAt": "2026-01-07T00:06:09.635Z",
      "thumbnail": "https://archive.org/services/img/AnythingOnce1927",
      "collection": "feature_films",
      "downloads": 1945
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "20 min",
    "imdbRating": 6.3,
    "imdbVotes": 41,
    "Genre": "Comedy, Short",
    "Plot": "This is one of the last films by Mabel Norman and she fortunately has some excellent support in this one in the form of Max Davidson and James FInlayson....two of the best Hal Roach supporting characters.The night has to be perfect. Mrs. De Puyster just got her face lifted and she has ordered a new gown for the ball. And why does this ball need to be perfect? She's hoping that the handsome Prince Chevalier will announce their engagement at the party. However, considering she's trusting the dress to Mabel and her boss (James Finlayson), I have a feeling all will NOT go as planned! And, when Mabel decides to crash the party, you KNOW things will be a mess!\"Anything Once!\" is a bit surprising as Mabel was in her mid-30s and was ill from tuberculosis--the disease which would claim her life just a few years later--and yet she was very physical in this comedy. She took a bunch of falls just like a trooper! Overall, it's a cute and sweet little comedy...and it makes you wonder what more she might have done in her life had she lived longer.",
    "Director": "F. Richard Jones, Hal Yates",
    "Writer": "N/A",
    "Actors": "Mabel Normand, James Finlayson, Max Davidson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0017204",
    "tt0018394",
    "tt0017729",
    "tt0130629",
    "tt0130802",
    "tt0018368",
    "tt0018881",
    "tt0019253",
    "tt0018396",
    "tt0130517",
    "tt0019688",
    "tt0208994"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.635Z"
}