{
  "movieId": "tt0033760",
  "title": "Invisible Ghost",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/InvisibleGhost1941",
      "id": "InvisibleGhost1941",
      "title": "Invisible Ghost (1941)",
      "description": "Bela Lugosi stars as Charles Kessler, a man who has never really got to grips with the fact that his wife has left him. That is the least of his problems though, because there have been a lot of murders recently and they have all taken place on the Kessler estate. You can find out more about Invisible Ghost at A Passion For Horror .",
      "fileSize": 1307513900,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/InvisibleGhost1941",
      "collection": "feature_films",
      "downloads": 56889
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheInvisibleGhost",
      "id": "TheInvisibleGhost",
      "title": "Invisible Ghost",
      "description": "Bela Lugosi plays the role of Mr. Kessler, a man haunted and disturbed by the death of his wife. You can find more information regarding this film on its IMDb page . More information is also available from the Wikipedia article here.",
      "fileSize": 4227292557,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheInvisibleGhost",
      "language": "English",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 47745
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/invisible-ghost-1941",
      "id": "invisible-ghost-1941",
      "title": "Invisible Ghost (1941)",
      "description": "The town's leading citizen is a man victim of homicidal impulses beyond his control. He is being controlled by his wife who had left him for another man. She was involved in a car accident that has left her brain damaged and is kept in the basement, in secret, by Kessler's gardener. Watch on RetroFlix:  https://retroflix.org/invisible-ghost-1941/",
      "fileSize": 409923238,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/invisible-ghost-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 172
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/invisible-ghost-1941-bela-lugosi-crime-drama-horror-full-length-movie",
      "id": "invisible-ghost-1941-bela-lugosi-crime-drama-horror-full-length-movie",
      "title": "Invisible Ghost (1941) Bela Lugosi",
      "description": "Dr. Charles Kessler (Bela Lugosi), a well-to-do physician who shares his mansion with his daughter, Virginia (Polly Ann Young), has been depressed ever since his wife (Betty Compson) left him for another man, only to later die in a car accident. That's not all Kessler has to worry about, however. Un explained murders have begun to occur around town, eventually claiming members of his house staff. Making matters worse, the authorities suspect Kessler may somehow be involved.",
      "fileSize": 660902853,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/invisible-ghost-1941-bela-lugosi-crime-drama-horror-full-length-movie",
      "collection": "feature_films",
      "downloads": 547
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kbBC445z4Ng",
      "id": "kbBC445z4Ng",
      "title": "Invisible Ghost (1941) [Horror] [Thriller]",
      "description": "\"Invisible Ghost\" is a horror film starring Bela Lugosi, shot in black and white, and directed by Joseph H. Lewis. Lugosi plays Kessler, a man controlled by homicidal impulses beyond his control. He is being controlled by his wife, who had left him for another man. She was involved in a car accident that has left her brain damaged and is kept in the basement, in secret, by Kessler's gardener. When an innocent man is executed for a murder done by Kessler in the house, his twin brother visits and tries to unravel the mystery. In the end it ends up that Kessler really is the killer and he doesn't know it. Kessler looks at the painting of his wife (that is stabbed on the throat) and then walks out to be arrested.\n\n---\n\nDirected by Joseph H. Lewis, produced by Sam Katzman and Pete Mayer, written by Al Martin and Helen Martin, starring Bela Lugosi as Charles Kessler, Polly Ann Young as Virginia Kessler, John McGuire as Ralph Dickson and Paul Dickson, Clarence Muse as Evans (the Butler), Terry Walker as Cecile Mannix, Betty Compson as Mrs. Kessler, Ernie Adams as Jules Mason, George Pembroke as Police Lieutenant Williams, Ottola Nesmith as Mrs. Mason, Fred Kelsey as Detective Ryan, Jack Mulhall as Detective Tim, Fred Aldrich as Guard at Ralph's Exeuction, Lloyd Ingraham as The Psychiatrist and Robert Strange as Coroner Kirby. \n\n---\n\nSource: \"Invisible Ghost\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 1 April 2013. Web. 20 April 2013. http://en.wikipedia.org/wiki/Invisible_Ghost.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:26.777Z",
      "thumbnail": "https://i.ytimg.com/vi/kbBC445z4Ng/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDt3U-vSS4b301LFknAunIuQy0jdQ",
      "duration": 3771,
      "language": "en",
      "year": 1941,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=W0XuBp-7d_Q",
      "id": "W0XuBp-7d_Q",
      "title": "Invisible Ghost (1941) | Colorized Public Domain Horror Mystery with Bela Lugosi",
      "description": "Invisible Ghost (1941) is an American horror mystery directed by Joseph H. Lewis and starring the legendary Bela Lugosi in one of his most memorable poverty row roles. Produced by Monogram Pictures, the film reflects the low-budget but highly atmospheric horror productions that captivated audiences in the early 1940s. This restored and colorized edition breathes new life into the film, enhancing its gothic mood and making it more accessible for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nDr. Charles Kessler (Bela Lugosi) is a kindly, respected man who lives in a gloomy mansion with his daughter Virginia Kessler (Polly Ann Young). Unknown to everyone around him, Dr. Kessler’s mind has been fractured ever since his wife (Betty Compson) mysteriously disappeared years earlier. Believing she is still alive, he often dines with her “ghost,” speaking to an empty chair at the table.\n\nWhat the townsfolk do not realize is that Mrs. Kessler is indeed alive but secretly confined in the estate’s guest house, hidden from her husband’s view. Whenever she wanders near the mansion, her shadowy presence triggers a violent hypnotic state in Dr. Kessler. Under this trance, he becomes a ruthless murderer, unaware of his actions and horrified when confronted with the aftermath.\n\nThe mounting string of murders terrifies the community and places suspicion on Virginia’s fiancé Ralph (John McGuire), who is wrongly accused and sentenced to death. As the true source of the killings begins to unravel, the shocking duality of Dr. Kessler’s nature comes to light, leading to a chilling finale that combines madness, tragedy, and gothic atmosphere.\n\nCast and Crew:\n• Director: Joseph H. Lewis\n• Producer: Sam Katzman\n• Screenplay: Al Martin\n• Cinematography: Marcel Le Picard\n• Editing: Irving Berlin\n\nStarring:\n• Bela Lugosi as Dr. Charles Kessler\n• Polly Ann Young as Virginia Kessler\n• John McGuire as Ralph Dickson\n• Clarence Muse as Evans, the butler\n• Betty Compson as Mrs. Kessler\n• Terry Walker as Cecile Mannix\n• George Pembroke as Police Captain\n\nFilm Significance:\nInvisible Ghost is notable as one of Bela Lugosi’s standout performances after the peak of his Universal horror career in the 1930s. While Monogram Pictures lacked the lavish budgets of major studios, Joseph H. Lewis—who would later earn acclaim for stylish crime films like Gun Crazy (1950)—crafted a visually inventive horror film with creative camera angles and moody atmosphere. Lugosi’s portrayal of Dr. Kessler, torn between kindness and murderous compulsion, reveals his range beyond Dracula-like roles.\n\nThe film also represents a cultural shift in horror of the early 1940s. With World War II underway, many horror movies leaned on psychological thrills and domestic tragedies rather than supernatural monsters. Invisible Ghost combines gothic mystery, psychological horror, and melodrama, embodying Monogram’s contribution to keeping the horror genre alive during an uncertain time for Hollywood.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, meaning it is free from copyright restrictions and legally available for viewing, study, and preservation. At Colorized Public Domain, we restore, clean, and colorize these cinematic gems to keep them alive for today’s audiences. Our colorized edition of Invisible Ghost highlights details of the eerie mansion, Lugosi’s haunting expressions, and the atmospheric shadows that defined Monogram’s style. By merging preservation with accessibility, we make films like this engaging for new generations who may otherwise overlook black-and-white cinema.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white, Invisible Ghost relied heavily on shadow lighting, stormy backdrops, and Bela Lugosi’s commanding presence to build suspense. By colorizing this classic, we bring out new textures and depth, making the gothic interiors, emotional performances, and atmospheric details more vivid and immersive. For horror enthusiasts, film historians, and casual viewers alike, this edition provides a bridge between vintage authenticity and modern appeal.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe bring forgotten treasures back to life with weekly uploads of restored and colorized public domain films. From horror to sci-fi, westerns to drama, Colorized Public Domain is your destination for rediscovering the magic of early cinema in a fresh new way.\n\n#InvisibleGhost #BelaLugosi #PublicDomainMovie #ColorizedClassic #1940sHorror #MonogramPictures #ClassicCinema #FilmRestoration #1941Movies #PsychologicalHorror #JosephHLewis #GothicMystery #GoldenAgeHorror",
      "addedAt": "2025-12-24T00:50:17.409Z",
      "thumbnail": "https://i.ytimg.com/vi/W0XuBp-7d_Q/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBcKFcwDw==&rs=AOn4CLAxQ-1liYCrRFqxbKXUsVVwewK3Vw",
      "duration": 3710,
      "language": "en",
      "year": 1941,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the_invisible_ghost_ipod",
      "id": "the_invisible_ghost_ipod",
      "title": "Invisible Ghost",
      "description": "The town's leading citizen becomes a homocidal maniac after his wife deserts him.",
      "fileSize": 1243327692,
      "addedAt": "2026-01-07T00:12:44.280Z",
      "thumbnail": "https://archive.org/services/img/the_invisible_ghost_ipod",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 37537
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GAm0plW3EDI",
      "id": "GAm0plW3EDI",
      "title": "Invisible Ghost (1941) BELA LUGOSI",
      "description": "Stars: Bela Lugosi, Polly Ann Young, Betty Compson\nDirector: Joseph H. Lewis\n\nAfter his wife deserts him, the town's leading citizen becomes a homicidal maniac and only a sole a terrified woman knows his ghastly secret!",
      "addedAt": "2025-12-26T23:44:29.395Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/GAm0plW3EDI/maxresdefault.webp",
      "duration": 3781,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GtDIbv8xBww",
      "id": "GtDIbv8xBww",
      "title": "Invisible Ghost (1941) COLORIZED | Bela Lugosi | Crime, Drama, Horror Full Color Movie",
      "description": "The town's leading citizen becomes a homicidal maniac after his wife deserts him.\n\nDirector: Joseph H. Lewis\nWriters: Helen Martin, Al Martin \nStars: Bela Lugosi, Polly Ann Young, John McGuire & Clarence Muse\nGenre:  Classics, Cult Movies, Drama, Horror, Thriller\n\nWatch the original Black & White movie: https://youtu.be/b8zuKPcdVWE\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:46:50.473Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/GtDIbv8xBww/maxresdefault.webp?v=638e37d5",
      "duration": 3779,
      "language": "en",
      "year": 1941,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b8zuKPcdVWE",
      "id": "b8zuKPcdVWE",
      "title": "Invisible Ghost (1941) Bela Lugosi | Crime, Drama, Horror Full Length Movie",
      "description": "THE PHANTOM KILLER STRIKES! Only a terrified woman knows the secret of this ghostly murderer...who strikes in the night and leaves no clues---but his victims!\nThe town's leading citizen becomes a homicidal maniac after his wife deserts him.\n\nDirector: Joseph H. Lewis\nWriters: Helen Martin, Al Martin \nStars: Bela Lugosi, Polly Ann Young, John McGuire & Clarence Muse\nGenre:  Classics, Cult Movies, Drama, Horror, Thriller\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:52:03.688Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/b8zuKPcdVWE/maxresdefault.webp?v=62ecc2de",
      "duration": 3781,
      "language": "en",
      "year": 1941,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/InvisibleGhost720p1941",
      "id": "InvisibleGhost720p1941",
      "title": "Invisible Ghost 720p 1941",
      "description": "The town's leading citizen becomes a homocidal maniac after his wife deserts him. Bela Lugosi, Polly Ann Young -IMDB 720p version.",
      "fileSize": 735918870,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/InvisibleGhost720p1941",
      "collection": "feature_films",
      "downloads": 8421
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": 5.2,
    "imdbVotes": 2719,
    "Genre": "Crime, Drama, Horror",
    "Plot": "The prominent Dr. Charles Kessler lives in a house with his daughter Virginia Kessler and his servants and misses his wife that left him. When there is a murder in his house, Virginia's fiancée Ralph Dickson is accused of the killing and sentenced to death penalty in the electric chair. Soon his twin brother Paul comes to Dr. Kessler's house, who invites him to stay in his house. Meanwhile, Mrs. Kessler is alive with neurological disorder after a car accident and hidden in the gardener's house that is secretly treating her. When she sneaks out of the house and sees Dr. Kessler in the window, he goes into a trance and turns into a killer. Will Dr. Kessler be stopped.",
    "Director": "Joseph H. Lewis",
    "Writer": "Helen Martin, Al Martin",
    "Actors": "Bela Lugosi, Polly Ann Young, John McGuire",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0165938",
    "tt0031208",
    "tt0037441",
    "tt0037932",
    "tt0031449",
    "tt0035753",
    "tt0047878",
    "tt0042006",
    "tt0037168",
    "tt0032258",
    "tt0035124",
    "tt0033107"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:10:02.522Z"
}