{
  "movieId": "tt0032014",
  "title": "Texas Wildcats",
  "year": 1939,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gzFOzrrmi2g",
      "id": "gzFOzrrmi2g",
      "title": "Texas Wildcats (1939) TIM McCOY🍕 COWBOY WESTERN",
      "description": "Stars: Tim McCoy,  Joan Barclay, Ben Corbett, Dave O'Brien\nDirector: Sam Newfield\n\nGet ready for action, intrigue, and frontier justice in \"Texas Wildcats,\" a thrilling classic Western starring legendary cowboy hero Tim McCoy as Lightning Bill Carson. Joined by his witty sidekick Magpie (Ben Corbett), Bill embarks on a daring mission to bring down the ruthless outlaw Burrows and his gang of cattle rustlers.\n\nDirected by Sam Newfield, a master of B-Western classics, this adventure showcases Bill's clever disguise as the mysterious Phantom as he outsmarts Burrows and defends the Arden ranch. Featuring the radiant Joan Barclay and dynamic Dave O'Brien, this film is a treasure for fans of Texas Rangers, Western outlaws, and gripping frontier justice.\n\nWhether you're a die-hard fan of Tim McCoy or a lover of stories about phantom bandits and wild West escapades, Texas Wildcats delivers everything you crave—gun-slinging action, suspenseful showdowns, and cowboy courage.\n\nExperience the rugged charm of the Old West and relive the golden age of Western cinema with this unforgettable adventure. Saddle up and join the fight for justice in this timeless classic!\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#TimMcCoy #Texas Wildcats #ClassicWesterns #CowboyMovies #VintageCinema #OldHollywood#ClassicWesterns #TimMcCoy #CowboyMovies #1939sCinema #VintageFilms",
      "addedAt": "2025-12-24T01:05:05.880Z",
      "thumbnail": "https://i.ytimg.com/vi/gzFOzrrmi2g/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDSiqwxXVchvlvQg4uC7kvtaeIZYA",
      "duration": 3391,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "57 min",
    "imdbRating": 6,
    "imdbVotes": 70,
    "Genre": "Western",
    "Plot": "Lightning Bill Carson and sidekick Magpie are after Burrows, the man that killed a friend of theirs. Burrows is after the Arden ranch and his gang are rustling their cattle. Bill is robbing Burrows while posing as the mysterious Phantom and it's not long before the two collide.",
    "Director": "Sam Newfield",
    "Writer": "George H. Plympton",
    "Actors": "Tim McCoy, Joan Barclay, Ben Corbett",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031769",
    "tt0030366",
    "tt0033104",
    "tt0031164",
    "tt0031306",
    "tt0032055",
    "tt0030756",
    "tt0031929",
    "tt0030581",
    "tt0033141",
    "tt0030001",
    "tt0032989"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:35:08.146Z"
}