{
  "imdbId": "tt0049437",
  "title": "Liane, Jungle Goddess",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/liane_jungle_goddess",
      "id": "liane_jungle_goddess",
      "title": "Liane, das Mädchen aus dem Urwald(Liane Jungle Goddess)",
      "description": "From IMDB : Researchers in the African jungle find a young white woman living with a tribe, that adores her as goddess. They carry her off and proudly report to the press. It turns out that she may be Liane, the long lost daughter of the rich shipowner Amelongen. So Toren starts civilizing her and takes her to Germany, where she - now in love with Toren - has to defend herself against accusations of legacy-hunting. Will she fit into her new society?",
      "fileSize": 2320156795,
      "addedAt": "2026-01-07T00:09:38.890Z",
      "thumbnail": "https://archive.org/services/img/liane_jungle_goddess",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 71722
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "88 min",
    "imdbRating": 5.1,
    "imdbVotes": 480,
    "Genre": "Adventure",
    "Plot": "An expedition discovers blonde 16 year-old Liane venerated by the native tribe in the African jungle and returns her to Hamburg where she is welcomed by her grandfather, ship tycoon Von Amelongen. His nephew Schoening, present head of the firm and prospective heir, tries all to stop his uncle from acknowledging her, including perjury, destruction of evidence, and finally resorting to murder. He dies in an accident driving his car into the river in his flight from the police. There is a subplot around a love quadrangle centered around Thoren, who is secretly loved by biologist Jacqueline who is in turn courted by Hungarian Tibor. Thoren plays paternal protector to Liane before succumbing to her youthful charm and returning with her to the jungle.",
    "Director": "Eduard von Borsody",
    "Writer": "Anne Day-Helveg, Thomas Fough, Ernst von Salomon",
    "Actors": "Marion Michael, Hardy Krüger, Irene Galter",
    "Language": "German",
    "Country": "West Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0050803",
    "tt0049962",
    "tt0049477",
    "tt0048682",
    "tt0247746",
    "tt0049516",
    "tt0048983",
    "tt0049109",
    "tt0049115",
    "tt0049223",
    "tt0049258",
    "tt0049446"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.890Z"
}