{
  "movieId": "tt0051978",
  "title": "The Naked and the Dead",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-naked-and-the-dead-1958",
      "id": "the-naked-and-the-dead-1958",
      "title": "The Naked And The Dead (1958) Aldo Ray · Cliff Robertson",
      "description": "Mailer's novel, in which American troops attempt to conquer a Japanese-occupied island in the Pacific under the most gruesome of circumstances, was intended to illustrate that the US military had been infected by the spirit of its fascist enemy.   The film adaptation has eliminated this radical accusation and limited itself to a somewhat self-critical depiction of the harsh life of soldiers in war. The film is very professional in its craftsmanship and acting.",
      "fileSize": 4103038406,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-naked-and-the-dead-1958",
      "language": "eng",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 435
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "131 min",
    "imdbRating": 6.4,
    "imdbVotes": 1871,
    "Genre": "Drama, War",
    "Plot": "In the Pacific during World War 2, the officers live a comfortable life with good food, good drink and good quarters. To them, war is a game which they know they will win and the common soldiers are the pawns on the board. When the campaign slows down, the Commander sends a squad to the top of a mountain behind enemy lines to report on the Japanese troop movements. The squad is commanded by a tough cynical Sergeant who takes no prisoners and even takes the gold from the teeth of the enemy dead. Before the mission starts, the lieutenant, who has had a cushy job due to a life of wealth and privilege, criticizes the Commander over his attitude towards the common soldier and is re-assigned to lead the squad. The veteran Sergeant wants to complete this mission as ordered, and he will do everything he can do to see that it is successful.",
    "Director": "Raoul Walsh",
    "Writer": "Denis Sanders, Terry Sanders, Norman Mailer",
    "Actors": "Aldo Ray, Cliff Robertson, Raymond Massey",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0047860",
    "tt0049672",
    "tt0017540",
    "tt0050699",
    "tt0051476",
    "tt0051454",
    "tt0053935",
    "tt0051797",
    "tt0052151",
    "tt0051052",
    "tt0051776",
    "tt0052415"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}