{
  "imdbId": "tt0015881",
  "title": "Greed",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/greed-1924",
      "id": "greed-1924",
      "title": "Greed (1924)",
      "description": "OURO E MALDIÇÃO ( Greed ) ( Filme Completo / Legendado em Português ) Data de Lançamento: 04  de Dezembro de 1924 » SOBRE O FILME: O filme mostra a transformação do caráter de três pessoas. Após um bom tempo trabalhando em uma mina, McTeague se muda para a Califórnia, onde passa a trabalhar ilegalmente como dentista, e conhece e se casa com Trina, prima de seu amigo Marcus, também interessado nela. Trina ganha um grande prêmio na loteria e, aos poucos, vai sendo dominada pela avareza, o que desperta o caráter violento de McTeague, e a inveja de Marcus. . Ouro e Maldição é considerado por muitos como a maior obra-prima do diretor austríaco Erich von Stroheim e um dos maiores filmes do Cinema. Concebido inicialmente como um projeto monumental e hiper-realista de mais de 9 horas de duração, o filme foi exibido em sua forma original apenas uma única vez, no dia 12 de Janeiro de 1924, para um pequeno grupo de pessoas. Após isto, os originais do longa foram sucessiva e severamente mutilados, sob ordens da MGM e contra a vontade do diretor, e o material descartado foi posteriormente incinerado. Da versão original, de 42 bobinas e vários milhares de metros de celuloide, restou uma versão de apenas duas bobinas e pouco mais de duas horas de duração, que foi posteriormente levada aos cinemas. Desolado com o que foi feito com o seu trabalho, Erich Stroheim jamais assistiu esta versão. Uma nova edição foi realizada em 1999, com uma duração de 3h 59min, resultado direto do trabalho do pesquisador e restaurador Rick Schmidlin. . Ouro e Maldição é a adaptação do romance \"McTeague\", de Frank Norris, escritor norte-americano ligado ao estilo de Émile Zola. Uma das características mais fortes do romance, transpostas fielmente para o filme, é a recorrência de alguns traços do Naturalismo, como a inalienável força da hereditariedade, o poder teriomórfico dos instintos (principalmente no que se refere aos impulsos do sexo e da violência), as precárias condições de vida das classes mais baixas – reveladas no modo da denúncia de um ultra-realismo. Fiel ao ultra-realismo preconizado no livro, Stroheim exigiu que as filmagens fossem feitas nas próprias locações mencionadas no romance e, na busca por uma adaptação o mais fiel possível, descartou o uso de um roteiro adaptado e procurou filmar todo o livro, página a página, ponto a ponto. » » DIREÇÃO: Erich von Stroheim GÊNERO: Drama, Thriller ORIGEM: USA  DURAÇÃO: 3h 59min » » ELENCO PRINCIPAL: Zasu Pitts ... Trina Gibson Gowland ... McTeague Jean Hersholt ... Marcus Dale Fuller ... Maria Tempe Pigott ... Mother McTeague Sylvia Ashton ... 'Mommer' Sieppe Chester Conklin ... 'Popper' Sieppe Joan Standing ... Selina",
      "fileSize": 5717331395,
      "addedAt": "2026-01-07T00:08:39.343Z",
      "thumbnail": "https://archive.org/services/img/greed-1924",
      "collection": "feature_films",
      "downloads": 3250
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-greed",
      "id": "silent-greed",
      "title": "Greed",
      "fileSize": 6179598424,
      "addedAt": "2026-01-07T00:10:59.118Z",
      "thumbnail": "https://archive.org/services/img/silent-greed",
      "language": "English",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 1474
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "140 min",
    "imdbRating": 8,
    "imdbVotes": 11018,
    "Genre": "Drama, Thriller, Western",
    "Plot": "John McTeague was a simple slow man who became a dentist after working at the Big Dipper Gold Mine. He is now being hunted in Death Valley by his ex-best friend Marcus and the law. His lot was cast the day that he meet his future wife Trina in his office. She was with Marcus and she bought a lottery ticket. Well Mac fell for her and Marcus stepped aside. When Mac and Trina married, she won the Lottery for $5000 and became obsessive about the money in gold. Marcus is steamed as he stepped aside and now she is rich so he has the law shut down Mac as he has no official schooling for his dentistry. Trina fearful that they will take her gold away sells everything and takes all Mac earns when he is working. She adds to her stash of gold as they both live as paupers. When Mac has no job and no money, he leaves and Trina moves. Driven to desperation at being poor and hungry he finds Trina and demands the gold.",
    "Director": "Erich von Stroheim",
    "Writer": "June Mathis, Erich von Stroheim, Frank Norris",
    "Actors": "Gibson Gowland, Zasu Pitts, Jean Hersholt",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "3 wins"
  },
  "relatedMovies": [
    "tt0013140",
    "tt0016104",
    "tt0019558",
    "tt0060355",
    "tt2510028",
    "tt2396489",
    "tt0062309",
    "tt1268970",
    "tt5294522",
    "tt0015648",
    "tt0015634",
    "tt0015627"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}