{
  "imdbId": "tt0020629",
  "title": "All Quiet on the Western Front",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/all.-quiet.-on.-the.-western.-front.-1930",
      "id": "all.-quiet.-on.-the.-western.-front.-1930",
      "title": "All Quiet on the Western Front (1930)",
      "description": "All Quiet on the Western Front is a 1930 American pre-Code epic anti-war film based on the 1929 novel of the same name by German novelist Erich Maria Remarque.It  follows Paul Bäumer, a young German soldier who enlists in World War I after being inspired by his teacher's patriotic speeches. The film depicts the brutal realities of war, showcasing the physical and emotional trauma faced by Paul and his friends as they experience the horrors of battle, leading to a profound disillusionment with the idea of glory in warfare.",
      "fileSize": 1291149967,
      "addedAt": "2026-01-07T00:07:24.998Z",
      "thumbnail": "https://archive.org/services/img/all.-quiet.-on.-the.-western.-front.-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 462
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "152 min",
    "imdbRating": 8.1,
    "imdbVotes": 70816,
    "Genre": "Drama, War",
    "Plot": "This is an English language film (made in America) adapted from a novel by German author Erich Maria Remarque. The film follows a group of German schoolboys, talked into enlisting at the beginning of World War 1 by their jingoistic teacher. The story is told entirely through the experiences of the young German recruits and highlights the tragedy of war through the eyes of individuals. As the boys witness death and mutilation all around them, any preconceptions about \"the enemy\" and the \"rights and wrongs\" of the conflict disappear, leaving them angry and bewildered. This is highlighted in the scene where Paul mortally wounds a French soldier and then weeps bitterly as he fights to save his life while trapped in a shell crater with the body. The film is not about heroism but about drudgery and futility and the gulf between the concept of war and the actuality.",
    "Director": "Lewis Milestone",
    "Writer": "Erich Maria Remarque, Maxwell Anderson, George Abbott",
    "Actors": "Lew Ayres, Louis Wolheim, John Wray",
    "Language": "English, French, German, Latin",
    "Country": "United States",
    "Awards": "Won 2 Oscars. 10 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt0020217",
    "tt0019304",
    "tt0036217",
    "tt0040109",
    "tt0053183",
    "tt0038235",
    "tt0021890",
    "tt0023369",
    "tt0020620",
    "tt0021001",
    "tt0021013",
    "tt0021542"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.998Z"
}