{
  "imdbId": "tt0096243",
  "title": "The Tenth Man",
  "year": 1988,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-tenth-man-1988",
      "id": "the-tenth-man-1988",
      "title": "The Tenth Man (1988)",
      "description": "The Tenth Man is a television movie of 1988  based on the novel The Tenth Man by Graham Greene.  In the movie, a wealthy Paris lawyer named Chanel is sentenced to die in a German prison during World War II. To save himself, he trades his life for that of a fellow prisoner, who is executed in his place. After the war, Chavel returns to his old home, now occupied by the family of the man who died, and assumes a false identity while grappling with guilt and seeking redemption.",
      "fileSize": 1734898834,
      "addedAt": "2026-01-07T00:12:33.204Z",
      "thumbnail": "https://archive.org/services/img/the-tenth-man-1988",
      "language": "eng",
      "year": 1988,
      "collection": "feature_films",
      "downloads": 344
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "100 min",
    "imdbRating": 6.9,
    "imdbVotes": 2008,
    "Genre": "Drama, War",
    "Plot": "Based on the novel of the same name by Graham Greene, this is a story of a French advocate Chavel who, while imprisoned by the Germans during the occupation, trades his material possessions to another prisoner in exchange for his life when condemned to the firing squad. At the end of the war, Chavel, posing as one of the other prisoners, returns to his home which is now occupied by Therese, the sister of the prisoner he traded his possessions to, and who bitterly awaits the return of the man who had indirectly caused the death of her brother. His real identity unknown to Therese, Chavel is invited to stay as a caretaker and to identify Chavel should he return to the house. The relationship between Chavel and Therese develops until one night, someone calling himself Chavel turns up at their doorstep.",
    "Director": "Jack Gold",
    "Writer": "Graham Greene, Lee Langley",
    "Actors": "Anthony Hopkins, Kristin Scott Thomas, Derek Jacobi",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 1 Primetime Emmy. 1 win & 3 nominations total"
  },
  "relatedMovies": [
    "tt0092978",
    "tt0098437",
    "tt0100762",
    "tt0094844",
    "tt0092965",
    "tt0088734",
    "tt0101465",
    "tt0091251",
    "tt0089279",
    "tt0020620",
    "tt0033021",
    "tt0004972"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.204Z"
}