{
  "imdbId": "tt0038346",
  "title": "Behind Green Lights",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BehindGreenLights",
      "title": "Behind Green Lights",
      "description": "Crime Drama Information about this movie can be found on it's IMDB page .",
      "id": "BehindGreenLights"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/behind-green-lights-1946_202307",
      "title": "Behind Green Lights 1946 202307",
      "description": "An unscrupulous private investigator with a penchant for blackmail is found dead in a car and the leading suspect is Janet Bradley, the daughter of a mayoral candidate. With the election just weeks away, shady and ruthless individuals muscle the medical officer into switching the corpse with another body. Lieutenant Sam Carson, one of the few good apples in the bunch must find a way to get to the bottom of it all. Watch on RetroFlix:  https://retroflix.org/behind-green-lights-1946/",
      "id": "behind-green-lights-1946_202307"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/behind_green_lights",
      "title": "Behind Green Lights",
      "id": "behind_green_lights"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/behind_green_lights_acm",
      "title": "Behind Green Lights Acm",
      "description": "Police lieutenant Sam Carson investigates a political murder after the body of a blackmailing reporter is dumped at the door of police headquarters.",
      "id": "behind_green_lights_acm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YUlYI4cHsU8",
      "title": "Behind Green Lights (1946) [Film Noir] [Drama] [Mystery]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | A car containing a bullet ridden blackmailer's corpse is left in front of the police station. The daughter of a mayoral candidate had visited the blackmailer that day, and is brought in for questioning. A newspaper editor, who does not want that candidate to win, visits Lt. Carson and pressures him to tarnish the daughter's reputation until the election is decided. Carson resists.\n\nThe corrupt medical officer takes orders from the editor, and is commanded to get the body out of the police station before anyone else learns that the blackmailer was poisoned before being shot. Some slapstick comedy ensues during attempts to smuggle the body out of the station. After further plot complications, the murderer and his motives are revealed. The mayoral candidate's daughter is cleared of suspicion before her father's chance in the election is ruined.\n\n---\n\nDirected by Otto Brower, produced by Robert Bassler, written by Charles G. Booth and Scott Darling, starring Carole Landis as Janet Bradley, William Gargan as Lt. Sam Carson, Don Beddoe as Dr. Yager (Medical Examiner), Richard Crane as Johnny Williams (Reporter), Mary Anderson as Nora Bard, John Ireland as Det. Engelhofer, Charles Russell as Arthur Templeton, Roy Roberts as Max Calvert, Mabel Paige as Flossie, Stanley Prager as Ruzinsky (Milkman) and Charles Tannen as Ames (Reporter).\n\n---\n\nSource: \"Behind Green Lights\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 17 January 2013. Web. 17 March 2013. http://en.wikipedia.org/wiki/Behind_Green_Lights.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "YUlYI4cHsU8",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=btN_fTaDu4I",
      "title": "Behind Green Lights (1946) | Colorized Public Domain Classic Crime Mystery with Carole Landis",
      "description": "Behind Green Lights (1946) is an American crime mystery film directed by Otto Brower, produced by 20th Century Fox, and adapted from the novel by George Worthing Yates. This restored and colorized public domain classic immerses viewers into the tense, shadowy world of 1940s noir, where politics, corruption, and crime intersect. By reviving this film in high-quality color, audiences in the United States, Europe, and beyond can rediscover a sharp, fast-paced thriller that reflects postwar American anxieties and Hollywood’s fascination with moral ambiguity.\n\nPlot Summary:\nThe story begins when the body of Walter Bard, a controversial businessman, is discovered in an automobile parked in front of police headquarters. Lieutenant Sam Carson (William Gargan), a dedicated and sharp detective, takes charge of the case. Carson quickly realizes that Bard’s death is anything but simple. The investigation pulls him into a web of corruption and intrigue that threatens to expose influential figures.\n\nCarson’s prime suspects include Janet Bradley (Carole Landis), the daughter of a prominent political figure who had been with Bard shortly before his death. Despite strong motives surrounding her, Carson doubts her guilt and senses deeper forces at play. As he pursues leads, Carson uncovers a network of political manipulation and media interference, particularly from cynical reporter Max Calvert (Don Beddoe), who tries to shape the narrative for personal gain.\n\nComplications mount when shady characters, power-hungry officials, and cover-ups emerge, forcing Carson to navigate both the criminal underworld and the upper echelons of politics. The tension builds toward a gripping climax where truth and justice come into conflict with influence and corruption. The film’s brisk pacing, sharp dialogue, and atmospheric setting make it an excellent example of mid-1940s Hollywood crime dramas.\n\nCast and Crew:\n• Director: Otto Brower\n• Producer: B.P. Schulberg (associate)\n• Screenplay: George Callahan\n• Based on: Novel by George Worthing Yates\n• Cinematography: Joseph LaShelle (Academy Award-winning cinematographer)\n• Editing: Harmon Jones\n\nStarring:\n• Carole Landis as Janet Bradley\n• William Gargan as Lt. Sam Carson\n• Richard Crane as Johnny Williams\n• Don Beddoe as Max Calvert\n• Charles Russell as Arthur Templeton\n• John Ireland as Police Sergeant\n• Roy Roberts as Police Captain\n• Henry H. Daniels Jr. as Walter Bard\n\nFilm Significance:\nBehind Green Lights stands as a strong representation of 1940s crime cinema. It combines political drama, police procedural elements, and noir aesthetics into a taut narrative that mirrors the cynicism and uncertainty of post-World War II America. Carole Landis delivers a compelling performance, while William Gargan embodies the hard-nosed but principled detective archetype that became a staple of the genre. Though not a big-budget feature, its clean storytelling, brisk 64-minute runtime, and memorable performances make it a hidden gem in the public domain.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Behind Green Lights remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1946 release was in black and white, typical of crime dramas of its era. While historically authentic, many modern audiences skip past black-and-white films. By offering a colorized edition, we bridge the gap between historical preservation and contemporary viewing habits. This allows the gripping tension of Behind Green Lights to resonate with new audiences while preserving its original impact.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#BehindGreenLights #CaroleLandis #WilliamGargan #1940sCrimeFilm #PublicDomainMovie #ColorizedClassic #FilmNoir #ClassicHollywood #1946Movies #CrimeMyster",
      "id": "btN_fTaDu4I",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BehindGreenLights_high_Q_mp4",
      "title": "Behind Green Lights",
      "description": "The action begins when a car occupied by the corpse of a sleazy private detective glides down a hill and winds up in front of a police station. (The title of the film stems from the fact that police stations used to have green lights at the entrance.) Currently (2010-02-23) the movie is rated 7.2 at the IMDB ! Some of the stars are William Gargan, Carole Landis, John Ireland, Charles Russell, and Don Beddoe. Althought this film was already on this site, those who didn't want to download 4 gigabytes had to settle for a low-resolution 269-megabyte file. So I transcoded the 4-gigabyte file with a reasonable bitrate while performing a massive amount of video noise-reduction. In addition, the mpeg2 file has nav-packets and is ready to be loaded into DVDAuthorGUI (a free program) to create a DVD to watch on your television.",
      "id": "BehindGreenLights_high_Q_mp4"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=chYNggJ_mCY",
      "title": "Behind Green Lights (1946) CAROLE LANDIS",
      "description": "Stars: Carole Landis, William Gargan, Richard Crane \nDirector: Otto Brower\n\nA Police lieutenant investigates a political murder after the victim is dumped at the door of police headquarters!",
      "id": "chYNggJ_mCY",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gTQA_RdApeI",
      "title": "Behind Green Lights (1946) Classic Film-Noir, Mystery | Full Length Movie",
      "description": "This private sleuth has two mysteries to solve at once...Twice the thrills and double the excitement!!! \nPolice lieutenant Sam Carson investigates a political murder after the victim is dumped at the door of police headquarters.\n\nDirector: Otto Brower\nWriters: Scott Darling, Charles G. Booth\nStars: Carole Landis, William Gargan, Richard Crane\nGenres: Classics, Drama, Film-Noir, Mystery, Romance\n \n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "gTQA_RdApeI",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "64 min",
    "imdbRating": "6.4",
    "imdbVotes": "1,068",
    "Genre": "Drama, Film-Noir, Mystery",
    "Plot": "Police lieutenant Sam Carson investigates a political murder after the victim is dumped at the door of police headquarters.",
    "Director": "Otto Brower",
    "Writer": "Scott Darling, Charles G. Booth",
    "Actors": "Carole Landis, William Gargan, Richard Crane",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0039757",
      "title": "The Red House",
      "year": 1947,
      "imdbRating": "6.7",
      "imdbVotes": "5,167",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039768",
      "title": "Ride the Pink Horse",
      "year": 1947,
      "imdbRating": "7.2",
      "imdbVotes": "3,532",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037693",
      "title": "The Fatal Witness",
      "year": 1945,
      "imdbRating": "5.9",
      "imdbVotes": "139",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038109",
      "title": "Spellbound",
      "year": 1945,
      "imdbRating": "7.5",
      "imdbVotes": "53,812",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036886",
      "title": "Guest in the House",
      "year": 1944,
      "imdbRating": "6.2",
      "imdbVotes": "1,087",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040798",
      "title": "Sleep, My Love",
      "year": 1948,
      "imdbRating": "6.8",
      "imdbVotes": "2,259",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040823",
      "title": "Sorry, Wrong Number",
      "year": 1948,
      "imdbRating": "7.3",
      "imdbVotes": "12,863",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040002",
      "title": "A Woman's Vengeance",
      "year": 1948,
      "imdbRating": "6.9",
      "imdbVotes": "908",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036745",
      "title": "Dark Waters",
      "year": 1944,
      "imdbRating": "6.5",
      "imdbVotes": "1,118",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037008",
      "title": "Laura",
      "year": 1944,
      "imdbRating": "7.9",
      "imdbVotes": "52,736",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040338",
      "title": "The Fallen Idol",
      "year": 1948,
      "imdbRating": "7.6",
      "imdbVotes": "9,854",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038986",
      "title": "Strange Impersonation",
      "year": 1946,
      "imdbRating": "6.3",
      "imdbVotes": "836",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:57:03.185Z"
}