{
  "imdbId": "tt0083167",
  "title": "Tango durch Deutschland",
  "year": 1980,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Tango_Short_Version",
      "title": "1980 Tango durch Deutschland (tango through Germany)",
      "description": "Production Manager: Ulli Kratzsch Eddie Constantine obtaines by the Tribunal the opportunity to lead a better live, with that not only he but the whole film fails. Music: Astor Piazzolla Camera: Lutz Mommartz, Martin Schäfer, Dieter Fietzke, Jürgen F. Hagemann Sound: Herbert Baumann, Jürgen Zech Makeup artist: Marie-Luise Engel Cooperation: Georg Bühren, Wolfgang Braden, Walter Foelske, Jürgen Kuhfuß Edition: Ina Rasche Actors: Eddie Constantine, Maya Faber-Jansen, Detlef F. Neufert, Manfred Bölk, Anna Plakinger, Gerta Reinhardt, Georg Bradtke, Jango Edwards and his friends road-show,Hartmut Redottée, Bastian Feldmann, Klaus Hang a.o. LUTZ MOMMARTZ About the creation of \"Tango through Germany\" For years I was looking for a character, a man who strives steadfastly afar. His movements are very determined but calm. He does not run to a specific goal, but celebrats in a ritual sense, that it is about something that concerns everyone. Wherever he goes, he disrupts the normal flow of the things, bringing traffic to a stop and makes himself a place. He makes marks, provokes as a performance artist and takes the liberty to swim against the current. He produces astonishment and does not act aggressively. Ultimately one allows him transgressions of all kind. He defies conventions and embodies that tension, in which the anticipatory spirit relates himself with the reality. When he finally is stopped by the mass, drows in her and disappears from our view, we know that he appears anywhere again. With him and a small filming crew, I wanted to travel through the country, imagining an action for each spot and shoot. Maybe there is not such a performer. In April 1979, it happened that I was sitting next to Eddie Constantine. He asked me what I'm doing at the moment. Out of sheer embarrassment I told him about my project. He immediately caught fire: \"I'll make that free for you!\" I thought it was completely impossible, even absurd just with him. But he did not give up and lured with an image: A guy like Buster Keaton he wanted to embody. As I pushed my project aside to see what else might be possible with him. In the screen test, he came to meet my way of direct shooting. So I thought we can risk it. Then everything turned out completely different. As the gobermental movie sponsorship accepted, he no longer wanted to film without a script and a fee had to be paid. As material for the script we took his life. In this a tribunal him is giving the chance to try everything again. His love affair with Maya Faber-Jansen was included. A new camera man had to be found, because Dieter Fietzke became an unpleasant feeling. In this distress Martin Schäfer took over the role. Unfortunately for me, because he thought in very different pictures than I did. And so the disaster took its course. GERTRUD KOCH, FRANKFURTER RUNDSCHAU, MAI 81 Hovering like the wheelchair at the start this Tango turns to a secret motive of a love song, the incarnation of the mummy is sung about the love in poetic parklands and with Nietzsche. Before, of course, the unhappy consciousness looses itself in the idyll of \"little things of life\" such as painting window frames and roller skating, Lutz Mommartz pushes a bleak enigmatic end: In the empty factory buildings Eddie searches still or again for Maja, and as in a Fellini dream he disappears searching in the darkness of a corridor. SEBASTIAN FELDMANN, RP, 19.3.81 A city street at night. Two ominous light radiating spray cars sweep the dirt of the past into the gutter of oblivion. But in the imaginary museum of film sharp Spotlight headlights scurry on the gradually becoming threadbare screens of old, hand-painted cinema facade signs. On a rotating pivot platform they capture the mummy statue of a decaying cinema idol whose name is Eddie Constantine - whose name is not mentioned once throughout the whole following movie. Brown is the lether skinned face mask under his hat, the arm stretched up, out of the trenchcoat in a boxer like defense position. The beginning of \"Tango through Germany\" by Lutz Mommartz used ancient resurrection myths like Orpheus and Euridike, Lazarus, Kyffhäuser-King Rotbart or newer versions like Sartres \"The game is over\" WOLFGANG WÜRKER, FAZ 19.6.81 Now Eddie Constantine wanders through the streets of Düsseldorf / Germany in 1980, changes busy road sides in an undecided way, encounters incessantly himself, finds himself among pensioners in a park, a voyeur in a relevant establishment or even in Edith Piaf, his revered teacher, that he knows masterfully how to imitate.",
      "id": "Tango_Short_Version"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "89 min",
    "imdbRating": "5.5",
    "imdbVotes": "14",
    "Genre": "N/A",
    "Plot": "N/A",
    "Director": "Lutz Mommartz",
    "Writer": "Lutz Mommartz",
    "Actors": "Eddie Constantine, Maya Faber-Jansen, Anna Plackinger",
    "Language": "German, English, French",
    "Country": "West Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt7320904",
      "title": "Eddie and Lutz",
      "year": 1979,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt25610444",
      "title": "The Empire Strikes Back (1980)/Annie Hall (1977) - 69 Movie Buff Specialists (Ep 32)",
      "year": 1980,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt26324048",
      "title": "Hell of the Living Dead (1980)",
      "year": 1980,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt24820788",
      "title": "Apocalypse Now (1979)",
      "year": 1979,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt24014512",
      "title": "Dawn of the Dead (1978)",
      "year": 1978,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2193199",
      "title": "Shanghai Joe",
      "year": 1978,
      "imdbRating": "5.4",
      "imdbVotes": "6",
      "language": "Filipino, Tagalog",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0084092",
      "title": "Hot Snow",
      "year": 1982,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt7322114",
      "title": "Teenage Art",
      "year": 1969,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt7322102",
      "title": "Mietersolidarität",
      "year": 1970,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt7321742",
      "title": "400 m IFF",
      "year": 1969,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt7322080",
      "title": "Die Schiller",
      "year": 1975,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt7322088",
      "title": "Haircut",
      "year": 1974,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:58.271Z"
}