{
  "movieId": "tt0004681",
  "title": "Tess of the Storm Country",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TessOfTheStormCountryForYT",
      "id": "TessOfTheStormCountryForYT",
      "title": "\"Tess of the Storm Country\" (1914) starring Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"Tess of the Storm Country\" is a moving drama. A rich man has built a house on top of a hill and is going out of his way to get rid of his poor squatter neighbors living at the bottom.  In 2006 the film was selected for preservation in the National Film Registry as being deemed \"culturally, historically, or aesthetically significant.\"   Directed by                    Edwin S. Porter Produced by                  Famous Players Film Company Written by                     B.P. Schulberg, from the novel Tess of the Storm Country by Grace Miller White Starring                         Mary Pickford, Harold Lockwood, Olive Carey, David Hartford, William Walters Release date                   March 30, 1914 Running time                 74 minutes Country                          United States Language                        Silent film   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 89981211,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/TessOfTheStormCountryForYT",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 3743
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6,
    "imdbVotes": 279,
    "Genre": "Drama",
    "Plot": "Tessibel Skinner, a wild, motherless little elf, lives with her father in a rude but on the shore of Cayuga Lake. On account of the sudden and regular squalls on the lake, the vicinity is called the \"Storm Country,\" while the poor and ignorant fisher-folk thereabout are generally known as \"squatters.\" Tess is one of these people, and adores her uncouth father, who lives by poaching and the illegal netting of fish. One day he is found near the body of a murdered gamekeeper, with a rifle close by, containing one empty chamber. Skinner is accused of the murder and convicted on circumstantial evidence. Tess is frantic with grief and anxiety, but Frederick Graves, a handsome theological student, and his sister, Teola, befriend Tess. Frederick tells her of God, of whom she has never heard, and His written word, the Bible, and bids her pray and have faith. Tess steals a Bible from the Mission Church, painfully spells out the lessons taught her by Frederick, and the untutored girl's faith brings her a wonderful strength and hope. Professor Young, an eminent legal authority and an influence in the community, touched by her profound faith in a Power that will aid her father, intercedes for her and secures a new trial for her father. Tess is happy over this evidence of God's love for her, but gives Frederick Graves more credit than she does the professor. Tess and Frederick meet again, and one day as they stand in the squalid hut, looking into each others' eyes, Tess innocently receives her first kiss of love. Frederick loves and reveres the little ignorant girl for her pure nature and strong faith, and Tess, who hardly knows what has come into her bleak life, puts Frederick upon her pedestal of faith and almost worships him as a symbol of the God she does not understand. Elder Elias Graves, Frederick's father, a religious but bigoted and narrow man, the relentless enemy of the \"squatters,\" does his best to secure the conviction of Tess's father. Teola Graves is betrothed to Dan Jordan, who perishes in a fire and leaves Teola worse than widow. Teola does not dare tell her proud, harsh father of her pitiful plight. Tess hears her weeping one day in the woods and takes her to the hut, sheltering her there when her babe is born. To shield Teola, Tess takes the child and cares for it. Frederick finds the baby there on one of his calls, and circumstances force him to believe it is Tess's child. Rather than expose and disgrace his sister, who is now very ill, Tess allows him to believe the child hers, and he denounces her as a worthless woman, taking her Bible from her. Tess, seeing his cruel anger and unfaith, knows that her idol has fallen also, but declares that though he has taken her Bible, he cannot take away her God, and, left alone, falls on her knees in prayer. Her life now becomes a hard one, indeed. Her father is still in prison, Frederick avoids her, the other \"squatters\" comment openly on her \"fall,\" and one of the fishermen persecutes and insults her, but she persists in her sacrifice for Teola and her faith in God. At last, in a tragically dramatic scene, Elder Graves publicly denounces Tess and the fatherless babe she holds to her breast. But Teola, roused by her father's denunciation of Tess, can remain silent no longer, and now comes forward and in the presence of the big assemblage takes her baby in her arms and claims it as her own. The proud Elder Graves is overwhelmed with shame and remorse, and Tess is freed from the shadow of disgrace. Teola and her sickly babe both die, and the Elder writes a pleading note to Tess for her forgiveness, which the humble Frederick bears to her. Tess, nobly understanding and forgiving all, goes to Frederick's waiting arms; another fisherman is found to be the murderer of the game-keeper; her father is liberated, and Tess finds the reward of her faith in a great love and happiness.",
    "Director": "Edwin S. Porter",
    "Writer": "Grace Miller White, B.P. Schulberg",
    "Actors": "Mary Pickford, Harold Lockwood, Olive Carey",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0003772",
    "tt0000557",
    "tt0477380",
    "tt0445359",
    "tt0000904",
    "tt0000519",
    "tt0228839",
    "tt0234913",
    "tt0000471",
    "tt0003497",
    "tt0005302",
    "tt0002054"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.271Z"
}