{
  "movieId": "tt0031068",
  "title": "Back Door to Heaven",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BackDoortoHeaven",
      "id": "BackDoortoHeaven",
      "title": "Back Door to Heaven",
      "description": "James Lydon appears as Francis (Frankie) Rogers, a small boy living a desperate existence in a slum area, who steals a harmonica in order to fit in with his classmates. He winds up in reform school, and eventually spends much of his life in prison. Upon his release, he (Wallace Ford - Frankie as an adult) finds that life on the outside can be just as hard as life on the inside.",
      "fileSize": 2040126986,
      "addedAt": "2026-01-07T00:06:14.038Z",
      "thumbnail": "https://archive.org/services/img/BackDoortoHeaven",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 64328
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Back_Door_to_Heaven",
      "id": "Back_Door_to_Heaven",
      "title": "Back Door to Heaven",
      "description": "Wallace Ford experiences poverty, crime, and incarceration.",
      "fileSize": 1824840581,
      "addedAt": "2026-01-07T00:06:14.038Z",
      "thumbnail": "https://archive.org/services/img/Back_Door_to_Heaven",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 24622
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E7DeNubgJDM",
      "id": "E7DeNubgJDM",
      "title": "Back Door to Heaven (1939) LIMMY LYDON",
      "description": "Stars: Jimmy Lydon, Stuart Erwin, Anita Magee\n Director: William K. Howard\n\n A young slum kid starts out stealing small things in order to fit in with the \"crowd\" and winds up in reform school. Eventually he spends much of his life in prison. Upon his release, he finds that life on the outside can be just as hard as life on the inside.",
      "addedAt": "2025-12-26T23:52:12.443Z",
      "thumbnail": "https://i.ytimg.com/vi/E7DeNubgJDM/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLC7weNEKZ5pAYumYpEeeXGeNUWjTg",
      "duration": 5012,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9hqRjcTiL3Q",
      "id": "9hqRjcTiL3Q",
      "title": "Back Door to Heaven (1939) Crime, Drama Full Length Movie",
      "description": "The life of a young slum kid, who starts out stealing small things in order to fit in with the \"crowd\", winds up in reform school, and eventually spends much of his life in prison.\n \nDirector: William K. Howard\nWriters: William K. Howard, John Bright \nStars: Jimmy Lydon, Anita Magee, Raymond Roe \nGenres: Classics, Crime, Drama \n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:50:55.449Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/9hqRjcTiL3Q/maxresdefault.webp?v=625ffa61",
      "duration": 5013,
      "language": "en",
      "year": 1939,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": 6,
    "imdbVotes": 177,
    "Genre": "Crime, Drama",
    "Plot": "Little Frankie Rogers lives on the wrong side of the tracks; his father is a drunkard and his mother is unable to support the family. After stealing a harmonica to play in his grammar school graduation recital, Frankie is sent to reform school, even though his teacher, Miss Williams, and classmate Carol Evans are convinced that he is a good boy. Frankie goes to reform school with dreams of leading a decent life, but those dreams are shattered when he is sentenced to the state penitentiary for slugging a trusty who was cruel to a fellow prisoner. His term completed, Frankie decides to go home to St. Mary, Ohio, and is accompanied by Jud Mason and Bert \"The Mouse\" Gatto, two friends from prison. Frankie finds that St. Mary has changed, however, and decides to move to Cleveland, where Carol has a struggling career as a singer. Carol convinces Frankie to settle down in Cleveland and get a job, but his plans go awry when, returning home one evening after a date with Carol, he learns that Jud and The Mouse have gone to rob a restaurant. Frankie rushes to stop them, but is too late, and arrives just as a man is killed. Frankie refuses to let Carol testify in his behalf and is convicted and sentenced to death. Meanwhile, Charley Smith, the only classmate of Frankie's who has become financially successful, invites his old schoolmates to return to St. Mary for a reunion. Under a cloud of gloom, the class reassembles and Carol and former classmate John Shelley beg Charley to help Frankie, but he smugly refuses. Hearing of the reunion, Frankie escapes from his cell and speeds home, bursting into the schoolroom just as Carol denounces Charley for his lack of compassion. After urging Carol to forgive Charley, Frankie bids farewell to his old schoolmates and leaves the building. Moments later, the sound of gun shots signal Frankie's death.",
    "Director": "William K. Howard",
    "Writer": "William K. Howard, John Bright, Robert Tasker",
    "Actors": "Jimmy Lydon, Anita Magee, Raymond Roe",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031788",
    "tt0032022",
    "tt0031338",
    "tt0031490",
    "tt0031505",
    "tt0033822",
    "tt0032784",
    "tt0031668",
    "tt0031680",
    "tt0031690",
    "tt0033062",
    "tt0031208"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.038Z"
}