{
  "imdbId": "tt0043721",
  "title": "The Lady Says No",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheLadySays",
      "id": "TheLadySays",
      "title": "The Lady Says No",
      "description": "Title: The Lady Says No Summary: A woman writes a best-selling book for women warning them about the \"dangers\" of men. A handsome photographer for a national magazine arrives in her town to do a feature story on her. Complications ensue. Directed by: Frank Ross Actors: Joan Caulfield, David Niven, James Robertson Justice Production Company: Ross-Stillman Productions Inc. Release Date: 6 January 1952 (USA) Aspect Ratio: 1.37 : 1 A woman writes a best-selling book for women warning them about the \"dangers\" of men. A handsome photographer for a national magazine arrives in her town to do a feature story on her. Complications ensue.",
      "fileSize": 580631890,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheLadySays",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 2016
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lady_says_no",
      "id": "lady_says_no",
      "title": "Lady Says No",
      "description": "Features David Niven. You can find more information regarding this film on its IMDb page .",
      "fileSize": 4853390852,
      "addedAt": "2026-01-07T00:09:24.703Z",
      "thumbnail": "https://archive.org/services/img/lady_says_no",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 59240
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0YdGYnWQfrY",
      "id": "0YdGYnWQfrY",
      "title": "The Lady Says No (1951) | Colorized Public Domain Romantic Comedy with Joan Caulfield & David Niven",
      "description": "The Lady Says No (1951) is an American romantic comedy directed by Frank Ross and starring Joan Caulfield, David Niven, and Roland Young. This colorized and digitally restored version revitalizes a public domain classic that blends humor, gender politics, and romance in postwar America. Originally filmed in black and white, the movie takes on new vibrancy in this enhanced edition, making it more engaging and accessible for today’s audiences across the United States, Europe, and worldwide.\n\nPlot Summary:\nBased on the play by Mary Loos and Richard Sale, the film follows Dorinda Hatch (Joan Caulfield), a confident and outspoken magazine writer who has authored a controversial book advising women to reject traditional romance and say “no” to love. Her career thrives on her progressive ideas, but her personal life becomes complicated when she is assigned to interview the charming photojournalist Bill Shelby (David Niven).\n\nBill, a war hero with a charismatic personality and a reputation as a ladies’ man, challenges Dorinda’s feminist philosophy with his playful wit and persistence. Their encounters lead to a battle of words, wit, and ideologies, where Dorinda’s ironclad resistance to romance begins to crumble under the weight of genuine affection. Meanwhile, supporting characters like Tommy (Farley Granger in an early uncredited appearance) and Captain Johnny (Roland Young) add comic relief and narrative twists.\n\nAs Dorinda struggles between her public persona and her private emotions, the film delivers both satire and warmth. Ultimately, The Lady Says No explores the clash between modern independence and timeless romance, reflecting the shifting cultural attitudes of the early 1950s.\n\nCast and Crew:\n• Director: Frank Ross\n• Producers: Frank Ross, Mary Loos\n• Screenplay: Mary Loos, Richard Sale (based on their play)\n• Cinematography: Hal Mohr\n• Editing: George Amy\nStarring:\n• Joan Caulfield as Dorinda Hatch\n• David Niven as Bill Shelby\n• Roland Young as Captain Johnny\n• Francis Lederer as Rene\n• Leon Ames as Matt Hornbeck\n• Henry Jones as Arthur\n• Alma Kruger as Aunt Alice\n\nFilm Significance:\nThe Lady Says No represents a transitional moment in Hollywood romantic comedies. Released in 1951, the film reflects postwar debates about women’s roles, career ambitions, and love in modern society. Joan Caulfield delivers a smart performance as an assertive woman caught between ideology and passion, while David Niven’s effortless charm underscores why he remained one of the era’s most popular leading men. Roland Young adds sophistication to the ensemble, enhancing the film’s comedic depth. Though not a major studio production, its wit and cultural commentary make it a valuable artifact of its time.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Lady Says No remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1951 release was in black and white, typical of the era’s production style. While historically authentic, many modern audiences hesitate to engage with monochrome films. This colorized edition bridges the gap between cinematic history and contemporary viewing habits, giving the story’s humor and romance renewed energy. By enhancing accessibility, this version allows both casual viewers and dedicated classic cinema fans to rediscover the charm of mid-century Hollywood.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheLadySaysNo #DavidNiven #JoanCaulfield #1950sComedy #PublicDomainMovie #ColorizedClassic #ClassicCinema #RomanticComedy #GoldenAgeHollywood #FilmRestoration #1951Movies",
      "addedAt": "2025-12-24T00:47:35.664Z",
      "thumbnail": "https://i.ytimg.com/vi/0YdGYnWQfrY/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBYKFEwDw==&rs=AOn4CLBKgHq9aO-ncR_sFSgscglPTcR-1g",
      "duration": 4684,
      "language": "en",
      "year": 1951,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-lady-says-no-1951-david-niven",
      "id": "the-lady-says-no-1951-david-niven",
      "title": "The Lady Says No (1951) DAVID NIVEN",
      "description": "A magazine photographer is sent to do a story on a best-selling feminist author and the pair clash about their beliefs.",
      "fileSize": 289886245,
      "addedAt": "2026-01-07T00:12:10.589Z",
      "thumbnail": "https://archive.org/services/img/the-lady-says-no-1951-david-niven",
      "collection": "feature_films",
      "downloads": 959
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r_pVY0ZLJ7E",
      "id": "r_pVY0ZLJ7E",
      "title": "The Lady Says No (1951) DAVID NIVEN",
      "description": "Stars: David Niven, Joan Caulfield, James Robertson Justice \nDirector: Frank Ross\n\nComplications ensue when a handsome magazine photographer arrives in town to do a feature on the woman who wrote a best-selling book warning women about the dangers of men!",
      "addedAt": "2025-12-26T23:46:04.646Z",
      "thumbnail": "https://i.ytimg.com/vi/r_pVY0ZLJ7E/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBjAWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLD7btpb6WWwgaKLq_aliFALb3MRuw",
      "duration": 4942,
      "language": "en",
      "year": 1951,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vAY81xeqa-0",
      "id": "vAY81xeqa-0",
      "title": "The Lady Says No (1951) DAVID NIVEN",
      "description": "Stars: David Niven, Joan Caulfield, James Robertson Justice \nDirector: Frank Ross\n\nComplications ensue when a handsome magazine photographer arrives in town to do a feature on the woman who wrote a best-selling book warning women about the dangers of men!",
      "addedAt": "2025-12-26T23:51:13.423Z",
      "thumbnail": "https://i.ytimg.com/vi/vAY81xeqa-0/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8ASAAuADigIMCAAQARhgIGAoYDAP&rs=AOn4CLBKLBIFdyhs54JHSZ1qGh_s3YDp8Q",
      "duration": 4944,
      "language": "en",
      "year": 1951,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qkycyFWy80E",
      "id": "qkycyFWy80E",
      "title": "The Lady Says No (1951) Rom-com with Joan Caulfield | directed by Frank Ross",
      "description": "Photographer Bill Shelby visits feminist author Dorinda Hatch to profile her for Life magazine, sparking a clash between his charm and her anti-romance convictions. Through humorous misadventures and witty exchanges, Dorinda begins questioning her beliefs as Bill challenges her self-image and stirs unexpected feelings. Ultimately, she overcomes her staunch resistance to love, embracing a new perspective and finding common ground with Bill.\n\nOriginal title: The Lady Says No (1951) Alternative title: Cupid Always Wins\n\nColorized version: https://youtu.be/T_RoHb6naCA\n\n\nDirector: Frank Ross\nWriter: Robert Russell\nStars: Joan Caulfield, David Niven, James Robertson Justice\nGenres: Comedy, Romance\nRelease date: January 6, 1952 (USA)\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:32:42.333Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/qkycyFWy80E/maxresdefault.webp?v=678f0c20",
      "duration": 4744,
      "language": "en",
      "year": 1951,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "80 min",
    "imdbRating": 5.2,
    "imdbVotes": 439,
    "Genre": "Comedy, Romance",
    "Plot": "A woman writes a best-selling book for women warning them about the \"dangers\" of men. A handsome photographer for a national magazine arrives in her town to do a feature story on her. Complications ensue.",
    "Director": "Frank Ross",
    "Writer": "Robert Russell",
    "Actors": "Joan Caulfield, David Niven, James Robertson Justice",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043618",
    "tt0043983",
    "tt0043651",
    "tt0044125",
    "tt0043313",
    "tt0043526",
    "tt0178749",
    "tt0125761",
    "tt0042325",
    "tt0042182",
    "tt0043127",
    "tt0043700"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.589Z"
}