{
  "imdbId": "tt0000700",
  "title": "Her First Adventure",
  "year": 1908,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HerFirstAdventure1908",
      "id": "HerFirstAdventure1908",
      "title": "\"Her First Adventure\" (1908) cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Her First Adventure\" is a short crime drama.  The film is included in our program to illustrate the work of our star Billy Bitzer.  A very young Robert Harron appears as an extra in the crowd. A little girl strays away from home, attracted by street performers. As they move on, so does the girl. Upon discovering her absence the father starts a chase led by the family dog. The film is notable for two facts: first, for the acting performance of D.W. Griffith as the father, and second, for being the earliest film with the Biograph \"AB\" logo, posted on the piano, to discourage film piracy. Directed by                       Wallace McCutcheon Cinematography by         Billy Bitzer Starring                             D.W. Griffith, Robert Harron Distributed by                   Biograph Company Release date                      March 13, 1908 Country                             United States Running time                    6 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 10458039,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HerFirstAdventure1908",
      "year": 1908,
      "collection": "feature_films",
      "downloads": 1634
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.1,
    "imdbVotes": 78,
    "Genre": "Drama, Short",
    "Plot": "A father arrives home, greets his wife and daughter, and then goes inside with his wife. Though they are only inside for a brief time, their daughter wanders off, attracted by the music from a pair of gypsies performing in the street. When the gypsies move on, they take the young girl with her. As soon as the parents realize that their daughter is gone, they begin a frantic search, assisted by the family's loyal dog.",
    "Director": "Wallace McCutcheon",
    "Writer": "N/A",
    "Actors": "D.W. Griffith, Robert Harron",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000651",
    "tt0000648",
    "tt0445338",
    "tt0000764",
    "tt0233351",
    "tt0000640",
    "tt0000728",
    "tt0000638",
    "tt0000785",
    "tt0000752",
    "tt0233728",
    "tt0433791"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.401Z"
}