{
  "movieId": "tt0002386",
  "title": "The Narrow Road",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheNarrowRoad",
      "id": "PreviewTheNarrowRoad",
      "title": "\"The Narrow Road\" (1912) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Narrow Road\" is a short crime drama. This film illustrates the work of Billy Bitzer, a star of Silent Hall of Fame. Mary Pickford welcomes home Elmer Booth after he serves time in prison. He seems determined to go straight, but...   Directed by               D. W. Griffith Produced by             Biograph Company Scenario by                George Hennessy         Starring                     Elmer Booth, Mary Pickford, Charles Hill Mailes Cinematography        Billy Bitzer Distributed by           The General Film Company, Incorporated Release date               August 1, 1912 Running time             17 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 10563153,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheNarrowRoad",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 1605
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-narrow-road",
      "id": "silent-the-narrow-road",
      "title": "The Narrow Road",
      "fileSize": 282479750,
      "addedAt": "2026-01-07T00:11:15.978Z",
      "thumbnail": "https://archive.org/services/img/silent-the-narrow-road",
      "language": "English",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 291
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.9,
    "imdbVotes": 162,
    "Genre": "Short, Drama",
    "Plot": "Jim Holcomb was a good fellow at heart, but having been thrown into evil associations he became perverted. He and a pal were arrested as counterfeiters and sent to the penitentiary. The story opens as their time of sentence is drawing to an end. Jim's faithful wife toils and patiently waits for his release, feeling that a brighter future is in store for them. The day of release arrives and when Jim meets his little wife he tells his erstwhile pal that it is the straight road for him in the future. The pal goes back to his old life, as he reasons it is easier to make counterfeit money than to earn real money. He is soon recognized and chased from his shack, where he is molding the \"spurious.\" In his flight he runs into the apartment in which Jim and his wife live, and persuades them to hide his kit of tools. This rash act nearly costs them dear, for the detectives enter almost immediately. The cause of their escape and the guilty man's apprehension is too unique to describe here.",
    "Director": "D.W. Griffith",
    "Writer": "George Hennessy",
    "Actors": "Elmer Booth, Mary Pickford, Charles Hill Mailes",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002478",
    "tt0002391",
    "tt0003497",
    "tt0002381",
    "tt0002054",
    "tt0002400",
    "tt0002176",
    "tt0002415",
    "tt0002190",
    "tt0001499",
    "tt0003516",
    "tt0001978"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.978Z"
}