{
  "imdbId": "tt0034638",
  "title": "Dawn on the Great Divide",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=83AXTO3WcH4",
      "id": "83AXTO3WcH4",
      "title": "Dawn on the Great Divide (1942) THE ROUGH RIDERS",
      "description": "Stars: Buck Jones, Mona Barrie, Raymond Hatton\n Director: Howard Bretherton\n\n Buck Roberts is leading a wagon train of railroad supplies and Jim Corkle and his henchman Loder are out to stop them by using white men dressed as Indians for the attacks.",
      "addedAt": "2025-12-26T23:53:45.676Z",
      "thumbnail": "https://i.ytimg.com/vi/83AXTO3WcH4/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLDv-rI4WSiXWe7ul3vCcoKuNVfkvA",
      "duration": 4170,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dawn-on-the-great-divide-1942-the-rough-riders",
      "id": "dawn-on-the-great-divide-1942-the-rough-riders",
      "title": "Dawn On The Great Divide ( 1942) THE ROUGH RIDERS",
      "description": "A scout (Buck Jones) leads a wagon train to Oregon with supplies for a railroad.",
      "fileSize": 292684433,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/dawn-on-the-great-divide-1942-the-rough-riders",
      "collection": "feature_films",
      "downloads": 478
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "63 min",
    "imdbRating": 5.9,
    "imdbVotes": 180,
    "Genre": "Drama, Western",
    "Plot": "U. S. Marshals Buxk Roberts (Buck Jones), Jack Carson (Rex Bell) and Sandy Hopkins (Raymond Hatton) are entrusted with delivery of a wagon train of railroad supplies to the town of Beaver Lake. Formerly, every such wagon train attacked robbed and every member killed, supposedly by Indian, before it reached the town. Carson discovers from his Indian friends that the tribe had nothing to do with the attack and he rides into Beaver Creek seeking further information. Buck and Sandy are in charge of the wagon train, in which is Judge John Corkle (Robert Frazer) going to the town to visit his brother Jim (Harrry Woods), crooked boss who really runs the settlement.Matt Rand (Tristram Coffin)He and Sadie Rand (Mona Barrie) plan to set up a saloon and gambling house and Martha Turner Jan Wiley), a prospective mother who dies when her baby is born. Martha was the secret wife of Tony Corke (Dennis Moore), son of Jim. That night the train is attacked by white men posing as Indians and several of the party are killed, including Jack Rand. , though most of the suppliers are saved. Meeting the caravan when it arrives in Beaver Lake, is Jack Carson and he befriends Sadie , and so fully wins her confidence that she invites him to join her in establishing the gambling house. To force Jim Corkle to grant them the gambling privilege, Sadie and Carson threaten to publicize his son's affair with Martha. Jim, actually the leader of the renegade gang, leads his men in another attack on the caravan as it heads on to the railroad- construction site and thanks to Buck and Sandy and the friendly Indians, and the attack is repulsed. And Buck provides the evidence that Corkle and his gang are responsible for all the other attacks.",
    "Director": "Howard Bretherton",
    "Writer": "Adele Buffington, James Oliver Curwood",
    "Actors": "Buck Jones, Mona Barrie, Raymond Hatton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0034505",
    "tt0034785",
    "tt0035254",
    "tt0033047",
    "tt0033683",
    "tt0029532",
    "tt0034188",
    "tt0036421",
    "tt0036531",
    "tt0037009",
    "tt0032329",
    "tt0037165"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:14:54.976Z"
}