{
  "movieId": "tt0014903",
  "title": "The First 100 Years",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheFirst100Years1924",
      "id": "TheFirst100Years1924",
      "title": "\"The First 100 Years\" (1924) starring Harry Langdon and Alice Day",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"The First 100 Years\" is a short comedy. This film illustrates the work of Alice Day, a star of Silent Hall of Fame. Directed by                      Harry Sweet Produced by                    Mack Sennett Comedies Starring                           Harry Langdon, Alice Day, Frank J. Coleman, Louise Carver, Madeline Hurlock Cinematography             George Crocker and WM. Williams Distributed by                 Pathé Exchange, Inc. Release date                      August 17, 1924 Running time                   13 minutes Country                            United States Language                          Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 14830269,
      "addedAt": "2026-01-07T00:06:58.274Z",
      "thumbnail": "https://archive.org/services/img/TheFirst100Years1924",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 2273
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "14 min",
    "imdbRating": 6.3,
    "imdbVotes": 130,
    "Genre": "Short, Comedy",
    "Plot": "A man saves his lady love from Black Mike then comes wedded bliss. He hires a cook, who's brusque, domineering, and constantly smoking a cigar. Out of the blue, the couple gets a visit from his old friend, Roland Stone, bluff and portly. Roland befriends our newly-wed's wife, and this friendship deepens after the husband hires a new cook, the lovely Miss Gainsborough, who gives her boss a little too much friendly attention. That night, a prowler skulks, Miss Gainsborough faints, the newly-wed husband comes to her rescue, and she grabs him and holds on. His wife is offended and determines to leave with Roland. Is the marriage over?",
    "Director": "F. Richard Jones, Harry Sweet",
    "Writer": "N/A",
    "Actors": "Harry Langdon, Alice Day, Frank J. Coleman",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015096",
    "tt0014992",
    "tt0014967",
    "tt0015228",
    "tt0014667",
    "tt0014882",
    "tt0017422",
    "tt0015477",
    "tt0014664",
    "tt0141028",
    "tt0015390",
    "tt0014659"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.274Z"
}