{
  "imdbId": "tt0006333",
  "title": "20,000 Leagues Under the Sea",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/20000LeaguesUndertheSea",
      "id": "20000LeaguesUndertheSea",
      "title": "20,000 Leagues Under the Sea",
      "description": "The Universal Film Manufacturing Company was not known in the silent era as premier producer of motion pictures. Yet, in 1916 they produced a film that could not be made effectively without expensive special effects and special photography. The novel had previously been made as short films in 1907 by Georges MÃÂ©liÃÂ¨s and in 1913 by French company ÃÂclair.) Marshalling the expertise underwater experts Ernest and George Williamson, Universal financed the extensive production which would require location photography, large sets, exotic costumes, sailing ships, and a full-size navigable mock-up of the surfaced submarine Nautilus.",
      "fileSize": 2440139644,
      "addedAt": "2026-01-07T00:06:06.564Z",
      "thumbnail": "https://archive.org/services/img/20000LeaguesUndertheSea",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 600758
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QsrXuyjci7U",
      "id": "QsrXuyjci7U",
      "title": "20,000 Leagues Under the Sea (1916) [Silent Movie] [Adventure] [Science Fiction]",
      "description": "20,000 Leagues Under the Sea is a 1916 silent film directed by Stuart Paton. The film's storyline is based on the novel Twenty Thousand Leagues Under the Sea by Jules Verne. It also incorporates elements from Verne's The Mysterious Island. This version is notable for its groundbreaking work in underwater photography by the brothers George M. Williamson and J. Ernest Williamson. Actual underwater cameras were not used, but a system of watertight tubes and mirrors allowed the camera to shoot reflected images of underwater scenes staged in shallow sunlit waters.\n\nThe film was made by The Universal Film Manufacturing Company (now Universal Pictures), not then known as a major motion picture studio. Yet in 1916, they financed this film's innovative special effects, location photography, large sets, exotic costumes, sailing ships, and full-size navigable mock-up of the surfaced submarine Nautilus. Hal Erickson has said that \"the cost of this film was so astronomical that it could not possibly post a profit, putting the kibosh on any subsequent Verne adaptations for the next 12 years.\" On May 4, 2010, a new print of the film was shown accompanied by live performance of an original score by Stephin Merritt at the Castro Theatre, as part of the San Francisco International Film Festival.\n\nThe movie is about a strange giant \"sea creature\" which has been rampaging the seas. The American naval ship Abraham Lincoln is sent to investigate, but is rammed by \"the creature\" which turns out to be The Nautilus, the fantastic submarine of the enigmatic Captain Nemo, and \"Rudderless, the \"Abraham Lincoln\" drifts on\". Then, in \"A strange rescue\" he guides the sub to surface under those pitched overboard and his crew take them, including Professor Aronnax, and his daughter (who are French) below through a hatch in the surface of the deck. After they pledge not to escape, Nemo shows them the wonders of the underwater world, and even takes them hunting on the sea floor.\n\nMeanwhile, soldiers in a runaway Union Army Balloon are marooned on a mysterious island not far from the submarine. They find a wild girl living alone on the island (\"a child of nature\"). The yacht of Charles Denver arrives at the island. A former Indian colonial officer, he has been haunted by the ghost of a woman (Princess Daaker) that he attacked years ago; she stabbed herself rather than submit to him. He fled with her young daughter and then abandoned the child on the island. The long-tormented Denver has returned to see what became of her. One of the Union soldiers schemes and kidnaps the wild girl onto Denver's yacht. Another soldier swims aboard to rescue her. At the same time, Nemo discovers that the yacht belongs to Denver, the enemy he has been seeking all these years. The Nautilus destroys the yacht with a torpedo, but the girl and her rescuer are saved from the water by Captain Nemo.\n\nIn elaborate flashback scenes to India, Nemo reveals that he is Prince Daaker, and that he created the Nautilus to seek revenge on Charles Denver. He is overjoyed to discover that the abandoned wild girl is his long-lost daughter, but his emotion is such that he expires. His loyal crew bury him at the ocean bottom. They disband and the Nautilus is left to drift to its own watery grave.\n\n---\n\nDirected by Stuart Paton, produced by Carl Laemmle, written by Jules Verne (novel) and Stuart Paton, starring Lois Alexander, Curtis Benton, Wallace Clarke, Allen Holubar and Jane Gail.\n\n---\n\nSource: \"20,000 Leagues Under the Sea (1916 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 10 June 2013. Web. 16 July 2013. http://en.wikipedia.org/wiki/20,000_Leagues_Under_the_Sea_(1916_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:16.230Z",
      "thumbnail": "https://i.ytimg.com/vi/QsrXuyjci7U/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA3noVXxFTUZ4mpnasBkKv4bJqjnw",
      "duration": 5923,
      "language": "en",
      "year": 1916,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/20000Leagues_1916",
      "id": "20000Leagues_1916",
      "title": "20,000 Leagues Under The Sea",
      "fileSize": 3127633006,
      "addedAt": "2026-01-07T00:06:06.565Z",
      "thumbnail": "https://archive.org/services/img/20000Leagues_1916",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 53253
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/2000_leagues_under_the_sea_ipod",
      "id": "2000_leagues_under_the_sea_ipod",
      "title": "20,000 Leagues Under the Sea",
      "description": "1916 film adaptation of the Jules Verne classic.",
      "fileSize": 1532796496,
      "addedAt": "2026-01-07T00:06:06.565Z",
      "thumbnail": "https://archive.org/services/img/2000_leagues_under_the_sea_ipod",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 158415
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/191620000LeaguesUnderTheSea_201508",
      "id": "191620000LeaguesUnderTheSea_201508",
      "title": "1916 20, 000 Leagues Under The Sea",
      "description": "20,000 Leagues Under the Sea is currently public domain as it was made in 1916.",
      "fileSize": 1134617541,
      "addedAt": "2026-01-07T00:06:00.051Z",
      "thumbnail": "https://archive.org/services/img/191620000LeaguesUnderTheSea_201508",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 2380
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "105 min",
    "imdbRating": 6.1,
    "imdbVotes": 2172,
    "Genre": "Action, Adventure, Sci-Fi",
    "Plot": "Captain Nemo has built a fantastic submarine for his mission of revenge. He has traveled over 20,000 leagues in search of Charles Denver - a man who caused the death of Princess Daaker. Seeing what he had done, Denver took the daughter to his yacht and sailed away. He abandoned her and a sailor on a mysterious island and has come back after all these years to see if she is still alive and if the nightmares he has will stop. The daughter has been found by five survivors of a Union Army Balloon that crashed near the island. At sea, Professor Aronnax was aboard the ship 'Abraham Lincoln' when Nemo rammed it and threw the Professor, his daughter and two others into the water. Prisoners at first, they are now treated as guests to view the underwater world and to hunt under the waves. Nemo will also tells them about the Nautilus and the revenge that has driven him for all these years.",
    "Director": "Stuart Paton",
    "Writer": "Jules Verne, Stuart Paton",
    "Actors": "Allen Holubar, Dan Hanlon, Edna Pendleton",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0028725",
    "tt0039218",
    "tt0036697",
    "tt0055294",
    "tt0053944",
    "tt0007260",
    "tt0481509",
    "tt0059346",
    "tt0079501",
    "tt5056352",
    "tt6603378",
    "tt4296026"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.565Z"
}