{
  "imdbId": "tt0034785",
  "title": "Ghost Town Law",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fogId1tJBdk",
      "id": "fogId1tJBdk",
      "title": "Ghost Town Law (1942) THE ROUGH RIDERS",
      "description": "Stars: Buck Jones, Tim McCoy, Raymond Hatton \nDirector: Howard Bretherton\n\nWhen two of their Marshal friends are murdered, the Rough Riders are sent to the killers in a ghost town where the houses and an old mine are interconnected by secret passages and tunnels.",
      "addedAt": "2025-12-26T23:43:53.654Z",
      "thumbnail": "https://i.ytimg.com/vi/fogId1tJBdk/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLC64lUBif5Hvf3181yj7voeVw2iYA",
      "duration": 3573,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 6,
    "imdbVotes": 136,
    "Genre": "Drama, Western",
    "Plot": "Marshall Tim McCall is called in from Wyoming when two lawmen friends of his are murdered in cold blood. The two marshals were on the trail of a desperado and followed him to a deserted ghost town. Unfortunately the town is inhabited not by supernatural spirits, but by a gang of vicious outlaws headed by a ruthless thug named Ace. McCall is joined by fellow marshals Sandy Hopkins Buck Roberts, who feigns amnesia when he comes to town, but the town has additional visitors: pretty and spunky Josie Hall, who wants to visit her aunt and brother living in an old dark mansion in the area, ranch foreman Tom Cook, who is attracted to Josie but doesn't seem to be foreman of anything, Pawnee, an enigmatic Indian, and Judge Crail,, a larcenous crook who wants to gain control of the deserted gold mine running underneath the property. The grounds of the ramshackle town and the spooky mansion are honeycombed with interconnecting tunnels and passageways, which present the Rogh Riders with one of their greatest challenges.",
    "Director": "Howard Bretherton",
    "Writer": "Adele Buffington",
    "Actors": "Buck Jones, Tim McCoy, Raymond Hatton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0034505",
    "tt0034638",
    "tt0035254",
    "tt0033683",
    "tt0033047",
    "tt0029532",
    "tt0034188",
    "tt0036421",
    "tt0036531",
    "tt0033351",
    "tt0037009",
    "tt0032329"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:29:40.028Z"
}