{
  "imdbId": "tt0001083",
  "title": "The Violin Maker of Cremona",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HappyHooligan_201504",
      "id": "HappyHooligan_201504",
      "title": "\"The Violin Maker of Cremona\" (1909) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Violin Maker of Cremona\" is a short drama. The film is included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame. Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          Frank E. Woods, from the play by Françoise Coppée Cinematography                G.W. Bitzer Starring                                David Miles, Mary Pickford, Owen Moore,  Mack Sennett, Arthur V. Johnson Distributed by                     Biograph Company Release date                         June 7, 1909 Running time                       12 min. Country                                United States Language                              Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 251531323,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HappyHooligan_201504",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 2031
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-violin-maker-of-cremona",
      "id": "silent-the-violin-maker-of-cremona",
      "title": "The Violin Maker of Cremona",
      "fileSize": 211550851,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-violin-maker-of-cremona",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 277
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbRating": 5,
    "imdbVotes": 157,
    "Genre": "Short, Drama",
    "Plot": "In the little Italian city of Cremona there dwelt Taddeo Ferrari, a violin maker and student of Andrea Amati, the most famous of the craft. Ferrari's pretty daughter, Giannina, was beloved by one of his apprentices, Sandro. Filippo, a crippled youth and the best violin maker in Cremona, also loved the girl with a pure, holy affection that is more spiritual than material, but realizing his unattractiveness through his deformity, suffers his hopelessness with resignation. Yearly there is a prize of a precious chain of gold awarded to the maker of the best violin, and all the apprentices strive to win it. On this occasion, however, the hand of Giannina is to be bestowed upon the most proficient craftsman, and this induces the young men to make extra efforts to win. Sandro fully appreciates the rare talent of Filippo and feels sure his wonderful skill will win his sweetheart from him. Crushed and despairing he seeks out Giannina and tells her his fears, she tearfully acknowledging the strength of his reasoning. While thus occupied they are overheard by Filippo, who sees what woe his success would mean for her, and thinking only of her happiness, through his great love for her he makes a great sacrifice. Going to his room he takes his instrument and goes and places it in Sandro's box, taking Sandro's violin and putting it in his own. Sandro, however, thwarts the good intention of Filippo by exchanging the instruments, not knowing what Filippo had done, thereby upsetting the planned munificence of the cripple. When the instruments are placed in competition, and the prizes are about to be awarded, Sandro's conscience pricks him, and calling the cripple aside, confesses his deed. Filippo bursts into taunting laughter, telling him what he, himself, had done, and now he spoiled it all. Judgment is passed and Filippo is, of course, the victor. The chain is placed about his neck, and the hand of Giannina placed in his. But also, he feels she recoils, and thinking only of her happiness he crashes his violin over his knee, thereby putting himself out of the contest and making Sandro the winner. He then places the chain about Sandro's neck, and handing the girl over to him he rushes from the hall. We finally leave him alone in his room, crushed and dejected, yet contented in the thought that he had made her happy.",
    "Director": "D.W. Griffith",
    "Writer": "François Coppée, Frank E. Woods",
    "Actors": "Herbert Prior, Mary Pickford, Owen Moore",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000972",
    "tt0000895",
    "tt0000942",
    "tt0000800",
    "tt0000816",
    "tt0000882",
    "tt0001044",
    "tt0001088",
    "tt0001265",
    "tt0001118",
    "tt0001245",
    "tt0001283"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}