{
  "imdbId": "tt0053337",
  "title": "Teenagers from Outer Space",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/teenagers_from_outerspace",
      "id": "teenagers_from_outerspace",
      "title": "Teenagers from Outer Space",
      "description": "A young alien (David Love) falls for a pretty teenage Earth girl (Dawn Anderson) and they team up to try to stop the plans of his invading cohorts.",
      "fileSize": 2764810483,
      "addedAt": "2026-01-07T00:11:46.528Z",
      "thumbnail": "https://archive.org/services/img/teenagers_from_outerspace",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 405344
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TeenagersFromOuterSpace",
      "id": "TeenagersFromOuterSpace",
      "title": "Teenagers From Outer Space",
      "description": "A young alien (David Love) falls for a pretty teenage Earth girl (Dawn Anderson) and they team up to try to stop the plans of his invading cohorts. NOTE: This is the MPEG2 (and derivative versions). An AVI version is available here .",
      "fileSize": 3391285533,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/TeenagersFromOuterSpace",
      "language": "English",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 53650
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TeenagersFromOuterSpace1959",
      "id": "TeenagersFromOuterSpace1959",
      "title": "Teenagers From Outer Space (1959)",
      "description": "Teenagers from Outer Space (1959) A young alien (David Love) falls for a pretty teenage Earth girl (Dawn Anderson) and they team up to try to stop the plans of his invading cohorts, who intend to use Earth as a food-breeding ground for giant lobsters from their planet. The invaders, who arrive in a flying saucer, carry deadly ray guns that turn Earth-people into skeletons. Director: Tom Graeff Writer: Tom Graeff Stars: David Love, Dawn Bender and Bryan Grant http://www.imdb.com/title/tt0053337/",
      "fileSize": 1329385076,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/TeenagersFromOuterSpace1959",
      "collection": "feature_films",
      "downloads": 85338
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/horror-sci-fi-thriller-movie-teenagers-from-outer-space-1959",
      "id": "horror-sci-fi-thriller-movie-teenagers-from-outer-space-1959",
      "title": "Teenagers From Outer Space (1959)",
      "description": "A sensitive young alien teams up with a teenaged human girl to try and protect Earth from an imminent, giant lobster invasion.",
      "fileSize": 2320487613,
      "addedAt": "2026-01-07T00:08:46.613Z",
      "thumbnail": "https://archive.org/services/img/horror-sci-fi-thriller-movie-teenagers-from-outer-space-1959",
      "collection": "feature_films",
      "downloads": 322
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GTMt4m96_hY",
      "id": "GTMt4m96_hY",
      "title": "Teenagers from Outer Space (1959) [Science Fiction] [Horror]",
      "description": "An alien spacecraft comes to Earth, while searching the galaxy for a planet suitable to raise \"gargons,\" a lobster-like (but air-breathing) creature which is a delicacy on their homeworld. Thor (Bryan Grant), the lead alien, shows his contempt for Earth's creatures by vaporizing a dog named Sparky. Crewmember Derek (David Love), after discovering an inscription on Sparky's dog tag, fears that the gargon might destroy Earth's local inhabitants, making the other spacemen scoff. Being members of the \"supreme race\", they disdain \"foreign beings,\" no matter how intelligent and pride themselves that families and friendships are forbidden on their world. Derek turns out to be a member of an underground which commemorates more humane periods of his world's history. Their one gargon seems to be sick in Earth's atmosphere. While his crewmates are distracted, Derek flees. Eventually, the gargon seems to revive. When the Captain reports Derek's actions, he is connected to the Leader (Gene Sterling) himself. It turns out that Derek is the Leader's son, though Derek is unaware of this. Thor is sent to hunt Derek down, with orders to kill to protect the mission. They return to their base, leaving the gargon behind.\n\nMeanwhile, Derek finds the home address found on the dog tag. He meets Betty Morgan (Dawn Anderson) and her Grandpa Joe (Harvey B. Dunn). They have a room to rent, and Derek inadvertently becomes a boarder. When Betty's boyfriend, reporter Joe Rogers (Tom Graeff), can't make their afternoon plans, Derek tags along with Betty. He shows the tag to Betty, who recognizes it immediately. Derek takes her to the place where the ship landed, and shows her Sparky's remains. She doesn't believe him, so he describes Thor's weapon that that vaporizes flesh. Betty takes this surprisingly well and vows to help Derek stop the bad guys. For the rest of the day Betty and Derek have several run-ins with Thor and Joe follows up on stories of skeletons popping up all over town, including in Alice's swimming pool. Eventually Thor is wounded and he kidnaps Betty and Derek for medical attention, he reveals Derek's true parentage. Two car chases and a gunfight ensue and Thor is finally captured by authorities after plummeting off a cliff in a stolen car.\n\nBut there are bigger problems: the gargon has grown immensely, killing a policeman investigating the landing site and attacking numerous people. Derek and Betty go to the car wreck to look for Thor's gun. They share a kiss, and Derek vows to stay on Earth. When the gargon ruins their romantic moment, Derek finds the gun just in time for them to escape. Unfortunately the gun is damaged and the monster is heading toward the town. They head out once again to confront it, using power lines to fuel the disintegrator. They kill the gargon, but it's too late as enemy ships suddenly appear overhead. The whole gang, including Joe and Grandpa, hurries out to the landing site. Derek reunites with his father and makes the ultimate sacrifice by leading the fleet directly into the hillside, causing a massive explosion. Derek does not survive, but is remembered for declairing, \"I shall make the Earth my home. And I shall never, never leave it.\"\n\n---\n\nDirected and written by Tom Graeff, starring David Love as Derek, Dawn Bender as Betty Morgan, Bryan Grant as Thor, Harvey B. Dunn as Gramps Morgan, Tom Graeff as Joe Rogers, King Moody as Spacecraft Captain, Helen Sage as Nurse Morse, Frederick Welch as Dr. C.R. Brandt (MD), Carl Dickensen as Gas Station Attendant, Sonia Torgeson as Alice Woodward, Billy Bridges as Driver picking up Thor, James Conklin as Professor Simpson, Gene Sterling as The Alien Leader, Ralph Lowe as Moreal (Spaceship Crew) and Bill DeLand as Saul (Spaceship Crew). \n\n---\n\nSource: \"Teenagers from Outer Space\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 1 April 2013. Web. 20 April 2013. http://en.wikipedia.org/wiki/Teenagers_from_Outer_Space.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:28.786Z",
      "thumbnail": "https://i.ytimg.com/vi/GTMt4m96_hY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAocXDKXrgedkEeG9jek2mXScgczQ",
      "duration": 5129,
      "language": "en",
      "year": 1959,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yIIW-FgRRgs",
      "id": "yIIW-FgRRgs",
      "title": "Teenagers from Outer Space (1959) | Colorized Public Domain Sci-Fi Classic Alien Invasion Movie",
      "description": "Teenagers from Outer Space (1959) is a cult American science fiction film directed, produced, and written by Tom Graeff. Originally released as a low-budget black-and-white drive-in feature, this restored and colorized edition brings new life to one of the most infamous public domain sci-fi films of the 1950s. Known for its campy dialogue, minimalist effects, and unintended humor, the film has since gained cult status as a beloved B-movie among science fiction fans. By reviving it in full color, Colorized Public Domain offers modern viewers in the United States, Europe, and beyond a chance to rediscover this quirky gem of mid-century cinema.\n\nPlot Summary:\nThe film follows Derek (David Love), a young alien who arrives on Earth with a group of extraterrestrial invaders sent to use the planet as a breeding ground for gargantuan lobster-like creatures called Gargons. Unlike his ruthless comrades, Derek rebels against his people after discovering that humans are sentient beings and refusing to sacrifice them for conquest. He flees the landing site and encounters Betty Morgan (Dawn Anderson), a kindhearted young woman who, along with her grandfather, befriends him.\n\nAs Derek learns more about humanity, he is pursued by his merciless fellow alien Thor (Bryan Grant), who stops at nothing to enforce their mission and eliminate Derek. With time running out, Derek must protect Betty, stop the Gargons from multiplying, and face the consequences of defying his own race. The climax delivers a mix of melodrama, unintended humor, and Cold War-era anxieties about invasion and identity, making it both campy fun and a cultural artifact of its time.\n\nCast and Crew:\n• Director: Tom Graeff\n• Producer: Tom Graeff\n• Screenplay: Tom Graeff\n• Cinematography: Tom Graeff\n• Editing: Tom Graeff\n• Music: William Loose, Walter Greene\nStarring:\n• David Love as Derek\n• Dawn Anderson as Betty Morgan\n• Bryan Grant as Thor\n• Harvey B. Dunn as Grandpa\n• Tom Graeff as Joe Rogers\n• King Moody as Reporter\n\nFilm Significance:\nThough made on a shoestring budget, “Teenagers from Outer Space” exemplifies the 1950s science fiction craze that dominated American drive-ins during the Cold War era. Its crude special effects, recycled props, and melodramatic performances have transformed it into a cult classic regularly featured in bad-movie marathons and parodies. While never a mainstream success, the film endures as a fascinating piece of cinematic history, highlighting both the ambitions and limitations of independent sci-fi filmmaking in the 1950s.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Teenagers from Outer Space remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1959 release was black and white, typical of low-budget sci-fi productions of its time. While historically authentic, modern audiences often bypass such films. By offering a carefully colorized edition, we make this cult classic more visually dynamic and appealing, while retaining the charm of its original performances and atmosphere. This new edition bridges the gap between preservation and modern entertainment habits.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, ranging from forgotten B-movies to culturally significant features. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TeenagersFromOuterSpace #1950sSciFi #CultClassic #PublicDomainMovie #ColorizedClassic #AlienInvasion #ClassicSciFi #FilmRestoration #GoldenAgeSciFi #1959Movies",
      "addedAt": "2025-12-24T00:50:13.161Z",
      "thumbnail": "https://i.ytimg.com/vi/yIIW-FgRRgs/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBTKEowDw==&rs=AOn4CLAazkWXGRpGwIc_OSHLEAod-KjDMA",
      "duration": 5095,
      "language": "en",
      "year": 1959,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/teenagers-from-outer-4-k",
      "id": "teenagers-from-outer-4-k",
      "title": "Teenagers From Outer Space (1959) [Colorized, 4K, 60FPS]",
      "description": "Teenagers From Outer Space is a 1959 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6010319489,
      "addedAt": "2026-01-07T00:11:46.528Z",
      "thumbnail": "https://archive.org/services/img/teenagers-from-outer-4-k",
      "collection": "feature_films",
      "downloads": 313
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/teenagers-from-outer-space_202505",
      "id": "teenagers-from-outer-space_202505",
      "title": "Teenagers from Outer Space (1958)",
      "description": "A young alien falls for a pretty teenage Earth girl and they team up to try to stop the plans of his invading cohorts, who intend to use Earth as a food-breeding ground for giant lobsters from their planet. Watch on RetroFlix:  https://retroflix.org/teenagers-from-outer-space-1959/",
      "fileSize": 536573281,
      "addedAt": "2026-01-07T00:11:46.528Z",
      "thumbnail": "https://archive.org/services/img/teenagers-from-outer-space_202505",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 99
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZaUOd9tStPU",
      "id": "ZaUOd9tStPU",
      "title": "Teenagers from Outer Space (1959) SCI-FI CLASSIC",
      "description": "Stars: David Love, Dawn Bender, Bryan Grant \nWriter/Director: Tom Graeff\n\nAliens arrive in a flying saucer and carry deadly ray guns that turn Earth-people into skeletons. But when a pretty teenage Earthling and a young alien fall in love, they plot to stop the ghastly invasion.",
      "addedAt": "2025-12-26T23:45:39.542Z",
      "thumbnail": "https://i.ytimg.com/vi/ZaUOd9tStPU/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLAheZaOYPnWK6wF_NCjf56ocfV-lQ",
      "duration": 5129,
      "language": "en",
      "year": 1959,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "86 min",
    "imdbRating": 3.9,
    "imdbVotes": 3938,
    "Genre": "Horror, Sci-Fi, Thriller",
    "Plot": "A young alien (David Love) falls for a pretty teenage Earth girl (Dawn Anderson) and they team up to try to stop the plans of his invading cohorts, who intend to use Earth as a food-breeding ground for giant lobsters from their planet. The invaders, who arrive in a flying saucer, carry deadly ray guns that turn Earth-people into skeletons.",
    "Director": "Tom Graeff",
    "Writer": "Tom Graeff",
    "Actors": "David Love, Dawn Bender, Bryan Grant",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0052846",
    "tt0052228",
    "tt0050210",
    "tt0055058",
    "tt0052609",
    "tt0052667",
    "tt0060536",
    "tt0051064",
    "tt0052602",
    "tt0051947",
    "tt0054462",
    "tt0052969"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.528Z"
}