{
  "imdbId": "tt0015400",
  "title": "The Thief of Bagdad",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThiefOfBagdad1924",
      "title": "ThiefOfBagdad1924",
      "description": "Original (and therefore public domain) version of this classic. Does not contain any of the \"additional\" footage, interviews, new music or other embellishments added and copyrighted in the 1980s. Enjoy the acrobatic athleticism and Human-Generated (HG) effects of one of filmdom's greatest actors. IMDb 7.8/10 http://www.imdb.com/title/tt0015400/",
      "id": "ThiefOfBagdad1924"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XSMatRazv9A",
      "title": "The Thief of Bagdad (1924) | Colorized Public Domain Silent Fantasy Adventure with Douglas Fairbanks",
      "description": "The Thief of Bagdad (1924) is a silent fantasy adventure film directed by Raoul Walsh and produced by and starring Douglas Fairbanks, one of Hollywood’s greatest swashbuckling stars. This restored and colorized public domain classic brings back the dazzling magic, elaborate sets, and early Hollywood spectacle that made it a landmark of cinema. With groundbreaking special effects, lavish Arabian-inspired design, and Fairbanks at his athletic peak, this epic remains one of the defining films of the 1920s.\n\nPlot Summary:\nIn the bustling city of Bagdad, a daring thief (Douglas Fairbanks) lives by his wits and acrobatic skills, stealing jewels and treasures while mocking the pompous rulers who enforce strict laws. But his carefree life changes when he encounters a beautiful princess (Julanne Johnston), daughter of the Caliph. Struck with love, he disguises himself to enter her palace and win her heart.\n\nWhen the princess must choose a suitor, powerful princes arrive bearing gifts, but the thief sets out on a perilous journey to prove his worth. His adventures take him through magical realms filled with flying carpets, underwater monsters, enchanted creatures, and breathtaking illusions brought to life through revolutionary special effects. Ultimately, the thief’s courage, ingenuity, and transformation from selfish rogue to noble hero allow him to claim both love and honor.\n\nCast and Crew:\n• Director: Raoul Walsh\n• Producer: Douglas Fairbanks\n• Writers: Lotta Woods (scenario), based on stories from One Thousand and One Nights\n• Cinematography: Arthur Edeson\n• Art Direction: William Cameron Menzies (Academy Award-winning designer)\n\nStarring:\n• Douglas Fairbanks as The Thief of Bagdad\n• Snitz Edwards as His Evil Associate\n• Charles Belcher as The Holy Man\n• Julanne Johnston as The Princess\n• Sojin Kamiyama as Mongol Prince\n• Anna May Wong as The Mongol Slave\n• Brandon Hurst as The Caliph\n• Tote Du Crow as The Evil Associate\n\nFilm Significance:\nThe Thief of Bagdad is one of the great achievements of the silent era. Its immense sets, elaborate visual effects, and imaginative fantasy storytelling established Douglas Fairbanks as Hollywood’s leading adventure star. The film introduced groundbreaking cinematic illusions — including flying carpets, giant sea creatures, and monumental Arabian palaces — that influenced generations of filmmakers. Its visual artistry, designed by William Cameron Menzies, is still studied in film schools today.\n\nThe film was so successful that it inspired several remakes, including Alexander Korda’s 1940 Technicolor version, but the 1924 original remains a landmark of both fantasy storytelling and Hollywood spectacle.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Thief of Bagdad remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1924 release was silent and black and white, relying on intertitles and visual grandeur. While historically important, modern audiences often avoid silent black-and-white films. By offering a restored and colorized version, this edition bridges the gap between historical preservation and contemporary viewing habits. With enhanced clarity, added color, and preserved silent-era artistry, this version makes Douglas Fairbanks’ legendary performance more vivid, thrilling, and accessible.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from silent adventures to classic dramas. Our mission is to preserve and share timeless works with audiences in the USA, Europe, and worldwide.\n\n#TheThiefOfBagdad #DouglasFairbanks #SilentFilm #PublicDomainMovie #ColorizedClassic #1920sCinema #FantasyAdventure #GoldenAgeHollywood #FilmRestoration #RaoulWalsh",
      "id": "XSMatRazv9A",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-thief-of-bagdad",
      "title": "The Thief of Bagdad",
      "id": "silent-the-thief-of-bagdad"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-thief-of-bagdad-1924",
      "title": "The Thief of Bagdad (1924)",
      "description": "When Prince Ahmad is blinded and cast out of Bagdad by the nefarious Jaffar, he joins forces with the scrappy thief Abu to win back his royal place, as well as the heart of a beautiful princess. Watch on RetroFlix:  https://retroflix.org/the-thief-of-bagdad-1924/",
      "id": "the-thief-of-bagdad-1924"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/vidtb",
      "title": "\"The Thief of Bagdad\" (1924) starring Douglas Fairbanks",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Thief of Bagdad\" (1924) is a romantic fantasy-adventure starring Douglas Fairbanks and featuring Snitz Edwards, a star of Silent Hall of Fame.  \"The Thief of Bagdad\" was selected for preservation in the National Film Registry as being \"culturally, historically, or aesthetically significant\" in 1996. Directed by                 Raoul Walsh Produced by               Douglas Fairbanks Scenario by                Elton Thomas (Douglas Fairbanks)          Starring                      Douglas Fairbanks, Julanne Johnston, Snitz Edwards, Anna May Wong, Brandon Hurst, Sojin Kamiyama Cinematography        Arthur Edeson Distributed by            United Artists Release date                March 23, 1924 Running time              151 min. Country                       United States Language                     Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "vidtb"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "155 min",
    "imdbRating": "7.7",
    "imdbVotes": "7,374",
    "Genre": "Adventure, Family, Fantasy",
    "Plot": "A thief falls in love with the Caliph of Bagdad's daughter. The Caliph will give her hand to the suitor that brings back the rarest treasure after seven moons. The thief sets off on a magical journey while, unbeknownst to him, another suitor, the Prince of the Mongols, is not playing by the rules...",
    "Director": "Raoul Walsh",
    "Writer": "Lotta Woods, Douglas Fairbanks, Achmed Abdullah",
    "Actors": "Douglas Fairbanks, Julanne Johnston, Snitz Edwards",
    "Language": "English",
    "Country": "United States",
    "Awards": "4 wins total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0015224",
      "title": "Peter Pan",
      "year": 1924,
      "imdbRating": "7.1",
      "imdbVotes": "1,317",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013556",
      "title": "Robin Hood",
      "year": 1922,
      "imdbRating": "7.0",
      "imdbVotes": "2,583",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050084",
      "title": "20 Million Miles to Earth",
      "year": 1957,
      "imdbRating": "6.3",
      "imdbVotes": "8,727",
      "language": "English, Italian, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004873",
      "title": "Alice in Wonderland",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "795",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1014759",
      "title": "Alice in Wonderland",
      "year": 2010,
      "imdbRating": "6.4",
      "imdbVotes": "460,572",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0089961",
      "title": "Santa Claus",
      "year": 1985,
      "imdbRating": "6.3",
      "imdbVotes": "15,791",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004099",
      "title": "His Majesty, the Scarecrow of Oz",
      "year": 1914,
      "imdbRating": "5.4",
      "imdbVotes": "517",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004457",
      "title": "The Patchwork Girl of Oz",
      "year": 1914,
      "imdbRating": "5.5",
      "imdbVotes": "581",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047930",
      "title": "A Journey to the Beginning of Time",
      "year": 1955,
      "imdbRating": "7.1",
      "imdbVotes": "2,622",
      "language": "Czech",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0068190",
      "title": "Alice's Adventures in Wonderland",
      "year": 1972,
      "imdbRating": "5.7",
      "imdbVotes": "1,940",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0290406",
      "title": "Alicia en el país de las maravillas",
      "year": 1976,
      "imdbRating": "5.8",
      "imdbVotes": "88",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052948",
      "title": "Journey to the Center of the Earth",
      "year": 1959,
      "imdbRating": "7.0",
      "imdbVotes": "20,760",
      "language": "English, Swedish, French, Italian, Russian, Icelandic",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:02:16.542Z"
}