{
  "imdbId": "tt0002429",
  "title": "Petticoat Camp",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PetticoatCamp",
      "id": "PetticoatCamp",
      "title": "\"Petticoat Camp\" (1912) starring Florence La Badie",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Petticoat Camp\" is a light comedy, included in our program to illustrate the work and contributions of Florence La Badie, a star of Silent Hall of Fame. A few married couples camp together, with the boys having all the fun and the girls doing all the work.  The latter decide to get a better deal and eventually bring the boys to their knees.  Let's all give our thanks to Ned Thanhouser for the outstanding work he has done for the past 25+ years in archives around the globe to acquire and publish on DVD and online Thanhouser films starring Florence La Badie.  Produced by             Thanhouser Company Starring                     Florence La Badie, William Garwood Distributed by           Film Supply Company Release date               November 3, 1912 Running time             15 minutes Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 188104468,
      "addedAt": "2026-01-07T00:06:45.466Z",
      "thumbnail": "https://archive.org/services/img/PetticoatCamp",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 2503
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "15 min",
    "imdbRating": 6.2,
    "imdbVotes": 177,
    "Genre": "Short, Comedy",
    "Plot": "Several young married couples, all intimate friends, decide that it would be fun to have a camp of their own for the summer. One of the party discovers an ideal little island, they lease it, and joyfully proceed there. The men are thoroughly happy. They arise early, eat enormous breakfasts, and then go fishing and hunting. Finally the wives begin to ask themselves where they come in. \"It is a picnic for the boys,\" remarks one woman, addressing the others, \"We do the cooking, the washing and the general housework.\" Finally they agree that the best thing for them to do is to institute a lock out. That evening when the husbands return, there are no wives or supper to greet them, Just a note informing them that their \"ex-slaves\" have taken up a camp for themselves on the next island. It strikes the husbands as a good joke, that is, it does until they sit down to a frightfully prepared supper, then they see the sorrow of it. One of the husbands has an idea and the others cheer as they adopt it. Late that evening, while the wives are supposedly sleeping, two \"vicious tramps\" creep into \"petticoat camp.\" They expect that the women will shriek with terror but they don't. Later the \"tramps\" are picked up far from shore. \"When we screamed,\" they say, \"all those girls got up at once, pulled revolvers and fired at us. They didn't know us, and we had to run for our lives. When we took to the water, they stood on the beach firing at us.\" Their plot having failed and starvation staring them in the face the husbands wave the white flag which is graciously received, and terms of capitulation arranged. All the wives wanted was a share of fun, and the transfer of some of the work to the broad shoulders of the husbands.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "William Garwood, Florence La Badie",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1298777",
    "tt1247273",
    "tt0366564",
    "tt0233368",
    "tt0486919",
    "tt0417062",
    "tt0249454",
    "tt6373988",
    "tt1845834",
    "tt0463594",
    "tt6528876",
    "tt0146448"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.466Z"
}