{
  "movieId": "tt0016629",
  "title": "The Bat",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBat1926",
      "id": "TheBat1926",
      "title": "The Bat (1926)",
      "description": "A Silent film based upon the Broadway play by Mary Roberts Rinehart and Avery Hopwood, this Silent Gem was directed by Roland West in 1926, later being Remade as the Bat Whispers in 1930 (by Roland West) and again in 1958 in the Bat starring Vincent Price, also available at the Archive. Oh, and when I say silent, I mean silent - this was transferred from a 16mm print and was probably meant to be played with live musical accompaniment. SYNOPSIS: The Bat, a masked criminal, terrorises a mansion filled with the guests of a mystery writer, a mansion in which a robber has hidden $20,000 of Stolen money. The House guests along with a detective search for Clues - them being the location of the money and the identity of the Bat. N.B - As many Batfans will know, this film is where Bob Kane got the Inspiration for the comic book superhero \"Batman\" - if you look, you'll notice the Bat-signal, here used to frighten the guests before the Bat attacks. Sound: Silent - No Music, No Vocal Track - Live Accompaniment preffered Colour: B&W Genre: Horror/Mystery Release Date: 1926 Director: Roland West",
      "fileSize": 663114451,
      "addedAt": "2026-01-07T00:06:58.272Z",
      "thumbnail": "https://archive.org/services/img/TheBat1926",
      "collection": "feature_films",
      "downloads": 25754
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBat1926WithSoundtrack",
      "id": "TheBat1926WithSoundtrack",
      "title": "The Bat (1926) with soundtrack",
      "description": "1926 directed by Roland West starring George Beranger, Charles Herzinger and Emily Fitzroy. Sets designed by William Cameron Menzies. A criminal who dresses like a bat, intent on finding hidden money, scares the guests at an old, dark house rented by a mystery writer.",
      "fileSize": 1291226555,
      "addedAt": "2026-01-07T00:06:58.272Z",
      "thumbnail": "https://archive.org/services/img/TheBat1926WithSoundtrack",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 20369
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "86 min",
    "imdbRating": 6.5,
    "imdbVotes": 919,
    "Genre": "Mystery, Thriller",
    "Plot": "A master crook, known as \"The Bat\" because of his disguise, announces a jewel theft in advance but is foiled by a rival crook at the scene of the crime. Their trail leads to the Courtleigh Fleming estate, now leased to Cornelia Van Gorder, a wealthy spinster. The reported death of banker Fleming and the disappearance of Brooks Bailey, a young cashier in love with Dale (Miss Van Gorder's niece), add to the complications of a $200,000 bank robbery. Brooks, masquerading as a gardener, remains concealed in the house, hoping to unravel the mystery. Lizzie, a servant, suspects everyone, including Dr. Wells, the butler, and Detective Moletti. The Bat, who has killed Moletti and is impersonating him, is finally captured in a bear-trap.",
    "Director": "Roland West",
    "Writer": "Avery Hopwood, Julien Josephson, George Marion Jr.",
    "Actors": "George Beranger, Charles Herzinger, Emily Fitzroy",
    "Language": "English",
    "Country": "United States",
    "Awards": "2 wins"
  },
  "relatedMovies": [
    "tt0016123",
    "tt0018097",
    "tt0020080",
    "tt0020103",
    "tt0020534",
    "tt0020388",
    "tt0019757",
    "tt0013086",
    "tt0020679",
    "tt9214844",
    "tt0048919",
    "tt0037179"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.272Z"
}