{
  "imdbId": "tt0069341",
  "title": "Tales from the Crypt",
  "year": 1972,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tales.-from.-the.-crypt.-1972",
      "title": "Tales from the Crypt (1972)",
      "description": "Tales from the Crypt is a horror anthology film that consists of five interconnected stories based on the EC Comics series of the same name. The film begins with a group of people who find themselves trapped in a mysterious crypt, where they encounter the Crypt Keeper, who narrates their chilling tales. And All Through the House : A woman is about to murder her husband on Christmas Eve but is interrupted by a deranged escaped convict dressed as Santa Claus. As she struggles between covering up her crime and surviving the night, a twist endings leads to a shocking revelation. Reflection of Death : A man has an affair with a woman and decides to leave his wife. After a tragic car accident, he discovers the consequences of his choices, leading to a haunting confrontation with his own fate. Poetic Justice : A woman seeks vengeance on her unfaithful husband and his mistress. The story culminates in a grisly act of retribution that feels almost poetic in its execution. Wish You Were Here : A man discovers a genie-like creature that grants him wishes, but each wish unfolds with unintended and gruesome consequences. Blind Alleys : A sadistic man running an old-age home mistreats the residents. The story concludes with a horrifying twist of fate for the man, who faces the consequences of his cruelty. The film explores themes of justice, revenge, and the macabre, with a blend of dark humor and moral lessons. Each story culminates in a twist, showcasing the film's iconic approach to horror storytelling.",
      "id": "tales.-from.-the.-crypt.-1972"
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "92 min",
    "imdbRating": "6.8",
    "imdbVotes": "13,808",
    "Genre": "Drama, Horror, Mystery",
    "Plot": "Five people come upon a catacomb and take the tour. After they get lost, they find they're trapped, and they see The Crypt Keeper (Sir Ralph Richardson). He asks them each to see why they're there: (1) And All Through the House: Christmas Eve, Joanne Clayton (Dame Joan Collins) kills her husband (Martin Boddey) expecting to receive his insurance. She hears on the wireless that the police are seeking an escaped homicidal maniac posing as Santa. When the man knocks on her door, she can't phone the Police, and she has a Christmas surprise. (2) Reflection of Death: Carl Maitland (Ian Hendry) leaves his wife (Susan Denny) and children for his mistress, but something happens during his journey. (3) Poetic Justice: the widowed janitor, Arthur Edward Grimsdyke (Peter Cushing) is a good man who spends his leisure time with the children from the neighborhood. His heartless neighbor doesn't like him and destroys his life, leading Grimsdyke to commit suicide on Valentine's Day. A year later, Grimsdyke rises from his tomb seeking revenge. (4) Wish You Were Here: dirty businessman Ralph Jason (Richard Greene) is bankrupt, and his lawyer and friend, Charles Gregory (Roy Dotrice), tells him he must sell his real estate. When he tells his wife Enid (Barbara Murray), she recalls they have a statue with a legend; it'll grant three wishes to the owner. She makes the wishes, and leads Ralph to eternal damnation. (5) Blind Alleys: cruel Major Rogers (Nigel Patrick) comes to the Elmridge home for the blind, with his dog, to be the new director. He tortures the interns until the day they get revenge. Soon, the interns discover they're at the gate of Hell.",
    "Director": "Freddie Francis",
    "Writer": "Milton Subotsky, Al Feldstein, Johnny Craig",
    "Actors": "Joan Collins, Peter Cushing, Ralph Richardson",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0057401",
      "title": "Paranoiac",
      "year": 1963,
      "imdbRating": "6.7",
      "imdbVotes": "3,483",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0061557",
      "title": "The Deadly Bees",
      "year": 1966,
      "imdbRating": "4.2",
      "imdbVotes": "2,304",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0067341",
      "title": "Let's Scare Jessica to Death",
      "year": 1971,
      "imdbRating": "6.4",
      "imdbVotes": "9,632",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0067594",
      "title": "Point of Terror",
      "year": 1971,
      "imdbRating": "3.8",
      "imdbVotes": "644",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0071722",
      "title": "A Knife for the Ladies",
      "year": 1974,
      "imdbRating": "4.6",
      "imdbVotes": "414",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0065143",
      "title": "The Bird with the Crystal Plumage",
      "year": 1970,
      "imdbRating": "7.1",
      "imdbVotes": "25,801",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0065762",
      "title": "The Vampire Happening",
      "year": 1971,
      "imdbRating": "4.7",
      "imdbVotes": "767",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0060265",
      "title": "The Chinese Room",
      "year": 1968,
      "imdbRating": "5.0",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0063715",
      "title": "Spirits of the Dead",
      "year": 1968,
      "imdbRating": "6.4",
      "imdbVotes": "7,122",
      "language": "French, Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0074806",
      "title": "The Little Girl Who Lives Down the Lane",
      "year": 1976,
      "imdbRating": "7.0",
      "imdbVotes": "18,888",
      "language": "English, Hebrew",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0070078",
      "title": "From Beyond the Grave",
      "year": 1974,
      "imdbRating": "6.6",
      "imdbVotes": "5,561",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt3778010",
      "title": "Dead Awake",
      "year": 2016,
      "imdbRating": "4.6",
      "imdbVotes": "3,652",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:47:17.704Z"
}