{
  "imdbId": "tt0036962",
  "title": "It Happened Tomorrow",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ITHAPPENEDTOMORROW",
      "id": "ITHAPPENEDTOMORROW",
      "title": "It Happened Tomorrow",
      "description": "Title: It Happened Tomorrow Summary: A young turn-of-the-century newspaper man finds he can get hold of the next day's paper. This brings more problems than fortune, especially as his new girlfriend is part of a phony clairvoyant act. Directed by: René Clair Actors: Directed by René Clair. With Dick Powell, Linda Darnell, Jack Oakie Production Company: Arnold Pressburger Films Release Date: 7 April 1944 (USA) Aspect Ratio: 1.37 : 1 In the beginning of the Twentieth Century, Lawrence 'Larry' Stevens is an ambitious reporter of The Evening News. One day, he is celebrating with his colleagues and he tells his friend Pop Benson that he would like to know the news in advance before it happens. While they are walking on the street, they see a poster of the clairvoyant Cigolini and his gorgeous niece Sylvia Smith and they decide to go to a theater to see the show. Larry flirts with Sylvia and on his way back home, he overhears Pop on the street and the old man tells that he is waiting for him and gives a newspaper to him. Larry does not give much attention and puts the newspaper in the pocket of his jacket. On the next morning, he finds that the newspaper is an edition of the next day. Larry uses the information to scoop about a hold up in the opera house, becoming the prime suspect of Inspector Mulrooney. Larry dates Sylvia and Pop gives another edition of The Evening News of the next day. Larry becomes a successful ...",
      "fileSize": 726624375,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/ITHAPPENEDTOMORROW",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 3578
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": 7,
    "imdbVotes": 3276,
    "Genre": "Comedy, Fantasy, Romance",
    "Plot": "In the beginning of the Twentieth Century, Lawrence 'Larry' Stevens is an ambitious reporter of The Evening News. One day, he is celebrating with his colleagues and he tells his friend Pop Benson that he would like to know the news in advance before it happens. While they are walking on the street, they see a poster of the clairvoyant Cigolini and his gorgeous niece Sylvia Smith and they decide to go to a theater to see the show. Larry flirts with Sylvia and on his way back home, he overhears Pop on the street and the old man tells that he is waiting for him and gives a newspaper to him. Larry does not give much attention and puts the newspaper in the pocket of his jacket. On the next morning, he finds that the newspaper is an edition of the next day. Larry uses the information to scoop about a hold up in the opera house, becoming the prime suspect of Inspector Mulrooney. Larry dates Sylvia and Pop gives another edition of The Evening News of the next day. Larry becomes a successful reporter and is promoted and has a raise on his job. He plans to marry Sylvia and decides to find the winners of the horse race. But soon he also learns that he will die on the next day. Now he questions whether the future can be changed.",
    "Director": "René Clair",
    "Writer": "Dudley Nichols, René Clair, Lord Dunsany",
    "Actors": "Dick Powell, Linda Darnell, Jack Oakie",
    "Language": "English, Italian",
    "Country": "United States",
    "Awards": "Nominated for 2 Oscars. 2 wins & 3 nominations total"
  },
  "relatedMovies": [
    "tt0034881",
    "tt0033414",
    "tt0033712",
    "tt0035969",
    "tt0040553",
    "tt0036696",
    "tt0151753",
    "tt0207407",
    "tt0036767",
    "tt0037033",
    "tt0056293",
    "tt0037388"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}