{
  "imdbId": "tt0017457",
  "title": "That Model from Paris",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThatModelFromParisForAr",
      "id": "ThatModelFromParisForAr",
      "title": "\"That Model From Paris\" (1926) starring Marceline Day",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     The film is included in our program to illustrate the work of Marceline Day, a star of Silent Hall of Fame.     \"That Model from Paris\" is a critically acclaimed comedy-drama that has not been seen in 85 years.  The film stars Marceline Day and was directed by Louis J. Gasnier. Here are just a few of the reviews for this film:     The film will be the special attraction at the Wintergarden. It is one of the most entertaining pictures that has been screened for some time. It is bright, well directed, with a wonderful cast, rich sets, and many wholesome laughs.  The picture is chockful of entertainment, and a great deal of credit is due to the portrayals of the various roles by an unusually good cast of screen favorites.  Marceline Day, who plays the title role, is beautiful, charming, and a screen player of great promise.  The rest of the players are well cast.  The direction is of the best. (Queensland Figaro)     The story is well plotted, the situations novel, and the picture highly entertaining.  The continuity excellent. (Telegraph)     Marceline Day is charming, a very good actress and chock full of appeal. (Variety)     The film is excellent entertainment for any theater. It has spirited action, good characterizations and a human and comical story. (Moving Picture World)     Pleasing story, nicely told. Light tale that has plenty of attractive angles to entertain general run of audiences.  The film is important in that it brings to the fore a new luminary in the person of Marceline Day in the leading role, that of a drab, unattractive sartorially, and, because of that, physically, cashier who from the chrysalis becomes the most gorgeous and radiant of butterflies. (Motion Picture News)   Directed by               Louis J. Gasnier Produced by             Tiffany Productions Based on                    the short story “The Right to Live” by Gouverneur Morris Starring                     Marceline Day, Bert Lytell, Eileen Percy, Ward Crane, Arthur Hoyt Cinematography        Milton Moore and Mack Stengler Distributed by           Tiffany Productions Release date               October 15, 1926 Running time             90 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 114064503,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/ThatModelFromParisForAr",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 5390
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "70 min",
    "imdbRating": 7.4,
    "imdbVotes": 87,
    "Genre": "Comedy, Drama",
    "Plot": "The original Plain Jane story that inspired many copycats. Shy secretary Jane removes her glasses and hat, transforming into a natural beauty. Unsavory characters push her into impersonating a French model. Confusion and romance ensue.",
    "Director": "Louis J. Gasnier",
    "Writer": "Gouverneur Morris, Frederica Sagor Maas",
    "Actors": "Marceline Day, Bert Lytell, Eileen Percy",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028346",
    "tt0016201",
    "tt0018742",
    "tt0016643",
    "tt0018471",
    "tt0017540",
    "tt0014264",
    "tt0017765",
    "tt0016028",
    "tt0019339",
    "tt0017750",
    "tt0016548"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.271Z"
}