{
  "movieId": "tt0006115",
  "title": "A Submarine Pirate",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-submarine-pirate-1915-directed-by-charles-avery-syd-chaplin",
      "id": "a-submarine-pirate-1915-directed-by-charles-avery-syd-chaplin",
      "title": "A Submarine Pirate (1915) Directed By Charles Avery, Syd Chaplin",
      "description": "A Submarine Pirate Syd Chaplin at the periscope Directed by Charles Avery Syd Chaplin Written by Mack Sennett Produced by Mack Sennett Starring Syd Chaplin Release date November 14, 1915 Country United States Languages Silent English intertitles A Submarine Pirate is a 1915 American short comedy film starring Syd Chaplin and featuring an early uncredited appearance by Harold Lloyd . [ 1 ] Cast Syd Chaplin as Ambitious waiter Wesley Ruggles as The inventor's accomplice Glen Cavender as A shrewd inventor Phyllis Allen as A pugnacious guest Virginia Fox Edgar Kennedy Josh Binney as Hotel Manager Harold Lloyd as Cook Heinie Conklin Fritz Schade Ted Edwards as Waiter (uncredited) References 1 \"Progressive Silent Film List: A Submarine Pirate\" . Silent Era . Retrieved December 12, 2008 . From Wikipedia, the free encyclopedia",
      "fileSize": 894353715,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-submarine-pirate-1915-directed-by-charles-avery-syd-chaplin",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 44
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "24 min",
    "imdbRating": 5.3,
    "imdbVotes": 190,
    "Genre": "Comedy, Short",
    "Plot": "A witless waiter working in a hotel restaurant often causes problems for the other staff members of the restaurant, his manager, and the customers. One day, an inventor and his associate dine in the restaurant and is served by the waiter. Gaining access via a submarine moored offshore with its ready crew, the inventor and his associate plan to rob a passenger steamer of a large shipment of gold on board. As they seem so secretive, the waiter devises a system of listening in on their conversation without being detected. As such, the waiter learns their plans to rob the steamer. Using a naval disguise, the waiter plans to take their place first on the submarine so that he can rob the steamer himself. Even with the help of the submarine's crew - or in spite of it - the waiter finds that stealing the gold and getting away scot-free isn't as straightforward as he anticipated.",
    "Director": "Charles Avery, Syd Chaplin",
    "Writer": "Mack Sennett",
    "Actors": "Syd Chaplin, Phyllis Allen, Glen Cavender",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005812",
    "tt0005315",
    "tt0003733",
    "tt0004546",
    "tt0004011",
    "tt0470941",
    "tt0004499",
    "tt0004936",
    "tt0005571",
    "tt0005810",
    "tt0006309",
    "tt0005044"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}