{
  "imdbId": "tt0033747",
  "title": "I'll Sell My Life",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/IllSellMyLife",
      "id": "IllSellMyLife",
      "title": "I'll Sell My Life",
      "description": "A woman desperate for some quick cash sells her life and agrees to die in exchange for the money to provide her brother a needed operation.",
      "fileSize": 1235454256,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/IllSellMyLife",
      "collection": "feature_films",
      "downloads": 4576
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "73 min",
    "imdbRating": 5.4,
    "imdbVotes": 59,
    "Genre": "Action, Crime, Drama",
    "Plot": "As Freddie and Lugger, employees of Bovhini, are waiting in the parking lot of the Club Sirocco for Ruth Parmelee, they see a woman accost Ruth and then shoot her and speed away in a car. Bochini, who has loved Ruth, vows revenge. Mordecai Breen is devoting his life to welfare work among the city's needy, and publishes a small newspaper called \"The Friend in Need,\" assisted by his former prize fighter friend, Happy Hogan. An advertisement headed \"I'll Buy Your Life\" appears in the paper and Breen decides to investigate. At the address given, the swanky Alhambra Arms apartments, Breen learns that the advertiser is Alfred Darnell, an orchestra leader and writer of detective stories. A number of girls answer the ad, but Dale Leyden, after being interviewed by Darnell and Velencia Duncan, is the successful applicant. As she leaves, Breen tells her that if she should find herself in the need of any assistance, to let him know. Dale tells her blind musician brother Philip that an uncle who formerly lived in South America has left them twenty thousand dollars. Meanwhile, back to the original story, Breen calls on his friend, Police Lieutenant Hammer, who shows Breen the evidence from the Parmelee murder: a pearl pendant from a bracelet, a piece of sequin from a woman's gown and part of a heel from an evening slipper. Dale calls on Breen, tells him her name is Mary Jones and gives him an envelope. When he is notified that Mary Jones is dead, he is to open the envelope that contains two letters. If he receives the sum of $18,000, he is to open the first letter and deliver the money to the name and address given, and destroy the second letter without opening it. If he doesn't get the money, he is to open the second letter and see that justice is done. Is Mary giving her life to take a fall for the killer of Ruth Permelee in exchange for money to provide an operation for her blind brother? Highly probable. Is the plot plausible? Highly improbable. Did Elmer Clifton direct worse films. Quite often.",
    "Director": "Elmer Clifton",
    "Writer": "Walter Ripperger, George Rosener, Elmer Clifton",
    "Actors": "Rose Hobart, Michael Whalen, Stanley Fields",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026937",
    "tt0033688",
    "tt0033469",
    "tt0034637",
    "tt0032642",
    "tt0034878",
    "tt0033535",
    "tt0028589",
    "tt0035057",
    "tt0029578",
    "tt0033822",
    "tt0032784"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}