{
  "imdbId": "tt0020413",
  "title": "Skating Hounds",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/skating-hounds-1929",
      "title": "Skating Hounds (1929)",
      "description": "Skating Hounds is an Aesop Fables cartoon directed by Mannie Davis, Paul Terry. Watch on RetroFlix:  https://retroflix.org/skating-hounds-1929/",
      "id": "skating-hounds-1929"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "4.1",
    "imdbVotes": "28",
    "Genre": "Animation, Short, Comedy",
    "Plot": "Van Beuren cartoons are extremely variable, especially in the number of gags and whether the absurdist humour shines through enough (sometimes it does, other times it doesn't), but are strangely interesting. Although they are often poorly animated with barely existent stories and less than compelling lead characters, they are also often outstandingly scored, there can be some fun support characters and some are well-timed and amusing.There are worse Van Beuren cartoons than 'Skating Hounds'. There is worse even from the Aesop's Fables series, which 'Skating Hounds' is part of and a very early efforts. It does contain pretty much all of the faults of Van Beuren's worst while having a few good points. Although 'Wood Choppers' as far as previous efforts go is a better cartoon, at least 'Skating Hounds' doesn't suffer from being too short, heavily edited-feeling and feeling as choppy. The sound is also clearer than the previous Aesop's Fables cartoons.'Skating Hounds' best asset is the music score, pretty much the best thing consistently of Van Beuren's output (sometimes even the only good thing). It is so beautifully and cleverly orchestrated, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Some of the synchronisation is nicely done and there is some liveliness pace-wise. Didn't care for the characters overall, but the cat (or whatever animal it was meant to be) is engaging and provides some amusement.However, the animation is also not good, in fact it is downright bad most of the time with erratically sloppy character designs in particular while the simplistic background detail and lack of fluidity and crispness are just as difficult to ignore. Often you can't actually tell what the animals are actually meant to be, for instance what seemed like some kind of bear or dog looked absolutely nothing like one. None of the rest of the characters are that interesting or fun, most are over-cutesy and unmemorable and others are pretty annoying. Story is very slight to the point of non-existence (just a string of gags) and not only doesn't go very far but it feels random and disjointed at times. If you are looking for sense too, look elsewhere.Basically 'Skating Hounds' is a stringing along of gags structured in a way that's disorganised and random. generally, while having a fair bit going on, it is very low on laughs. In terms of quality none of the gags are amusing or inventive, never rising above the forgettable and there is not much absurdist about them. The cartoon felt very rushed to me on the whole, despite some liveliness, and the action was very confused and failed to make much sense.Overall, tumbles quickly and never properly recovers, not awful but weak. 3/10 Bethany Cox",
    "Director": "Mannie Davis, Paul Terry",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "N/A",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0146423",
      "title": "Alpine Antics",
      "year": 1929,
      "imdbRating": "7.2",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146596",
      "title": "Custard Pies",
      "year": 1929,
      "imdbRating": "4.0",
      "imdbVotes": "30",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150513",
      "title": "Farm Relief",
      "year": 1929,
      "imdbRating": "5.6",
      "imdbVotes": "17",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019014",
      "title": "Homeless Homer",
      "year": 1929,
      "imdbRating": "4.1",
      "imdbVotes": "32",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146913",
      "title": "House Cleaning Time",
      "year": 1929,
      "imdbRating": "4.5",
      "imdbVotes": "32",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0142419",
      "title": "Jungle Jingles",
      "year": 1929,
      "imdbRating": "6.3",
      "imdbVotes": "37",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0136324",
      "title": "Ko-Ko's Harem Scarem",
      "year": 1929,
      "imdbRating": "5.6",
      "imdbVotes": "39",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146975",
      "title": "Land o' Cotton",
      "year": 1929,
      "imdbRating": "5.3",
      "imdbVotes": "18",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0141664",
      "title": "Noah's Lark",
      "year": 1929,
      "imdbRating": "5.1",
      "imdbVotes": "75",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147193",
      "title": "Presto-Chango",
      "year": 1929,
      "imdbRating": "5.3",
      "imdbVotes": "46",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1058754",
      "title": "Sick Cylinders",
      "year": 1929,
      "imdbRating": "5.7",
      "imdbVotes": "36",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019677",
      "title": "The Barnyard Battle",
      "year": 1929,
      "imdbRating": "6.1",
      "imdbVotes": "537",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:39:37.234Z"
}