{
  "imdbId": "tt0016751",
  "title": "The Cruise of the Jasper B",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jasperb",
      "id": "jasperb",
      "title": "\"The Cruise of the Jasper B\" (1926)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Cruise of the Jasper B\" is a comedy featuring Snitz Edwards, a star of Silent Hall of Fame. Rod La Rocque must get married on his twenty fifth birthday or lose his fortune.  He finds the ideal woman in Mildred Harris.  She is a wealthy heiress at the expense of her disinherited brother Snitz Edwards, who wants to destroy the uncle's will that gives all the money to her. Directed by                      James W. Horne Produced by                    Cecil B. DeMille Pictures Scenario by                     Tay Garnett and Zelda Sears from the novel by Don Marquis Starring                           Rod La Rocque, Mildred Harris, Snitz Edwards, Jack Ackroyd, Otto Lederer Cinematography             Lucien Andriot Distributed by                 Producers Distributing Corporation Release date                     December 13, 1926 Running time                   61 minutes Country                            USA Language                         Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 1747387969,
      "addedAt": "2026-01-07T00:08:54.188Z",
      "thumbnail": "https://archive.org/services/img/jasperb",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 2216
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "60 min",
    "imdbRating": 7.2,
    "imdbVotes": 105,
    "Genre": "Comedy, Romance",
    "Plot": "Jerry Cleggett, descendant of a seafaring, buccaneering family, in order to inherit the family fortune, must marry on the deck of the Jasper B, now rotting on the docks. Aided by an overzealous valet, Jerry looks over a large number of prospective partners; then Agatha Fairhaven, trying to save a fortune of her own, enters his house--seeking protection just as the entire house is being auctioned off. Jerry and Agatha fall instantly in love, and with Jerry dressed in pirate regalia they proceed to the ancestral ship. When their taxicab goes on a wild, driver-less spree, the couple are joined by a trio of bandits who have just held up a mail-truck; and they are pursued by local, state, and Federal authorities. Aboard ship, the crew escape the authorities as, following a furious battle, a bomb jars the vessel from her concrete bed and into the water.",
    "Director": "James W. Horne",
    "Writer": "Tay Garnett, John W. Krafft, Don Marquis",
    "Actors": "Rod La Rocque, Mildred Harris, Snitz Edwards",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0017305",
    "tt0017204",
    "tt0016646",
    "tt0018471",
    "tt0020136",
    "tt0017928",
    "tt0016971",
    "tt0018183",
    "tt0016332",
    "tt0018235",
    "tt0015841",
    "tt0016548"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.188Z"
}