{
  "imdbId": "tt0040590",
  "title": "Million Dollar Weekend",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Million_Dollar_Weekend_1948",
      "title": "Million Dollar Weekend",
      "description": "I downloaded the 2.4GB file from here and reduced it. In addition, I cropped the black from the sides and increased the aspect ratio while boosting the brightness and contrast.",
      "id": "Million_Dollar_Weekend_1948"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/million-dollar-weekend-1948_202307",
      "title": "Million Dollar Weekend (1948)",
      "description": "A stock broker embezzles a million bucks and plans to take off to Shanghai. A number of obstacles stands in his path, however. Watch on RetroFlix:  https://retroflix.org/million-dollar-weekend-1948/",
      "id": "million-dollar-weekend-1948_202307"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/million_dollar_weekend",
      "title": "Million Dollar Weekend",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "million_dollar_weekend"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TjwAV0Jhu_E",
      "title": "Million Dollar Weekend (1948) | Colorized Public Domain Thriller with Gene Raymond and Osa Massen",
      "description": "Million Dollar Weekend (1948) is an American thriller directed by and starring Gene Raymond, produced as an independent low-budget feature that has since entered the public domain. This restored and colorized edition brings renewed vitality to a fast-moving tale of money, murder, and moral compromise set against the backdrop of postwar international travel. For modern audiences in the United States, Europe, and beyond, this colorized version highlights the film’s stylish blend of suspense and romance while making it more visually engaging for contemporary viewers.\n\nPlot Summary:\nThe film follows Nicholas Lawrence (Gene Raymond), a disillusioned Los Angeles stockbroker who decides to abandon his old life. In a bold act, he embezzles $1,000,000 in securities and boards a flight to Honolulu, intending to start anew. On the plane, he encounters Cynthia Strong (Osa Massen), a mysterious woman traveling to escape her own troubles — specifically, suspicion surrounding her husband’s recent death.\n\nTheir uneasy alliance soon deepens when a third passenger, Alan Marker (Francis Lederer), overhears their secrets. Marker is a charming yet dangerous opportunist who blackmails both Nicholas and Cynthia, pushing them into a tense struggle for survival. As the trio arrives in Hawaii, betrayal, suspicion, and shifting loyalties escalate into a high-stakes confrontation.\n\nThe film builds tension through sharp dialogue and exotic settings, culminating in a suspenseful showdown where greed, love, and conscience collide. Lawrence and Cynthia must decide whether to trust each other or surrender to the corruption that threatens to consume them both.\n\nCast and Crew:\n• Director: Gene Raymond\n• Producer: George Moskov\n• Screenplay: Lawrence Kimble\n• Cinematography: Allen G. Siegler\n• Editing: Lyle Boyer\n\nStarring:\n• Gene Raymond as Nicholas Lawrence\n• Osa Massen as Cynthia Strong\n• Francis Lederer as Alan Marker\n• Charles Coleman as Dr. James Cook\n• Claire Carleton as Mona Shannon\n• Stephanie Bachelor as Miss McGilvray\n• Ivan Triesault as Kurt\n\nFilm Significance:\nMillion Dollar Weekend reflects the post-World War II shift toward smaller, independent productions that explored darker themes like greed, betrayal, and moral ambiguity. Gene Raymond, primarily known for his acting career in the 1930s and 1940s, took the unusual step of both directing and starring in this project. Osa Massen delivers a layered performance as a woman torn between survival and integrity, while Francis Lederer shines as the manipulative antagonist.\n\nThough not a major studio release, the film remains valuable as a cultural artifact of late-1940s cinema. It captures the intrigue of financial crimes during a period when American audiences were increasingly fascinated by noir-inspired thrillers that blended crime with psychological tension. Its streamlined 72-minute runtime makes it a brisk, compelling watch that still resonates with fans of vintage suspense films.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Million Dollar Weekend remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1948 release was black and white, consistent with the cost-saving measures of many independent productions of the era. While authentic, many modern viewers often overlook monochrome films. By offering a colorized edition, Million Dollar Weekend gains a new dimension that highlights its suspense and international intrigue for today’s audiences. This edition bridges the gap between historical preservation and modern accessibility.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#MillionDollarWeekend #GeneRaymond #OsaMassen #FrancisLederer #1940sThriller #PublicDomainMovie #ColorizedClassic #FilmNoirStyle #ClassicHollywood #1948Movies",
      "id": "TjwAV0Jhu_E",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r5Ty-VdAqOk",
      "title": "Million Dollar Weekend (1948) FRANCIS LEDERER🍕FILM NOIR",
      "description": "Stars: Gene Raymond, Francis Lederer, Stephanie Paull/Osa Massen\nDirector: Gene Raymond\n\nA young stockbroker embezzles a staggering one million dollars. But his plans to escape unravel when he crosses paths with a mysterious woman who is under suspicion of murdering her husband. As love blossoms amid suspicion, the stakes soar. Together, they face the ultimate test: returning the stolen fortune before it's too late!\n\nExperience the intrigue of Million Dollar Weekend, a gripping crime thriller that epitomizes classic film noir storytelling. Directed by and starring Gene Raymond, this cinematic gem delves into greed, regret, and redemption in a tale of suspense and danger. Featuring standout performances by Francis Lederer and Stephanie Paull (aka Osa Massen), this noir classic delivers twists and turns to keep you on the edge of your seat.\n\nDiscover why fans of classic movies, mysteries, and film noir are drawn to the shadowy world of Million Dollar Weekend. Don’t miss this rare gem, a must-watch for enthusiasts of crime thrillers and Hollywood’s golden age.\n\nSubscribe to PizzaFLIX for more vintage crime dramas, iconic thrillers, and timeless film noir classics. Relive cinema’s most suspenseful moments with the stars who made them unforgettable!\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "id": "r5Ty-VdAqOk",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": "6.1",
    "imdbVotes": "396",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "2 people - a young stockbroler and a young wife are passengers on the same flight from Los Angeles. For different reasons, they've both fled the city with secrets. Neither knows of the others' situation, and they both turn to each other for help.",
    "Director": "Gene Raymond",
    "Writer": "Charles Belden, Matty Kemp, Gene Raymond",
    "Actors": "Gene Raymond, Osa Massen, Francis Lederer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0038714",
      "title": "The Madonna's Secret",
      "year": 1946,
      "imdbRating": "6.4",
      "imdbVotes": "293",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040779",
      "title": "Shed No Tears",
      "year": 1948,
      "imdbRating": "6.3",
      "imdbVotes": "473",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0039220",
      "title": "Brighton Rock",
      "year": 1948,
      "imdbRating": "7.3",
      "imdbVotes": "7,156",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041187",
      "title": "Blonde Ice",
      "year": 1948,
      "imdbRating": "6.0",
      "imdbVotes": "1,410",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040237",
      "title": "Close-Up",
      "year": 1948,
      "imdbRating": "5.7",
      "imdbVotes": "199",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040257",
      "title": "Cry of the City",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "3,838",
      "language": "English, Italian, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040366",
      "title": "Force of Evil",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "8,043",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040444",
      "title": "Hollow Triumph",
      "year": 1948,
      "imdbRating": "6.7",
      "imdbVotes": "3,284",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040512",
      "title": "Kiss the Blood Off My Hands",
      "year": 1948,
      "imdbRating": "6.8",
      "imdbVotes": "2,308",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040647",
      "title": "No Orchids for Miss Blandish",
      "year": 1948,
      "imdbRating": "6.0",
      "imdbVotes": "782",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040160",
      "title": "The Big Clock",
      "year": 1948,
      "imdbRating": "7.6",
      "imdbVotes": "10,549",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040947",
      "title": "Walk a Crooked Mile",
      "year": 1948,
      "imdbRating": "6.3",
      "imdbVotes": "1,188",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:54.327Z"
}