{
  "imdbId": "tt0002562",
  "title": "The Victoria Cross",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-victoria-cross",
      "id": "silent-the-victoria-cross",
      "title": "The Victoria Cross",
      "fileSize": 862902005,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-victoria-cross",
      "language": "English",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 348
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "15 min",
    "imdbRating": 5.1,
    "imdbVotes": 26,
    "Genre": "Drama, Short",
    "Plot": "Just previous to the Charge of the Light Brigade, made famous by Tennyson, in the fall of 1854, young Lieutenant Cholmondeley, of the English Army, asks Colonel Carson for the hand of his daughter Ellen. The Colonel replies: \"When you have won your spurs, I will give my consent.\" Russia declares war against England and France and the Light Brigade is ordered to the front. After the departure of the Lieutenant and her father, Ellen decides to become a nurse under Florence Nightingale. She offers her services and though somewhat young, is accepted by Miss Nightingale. At her father's encampment he recognizes Ellen as the nurses pass before him in review. At first he is displeased, but upon second thought is justly proud of her. She is first upon the battlefield to aid and comfort the wounded and it is there that her sweetheart, the Lieutenant, learns of her presence at the seat of action. During the charge of the Six Hundred, Lieutenant Cholmondeley saves the life of his Colonel, defending him against the combined attacks of three Cossacks, lifting one bodily above his head and casting him maimed and helpless to the ground. Ellen watches through her father's field-glasses with palpitating heart the deeds of her sweetheart and the progress of the battle. After the war what is left of the few survivors of the Light Brigade are mustered before Queen Victoria and the young Lieutenant receives the Victoria Cross as a special mark of distinction for services rendered. The Colonel gives him his daughter Ellen, saying, \"He has fairly won her and his spurs.\"",
    "Director": "Hal Reid",
    "Writer": "Hal Reid",
    "Actors": "Tefft Johnson, Edith Storey, Wallace Reid",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0004235",
    "tt0002381",
    "tt0002054",
    "tt0002082",
    "tt0002098",
    "tt0002143",
    "tt0002121",
    "tt0002342",
    "tt0002400",
    "tt0002408",
    "tt0002212",
    "tt0002386"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}