{
  "imdbId": "tt0043885",
  "title": "Only the Valiant",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OnlytheValaint",
      "id": "OnlytheValaint",
      "title": "Only the Valiant",
      "description": "Capt. Richard Lance (Gregory Peck) is unjustly held responsible, by his men and his girlfriend (Barbara Payton), for an Indian massacre death of beloved Lt. Holloway. Holloway (Gig Young) is killed while escorting a dangerous Indian chief to another fort's prison. The chief escapes. Knowing their fort is in danger of Indian attack, Lance takes a small group of army misfits to an abandoned nearby army fort to defend a mountain pass against the oncoming Indian assault. Their mission is to stall for time until reinforcements from another fort arrive.",
      "fileSize": 2276339044,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/OnlytheValaint",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 393158
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/only-the-valiant-1951_202508",
      "id": "only-the-valiant-1951_202508",
      "title": "Only The Valiant (1951) Gregory Peck · Barbara Payton",
      "description": "A cavalry officer in New Mexico (1867), notorious for his unyielding severity, defends a fort against the Apaches and finally proves his human qualities to the woman he has long adored in vain. A rather exciting, off-the-shelf Western adventure. ..",
      "fileSize": 1574788499,
      "addedAt": "2026-01-07T00:10:12.692Z",
      "thumbnail": "https://archive.org/services/img/only-the-valiant-1951_202508",
      "language": "eng",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 189
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "105 min",
    "imdbRating": 6.5,
    "imdbVotes": 1891,
    "Genre": "Drama, Western",
    "Plot": "Capt. Richard Lance is unjustly held responsible, by his men and girlfriend, for an Indian massacre death of beloved Lt. Holloway. Holloway is killed while escorting a dangerous Indian chief to another fort's prison. The chief escapes. Knowing their fort is in danger of Indian attack, Lance takes a small group of army misfits to an abandoned nearby army fort to defend a mountain pass against the oncoming Indian assault. Their mission is to stall for time until reinforcements from another fort arrive. The men in this small group of malcontents, deserters, psychopaths and cowards all hate Capt. Lance and wish him dead. Much to their chagrin, the men recognize that Lance's survival instincts, military knowledge and leadership are the only chance the group has of staying alive.",
    "Director": "Gordon Douglas",
    "Writer": "Edmund H. North, Harry Brown, Charles Marquis Warren",
    "Actors": "Gregory Peck, Barbara Payton, Ward Bond",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0065451",
    "tt0043665",
    "tt0042782",
    "tt0041308",
    "tt0043829",
    "tt0043849",
    "tt0043895",
    "tt0043853",
    "tt0043959",
    "tt0043962",
    "tt0043626",
    "tt0040947"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:10:12.692Z"
}