{
  "imdbId": "tt0004099",
  "title": "His Majesty, the Scarecrow of Oz",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/His_Maj_Scarecrow_OZ",
      "title": "His Majesty The Scarecrow of Oz",
      "description": "Classic entry into L Frank Baum's silent Wizard of Oz Series. Cast Violet MacMillan...Dorothy, a Kansas girl who is wandering in the Land of Oz Frank Moore...The Scarecrow Pierre Couderc...The Tin Woodman Fred Woodward...The Cowardly Lion / The Kangaroo / The Crow / The Cow / The Mule Raymond Russell...King Krewl Arthur Smollet...Googly-Goo, a wealthy courtier J. Charles Haydon...The Wizard of Oz (as J. Charles Hayden) Todd Wright...Pon, the Gardener's Boy Vivian Reed...Princess Gloria, niece to King Krewl Mai Wells...Old Mombi Mildred Harris...Button-Bright, who is lost and doesn't care Directed by J. Farrell McDonald Written and Produced By L Frank Baum ***** July 8 2010 - A new higher quality DivX encode was added to this page.",
      "id": "His_Maj_Scarecrow_OZ"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his-majesty-the-scarecrow-of-oz-1914",
      "title": "His Majesty, The Scarecrow Of Oz (1914)Directed by J. Farrell MacDonald",
      "description": "His Majesty, The Scarecrow of Oz Directed by J. Farrell MacDonald Written by L. Frank Baum Produced by L. Frank Baum Louis F. Gottschalk Starring Violet MacMillan Frank Moore Raymond Russell Pierre Couderc Fred Woodward Mildred Harris J. Charles Haydon Cinematography James A. Crosby Music by Louis F. Gottschalk Production company The Oz Film Manufacturing Company Distributed by Paramount Pictures Release date September 28, 1914 Running time 59 minutes (5 reels ) Country United States Language Silent (English intertitles ) His Majesty, the Scarecrow of Oz is a 1914 American silent fantasy adventure film directed by J. Farrell MacDonald , and written and produced by L. Frank Baum . It stars Violet MacMillan , Frank Moore , Vivian Reed , Todd Wright, Pierre Couderc , Raymond Russell , and Fred Woodward . The film had a troubled distribution history; it opened on September 28, 1914, to little success, though it was received as well above average fare by critics of the time. [ 1 ] Early in 1915, it was reissued under the title The New Wizard of Oz and was slightly more successful. [ 2 ] The film is loosely based on Baum's 1900 book The Wonderful Wizard of Oz , but in the screenplay, Baum introduced many new characters and a large new story that later became the basis for the 1915 book The Scarecrow of Oz . [ 3 ] Similar to The Wonderful Wizard of Oz , the Scarecrow's origin is revealed, although his life is now attributed to \"the Spirit of the Corn\", who appears as a conventional Hollywood depiction of a Native American . [ 4 ] This was the third film by the Oz Film Manufacturing Company , following The Patchwork Girl of Oz and The Magic Cloak of Oz . [ 5 ] Plot King Krewl ( Raymond Russell ) is a cruel dictator in the Emerald City in the Land of Oz . He wishes to marry-off his daughter, Princess Gloria (Vivian Reed), to an old courtier named Googly-goo (Arthur Smollett), but she is in love with Pon, a Gardener 's boy (Todd Wright). Krewl employs the Wicked Witch named Old Mombi (Mai Wells), to freeze the heart of Gloria so she will not love Pon any longer. This she does by pulling out her heart (which looks somewhere between a valentine and a bland representation of a heart without any vessels) and coating it with ice. Meanwhile, a lost little girl from Kansas named Dorothy Gale (Violet MacMillan) is captured by Mombi and imprisoned in her castle. However, Dorothy runs away with the now heartless Gloria, accompanied by Pon, and they eventually meet the Scarecrow ( Frank Moore ). Mombi catches up with the travelers and removes the Scarecrow's stuffing, but Dorothy and Pon are able to re-stuff him; Gloria abandons them and wanders off. They meet the lost little boy, Button Bright (Mildred Harris). The party travels to the Winkie Country next and arrive at the Tin Castle of the Tin Woodman (Pierre Couderc), who has rusted solid. Mombi reaches the Tin Castle, and the Tin Woodman chops off her head; however, this merely slows her down as she hunts for it and places it back on. Having replaced her head, Mombi encounters Pon and turns him into a kangaroo . Dorothy, Button Bright, the Scarecrow and the Tin Woodman escape from Mombi by crossing a river on a raft. But the Scarecrow's barge-pole gets stuck in the river bed and leaves him stranded, until he is rescued by a bird. At one point in this sequence, the Scarecrow slides down the pole into the river, resulting in a brief \"underwater\" sequence featuring puppet fish and a mermaid ; throughout, the Scarecrow makes asides to the camera, mostly without [intertitles]. The party encounter the Wizard (J. Charles Haydon), who tricks Mombi by letting the group hide in the Red Wagon, pulled by the sawhorse; when Mombi attempts to follow them, the group escape out the back of the wagon. The four companions meet the Cowardly Lion , who joins them. The Wizard traps Mombi in a container of \"Preserved Sandwitches\" and paints out the \"sand\" and the plural, carrying her away in his pocket. The Scarecrow, taking a barrage of arrows, tosses Krewl's soldiers over the battlements to deal with the Cowardly Lion, who cannot climb the rope ladder over the city wall. With the support of the people, the Scarecrow is easily able to depose King Krewl. The Wizard releases Mombi, and compels her to restore Pon to his normal form and unfreeze Gloria’s Heart. Cast Violet MacMillan as Dorothy Gale Frank Moore as The Scarecrow Pierre Couderc as The Tin Woodman Fred Woodward as The Cowardly Lion / The Kangaroo / The Crow / The Cow / The Mule Raymond Russell as King Krewl Arthur Smollet as Googly-Goo J. Charles Haydon as The Wizard of Oz (credited as J. Charles Hayden) Todd Wright as Pon Vivian Reed as Princess Gloria Mai Wells as Old Mombi (credited as Mae Wells) Mildred Harris as Button-Bright Louise Emmons Damage history The opening reel was lost for many years. While it was eventually recovered in the 1990s, it did not contain the opening titles; Dick Martin 's titles, designed in the 1960s, continued to be used, which falsely stated that Baum was the director of the film, misspelled Mai Wells ' name, and left out Smollett's credit entirely. References 1 See reviews collected from various trade papers in The Baum Bugle Winter 2005 2 Eyles, Allen (1985). The World of Oz: A Fantastic Expedition Over the Rainbow . HPBooks. p. 50. ISBN   0-89586-415-0 . Retrieved February 11, 2024 . 3 Simpson, Paul (2013). A Brief Guide to Oz . Constable & Robinson Ltd. p. 41. ISBN   978-1-47210-988-0 . Retrieved February 10, 2024 . 4 \"His Majesty, the Scarecrow of Oz (1914)\" . And You Call Yourself a Scientist? . Retrieved February 11, 2024 . 5 Swartz, Mark Evan (2002). Oz Before the Rainbow: L. Frank Baum's the Wonderful Wizard of Oz on Stage and Screen to 1939 . Baltimore, Maryland: JHU Press. pp. 193–196. ISBN   978-0801870927 . Retrieved July 20, 2015 . From Wikipedia, the free encyclopedia",
      "id": "his-majesty-the-scarecrow-of-oz-1914"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-his-majesty-the-scarecrow-of-oz",
      "title": "His Majesty, the Scarecrow of Oz",
      "id": "silent-his-majesty-the-scarecrow-of-oz"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "59 min",
    "imdbRating": "5.4",
    "imdbVotes": "517",
    "Genre": "Family, Fantasy, Adventure",
    "Plot": "A wicked king has taken over the Emerald City, and wants his daughter, Princess Gloria, to marry the horrid courtier Googly-Goo, though she loves Pon, the Gardener's Boy. The camera now follows two farmers placing a Scarecrow upon a pole in a cornfield. Meanwhile, Pon rescues a Kansas girl named Dorothy from the evil witch Mombi, to whom Princess Gloria has been taken by King Krewl to freeze her heart so she will no longer love Pon. An Indian princess conducts a ceremony to bring the Scarecrow to life. Pon rescues the cold-hearted princess and they flee in search of help, discovering the Scarecrow (who promptly falls in love with the princess) and Button-Bright, a lost boy from America. They come to the castle of the Tin Emperor, Nick Chopper, and after oiling him, he falls in love with Gloria. After a bit of a chase aided by the Sawhorse and the Wizard, Mombi turns Pon into a Kangaroo, and a slew of Fred Woodward's animals battle it out.",
    "Director": "J. Farrell MacDonald",
    "Writer": "L. Frank Baum",
    "Actors": "Violet MacMillan, Frank Moore, Pierre Couderc",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0004457",
      "title": "The Patchwork Girl of Oz",
      "year": 1914,
      "imdbRating": "5.5",
      "imdbVotes": "581",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004286",
      "title": "The Magic Cloak of Oz",
      "year": 1914,
      "imdbRating": "5.2",
      "imdbVotes": "356",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004873",
      "title": "Alice in Wonderland",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "795",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050084",
      "title": "20 Million Miles to Earth",
      "year": 1957,
      "imdbRating": "6.3",
      "imdbVotes": "8,727",
      "language": "English, Italian, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1014759",
      "title": "Alice in Wonderland",
      "year": 2010,
      "imdbRating": "6.4",
      "imdbVotes": "460,572",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0089961",
      "title": "Santa Claus",
      "year": 1985,
      "imdbRating": "6.3",
      "imdbVotes": "15,791",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015400",
      "title": "The Thief of Bagdad",
      "year": 1924,
      "imdbRating": "7.7",
      "imdbVotes": "7,374",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047930",
      "title": "A Journey to the Beginning of Time",
      "year": 1955,
      "imdbRating": "7.1",
      "imdbVotes": "2,622",
      "language": "Czech",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0068190",
      "title": "Alice's Adventures in Wonderland",
      "year": 1972,
      "imdbRating": "5.7",
      "imdbVotes": "1,940",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0290406",
      "title": "Alicia en el país de las maravillas",
      "year": 1976,
      "imdbRating": "5.8",
      "imdbVotes": "88",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052948",
      "title": "Journey to the Center of the Earth",
      "year": 1959,
      "imdbRating": "7.0",
      "imdbVotes": "20,760",
      "language": "English, Swedish, French, Italian, Russian, Icelandic",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0243462",
      "title": "Mee-Shee: The Water Giant",
      "year": 2005,
      "imdbRating": "5.3",
      "imdbVotes": "791",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}