{
  "movieId": "tt0007194",
  "title": "Police",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CC_1916_05_27_Police",
      "id": "CC_1916_05_27_Police",
      "title": "Charlie Chaplin's \"Police\"",
      "description": [
        "Charlie Chaplin's 49th Film Released May 27 1916 Police was Charlie Chaplin's 14th released film from Essanay. It was made at the Majestic Studio in Los Angeles. Charlie playing an ex-convict finds life on the outside not to his liking and leads him to breaking into a home with another thief (Wesley Ruggles). Edna Purviance plays the girl living in the home who tries to change him. http://www.imdb.com/title/tt0007194/",
        "Charlie Chaplin In The Internet Archive http://www.archive.org/details/CC_1914_02_02_MakingALiving http://www.archive.org/details/CC_1914_02_07_KidsAutoRaceAtVenice http://www.archive.org/details/CC_1914_02_09_MabelsStrangePredicament http://www.archive.org/details/CC_1914_02_28_BetweenShowers http://www.archive.org/details/CC_1914_03_02_FilmJohnny",
        "Charlie Chaplin In The Internet Archive http://www.archive.org/details/CC_1914_02_02_MakingALiving http://www.archive.org/details/CC_1914_02_07_KidsAutoRaceAtVenice http://www.archive.org/details/CC_1914_02_09_MabelsStrangePredicament http://www.archive.org/details/CC_1914_02_28_BetweenShowers http://www.archive.org/details/CC_1914_03_02_FilmJohnny http://www.archive.org/details/CC_1914_03_16_HisFavoritePasttime http://www.archive.org/details/CC_1914_03_26_CruelCruelLove http://www.archive.org/details/CC_1914_04_04_TheLandladysPet http://www.archive.org/details/CC_1914_04_20_TwentyMinutesofLove http://www.archive.org/details/CC_1914_04_27_CaughtinaCaberet http://www.archive.org/details/CC_1914_05_07_ABusyDay http://www.archive.org/details/CC_1914_06_01_TheFatalMallet http://www.archive.org/details/CC_1914_06_11_TheKnockout http://www.archive.org/details/CC_1914_06_13_MabelsBusyDay http://www.archive.org/details/CC_1914_06_20_CharlottEtLeMannequin http://www.archive.org/details/CC_1914_07_09_LaffingGas http://www.archive.org/details/CC_1914_08_01_CharolotGargonDeTheater http://www.archive.org/details/CC_1914_08_10_FaceOnTheBarroomFloor http://www.archive.org/details/CC_1914_08_13_CharliesRecreation http://www.archive.org/details/CC_1914_08_27_TheMasquerader http://www.archive.org/details/CC_1914_08_31_TheGoodforNothing http://www.archive.org/details/CC_1914_09_07_TheRounders http://www.archive.org/details/CC_1914_09_14_TheNewJanitor http://www.archive.org/details/CC_1914_10_10_TheRivalMashers http://www.archive.org/details/CC_1914_10_26_DoughandDynamite http://www.archive.org/details/CC_1914_10_29_CharlottMabelAuxCourses http://www.archive.org/details/CC_1914_11_14_TilliesPuncturedRomance http://www.archive.org/details/CC_1914_11_07_MusicalTramps http://www.archive.org/details/CC_1914_11_09_HisTrystingPlace http://www.archive.org/details/CC_1914_12_05_AFairExchange http://www.archive.org/details/CC_1914_12_07_HisPrehistoricpast http://www.archive.org/details/CC_1915_02_01_HisNewJob http://www.archive.org/details/CC_1915_02_15_ANightOut http://www.archive.org/details/CC_1915_03_01_TheChampion http://www.archive.org/details/CC_1915_03_18_InThePark http://www.archive.org/details/CC_1915_04_11_TheTramp http://www.archive.org/details/CC_1915_04_29_ByTheSea http://www.archive.org/details/CC_1915_06_21_Work http://www.archive.org/details/CC_1915_07_12_AWoman http://www.archive.org/details/CC_1915_08_09_TheBank http://www.archive.org/details/CC_1915_10_04_CharlieShanghaied http://www.archive.org/details/CC_1915_11_20_ANightInTheShow http://www.archive.org/details/CC_1915_12_18_ABurlesqueOnCarmen http://www.archive.org/details/CC_1916_05_15_TheFloorwalker http://www.archive.org/details/CC_1916_05_27_Police http://www.archive.org/details/CC_1916_06_12_TheFireman http://www.archive.org/details/CC_1916_07_10_TheVagabond http://www.archive.org/details/CC_1916_08_07_One_A_M http://www.archive.org/details/CC_1916_09_04_TheCount http://www.archive.org/details/CC_1916_10_02_ThePawnshop http://www.archive.org/details/CC_1916_11_13_BehindtheScreen http://www.archive.org/details/CC_1916_12_04_TheRink http://www.archive.org/details/CC_1917_04_16_TheCure http://www.archive.org/details/CC_1917_06_17_TheImmigrant http://www.archive.org/details/CC_1917_10_22_TheAdventurer http://www.archive.org/details/CC_1918_09_29_TheBond http://www.archive.org/details/CC_1918_10_20_ShoulderArms http://www.archive.org/details/CC_1918_xx_xx_TripleTrouble http://www.archive.org/details/CC_1919_06_15_Sunnyside http://www.archive.org/details/CC_1919_12_15_ADaysPleasure __________________________________________________"
      ],
      "fileSize": 276940896,
      "addedAt": "2026-01-07T00:06:14.040Z",
      "thumbnail": "https://archive.org/services/img/CC_1916_05_27_Police",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 143252
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/police-1916",
      "id": "police-1916",
      "title": "Police (1916)",
      "description": "Police is Charlie Chaplin’s 14th film with Essanay Studios and was released in 1916. It was made at the Majestic Studio in Los Angeles. Charlie plays an ex-convict who finds life on the outside not to his liking and leads him to breaking into a home with another thief (Wesley Ruggles). Edna Purviance plays the girl living in the home who tries to change him. Watch on RetroFlix.org:  https://retroflix.org/police-1916/",
      "fileSize": 1238514299,
      "addedAt": "2026-01-07T00:10:21.537Z",
      "thumbnail": "https://archive.org/services/img/police-1916",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 304
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/police-1916-directed-by-charlie-chaplin",
      "id": "police-1916-directed-by-charlie-chaplin",
      "title": "Police (1916) Directed By Charlie Chaplin",
      "description": "Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Edna Purviance Wesley Ruggles James T. Kelley Leo White John Rand Fred Goodwins Billy Armstrong Snub Pollard Bud Jamison Paddy McGuire George Cleethorpe Cinematography Harry Ensign Production company Essanay Studios Distributed by General Film Company Release date May 27, 1916 Running time 34 minutes Country United States Language Silent (English intertitles ) Police is Charlie Chaplin 's 14th film with Essanay Studios and was released in 1916. It was made at the Majestic Studio in Los Angeles . Charlie plays an ex-convict who finds life on the outside not to his liking and leads him to breaking into a home with another thief (Wesley Ruggles). Edna Purviance plays the girl living in the home who tries to change him. Synopsis Charlie is released from prison and is immediately approached by a man who claims to be a church pastor ( Billy Armstrong ) who'll help him go straight. In reality, however, he's a scammer who frequently does disguises and swindles many other innocent people, including a drunk ( James T. Kelley ) who seems to be in little possession of his faculties. At first Charlie remains nonchalant, not wanting to take any chances, especially not when he was just out of prison. However, the man, a skilled actor, goads him to cry. Charlie breaks out into tears stemming from regret for \"doing it against Jesus\". Of course, the man takes advantage of the situation and slips out the five dollar note Charlie has been given upon being discharged, leaving him penniless. Now broke, Charlie goes to a fruit shop and starts biting into all the fruits there. He knows he has to pay for them all in the end, but, unaware that he has been swindled by the fake church pastor, eats more and more until the fruitseller ( Leo White ) becomes visibly angry. Charlie tells him to calm down, \"I'll pay for it.\" He searches his pockets for the money, but, unfortunately, cannot find it. This angers the man, who by now has decided he'll get the money, even if it took him a month of Sundays. Charlie, realizing that he's not in a very good situation, runs away. He is approached by the fake church pastor again, this time in a clean-shaven disguise. Charlie looks at him, and recognizes him right away. When this man starts suggesting that he help him go straight, Charlie realizes that this man is a fraud and fights him. In no mood for a fight, the man starts running, but Charlie follows suit, to scare this man a bit. Unfortunately, a nearby constable ( Fred Goodwins ) sees Charlie chasing this seemingly well-wishing man, and joins the chase after thinking that Charlie means the man harm. Charlie stops a while after, obviously; however, he sees the policeman on his trail. Another chase begins, except this time Charlie is the chased. After a long span of running, Charlie is tired. He decides to watch a film in the nearby cinema hall. A man ( Paddy McGuire ) stands in front of him, obstructing his way to the hall. Charlie tries to cut in front of him, however, the man shoves him back. \"Get in line and wait for your turn.\" A mild fight ensues. In the middle of it, guests start piling into the hall, cutting ahead in line. However, this seemingly righteous man does not seem aware of it, him fighting with Charlie and all that. When he does shift his attention back, everybody has gone in, and therefore, he is suspicious of nothing. Eventually, Charlie does cut ahead of him and walk in. Unfortunately, upon entering, Charlie realizes that the fruitseller from earlier also was the ticket keeper of this cinema hall. He hopes to slip by; however, the shopkeeper recognizes him, and demands money for the ticket as well as the groceries. When Charlie fails to pay off either, he gets kicked out of the cinema hall in a hilarious slapstick way. While walking back, Charlie meets his cell-mate ( Wesley Ruggles ), who's also been discharged. He convinces Charlie to help him burglarize a house. Broke, and vulnerable, Charlie agrees. Unbeknownst to them, however, a cop in his rounds ( John Rand ), is watching their every move, and has gotten to know of their burgling plans. They decide to rob the house nearest. However, complications arise as they start having trouble breaking into the house. They can't seem to break in - it's just too difficult. Things get worse when the cop spying on them walks in on them, catching them red-handed, and their time seems to be up. Charlie, however, comes up with a plan. He asks him for a hammer, and when he's given the same, he knocks the policeman down unconscious. Then, he proceeds to simply open the front door, as more of a last resort than anything. They enter with great caution. However, Charlie, clumsy as he is, bungles the entire operation up by collapsing the many glass plates and glasses, which shatter with deafening noise. Edna, who lives in the house that is being robbed, comes down to investigate. She is scared stiff, however, when she sees the duo robbing the place. Once she regains full possession of her faculties, she steadily slithers up to the telephone and calls the police. Barely a few seconds after, however, Charlie's cell-mate finds her, and has been left with no choice but to hold her at gunpoint. She admonishes him with a fib that her mother is very ill and she'd die of the shock they might induce. Charlie and his companion believe her, and have lunch with her. However, during lunch, Edna notices Charlie's behaviour and table manners. She's so taken with said manners that, by the time the police arrive to investigate the crime, she lies to them, stating that Charlie is her husband, and that Charlie's cellmate is the actual criminal. The police believe her, and laugh and joke with him. Once his former cellmate is arrested, she gives Charlie a dollar and sends him happily on his way. Barely a few steps later, however, Charlie soon encounters the same nosy policeman from earlier, who recognizes him. Another chase begins. Cast Charlie Chaplin as Charlie, Convict 999 Edna Purviance as Daughter of the Houseowners Wesley Ruggles as Jailbird and Thief James T. Kelley as Drunk with Pockets Picked/Second Flophouse Customer Leo White as Fruitseller/Flop House Manager/Policeman John Rand as Nosy Policeman Fred Goodwins as Honest Preacher/Policeman with Monocle Billy Armstrong as Crooked Preacher/Second Cop Snub Pollard as Cop Bud Jamison as Third Flophouse Customer Paddy McGuire as Fifth Flophouse Customer George Cleethorpe as Policeman at Station with Mustache Review Reviewer Oscar Cooper wrote in Motion Picture News, \"Those who believe that Chaplin's abilities are limited to the mallet, the kick and the spinal curvature walk, should see this picture. They will be disillusioned. They will see a touch of heart interest just at the end of the subject, and they will see that Charlie's stock pantomime includes pathos as well as fooling. But of course, the picture is mainly clever horseplay, beginning with Charlie's exit from prison, and ending with his flight from a policeman.\" From Wikipedia, the free encyclopedia",
      "fileSize": 811025725,
      "addedAt": "2026-01-07T00:10:21.537Z",
      "thumbnail": "https://archive.org/services/img/police-1916-directed-by-charlie-chaplin",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 264
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-police",
      "id": "silent-police",
      "title": "Police",
      "fileSize": 5152048882,
      "addedAt": "2026-01-07T00:11:15.971Z",
      "thumbnail": "https://archive.org/services/img/silent-police",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 497
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/vidpol",
      "id": "vidpol",
      "title": "Charlie Chaplin's \"Police\" (1916)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Police\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin      Starring                     Charlie Chaplin, Edna Purviance, Wesley Ruggles Cinematography        Harry Ensign Distributed by           General Film Company Release date               May 27, 1916 Running time             26 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 302415255,
      "addedAt": "2026-01-07T00:12:55.134Z",
      "thumbnail": "https://archive.org/services/img/vidpol",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 12664
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "34 min",
    "imdbRating": 6.4,
    "imdbVotes": 2047,
    "Genre": "Comedy, Short",
    "Plot": "Charles Chaplin, a convict, is given $5.00 and released from prison after having served his term. He meets a man of the church who makes him weep for his sins and while he is weeping takes the $5.00 away from him. Chaplin goes to a fruit stand and samples the fruit. When he goes to pay for it he finds his $5.00 is missing. This results in a battle with the fruit dealer, but Chaplin finally escapes. He is held up by a footpad and finds it is his former cellmate. He is inveigled into joining him in robbing a house. They put a police officer out of commission with a mallet and stack up the silverware. They then start upstairs to search the upper rooms, but are met by a young woman who implores them to leave because her mother is ill and fears the shock will kill her. Chaplin's heart is touched but the footpad insists on ransacking the house. This results in a battle between the footpad and Chaplin. While they are fighting, a squad of police arrives. The footpad makes his escape, but the police capture Chaplin. The woman of the house, however, saves him by telling the police he is her husband. She gives him a dollar and he leaves. He goes to a lodging house and in order to save his dollar from thieves puts it in his mouth, swallowing it while he sleeps. A crook robs all the men in the lodging house but Chaplin takes the money away from him, and also the rings his \"pal\" had stolen. This starts a battle in which all join. Chaplin flees. In order to do a good turn to the woman who had saved him from the police, he takes her rings back.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Edna Purviance, Wesley Ruggles",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006414",
    "tt0006684",
    "tt0006548",
    "tt0006689",
    "tt0007507",
    "tt0007264",
    "tt0004936",
    "tt0005571",
    "tt0008133",
    "tt0007613",
    "tt0007832",
    "tt0007880"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.134Z"
}