{
  "movieId": "tt0037599",
  "title": "The Cisco Kid in Old New Mexico",
  "year": 1945,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dvsm3Cd9y9c",
      "id": "dvsm3Cd9y9c",
      "title": "In Old New Mexico (1945) THE CISCO KID🍕 DUNCAN RENALDO",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Duncan Renaldo, Martin Garralaga, Gwen Kenyon\nDirector: Phil Rosen\n\nThe Cisco Kid and Pancho hold up a stagecoach and kidnap Ellen Roth. They take the girl, who is wanted on a murder charge, to the mission where Padre Angelo will look after her. \n\nTRIVIA: The Cisco Kid is a fictional character created by O. Henry for his short story \"The Caballero's Way,\" first published in 1907. Four actors portrayed this Western hero in 25 films during the sound era. In 1928, the first all-talking western starred Warner Baxter as the Cisco Kid, followed by Cesar Romero, Duncan Renaldo, and Gilbert Roland.\n\n🍕Are you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "addedAt": "2025-12-24T01:05:51.753Z",
      "thumbnail": "https://i.ytimg.com/vi/dvsm3Cd9y9c/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC5fINRYL_pGaV6NgCYb9-w-ke0qA",
      "duration": 3783,
      "language": "en",
      "year": 1945,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": 6,
    "imdbVotes": 44,
    "Genre": "Drama, Western",
    "Plot": "The Cisco Kid and Pancho hold up a stagecoach and kidnap Ellen Roth. They take the girl, who is wanted on a murder charge, to the mission where Padre Angelo will look after her. She tells Cisco of a mysterious Doctor Willis who called on an aged woman she had been nursing and gave her an overdose of sleeping pills. Convinced that Ellen is innocent, Cisco sets out to prove it. He goes to Bill Hastings where he makes a deal to turn Ellen in if Cisco gets part of the money Hastings will inherit when she is convicted. With Ellen safely in jail, Cisco and Pancho force the local newspaper to run a story saying that Doc Willis has been apprehended. Hastings makes another deal with Cisco to kill Ellen before she testifies against Doc.",
    "Director": "Phil Rosen",
    "Writer": "Betty Burbridge, O. Henry",
    "Actors": "Duncan Renaldo, Martin Garralaga, Gwen Kenyon",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037600",
    "tt0032959",
    "tt0023344",
    "tt0038552",
    "tt0039771",
    "tt0037535",
    "tt0037728",
    "tt0038107",
    "tt0038212",
    "tt0037969",
    "tt0038106",
    "tt0036835"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:35:51.768Z"
}