{
  "movieId": "tt0063790",
  "title": "Voyage to the Planet of Prehistoric Women",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/VoyagetothePlanetofPrehistoricWomen",
      "id": "VoyagetothePlanetofPrehistoricWomen",
      "title": "Voyage to the Planet of Prehistoric Women",
      "description": "A team of astronauts crashes on the surface of Venus. Accompanied by their robot, they explore the surface and end up destroying the Venusian God. This film is also known as \"The Gill Women\" and \"The Gill Women of Venus\". This film began life as a Soviet-produced work. An American producer then added some new footage and changed the credits to hide the film's Soviet origin. The original film, \"Planeta Bur\", is also known as \"Cosmonauts on Venus\", \"Planet of Storms\", \"Planet of Tempests\", \"Planeta Burg\", and \"Storm Planet\". Much of the film \"Planeta Bur\" was also incorporated into the \"American\" film \"Voyage to the Prehistoric Planet\" . This film was shown in \"Pathe\" color, which is essentially just a method of placing color filters over a black and white film. Consequently, the color that you see is not the true color of the sets but instead represents an \"interpretation\" of a black and white original. This film can be downloaded as a Theora file. The file size is approximately 25% larger than the MPEG-2, with similar quality. Simply click on this link . You can find more information regarding this film on its IMDb page . More information is also available from the Wikipedia article here .",
      "fileSize": 5686313249,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/VoyagetothePlanetofPrehistoricWomen",
      "language": "English",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 1133068
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/VoyageToThePlanetOfPrehistoricWomen1968FullMovie",
      "id": "VoyageToThePlanetOfPrehistoricWomen1968FullMovie",
      "title": "Voyage To The Planet Of Prehistoric Women",
      "description": "Astronauts encounter monsters and beautiful women after their spaceship crashes on Venus.",
      "fileSize": 676270374,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/VoyageToThePlanetOfPrehistoricWomen1968FullMovie",
      "language": "eng",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 10437
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/VoyageToThePlanetOfPrehistoricWomen_20130813",
      "id": "VoyageToThePlanetOfPrehistoricWomen_20130813",
      "title": "Voyage To The Planet Of Prehistoric Women",
      "description": "\"Voyage to the Planet of the Prehistoric Women\" (1968) is the second of two reworkings of \"Planeta Bur,\" a Soviet sci-fi film from 1959. The first was the similarly titled, \"Voyage to the Prehistoric Planet\" (1962) assembled by director Curtis Harrington for producer Roger Corman. \"Voyage to the Planet of the Prehistoric Women\" was confabulated by Peter Bogdanovich using the pseudonym, Derek Thomas. Working under the dictum that American International would buy \"Planet\" if it had some women in it, he inserted new footage featuring Mamie Van Doren, a bevy of nubile cuties in white hot pants, and additional scenes from the Americanized version of another Soviet film, \"Nebo Zovet,\" (\"The Heavens Beckon\") from 1962. This film has been knocking around for years in a horribly faded version. I've attempted to upgrade it by reconstructing it from the best publicly available sources. First of all, I need to disavow the bizarre story that Pathecolor was some sort of tinting process. Pathecolor was a variant of Eastmancolor (Kodak), and was capable of stunning color. The stylish Poe adaptions by Roger Corman come to mind. Unfortunately, Eastmancolor has proven to be quite unstable over the years, losing density in its yellow and cyan layers until nothing exists but a washed out magenta. The 16mm print used for the generally available transfer, is a prime example of color fading, and of a misguided attempt to equalize its color by adding cyan. The original \"Planeta Bur\" was probably filmed in Sovcolor (really Agfacolor from the World War II era). Though not capable of the range, subtlety or consistency of Eastmancolor, it did have a pleasing and vibrant color pallet of its own. So here is a by no means perfect, but hopefully, much better presentation of \"Voyage to the Planet of Prehistoric Women.\" Thanx and a tip o' the hat to Peter Bogdanovich, Roger Corman, Pavel Klushantsev, Mamie Van Doren, Filmgroup (for not copyrighting it!) and Robot John.",
      "fileSize": 3859707749,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/VoyageToThePlanetOfPrehistoricWomen_20130813",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 188917
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/voyage-to-the-planet-of-prehistoric-women-1968_202309",
      "id": "voyage-to-the-planet-of-prehistoric-women-1968_202309",
      "title": "Voyage to the Planet of Prehistoric Women (1968)",
      "description": "A groups of astronauts crash-land on Venus and find themselves on the wrong side of a group of Venusian women when they kill a monster that is worshipped by them. Watch on RetroFlix:  https://retroflix.org/voyage-to-the-planet-of-prehistoric-women-1968/",
      "fileSize": 501222206,
      "addedAt": "2026-01-07T00:13:06.700Z",
      "thumbnail": "https://archive.org/services/img/voyage-to-the-planet-of-prehistoric-women-1968_202309",
      "language": "eng",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 895
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/VoyageToThePlanetOfPrehistoricWomen-WeirdnessBadMovie",
      "id": "VoyageToThePlanetOfPrehistoricWomen-WeirdnessBadMovie",
      "title": "Voyage to the Planet of Prehistoric Women - Weirdness Bad Movie",
      "description": "Public Access TV show \"Weirdness Really Bad Movie\" hosts public domain movies and ads clean comedy sketches enjoyable for the whole family. Today's film is the 1968 Roger Corman film, Voyage To The Prehistoric Planet Of Women.",
      "fileSize": 8534810735,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/VoyageToThePlanetOfPrehistoricWomen-WeirdnessBadMovie",
      "collection": "feature_films",
      "downloads": 19699
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "78 min",
    "imdbRating": 2.9,
    "imdbVotes": 2092,
    "Genre": "Adventure, Sci-Fi",
    "Plot": "In 1998, six months after the collision of a meteor and subsequent explosion of a rocket sent to Venus, the team composed by the astronauts Kern and Sherman with the robot John is launched to explore Venus. They arrive in the Space Station Texas for refueling but they have problems while landing in Venus. Without communication, another rocket is launched with Commander Brendan Lockhart, Andre Ferneau and Hans Walter to rescue the first team and explore the planet. They use a vehicle to seek Kern and Sherman, but they are attacked by a flying reptile. They kill the animal without knowing that it is worshiped and considered the God Terah by Venusians women that use their powerful connection with nature to destroy the invaders. Meanwhile John helps the two cosmonauts to survive in the hostile land.",
    "Director": "Peter Bogdanovich",
    "Writer": "Henry Ney",
    "Actors": "Mamie Van Doren, Mary Marr, Paige Lee",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0062360",
    "tt0064639",
    "tt0336004",
    "tt0064360",
    "tt0058859",
    "tt0059887",
    "tt0066955",
    "tt0059346",
    "tt0057860",
    "tt0068713",
    "tt0069426",
    "tt0006333"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:42:31.826Z"
}