{
  "imdbId": "tt0004555",
  "title": "Salomy Jane",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-salomy-jane",
      "title": "Salomy Jane",
      "id": "silent-salomy-jane"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": "5.9",
    "imdbVotes": "78",
    "Genre": "Crime, Drama, Western",
    "Plot": "The story opens with the arrival in Hangtown of Madison Clay and his daughter, Salomy Jane, who have emigrated all the way from Kentucky. Straightway the young men and bachelors of the camp fall desperately in love with Salomy Jane. Her preference at first is for Rufe. Almost simultaneously with Clay's arrival the \"Man\" comes to Hangtown via the overland stage coach. He finds his way to the town bar and there recognizes Baldwin, who before coming west, had betrayed the \"Man's\" sister. The \"Man\" following comes upon him just in time to save Salomy from his insult. They grapple, but Baldwin breaks away and runs through the woods to his cabin where he begins packing with intent of leaving the community. Meantime Salomy. outraged at the insults of Baldwin, offers to marry Rufe on condition he kills him. Rufe demurs, but, passing Baldwin's cabin a short while afterward, hears noise of a fight inside and looking through the window sees the \"Man\" kill Baldwin. Remembering Salomy's promise, Rufe tells her that the crime is his, whereupon they become engaged. While this has been happening. Red Pete Heath, a worthless inhabitant of Hangtown, and a partner hold up the stage, wounding Yuba Bill, the driver. This crime, together with the murder of Baldwin, occasions a meeting of the vigilantes, who begin to scour the countryside for the offenders. At the same time these guardians of the law are given another source of worry. A letter from a kinsman has advised Larabee that there is a blood feud between his and Clay's family. The two antagonists meet and each declare that he will kill the other. In the midst of this excitement Salomy meets the \"Man\" on the road. She thinks at first that he may be one of the robbers. He however disabuses her in this respect, but admits that it was he who killed Baldwin. She brings the \"Man\" provisions and bids him good-bye with obvious reluctance. Then, acquainted with Rufe's deceit, she breaks her engagement with him. With the booty taken by Red Pete from the stage was a bracelet which falls into the hands of his little girl. She in turn gives it to Salomy. Yuba Bill sees it, recognizes it; thus the responsibility of the hold-up is fixed. In the chase that ensues Red Pete is taken after a sensational tumble over a cliff and his partner killed. Meanwhile one party of vigilantes have taken the \"Man.\" thinking him Red Pete's accomplice. Red Pete's word and the report that the real accomplice has been killed, rights this mistake and the vigilantes are on the point of releasing the \"Man,\" when Rufe declares him Baldwin's murderer. It is decided to hang him alongside Red Pete. Red Pete's wife bids him a tearful farewell. When it is asked if there is anyone to tell the stranger good-bye. Salomy embraces and kisses him. The Man\" makes his escape a little later and returns to Salomy, who, to protect him from Rufe. disguises him in her father's hat and coat. Larabee. seeing him thus dressed, mistakes him for Clay and shoots at him. The bullet hits the brim of the stranger's hat. The \"Man,\" in his turn, shoots and kills Larabee. Clay is suspected of this crime. He is forewarned by Starbottle. Thinking that Salomy has killed his enemy, the father assumes the guilt, saddles his horse and rides away. Meanwhile Salomy has joined the man and the two of them make their escape after a sensational fight, including a ride down the river on a log. Hangtown left far behind. Madison Clay meets his daughter and her lover. The whole tangle is explained away by the \"Man's\" admission that he killed Larabee. Thus reconciled to Salomy, the father finds another horse that the three may ride toward a new home. The stranger and Salomy ride together.",
    "Director": "Lucius Henderson, William Nigh",
    "Writer": "Paul Armstrong, Bret Harte",
    "Actors": "Beatriz Michelena, House Peters, William Pike",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0003643",
      "title": "The Avenging Conscience: or 'Thou Shalt Not Kill'",
      "year": 1914,
      "imdbRating": "6.4",
      "imdbVotes": "1,502",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042313",
      "title": "The Capture",
      "year": 1950,
      "imdbRating": "5.9",
      "imdbVotes": "680",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt12974634",
      "title": "Mexican Moon",
      "year": 2021,
      "imdbRating": "5.5",
      "imdbVotes": "2,192",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0054292",
      "title": "Sergeant Rutledge",
      "year": 1960,
      "imdbRating": "7.4",
      "imdbVotes": "5,666",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003952",
      "title": "Fantômas: The False Magistrate",
      "year": 1914,
      "imdbRating": "6.7",
      "imdbVotes": "1,231",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040978",
      "title": "Yellow Sky",
      "year": 1948,
      "imdbRating": "7.4",
      "imdbVotes": "5,936",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0060084",
      "title": "A Few Dollars for Django",
      "year": 1966,
      "imdbRating": "5.5",
      "imdbVotes": "514",
      "language": "Italian",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0004209",
      "title": "The Last of the Line",
      "year": 1914,
      "imdbRating": "6.4",
      "imdbVotes": "136",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0173837",
      "title": "Filibus",
      "year": 1915,
      "imdbRating": "6.5",
      "imdbVotes": "431",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004872",
      "title": "Alias Jimmy Valentine",
      "year": 1915,
      "imdbRating": "6.6",
      "imdbVotes": "247",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002844",
      "title": "Fantômas: In the Shadow of the Guillotine",
      "year": 1913,
      "imdbRating": "6.9",
      "imdbVotes": "2,634",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003165",
      "title": "Fantômas: The Dead Man Who Killed",
      "year": 1913,
      "imdbRating": "6.9",
      "imdbVotes": "1,306",
      "language": "None, French",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}