{
  "imdbId": "tt0020697",
  "title": "The Blue Angel",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theblueangel1930",
      "id": "theblueangel1930",
      "title": "The Blue Angel",
      "description": "Immanuel Rath, an old bachelor, is a professor at the town's university. When he discovers that some of his pupils often go into a speakeasy, The Blue Angel, to visit a dancer, Lola Lola, he comes there to confront them. But he is attracted to Lola. The next night he comes again--and does not sleep at home. This causes trouble at work and his life takes a downward spiral. You can find out more about this movie on its IMDB page .",
      "fileSize": 2217616245,
      "addedAt": "2026-01-07T00:12:44.280Z",
      "thumbnail": "https://archive.org/services/img/theblueangel1930",
      "collection": "feature_films",
      "downloads": 129011
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "104 min",
    "imdbRating": 7.6,
    "imdbVotes": 17200,
    "Genre": "Drama, Music, Romance",
    "Plot": "Germany 1924. Middle aged Dr. Immanuel Rath is a stuffy literature professor at a boys' school. Most of his students don't much like him, often ridiculing him by sending him unflattering anonymous notes and drawings. Dr. Rath learns that many of his boys often frequent a cabaret called the Blue Angel, which he believes is corrupting their impressionable young minds. He heads to the Blue Angel himself to catch the boys in the act, shame them into not going again, but also to ask the headlining performer, anglophone Lola Lola, to cease and desist performing her show. Over several visits, Rath is able to catch the boys, but he himself starts to fall for Lola, and she seemingly with him. His infatuation with her threatens his teaching career. Their relationship ends up not being what either envisioned, the question being how they will both deal with their disintegrating relationship and the reasons behind that disintegration.",
    "Director": "Josef von Sternberg",
    "Writer": "Heinrich Mann, Carl Zuckmayer, Karl Vollmöller",
    "Actors": "Emil Jannings, Marlene Dietrich, Kurt Gerron",
    "Language": "German, English, French",
    "Country": "Germany",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    "tt0021156",
    "tt0021800",
    "tt0019071",
    "tt0019754",
    "tt0025746",
    "tt0020866",
    "tt0026276",
    "tt0021243",
    "tt0020446",
    "tt0023128",
    "tt0022698",
    "tt0023458"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.280Z"
}