{
  "movieId": "tt0052602",
  "title": "The Bat",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBat1960",
      "id": "TheBat1960",
      "title": "The Bat",
      "description": "Episode one of the series \"The Dow Hour Of Great Mysteries\" (31 Mar 1960) Kinescope recording of an elaborately staged television version of the often filmed 1922 Avery Hopwood and Mary Roberts Rinehart play \"The Bat\". Hosted by Joseph N Welch. Starring: Helen Hayes, Jason Robards Jr, Margaret Hamilton. A sinister criminal known as \"The Bat\" tries to find stolen securities hidden in the rambling mansion owned by the deceased owner of a bank and rented by spinster Cordelia Van Gorder. One of the archetypal \"Old House\" mysteries.",
      "fileSize": 1326549574,
      "addedAt": "2026-01-07T00:06:58.272Z",
      "thumbnail": "https://archive.org/services/img/TheBat1960",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 14053
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Bat.mpeg",
      "id": "The_Bat.mpeg",
      "title": "The Bat",
      "description": "A mystery writer starts being menaced by a serial killer known as \"The Bat\" after renting a house with a million dollars hidden in its walls. You can find out more about this movie on its IMDB page . An MP4 of the movie can be found here .",
      "fileSize": 3520279124,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Bat.mpeg",
      "language": "English",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 70970
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Bat_Vincent_Price",
      "id": "The_Bat_Vincent_Price",
      "title": "The Bat",
      "description": "Stars Vincent Price and Agnes Moorehead.",
      "fileSize": 2620687232,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Bat_Vincent_Price",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 89792
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Btyx4zkgHpg",
      "id": "Btyx4zkgHpg",
      "title": "The Bat (1959) [Horror] [Thriller] [Mystery]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"The Bat\" is a mystery film directed by Crane Wilbur. The film's tagline was \"When it flies, someone dies!\" The film was based on the 1920 Broadway play \"The Bat by Avery Hopwood\" and Mary Roberts \"Rinehart\", which was previously filmed as \"The Bat\" (1926) and as \"The Bat Whispers\" (1930), both directed by Roland West. \n\nCornelia Van Gorder (Agnes Moorehead) is a mystery author who lives in a town terrorized by a mysterious murderer known only as \"The Bat\". The Bat is said to be a man with no face who murders women at night by ripping out their throats with steel claws. Early in the film, The Bat enters Van Gorder's house and releases a bat, which bites van Gorder's maid Lizzy (Lenita Lane). With Lizzy in a panic, fearing she may now have contracted \"the rabies\", an outbreak of which local papers have reported, Van Gorder calls her doctor, Dr Malcolm Wells (Vincent Price), who is conducting research on bats.\n\nMeanwhile, the whole town is searching for a million-dollar stash of looted bank securities that were recently stolen. Dr. Wells discovers the location of the treasure when the thief confides in him. Wells then murders the thief in cold blood, presumably so that he can take the treasure for himself, which he believes to be hidden in van Gorder's house.\n\nA series of break-ins and murders by The Bat brings the local chief of detectives, Andy Anderson (Gavin Gordon) to the Van Gorder house. The Bat then murders two people in the Van Gorder house, Mark Fleming (John Bryant) and Judy Hollander (Darla Hood). Anderson attempts to determine the identity of The Bat, suspecting both Wells and Van Gorder's new butler, Warner (John Sutton). Wells is removed from suspicion, however, when he is murdered by The Bat in his lab.\n\nMiss Van Gorder cleverly manages to capture The Bat inside the secret room in her house. The Bat shoots a detective named Davenport (Robert Williams), he is then shot by Warner. Warner unmasks The Bat and he is revealed to be Lieutenant Anderson.\n\n---\n\nDirected by Crane Wilbur, produced by C.J. Tevlin, written by Avery Hopwood, Mary Roberts Rinehart and Crane Wilbur, starring Vincent Price, Agnes Moorehead, Gavin Gordon, John Sutton, Lenita Lane, Elaine Edwards, Darla Hood, John Bryant and Harvey Stephens.\n\n---\n\nSource: \"The Bat (1959 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 14 March 2013. Web. 16 August 2013. http://en.wikipedia.org/wiki/The_Bat_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:09.200Z",
      "thumbnail": "https://i.ytimg.com/vi/Btyx4zkgHpg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLApaok90LFr5tBU-ns7co5B4gXMzw",
      "duration": 4778,
      "language": "en",
      "year": 1959,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=miM1-EXwwAs",
      "id": "miM1-EXwwAs",
      "title": "The Bat (1959) | Colorized Public Domain Mystery Thriller with Vincent Price and Agnes Moorehead",
      "description": "The Bat (1959) is an American mystery thriller directed by Crane Wilbur, based on the classic stage play The Bat by Mary Roberts Rinehart and Avery Hopwood. This adaptation stars Vincent Price and Agnes Moorehead, bringing together two of Hollywood’s most iconic talents in a chilling tale of murder, greed, and fear. With its atmospheric setting, masked killer, and suspense-driven narrative, the film combines elements of gothic horror and whodunit mystery. This restored and colorized edition offers a vivid new way to experience a cult classic that has captivated audiences for decades, especially in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story takes place in a small town plagued by rumors of a master criminal known only as “The Bat,” a mysterious killer responsible for a string of unsolved murders. The setting is the mansion of Cornelia Van Gorder (Agnes Moorehead), a wealthy mystery novelist who has rented the estate for the summer. The mansion was once owned by a banker involved in embezzling a large fortune before his untimely death. Hidden somewhere within the walls is the missing fortune, and multiple characters have their own motives for wanting to find it.\n\nDr. Malcolm Wells (Vincent Price), a respected local physician, becomes entangled in the mystery when he learns of the hidden wealth. His intentions, however, remain unclear—does he seek to recover the money, or is he somehow linked to the masked killer terrorizing the town? As night falls on the mansion, a series of terrifying encounters unfolds. Windows shatter, masked intrusions occur, and the identity of “The Bat” remains unknown until the shocking climax reveals betrayal, greed, and violence in equal measure.\n\nCast and Crew:\n• Director: Crane Wilbur\n• Producer: C.J. Frankovich\n• Screenplay: Crane Wilbur, based on the play The Bat by Mary Roberts Rinehart and Avery Hopwood\n• Cinematography: Joseph F. Biroc\n• Editing: Harry W. Gerstad\n\nStarring:\n• Vincent Price as Dr. Malcolm Wells\n• Agnes Moorehead as Cornelia Van Gorder\n• Gavin Gordon as Lt. Andy Anderson\n• John Sutton as Warner\n• Darla Hood as Judy Hollander\n• Elaine Edwards as Dale Bailey\n• Harvey Stephens as John Fleming\n\nFilm Significance:\nThe Bat (1959) is a remake of earlier versions from 1926 and 1930, both adapted from the wildly popular Broadway play that influenced generations of mystery and horror films. The play itself pioneered the “old dark house” genre, combining locked-room mysteries with horror imagery. This 1959 version distinguished itself by its casting of Vincent Price, whose magnetic presence brought gravitas to the story, and Agnes Moorehead, best known later for her role in Bewitched, who anchored the film with intelligence and wit.\n\nProduced during the late 1950s, the movie reflects the transitional period of American cinema when gothic horrors and crime thrillers merged. With its masked villain, atmospheric mansion, and psychological suspense, The Bat influenced future slasher films and remains an enduring example of mid-century horror mystery. Its public domain status has made it widely available, ensuring that Vincent Price’s performance continues to reach new generations of fans.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, meaning it is free from copyright restrictions and can be legally shared, studied, and preserved. At Colorized Public Domain, we restore and colorize classic films like The Bat to bring out their visual depth and dramatic tension. The original black-and-white release relied heavily on shadow play, candlelit interiors, and stormy night settings. In our colorized edition, these elements are revitalized, immersing modern audiences in the suspenseful mansion environment while honoring the film’s gothic tone.\n\nWhy Watch This Colorized Edition:\nWhile the original black-and-white release carries undeniable historical value, many modern audiences overlook older films due to their monochrome visuals. This colorized edition enhances the eerie mansion, the mysterious masked intruder, and the gothic atmosphere of the night scenes, creating a more engaging experience for contemporary viewers. It bridges the gap between vintage authenticity and modern cinematic appeal, making it perfect for horror enthusiasts, mystery fans, and first-time classic film viewers alike.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films weekly, covering horror, sci-fi, drama, westerns, and forgotten gems from Hollywood’s Golden Age. Our goal is to preserve and enhance these films for audiences in the USA, Europe, and across the globe.\n\n#TheBat1959 #VincentPrice #AgnesMoorehead #PublicDomainMovie #ColorizedClassic #1950sMystery #GothicThriller #ClassicCinema #FilmRestoration #1959Movies #MaskedKiller #SlasherOrigins #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:50:20.406Z",
      "thumbnail": "https://i.ytimg.com/vi/miM1-EXwwAs/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBfKCYwDw==&rs=AOn4CLD1b8cF_ifMKOreJf2Qpa_LRT3ttw",
      "duration": 4734,
      "language": "en",
      "year": 1959,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-bat-1959",
      "id": "the-bat-1959",
      "title": "The Bat (1959)",
      "description": "Mystery writer Cornelia Van Gorder has rented a country house called \"The Oaks\", which not long ago was the scene of some murders committed by a strange and violent criminal known as \"The Bat\". Meanwhile, the house's owner, bank president John Fleming, has recently embezzled one million dollars in securities and has hidden the proceeds in the house, but is killed before he can retrieve it. Watch on RetroFlix:  https://retroflix.org/the-bat-1959/",
      "fileSize": 471297540,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-bat-1959",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 300
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-bat-1959-bd-mkv",
      "id": "the-bat-1959-bd-mkv",
      "title": "The Bat (1959) BD MKV",
      "description": "Blu-ray remux of the 1959 Liberty Pictures film \"The Bat.\" (Note: this version is cropped to a 16:9 aspect ratio from the original 4:3 aspect ratio.) IMDb TMDB Wikipedia The Bat is a 1959 American crime-mystery thriller starring Vincent Price and Agnes Moorehead. It is the fourth film adaptation of the story, which began as a 1908 novel The Circular Staircase by Mary Roberts Rinehart, which she later adapted (with Avery Hopwood) into the 1920 play The Bat. The first film version of the play was the 1926 American silent film The Bat. The film version was adapted by playwright Crane Wilbur, who also directed. The Bat was distributed in 1959 on a double bill with the British Hammer film The Mummy. Now in the public domain, The Bat is available for online download.",
      "fileSize": 20007492783,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-bat-1959-bd-mkv",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 130
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-bat-1959-dvd-mkv",
      "id": "the-bat-1959-dvd-mkv",
      "title": "The Bat (1959) DVD MKV",
      "description": "PAL DVD remux of the 1959 Liberty Pictures film \"The Bat.\" (In the original 4:3 aspect ratio.) IMDb TMDB Wikipedia The Bat is a 1959 American crime-mystery thriller starring Vincent Price and Agnes Moorehead. It is the fourth film adaptation of the story, which began as a 1908 novel The Circular Staircase by Mary Roberts Rinehart, which she later adapted (with Avery Hopwood) into the 1920 play The Bat. The first film version of the play was the 1926 American silent film The Bat. The film version was adapted by playwright Crane Wilbur, who also directed. The Bat was distributed in 1959 on a double bill with the British Hammer film The Mummy. Now in the public domain, The Bat is available for online download.",
      "fileSize": 3990239003,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-bat-1959-dvd-mkv",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 153
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-bat-1959_202510",
      "id": "the-bat-1959_202510",
      "title": "The Bat (1959)",
      "description": "The Bat is a 1959 American crime-mystery thriller starring Vincent Price and Agnes Moorehead. In the film,  mystery author Cornelia Van Gorder rents a mansion where a faceless killer known as \"the Bat\" is on the loose, murdering women with steel claws. As bodies pile up, Van Gorder teams up with a local doctor and a police detective to uncover the truth behind the murders and a missing fortune hidden in the house.",
      "fileSize": 1434360440,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-bat-1959_202510",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 105
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Zt1HaOM9LiE",
      "id": "Zt1HaOM9LiE",
      "title": "The Bat (1959) VINCENT PRICE🍕AGNES MOOREHEAD",
      "description": "Stars: Vincent Price, Agnes Moorehead, Gavin Gordon\nDirector/Writer: Crane Wilbur\n\nIn a creaky haunted house with a hidden fortune of stolen money, bodies pile up as a mysterious prowler known as \"the Bat\" tries to uncover the loot!",
      "addedAt": "2025-12-26T23:45:23.571Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Zt1HaOM9LiE/maxresdefault.webp",
      "duration": 4803,
      "language": "en",
      "year": 1959,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=td3OM8jbBJQ",
      "id": "td3OM8jbBJQ",
      "title": "The Bat (1959) Vincent Price, Agnes Moorehead | Horror, Mystery, Thriller | Full Movie",
      "description": "A crazed killer known as \"The Bat\" is on the loose in a mansion full of people.\n\nDirector: Crane Wilbur\nWriters: Crane Wilbur, Crane Wilbur \nStars: Vincent Price, Agnes Moorehead, Gavin Gordon\nGenres: Classics, Horror, Mystery, Thriller\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:52:01.787Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/td3OM8jbBJQ/maxresdefault.webp?v=642419f2",
      "duration": 4804,
      "language": "en",
      "year": 1959,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/THEBATVincentPriceAgnesMooreheadLenitaLaneFullHorrorMovieEnglishHD720p",
      "id": "THEBATVincentPriceAgnesMooreheadLenitaLaneFullHorrorMovieEnglishHD720p",
      "title": "THE BAT Vincent Price Agnes Moorehead Lenita Lane Full Horror Movie English HD 720p",
      "description": "A killer called \"the Bat\" has claimed many lives in the small town inhabited by novelist Cornelia van Gorder (Agnes Moorehead) and her maid, Lizzie (Lenita Lane). As Cornelia implores Dr. Malcolm Wells (Vincent Price) to help her ailing maid, $1 million in the town's bank goes missing. With greed an d fear reaching new heights, police Lt. Andy Anderson (Gavin Gordon) goes to Cornelia's house to investigate additional murders committed by the Bat.",
      "fileSize": 1149274291,
      "addedAt": "2026-01-07T00:06:58.270Z",
      "thumbnail": "https://archive.org/services/img/THEBATVincentPriceAgnesMooreheadLenitaLaneFullHorrorMovieEnglishHD720p",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 3097
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 6,
    "imdbVotes": 6482,
    "Genre": "Horror, Mystery, Thriller",
    "Plot": "Mystery writer Cornelia Van Gorder has rented a country house called \"The Oaks\", which not long ago had been the scene of some murders committed by a strange and violent criminal known as \"The Bat\". Meanwhile, the house's owner, bank president John Fleming, has recently embezzled one million dollars in securities, and has hidden the proceeds in the house, but he is killed before he can retrieve the money. Thus the lonely country house soon becomes the site of many mysterious and dangerous activities.",
    "Director": "Crane Wilbur",
    "Writer": "Crane Wilbur, Mary Roberts Rinehart, Avery Hopwood",
    "Actors": "Vincent Price, Agnes Moorehead, Gavin Gordon",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0053719",
    "tt0051569",
    "tt0051744",
    "tt0055470",
    "tt0055304",
    "tt0053337",
    "tt0024625",
    "tt0052609",
    "tt0073582",
    "tt0185371",
    "tt2364774",
    "tt0034985"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:30:24.962Z"
}