{
  "imdbId": "tt0014679",
  "title": "The Arab",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-movie_202008",
      "id": "my-movie_202008",
      "title": "\"The Arab\" (1924) starring Ramon Novarro",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Arab\" is a drama starring Ramon Novarro. When a Turkish governor plots to massacre a group of Christian children, the son of a Bedouin sheikh has the opportunity to save the day and win his American girlfriend. Directed by                    Rex Ingram Produced by                  Metro-Goldwyn Pictures Corporation Starring                          Ramon Novarro, Alice Terry, Max Maxudian, Jean de Limur, Paul Vermoyal, Adelqui Migliar, Florica Alexandresco, Jerrold Robertshaw, Justa Uribe Release date                   July 21, 1924 Running time                 58 minutes Country                          USA Language                        Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"",
      "fileSize": 76080491,
      "addedAt": "2026-01-07T00:09:54.333Z",
      "thumbnail": "https://archive.org/services/img/my-movie_202008",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 3127
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "70 min",
    "imdbRating": 6.8,
    "imdbVotes": 46,
    "Genre": "Drama, War",
    "Plot": "Jamil (Ramon Novarro) is a soldier in the Bedouin defence forces during a war between Syria and Turkey, who has deserted his regiment. In a remote village, he encounters an orphan asylum run by American missionaries Dr. Hilbert (Jerrold Robertshaw) and his daughter Mary (Alice Terry). The village is attacked by the Turks, and its ruler, eager to placate the invaders, intends to hand over the children for slaughter; he disguises his intents under a move to Damascus for their safety. The Bedouins arrive at the scene, and reveal that Jamil is the son of the tribal leader. With his father's revealed death, Jamil's he becomes the new leader of the tribe, which endows him with a sense of responsibility. Risking his own life, he proceeds to save the children, defeating the Turks and the local leader in the process (and winning the girl).",
    "Director": "Rex Ingram",
    "Writer": "Rex Ingram, Edgar Selwyn",
    "Actors": "Ramon Novarro, Alice Terry, Max Maxudian",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0012190",
    "tt0014440",
    "tt0017103",
    "tt0012068",
    "tt0019469",
    "tt0014672",
    "tt1452522",
    "tt0015624",
    "tt0016643",
    "tt0017540",
    "tt0013515",
    "tt0138507"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.333Z"
}