{
  "movieId": "tt0049014",
  "title": "The Black Tent",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-black-tent-1956",
      "id": "the-black-tent-1956",
      "title": "The Black Tent (1956)",
      "description": "During the British retreat through Libya, a British officer takes shelter with a group of Arab Bedouin. He marries the chief's daughter. Sometime later, his younger brother, who had believed him to be dead, is informed that he may be alive in Libya, prompting him to set out and search for him. Watch on RetroFlix:  https://retroflix.org/the-black-tent-1956/",
      "fileSize": 1409697304,
      "addedAt": "2026-01-07T00:11:46.533Z",
      "thumbnail": "https://archive.org/services/img/the-black-tent-1956",
      "language": "eng",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 107
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "83 min",
    "imdbRating": 5.5,
    "imdbVotes": 491,
    "Genre": "Drama, Romance, War",
    "Plot": "A few years after the end of WW2, Colonel Sir Charles Holland is summoned to the Foreign Office on a matter regarding his brother's wartime disappearance. Recently uncovered evidence points out to the fact that his brother, Captain David Holland, may still be alive somewhere in the Libyan desert. With a promise of unofficial help and local Libyan contacts from the Foreign Office, Colonel Holland sets-out for Tripoli. There, a contact man gives him a local guide to take him to a Bedouin camp in the desert where his brother was last seen. A three-day ride by camel brings Colonel Holland to the camp of Sheik Salem Ben Yussef and his tribe. Inviting the Colonel to enjoy the camp's hospitality, the Sheik initially denies having heard about Captain David Holland. However, after his daughter, Mabrouka Ben Yussef, secretly gives the Colonel papers that had belonged to Captain David Holland, the Colonel pesters the Sheik with a barrage of direct questions. Infuriated, the Sheik orders Colonel Holland to leave the camp. After leaving the camp, the Colonel has second thoughts and returns there to beg the Sheik to tell him the truth about his brother. The Sheik's daughter also begs her father to tell the Colonel about his bother's wartime fate. In flashback form, the wartime story of Captain David Holland, as told by the Sheik and corroborated by his lovely daughter, finally clarify the mystery of his disappearance.",
    "Director": "Brian Desmond Hurst",
    "Writer": "Robin Maugham, Bryan Forbes",
    "Actors": "Donald Sinden, Anthony Steel, Anna Maria Sandri",
    "Language": "German, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0046029",
    "tt0049783",
    "tt0049871",
    "tt0049934",
    "tt0050634",
    "tt0050379",
    "tt0047860",
    "tt0050204",
    "tt0050882",
    "tt0051476",
    "tt0052600",
    "tt0045793"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}