{
  "imdbId": "tt0016587",
  "title": "Alice the Fire Fighter",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/alice-the-fire-fighter-1926",
      "id": "alice-the-fire-fighter-1926",
      "title": "Alice the Fire Fighter (1926)",
      "description": "When the local hotel is found to be on fire, the firemen (all of them Julius the cat lookalikes), led by Fire Chief Alice, are called in. The residents are busy escaping the blaze while the cats get to work helping them out of the building and putting out the flames. When a feline tenant gets caught on the top floor, one of the firemen bravely saves her by riding a smoke cloud up to reach her, but when they get back to the ground, he finds her expiring from smoke inhalation. He saves the day by rolling the smoke out of her with a rolling pin, and when she revives the two fall instantly in love. Watch on RetroFlix:  https://retroflix.org/alice-the-fire-fighter-1926/",
      "fileSize": 70749792,
      "addedAt": "2026-01-07T00:07:24.998Z",
      "thumbnail": "https://archive.org/services/img/alice-the-fire-fighter-1926",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 64
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 4.8,
    "imdbVotes": 149,
    "Genre": "Animation, Short, Comedy",
    "Plot": "When the local hotel is found to be on fire, the firemen (all of them Julius the cat lookalikes), led by Fire Chief Alice, are called in. The residents are busy escaping the blaze while the cats get to work helping them out of the building and putting out the flames. When a feline tenant gets caught on the top floor, one of the firemen bravely saves her by riding a smoke cloud up to reach her, but when they get back to the ground, he finds her expiring from smoke inhalation. He saves the day by rolling the smoke out of her with a rolling pin, and when she revives the two fall instantly in love.",
    "Director": "Walt Disney",
    "Writer": "N/A",
    "Actors": "Margie Gay",
    "Language": "English, None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0016582",
    "tt0016585",
    "tt0016586",
    "tt0016590",
    "tt0016591",
    "tt0016593",
    "tt0015552",
    "tt0015555",
    "tt0015556",
    "tt0016583",
    "tt0015561",
    "tt0017610"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.998Z"
}