{
  "imdbId": "tt0052948",
  "title": "Journey to the Center of the Earth",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/journey-to-the-center-of-the-earth-1959_202506",
      "id": "journey-to-the-center-of-the-earth-1959_202506",
      "title": "Journey To The Center Of The Earth (1959) James Mason · Diane Baker",
      "description": "A Scottish geologist follows in the footsteps of a deceased Icelandic explorer to the center of the Earth: an expedition that confronts him and his companions with all sorts of dangers.  Based on a novel by Jules Verne, this utopian story is effectively staged with attention to detail. Lighthearted, exciting entertainment with plenty of witty ideas.. Adventure fun with nostalgic charm",
      "fileSize": 2242041271,
      "addedAt": "2026-01-07T00:09:15.997Z",
      "thumbnail": "https://archive.org/services/img/journey-to-the-center-of-the-earth-1959_202506",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 617
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/journey.to.the.-center.of.the.-earth.-1959",
      "id": "journey.to.the.-center.of.the.-earth.-1959",
      "title": "Journey to the Center of the Earth (1959)",
      "description": "Journey to the Center of the Earth is a science fiction adventure film directed by Henry Levin, based on Jules Verne's classic novel.The film follows Professor Oliver Lindenbrook (played by James Mason), a passionate geologist who discovers a mysterious mineral. He is determined to explore a volcano in Iceland that leads to the center of the Earth. Accompanying him on this perilous journey are his enthusiastic student, Alec McKuen (Pat Boone), and a guide named Hans (Peter Ronson).The trio descends into the volcano, facing a range of challenges, including treacherous terrain, subterranean oceans, prehistoric creatures, and other dangers. Along the way, they encounter various wonders and threats, such as giant lizards and hostile forces that attempt to thwart their expedition, notably a rival, Count Saknussemm (Arne Magnus). As they delve deeper, the explorers confront the limits of their endurance and bravery. The journey culminates in a thrilling escape as they find their way back to the surface through a volcanic eruption.Ultimately, the adventure not only reveals the wonders of the Earth’s interior but also strengthens the bonds between the characters. The film concludes with them emerging safely, enriched by their experiences and newfound knowledge.",
      "fileSize": 3373838179,
      "addedAt": "2026-01-07T00:09:15.997Z",
      "thumbnail": "https://archive.org/services/img/journey.to.the.-center.of.the.-earth.-1959",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 466
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "129 min",
    "imdbRating": 7,
    "imdbVotes": 20760,
    "Genre": "Adventure, Family, Fantasy",
    "Plot": "Edinburgh university professor Sir Oliver Lindenbrook believes he has found an very old message from a long lost scientist who may have found the way to journey to the center of the Earth. With his assistant, student Alec McKuen, he sets off for Iceland where an entrance in a volcanic range is to be found. They are soon joined by Carla Goetabaug, whose scientist-husband was recently murdered, and Icelander Hans Belker as they descend into the bowels of the Earth. There they will find fantastic creatures, exotic plants, the lost city of Atlantis and a foe who wants to keep knowledge of this underworld to himself.",
    "Director": "Henry Levin",
    "Writer": "Walter Reisch, Charles Brackett, Jules Verne",
    "Actors": "James Mason, Pat Boone, Arlene Dahl",
    "Language": "English, Swedish, French, Italian, Russian, Icelandic",
    "Country": "United States",
    "Awards": "Nominated for 3 Oscars. 4 nominations total"
  },
  "relatedMovies": [
    "tt0050084",
    "tt0056112",
    "tt0004873",
    "tt0089961",
    "tt0052782",
    "tt0004099",
    "tt0004457",
    "tt0015400",
    "tt0068190",
    "tt0290406",
    "tt0243462",
    "tt0146315"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.997Z"
}