{
  "imdbId": "tt0006614",
  "title": "The Dumb Girl of Portici",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-dumb-girl-of-portici",
      "title": "The Dumb Girl of Portici",
      "fileSize": 32112030191,
      "id": "silent-the-dumb-girl-of-portici"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "112 min",
    "imdbRating": 6.4,
    "imdbVotes": 273,
    "Genre": "Drama, History, Romance",
    "Plot": "In the beginning of the Seventeenth Century, the Spanish Viceroys who had been sent to rule Italy, grew rich from the heavy taxes imposed on the poverty-stricken people. From the Kingdom of Naples alone, Spain extorted an annual revenue of fifteen millions of dollars. A tax was placed on fish, flour, poultry, wine, milk, cheese and salt, making bare existence a bitter problem. Fenella, \"The Dumb Girl of Portici,\" as history describes her, was an unusually romantic character at this period. That she came of an unusual family is proven by the fact that her brother and guardian, Masaniello, although, only a poor fisherman, was able to sway the people that he reigned as king while the revolution was at its height. Unlike their neighbors, are the widow Rilla and her worthless brother, Pietro, who is in love with Fenella. A new tax is levied on fruit by the Duke d'Arcos, Viceroy of Naples. The people become embittered by this added burden and Masaniello is appealed to for advice. With the help of his friend, Don Francesco, he gives the people wise counsel. Conde, the Duke's younger son, reports their attitude, but the Duke laughs at Conde's tears. The elder brother, Alphonso, realizes the seriousness of the situation. Disguising as fishermen, he and Conde go to the Market Place to investigate. Here Alphonso first meets Fenella. The dumb girl, needing flour and not possessing sufficient money to pay for it and also meet the heavy flour tax, smuggles a bag of meal into the city by hiding it under her shawl. At the gate, a hole is accidentally torn in the bag. From this escapes a tiny stream of meal unnoticed by Fenella. The tax collector discovers the little trail of flour and soon the dumb girl is under arrest, threatened with fine or imprisonment. Masaniello and Pietro hurry to her assistance, but they have no money with which to pay the fine. Alphonso has watched the arrest of the girl and pays the fine, still keeping his disguise. Masaniello informs Alphonso that, if Fenella had been imprisoned, the government would have paid dearly. Alphonso cannot understand and Masaniello calls his people about him. Eagerly they proclaim him their leader and Masaniello then explains to the young stranger the unjustness of the Viceroy's laws and taxes. Fascinated by Fenella, Alphonso becomes a frequent visitor to the fishing village, neglecting Lady Elvira, his betrothed wife. Alphonso returns to the city, leaving the dumb girl weeping silently. Later, when Masaniello finds her clinging desperately to Alphonso's scarf the story is plain to him. Alphonso has been missed from the palace and Conde sets out in search of him. Having heard of the youth's infatuation for Fenella, the courtier goes at once to Masaniello's hut, where he learns what has happened. Knowing that Masaniello is leader of the people, Conde reports the affair to the duke, prophesying an uprising. The duke laughs at his fears, but is curious to see the girl who has turned his son's head. With Conde's help, the duke plans a trap for Fenella and she is thrown into prison. The Viceroy visits her there. When the dumb girl does not speak in answer to his questions, he thinks it is stubbornness and has her flogged. Masaniello finds his sister has gone and sacrifices everything in his search of her. When he gets behind in the rent, collectors take his furniture as payment. Rilla, the widowed sister of Pietro, in trying to stop them, is arrested and taken to jail. The shock kills Rilla's aged mother and Pietro makes a solemn vow to avenge her death. In spite of this oppression, the people assume a happier mood on the day of the wedding of Lady Elvira and Alphonso and throng into the Market Square in gala attire. Even the guards of the prison celebrate the wedding, enabling Fenella to make her escape. Returning home, Fenella meets the wedding party returning from the church and appeals to Lady Elvira for protection. Lady Elvira, seeing Alphonso's scarf in possession of the fishergirl, questions her and learns the truth. She orders that Fenella be conducted safely home, but Perrone, captain of the guard, intercepts and has the girl taken back to prison. The Viceroy foolishly celebrates the day by increasing the already onerous tax. The added tax is all the people need to incite them to madness. The duke, hearing of the disturbance, sends his soldiers led by Alphonso and Conde to quell the uprising and a fight ensues. The robbers, murderers and the scum of the city leave their hiding place to join the rioters. The first step toward freedom is the blowing up of the Custom House. Then the prison doors are opened and the prisoners, including Rilla and Fenella, are released. The mob, having burned everything in its path, march to the Viceroy's Palace. Fenella, discovering their intention, reaches there in advance and warns Alphonso. The duke takes advantage of her presence and showing her from the balcony of the palace, threatens her life if Masaniello does not quell the disturbance. Massaniello is forced to choose between his sister and the people and chooses the people, demanding their rights. When the mob breaks into the palace, Masaniello rescues Fenella and takes her home. The people proclaim Masaniello their leader and the dictator of all public affairs. Pietro plots with a bandit to get Masaniello out of the way. They give him a slow poison and as the drug gradually takes effect in his system Masaniello is more and more influenced by Pietro and gradually loses all control over the people. Under these conditions, it is a simple matter for a small party of the Duke's forces, under the leadership of Alphonso and Conde, to gather quietly in the secret passage-ways. At a given signal they attack the rioters, driving the wine-mad mob from the palace. Under the shock of the unexpected and disastrous attack, Masaniello regains his sanity. Recognizing in Alphonso his sister's betrayer, Masaniello makes a wild lunge at him, but Fenella has been watching them and it is into her heart that the blade plunges. Wild with grief her brother kills himself. And the broken-hearted Alphonso can only gather into his arms the dying body of the Dumb Girl of Portici.",
    "Director": "Phillips Smalley, Lois Weber",
    "Writer": "Lois Weber, Daniel-François Auber, Germain Delavigne",
    "Actors": "Anna Pavlova, Rupert Julian, Laura Oakley",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0005460",
      "title": "Hearts in Exile",
      "year": 1915,
      "imdbRating": 5.5,
      "imdbVotes": 73,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007558",
      "title": "Where Are My Children?",
      "year": 1916,
      "imdbRating": 6.3,
      "imdbVotes": 885,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027727",
      "title": "Hearts in Bondage",
      "year": 1936,
      "imdbRating": 5.6,
      "imdbVotes": 245,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0035294",
      "title": "Schicksal",
      "year": 1942,
      "imdbRating": 7.5,
      "imdbVotes": 23,
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0322124",
      "title": "East Is East",
      "year": 1916,
      "imdbRating": 6.1,
      "imdbVotes": 68,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006826",
      "title": "Hoodoo Ann",
      "year": 1916,
      "imdbRating": 5.9,
      "imdbVotes": 903,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006864",
      "title": "Intolerance",
      "year": 1916,
      "imdbRating": 7.7,
      "imdbVotes": 17618,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012532",
      "title": "Orphans of the Storm",
      "year": 1921,
      "imdbRating": 7.3,
      "imdbVotes": 5577,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014854",
      "title": "Dorothy Vernon of Haddon Hall",
      "year": 1924,
      "imdbRating": 6.8,
      "imdbVotes": 186,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015022",
      "title": "Janice Meredith",
      "year": 1924,
      "imdbRating": 5.5,
      "imdbVotes": 725,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030675",
      "title": "The Return of the Scarlet Pimpernel",
      "year": 1937,
      "imdbRating": 5.6,
      "imdbVotes": 354,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034272",
      "title": "That Hamilton Woman",
      "year": 1941,
      "imdbRating": 7.2,
      "imdbVotes": 5180,
      "language": "English, French, Italian",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}