{
  "imdbId": "tt0021331",
  "title": "The Blood of a Poet",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/le-sang-dun-poete-jean-cocteau-1930",
      "id": "le-sang-dun-poete-jean-cocteau-1930",
      "title": "Le Sang d'un Poète ☆ Jean Cocteau ☆ 1930",
      "description": "Le Sang d'un Poète ☆ Jean Cocteau ☆ 1930 Le Sang d'un poète est un film français surréaliste réalisé par Jean Cocteau en 1930. Synopsis: Le film se décompose en quatre parties : Première partie : Une cheminée d'usine s'apprête à tomber. Durant ce temps, dans la chambre d'un poète, une statue sans bras s'anime brusquement. Cette dernière l'invite à plonger dans un miroir et de découvrir un autre monde. Des lieux et des personnages étranges s'offrent à lui : un couloir d'hôtel borgne, une fumerie d'opium, une chambre où l'on donne une leçon de vol à une jeune fille, un hermaphrodite, etc. Le poète s'arrache à ses fascinations malsaines et non sans mal regagne sa chambre. Il détruit la statue, après quoi il devient statue lui-même. Deuxième partie : Dans une école, le spectateur assiste à une bataille de boules de neige. L'une d'elles, en fait du marbre, heurte de plein fouet un garçonnet et le tue. Troisième partie : Des spectateurs en habits de soirée viennent assister comme au théâtre, à l'agonie de l'enfant près du corps duquel le poète et une jeune femme jouent aux cartes. Le cœur de l'enfant devient un atout maître dans le jeu. Le poète se suicide, sous les applaudissements des invités. Quatrième partie : Un tableau vivant représentant la femme statue tenant une lyre et une mappemonde clôture le film. Quand l'on voit que la cheminée d'usine s'écroule, le spectateur se rend compte qu'il ne s'est écoulé qu'une seconde, comme dans un rêve. Fiche technique : Titre : Le Sang d'Un Poète Réalisation, scénario et montage : Jean Cocteau Assistant-réalisateur : Louis Page Décors : Jean d'Eaubonne (crédité Jean Gabriel d'Eaubonne) Costumes : Coco Chanel Photographie : Georges Périnal Direction technique : Michel J. Arnaud Ingénieur du son : Henri Labrély Musique : Georges Auric Production : Vicomte Charles de Noailles Pays d'origine : France Langue : Français Format : Noir et blanc - Son mono (RCA Photophone) Genre : Film expérimental- Film fantastique Durée : 49 minutes Date de sortie : 1930 Source : IMDb , sauf mention contraire Distribution : Enrique Rivero (crédité Errique Rivero) : le poète Lee Miller  : la statue Féral Benga  : l'ange noir Pauline Carton  : la dresseuse d'enfants Jean Desbordes  : Louis XV / l'ami Odette Talazac Fernand Dichamps Lucien Jager Barbette Production et Réception : Le vicomte Charles de Noailles est le mécène du Sang d’un poète , premier film de Jean Cocteau avec un budget d'un million de francs. Il lui commande un film d’animation, et un autre en prise de vue réelle à Luis Buñuel qui réalisera ainsi L'Âge d'or . Cependant, Cocteau, conscient des difficultés que représentent les techniques du cinéma d’animation, propose « de faire un film [en images réelles] aussi libre qu’un dessin animé, en choisissant des visages et des lieux qui correspond[ent] à la liberté où se trouve un dessinateur inventant un monde qui lui est propre ». L’âge d’or et Le Sang d’un poète , tous deux aidés par le Vicomte de Noailles, sont associés au surréalisme, ce que Cocteau a toujours rejeté pour son film. Il est également accusé par des critiques d’avoir « copié sur L’Âge d’or  », ce qu’il nie complètement, allant même jusqu’à dire qu’il n’a pas vu le film de Buñuel avant d’avoir terminé son propre film. Le film n’est sorti que le 20 janvier 1932 dans la salle du Vieux-Colombier car l’image qu’il donnait de la bourgeoisie n’a pas du tout été appréciée par le Vicomte de Noailles et sa femme. Les critiques ont évolué au cours des années, au point de considérer aujourd’hui ce film comme une œuvre majeure. Commentaire : Le Sang d’un poète laisse entrevoir la suite des œuvres de Cocteau telles qu’ Orphée ou Le Testament d'Orphée , à travers des thèmes et des symboles qui lui sont chers tels que la mort, le miroir ou les étoiles. Cocteau nous présente certainement ici son film le plus personnel, où il décrit les souffrances du poète et les affres de la création. En l’espace d’un instant, alors que s’écroule une cheminée, le film se déroule à « la manière dont les souvenirs s’enchaînent et se déforment chez l’homme qui marche et qui dort debout » 5 . Pour Cocteau, son film « n’est qu’une descente en soi-même, une manière d’employer le mécanisme du rêve sans dormir, une bougie maladroite, souvent éteinte par quelque souffle, promenée dans la grande nuit du corps humain. » La temporalité du film est intérieure, semblable à celle d’un rêve. Les événements se déroulent comme ils peuvent le faire dans l’esprit humain, ils s’enchaînent les uns les autres dans une logique qui échappe au spectateur, en dehors de toute linéarité. Réalisation: Jean Cocteau Scénario: Jean Cocteau Acteurs Principaux: Enrique Rivero, Lee Miller, Féral Benga, Pauline Carton, Jean Desbordes Pays de Production: France Genre: Film surréaliste Durée: 49 minutes Sortie: 1930 Note : Afin que vous puissiez lui exprimer votre infinie gratitude pour ses années de bénévolat, l’archiviste Dionysus Vorax  a mis à votre disposition un lien fort pratique.:  Paypal  ~  Donate  ~  Don en €, $ ou £  …",
      "fileSize": 953592070,
      "addedAt": "2026-01-07T00:09:38.889Z",
      "thumbnail": "https://archive.org/services/img/le-sang-dun-poete-jean-cocteau-1930",
      "language": "fre",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 12823
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/le-sang-dun-poete-aka-the-blood-of-a-poet_1930",
      "id": "le-sang-dun-poete-aka-the-blood-of-a-poet_1930",
      "title": "Le sang d'un poète AKA The Blood of a Poet",
      "fileSize": 11701039986,
      "addedAt": "2026-01-07T00:09:38.888Z",
      "thumbnail": "https://archive.org/services/img/le-sang-dun-poete-aka-the-blood-of-a-poet_1930",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 0
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "55 min",
    "imdbRating": 7.3,
    "imdbVotes": 7566,
    "Genre": "Fantasy",
    "Plot": "A young artist draws a face at a canvas on his easel. Suddenly the mouth on the drawing comes into life and starts talking. The artist tries to wipe it away with his hand, but when he looks into the hand he finds the living mouth on his palm. He tries to wipe it off on the mouth of an unfinished statue of a young woman. The statue comes into life and tells him that the only way out of the studio is through the looking glass. The artist jumps into the mirror and comes to the Hotel of Dramatic Lunacies. He peeps through the keyholes of a series of hotel rooms. In the last room he sees desperate meetings of hermaphrodites. One of them has a signboard saying \"Mortal danger\". Back in the studio the artist crushes the statue with a sledgehammer. Because of this he himself becomes a statue, located at the side of a square. Some schoolboys start a snowball fight around the statue. One of the boys is killed by a snowball. A fashionable couple start playing cards at a table beside the corpse. The woman tells the man that unless he holds the ace of hearts he is doomed. The man takes the ace of hearts from the dead boy. The child's guardian, a black angel, appears and takes away the corpse as well as the card. Losing the ace of hearts the man shoots himself. The woman is transformed into the unfinished statue from the studio, and walks away.",
    "Director": "Jean Cocteau",
    "Writer": "Jean Cocteau",
    "Actors": "Enrique Rivero, Lee Miller, Pauline Carton",
    "Language": "French, Vietnamese",
    "Country": "France",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0054377",
    "tt0023649",
    "tt0023245",
    "tt0021814",
    "tt8815066",
    "tt0023753",
    "tt0021016",
    "tt0025397",
    "tt0147865",
    "tt0024852",
    "tt0025759",
    "tt0025998"
  ],
  "collections": [
    {
      "id": "surrealist-cinema",
      "name": "Surrealist Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-11T23:21:58.041Z"
}