{
  "imdbId": "tt0033873",
  "title": "Man Hunt",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/man-hunt-1941",
      "title": "Man Hunt (1941)",
      "description": "A British hunter stalks Hitler for sport, but a near-miss sparks a deadly game of cat and mouse. Framed, hunted, and in hiding, he finds unexpected love and makes a daring escape. When war erupts, he returns with one goal: finish the job he never started. A suspenseful pre-war thriller of courage, survival, and quiet vengeance. Watch on RetroFlix:  https://retroflix.org/vanatoarea-de-om-1941/",
      "id": "man-hunt-1941"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "105 min",
    "imdbRating": "7.2",
    "imdbVotes": "6,586",
    "Genre": "Crime, Drama, Romance",
    "Plot": "In July 1939, English big-game hunter Captain Alan Thorndike infiltrates Adolph Hitler's retreat Berchtesgaden in the Bavarian Alps and takes aim at Hitler with his high-powered rifle. Although Thorndike had intended to carry out a \"sporting stalk\" only, and does not have bullets in his gun, he loads the weapon after locating the target. A German soldier surprises him, however, and his bullet goes astray. Thorndike is brought to Gestapo Major Quive-Smith, to whom he explains that he did not intend to kill Hitler. Quive-Smith does not believe him, however, and orders him to confess that his assassination attempt was at the request of the British government. Although Quive-Smith promises him freedom, Thorndike refuses to sign the prepared confession and is tortured by the Gestapo. When Thorndike still refuses to sign, Quive-Smith arranges for him to be thrown off a cliff in what will look like an accident, but he falls into a river and survives. The next day, the Gestapo searches for Thorndike but he eludes his pursuers and reaches a harbor, where he boards a boat bound for Britain. An intrepid cabin boy named Vaner hides him while one of Quive-Smith's men, Mr. Jones, boards with Thorndike's passport. Vaner keeps Thorndike hidden during the journey, but once he is ashore, Thorndike realizes that Jones and other Gestapo agents are following him, and he ducks into an apartment to escape. He appeals to the apartment's resident, a young Cockney woman named Jerry Stokes, for aid, and she helps him get to his brother's house. Thorndike's brother, Lord Gerald Risborough, is an ambassador, who warns him that the German embassy is looking for him, and that England must acquiesce if Germany demands his extradition. Thorndike vows to disappear from England, then leaves with Jerry and sleeps on her couch. The next morning, Thorndike outlines his plans and does not notice that Jerry has fallen in love with him. She pouts until he takes her to buy a pin to replace the one she lost from her tam-o'-shanter, and she chooses a large chromium arrow. Jerry then accompanies Thorndike to the office of his solicitor, Saul Farnsworthy, where he tries to give her five hundred pounds. She refuses the money, and their squabbling is cut short when an assistant announces that Quive-Smith and Jones are on their way to the office. Thorndike and Jerry escape to the Underground, where Thorndike is chased by Jones. After a fight, Jones is electrocuted on the third rail, and, because he still carries Thorndike's passport, his corpse is identified as the hunter. Realizing that the British police are now after him as well, Thorndike instructs Jerry to write to him at Lyme Regis in three weeks with any news. After a tearful farewell, Jerry returns to her apartment, where Quive-Smith is waiting for her. Three weeks later, Thorndike, who has been living in a cave in the woods, goes to the post office to pick up Jerry's letter. When he returns to his cave, Thorndike discovers that the letter is from Quive-Smith, who has followed him and blocked the cave's opening. Through a small opening, Quive-Smith hands Thorndike Jerry's tam-o'-shanter and says that she was found dead on the street after jumping out her window. Enraged by Jerry's murder, Thorndike finally admits that he did intend to kill Hitler, although he did not realize it at the time. Stalling for time, Thorndike agrees to sign the confession and constructs a bow while Quive-Smith opens the entrance to the cave. As Quive-Smith reaches for the signed confession, Thorndike shoots him with the arrow from Jerry's hat. As he dies, Quive-Smith shoots Thorndike with a pistol, but before he collapses, Thorndike destroys the confession. Months pass as Thorndike recuperates and Europe is thrown into war. Once he has recovered, Thorndike joins the RAF, and on a reconnaissance mission over Germany, bails out with a high-powered rifle, intent on fulfilling his purpose this time.",
    "Director": "Fritz Lang",
    "Writer": "Geoffrey Household, Dudley Nichols, Lamar Trotti",
    "Actors": "Walter Pidgeon, Joan Bennett, George Sanders",
    "Language": "English, German",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0037469",
      "title": "The Woman in the Window",
      "year": 1944,
      "imdbRating": "7.6",
      "imdbVotes": "19,130",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038057",
      "title": "Scarlet Street",
      "year": 1945,
      "imdbRating": "7.7",
      "imdbVotes": "20,501",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033526",
      "title": "Desperate Cargo",
      "year": 1941,
      "imdbRating": "5.2",
      "imdbVotes": "140",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037075",
      "title": "Ministry of Fear",
      "year": 1944,
      "imdbRating": "7.1",
      "imdbVotes": "9,164",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032179",
      "title": "21 Days Together",
      "year": 1940,
      "imdbRating": "6.1",
      "imdbVotes": "1,285",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033076",
      "title": "The Son of Monte Cristo",
      "year": 1940,
      "imdbRating": "6.2",
      "imdbVotes": "935",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031863",
      "title": "Rio",
      "year": 1939,
      "imdbRating": "6.1",
      "imdbVotes": "198",
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031975",
      "title": "Star Reporter",
      "year": 1939,
      "imdbRating": "5.2",
      "imdbVotes": "132",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042579",
      "title": "House by the River",
      "year": 1950,
      "imdbRating": "7.0",
      "imdbVotes": "4,361",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045564",
      "title": "The Blue Gardenia",
      "year": 1953,
      "imdbRating": "6.8",
      "imdbVotes": "6,423",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045555",
      "title": "The Big Heat",
      "year": 1953,
      "imdbRating": "7.9",
      "imdbVotes": "31,169",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047101",
      "title": "Human Desire",
      "year": 1954,
      "imdbRating": "7.1",
      "imdbVotes": "6,926",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:46.425Z"
}