{
  "imdbId": "tt0011922",
  "title": "Among Those Present",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-among-those-present",
      "id": "silent-among-those-present",
      "title": "Among Those Present",
      "fileSize": 721538196,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-among-those-present",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 291
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "34 min",
    "imdbRating": 6.6,
    "imdbVotes": 831,
    "Genre": "Comedy, Short",
    "Plot": "Of the wealthy O'Brien family, Mrs. O'Brien likes to flaunt their wealth and social standing, whereas Mr. O'Brien and their young adult daughter just like having fun doing the simpler things in life that don't require a lot of money. Mrs. O'Brien is having her social pilot arrange a weekend fox hunt, at which Mrs. O'Brien insists that the pilot arrange for Lord Abernathy, a renowned outdoorsman from out of town who is staying at the Ritz-Waldorf Hotel, to attend. The pilot knows that Lord Abernathy's attendance is crucial for her own plans, while the pilot's accomplice knows that getting Lord Abernathy to attend would be difficult. The accomplice instead hires a Ritz-Waldorf coat check bellboy name O'Reilly, who has a knack for impersonating the rich and famous when he wears the garb, to pretend to be Lord Abernathy, they telling him the deception is all in fun. At the weekend gathering, O'Reilly is adept enough at spinning yarns of his supposed outdoor exploits, but it may be a different story when it comes right down to participating in the hunt itself. But O'Reilly may have bigger issues with which to deal when he learns of the pilot and her accomplice's true intentions to bilk the O'Briens out of their riches, which includes the accomplice marrying the daughter, the latter aspect which may be more troubling as O'Reilly is falling for the daughter himself.",
    "Director": "Fred C. Newmeyer",
    "Writer": "Hal Roach, Sam Taylor, H.M. Walker",
    "Actors": "Harold Lloyd, Mildred Davis, Aggie Herring",
    "Language": "None",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0012499",
    "tt0012642",
    "tt0013201",
    "tt0012303",
    "tt0012512",
    "tt0011521",
    "tt0011263",
    "tt0011293",
    "tt0010258",
    "tt0011144",
    "tt0011223",
    "tt0010146"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}