{
  "imdbId": "tt0009018",
  "title": "A Dog's Life",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-dogs-life-1918-directed-by-charlie-chaplin",
      "title": "A Dogs Life 1918 Directed By Charlie Chaplin",
      "description": "Theatrical poster Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Charlie Chaplin Starring Charlie Chaplin Edna Purviance Syd Chaplin Henry Bergman Charles Reisner Albert Austin Tom Wilson Cinematography Roland Totheroh Edited by Charlie Chaplin (uncredited) Music by Charlie Chaplin (in 1957 released as part of The Chaplin Revue ) Distributed by First National Pictures Inc. Release date April 14, 1918 Running time 33 minutes Country United States Languages Silent film English (original intertitles) Budget 1$ million A Dog's Life is a 1918 American short silent film written, produced and directed by Charlie Chaplin . This was Chaplin's first film for First National Films . It was part of a then groundbreaking $1 million contract. [ 1 ] It was for a total of eight 3 reel short silent films. [ 2 ] Chaplin plays opposite an animal as \"co-star\". \"Scraps\" (the dog) was the hero in this film, as he helps Charlie and Edna towards a better life. Edna Purviance plays a dance hall singer and Charlie Chaplin, The Tramp . Sydney Chaplin (Chaplin's brother) had a small role in this film; this was the first time the two brothers were on screen together. [ 3 ] Charles Lapworth , a former newspaper editor who had met Chaplin when he interviewed him, took a role as a consultant on the film. [ 4 ] Plot Charlie is jobless and has few prospects for employment. He tries to steal food from a lunch cart and is nearly caught by a police officer, avoiding arrest by doing some fancy rolling back and forth under a fence. Later, Charlie saves a stray dog (Scraps) from other dogs. Charlie and Scraps become fast friends and partners in purloining food. Charlie enters a cabaret where dogs are not allowed. Charlie hides Scraps in his baggy trousers, but Scraps' tail emerges from the back end. Charlie meets a girl who works in the cabaret. She is disillusioned with life, so Charlie attempts to cheer her up. Charlie is ejected from the cabaret for having no money and returns to his normal outdoor sleeping spot. By chance, thieves have buried a stolen wallet nearby that is laden with a small fortune. Scraps digs up the wallet. Charlie returns to the cafe and shows the girl he has enough money for them to be married. The crooks discover that Charlie has the wallet and violently take it back from him. Charlie fights furiously to reclaim it. This leads to a frantic chase which culminates in the thieves' arrest. Charlie uses the money to buy a farm for himself and his bride. The movie ends with the newlyweds peering fondly into a cradle. It contains Scraps and her puppies. Cast Charlie Chaplin – The Tramp Edna Purviance – Bar singer Mut – Scraps, a thoroughbred mongrel Syd Chaplin – Lunchwagon owner Henry Bergman – Fat unemployed man / Dance-hall lady Charles Reisner – Employment agency clerk / Door-to-door / Drummer Albert Austin – Thief Granville Redmond — Dance-hall owner Bud Jamison – Thief Tom Wilson – Policeman James T. Kelley — Sausage buyer / Robbed passer M. J. McCarthy – Unemployed man Mel Brown – Unemployed man Charles Force – Unemployed man Bert Appling – Unemployed man Thomas Riley – Unemployed man Louis Fitzroy – Unemployed man Slim Cole – Unemployed man Ted Edwards – Unemployed man Loyal Underwood — Unemployed man / Dance-hall man Stills References 1 Zukor, Adolph (1954). The Public Is Never Wrong . London: Cassell and Co. Ltd. p. 139. 2 Zukor, Adolph (1954). The Public Is Never Wrong. London: Cassell and Co. Ltd. p. 139. 3 \"Filming A Dog's Life\" . www.charliechaplin.com . Retrieved 10 November 2018 . 4 Stempel, Tom (2000). Dunne, Philip (ed.). Framework: A History of Screenwriting in the American Film . Syracuse University Press . p. 33. ISBN   9780815606543 .",
      "id": "a-dogs-life-1918-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-dogs-life",
      "title": "A Dog's Life",
      "id": "silent-a-dogs-life"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "33 min",
    "imdbRating": "7.6",
    "imdbVotes": "10,161",
    "Genre": "Short, Comedy, Drama",
    "Plot": "Poor Charlie lives in a vacant lot. He tries to get a job but when he gets to the head of the employment line the jobs are gone. Back \"home\" he rescues Scraps, a bitch being attacked by other strays. Together they manage to steal some sausages from a lunch wagon. They enter a dance hall where Edna is a singer and unwilling companion to the clientele. He is thrown out when he can't pay. Back \"home\" Scraps digs up a money-filled wallet buried by crooks. They return to the dance hall to find Edna fired. The wallet goes back and forth between Charlie and the crooks. Charlie, Edna and Scraps end up very happily.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Edna Purviance, Dave Anderson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0008133",
      "title": "The Immigrant",
      "year": 1917,
      "imdbRating": "7.5",
      "imdbVotes": "9,530",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007507",
      "title": "The Vagabond",
      "year": 1916,
      "imdbRating": "6.8",
      "imdbVotes": "3,287",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008907",
      "title": "The Bond",
      "year": 1918,
      "imdbRating": "5.4",
      "imdbVotes": "1,213",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009611",
      "title": "Shoulder Arms",
      "year": 1918,
      "imdbRating": "7.3",
      "imdbVotes": "7,583",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007613",
      "title": "The Adventurer",
      "year": 1917,
      "imdbRating": "7.3",
      "imdbVotes": "4,613",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007832",
      "title": "The Cure",
      "year": 1917,
      "imdbRating": "7.1",
      "imdbVotes": "3,960",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007880",
      "title": "Easy Street",
      "year": 1917,
      "imdbRating": "7.4",
      "imdbVotes": "5,934",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010747",
      "title": "Sunnyside",
      "year": 1919,
      "imdbRating": "6.6",
      "imdbVotes": "3,404",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007194",
      "title": "Police",
      "year": 1916,
      "imdbRating": "6.4",
      "imdbVotes": "2,047",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006684",
      "title": "The Fireman",
      "year": 1916,
      "imdbRating": "6.5",
      "imdbVotes": "3,032",
      "language": "English, None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006548",
      "title": "The Count",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,527",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    },
    {
      "id": "canine-cinema",
      "name": "Canine Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:10:30.084Z"
}