{
  "movieId": "tt0000877",
  "title": "Getting Even",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/GettingEven1909",
      "id": "GettingEven1909",
      "title": "\"Getting Even\" (1909) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Getting Even\" is a short comedy directed by D. W. Griffith. This film illustrates the work of Arthur V. Johnson and Billy Bitzer, stars of Silent Hall of Fame. Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          D.W. Griffith Cinematography                G.W. Bitzer Starring                                Billy Quirk, James Kirkwood, Mary Pickford, Mack Sennett, Arthur V. Johnson Distributed by                     Biograph Company Release date                         September 13, 1909 Running time                       7 min. Country                                United States Language                              Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 181036415,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/GettingEven1909",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 1901
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.8,
    "imdbVotes": 107,
    "Genre": "Comedy, Short",
    "Plot": "The most satisfying and pleasurable sensation experienced is \"getting even,\" especially where one has been held up to ridicule before a jeering mob. Such was the reguerdon of Bud, the Kid of the Mining Camp, after suffering gross humiliation at the hands of the other cowboys and miners. Miss Lucy, the belle of the camp, is introduced to the Kid, and makes an impression; the Kid becomes quite seriously inclined towards her. The boys, more in the spirit of jest than chagrin, poke fun at him; call him the baby, and end with Jim Blake spanking him. Needless to say the Kid is mortified and swears to get square. A masque ball is to be held that night, so Bud plans his revenge. All tog out in grotesque costumes, a high old time is imminent, for it is fair to assume that the society folk of the camp will be well represented. Bud, however, feigns a toothache and will not go. Dressed up in carnival duds, the gang leaves the shack for the pavilion. All gone. Bud jumps from his bunk, and dresses up in swell female attire, the effect being marvelous. He presents such a striking appearance that he is the belle of the ball. Jim Blake becomes deeply smitten, and after leading him on Bud soon has Jim on his knees, pouring out his soul's devotion, regardless of the snickerings of the motley mob around them. There Jim kneels, declaring his undying love for the fair charmer, as only a lion-hearted cowboy can, when Bud removes his hat and wig. \"Holy \"Smoke!\" Well it is safe to say that Mr. James Blake will not attend any more spanking bees where the Kid is a victim.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Billy Quirk, Mary Pickford, James Kirkwood",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001333",
    "tt0000800",
    "tt0000938",
    "tt0001054",
    "tt0001458",
    "tt0001062",
    "tt0001002",
    "tt0000892",
    "tt0000878",
    "tt0000922",
    "tt0000946",
    "tt0001000"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}