{
  "movieId": "tt0000451",
  "title": "Mary Jane's Mishap",
  "year": 1903,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mary-janes-mishap-1903-directed-by-george-albert-smith",
      "id": "mary-janes-mishap-1903-directed-by-george-albert-smith",
      "title": "Mary Jane’s Mishap (1903) Directed By George Albert Smith",
      "description": "Mary Jane’s Mishap (1903) Director: George Albert Smith Mary Jane's Mishap; or, Don't Fool with the Paraffin is a 1903 British silent comic trick film, directed by George Albert Smith, depicting disaster after housemaid Mary Jane uses paraffin to light the kitchen stove. The film, according to Michael Brooke of BFI Screenonline, \"is an example of Smith's interest in cinematic effects - including, here, the use of superimposition to suggest ghosts,\" which, \"is notable for its then sophisticated mix of wide establishing shots and medium close-ups,\" and, \"also contains two wipes to denote a change of scene.\" Plot: A housemaid (played by Smith's wife, Laura Bayley) starts a fire in the kitchen stove by putting paraffin on it. It causes an explosion that sends her up the chimney. She emerges from the chimney pot on top of the house and her scattered remains fall to the ground. Later, Mary Jane's ghost rises from her grave to find her paraffin can and once she finds it, she goes to her final resting place Production: The plot of Mary Jane's Mishap was probably inspired by a 1901 Edison Manufacturing Company film, The Finish of Bridget McKeen, but is enlarged to include new material, including a vein of dark comedy typical of the Brighton School of filmmaking.[3] Mary Jane's Mishap was filmed in Smith's studio at St. Ann's Well Gardens, Hove. Most film historians have described the film's production as taking place in 1903, although John Barnes instead considered a production date of August 1902 to be more plausible. -From Wikipedia",
      "fileSize": 15705189,
      "addedAt": "2026-01-07T00:09:46.428Z",
      "thumbnail": "https://archive.org/services/img/mary-janes-mishap-1903-directed-by-george-albert-smith",
      "year": 1903,
      "collection": "feature_films",
      "downloads": 83
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-mary-janes-mishap",
      "id": "silent-mary-janes-mishap",
      "title": "Mary Jane's Mishap",
      "fileSize": 30645345,
      "addedAt": "2026-01-07T00:11:07.409Z",
      "thumbnail": "https://archive.org/services/img/silent-mary-janes-mishap",
      "year": 1903,
      "collection": "feature_films",
      "downloads": 350
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "4 min",
    "imdbRating": 6.5,
    "imdbVotes": 1085,
    "Genre": "Short, Comedy",
    "Plot": "The merry housewife, Mary Jane, starts her day early in the morning by doing her myriad domestic chores. After using pitch-black boot polish as a makeshift make-up, the reckless servant sets her mind on starting a fire--and when all else fails--Mary grabs a paraffin can, pours liberally on the seemingly extinguished fire, and out the chimney she goes. Will her untimely demise be a warning to all kerosene lovers?",
    "Director": "George Albert Smith",
    "Writer": "N/A",
    "Actors": "Laura Bayley",
    "Language": "None",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000469",
    "tt0000313",
    "tt1241242",
    "tt0308284",
    "tt2585250",
    "tt0000430",
    "tt0472903",
    "tt0000436",
    "tt0231639",
    "tt0477387",
    "tt0232932",
    "tt0000492"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.409Z"
}