{
  "movieId": "tt0000370",
  "title": "Scrooge; or Marley's Ghost",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ScroogeOrMarleysGhost1901",
      "id": "ScroogeOrMarleysGhost1901",
      "title": "Scrooge or Marley's Ghost (1901)",
      "description": "Scrooge or Marley's Ghost (1901)",
      "fileSize": 34690125,
      "addedAt": "2026-01-07T00:06:51.868Z",
      "thumbnail": "https://archive.org/services/img/ScroogeOrMarleysGhost1901",
      "collection": "feature_films",
      "downloads": 27519
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/scrooge-or-marleys-ghost-1901-directed-by-walter-r.-booth",
      "id": "scrooge-or-marleys-ghost-1901-directed-by-walter-r.-booth",
      "title": "Scrooge, Or, Marley's Ghost (1901) Directed By Walter R. Booth",
      "description": "Scrooge, or, Marley's Ghost (1901) Director: Walter R. Booth Scrooge, or, Marley's Ghost is a 1901 British silent trick film directed by Walter R. Booth, featuring the miserly Ebenezer Scrooge (played by Daniel Smith) confronted by Jacob Marley's ghost and given visions of Christmas past, present, and future. It is the earliest film adaptation of Charles Dickens's 1843 novella A Christmas Carol. It was also believed to be the earliest filmed adaptation of a Dickens work, until the 2012 discovery of the Bleak House-inspired The Death of Poor Joe. The film, \"although somewhat flat and stage-bound to modern eyes,\" according to Ewan Davidson of British Film Institute's Screenonline, \"was an ambitious undertaking at the time,\" as, \"not only did it attempt to tell an 80 page story in five minutes, but it featured impressive trick effects, superimposing Marley's face over the door knocker and the scenes from his youth over a black curtain in Scrooge's bedroom.\" The film: Filmed in 35mm and in black and white, this short silent film was produced by the English film pioneer R. W. Paul, and directed by Walter R. Booth and was filmed at Paul's Animatograph Works. It was released in November 1901. As was common in cinema's early days, the filmmakers chose to adapt an already well-known story, in this case A Christmas Carol by Charles Dickens, in the belief that the audience's familiarity with the story would result in the need for fewer intertitles. It was presented in 'Twelve Tableaux' or scenes. The film contains the first use of intertitles in a film Evidence suggests that Paul's version of A Christmas Carol was based as much on J. C. Buckstone's popular stage adaptation Scrooge as on Dickens' original story. Like the play, the film dispenses with the different ghosts that visit Scrooge, instead relying upon the figure of Jacob Marley, draped in a white sheet, to point out the error of Scrooge's ways. The film featured impressive trick effects by 1901 standards, superimposing Marley's face over the door knocker, and displaying the scenes from his youth on a black curtain in Scrooge's bedroom. R. W. Paul was a trick film specialist; Walter Booth, credited as the film's director, was a well-known magician as well as a trick and comic film specialist. The film makes early use of dissolving between scenes. Some scenes are tinted. Content: The only known surviving footage, about 3 minutes and 26 seconds in length, is preserved by the British Film Institute. This footage starts with Bob Cratchit showing someone out of Scrooge's office on Christmas Eve, just before he and Scrooge leave for the night, and ends at a scene where Scrooge is shown his own grave. The film does not show the Ghosts of Christmas Past, Christmas Present, or Christmas Yet to Come, instead relying on the ghost of Marley to present the visions to Scrooge. - From Wikipedia",
      "fileSize": 30683481,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/scrooge-or-marleys-ghost-1901-directed-by-walter-r.-booth",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 236
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-scrooge-or-marleys-ghost",
      "id": "silent-scrooge-or-marleys-ghost",
      "title": "Scrooge, or Marley's Ghost",
      "fileSize": 92313881,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-scrooge-or-marleys-ghost",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 600
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.6,
    "imdbVotes": 604,
    "Genre": "Short, Drama, Fantasy",
    "Plot": "It's Christmas Eve. The miser Scrooge and his assistant Bob Cratchit finish their work in the office and go home. When Scrooge is going to open his front door, he sees the face of Marley's ghost in the door knocker. Inside he takes on his night dress, eats his supper, and falls asleep at the table. Marly's ghost shows Scrooge a vision of himself at a Christmas in the past. Then the ghost escorts him to the present Christmas, and the homes and families of Bob Cratchit and Fred, where Scrooge sees Bob and Fred drink to him in his absence. At last the ghost shows Scrooge the Christmas that might be. Here Scrooge has to face his own grave and the death of Tiny Tim. Confronted with this Scrooge regrets his callousness and egoism.",
    "Director": "Walter R. Booth",
    "Writer": "J.C. Buckstone, Charles Dickens",
    "Actors": "Daniel Smith",
    "Language": "None, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000357",
    "tt0211928",
    "tt0212596",
    "tt0000377",
    "tt0212140",
    "tt2627724",
    "tt0001544",
    "tt0003516",
    "tt0417062",
    "tt2509978",
    "tt0000355",
    "tt0017775"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}