{
  "imdbId": "tt0001330",
  "title": "A Mother's Devotion; or, the Firing of the Patchwork Quilt",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-mothers-devotion-or-the-firing-of-the-patchwork-quilt",
      "id": "silent-a-mothers-devotion-or-the-firing-of-the-patchwork-quilt",
      "title": "A Mother's Devotion; or, The Firing of the Patchwork Quilt",
      "fileSize": 672183111,
      "addedAt": "2026-01-07T00:10:50.367Z",
      "thumbnail": "https://archive.org/services/img/silent-a-mothers-devotion-or-the-firing-of-the-patchwork-quilt",
      "language": "English",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 394
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "7 min",
    "imdbRating": 5.5,
    "imdbVotes": 44,
    "Genre": "Short",
    "Plot": "Mrs. McCoy is filling her son's dinner-pail before he starts on his run as engineer for a passenger train on the D.L. &amp; W. Jack makes haste to the train yard, climbs into his engine and pulls out. The next night, about the time that Jack is expected on his return trip, his mother is sitting at the table working on her patchwork quilt. Suddenly a terrible storm comes up. She discovers that the trestle across the stream has broken down and that the tracks are strewn with debris. Hurriedly throwing a shawl over her head, she grabs up the old patchwork quilt, saturates it with kerosene, and taking some matches with her, hurries from the house in time to reach the trestle, where she sets fire to the quilt, and signals her boy's fast approaching train. Upon seeing the flames, and his mother madly waving her shawl, he jumps from his engine cab, rushes to her side, and she falls helpless in his arms, while the passengers, who have been aroused by the sudden stopping of the train, gather around them in an impressive tableau.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Mary Maurice, Robert Gaillard",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002429",
    "tt0417062",
    "tt0002356",
    "tt1298777",
    "tt1056202",
    "tt2647246",
    "tt1207008",
    "tt1247273",
    "tt0470339",
    "tt0463594",
    "tt0330942",
    "tt0366564"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}