{
  "movieId": "tt0005074",
  "title": "The Champion",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheChampion",
      "id": "TheChampion",
      "title": "Charlie Chaplin's \"The Champion\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"The Champion\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin           Starring                     Charlie Chaplin, Edna Purviance, Bud Jamison, Leo White Cinematography        Harry Ensign Distributed by           General Film Company Release date               March 11, 1915 Running time             31 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"      ",
      "fileSize": 396537688,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheChampion",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 56937
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-champion",
      "id": "silent-the-champion",
      "title": "The Champion",
      "fileSize": 509011438,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-champion",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 754
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-champion-1915",
      "id": "the-champion-1915",
      "title": "The Champion (1915)",
      "description": "The Champion is a 1915 American silent comedy film released by Essanay Studios, starring Charles Chaplin alongside Edna Purviance and Leo White. Essanay co-owner and star, Broncho Billy Anderson can be seen as an enthusiastic audience member in the boxing match scene. Watch on RetroFlix.org:  https://retroflix.org/the-champion-1915/",
      "fileSize": 291670888,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-champion-1915",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 309
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-champion-1915-directed-by-charlie-chaplin",
      "id": "the-champion-1915-directed-by-charlie-chaplin",
      "title": "The Champion (1915) Directed By Charlie Chaplin",
      "description": "The Champion Theatrical poster of The Champion (1915) Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Edna Purviance Ernest Van Pelt Robert Shields Lloyd Bacon Leo White Carl Stockdale Billy Armstrong Paddy McGuire Bud Jamison Ben Turpin Cinematography Harry Ensign Edited by Charlie Chaplin Music by Robert Israel (Kino video release) Distributed by Essanay Studios General Film Company Release date March 11, 1915 Running time 33 minutes Country United States Languages Silent film English (original intertitles) The Champion is a 1915 American silent comedy film released by Essanay Studios , starring Charlie Chaplin alongside Edna Purviance and Leo White . Essanay co-owner and star, Broncho Billy Anderson can be seen as an enthusiastic audience member in the boxing match scene. Plot In this comedy, Charlie Chaplin has a companion—a pet bulldog. Walking along a street with his bulldog, Charlie finds a \"good luck\" horseshoe just as he passes the training camp of an enormous fighter named Spike Dugan. Outside the camp is a large, painted advertisement which states Dugan is seeking sparring partners \"who can take a punch.\" After watching other better fighters be soundly beaten by Dugan, Charlie decides his best bet is to put the horseshoe inside his boxing glove. Using the loaded glove, Charlie connects with a solid punch and wins. The trainer prepares Charlie to fight the world champion. A gambler wants Charlie to throw the fight. He and the trainer's daughter fall in love. Notes In some versions of the film, an inter-title introducing the heavyweight boxers refers to Spike Dugan as \"Spike Hennessey\"—although the surname Dugan is clearly painted on the wall surrounding his training camp. This was the second Chaplin film to focus on boxing. He had already made a comedy for Keystone Studios , titled The Knockout (1914), in which he was a secondary character—a boxing referee. In City Lights (1931) he would again play an outsized and outclassed pugilist. Cast Charlie Chaplin in The Champion (1915) Charlie Chaplin as Challenger Edna Purviance as Trainer's daughter Ernest Van Pelt as Spike Dugan Lloyd Bacon as Second sparring partner / Referee Leo White as Crooked gambler Carl Stockdale as Sparring partner Billy Armstrong as Sparring partner Paddy McGuire as Sparring partner Bud Jamison as Bob Uppercut, Champion Ben Turpin as Ringside vendor Production The Champion was filmed entirely on location in downtown Niles, California , at the corner of G Street and Niles Boulevard, [ 1 ] around the Essanay Studio, [ 2 ] as the second of five films Chaplin made for Essanay in the San Francisco Bay Area before returning to Los Angeles to finish out his one-year contract with Essanay. [ 3 ] The roots of The Champion go back to a Fred Karno troupe music hall sketch \"The Football Match\", in particular, the scene in which Leo White attempts to bribe the Tramp to throw the boxing match and the climatic fight evokes a Fred Karno troupe favourite, The Yap Yaps , as well as the Chaplin- Arbuckle Keystone short The Knockout . [ 4 ] References 1 Welsh, Tim (9 October 2016). \"Charlie Chaplin in Niles\" . San Francisco Film Locations Then & Now . Retrieved 17 July 2024 . 2 \"Charlie Chaplin Days in Niles, California, 2016\" . San Francisco Film Locations Then & Now . 13 June 2016. 3 Bengtson, John (7 November 2016). \"How Chaplin Filmed The Champion – on Location in Niles\" . silent film locations (and more) . Retrieved 17 July 2024 . 4 Robb, Brian J. (11 March 2015). \"The Champion (11 March 1915)\" . Chaplin: Film by Film . Retrieved 17 July 2024 . From Wikipedia, the free encyclopedia",
      "fileSize": 753922538,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-champion-1915-directed-by-charlie-chaplin",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 344
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/THECHAMPION1915CharlieChaplinEdnaPurviance",
      "id": "THECHAMPION1915CharlieChaplinEdnaPurviance",
      "title": "THE CHAMPION ( 1915) Charlie Chaplin, Edna Purviance",
      "description": "THE CHAMPION (1915) Starring: Charlie Chaplin, Edna Purviance, Bud Jamison, Leo White, Lloyd  Bacon, Billy Armstrong, Paddy McGuire, Broncho Billy Anderson, Ben Turpin Directed by Chaplin Essanay Film Company William Thomas Sherman, wts@gunjones.com, http://www.mn-hp.com",
      "fileSize": 213798969,
      "addedAt": "2026-01-07T00:06:58.270Z",
      "thumbnail": "https://archive.org/services/img/THECHAMPION1915CharlieChaplinEdnaPurviance",
      "collection": "feature_films",
      "downloads": 9519
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "31 min",
    "imdbRating": 6.7,
    "imdbVotes": 2846,
    "Genre": "Short, Comedy, Sport",
    "Plot": "Walking along with his bulldog, Charlie finds a \"good luck\" horseshoe just as he passes a training camp advertising for a boxing partner \"who can take a beating.\" After watching others lose, Charlie puts the horseshoe in his glove and wins. The trainer prepares Charlie to fight the world champion. A gambler wants Charlie to throw the fight. He and the trainer's daughter fall in love.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Bud Jamison, Gilbert M. 'Broncho Billy' Anderson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005812",
    "tt0004936",
    "tt0005571",
    "tt0005810",
    "tt0006309",
    "tt0005044",
    "tt0005489",
    "tt0005542",
    "tt0006313",
    "tt0006177",
    "tt0006032",
    "tt0006414"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:30:40.514Z"
}