{
  "movieId": "tt0035680",
  "title": "Blazing Frontier",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BlazingFrontier",
      "id": "BlazingFrontier",
      "title": "Blazing Frontier",
      "description": "Billy the Kid (Buster Crabbe) and his sidekick Fuzzy (Al St. John) get involved in a land dispute between a crooked railroad and the angry settlers that were the victims of the railroad's swindle.",
      "fileSize": 1607044861,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BlazingFrontier",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 14280
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "59 min",
    "imdbRating": 5.7,
    "imdbVotes": 76,
    "Genre": "Western",
    "Plot": "In the 19th and last of the PRC \"Billy the Kid\" series (first six with Bob Steele and last 13 with Buster Crabbe), a feud develops between the settlers and the railroad detectives in Red Rock Valley. Clem Barstow sends for Billy the Kid and Fuzzy Jones to help. Buster suspects that Ward Tragg, chief of the railroad detectives, and Luther Sharp, land agent for the Western Railroad Company, are defrauding the settlers without the knowledge or sanction of the company. Billy and the settlers rustle off cattle, which have been illegally confiscated by Tragg and his men, in order to raise money for Barstow to bid on a ranch which Sharp is illegally auctioning off. Billy discovers that the purchase price on the deed has been altered and Barstow writes the company to send a man to investigate. When Tragg learns about this, he makes plans to kidnap the railroad official.",
    "Director": "Sam Newfield",
    "Writer": "Patricia Harper",
    "Actors": "Buster Crabbe, Al St. John, Marjorie Manners",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0036523",
    "tt0035723",
    "tt0035804",
    "tt0035908",
    "tt0036074",
    "tt0036844",
    "tt0037142",
    "tt0037237",
    "tt0035316",
    "tt0035106",
    "tt0037464",
    "tt0033390"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}