{
  "imdbId": "tt0018311",
  "title": "The Red Mill",
  "year": 1927,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dwgcqq_-nnk",
      "id": "dwgcqq_-nnk",
      "title": "The Red Mill (1927) | Colorized Public Domain Silent Comedy with Marion Davies & Roscoe Arbuckle",
      "description": "The Red Mill (1927) is a silent romantic comedy directed by William Goodrich (pseudonym of Roscoe Arbuckle) and produced by Metro-Goldwyn-Mayer during the height of the silent era. This beautifully restored and colorized edition of the public domain classic brings back the charm, humor, and spectacle of 1920s Hollywood for modern audiences in the United States, Europe, and beyond. With Marion Davies in one of her most memorable comedic roles, this film captures the brilliance of early cinema and the enduring appeal of physical comedy.\n\nPlot Summary:\nThe story follows Tina (Marion Davies), a humble servant girl working at the Red Mill tavern in Holland. Dreaming of romance and a better life, she becomes entangled in a mistaken identity plot involving Gretchen (Louise Fazenda), the daughter of a wealthy innkeeper. When Gretchen refuses to marry the suitor her father has chosen, Tina is mistaken for her and caught in a whirlwind of comedic confusion. Meanwhile, Tina herself falls for Captain Jacop Van Goop (Owen Moore), a handsome but penniless soldier.\n\nThrough slapstick humor, elaborate set pieces, and clever misunderstandings, The Red Mill builds toward a lively climax featuring chases, disguises, and the magic of silent-era comedy. It’s a tale of mistaken love, social barriers, and the triumph of sincerity over wealth and status.\n\nCast and Crew:\n• Director: William Goodrich (Roscoe Arbuckle)\n• Producer: King Vidor\n• Cinematography: Ira H. Morgan\n• Editing: Hugh Wynn\n\nStarring:\n• Marion Davies as Tina\n• Owen Moore as Captain Jacop Van Goop\n• Louise Fazenda as Gretchen\n• George Siegmann as Willem\n• Karl Dane as Jan\n• Polly Moran as Willem’s Wife\n\nFilm Significance:\nThe Red Mill is notable both for its lavish MGM production values and for being directed by Roscoe Arbuckle under the pseudonym William Goodrich. Arbuckle, once one of the biggest stars in silent comedy, was working behind the scenes after his infamous career collapse. The film is also a showcase for Marion Davies, whose comedic timing and charm helped secure her place as one of the leading ladies of the silent era.\n\nThis film combines slapstick comedy with romantic farce, showcasing elaborate sets and the kind of physical humor that defined the 1920s. It remains an important cultural artifact, reflecting the transition from vaudeville-inspired silent comedy to the more structured romantic comedies of the late 1920s.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Red Mill remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1927 release was in black and white, typical of its time. While historically authentic, many modern audiences skip past black-and-white films. By offering a colorized edition, we bridge the gap between historical preservation and contemporary viewing habits, making Marion Davies’ performance and Arbuckle’s direction accessible to today’s audiences.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheRedMill #MarionDavies #SilentComedy #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentFilm #FilmRestoration #GoldenAgeHollywood #RoscoeArbuckle",
      "addedAt": "2025-12-24T00:49:02.496Z",
      "thumbnail": "https://i.ytimg.com/vi/dwgcqq_-nnk/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYOyBJKHIwDw==&rs=AOn4CLDeDrSwpgAfHqg4rPUH7UJmedVgVQ",
      "duration": 4355,
      "language": "en",
      "year": 1927,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-red-mill_1927",
      "id": "the-red-mill_1927",
      "title": "The Red Mill",
      "fileSize": 2585611529,
      "addedAt": "2026-01-07T00:12:22.157Z",
      "thumbnail": "https://archive.org/services/img/the-red-mill_1927",
      "language": "English",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 1050
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "74 min",
    "imdbRating": 6.8,
    "imdbVotes": 1496,
    "Genre": "Comedy, Romance",
    "Plot": "Tina works as a barmaid at the Red Mill Tavern and is at the mercy of volatile and bad tempered owner, Willem. Dennis is a visitor to the area and Tina soon falls in love with him. Dennis doesn't share her feeling and leaves only to return later on. He becomes interested in Gretchen, the Burgomaster's daughter. However, Gretchen, about to enter into an arranged marriage with the Governor, is in love with Captain Jacop Van Goop. Tina and Gretchen enter into an elaborate masquerade in order to be with the men they each love.",
    "Director": "Roscoe 'Fatty' Arbuckle",
    "Writer": "Frances Marion, Victor Herbert, Henry Martyn Blossom",
    "Actors": "Marion Davies, Owen Moore, Louise Fazenda",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0018297",
    "tt0016646",
    "tt0019258",
    "tt0016129",
    "tt0017928",
    "tt0016971",
    "tt0018183",
    "tt0018235",
    "tt0017766",
    "tt0021057",
    "tt0017305",
    "tt0017204"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.157Z"
}