{
  "imdbId": "tt0050858",
  "title": "The Pride and the Passion",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-pride-and-the-passion-1957_202508",
      "id": "the-pride-and-the-passion-1957_202508",
      "title": "The Pride And The Passion (1957) Cary Grant · Frank Sinatra",
      "description": "In 1810, an English naval officer helps two Spanish revolutionaries recover an old cannon and use it to defeat Napoleon's troops. A historically inadequate but elaborately staged adventure spectacle..",
      "fileSize": 5175993945,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-pride-and-the-passion-1957_202508",
      "language": "eng",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 353
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "132 min",
    "imdbRating": 5.7,
    "imdbVotes": 3285,
    "Genre": "Action, Adventure, Drama",
    "Plot": "The story in this movie deals with the perseverance of Spaniards to take back their country from the French who have conquered Spain under Napoleon as he marched over Europe. A huge cannon, perhaps the largest in the world at that time, is discarded by the army as they retreat from the French invaders. A \"ragtag\" group of Spanish loyalists find \"The Gun\" and begin to restore it so they may tow it across Spain to the French stronghold in Avila and use it to open the giant walls for an invasion. Luckily Britain has sent someone to retrieve the cannon for England so they can have it to fight the French also AND to make sure that the French don't get the gun! A shoemaker and his voluptuous girl friend are the leaders of the peasants trying to get the gun to Avila. The Brit can't get help to get the giant gun back to his ship without the peasants and the shoemaker won't help him unless they all go blast Avila open first. The Brit has the knowledge needed to fire the weapon and the shoemaker leads the manpower which can move the huge cannon so a deal is struck to go to Avila and then help will be provided to get the gun to the English ship. The story follows the hardships and struggles of moving such a giant weapon across Spain and how it has to be hidden from the French.",
    "Director": "Stanley Kramer",
    "Writer": "Edna Anhalt, Edward Anhalt, C.S. Forester",
    "Actors": "Cary Grant, Frank Sinatra, Sophia Loren",
    "Language": "English, Spanish, French",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0050579",
    "tt0049357",
    "tt0050356",
    "tt0052170",
    "tt0048983",
    "tt0051702",
    "tt0052604",
    "tt0052538",
    "tt0048432",
    "tt0057193",
    "tt0050208",
    "tt0050629"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}