{
  "imdbId": "tt0042792",
  "title": "No Way Out",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1950-no-way-out-o-odio-e-cego-un-rayo-de-luz-joseph-l.-mankiewicz-legendado",
      "id": "1950-no-way-out-o-odio-e-cego-un-rayo-de-luz-joseph-l.-mankiewicz-legendado",
      "title": "1950 - No Way Out - O ódio é cego - Un rayo de luz - Joseph L. Mankiewicz - Legendado",
      "description": "https://derechonoir.wordpress.com/",
      "fileSize": 1590928320,
      "addedAt": "2026-01-07T00:06:06.562Z",
      "thumbnail": "https://archive.org/services/img/1950-no-way-out-o-odio-e-cego-un-rayo-de-luz-joseph-l.-mankiewicz-legendado",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 269
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1950-no-way-out-un-rayo-de-luz-joseph-l.-mankiewicz-vose",
      "id": "1950-no-way-out-un-rayo-de-luz-joseph-l.-mankiewicz-vose",
      "title": "1950 - No Way Out - Un Rayo De Luz - Joseph L. Mankiewicz - VOSE",
      "description": "https://derechonoir.wordpress.com/",
      "fileSize": 1172709913,
      "addedAt": "2026-01-07T00:06:06.562Z",
      "thumbnail": "https://archive.org/services/img/1950-no-way-out-un-rayo-de-luz-joseph-l.-mankiewicz-vose",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 323
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nowayout1950",
      "id": "nowayout1950",
      "title": "No Way Out (1950) Richard Widmark, Linda Darnell, Sidney Poitier - Film Noir Full Movie",
      "description": "No Way Out is a 1950 American film noir directed by Joseph L. Mankiewicz, and starring Richard Widmark, Linda Darnell, Stephen McNally and Sidney Poitier. Wikipedia: https://en.wikipedia.org/wiki/No_Way_Out_(1950_film) Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 679957684,
      "addedAt": "2026-01-07T00:10:02.899Z",
      "thumbnail": "https://archive.org/services/img/nowayout1950",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 17627
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SDd6_1vHyI4",
      "id": "SDd6_1vHyI4",
      "title": "No Way Out (1950) | Colorized Public Domain Classic Noir Drama with Sidney Poitier & Richard Widmark",
      "description": "No Way Out (1950) is an American film noir drama directed by Joseph L. Mankiewicz and produced by 20th Century-Fox. This restored and colorized version of the groundbreaking classic highlights one of the earliest and most powerful portrayals of race relations in American cinema. With its tense performances, socially conscious themes, and striking cinematography, this film remains essential viewing for audiences across the United States, Europe, and beyond.\n\nPlot Summary:\nThe story follows Dr. Luther Brooks (Sidney Poitier, in his feature film debut), a newly appointed African American physician at a county hospital. On his first night on duty, Brooks is confronted with a life-and-death situation involving two white brothers brought in after a botched robbery. One of them dies during treatment, and despite Brooks’s best efforts, suspicion and hostility immediately turn against him.\n\nThe surviving brother, Ray Biddle (Richard Widmark), consumed by hatred and prejudice, accuses Brooks of murder and begins stirring up racial violence in the community. As tensions escalate, Brooks faces harassment, intimidation, and moral pressure, but he refuses to abandon his professional duty and integrity. Caught in the middle are Nurse Edie Johnson (Linda Darnell) and Dr. Dan Wharton (Stephen McNally), who try to navigate the explosive fallout.\n\nThe film builds toward a violent confrontation that forces characters — and audiences — to reckon with the destructive nature of prejudice and the courage required to stand against it.\n\nCast and Crew:\n• Director: Joseph L. Mankiewicz\n• Producer: Darryl F. Zanuck\n• Screenplay: Joseph L. Mankiewicz, Lesser Samuels\n• Cinematography: Milton Krasner\n• Editing: Barbara McLean\n• Music: Alfred Newman\n\nStarring:\n• Sidney Poitier as Dr. Luther Brooks\n• Richard Widmark as Ray Biddle\n• Linda Darnell as Edie Johnson\n• Stephen McNally as Dr. Dan Wharton\n• Mildred Joanne Smith as Cora Brooks\n• Stanley Ridges as Dr. Sam Moreland\n• Ossie Davis (uncredited, early role)\n\nFilm Significance:\nNo Way Out stands as a milestone in Hollywood history, introducing Sidney Poitier to audiences in a commanding role that would define his career. The film directly confronted racial prejudice at a time when few mainstream productions dared to do so, earning both praise and controversy upon release. Its stark portrayal of hatred, fear, and resilience resonates decades later, making it more than just a noir drama — it is a socially significant work of American cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like No Way Out remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1950 release was in black and white, reflecting the aesthetic of its era. While visually striking, black-and-white films are often skipped by modern audiences. By offering a colorized edition, we preserve the integrity of Joseph L. Mankiewicz’s direction while enhancing accessibility for contemporary viewers. This edition allows today’s audience to experience Sidney Poitier’s powerful debut and Richard Widmark’s searing performance in a format that feels vivid and alive.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our mission ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#NoWayOut1950 #SidneyPoitier #RichardWidmark #LindaDarnell #PublicDomainMovie #ColorizedClassic #FilmNoir #ClassicHollywood #JosephLMankiewicz #1950sDrama #CivilRightsCinema #GoldenAgeHollywood #RestoredClassics #ColorizedPublicDomain",
      "addedAt": "2025-12-24T00:48:28.814Z",
      "thumbnail": "https://i.ytimg.com/vi/SDd6_1vHyI4/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBXKEcwDw==&rs=AOn4CLBt0jy567nqaaFglgaxSxKxo0e8pg",
      "duration": 6341,
      "language": "en",
      "year": 1950,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "106 min",
    "imdbRating": 7.4,
    "imdbVotes": 6522,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "The Biddle brothers, shot while robbing a gas station, are taken to the prison ward of the County Hospital; Ray Biddle, a rabid racist, wants no treatment from black resident Dr. Luther Brooks. When brother John dies while Luther tries to save him, Ray is certain it's murder and becomes obsessed with vengeance. But there are black racists around too, and the situation slides rapidly toward violence.",
    "Director": "Joseph L. Mankiewicz",
    "Writer": "Joseph L. Mankiewicz, Lesser Samuels, Philip Yordan",
    "Actors": "Richard Widmark, Linda Darnell, Stephen McNally",
    "Language": "English, American Sign ",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 win & 2 nominations total"
  },
  "relatedMovies": [
    "tt0041487",
    "tt0038965",
    "tt0042832",
    "tt0042052",
    "tt0041251",
    "tt0044314",
    "tt0044552",
    "tt0042869",
    "tt0043142",
    "tt0042274",
    "tt0042394",
    "tt0043292"
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.899Z"
}