{
  "imdbId": "tt0043456",
  "title": "The Day the Earth Stood Still",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-day.-the.-earth.-stood.-still.-1951",
      "id": "the.-day.-the.-earth.-stood.-still.-1951",
      "title": "The Day the Earth Stood Still (1951)",
      "description": "\"The Day the Earth Stood Still\" is a 1951 science fiction film directed by Robert Wise. It stars Michael Rennie as Klaatu, an alien visitor, and Patricia Neal as Helen Benson. The film is notable for its social commentary on the Cold War era, addressing themes of peace, fear of the unknown, and humanity's potential for destruction.Klaatu arrives on Earth in a spaceship, accompanied by a powerful robot named Gort. His mission is to deliver a warning to humanity about its violent ways and to advocate for peaceful coexistence across the universe. However, upon his arrival, he faces hostility from the military and struggles to communicate his message. The film is recognized as a classic of the sci-fi genre and has influenced numerous works in film and literature. Its iconic phrase, \"Klaatu barada nikto,\" has become a pop culture reference. The film also sparked discussions about technology, ethics, and the importance of global unity, which remain relevant today.",
      "fileSize": 893996535,
      "addedAt": "2026-01-07T00:12:33.207Z",
      "thumbnail": "https://archive.org/services/img/the.-day.-the.-earth.-stood.-still.-1951",
      "language": "eng",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 204
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/day-the-earth-stood-still-1951",
      "id": "day-the-earth-stood-still-1951",
      "title": "Day the Earth Stood Still 1951 colorized (Michael Rennie)",
      "description": "When a flying saucer lands on the mall in Washington, DC, the lone occupant (Michael Rennie) is shot by a jumpy soldier. The wounded alien escapes and moves in as a boarder with an Earth family (Patricia Neal, Hugh Marlowe, Billy Gray) in order to learn more about our planet. colorized by Color Systems Technology",
      "fileSize": 515233490,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/day-the-earth-stood-still-1951",
      "language": "eng",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 72004
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "92 min",
    "imdbRating": 7.7,
    "imdbVotes": 89275,
    "Genre": "Drama, Sci-Fi",
    "Plot": "Travelling with mind-boggling speed, a gleaming unidentified flying object zooming in from the boundless deep space, penetrates the Earth's atmosphere, landing smoothly in Cold War-Washington, D.C. Encircled by large yet feeble military forces, the peaceful intergalactic ambassador, Klaatu, emerges from the mysterious vessel accompanied by the silently dangerous robot of incomprehensible power, Gort, only to witness firsthand the earthlings' hospitality. The sophisticated humanoid declares that he comes in peace; however, he needs to assemble the world's greatest minds to hear his merciful warning and a definitive ultimatum. Is Klaatu the messenger of humanity's doom?",
    "Director": "Robert Wise",
    "Writer": "Edmund H. North, Harry Bates",
    "Actors": "Michael Rennie, Patricia Neal, Hugh Marlowe",
    "Language": "English, French, Hindi, Russian",
    "Country": "United States",
    "Awards": "3 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0043660",
    "tt0044476",
    "tt0045682",
    "tt0044876",
    "tt0046963",
    "tt0044750",
    "tt0045073",
    "tt0044778",
    "tt0039211",
    "tt0053133",
    "tt0043887",
    "tt0043959"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T19:14:59.887Z"
}