{
  "imdbId": "tt0054997",
  "title": "The Hustler",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-hustler-1961_202511",
      "id": "the-hustler-1961_202511",
      "title": "The Hustler (1961)",
      "description": "The Hustler is a classic American film released in 1961 , directed by Robert Rossen . It stars Paul Newman as \"Fast Eddie\" Felson, a talented but arrogant pool hustler, alongside Jackie Gleason , who plays the legendary player Minnesota Fats, and Piper Laurie as Sarah, Eddie's love interest. The film follows Fast Eddie as he seeks to prove himself in the world of professional pool. Obsessed with beating Minnesota Fats, Eddie enters a high-stakes match against him, risking everything in a bid for respect and recognition. Throughout the film, Eddie grapples with the darker aspects of ambition, addiction, and the consequences of his relentless pursuit of success. ",
      "fileSize": 1186259519,
      "addedAt": "2026-01-07T00:12:10.588Z",
      "thumbnail": "https://archive.org/services/img/the-hustler-1961_202511",
      "language": "eng",
      "year": 1961,
      "collection": "feature_films",
      "downloads": 325
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "134 min",
    "imdbRating": 7.9,
    "imdbVotes": 89891,
    "Genre": "Drama, Sport",
    "Plot": "\"Fast\" Eddie Felson is a small-time pool hustler with a lot of talent but a self-destructive attitude. His bravado causes him to challenge the legendary \"Minnesota Fats\" to a high-stakes match, but he loses in a heartbreaking marathon. Now broke and without his long-time manager, Felson faces an uphill battle to regain his confidence and his game. It isn't until he hits rock bottom that he agrees to join up with ruthless and cutthroat manager Bert Gordon. Gordon agrees to take him on the road to learn the ropes. But Felson soon realizes that making it to the top could cost him his soul, and perhaps his girlfriend. Will he decide that this is too steep a price to pay in time to save himself?",
    "Director": "Robert Rossen",
    "Writer": "Sidney Carroll, Robert Rossen, Walter Tevis",
    "Actors": "Paul Newman, Jackie Gleason, Piper Laurie",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 2 Oscars. 13 wins & 21 nominations total"
  },
  "relatedMovies": [
    "tt0039204",
    "tt0054385",
    "tt0039515",
    "tt0041113",
    "tt0055278",
    "tt0059641",
    "tt0057426",
    "tt0054809",
    "tt0054817",
    "tt0053987",
    "tt0053712",
    "tt0054627"
  ],
  "collections": [
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.588Z"
}