{
  "movieId": "tt0028919",
  "title": "Die ganz großen Torheiten",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1939-die-ganz-grossen-torheiten-paula-wessely-rudolf-forster-hedwig-bleibtreu-ha",
      "id": "1939-die-ganz-grossen-torheiten-paula-wessely-rudolf-forster-hedwig-bleibtreu-ha",
      "title": "1939 Die Ganz Großen Torheiten ( Paula Wessely, Rudolf Forster, Hedwig Bleibtreu, Hans Olden, Gustav Waldau, Bruno Hübner)",
      "description": "Film aus dem deutschen dritten Reich von 1939. Die ganz großen Torheiten. u.a mit Paula Wessely und Rudolf Forster ",
      "fileSize": 659368397,
      "addedAt": "2026-01-07T00:06:02.056Z",
      "thumbnail": "https://archive.org/services/img/1939-die-ganz-grossen-torheiten-paula-wessely-rudolf-forster-hedwig-bleibtreu-ha",
      "language": "ger",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 167
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 7.1,
    "imdbVotes": 15,
    "Genre": "N/A",
    "Plot": "Outstanding and impressive love &amp; coming-of-age drama and a film that is only a few marks off being a masterpiece, and one that deserves repeated viewing. Superbly directed by Carl Froelich with an overall excellent cast and superb cinematography. The weak point is in the editing: surely not bad or so, but quite some scenes and shots are cut in such a way that some scenes never get the chance to come to peace, some cutting should have been maybe fragments of a second later to make it a more tranquil film; as it is now, it is sometimes hop-hop from one scene or shot to the other.But let's look at all the brilliant things for all. The film is based on an also outstanding script that is sensitive, but never sentimental. A script that tells the story as a film should tell a story: not (only) through the dialogue but first and for all by using the medium. As such it is full of brilliant ideas that work extremely well; only repeated viewing will show them all. The most important one is the incorporating of a song called \"Einmal ist keinmal\", sung in the beginning of the film and that is a pillar for the film. The lines of the song are a view in advance of what is going to  happen and the psychological state Paula Wessely's character is in. It is constantly referred to in the course of the film: in the background, as accompaniment during a conversation (Wessely's partner playing a few notes), in the dialogue.The mutual attraction of Rudolf Foster's and Paula Wessely's characters is emphasized by music of Beethoven (Egmont); her declaration of love is done not directly, but in scene where she (student at a acting course) has to play a role of a woman in love: only when he (the teacher) forces her to do it well and stands in front of her she plays the dramatic scene as it should: it is the theater that brings them closer to one another. In fact, both are playing a part on and off stage.A couple of other fine ideas. When, with the drama on its height, the baron on a party states that \"the situation is difficult but not without hope\" he is not only making a joke about something, but also commenting on the film's story.  Note also the scene in which Paula Wessely leaves that same party heart-broken: she is literally swept of the image by two women who are sweeping the floor.Froelich makes very good use of the splendid sets and in this department there are some visual treasures. The somewhat Bauhaus like building with its glass front has a continuous lift; such a lift is called \"Paternoster Aufzug\" in German; this lift is frequently central in scenes and keeps moving people up and down: to and from heaven. It moves Wessely's character up when she has decided to commit suicide; again: no superfluous dialogue here, just the image of the lift and Wessely's acting. A lot of the action (including a party) takes place in a night-club called Der Großmogul (the Great Mogul; what a name, think about it!).As already stated: the cast is excellent and the film could not have been better cast in the leads. Both Paula Wessely and Rudolf Foster are, if possible, maybe more than excellent: their involvement in their parts is nothing less than extremely intense. I think this is Wessely's best film; watch only that scene in which for the first times she visits the restaurant as a novice in the big city, looking around to know how to behave, smoking a cigarette she does not like etc. As can be expected with Carl Froelich, the bit parts are also very well-done; I particularly like the cynic doorman of the hotel.The music is great too. I only know Ralph Benatzky as a routine composer of light operettas, but here he has composed some very haunting music that will stay in your mind for days, as will the film itself.",
    "Director": "Carl Froelich",
    "Writer": "Marianne von Angern, Erwin Heß",
    "Actors": "Paula Wessely, Rudolf Forster, Hilde Wagener",
    "Language": "German",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025583",
    "tt0034860",
    "tt0026631",
    "tt0028606",
    "tt0135858",
    "tt0028594",
    "tt0029110",
    "tt0029730",
    "tt0028913",
    "tt0028922",
    "tt0131420",
    "tt0029142"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:02.056Z"
}