{
  "movieId": "tt0063242",
  "title": "Love Camp 7",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/love.-camp.-7.1969.1080p.-blu-ray.-h-264.-aac-rarbg",
      "id": "love.-camp.-7.1969.1080p.-blu-ray.-h-264.-aac-rarbg",
      "title": "Love Camp 7 (1969)",
      "description": "IMPORTANT DISCLAIMER: THIS VIDEO DOES NOT REFLECT MY PERSONAL VIEWS AT ALL! I DO NOT CONDONE THE ROMANTICISM OF NAZISM OR THE FETISHIZATION OF NAZISM! TAKE THIS AS A LESSON AS TO WHY THIS KIND OF MEDIA WAS WRONG THEN AND WRONG NOW!    WARNING: THIS FILM CONTAINS GRAPHIC SEXUAL CONTENT, NUDITY AND  DEPICTIONS OF SEXUAL VIOLENCE AND SEXUAL ABUSE! VIEWER DISCRETION IS ADVISED!   FOR ADULTS ONLY! 18+ Two female Army agents go undercover at a Nazi prison camp to get information from a scientist being held there.",
      "fileSize": 3931906959,
      "addedAt": "2026-01-07T00:09:38.894Z",
      "thumbnail": "https://archive.org/services/img/love.-camp.-7.1969.1080p.-blu-ray.-h-264.-aac-rarbg",
      "language": "eng",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 132052
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "96 min",
    "imdbRating": 3.9,
    "imdbVotes": 1243,
    "Genre": "Drama, Horror, Thriller",
    "Plot": "With the whole of Europe suffering under the thumb of the Nazis and England itself being under constant bombardment, the American commander, General Olson, and the British officer, Major Latham, have devised a bold scheme to mark a turn of the tide in the war. Now, with victory in their minds, the WAC Lieutenants, Linda Harman and Grace Freeman, have five short days to secure vital pieces of information from the doomed POW, Martha Grossman, and endure humiliation, torture, and degradation in the name of freedom. But before long, in vile Sergeant Klaus Müller's specialised camp, the two female inmates will realise that they live to serve one purpose only: to please the hungry-for-sex front-line officers of the Third Reich. Can the enslaved undercover agents fulfil their dangerous mission and escape from the infamous Love Camp 7 in one piece?",
    "Director": "Lee Frost",
    "Writer": "Bob Cresse, Wes Bishop",
    "Actors": "Bob Cresse, Maria Lease, Kathy Williams",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0059646",
    "tt1149606",
    "tt2741564",
    "tt0079082",
    "tt0090197",
    "tt0036307",
    "tt0055478",
    "tt0082497",
    "tt0017048",
    "tt0077174",
    "tt0038343",
    "tt0211971"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.894Z"
}