{
  "imdbId": "tt0045334",
  "title": "Without Warning!",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/withoutwarning1952_202001",
      "id": "withoutwarning1952_202001",
      "title": "Without Warning (1952) Adam Williams, Meg Randall, Ed Binns - Film Noir Full Movie",
      "description": "Without Warning! is a 1952 American film noir crime film directed by Arnold Laven and starring Adam Williams, Meg Randall, and Ed Binns. The film is shot in a semidocumentary-style with police procedural voice-over narration in parts.    Without Warning is a very interesting viewing experience because it introduces some investigative techniques that have become much more prevalent and advanced in recent years – analysing crime scenes, fabric fibers, cigarette butts, soil and criminal profiling.  Wikipedia: https://en.wikipedia.org/wiki/Without_Warning! Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 552787140,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/withoutwarning1952_202001",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 6834
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": 6.6,
    "imdbVotes": 586,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Carl Martin is a morose and deranged Los Angeles gardener, who, in retribution for the infidelity of his unfaithful wife, sets about to kill as many blondes as he can. From the time the film opens, to the sound of a radio turned up full-blast over the still-warm corpse of a blonde, the audience knows the identity of the killer. The film depicts, with documentary realism (as it was shot on location in and around Los Angeles), how the police, using laboratory techniques against the few clues they have, track down Martin. Their key clue is a spring from a pair of garden shears. The police move in just as Martin is about to add Jane Saunders, the daughter of a greenhouse owner, to his long list of victims.",
    "Director": "Arnold Laven",
    "Writer": "William Raynor",
    "Actors": "Adam Williams, Meg Randall, Edward Binns",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0046514",
    "tt0046928",
    "tt0043397",
    "tt0044357",
    "tt0044789",
    "tt0045124",
    "tt0045161",
    "tt0045267",
    "tt0044417",
    "tt0044552",
    "tt0044847",
    "tt0044476"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}