{
  "imdbId": "tt0038277",
  "title": "'Neath Canadian Skies",
  "year": 1946,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L_38MMVKQGg",
      "id": "L_38MMVKQGg",
      "title": "'Neath Canadian Skies (1946) RUSSELL HAYDEN🍕 COWBOY WESTERN",
      "description": "Stars: Russell Hayden, Inez Cooper, Douglas Fowley\nDirector: B. Reeves Eason\n\nSaddle up for a thrilling 1946 cowboy western adventure starring Russell Hayden, Inez Cooper, and Douglas Fowley, under the dynamic direction of B. Reeves Eason. This action-packed classic follows a courageous Canadian Mountie who goes undercover as an outlaw to take down a ruthless gang of gold mine claim jumpers. With danger lurking in every shadow of the wild frontier, it’s a gripping tale of justice, loyalty, and bravery beneath the wide-open skies of the North.\n\nPerfect for fans of classic westerns, vintage cinema, and old-school cowboy films, this movie delivers everything you love—gunfights, gritty heroes, and unforgettable characters. Whether you’re a longtime Russell Hayden enthusiast or discovering Inez Cooper and Douglas Fowley for the first time, this hidden gem from the golden age of westerns deserves a spot on your watchlist.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPresented by PizzaFLIX, this vintage gem is a must-watch for fans of Cowboy Westerns, 1940s Westerns, and Russell Hayden films. With strong performances from Inez Cooper and Douglas Fowley, and tight direction from B. Reeves Eason, it’s a forgotten treasure from Hollywood’s golden era.\n\nHit like, drop a comment, and subscribe for more timeless Western adventures restored for today’s audience!\n\n#RussellHayden #ClassicWesterns #CowboyMovies #InezCooper #DouglasFowley #BReevesEason #PizzaFLIX #VintageWesterns #OldWesternMovies #1940sWesterns #WesternMystery",
      "addedAt": "2025-12-24T01:03:23.787Z",
      "thumbnail": "https://i.ytimg.com/vi/L_38MMVKQGg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAG1ykoKXzpExJ6fOXCH86FkNejEA",
      "duration": 2449,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "41 min",
    "imdbRating": 6.6,
    "imdbVotes": 68,
    "Genre": "Short, Western",
    "Plot": "Thompson is after Elliot's gold mine. If he can keep it inactive for one year he can file on it. But when his men kill a mountie, Tim is sent to investigate. Posing as an outlaw, he hopes to trap the gang by making a deal with them. But he is in trouble when his true identity becomes known.",
    "Director": "B. Reeves Eason",
    "Writer": "James Oliver Curwood, Arthur V. Jones",
    "Actors": "Russell Hayden, Inez Cooper, Douglas Fowley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040653",
    "tt0153862",
    "tt0041811",
    "tt0028163",
    "tt0039782",
    "tt0015477",
    "tt0018654",
    "tt0012543",
    "tt0022883",
    "tt0003943",
    "tt0001613",
    "tt3610098"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:33.931Z"
}