{
  "movieId": "tt0011635",
  "title": "Robbery Under Arms",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Robbery_Under_Arms",
      "id": "Robbery_Under_Arms",
      "title": "Robbery Under Arms",
      "description": "This 1920 silent film was made by Kenneth Brampton, who wrote, produced, directed and starred in it. The story concerns a real life bushranger (outlaw) named Captain Starlight, who became a national hero (like Ned Kelly). It is based on a classic Australian novel by Rolf Boldrewood (the pen name of Thomas Browne). This was the third film of the novel. The first, directed by Charles McMahon, was an early feature film made shortly after \"The Story of the Kely Gang\". The second was made in 1911. The 1957 Rank Organisation production starring Peter Finch was one of the most popular Australian films of the 1950s. It was again remade as a TV mini-series in 1985 starring Sam Neill. The 1920 version is one of the few surviving independently produced Australian silent films. This version comes from a video tape released by the New South Wales Department of Education, Sydney in 1984. This is from a multi-generational VHS copy. I have put the video through as much video noise reduction as I could without effecting the image. Its not very good quality but this is a decent movie and a valuable artifact. There is no musical soundtrack. This video is completely silent.",
      "fileSize": 844517026,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/Robbery_Under_Arms",
      "language": "English",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 16217
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "53 min",
    "imdbRating": 5.2,
    "imdbVotes": 48,
    "Genre": "Drama, Western",
    "Plot": "Two brothers, Dick and Jim Marsden, become involved with the bushranger, Captain Starlight. They romance two girls, work on the goldfields, and are captured by the police after Starlight is shot dead",
    "Director": "Kenneth Brampton",
    "Writer": "Rolf Boldrewood, Kenneth Brampton",
    "Actors": "Jackie Anderson, Vera Archer, Kenneth Brampton",
    "Language": "None",
    "Country": "Australia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0197903",
    "tt0011393",
    "tt0011358",
    "tt0011779",
    "tt0010316",
    "tt0010726",
    "tt0008892",
    "tt0009273",
    "tt0007610",
    "tt0008319",
    "tt0014770",
    "tt0015881"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}