{
  "imdbId": "tt0039821",
  "title": "The Shop at Sly Corner",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-shop-at-sly-corner-1947-colorized-movie-720p-hd",
      "id": "the-shop-at-sly-corner-1947-colorized-movie-720p-hd",
      "title": "The Shop at Sly Corner - Code of Scotland Yard (restored, colorized) (1947, film-noir, imdb score: 6.7)",
      "description": "Code of Scotland Yard is a 1947 British crime film directed by George King and starring Oskar Homolka, Muriel Pavlow and Derek Farr. It was originally released as The Shop at Sly Corner , being based on the popular stage play of that title by Edward Percy.",
      "fileSize": 1196360783,
      "addedAt": "2026-01-07T00:12:22.159Z",
      "thumbnail": "https://archive.org/services/img/the-shop-at-sly-corner-1947-colorized-movie-720p-hd",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 263
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theshopatslycorner",
      "id": "theshopatslycorner",
      "title": "The Shop at Sly Corner",
      "description": "“Homolka is superb” “Drama with a thriller twist” “Excellent UK film Noir” “Well worth the viewing time” (IMDB reviews quotes). A genteel British crime drama that regardless of what some of its reviewers claim really isn’t film noir. Oskar Homolka leads its competent cast. The production values are adequate. You probably won’t mind that the conclusion is a bit contrived. Not to be confused with the 1946 TV movie with the same title. IMDB rating 6.8. Produced and directed by George King. Released in 1947 (UK). Complete print (PAL transfer) AKA “Code of Scotland Yard” CAST NOTES: Diana Dors’ uncredited film debut. Katie Johnson (music box lady uncredited) would later become internationally famous for playing Mrs Wilberforce in the the Alec Guinness comedy “The Ladykillers.\"",
      "fileSize": 1286772326,
      "addedAt": "2026-01-07T00:12:44.281Z",
      "thumbnail": "https://archive.org/services/img/theshopatslycorner",
      "collection": "feature_films",
      "downloads": 8084
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "91 min",
    "imdbRating": 6.6,
    "imdbVotes": 422,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Descius Heiss is a French expatriate, and former Devil's Island prisoner, with two passions; driving shrewd bargains in antiques at his Sly Corner Shop, and the care of his Beautiful violin-playing daughter, Margaret. But, his comfortable wealth comes more from being a fence for stolen goods than it does buying-and-selling antiques. His secret is discovered by his shop assistant Archie Fellowes (Kenneth Griffith), a nasty, sniveling young scroat, who keeps blackmailing Heiss until he goes to far. The film ends in a London concert-hall where Margaret is playing the Mendelssohm Violin Concerto.",
    "Director": "George King",
    "Writer": "Katherine Strueby, Reginald Long, Edward Percy",
    "Actors": "Oscar Homolka, Derek Farr, Muriel Pavlow",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039515",
    "tt0039335",
    "tt0039224",
    "tt0039311",
    "tt0039482",
    "tt0039536",
    "tt0039217",
    "tt0040525",
    "tt0039730",
    "tt0039389",
    "tt0039820",
    "tt0039883"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.281Z"
}