{
  "imdbId": "tt0027807",
  "title": "It Couldn't Have Happened (But It Did)",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/It_Couldnt_Have_Happened",
      "id": "It_Couldnt_Have_Happened",
      "title": "It Couldn't Have Happened, But It Did",
      "description": "Playwright turns crimesolver when the play's two producers are murdered.",
      "fileSize": 2373688028,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/It_Couldnt_Have_Happened",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 12808
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Hya0uPdAUVE",
      "id": "Hya0uPdAUVE",
      "title": "It Couldn't Have Happened...But It Did (1936) JACK LA RUE",
      "description": "Stars: Reginald Denny, Evelyn Brent, Jack La Rue \nDirector: Phil Rosen\n\n When a play's two producers are murdered, the playwright tries to solve the crime. Watch for a young Hugh Marlowe, billed here as John.",
      "addedAt": "2025-12-26T23:54:08.110Z",
      "thumbnail": "https://i.ytimg.com/vi/Hya0uPdAUVE/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhiIGIoYjAP&rs=AOn4CLB1k0e1OOxUaO49d0Iq565onEN_nA",
      "duration": 4200,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": 6,
    "imdbVotes": 155,
    "Genre": "Comedy, Crime, Mystery",
    "Plot": "Ellis Holden and Norman Carter, New York theatrical producers, are currently producing a murder mystery written by Greg Stone and starring Beverly Blake, Holden's wife. During rehearsal, Beverly, a prima donna, convinces Holden that actor Bob Bennett should be replaced. A genial gangster named Smiley Clark, who is backing the show, introduces Holden and Carter to a young actress named Louise, but when they turn her down for a part, Smiley threatens them. Beverly's handsome, young co-star, Edward Forrest, is in love with her, but she is having an affair with Carter, who wants to reveal their relationship to Holden. When the actors stage the murder scene, Smiley suggests replacing the poison needle called for in the script with a rope, and demonstrates how to make a murder look like suicide. Bennett is forced to quit the show and says goodbye. Later in Holden's and Carter's office as Greg dictates a love scene to the producers' secretary, Linda Sands, a spirited redhead who loves Greg, Carter is shot dead. After Lieutenant O'Neill arrives on the scene, Linda, hoping to involve Greg in the case so that he will be inspired to write a good mystery, tells O'Neill that Greg had a motive for killing Carter, as he wanted to be released from his contract. Linda and Greg immediately assume that Holden killed Carter, but then Holden is found dead in his closet at home, trussed up. When Greg resists Linda's advice that he use the case for publicity, she tips off a Broadway gossip columnist that Greg has solved the murders. At Linda's suggestion, Smiley convinces Greg to solve the case and clear Smiley's name. O'Neill holds an inquest, with all the suspects in attendance. Smiley insists he was at a Shirley Temple movie at the time of the murder. Linda and Greg report that Holden left the office at 4:30, but according to the coroner's report, he died between two and three o'clock; therefore, he could not have killed Carter. That night the suspects show up at Greg's apartment to clear themselves and O'Neill enters in search of the police report, which has been stolen. Linda, who had Smiley's men steal the report, successfully evades the search and hands over the papers to Greg, who discovers that he is O'Neill's number one suspect. He also learns that the fatal bullet completely penetrated Carter's body, and the slug has not been found. Traces of tetralatim, a chemical used in stage make-up, had been found in Carter's office. The next morning, Smiley arrives at Greg's with a trunk containing Forrest, who was trying to escape with Beverly. Meanwhile, in his research at the Putnam Library, Greg reads an account of a suicide in which a man shot himself without a bullet by putting water in the gun barrel. After Greg escapes an attempt on his life in the library, he, Linda and Smiley decide to reenact the murder. That night at the theater, O'Neill and all the suspects but Bennett are in attendance. Greg narrates the action: Holden gets a tip about his wife's love affair, along with instructions to meet the informant at Holden's apartment. Carter listens in on the call and, fearing that he will be named as Beverly's lover, rushes out of the office to beat Holden home. The killer, Greg explains, had no intention of meeting Holden, and had used the tip as a ruse to get Holden out of the office so he could kill Carter. At the apartment, Carter and Holden meet, fight, and Holden is killed. Carter then ties him up to make it look like Smiley had killed him, and returns to his office and removes the valuables from the safe. The murderer has arrived before him, dressed like Holden to keep Greg and Linda from becoming suspicious. The murderer enters Carter's office through the adjoining door to Holden's office, puts water in the gun and shoots Carter. He then exits through the reception office. Greg then identifies the murderer as the one who loved Beverly Blake, the man whose career Holden had crushed years before. Beverly had goaded the man into killing Carter so that her husband would be blamed and she would be rid of both men. After Beverly blurts out that the killing was Bennett's idea, Greg approaches a man in disguise who is tied to a chair on stage and reveals him as Bennett. When Greg unties him, Bennett pulls a gun on Greg, but Linda triggers the trap door on the floor and both men fall in. After Bennett is apprehended, O'Neill confesses to Greg that he knew he was innocent all the time, but hoped Greg would solve the crime. Smiley promises to back Greg's next show. Then Greg asks Linda what she would like as payment for saving his life, and as Smiley turns out the stage lights, Linda answers Greg with a kiss.",
    "Director": "Phil Rosen",
    "Writer": "Arthur T. Horman",
    "Actors": "Reginald Denny, Evelyn Brent, Jack La Rue",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027568",
    "tt0027398",
    "tt0024443",
    "tt0024605",
    "tt0030857",
    "tt0032017",
    "tt0033928",
    "tt0028375",
    "tt0034117",
    "tt0027974",
    "tt0020267",
    "tt0027564"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}