{
  "imdbId": "tt0030839",
  "title": "Telephone Operator",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TelephoneOperator37",
      "title": "TelephoneOperator37",
      "description": "Title: Telephone Operator Summary: A telephone operator covering for a friend's \"fling\" finds herself in the middle of a major disaster when the city is hit by a big flood and her switchboard is the center of communications. Directed by: Scott Pembroke Actors: Judith Allen, Grant Withers, Warren Hymer Production Company: Monogram Pictures Release Date: 7 December 1937 (USA) Aspect Ratio: 1.37 : 1 Helen Malloy (",
      "id": "TelephoneOperator37"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AJEqewvCggI",
      "title": "Telephone Operator (1937) | Colorized Public Domain Romantic Comedy | Judith Allen and Grant Withers",
      "description": "Telephone Operator (1937) is an American romantic comedy directed by Scott Pembroke. This restored and colorized version revives a charming Depression-era film that blends romance, humor, and melodrama into a lively story of small-town connections and modern technology. Released at a time when telephones symbolized progress and communication across America, the film captures the quirks of daily life while telling a lighthearted love story set against the backdrop of switchboards and operator chatter. By presenting this colorized edition, audiences in the USA, Europe, and worldwide can rediscover a lesser-known classic from the Golden Age of Hollywood.\n\nPlot Summary:\nThe story follows Helen (Judith Allen), a bright and determined telephone operator who becomes entangled in the lives of the townspeople she serves. Her work at the switchboard gives her a front-row seat to the gossip, romance, and struggles of the community. Helen soon finds herself caught between professional duty and personal feelings when she develops a romance with Joe (Grant Withers), a lineman whose dedication and charm win her admiration.\n\nComplications arise when rivalries, misunderstandings, and the meddling of others interfere with their growing relationship. Helen’s job places her at the center of a series of comedic entanglements, where overheard conversations and crossed wires create both drama and laughter. Ultimately, the film delivers a blend of romance and comedy that reflects the optimism of small-town America during the late 1930s.\n\nCast and Crew:\n• Director: Scott Pembroke\n• Screenplay: Joseph O’Donnell\n• Produced by: Conn Pictures Corporation\n• Cinematography: Robert Doran\n\nStarring:\n• Judith Allen as Helen\n• Grant Withers as Joe\n• Mary Treen as Maisie\n• Isabel Jewell as Myra\n• Wallis Clark as Mr. Graham\n• Clay Clement as Banker Edwards\n\nFilm Significance:\nTelephone Operator is representative of the independent B-pictures of the 1930s. While not a major studio release, it showcases the everyday charm and humor that resonated with Depression-era audiences. It captures the cultural fascination with technology, particularly the telephone, which at the time symbolized progress, connectivity, and a rapidly changing world. The film also highlights Judith Allen and Grant Withers, both of whom were prominent faces in mid-level Hollywood productions. Today, it stands as a cultural snapshot of small-town America, combining romance, comedy, and social themes into a compact and entertaining package.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Telephone Operator remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1937 release was produced in black and white, as was typical for independent productions of the era. While historically authentic, modern audiences often overlook black-and-white B-movies. By offering a colorized edition, this restoration makes the film visually appealing while preserving its charm and cultural significance. The new edition breathes fresh life into an overlooked classic, making it enjoyable for contemporary audiences while maintaining its historical value.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TelephoneOperator #1930sComedy #JudithAllen #GrantWithers #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #FilmRestoration #1937Movies #ClassicRomanticComedy",
      "id": "AJEqewvCggI",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/telephone-operator-1937",
      "title": "Telephone Operator (1937)",
      "description": "A telephone operator covering for a friend's \"fling\" finds herself in the middle of a major disaster when the city is hit by a big flood and her switchboard is the center of communications. Watch on RetroFlix:  https://retroflix.org/telephone-operator-1937/",
      "id": "telephone-operator-1937"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/telephone_operator",
      "title": "Telephone Operator",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "telephone_operator"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Zj0HNsiItxw",
      "title": "Telephone Operator (1937) DRAMA",
      "description": "Stars: Judith Allen, Grant Withers and Warren Hymer\nDirector: Scott Pembroke\n\nA telephone operator covering for a friend's \"fling\" finds herself in the middle of a major disaster when the city is hit by a big flood and her switchboard is the center of communications.",
      "id": "Zj0HNsiItxw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": "5.6",
    "imdbVotes": "193",
    "Genre": "Action, Drama, Romance",
    "Plot": "Helen Malloy (Judith Allen), a telephone operator covering for an absent friend, Dottie Stengal (Alice White) finds herself in the middle of a major disaster when the city is hit by a big flood and her switchboard is the center of communications.",
    "Director": "Scott Pembroke",
    "Writer": "John W. Krafft, Scott Darling",
    "Actors": "Judith Allen, Grant Withers, Warren Hymer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0028634",
      "title": "Bill Cracks Down",
      "year": 1937,
      "imdbRating": "5.6",
      "imdbVotes": "108",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026489",
      "title": "Hong Kong Nights",
      "year": 1935,
      "imdbRating": "4.8",
      "imdbVotes": "66",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028592",
      "title": "Atlantic Flight",
      "year": 1937,
      "imdbRating": "4.6",
      "imdbVotes": "92",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029376",
      "title": "Park Avenue Logger",
      "year": 1937,
      "imdbRating": "5.8",
      "imdbVotes": "100",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0140551",
      "title": "Sky Racket",
      "year": 1937,
      "imdbRating": "4.6",
      "imdbVotes": "117",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0169357",
      "title": "Valley of Terror",
      "year": 1937,
      "imdbRating": "5.9",
      "imdbVotes": "102",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027366",
      "title": "Black Gold",
      "year": 1936,
      "imdbRating": "5.2",
      "imdbVotes": "103",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030090",
      "title": "The Duke of West Point",
      "year": 1938,
      "imdbRating": "6.4",
      "imdbVotes": "185",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030023",
      "title": "Crashing Through Danger",
      "year": 1936,
      "imdbRating": "4.6",
      "imdbVotes": "81",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028994",
      "title": "Here's Flash Casey",
      "year": 1938,
      "imdbRating": "5.6",
      "imdbVotes": "101",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029830",
      "title": "Ten Laps to Go",
      "year": 1936,
      "imdbRating": "4.7",
      "imdbVotes": "64",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030911",
      "title": "Under the Big Top",
      "year": 1938,
      "imdbRating": "5.8",
      "imdbVotes": "84",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:00:47.355Z"
}