{
  "movieId": "tt0061981",
  "title": "The Belle Star Story",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BellStarrStory",
      "id": "BellStarrStory",
      "title": "The Belle Star Story",
      "description": "Title: The Belle Star Story Summary: Abused and dominated by men in her youth, Belle Starr now out-rides, out-smokes, out-shoots, and out-gambles them as she makes her way around the Old West, usually wearing male garb. One ... Directed by: Piero Cristofani, Lina Wertmüller Actors: Production Company: Eureka Films Release Date: 15 March 1968 (Italy) Aspect Ratio: REMOVE_TAG Abused and dominated by men in her youth, Belle Starr now out-rides, out-smokes, out-shoots, and out-gambles them as she makes her way around the Old West, usually wearing male garb. One man who's her equal is Larry Blackie with whom she has an on-again, off-again relationship which is often argumentative and sometimes violent. Together they become involved in a robbery which goes awry. Belle has to rescue Larry and though he's grateful, he now wants to go his own way. However, he expresses the hope that someday they'll once more cross paths and then ... who knows?",
      "fileSize": 750088309,
      "addedAt": "2026-01-07T00:06:14.038Z",
      "thumbnail": "https://archive.org/services/img/BellStarrStory",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 5003
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-belle-star-story-1968",
      "id": "the-belle-star-story-1968",
      "title": "The Belle Star Story (1968)",
      "description": "The Belle Starr Story/Il mio corpo per un poker is a 1968 Italian Spaghetti Western film co-written and co-directed by Lina Wertmüller and starring Elsa Martinelli, who also sings the title song. Watch on RetroFlix:  https://retroflix.org/the-belle-star-story-1968/",
      "fileSize": 624337600,
      "addedAt": "2026-01-07T00:11:46.533Z",
      "thumbnail": "https://archive.org/services/img/the-belle-star-story-1968",
      "language": "eng",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 345
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "103 min",
    "imdbRating": 5.2,
    "imdbVotes": 404,
    "Genre": "Western",
    "Plot": "Abused and dominated by men in her youth, Belle Starr now out-rides, out-smokes, out-shoots, and out-gambles them as she makes her way around the Old West, usually wearing male garb. One man who's her equal is Larry Blackie with whom she has an on-again/off-again relationship which is often argumentative and sometimes violent. Together they become involved in a robbery that goes awry. Belle must rescue Larry, and though he's grateful, he now wants to go his own way. However, he expresses the hope that someday they'll once more cross paths and then--who knows?",
    "Director": "Piero Cristofani, Lina Wertmüller",
    "Writer": "Piero Cristofani, Lina Wertmüller",
    "Actors": "Elsa Martinelli, Robert Woods, George Eastman",
    "Language": "Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0062645",
    "tt0062825",
    "tt0198859",
    "tt0063557",
    "tt0065032",
    "tt0063032",
    "tt0063293",
    "tt0063818",
    "tt0162244",
    "tt0067057",
    "tt0064780",
    "tt0061429"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}