{
  "imdbId": "tt0044614",
  "title": "The Fighter",
  "year": 1952,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9bGSKMM7RGo",
      "title": "The Fighter (1952) | Colorized Public Domain Boxing Drama Classic with Richard Conte & Vanessa Brown",
      "description": "The Fighter (1952) is an American sports drama directed by Herbert Kline, inspired by the short story “The Mexican” by Jack London. This gripping tale combines boxing, political struggle, and personal sacrifice into a compelling narrative that reflects both the sweat and spirit of mid-20th-century Hollywood cinema. Produced by United Artists, the film blends action, romance, and social commentary, while showcasing the resilience of individuals fighting for justice and survival. Now fully restored and colorized by Colorized Public Domain, this edition breathes new life into a forgotten gem, making it more accessible and engaging for modern audiences across the United States, Europe, and worldwide.\n\nPlot Summary:\nSet in Mexico during a time of social and political upheaval, the film follows young fighter Felipe Rivera (Richard Conte), a skilled but unproven boxer who rises from obscurity with hopes of using his fists to carve out both personal honor and political change. Orphaned by government brutality, Felipe channels his grief and anger into the boxing ring, where his strength, discipline, and determination set him apart from other fighters.\n\nFelipe becomes involved with revolutionary groups seeking justice for the oppressed. Boxing becomes more than just sport; it transforms into a symbol of resistance, sacrifice, and national pride. Alongside his political battles, Felipe develops a romance with the compassionate Elena (Vanessa Brown), whose support strengthens his resolve but also places her in danger as the conflict escalates.\n\nAs Felipe’s career builds toward a climactic fight against formidable opponents, he must balance personal ambition with loyalty to the revolutionary cause. His struggle captures the essence of Jack London’s original story — a man’s body and soul tested in the fight for dignity, love, and justice.\n\nCast and Crew:\n• Director: Herbert Kline\n• Producers: Stanley Kramer, Carl Foreman (uncredited influences), United Artists\n• Based on the short story “The Mexican” by Jack London\n• Cinematography: Floyd Crosby\n• Music: Dimitri Tiomkin\n\nStarring:\n• Richard Conte as Felipe Rivera\n• Vanessa Brown as Elena\n• Lee J. Cobb as Professor Ruiz\n• Gilbert Roland as Tomas Renaldo\n• Larry Gates as Gonzales\n• Jean Hersholt as Father Delgado\n\nFilm Significance:\nThe Fighter (1952) is one of several films adapted from Jack London’s politically charged story “The Mexican.” Unlike typical boxing pictures of its time, this film connects the brutality of the ring with the struggles of the oppressed, making it both a personal drama and a political allegory. Richard Conte, known for roles in Call Northside 777 (1948) and later The Godfather (1972), delivers a powerful performance as the determined fighter torn between love and revolutionary duty.\n\nLee J. Cobb lends dramatic weight as Professor Ruiz, highlighting the film’s social themes, while Vanessa Brown provides both romance and emotional grounding. Floyd Crosby’s cinematography adds realism and grit, while Dimitri Tiomkin’s score enriches the film’s emotional resonance. Though not as widely remembered as other sports dramas, The Fighter stands out as a socially conscious film from the early 1950s.\n\nEnhanced Public Domain Explanation:\nThe Fighter (1952) has entered the public domain, making it free of copyright restrictions and open to all for preservation, study, and enjoyment. Colorized Public Domain restores this underappreciated classic through digital cleaning, high-definition remastering, and careful colorization. By enhancing this film visually, we ensure that audiences can appreciate its blend of sports action, political commentary, and human drama in a fresh and accessible way.\n\nWhy Watch This Colorized Edition:\nOriginally released in stark black and white, The Fighter captured the raw tension of boxing and revolution with gritty realism. This colorized edition enriches the experience — from the dust and sweat of the boxing ring to the vibrancy of Mexican landscapes and the tense atmosphere of revolutionary meetings. By bridging the authenticity of classic filmmaking with the vividness of modern color, this edition ensures that the film resonates with both seasoned classic cinema fans and new generations of viewers.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nAt Colorized Public Domain, we restore and revitalize forgotten treasures of cinema — from hard-hitting dramas and suspenseful thrillers to heartwarming comedies and literary adaptations. By offering fully colorized editions of public domain films, we connect timeless stories to audiences across the USA, Europe, and beyond.\n\n#TheFighter1952 #RichardConte #VanessaBrown #LeeJCobb #JackLondon #PublicDomainMovie #ColorizedClassic #BoxingDrama #FilmRestoration #1950sMovies #GoldenAgeHollywoo",
      "id": "9bGSKMM7RGo",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the_fighter",
      "title": "Fighter, The",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "the_fighter"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thefighter1952",
      "title": "The Fighter (1952) Richard Conte, Lee J Cobb",
      "description": "The Fighter is a 1952 American film noir boxing film starring Richard Conte and Lee J Cobb. It is based on the short story \"The Mexican\" by Jack London. The film is directed by Herbert Kline and produced by Alex Gottlieb. Kline and Aben Kandel wrote the adapted screenplay   Find out more about the movie here.",
      "id": "thefighter1952"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zHksRC4CQOo",
      "title": "The Fighter (1952) Classic, Drama, Sport | Full Length Movie",
      "description": "JACK LONDON'S bare-knuckled masterpiece of adventure!  In Mexico, a young boxer uses his winnings to buy guns to avenge his family's murder.\n\nDirector: Herbert Kline\nWriters: Aben Kandel, Herbert Kline, & Jack London (story \"The Mexican\")\nStars: Richard Conte, Vanessa Brown, Lee J. Cobb \nGenres: Classics, Drama, Sport \n\n@CultCinemaClassics",
      "id": "zHksRC4CQOo",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "78 min",
    "imdbRating": "5.8",
    "imdbVotes": "177",
    "Genre": "Drama, Sport",
    "Plot": "In 1910, during the Mexican Revolution, the Federal troops of unpopular Mexican President Porfirio Díaz wreak havoc in the countryside eliminating all resistance. The supporters of the Opposition politician Francisco Madero organize armed resistance against Diaz but they need money and weapons. When Federal troops devastate a Mexican village that sheltered fugitive rebel army leader Durango, the soldiers kill most inhabitants but villager Felipe Rivera escapes. He illegally crosses the border into the United States at El Paso, Texas. In El Paso, Felipe seeks help from a Mexican printing shop that prints revolutionary sheets meant to familiarize Americans with the plight of the Mexican rebels. The printing shop hires Felipe as a helper. In order to support himself, Felipe becomes a prize-fighter. Some of the money he wins also goes to the printing shop as a contribution to the cause. Later, Felipe meets a boxing promoter who gradually brings Felipe to the forefront of local boxing league. The printing shop owner, who also is a revolutionary leader, sends Felipe on occasional errands to Mexico. During such an errand, Felipe must go back to Mexico with an important message for rebel leader Durango. In Mexico, Felipe learns that Durango has been captured and imprisoned by the Federal troops. Felipe devises a plan to help rescue Durango from an army prison. Durango tells Felipe that he appreciates the propaganda work done in El Paso by Felipe and his friends but also tells him that weapons are needed by Mexico more than propaganda. Felipe returns to El Paso determined to fund-raise the five thousand dollars needed to buy 1000 old surplus rifles from the U.S. Army. The only way he can raise this huge sum is by competing in major boxing events. Boxing gymnasium owner and boxing promoter Roberts promises Felipe a main event fight against the current boxing champion, in a winner-take-all match. Although much smaller and less experienced than his opponent, Felipe is driven by the enthusiasm of helping the Mexican Revolution with the much needed weapons. He is also motivated by feelings of revenge against the Mexican Federal troops who killed his family and all the inhabitants of his native village.",
    "Director": "Herbert Kline",
    "Writer": "Aben Kandel, Herbert Kline, Jack London",
    "Actors": "Richard Conte, Vanessa Brown, Lee J. Cobb",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0044796",
      "title": "Kid Monk Baroni",
      "year": 1952,
      "imdbRating": "6.1",
      "imdbVotes": "196",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044622",
      "title": "Flesh and Fury",
      "year": 1952,
      "imdbRating": "6.6",
      "imdbVotes": "595",
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045091",
      "title": "The Ring",
      "year": 1952,
      "imdbRating": "6.3",
      "imdbVotes": "843",
      "language": "English, Spanish",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0043678",
      "title": "Iron Man",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "348",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045656",
      "title": "Crazylegs",
      "year": 1953,
      "imdbRating": "5.2",
      "imdbVotes": "157",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0045769",
      "title": "The Final Test",
      "year": 1953,
      "imdbRating": "6.6",
      "imdbVotes": "243",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042005",
      "title": "Under My Skin",
      "year": 1950,
      "imdbRating": "6.5",
      "imdbVotes": "393",
      "language": "English, Italian, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042609",
      "title": "The Jackie Robinson Story",
      "year": 1950,
      "imdbRating": "6.4",
      "imdbVotes": "1,494",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041239",
      "title": "Champion",
      "year": 1949,
      "imdbRating": "7.3",
      "imdbVotes": "4,948",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041958",
      "title": "Thieves' Highway",
      "year": 1949,
      "imdbRating": "7.5",
      "imdbVotes": "7,130",
      "language": "English, Italian, Greek",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048654",
      "title": "The Square Jungle",
      "year": 1955,
      "imdbRating": "6.5",
      "imdbVotes": "383",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043646",
      "title": "Hollywood Story",
      "year": 1951,
      "imdbRating": "6.7",
      "imdbVotes": "1,060",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:51:49.641Z"
}