{
  "movieId": "tt0012304",
  "title": "The Idle Class",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-idle-class-1921-directed-by-charlie-chaplin",
      "id": "the-idle-class-1921-directed-by-charlie-chaplin",
      "title": "The Idle Class (1921) Directed By Charlie Chaplin",
      "description": "The Idle Class Lobby card Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Charlie Chaplin Starring Charlie Chaplin Edna Purviance Henry Bergman Mack Swain Cinematography Roland Totheroh Edited by Charlie Chaplin Music by Johnnie von Haines (1969) Charlie Chaplin (1972) Production company Charles Chaplin Productions Distributed by First National Playhouse Home Video (1985) (USA) Key Video (1989) (USA) (VHS) Image Entertainment (2000) (USA) (DVD) Koch Vision (2000) (USA) (DVD) MK2 Diffusion (2001) (World-wide) (all media) Warner Home Video (2004, DVD) Continental Home Vídeo (Brazil) (VHS) Release date September 25, 1921 Running time 32 minutes Country United States Language Silent (English intertitles) The The Idle Class is a 1921 American silent comedy film written and directed by Charlie Chaplin for First National Pictures. Plot The \"Little Tramp\" heads to a resort for warm weather and golf. At the golf course, the Tramp's theft of balls in play causes one golfer to mistakenly attack another. Meanwhile, a neglected wife leaves her wealthy husband until he gives up drinking. When the Tramp is later mistaken for a pickpocket, he crashes a masquerade ball to escape from a policeman. There, he is mistaken for the woman's husband. Eventually, it is all straightened out, and the Tramp is once more on his way. Cast Charlie Chaplin as Tramp / Husband Edna Purviance as Neglected Wife Mack Swain as Her Father Henry Bergman as Sleeping Hobo / Guest in Cop Uniform Al Ernest Garcia as Cop in Park / Guest John Rand as Golfer / Guest Rex Storey as Pickpocket / Guest Lita Grey as Guest Reception Helen Rockwell of the New York Telegraph wrote, \"...instead of going for a five-reel affair, he has returned to his first short love. But what there is of The Idle Class is so good and so funny that one realizes how much better is it to be entertained by two reels than bored in five.\" [ 1 ] Chaplin biographer Jeffrey Vance describes The Idle Class as “one of Chaplin’s funniest short comedies.” [ 2 ] He notes that Chaplin began production on the film in January 1921 with the working title Vanity Fair : “Ultimately, Chaplin favored a more equivocal title— The Idle Class —for it is purposely not clear in the film which is the idle class: the idle rich or the idle poor. Chaplin plays both. The film took five months to complete, an amazingly long time for a two-reel comedy.” Vance speculates, “It is perhaps ironic that the story of The Idle Class centers on an unhappy marriage between an absent-minded husband and a lonely wife. This state of affairs could easily describe the principal characters of the tragi-comedy that was Chaplin’s own marriage. In the film Chaplin manages to dramatize the two sides of his own personality: Charlie the Tramp and the Absent-minded husband, rich and neglectful, absorbed to his own interests and indifferent to others. The latter was certainly how Mildred Harris [his first wife] regarded Chaplin.” [ 2 ] References 1 \"The Idle Class (25 September 1921)\". Chaplin: Film by Film. August 31, 2018. Retrieved December 4, 2018. 2 Vance, Jeffrey (2003) Chaplin: Genius of the Cinema New York: Harry N. Abrams, pg. 117 and 121. ISBN 0-8109-4532-0 -From Wikipedia",
      "fileSize": 335673668,
      "addedAt": "2026-01-07T00:12:10.588Z",
      "thumbnail": "https://archive.org/services/img/the-idle-class-1921-directed-by-charlie-chaplin",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 360
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "32 min",
    "imdbRating": 7.2,
    "imdbVotes": 4241,
    "Genre": "Short, Comedy",
    "Plot": "The conflict here is between Charlie the wealthy and alcoholic husband and Charlie the Tramp: the idle rich and the idle poor. In the opening scene wealthy Edna descends from a Pullman car while the Tramp crawls out from under another one. At a fancy masquerade ball Edna's husband appears as a knight whose visor is stuck closed. The Tramp shows up, running from the law, and is mistaken for the husband. Edna finds the new \"husband\" more to her liking than the real one. When true identities are revealed, a fight breaks out and the Tramp is ejected.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Edna Purviance, Charles Aber",
    "Language": "None",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0010747",
    "tt0008907",
    "tt0009018",
    "tt0009611",
    "tt0013486",
    "tt0008133",
    "tt0007613",
    "tt0007832",
    "tt0007880",
    "tt0410477",
    "tt0004936",
    "tt0005571"
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.588Z"
}