{
  "movieId": "tt0052187",
  "title": "She Demons",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SheDemons",
      "id": "SheDemons",
      "title": "She Demons",
      "description": "“Where’s my powder-blue cashmere shortie????” Poor little rich girl Jerrie Turner (Irish McCalla) will soon have much more to worry about than her decimated wardrobe. She and her companions Fred Maklin (Tod Griffin) and Sammy Ching (Victor Sen-Yung, Charlie Chan’s #2 son and, later, cook Hop Sing on “Bonanza”)wash up on an uncharted desert island after riding out a hurricane. But that’s just the start of their troubles. Shortly, they’ll encounter dancing “native” girls (perfectly coiffed and painted, and Caucasian), a long-forgotten Nazi outpost, a mad doctor, surgical experiments on said dancing girls (who are later kept in bamboo cages), an active volcano, a possible perpetual energy machine, and the unwelcome romantic advances of the Nazi commander (aimed only at Jerrie). Did I mention that the USAF is also preparing to use the island for practicing its aerial bombing techniques? That’s enough adventure for several B-movies, but “She Demons” manages to cram it all into a mere 76-minute run time.  ",
      "fileSize": 1177297888,
      "addedAt": "2026-01-07T00:06:51.868Z",
      "thumbnail": "https://archive.org/services/img/SheDemons",
      "collection": "feature_films",
      "downloads": 19959
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": 4.5,
    "imdbVotes": 872,
    "Genre": "Horror, Sci-Fi",
    "Plot": "Heroic, but dull, Fred Maklin and beautiful, but spoiled, Jerrie Turner wash up on an uncharted tropical island. They are soon captured by ex-Nazi Colonel Osler, who also has imprisoned a bevy of beauty contest winners whom he allows to be whipped by his slavering Nazi storm troopers. He has, you see, been extracting some glandular substance from the girls to inject into his wife Mona, who suffered terrible facial disfigurement, in efforts to restore her beauty. Things get worse as the island is used for test bombing by the US Air Force.",
    "Director": "Richard E. Cunha",
    "Writer": "Richard E. Cunha, H.E. Barrie",
    "Actors": "Irish McCalla, Tod Griffin, Victor Sen Yung",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0051631",
    "tt0051654",
    "tt0053072",
    "tt0050393",
    "tt0051993",
    "tt0052228",
    "tt0051432",
    "tt0051020",
    "tt0052379",
    "tt0051507",
    "tt0051948",
    "tt0050717"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.868Z"
}