{
  "movieId": "tt0002197",
  "title": "Friends",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-friends",
      "id": "silent-friends",
      "title": "Friends",
      "fileSize": 166989119,
      "addedAt": "2026-01-07T00:10:59.118Z",
      "thumbnail": "https://archive.org/services/img/silent-friends",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 279
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "17 min",
    "imdbRating": 5.5,
    "imdbVotes": 328,
    "Genre": "Short, Western, Romance",
    "Plot": "At the mining-camp of Golden Creek, the little orphan girl of the late proprietor of Golden Creek Inn is the pet of all the miners. Her father had long been their great friend and adviser, and hence his little daughter always commanded their greatest respect. She becomes greatly infatuated with Dandy Jack, who is considered by all as her sweetheart. Jack decides to leave the camp for other diggings, and the little one is almost heartbroken. As he is leaving, he meets Bob, his old chum, who has just arrived at the camp. Their greeting shows clearly the value of that little word \"friends.\" Later on, Bob comes to the Inn and falls deeply in love with the little orphan, who has realized by this time that her feeling for Jack was infatuation rather than love. Hence she and Bob are engaged to be married. Shortly before the day set for the wedding, Jack returns and is twitted by the boys about the apparently fickle girl, whereupon he wagers that he can win her back, not knowing, of course, who the successful suitor is. The outcome is a revelation to all.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Mary Pickford, Henry B. Walthall, Lionel Barrymore",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002282",
    "tt0001387",
    "tt0001371",
    "tt0001458",
    "tt0002497",
    "tt0002302",
    "tt0002176",
    "tt0002357",
    "tt0002795",
    "tt0001978",
    "tt0001452",
    "tt0001292"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}