{
  "movieId": "tt0028737",
  "title": "Confession",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qhNmXDzKYiA",
      "id": "qhNmXDzKYiA",
      "title": "Confession (TOUCHING FEATURE FILM in full length in German, drama films completely in German, new)",
      "addedAt": "2025-12-23T23:54:23.737Z",
      "thumbnail": "https://i.ytimg.com/vi/qhNmXDzKYiA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA0kT9uyBTDT2iGE0nFg-vUSjw29A",
      "duration": 6864,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "87 min",
    "imdbRating": 7.3,
    "imdbVotes": 1311,
    "Genre": "Crime, Drama, Romance",
    "Plot": "It's 1930 in a European metropolis. Lisa Koslov, a young, innocent woman, is a student of piano at the city's music conservatory. She is without her mother for a few days for the first time in her life, her mother, out of town on family business, who she cannot turn to at this time for advice in dealing with the advances of an older man, who she will learn is famed composer/conductor/pianist Michael Michailow. Despite not feeling that spending time with Michael is the right thing, she is unable to fend off his advances, which he is able to manipulate to his advantage. Lisa is on a night out at a cabaret with Michael when the cabaret's aging singer, Vera Kowalska, spots Lisa and Michael in the audience, Vera who shoots Michael dead before he and Lisa can leave. At Vera's murder trial where Lisa is among the eyewitnesses testifying for the prosecution, Vera readily admits that she shot Michael, but she will not talk otherwise to defend herself by providing justifying reasons for her actions. It isn't until the prosecution produces a locked case belonging to Vera, it's contents, of which they are unaware, they believing will contain some supporting evidence, that Vera decides to provide a complete confession, with the caveat that the case not be opened and that her testimony be provided in a closed court, to which the judge and prosecuting attorney eventually agree. Vera then proceeds to tell of her complex relationship with Michael, which dates back to 1912 when she was starring in his opera. As she gets deeper into the story, it becomes clear that her shooting Michael was not only because of a wrong he committed against her in essence ruining her life, but that her wanting to provide this testimony in a closed court was to protect the innocent for a very specific personal reason, with at least one other spectator in the courtroom, beyond the eyewitnesses, who had a previous encounter with Vera.",
    "Director": "Joe May",
    "Writer": "Hans Rameau, Julius J. Epstein, Margaret P. Levino",
    "Actors": "Kay Francis, Basil Rathbone, Ian Hunter",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031449",
    "tt0031863",
    "tt0028607",
    "tt0028770",
    "tt0029050",
    "tt0029238",
    "tt0029319",
    "tt0029362",
    "tt0029378",
    "tt0029812",
    "tt0027568",
    "tt0027784"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:28:43.512Z"
}