{
  "imdbId": "tt0052941",
  "title": "The Jayhawkers!",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7EGUIXraFJc",
      "id": "7EGUIXraFJc",
      "title": "Der Herrscher von Kansas (GANZER WESTERNFILM auf Deutsch komplett, Action Westernfilme kostenlos)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Der entflohene Soldat Cam Bleeker erhält Freiheit im Tausch für die Jagd auf den Jayhawker-Anführer Darcy. Doch als er dessen wahre Absichten erkennt, wendet er sich gegen ihn und hilft, Kansas von der Tyrannei zu befreien.\n\n🎬 Der Herrscher von Kansas (1959)\nOriginaltitel: The Jayhawkers!\nMit: Jeff Chandler, Fess Parker, Nicole Maurey, Henry Silva, Leo Gordon\nRegie: Melvin Frank\nFSK: Ab 16 Jahren\n\nINHALTSANGABE:\nDer ehemalige Soldat Cam Bleeker entkommt aus dem Gefängnis und sucht Zuflucht bei der französischen Emigrantin Jeanne Dubois. Als er von Gouverneur Clayton gefangen genommen wird, bietet dieser ihm die Freiheit an, wenn er Darcy, den Anführer der Jayhawkers, aufspürt. Bleeker schließt sich Darcy an, doch bald erkennt er dessen wahre Absichten und wendet sich gegen ihn. Mit Hilfe des Gouverneurs gelingt es ihm, Darcy zu stürzen und Kansas vor der Tyrannei zu bewahren.\n#Netzkino #ganzerFilm #Western\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:34:51.137Z",
      "thumbnail": "https://i.ytimg.com/vi/7EGUIXraFJc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAO_7-jpjgsbWrFUVXNj_xykgobCQ",
      "duration": 6026,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "100 min",
    "imdbRating": 6.3,
    "imdbVotes": 793,
    "Genre": "Drama, Western",
    "Plot": "Shortly before the start of the American Civil War rebel Kansas leader Luke Darcy dreams of a new independent Republic of Kansas. His vigilante group is called The Jayhawkers and their mission is to end slavery by force. However, Darcy uses The Jayhawkers for his own bid for absolute control of Kansas. Darcy's actions do not sit well with the military governor of Kansas, William Clayton, who wants Darcy captured and brought to justice. For this purpose the governor hires an ex-renegade rebel, Cam Bleeker, to join Darcy's group and capture their leader. Bleeker has a personal reason for wanting to see Darcy hanged. Darcy was responsible for Bleeker wife's death while Bleeker was in prison.",
    "Director": "Melvin Frank",
    "Writer": "Melvin Frank, Joseph Petracca, Frank Fenton",
    "Actors": "Jeff Chandler, Fess Parker, Nicole Maurey",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0053810",
    "tt0052724",
    "tt0051936",
    "tt0051899",
    "tt0050923",
    "tt0054292",
    "tt0051411",
    "tt0051433",
    "tt0051849",
    "tt0052097",
    "tt0054428",
    "tt0186500"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:28:25.747Z"
}