{
  "imdbId": "tt0071877",
  "title": "Murder on the Orient Express",
  "year": 1974,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/murder-on-the-orient-express-1974",
      "id": "murder-on-the-orient-express-1974",
      "title": "Murder on the Orient Express (1974)",
      "description": "Murder on the Orient Express , directed by Sidney Lumet , is a classic mystery film based on Agatha Christie 's novel of the same name. Released in 1974 , it features an ensemble cast and is known for its captivating storytelling and intricate plot. The story revolves around the murder of a wealthy American, Samuel Ratchett , aboard the luxurious Orient Express train. Renowned Belgian detective Hercule Poirot is a passenger who is called to solve the crime. As the train is stopped due to a snowdrift, Poirot interviews the various passengers, uncovering secrets and motives, revealing a web of deception.",
      "fileSize": 939939532,
      "addedAt": "2026-01-07T00:09:54.332Z",
      "thumbnail": "https://archive.org/services/img/murder-on-the-orient-express-1974",
      "language": "eng",
      "year": 1974,
      "collection": "feature_films",
      "downloads": 790
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "128 min",
    "imdbRating": 7.2,
    "imdbVotes": 73264,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "The first class compartment of the December 1935 departure of the Orient Express from Istanbul is full, unusual for this time of the year. Regardless, famed and fastidious Belgian detective, Hercule Poirot, who needs to get back to London immediately, is able to secure last minute passage in the compartment with the assistance of his friend, Signor Bianchi, one of the directors of the train line who is also making the trip. Some of the first class passengers seem concerned about Poirot's presence on the train. At least one of them has reason to be concerned, as later, another first class passenger, who earlier in the trip asked Poirot to provide protection for him due to several death threats, is found murdered in his stateroom by multiple stabbings. At the time the victim is found, the train is unexpectedly stopped and delayed due to snow in remote Yugoslavia, which may be problematic for the murderer in getting away now that Poirot is on the case, which he is doing as a favor to Bianchi as not to get the Yugoslav police involved. Poirot quickly learns that the victim was not who he presented himself to be and has a connection to a five-year-old American kidnapping and murder case of infant Daisy Armstrong, murdered in spite of the fact that her parents had paid the requested ransom. The murderer in that case has long been convicted and executed but the ransom moneys were never recovered, a known accomplice never captured, and both the Armstrong parents have since tragically died. As Poirot questions the train's valet, the victim's accompanying staff, and the other primarily well off first class passengers and their accompanying servants, who are all on the surface more than cooperative, he finds that many had opportunity and motive, the latter which may not be obvious. There is also a great deal of evidence discovered on the train, which pulls his thoughts in many directions. These pieces of information may complicate the deduction of who is the murderer.",
    "Director": "Sidney Lumet",
    "Writer": "Agatha Christie, Paul Dehn, Anthony Shaffer",
    "Actors": "Albert Finney, Lauren Bacall, Martin Balsam",
    "Language": "English, French, German, Turkish, Italian, Swedish, Hungarian",
    "Country": "United Kingdom",
    "Awards": "Won 1 Oscar. 10 wins & 17 nominations total"
  },
  "relatedMovies": [
    "tt0050083",
    "tt0070578",
    "tt0074342",
    "tt0068174",
    "tt0067670",
    "tt0069439",
    "tt0091554",
    "tt0097328",
    "tt0067835",
    "tt0067045",
    "tt0073396",
    "tt0074958"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.332Z"
}