{
  "imdbId": "tt0007711",
  "title": "Blue Jeans",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blue-jeans-1917-ee.-uu.-john-h.-collins.-fyr-7-mi-0j-3wo",
      "title": "Blue Jeans 1917 Ee. Uu. John H. Collins. Fyr 7 Mi 0j 3wo",
      "description": "June a young orphan is befriended by Perry Boscam when he shares his lunch with her on the road to Rising Sun to take over his father’s saw mill. The soon fall in love and marry only to find out that a women in Perry’s past has come to town to make trouble. Teaming up with the local political bully they set out to make Perry’s life miserable.. but June sticks by her husband to the end.",
      "id": "blue-jeans-1917-ee.-uu.-john-h.-collins.-fyr-7-mi-0j-3wo"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "84 min",
    "imdbRating": "7.0",
    "imdbVotes": "65",
    "Genre": "Drama",
    "Plot": "Perry Bascom comes to the town of Rising Sun, Indiana, to take charge of the sawmills which have for years been managed by his father's best friend, Col. Henry Clay Risener. His father's half-brother, Jack, has brought the name into disrepute in the town, so he (Perry) decides to be known as Jim Nelson. Perry sees June, who has been sent away from the poorhouse. He shares his lunch with her and protects her from the attentions of Ben Boone, the political bully of the town. June finds a home with old Jacob and Cindy Tutwiler, taking the place of their own daughter, whom Jacob had banished from home eighteen years before, and whose picture has been turned to the wall. Perry becomes the conservative candidate for Congress, opposing Ben Boone, who is the candidate of the liberal party. Perry asks June to marry him if he proves successful. Perry receives a call from Sue Eudaly, with whom he has gone through a marriage ceremony, but whom he left on finding she had a husband living. Her husband, Jim White, has disappeared, and she defies Perry to prove her previous marriage. She threatens to go to the rival candidate with her information, and Col. Risener, as Perry's campaign manager, buys her off. June is alarmed at the interest Sue shows in the man she loves, and Perry urges her to marry him at once, secretly. June continues to live with the Tutwilers. She has discovered that their daughter, who had married a hated Bascom, was her own mother, and that she is the granddaughter of Jacob and Cindy. Ben Boone has fallen in love with Sue, and his affection is returned. At the political rally June leads the village band, trying to drown out the voice of Boone when he harangues the crowd. The tide seems to be turning against Boone. Sue, deciding to explode a bomb in the camp of his opponents, takes her stand beside Perry and tells them he is a Bascom. She says she knows the wife he has deserted. June says that it is not true, since she herself is his wife. But the townspeople will not listen. They believe that he has deceived June, and refuse to believe anything good of a Bascom. The Tutwilers take June home with them and Perry is ordered to get out of town. Perry goes to the Tutwilers' to see June before he leaves. Sue is there. He denies that she is his wife, but she horrifies them all by saying that if Perry's father lured June's mother away from home. Perry and June are brother and sister. Cindy dispels that thought by producing a photograph of June's father. It is Jack Bascom, the half-brother of Perry's father, not a true Bascom by birth. Perry goes away to obtain proof of Sue Eudaly's husband, and June leaves the house, refusing to have anything to do with her grandfather until he retracts his insults to Perry. Ostracized by the townspeople, June lives in a humble cottage, where her child is born. Cindy goes to see the little one, but June will not permit Jacob to come until he admits that he is sorry. Perry at last returns with proof of Jim White's marriage to Sue. He seeks Boone at the mill. Boone cannot understand why Sue refuses to marry him. She finally tells him it is because she has a husband living, and that husband is Perry. Boone attacks Perry and overpowers him. Placing him on the log-carriage, he turns the great lever. He has locked June, who has followed her husband, inside the office. Then he and Sue make their escape. Through the glass door June watches her husband's body approaching the teeth of the saw. Breaking the glass of the door, she plunges out, and, reversing the lever just in time, saves Perry from the saw. Misfortune overtakes Sue and Boone, and with their baneful influence removed, June, Perry and the little one begin a happier life in the little town, with the love and respect of all.",
    "Director": "John H. Collins",
    "Writer": "Joseph Arthur, June Mathis, Charles A. Taylor",
    "Actors": "Viola Dana, Robert Walker, Sally Crute",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0005084",
      "title": "Children of Eve",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "127",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005047",
      "title": "The Call of the City",
      "year": 1915,
      "imdbRating": "5.5",
      "imdbVotes": "51",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0477332",
      "title": "The Lone Game",
      "year": 1915,
      "imdbRating": "5.0",
      "imdbVotes": "104",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008663",
      "title": "A Man There Was",
      "year": 1917,
      "imdbRating": "7.3",
      "imdbVotes": "2,389",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008519",
      "title": "A Romance of the Redwoods",
      "year": 1917,
      "imdbRating": "6.2",
      "imdbVotes": "866",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008133",
      "title": "The Immigrant",
      "year": 1917,
      "imdbRating": "7.5",
      "imdbVotes": "9,530",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007801",
      "title": "Cleopatra",
      "year": 1917,
      "imdbRating": "6.6",
      "imdbVotes": "413",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008662",
      "title": "Tepeyac",
      "year": 1917,
      "imdbRating": "5.7",
      "imdbVotes": "54",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008188",
      "title": "The Little American",
      "year": 1917,
      "imdbRating": "6.3",
      "imdbVotes": "789",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008259",
      "title": "The Man Without a Country",
      "year": 1917,
      "imdbRating": "6.2",
      "imdbVotes": "71",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008443",
      "title": "The Poor Little Rich Girl",
      "year": 1917,
      "imdbRating": "6.7",
      "imdbVotes": "1,573",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007958",
      "title": "Flor de durazno",
      "year": 1917,
      "imdbRating": "6.6",
      "imdbVotes": "31",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T05:42:42.761Z"
}