{
  "imdbId": "tt0002054",
  "title": "A Beast at Bay",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ABeastAtBay",
      "id": "ABeastAtBay",
      "title": "A Beast at Bay",
      "description": "A Beast at Bay was directed by D W Griffith in 1912. It stars Mary Pickford as the girl. These pictures were made so quickly, averaging two a week, that there are always errors that are allowed to pass. For example the tramp who tries to start a fight is almost off camera. But there are also regular advances in film technique. The cutting between the train and the cars, or the point of view shot when the hero looks through the binoculars.",
      "fileSize": 329634229,
      "addedAt": "2026-01-07T00:06:09.632Z",
      "thumbnail": "https://archive.org/services/img/ABeastAtBay",
      "collection": "feature_films",
      "downloads": 6951
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewABeastAtBay",
      "id": "PreviewABeastAtBay",
      "title": "\"A Beast At Bay\" (1912) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"A Beast at Bay\" is a short crime drama, included in our program to illustrate the work of two of our stars: actor Robert Harron and cinematographer Billy Bitzer. Mary Pickford meets her ideal man in Edwin August, but is quickly disappointed when he refuses to stand up to a bully.  Then after she is kidnapped her beau springs into action to save her.  Will she change her opinion about her man? Directed by               D. W. Griffith Produced by             Biograph Company Scenario by               D. W. Griffith         Starring                     Mary Pickford, Alfred Paget, Edwin August, Mae Marsh, Robert Harron Cinematography        Billy Bitzer Distributed by           The General Film Company, Incorporated Release date               May 27, 1912 Running time             10 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 15105928,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewABeastAtBay",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 32743
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.8,
    "imdbVotes": 220,
    "Genre": "Short, Drama",
    "Plot": "A young, and fickle girl ( Mary Pickford ) dumps her admiring boyfriend ( Edwin August ) because she views him as a coward. Meanwhile a ruthless convict ( Alfred Paget ) has escaped and takes the girl as his hostage. After a harrowing automobile and train chase, the ex-boyfriend rescues the girl and he immediately becomes her hero, which she seals with a kiss.",
    "Director": "D.W. Griffith",
    "Writer": "George Hennessy",
    "Actors": "Mary Pickford, Edwin August, Alfred Paget",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002478",
    "tt0002400",
    "tt0002408",
    "tt0002386",
    "tt0002162",
    "tt0002176",
    "tt0002208",
    "tt0002391",
    "tt0002303",
    "tt0003497",
    "tt0001978",
    "tt0001896"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}