{
  "imdbId": "tt0038115",
  "title": "Star in the Night",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/StarintheNight1945",
      "id": "StarintheNight1945",
      "title": "Star in the Night",
      "description": "Title: Star in the Night Summary: Three cowboys riding across the desert with gifts for no particular recipient, see a distant bright light and find it comes from the Star Auto Court sign where the owners and guests work together to help a young pregnant wife and husband. Directed by: Don Siegel Actors: J. Carrol Naish, Donald Woods, Rosina Galli Production Company: Warner Bros. Release Date: 13 October 1945 (USA) Aspect Ratio: 1.37 : 1 It's Christmas Eve. Three cowboys have just bought out a store of items as Christmas presents, despite not having anyone to give the presents to. While two of them admit to wanting to impress the pretty sales clerk, the third just felt good buying gifts to give to someone. Riding through the dark desert on horseback, they see a flashing star off in the distance, which they ride over to investigate. The newly purchased second hand star is a sign just erected by Nick Catapoli for his business, the Star Auto Court. Nick has no Christmas spirit, especially as he deals with the problems of customers, this despite his wife Rosa serving all their customers with a smile and warm heart. He believes most people are hypocrites in that they espouse this spirit at this one time of the year while not having it any other time. As such, he does not want to extend his lobby as shelter for a drifter who just wants to come in from the cold for a little while. Although the drifter tries to explain the ...",
      "fileSize": 397518802,
      "addedAt": "2026-01-07T00:06:51.870Z",
      "thumbnail": "https://archive.org/services/img/StarintheNight1945",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 3680
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "22 min",
    "imdbRating": 7.7,
    "imdbVotes": 1234,
    "Genre": "Short, Drama, Family",
    "Plot": "It's Christmas Eve. Three cowboys have just bought out a store of items as Christmas presents, despite not having anyone to give the presents to. While two of them admit to wanting to impress the pretty sales clerk, the third just felt good buying gifts to give to someone. Riding through the dark desert on horseback, they see a flashing star off in the distance, which they ride over to investigate. The newly purchased second hand star is a sign just erected by Nick Catapoli for his business, the Star Auto Court. Nick has no Christmas spirit, especially as he deals with the problems of customers, this despite his wife Rosa serving all their customers with a smile and warm heart. He believes most people are hypocrites in that they espouse this spirit at this one time of the year while not having it any other time. As such, he does not want to extend his lobby as shelter for a drifter who just wants to come in from the cold for a little while. Although the drifter tries to explain the true meaning of Christmas to Nick, Nick watching the interactions of all those around him may be a better way to show him, especially when a young and obviously in distress young couple named José and Maria Santos arrive, with no more rooms available at the inn.",
    "Director": "Don Siegel",
    "Writer": "Robert Finch, Saul Elkins, Don Siegel",
    "Actors": "J. Carrol Naish, Donald Woods, Rosina Galli",
    "Language": "English, Italian",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 1 win total"
  },
  "relatedMovies": [
    "tt0037792",
    "tt0148133",
    "tt3315452",
    "tt2015402",
    "tt0477330",
    "tt0344506",
    "tt1727546",
    "tt0038190",
    "tt0036603",
    "tt0150441",
    "tt0036874",
    "tt0151411"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.870Z"
}