{
  "imdbId": "tt0012675",
  "title": "The Sheik",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheSheik",
      "title": "TheSheik",
      "description": "Legendary Valentino picture. Valentino stars as an Arabian who falls in love with an English woman in this classic silent picture. Visit the IMDB page here.",
      "id": "TheSheik"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tqACAPHyFGo",
      "title": "The Sheik (1921) | Colorized Public Domain Silent Romance with Rudolph Valentino and Agnes Ayres",
      "description": "The Sheik (1921) is a landmark American silent romantic drama directed by George Melford, based on Edith Maude Hull’s 1919 bestselling novel. This restored and colorized public domain edition revives one of Hollywood’s most influential films, bringing it to modern audiences in vibrant detail. Starring Rudolph Valentino in the role that made him an international icon, this movie remains a cultural milestone that defined the silent era and cemented the image of the matinee idol.\n\nPlot Summary:\nThe film tells the story of Lady Diana Mayo (Agnes Ayres), an independent and adventurous Englishwoman traveling through the deserts of Algeria. Defying societal expectations, she rejects marriage and chooses freedom over tradition. Her journey takes a dramatic turn when she encounters Sheik Ahmed Ben Hassan (Rudolph Valentino), a powerful desert chieftain whose commanding presence both terrifies and captivates her. Driven by his intense passion, the Sheik abducts Diana, setting the stage for a story of cultural clash, personal transformation, and forbidden romance.\n\nAs the narrative unfolds, Diana resists the Sheik’s advances, determined to assert her independence. Yet as danger and adventure escalate, including a kidnapping by a rival tribe, she begins to see beyond his forceful exterior. The tension between freedom and love, identity and desire, drives the film toward a dramatic conclusion that shocked and fascinated audiences of the 1920s.\n\nCast and Crew:\n• Director: George Melford\n• Producer: Jesse L. Lasky\n• Based on: The Sheik by Edith Maude Hull\n• Cinematography: William Marshall\n• Editing: Dorothy Arzner (credited as cutter)\n\nStarring:\n• Rudolph Valentino as Sheik Ahmed Ben Hassan\n• Agnes Ayres as Lady Diana Mayo\n• Adolphe Menjou as Raoul de Saint Hubert\n• Walter Long as Omair the bandit\n• Lucien Littlefield as Mustapha Ali\n• George Waggner as Youssef\n\nFilm Significance:\nThe Sheik was a cultural phenomenon upon release, propelling Rudolph Valentino into superstardom and establishing the archetype of the exotic romantic hero. Its combination of desert adventure, cross-cultural romance, and Valentino’s magnetic presence made it one of the most profitable films of the silent era. It also influenced fashion, popular culture, and Hollywood’s approach to international romance films throughout the 1920s. Today, it serves as both entertainment and a historical artifact, reflecting early 20th-century attitudes toward gender, race, and fantasy.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Sheik remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1921 release was entirely black and white, a hallmark of the silent era. While historically authentic, many modern audiences—especially those used to high-definition television—skip past black-and-white silent films. By offering a colorized edition, we make this legendary classic accessible to today’s audiences, particularly older viewers in the United States and Europe who consume YouTube primarily through their TVs. This edition bridges the gap between preservation and modern entertainment habits, ensuring that Valentino’s legacy continues to captivate new generations.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the silent era through the Golden Age of Hollywood, including forgotten B-movies, groundbreaking silent features, and culturally significant dramas. Our mission is to keep these treasures alive for audiences across the USA, Europe, and beyond.\n\n#TheSheik #RudolphValentino #SilentFilm #1920sCinema #PublicDomainMovie #ColorizedClassic #SilentEraRomance #ClassicHollywood #FilmRestoration #1921Movies",
      "id": "tqACAPHyFGo",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-sheik",
      "title": "The Sheik",
      "id": "silent-the-sheik"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-sheik-1921",
      "title": "The Sheik (1921)",
      "description": "O SHEIK ( The Sheik, USA ) ( Filme Completo / Legendado em Português ) Data de Lançamento: 20 de novembro de 1921 » SOBRE O FILME: O Sheik Ahmed (Rodolfo Valentino) apaixona-se pela socialite britânica Diana (Agnes Ayres), e a seqüestra, levando-a para sua tenda em um deserto. Desesperada, Diana tenta escapar de suas mãos, mas acaba se envolvendo com este homem perigoso. » » DIREÇÃO: George Melford GÊNERO: Drama, Romance ORIGEM: USA DURAÇÃO: 80 minutos » » ELENCO PRINCIPAL: Rudolph Valentino ... The Sheik - Ahmed Ben Hassan Agnes Ayres ... Lady Diana Mayo Ruth Miller ... Zilah - A Marriage Market Prospect George Waggner ... Yousaef - Tribal Chieftain Frank Butler ... Sir Aubrey Mayo Charles Brinley ... Mustapha Ali - Diana's Guide (as Charles Brindley) Lucien Littlefield ... Gaston - French Valet Adolphe Menjou ... Dr. Raoul de St. Hubert Walter Long ... Omair - the Bandit",
      "id": "the-sheik-1921"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "86 min",
    "imdbRating": "6.2",
    "imdbVotes": "3,751",
    "Genre": "Adventure, Drama, Romance",
    "Plot": "Sheik Ahmed (Valentino) desperately desires fiesty British socialite Diana (Ayres), so he abducts her and carries her off to his luxurious desert tent-palace. The free-spirited Diana recoils from his passionate embraces and yearns to be released. Only after being kidnapped by desert bandits does Diana realize how much she has grown to love Ahmed, who comes to her rescue in the nick of time.",
    "Director": "George Melford",
    "Writer": "Edith Maude Hull, Monte M. Katterjohn",
    "Actors": "Rudolph Valentino, Agnes Ayres, Ruth Miller",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0012657",
      "title": "The Sea Lion",
      "year": 1921,
      "imdbRating": "6.0",
      "imdbVotes": "122",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013404",
      "title": "Moran of the Lady Letty",
      "year": 1922,
      "imdbRating": "6.4",
      "imdbVotes": "363",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014496",
      "title": "Soul of the Beast",
      "year": 1923,
      "imdbRating": "6.7",
      "imdbVotes": "64",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021828",
      "title": "East of Borneo",
      "year": 1931,
      "imdbRating": "5.6",
      "imdbVotes": "239",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017416",
      "title": "The Son of the Sheik",
      "year": 1926,
      "imdbRating": "6.6",
      "imdbVotes": "2,170",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012027",
      "title": "Camille",
      "year": 1921,
      "imdbRating": "6.5",
      "imdbVotes": "1,081",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012190",
      "title": "The Four Horsemen of the Apocalypse",
      "year": 1921,
      "imdbRating": "7.1",
      "imdbVotes": "3,594",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012068",
      "title": "The Conquering Power",
      "year": 1921,
      "imdbRating": "6.8",
      "imdbVotes": "491",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015310",
      "title": "The Sea Hawk",
      "year": 1924,
      "imdbRating": "7.1",
      "imdbVotes": "668",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012952",
      "title": "Blood and Sand",
      "year": 1922,
      "imdbRating": "6.3",
      "imdbVotes": "1,566",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012938",
      "title": "Beyond the Rocks",
      "year": 1922,
      "imdbRating": "6.7",
      "imdbVotes": "2,409",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0197917",
      "title": "Stolen Moments",
      "year": 1920,
      "imdbRating": "5.0",
      "imdbVotes": "232",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T21:43:53.526Z"
}