{
  "movieId": "tt0042274",
  "title": "Borderline",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Borderline1950_431",
      "id": "Borderline1950_431",
      "title": "Borderline (1950)",
      "description": "Two U.S. undercover agents are in Mexico looking for drug smugglers. They meet each other but do not know the other is an agent. Mystic Nights Videos",
      "fileSize": 2088944626,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/Borderline1950_431",
      "collection": "feature_films",
      "downloads": 12671
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/borderline-1950",
      "id": "borderline-1950",
      "title": "Borderline (1950)",
      "description": "Fred MacMurray, Claire Trevor, Raymond Burr",
      "fileSize": 1289523353,
      "addedAt": "2026-01-07T00:07:38.719Z",
      "thumbnail": "https://archive.org/services/img/borderline-1950",
      "collection": "feature_films",
      "downloads": 1929
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/borderline-1950_202309",
      "id": "borderline-1950_202309",
      "title": "Borderline (1950)",
      "description": "Jeb Maynard is a patrolman guarding the U.S.-Mexican border, whose partner and buddy Scooter has just been murdered. Maynard knows that a smuggler of illegal aliens is responsible for Scooter's death, but the feds insist that drug dealers committed the crime. Watch on RetroFlix:  https://retroflix.org/borderline-1950/",
      "fileSize": 269848030,
      "addedAt": "2026-01-07T00:07:38.719Z",
      "thumbnail": "https://archive.org/services/img/borderline-1950_202309",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 281
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/borderline-fred-mac-murray-1950-dvdrip-oldies",
      "id": "borderline-fred-mac-murray-1950-dvdrip-oldies",
      "title": "Borderline (1950) [P&M] DVD Rip (1GB)",
      "description": "For the P&M collection, I scour the web for the highest fidelity uploads of films, whether that be here on the Archive, elsewhere on the web, on bittorrent or even YouTube. When the highest quality version I've found isn't available on the Archive, I upload it! These are often much larger files than what are typically on the Archive, but, if you're like me, this may be no issue for you.",
      "fileSize": 1610847372,
      "addedAt": "2026-01-07T00:07:38.719Z",
      "thumbnail": "https://archive.org/services/img/borderline-fred-mac-murray-1950-dvdrip-oldies",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 4562
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/borderline1950",
      "id": "borderline1950",
      "title": "Borderline",
      "description": "Fred MacMurray and Claire Trevor are caught in Mexican dope-smuggling ring, fearing each other is involved, but both undercover agents. Cast includes Raymond Burr. For more info on this film see its IMDB.com entry",
      "fileSize": 1208893358,
      "addedAt": "2026-01-07T00:07:38.720Z",
      "thumbnail": "https://archive.org/services/img/borderline1950",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 70795
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VAJTwUbyj94",
      "id": "VAJTwUbyj94",
      "title": "Borderline (1950) [Crime] [Drama] [Romance]",
      "description": "Pete Ritchie (Raymond Burr) runs a narcotics smuggling operation to the USA from Mexico, which the Los Angeles Police Department and the US federal government have unsuccessfully tried to stop. Because of Ritchie's careful operating procedures, US authorities haven't even been able to find out the identities of his sources or customers and are desperate for a breakthrough . As a last resort, Madeleine Haley (Claire Trevor), an LAPD officer, is sent undercover to Mexico to charm her way into Ritchie's confidence.\nOnce there, Haley manages to establish contact with Ritchie's gang, but is kidnapped by Johnny Macklin (Fred MacMurray), a hoodlum working for a rival of Ritchie's and who also steals a load of Ritchie's narcotics. Haley plays along and joins Macklin on a smuggling trip for the stolen narcotics, with Ritchie in hot pursuit.\n\n---\n\nDirected by William A. Seiter, produced by Milton H. Bren and William A. Seiter, written by Devery Freeman, starring Fred MacMurray as Johnny McEvoy (aka Johnny Macklin), Claire Trevor as Madeleine Haley (aka Gladys LaRue), Raymond Burr as Pete Ritchie, Morris Ankrum as Bill Whittaker, Roy Roberts as Harvey Gumbin, Don Diamond as Deusik Nacho Galindo as Porfirio and Pepe Hern as Pablo. \n\n---\n\nSource: \"Borderline (1950 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 22 April 2013. Web. 05 May 2013. http://en.wikipedia.org/wiki/Borderline_(1950_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:24.265Z",
      "thumbnail": "https://i.ytimg.com/vi/VAJTwUbyj94/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC67t5V_Hl5xrSeCdeHxfpDhsmJsA",
      "duration": 5269,
      "language": "en",
      "year": 1950,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Et9Nj01Lmug",
      "id": "Et9Nj01Lmug",
      "title": "Borderline (1950) | Colorized Public Domain Crime Noir Thriller with Fred MacMurray & Claire Trevor",
      "description": "Borderline (1950) is an American crime noir thriller directed by William A. Seiter and distributed by Universal International Pictures. This restored and colorized public domain edition revives a tense, stylish film that blends crime, deception, undercover intrigue, and romance against the backdrop of the U.S.–Mexico border. With strong performances by Fred MacMurray and Claire Trevor, the film captures the postwar fascination with law enforcement, smuggling, and the blurred lines between justice and corruption.\n\nPlot Summary:\nThe story begins when Los Angeles policewoman Madeleine Haley (Claire Trevor) is assigned to go undercover to infiltrate a drug smuggling operation near the Mexican border. She poses as a woman willing to cross the line into the criminal underworld, hoping to gain the confidence of crime bosses and gather evidence.\n\nMeanwhile, Johnny Macklin (Fred MacMurray), a federal agent with a reputation for toughness, is also working undercover to expose the same cartel. Neither is aware of the other’s true identity, leading to a series of tense and often humorous encounters as they operate under suspicion.\n\nTheir paths cross when Madeleine and Johnny are both drawn deeper into the cartel’s network, facing betrayals, staged identities, and high-risk missions. As the stakes rise, so does their complicated attraction, forcing them to navigate both danger and trust in a setting where loyalties shift constantly.\n\nCast and Crew:\n• Director: William A. Seiter\n• Distributor: Universal International Pictures\n• Music: Hans J. Salter\n• Cinematography: Lucien Andriot\n\nStarring:\n• Fred MacMurray as Johnny Macklin\n• Claire Trevor as Madeleine Haley\n• Raymond Burr as Pete Ritchie\n• José Torvay as Porfirio\n• Roy Roberts as Harvey Gumbin\n\nFilm Significance:\nBorderline is a fascinating example of late 1940s and early 1950s crime cinema, bridging film noir with crime adventure. It features familiar noir elements — deception, undercover work, moral ambiguity — while also playing with romantic tension and occasional comedic undertones. Fred MacMurray, known for his versatile career spanning noir and light comedy, brings grit and charm to his role as an undercover agent. Claire Trevor, already an Oscar-winning actress, delivers a layered performance that balances strength, vulnerability, and wit.\n\nThe film also showcases Raymond Burr in an early villain role, foreshadowing his later reputation for commanding screen presence. With its combination of suspense, crime investigation, and cross-border settings, Borderline reflects both the noir tradition and Hollywood’s growing interest in international crime narratives during the postwar period.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Borderline remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1950 release was filmed in black and white, consistent with noir and crime dramas of the period. While authentic, many modern viewers skip past monochrome films. By restoring and colorizing Borderline, the performances, noir shadows, and suspenseful atmosphere gain a renewed vibrancy. This edition makes a postwar crime noir more accessible for today’s audience while preserving its tension, style, and artistry.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant features. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Borderline1950 #FredMacMurray #ClaireTrevor #RaymondBurr #FilmNoir #PublicDomainMovie #ColorizedClassic #CrimeThriller #GoldenAgeHollywood #FilmRestoration",
      "addedAt": "2025-12-24T00:49:53.805Z",
      "thumbnail": "https://i.ytimg.com/vi/Et9Nj01Lmug/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBWKE4wDw==&rs=AOn4CLAb1YI1f7Z7iAmxlUIE1bYyAHbxkQ",
      "duration": 5217,
      "language": "en",
      "year": 1950,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BorderlineMPEG2",
      "id": "BorderlineMPEG2",
      "title": "Borderline",
      "fileSize": 5982987666,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BorderlineMPEG2",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 23284
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=i12seZ6KlhE",
      "id": "i12seZ6KlhE",
      "title": "Borderline (1950) FRED MACMURRAY",
      "description": "Stars: Fred MacMurray, Claire Trevor, Raymond Burr\nDirector: William A. Seiter\n\nTwo Americans embroiled in a drug-smuggling ring run by a drug czar, each suspect the other not realizing they are both undercover agents!",
      "addedAt": "2025-12-26T23:56:55.889Z",
      "thumbnail": "https://i.ytimg.com/vi/i12seZ6KlhE/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBhAWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLAYUm0woDuUwC1UCSCKnF_rjwmPlw",
      "duration": 5298,
      "language": "en",
      "year": 1950,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/borderline1950_202002",
      "id": "borderline1950_202002",
      "title": "Borderline (1950, USA) Fred Mac Murray, Claire Trevor - Film Noir Full Movie",
      "description": "Borderline is a 1950 American film noir crime film directed by William A. Seiter starring Fred MacMurray, Raymond Burr and Claire Trevor. Wikipedia: https://en.wikipedia.org/wiki/Borderline_(1950_film) Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 423507635,
      "addedAt": "2026-01-07T00:07:38.720Z",
      "thumbnail": "https://archive.org/services/img/borderline1950_202002",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 14838
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "88 min",
    "imdbRating": 6,
    "imdbVotes": 1568,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Customs agents are looking for information about Pete Ritchie, who is involved in smuggling drugs into the US. Police officer Madeleine Haley goes undercover in order to gain Ritchie's confidence, and before long she meets him through one of his associates. As she is talking with Ritchie, Johnny Macklin and one of his men burst in, and they provoke a violent confrontation. From then on, Haley is in constant danger as she attempts to figure out everything that is happening in the smuggling operation.",
    "Director": "William A. Seiter",
    "Writer": "Devery Freeman",
    "Actors": "Fred MacMurray, Claire Trevor, Raymond Burr",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040723",
    "tt0042869",
    "tt0043142",
    "tt0042394",
    "tt0043292",
    "tt0042379",
    "tt0042428",
    "tt0042579",
    "tt0042792",
    "tt0042809",
    "tt0042669",
    "tt0043075"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:08:21.429Z"
}