{
  "imdbId": "tt0042869",
  "title": "Quicksand",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Quicksand_clear",
      "title": "Quicksand",
      "description": "An engrossing suspense film with Mickey Rooney, Peter Lorre, and Jeanne Cagney. Needing money for a date, Rooney borrows $20 from the cash register, starting a chain of events that includes car theft, burglary, and possibly murder. (Yes, that is Jack Elam in the bar scene.) Read more at the IMDB . (The video is interlaced in both the MPEG2 file and the Cinepack. If viewing with VLC, deinterlace with menu-path Video/Deinterlace/Blend.) This is a better copy than the previous versions that were uploaded. You can load the mpeg2 file into DVDAuthorGUI and quickly create a DVD to watch on your television.",
      "fileSize": 2625581678,
      "id": "Quicksand_clear"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Quicksand720p1950",
      "title": "Quicksand",
      "description": "Title: Quicksand Summary: After taking 20 dollars from his employer to go on a date with plans to repay it the next day, an auto mechanic falls into increasingly disastrous circumstances for more and more money which rapidly spirals out of his control. Directed by: Irving Pichel Actors: Mickey Rooney, Jeanne Cagney, Barbara Bates Production Company: Samuel H. Stiefel Productions Release Date: 24 March 1950 (USA) Aspect Ratio: 1.37 : 1 Motor mechanic Dan Brady lacks funds for a heavy date with new restaurant cashier Vera, the type whose life's ambition is a mink coat; so he embezzles twenty dollars from his employer with plans to repay it the next day. To make up the shortage, he goes in debt for a hundred. Thereafter, every means he tries to get out of trouble only gets him deeper into financial difficulties that lead to bigger crimes as everyone he meets is out for themselves.",
      "fileSize": 931110126,
      "id": "Quicksand720p1950"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sV0G0S06Nag",
      "title": "Quicksand (1950) [Film Noir]",
      "description": "\"Quicksand\" is a United Artists film noir starring Mickey Rooney and Peter Lorre in a story about a garage mechanic's descent into crime. The film has been described as \"film noir in a teacup... a pretty nifty little picture\" in which Rooney \"cast himself against his Andy Hardy goody goody image.\n\nYoung auto mechanic Dan Brady (Mickey Rooney) takes $20 from a cash register at work to go on a date with blonde femme fatale Vera Novak (Jeanne Cagney). Brady intends to put the money back before it is missed, but the garage's bookkeeper shows up earlier than scheduled. As Brady scrambles to cover evidence of his petty theft, he fast finds himself drawn into an ever worsening \"quicksand\" of crime, each of his misdeeds more serious than the last. His descent is sped along by his heartless and morally lacking boss Oren Mackay (Art Smith), and the seedy owner of a penny arcade on Santa Monica Pier, Nick Dramoshag (Peter Lorre). Brady and Vera split when Vera purchases a mink coat with money Brady has stolen. Brady's still-loyal but unappreciated former girlfriend Helen (Barbara Bates) then reenters the scene and tries to woo him back. Later fleeing what he believes will be a murder charge, Brady carjacks a sedan which happens to be driven by a sympathetic lawyer (Taylor Holmes).\n\nBy movie's end Brady is back with his faithful girlfriend, who promises to wait for him while he spends the next few years of his life in prison. Cast includes Jimmie Dodd and Minerva Urecal. A young Jack Elam, later widely noted as a character actor in Westerns, appears in an uncredited speaking role. \n\n---\n\nDirected by Irving Pichel, produced by Mort Briskin and Samuel H. Stiefel, written by Robert Smith, starring Mickey Rooney, Jeanne Cagney, Barbara Bates and Peter Lorre.\n\n---\n\nSource: \"Terror by Night\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 26 February 2012. Web. 02 September 2012. http://en.wikipedia.org/wiki/Terror_by_Night.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "sV0G0S06Nag",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qn3XZLFuX3g",
      "title": "Quicksand (1950) | Colorized Public Domain Crime Noir with Mickey Rooney and Peter Lorre",
      "description": "Quicksand (1950) is an American film noir crime drama directed by Irving Pichel and starring Mickey Rooney, Jeanne Cagney, Barbara Bates, and Peter Lorre. This public domain gem is now fully restored and colorized, offering modern audiences a vivid experience of one of the most gripping crime thrillers of postwar Hollywood. Known for its moral tension, rapid pacing, and powerful performances, Quicksand explores how a single poor decision can unravel a man’s life. By presenting this restored version in full color, Colorized Public Domain ensures that this timeless cautionary tale continues to resonate with audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nDan Brady (Mickey Rooney) is a young, ambitious auto mechanic who becomes entangled in a spiral of bad choices. After borrowing $20 from his employer’s cash register to impress a woman, Dan sets off a chain of consequences that pulls him deeper into trouble. What starts as a minor act of dishonesty escalates into theft, fraud, and even murder as he desperately tries to cover his tracks.\n\nJeanne Cagney stars as the femme fatale Vera Novak, whose manipulative charm pushes Dan further down the path of destruction. Barbara Bates portrays Helen Calder, the good-hearted love interest who represents Dan’s chance at redemption, while Peter Lorre delivers a chilling performance as Nick Dramoshag, a seedy amusement arcade owner who blackmails Dan and drags him further into criminal entanglement. The tension builds to a nail-biting climax as Dan faces the consequences of his actions, caught in the quicksand of crime and moral decay.\n\nCast and Crew:\n• Director: Irving Pichel\n• Producer: Mort Briskin\n• Screenplay: Robert Smith\n• Cinematography: Lionel Lindon\n• Editing: Walter Thompson\n• Music: Emil Newman\n\nStarring:\n• Mickey Rooney as Dan Brady\n• Jeanne Cagney as Vera Novak\n• Barbara Bates as Helen Calder\n• Peter Lorre as Nick Dramoshag\n• Taylor Holmes as Mr. Brady\n• Art Smith as Murphy\n• Wally Cassell as Buzz\n\nFilm Significance:\nQuicksand (1950) is notable for showcasing Mickey Rooney in one of his most dramatic adult roles, moving away from his youthful screen image to portray a morally conflicted man. The film is an excellent example of the postwar noir cycle, reflecting anxieties about ambition, temptation, and the fragility of the American Dream. Peter Lorre’s performance as Nick adds menace and depth, while Jeanne Cagney’s role epitomizes the classic noir femme fatale archetype. Though made on a modest budget, Quicksand demonstrates the effectiveness of tightly constructed storytelling and stark moral themes. Today, it is celebrated as a cult classic and a defining entry in the noir tradition.\n\nEnhanced Public Domain Explanation:\nAs a public domain work, Quicksand is free from copyright restrictions, allowing it to be preserved, restored, and shared with audiences without limitation. At Colorized Public Domain, we specialize in restoring and colorizing these cinematic treasures, breathing new life into black-and-white classics for today’s viewers. Our process maintains respect for the original film while enhancing its accessibility and visual appeal, ensuring that Quicksand continues to educate, entertain, and captivate future generations.\n\nWhy Watch This Colorized Edition:\nThe original 1950 release of Quicksand was filmed in black and white, which enhanced its noir aesthetic but limited its appeal to some modern audiences. This colorized edition preserves the atmospheric tension of the story while offering a more immersive experience, bringing out details of performance, setting, and mood. By bridging the gap between historical authenticity and modern viewing preferences, this restored version revitalizes Quicksand as both a gripping thriller and a cultural time capsule of postwar America.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe bring you restored, enhanced, and colorized films from the golden age of cinema, ranging from crime dramas and thrillers to horror and adventure classics. Join our community as we preserve timeless treasures and make them accessible to audiences in the USA, Europe, and beyond.\n\n#Quicksand1950 #MickeyRooney #PeterLorre #JeanneCagney #FilmNoir #PublicDomainMovie #ColorizedClassic #ClassicCrimeDrama #1950sCinema #CultFilm",
      "id": "qn3XZLFuX3g",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/quicksand-1950",
      "title": "Quicksand (1950)",
      "description": "Young auto mechanic Dan Brady takes $20 from a cash register at work to go on a date with blonde femme fatale Vera Novak. Brady intends to put the money back before it is missed, but the garage's bookkeeper shows up earlier than scheduled. As Brady scrambles to cover evidence of his petty theft, he fast finds himself drawn into an ever worsening \"quicksand\" of crime. Watch on RetroFlix.org:  https://retroflix.org/quicksand-1950/",
      "fileSize": 193952742,
      "id": "quicksand-1950"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/quicksand.",
      "title": "Quicksand",
      "description": "After borrowing $20 from his employer's cash register, an auto mechanic is plunged into a series of increasingly disastrous circumstances which rapidly spiral out of his control.",
      "fileSize": 2915841042,
      "id": "quicksand."
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/quicksand.-1950.-dvdrip.x-264-handjob",
      "title": "Quicksand (1950) [P&M] DVD Rip (1.4GB)",
      "description": "When the Archive didn't have a copy of the film that met my standards for quality, I found this version on Bittorrent. Even then, it's not perfect -- but, after searching far and wide, this is the highest quality version that I could find at the time of upload. I hope that you enjoy it. Thank you to the original rippers, encoders, and seeders!",
      "fileSize": 1998460380,
      "id": "quicksand.-1950.-dvdrip.x-264-handjob"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3wOSKlRGKEc",
      "title": "Quicksand (1950) BARBARA BATES",
      "description": "Movie Class by PizzaFLIX Special Edition!\nStars: Mickey Rooney, Barbara Bates, Jeanne Cagney, and Peter Lorre\nDirector: Irving Pichel\nIn this late-era FILM NOIR, a grease monkey sinks deeper and deeper into the dark underworld after committing a petty crime to take a trashy blonde on a date.\nCHAPTERS\n0:00 Movie Class Introduction\n4:15 Feature Synopsis\n4:54 The Midnight Lady",
      "id": "3wOSKlRGKEc",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UepbwNjmSJY",
      "title": "Quicksand (1950) Mickey Rooney, Jeanne Cagney | Crime, Drama, Film-Noir | Full Movie",
      "description": "A guy who yields to temptation just once...... ....and finds it's once too often!\nAfter taking 20 dollars from his employer to go on a date with plans to repay it the next day, an auto mechanic falls into increasingly disastrous circumstances for more and more money which rapidly spirals out of his control.\n\nDirector: Irving Pichel\nWriter: Robert Smith \nStars: Mickey Rooney, Jeanne Cagney, Barbara Bates & Peter Lorre\nGenre:  Classics, Cult Film, Drama, Crime, Mystery, Film Noir, Romance\n\n@CultCinemaClassics:\nhttps://linktr.ee/cultcinemaclassics",
      "id": "UepbwNjmSJY",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1950-quicksand-peligros-de-juventud-arena-movediza-irving-pichel-vose",
      "title": "1950 - Quicksand - Peligros de juventud - Arena movediza - Irving Pichel - VOSE",
      "description": "For Academic - Educational Use Only https://derechonoir.wordpress.com/",
      "fileSize": 698363579,
      "id": "1950-quicksand-peligros-de-juventud-arena-movediza-irving-pichel-vose"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "79 min",
    "imdbRating": 6.6,
    "imdbVotes": 2655,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Motor mechanic Dan Brady lacks funds for a heavy date with new restaurant cashier Vera, the type whose life's ambition is a mink coat; so he embezzles twenty dollars from his employer with plans to repay it the next day. To make up the shortage, he goes in debt for a hundred. Thereafter, every means he tries to get out of trouble only gets him deeper into financial difficulties that lead to bigger crimes as everyone he meets is out for themselves.",
    "Director": "Irving Pichel",
    "Writer": "Robert Smith",
    "Actors": "Mickey Rooney, Jeanne Cagney, Barbara Bates",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0043142",
      "title": "Woman on the Run",
      "year": 1950,
      "imdbRating": 7.2,
      "imdbVotes": 4980,
      "language": "English, Cantonese",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0042274",
      "title": "Borderline",
      "year": 1950,
      "imdbRating": 6,
      "imdbVotes": 1568,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042394",
      "title": "Destination Murder",
      "year": 1950,
      "imdbRating": 6.1,
      "imdbVotes": 1033,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043292",
      "title": "Appointment with Danger",
      "year": 1950,
      "imdbRating": 6.5,
      "imdbVotes": 1534,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042379",
      "title": "Dark City",
      "year": 1950,
      "imdbRating": 6.7,
      "imdbVotes": 2781,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042428",
      "title": "Edge of Doom",
      "year": 1950,
      "imdbRating": 6.4,
      "imdbVotes": 946,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042579",
      "title": "House by the River",
      "year": 1950,
      "imdbRating": 7,
      "imdbVotes": 4361,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042792",
      "title": "No Way Out",
      "year": 1950,
      "imdbRating": 7.4,
      "imdbVotes": 6522,
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042809",
      "title": "One Way Street",
      "year": 1950,
      "imdbRating": 6.5,
      "imdbVotes": 953,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042669",
      "title": "The Lawless",
      "year": 1950,
      "imdbRating": 6.7,
      "imdbVotes": 751,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043075",
      "title": "The Sound of Fury",
      "year": 1950,
      "imdbRating": 7.2,
      "imdbVotes": 2090,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043090",
      "title": "Union Station",
      "year": 1950,
      "imdbRating": 6.8,
      "imdbVotes": 2819,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T17:43:11.127Z"
}