{
  "imdbId": "tt0047877",
  "title": "The Big Bluff",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/big_bluff",
      "title": "Big Bluff",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "big_bluff"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YUu6t-QRbOQ",
      "title": "The Big Bluff (1955) [Film Noir] [Drama]",
      "description": "The suave Don Juan Ricardo 'Rick' De Villa (John Bromfield) and his married lover Fritzi Darvel would like to take off together, but his lack of money prevents them from doing so. A chance encounter introduces Rick to the young, but terminally ill socialite Valerie Bancroft (Martha Vickers), in whom Rick sees the solution to his predicament. Rick sweeps her off her feet and they soon marry, although Valerie's entourage are suspicious of him. Rick then proceeds to try and bring about Valerie's demise so he can inherit her wealth and live the good life with Fritzi.\n\n---\n\nDirected and produced by W. Lee Wilder, written by Mindret Lord (story) and Fred Freiberger (screenplay), starring John Bromfield as Ricardo 'Rick' De Villa, Martha Vickers as Valerie Bancroft, Robert Hutton as Dr. Peter Kirk, Rosemarie Stack as Fritzi Darvel, Eve Miller as Marsha Jordan, Max Palmer as Detective Sgt. John Fullmer, Eddie Bee as Don Darvel, Robert Bice as Dr. Tom Harrison, Pierre Watkin as Jim Winthrop, Beal Wong as Art Dealer, Rusty Wescoatt as Husky Detective at Finale, Mitchell Kowall as Coroner, Jack, Daly as Master of Ceremonies, Paul McGuire as William (the butler), George Conrad as Bell Boy and Kay Garrett as Waiter.\n\n---\n\nSource: \"The Big Bluff\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 28 November 2012. Web. 17 March 2013. http://en.wikipedia.org/wiki/The_Big_Bluff.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "YUu6t-QRbOQ",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CaAzDMaNvg4",
      "title": "The Big Bluff (1955) | Colorized Public Domain Film Noir Classic | John Bromfield & Martha Vickers",
      "description": "The Big Bluff (1955) is a suspenseful American film noir drama directed by W. Lee Wilder, known for his mid-century thrillers and economical filmmaking style. This restored and colorized edition of the public domain classic revives one of the decade’s most striking portrayals of greed, deception, and betrayal in postwar America. With sharp performances by John Bromfield, Martha Vickers, and Robert Hutton, this edition offers a vivid viewing experience for modern audiences while preserving the film’s original noir essence. Perfect for viewers who enjoy dark psychological dramas and crime thrillers from Hollywood’s Golden Age.\n\nPlot Summary:\nSet in 1950s Los Angeles, the story follows Ricardo “Rick” De Villa (John Bromfield), an ambitious but morally bankrupt man desperate to escape poverty. When he learns that Valerie Bancroft (Martha Vickers), a wealthy socialite, is terminally ill, he sees an opportunity for fortune. Abandoning his mistress, Fritzi Darvel (Rosemarie Stack), Rick charms Valerie, marries her, and begins waiting for her death to secure her inheritance. But fate twists the knife — Valerie’s health starts improving under the care of Dr. Peter Kirk (Robert Hutton). Fearful that his plan will collapse, Rick plots to hasten her end, unaware that suspicion is closing in. The film builds to a tension-filled climax of deceit, guilt, and poetic justice — classic traits of mid-century American noir.\n\nCast and Crew:\n• Director: W. Lee Wilder\n• Screenplay: Fred Freiberger\n• Story by: Mindret Lord\n• Cinematography: Gordon Avil\n• Editing: Terry O. Morse\n• Music: Manuel Compinsky\nStarring:\n• John Bromfield as Ricardo “Rick” De Villa\n• Martha Vickers as Valerie Bancroft\n• Robert Hutton as Dr. Peter Kirk\n• Rosemarie Stack (credited as Rosemarie Bowe) as Fritzi Darvel\n• Eve Miller as Marsha Jordan\n• Robert Bice as Lieutenant\n• Pierre Watkin as Dr. Turner\n• Max Palmer as Bouncer\n\nFilm Significance:\nThe Big Bluff represents the tail end of the classic noir period, blending the cynicism of 1940s crime films with the melodrama of 1950s psychological thrillers. Its themes of moral corruption, greed, and manipulation mirror postwar disillusionment and the shifting American dream. Martha Vickers, famed for her earlier role in The Big Sleep (1946), delivers a nuanced performance that contrasts innocence with fragility, while Bromfield’s portrayal of Rick captures the cold ruthlessness typical of noir antiheroes. Though made on a modest budget, the film remains notable for its sharp dialogue, dramatic irony, and stark character studies.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Big Bluff remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1955 release of The Big Bluff was filmed in black and white, typical of the low-budget noir productions of its time. This colorized version brings new visual depth and vibrancy to the story, allowing modern audiences—especially those viewing on high-definition televisions—to experience the atmosphere, costumes, and performances with renewed realism. The film’s exploration of manipulation and greed remains timeless, making it a compelling choice for viewers across the USA, Europe, and other regions where classic noir continues to captivate audiences. For TV viewers aged 55–64 who appreciate morally complex storytelling and nostalgic Hollywood aesthetics, this restoration offers both familiarity and freshness.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheBigBluff #FilmNoir #1955Movie #PublicDomainMovie #ColorizedClassic #ClassicCinema #MarthaVickers #JohnBromfield #GoldenAgeHollywood #CrimeDrama",
      "id": "CaAzDMaNvg4",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=f69PXwVoD0I",
      "title": "The Big Bluff (1955) JOHN BROMFIELD🍕 FILM NOIR",
      "description": "It's Friday@PizzaFLIX\nStars: John Bromfield, Martha Vickers, Rosemarie Bowe Stack\nDirector: W. Lee Wilder\n\nIn this twisty tale of desire and deceit, a suave but unscrupulous playboy concocts a fatal scheme to secure a wealthy woman's fortune.",
      "id": "f69PXwVoD0I",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-big-bluff-1955",
      "title": "The Big Bluff (1955)",
      "description": "When a scheming fortune hunter finds his rich wife is not going to die as expected, he and his lover make other plans to get her millions. Watch on RetroFlix:  https://retroflix.org/the-big-bluff-1955/",
      "id": "the-big-bluff-1955"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1955-the-big-bluff-w.-lee-wilder-vose",
      "title": "1955 - The Big Bluff - W. Lee Wilder - VOSE",
      "description": "For Academic - Educational Use Only",
      "id": "1955-the-big-bluff-w.-lee-wilder-vose"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": "5.8",
    "imdbVotes": "630",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "When scheming fortune hunter and erstwhile Latin lover Ricardo De Villa learns that a wealthy but sickly widow has terminal heart disease, he seduces and marries the vulnerable millionairess. Playing the part of a faithful and doting husband, he carries on a torrid affair with sexy exotic dancer Fritzi Darvel while avoiding the suspicious eyes of her jealous bongo-playing husband. When his wife's condition seems to go into remission, the impatient De Villa decides on action that will hasten her seemingly inevitable death.",
    "Director": "W. Lee Wilder",
    "Writer": "Fred Freiberger, Mindret Lord",
    "Actors": "John Bromfield, Martha Vickers, Robert Hutton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0043066",
      "title": "Three Steps North",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "186",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039730",
      "title": "The Pretender",
      "year": 1947,
      "imdbRating": "6.4",
      "imdbVotes": "392",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042807",
      "title": "Once a Thief",
      "year": 1950,
      "imdbRating": "6.2",
      "imdbVotes": "222",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049334",
      "title": "Hot Cars",
      "year": 1956,
      "imdbRating": "6.4",
      "imdbVotes": "418",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047878",
      "title": "The Big Combo",
      "year": 1955,
      "imdbRating": "7.3",
      "imdbVotes": "9,203",
      "language": "English, Swedish, Latin, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047934",
      "title": "Chicago Syndicate",
      "year": 1955,
      "imdbRating": "6.5",
      "imdbVotes": "661",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047958",
      "title": "Crashout",
      "year": 1955,
      "imdbRating": "7.0",
      "imdbVotes": "791",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047904",
      "title": "A Bullet for Joey",
      "year": 1955,
      "imdbRating": "6.0",
      "imdbVotes": "1,322",
      "language": "English, Spanish, Italian, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049204",
      "title": "Female Jungle",
      "year": 1955,
      "imdbRating": "5.5",
      "imdbVotes": "630",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048064",
      "title": "Female on the Beach",
      "year": 1955,
      "imdbRating": "6.4",
      "imdbVotes": "1,550",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048182",
      "title": "House of Bamboo",
      "year": 1955,
      "imdbRating": "6.8",
      "imdbVotes": "4,367",
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048254",
      "title": "Killer's Kiss",
      "year": 1955,
      "imdbRating": "6.5",
      "imdbVotes": "27,240",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T17:44:50.726Z"
}