{
  "imdbId": "tt0026972",
  "title": "Scrooge",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Scrooge1935",
      "title": "Scrooge1935",
      "id": "Scrooge1935"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Scrooge_1935",
      "title": "Scrooge",
      "description": "Seymour Hicks plays the title role in the first sound version of the Dickens classic about the miser who's visited by three ghosts on Christmas Eve. This British import is notable for being the only adaptation of this story with an invisible Marley's Ghost and its Expressionistic cinematography. This is the uncut 78 minute version.",
      "id": "Scrooge_1935"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Scrooge_855",
      "title": "Scrooge 855",
      "description": "Scrooge, the ultimate Victorian miser, hasn't a good word for Christmas, though his impoverished clerk Cratchit and nephew Fred are full of holiday spirit. But in the night, Scrooge is visited by spirits of another color.",
      "id": "Scrooge_855"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0Hm9QCfkWnY",
      "title": "Scrooge (1935) [Drama] [Fantasy] [Christmas]",
      "description": "\"Scrooge\" is a 1935 British film directed by Henry Edwards featuring Seymour Hicks as Ebenezer Scrooge, the miser who hates Christmas. It was the first sound version of the Charles Dickens classic A Christmas Carol, not counting a 1928 short subject that now appears to be lost.\n\nHicks had played the role of Scrooge on the stage many times beginning in 1901, and again in a 1913 British silent film version. The 1935 film differs from all other versions of the story in one significant way - most of the ghosts, including that of Jacob Marley, are not actually shown onscreen, although their voices are heard. Only the Ghost of Christmas Present (Oscar Asche) is actually seen in full figure - the Ghost of Christmas Past is a mere shape with no discernible facial features, Marley's Ghost is seen only briefly as a face on the door knocker, and the Ghost of Christmas Yet to Come is just an outstretched pointing finger. \n\nWhy the film was made this way remains unclear; it is obviously not because British filmmakers could not achieve special effects, since we do see Marley's face superimposed on Scrooge's door knocker. Another aspect making this film different from other versions of the story is that Seymour Hicks plays both the old and young Scrooge, rather straining the credulity of the audience, since by this time, the sixty-four year old actor was visibly too aged to convincingly play a young man.\n\nMaurice Evans appears briefly as a man harassed by Scrooge to pay his debts. Donald Calthrop portrays a Bob Cratchit who bears an uncanny physical resemblance to John Leech's illustrations of the character in the original 1843 edition of the novel.\n\n---\n\nDirected by Henry Edwards, produced by Julius Hagen, written by H. Fowler Mear\nCharles Dickens (novel), starring Sir Seymour Hicks, Donald Calthrop, Robert Cochran, Mary Glynne, Garry Marsh, Oscar Asche, Marie Ney and C.V. France.\n\n---\n\nSource: \"Scrooge (1935 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 26 June 2012. Web. 30 July 2012. http://en.wikipedia.org/wiki/Scrooge_(1935_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "0Hm9QCfkWnY",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=covwQY0zEIQ",
      "title": "Scrooge (1935) | Colorized Public Domain Christmas Film Based on Charles Dickens’ A Christmas Carol",
      "description": "Scrooge (1935) is a British Christmas fantasy drama film directed by Henry Edwards and based on Charles Dickens’ timeless novella A Christmas Carol. This restored and colorized version brings one of the earliest sound adaptations of Dickens’ masterpiece to modern audiences, showcasing the beloved holiday story in vivid new detail. With Sir Seymour Hicks in the title role—a part he performed countless times on stage—this version captures the moral transformation of Ebenezer Scrooge with intensity and emotional depth. As one of the definitive holiday classics from the early sound era, Scrooge (1935) continues to resonate with viewers across generations for its enduring themes of redemption, compassion, and the spirit of Christmas.\n\nPlot Summary:\nThe story follows Ebenezer Scrooge (Seymour Hicks), a miserly businessman in Victorian London whose greed and cruelty have made him despised by all who know him. On Christmas Eve, Scrooge is visited by the ghost of his former partner Jacob Marley (Claude Rains in an uncredited voice role) and three spirits—the Ghost of Christmas Past, the Ghost of Christmas Present, and the Ghost of Christmas Yet to Come. Through these supernatural visions, Scrooge is forced to confront the consequences of his selfishness and lack of charity.\n\nHe sees his neglected youth, the happiness he could have had, the joy of families he has dismissed, and the grim future awaiting him if he does not change his ways. By Christmas morning, Scrooge awakens transformed—generous, kindhearted, and full of the holiday spirit he once scorned.\n\nCast and Crew:\n• Director: Henry Edwards\n• Producers: Julius Hagen\n• Screenplay: H. Fowler Mear\n• Based on: A Christmas Carol by Charles Dickens\n• Cinematography: Geoffrey Faithfull\n• Editing: Brabazon Haynes\n• Music: Leighton Lucas\n\nStarring:\n• Seymour Hicks as Ebenezer Scrooge\n• Donald Calthrop as Bob Cratchit\n• Robert Cochran as Fred\n• Mary Glynne as Belle\n• Garry Marsh as Fred’s Friend\n• Barbara Everest as Fred’s Wife\n• Athene Seyler as Scrooge’s Charwoman\n• Claude Rains (uncredited voice) as Jacob Marley\n\nFilm Significance:\nScrooge (1935) is historically important as one of the very first feature-length sound adaptations of Dickens’ classic. While earlier silent versions existed, this adaptation gave audiences the opportunity to experience Dickens’ dialogue and atmosphere in a new way. Seymour Hicks, having portrayed Scrooge on stage for decades, brought a commanding presence and authenticity to the role.\n\nThough later versions like the 1951 Scrooge starring Alastair Sim or modern retellings such as A Christmas Carol (2009) with Jim Carrey became more widely known, the 1935 film remains a milestone in cinematic history. Its restrained style, haunting atmosphere, and direct connection to Dickens’ original themes make it a treasure of early British cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Scrooge (1935) remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1935 release was filmed in black and white, emphasizing the shadows and bleakness of Scrooge’s world. This colorized edition revitalizes the visual experience, highlighting the festive richness of Victorian London, the warmth of the Cratchit family, and the supernatural glow of the Christmas spirits. By adding color, we enhance the emotional impact of Dickens’ story while staying true to its message of redemption and kindness.\n\nLegacy:\nCharles Dickens’ A Christmas Carol is one of the most adapted stories in history, and Scrooge (1935) holds a distinguished place as a pioneering sound version that helped establish the tradition of holiday films. Its focus on morality, generosity, and the transformative power of Christmas has made it an enduring seasonal favorite. For modern audiences, this colorized edition ensures that this early classic remains not only preserved but revitalized for continued enjoyment.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including holiday dramas, timeless romances, and unforgettable treasures from Hollywood’s past. Our goal is to preserve and revitalize these works for audiences in the USA, Europe, and worldwide.\n\n#Scrooge1935 #AChristmas",
      "id": "covwQY0zEIQ",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/scrooge-1935_202504",
      "title": "Scrooge (1935)",
      "description": "Ebenezer Scrooge, the ultimate Victorian miser, hasn't a good word for Christmas, though his impoverished clerk Cratchit and nephew Fred are full of holiday spirit. In the night, Scrooge is visited by spirits of the past, present, and future. Watch on RetroFlix:  https://retroflix.org/scrooge-1935/",
      "id": "scrooge-1935_202504"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/scrooge_ipod",
      "title": "Scrooge",
      "description": "Seymour Hicks plays the title role in the first sound version of the Dickens classic about the miser who's visited by three ghosts on Christmas Eve. This British import is notable for being the only adaptation of this story with an invisible Marley's Ghost and its Expressionistic cinematography. This is the uncut 78 minute version. Originally submitted by: dabears198545@yahoo.com",
      "id": "scrooge_ipod"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qrJr5oflWtQ",
      "title": "Scrooge (1935) DICKENS CHRISTMAS CLASSIC",
      "description": "Stars: Seymour Hicks, Donald Calthrop, Robert Cochran\nDirector: Henry Edwards\nWriters: Charles Dickens (novel)\n\nThis wonderful adaptation of \"A Christmas Carol\" would have made Charles Dickens proud. The film is notable not only for its superb performances, but also for the setting and costumes which utterly capture 1843 London. The impressive moving-camera photography and atmospheric lighting are reminiscent of German expressionist cinema. Sir Seymour Hicks, as Scrooge, delivers a first-class performance; and he also co-authored the screenplay.",
      "id": "qrJr5oflWtQ",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "78 min",
    "imdbRating": "6.4",
    "imdbVotes": "2,667",
    "Genre": "Drama, Family, Fantasy",
    "Plot": "Scrooge, the ultimate Victorian miser, hasn't a good word for Christmas, though his impoverished clerk Cratchit and nephew Fred are full of holiday spirit. But in the night, Scrooge is visited by spirits of another color. Straightforward adaptation of Dickens.",
    "Director": "Henry Edwards",
    "Writer": "Charles Dickens, H. Fowler Mear",
    "Actors": "Seymour Hicks, Donald Calthrop, Robert Cochran",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026164",
      "title": "Call of the Wild",
      "year": 1935,
      "imdbRating": "6.8",
      "imdbVotes": "2,715",
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0066344",
      "title": "Scrooge",
      "year": 1970,
      "imdbRating": "7.5",
      "imdbVotes": "13,318",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026854",
      "title": "The Passing of the Third Floor Back",
      "year": 1935,
      "imdbRating": "6.9",
      "imdbVotes": "323",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013688",
      "title": "The Toll of the Sea",
      "year": 1922,
      "imdbRating": "6.6",
      "imdbVotes": "913",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026867",
      "title": "The Phantom Empire",
      "year": 1935,
      "imdbRating": "6.2",
      "imdbVotes": "530",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0017033",
      "title": "A Kiss for Cinderella",
      "year": 1925,
      "imdbRating": "6.8",
      "imdbVotes": "104",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt10399114",
      "title": "A Christmas Hero",
      "year": 2020,
      "imdbRating": "4.0",
      "imdbVotes": "364",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    },
    {
      "imdbId": "tt0772176",
      "title": "Christmas Story",
      "year": 2007,
      "imdbRating": "7.0",
      "imdbVotes": "4,992",
      "language": "Finnish",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    },
    {
      "imdbId": "tt1646876",
      "title": "16 Wishes",
      "year": 2010,
      "imdbRating": "5.4",
      "imdbVotes": "16,610",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0139723",
      "title": "Vintage Wine",
      "year": 1935,
      "imdbRating": "6.0",
      "imdbVotes": "63",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027893",
      "title": "Little Lord Fauntleroy",
      "year": 1936,
      "imdbRating": "7.3",
      "imdbVotes": "2,696",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0027499",
      "title": "Daniel Boone",
      "year": 1936,
      "imdbRating": "5.6",
      "imdbVotes": "358",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:35:15.464Z"
}