{
  "imdbId": "tt0029962",
  "title": "Call the Mesquiteers",
  "year": 1938,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FzFNzAdQ7YU",
      "id": "FzFNzAdQ7YU",
      "title": "Call the Mesquiteers (1938) THE THREE MESQUITEERS",
      "description": "Stars: Robert Livingston, Ray Corrigan, Max Terhune\n Director: John English\n\n Smugglers hijack the Mesquiteers truck, but the police catch up, kill the smugglers, and then try to arrest the Mesquiteers as part of the gang. They escape but now have to prove their innocence while being hunted as wanted men.",
      "addedAt": "2025-12-26T23:51:25.706Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/FzFNzAdQ7YU/maxresdefault.webp",
      "duration": 3176,
      "language": "en",
      "year": 1938,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "55 min",
    "imdbRating": 6,
    "imdbVotes": 123,
    "Genre": "Drama, Western",
    "Plot": "A daring gang of outlaws hi-jack a carload of raw silk from s speeding freight train. They load the silk onto three trucks, the gang-leader instructs the driver to take a different route, and they will all meet in the distant town of Cosmopolitan. One of the trucks skids into a bar-ditch, and the gangsters flag down a passing truck that carries three saddle horses. The truck passengers are The Three Mesquiteers: \"Stony\" Brooke (Robert Livingston), \"Tucson\" Smith (Ray Corrigan) and \"Lullaby\" Joslin (Max Terhune), who stop to give aid and are held up by the robbers. The robbers in turn load the silk onto the Mesquiteer's truck, take the truck and also with it the Mesquiteers. A posse catches up and the outlaws are killed in the skirmish, and the sheriff thinks the Mesquiteers are also part of the gang. The trio manages to escape and have to stay one jump ahead of the law while trying to catch the real robbers and prove their own innocence.",
    "Director": "John English",
    "Writer": "Luci Ward, Bernard McConville, William Colt MacDonald",
    "Actors": "Robert Livingston, Ray Corrigan, Max Terhune",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028582",
    "tt0028732",
    "tt0029462",
    "tt0028194",
    "tt0027670",
    "tt0026916",
    "tt0029692",
    "tt0033251",
    "tt0033181",
    "tt0032971",
    "tt0037245",
    "tt0038212"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:39:33.682Z"
}