{
  "imdbId": "tt0027377",
  "title": "The Bold Caballero",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBoldCaballero",
      "title": "The Bold Caballero",
      "description": "NOTE: YOU WILL PROBABLY PREFER TO DOWNLOAD THE COLOR PRINT OF THIS FILM, AT: http://www.archive.org/details/The_Bold_Caballero The first Zorro picture shot with sound, the first shot in color (the two-strip MagnaColor process, although this print of the film is only in black and white, alas), one of the only ones not to feature \"Zorro\" in the title, and the first to be produced by Republic Pictures. Written and directed by Wells Root, author of one of the first \"how to\" screenwriting books, Republic spent more money on this production than they typically did, seeing it as a showcase for MagnaColor. As any student of film history will tell you, TechniColor won out with its superior three-strip process. Color negatives of The Bold Caballero have been lost to time and neglect and, for a time, it was thought to be a lost film all together. Unfortunately, despite some fairly clever writing (as it opens, Zorro has already been captured, e.g.), the movie turns out to be not terribly exciting. It has moments, and the rest of it is just okay. IMDb entry",
      "id": "TheBoldCaballero"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Bold_Caballero",
      "title": "The Bold Caballero",
      "description": "This is the Magnacolor print Zorro (Robert Livingston) has been captured and set for execution, charged with the murder of the new Governor (Robert Warwick) in Spanish California, as the Governor was marked with a \"Z\". Zorro escapes, and reveals his identity to the Governor's daughter, Isabella (Heather Angel). However, Isabella then has Don Diego arrested. He convinces Isabella that the Commandante (Sig Ruman) was the real killer, as the \"Z\" on the Governor was backwards.",
      "id": "The_Bold_Caballero"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4dXv8QAHvBM",
      "title": "The Bold Caballero (1936) ZORRO",
      "description": "Stars: Robert Livingston, Heather Angel, Sig Ruman\nWriter/Director: Wells Root\n\nThe Commandant is making life rough for the colonials in Spanish California. While trying to help, Zorro is charged with the murder of the new Governor. The film is notable for being the first talking Zorro film, and the first Zorro film in color (Magnacolor). It was shot in Chatsworth, Los Angeles.",
      "id": "4dXv8QAHvBM",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "67 min",
    "imdbRating": "5.7",
    "imdbVotes": "253",
    "Genre": "Western",
    "Plot": "Zorro, the masked deliverer of Indians of Spanish-ruled California, is about to be hanged when General Palma is declared governor of Santa Cruz. Palma is to replace the tyrannical commandante, Sebastian Golle, who has been pilfering King Charles' tax money and terrorizing the natives. With the help of the Indians, Zorro escapes and, posing as Don Diego Vega, a gentleman pauper from Mexico, offers his services to Palma and his lovely daughter Isabella. Palma, however, refuses Diego and unwittingly sends him out as bait for Zorro. But as Palma chases the elusive hero, he is killed by a bandit who leaves Zorro's \"Z\" mark on his dead body. After Isabella is made governor, Golle plans to marry her and receive Santa Cruz as her dowery, and Diego agrees to do his wooing for him. Golle, meanwhile, has been taxing the Indians beyond their means and enslaving the sons of those who cannot pay. When Golle's soldiers herd the slaves into the public square, their mothers cry for Zorro to deliver them. Hoping to expose Golle's barbarism, Diego brings Isabella to the square, where she promises to free the slaves once information on Zorro's whereabouts is brought to her and offers a public bounty of two hundred pieces of gold for the outlaw. Zorro, however, steals the gold and buys the slaves' freedom himself. Then, on Isabella's birthday, Golle stages a burlesque bullfight in which a child is placed in the ring, hoping to lure Zorro out of hiding. When Isabella pleads with the foppish Diego to save the child, he fights the bull bravely and adeptly, revealing his true virility and love for Isabella. Seeing them kiss, Golle accuses Diego of betraying him, and Diego fends off Golle and his soldiers and escapes. When Zorro's mark is found on Golle's wounded body, Isabella finally realizes Diego is Zorro and escapes from Golle's clutches to capture him, still determined to avenge her father's murder. Golle captures them both, however, and fatally whips Isabella's female companion, planning to blame her death on Zorro. When Zorro finds the woman marred with the same backwards \"Z\" found on Palma, Isabella finally realizes it was Golle who killed her father. Just as Zorro is about to be hanged, the natives stage an uprising and help him defeat Golle. Zorro's loyal priest then blesses Isabella and Zorro, and the couple falls through the gallows box and kisses.",
    "Director": "Wells Root",
    "Writer": "Wells Root, Johnston McCulley",
    "Actors": "Robert Livingston, Heather Angel, Sig Ruman",
    "Language": "Spanish, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0028194",
      "title": "Roarin' Lead",
      "year": 1936,
      "imdbRating": "6.1",
      "imdbVotes": "98",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028466",
      "title": "The Vigilantes Are Coming",
      "year": 1936,
      "imdbRating": "6.0",
      "imdbVotes": "106",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027670",
      "title": "Ghost-Town Gold",
      "year": 1936,
      "imdbRating": "6.1",
      "imdbVotes": "131",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028372",
      "title": "The Three Mesquiteers",
      "year": 1936,
      "imdbRating": "6.4",
      "imdbVotes": "152",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0028732",
      "title": "Come On, Cowboys",
      "year": 1937,
      "imdbRating": "6.2",
      "imdbVotes": "93",
      "language": "English, Mandarin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029462",
      "title": "Range Defenders",
      "year": 1937,
      "imdbRating": "5.7",
      "imdbVotes": "100",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029486",
      "title": "Riders of the Whistling Skull",
      "year": 1937,
      "imdbRating": "5.8",
      "imdbVotes": "249",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028971",
      "title": "Gunsmoke Ranch",
      "year": 1937,
      "imdbRating": "5.5",
      "imdbVotes": "165",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029004",
      "title": "Hit the Saddle",
      "year": 1937,
      "imdbRating": "5.9",
      "imdbVotes": "210",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030636",
      "title": "The Purple Vigilantes",
      "year": 1938,
      "imdbRating": "6.5",
      "imdbVotes": "100",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029962",
      "title": "Call the Mesquiteers",
      "year": 1938,
      "imdbRating": "6.0",
      "imdbVotes": "123",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027361",
      "title": "The Big Show",
      "year": 1936,
      "imdbRating": "5.7",
      "imdbVotes": "305",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}