{
  "movieId": "tt0038611",
  "title": "Home in Oklahoma",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HomeinOklahoma",
      "id": "HomeinOklahoma",
      "title": "Home in Oklahoma",
      "description": "Flying U ranch owner Sam Talbot is killed by a fall from a horse. St. Louis reporter Connie Edwards (Dale Evans) comes to check a rumor that he might have been murdered. She goes to Roy Rogers, editor of the local newspaper, and he takes her to the reading of Talbot's will. The ranch is left to Talbot's 12-year-old ward, Duke Lowery (Lanny Rees), much to the dismay of Talbot's niece, Jan Holloway (Carol Hughes). After some attempts on Duke's life, Roy finally proves that Jan, Steve McClory (George Meeker) and coroner Jim Judnick (Arthur Space) had Talbot killed and are conspiring to do the same for Duke, making Jan the last heir.",
      "fileSize": 1304168980,
      "addedAt": "2026-01-07T00:06:30.619Z",
      "thumbnail": "https://archive.org/services/img/HomeinOklahoma",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 14094
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dJiwNVHvwD4",
      "id": "dJiwNVHvwD4",
      "title": "Home in Oklahoma (1946) ROY ROGERS",
      "description": "Stars: Roy Rogers, Trigger, George 'Gabby' Hayes\nDirector: William Witney\n\nRoy edits a small town newspaper. A rancher is murdered, and his fortune is inherited by a young boy. Roy, with the assistance of big city reporter Dale, brings the killers to justice.",
      "addedAt": "2025-12-26T23:57:31.026Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/dJiwNVHvwD4/maxresdefault.webp",
      "duration": 4324,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 6,
    "imdbVotes": 280,
    "Genre": "Drama, Music, Western",
    "Plot": "In this Roy Rogers entry, featuring a song written by Oklahoma Governor Roy J. Turner (making him and Louisiana's Jimmie Davis and Texas' W.E. \"Pappy\" O'Daniel possibly the only state governors to write songs used in a western), Flying T ranch owner Sam Talbot is killed by a fall from a horse. St. Louis reporter Connie Edwards comes to check a rumor that he might have been murdered. She goes to Roy Rogers, editor of the local newspaper, and he takes her to the reading of Talbot's will. The ranch is left to Talbot's 12-year-old ward, Duke Lowery, much to the dismay of Talbot's niece, Jan Holloway. After some attempts on Duke's life, Roy finally proves that Jan, Steve McClory and coroner Jim Judnick had Talbot killed and are conspiring to do the same for Duke, making Jan the last heir.",
    "Director": "William Witney",
    "Writer": "Gerald Geraghty",
    "Actors": "Roy Rogers, Trigger, George 'Gabby' Hayes",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038593",
    "tt0039157",
    "tt0039861",
    "tt0039180",
    "tt0040333",
    "tt0041347",
    "tt0040644",
    "tt0040399",
    "tt0040385",
    "tt0038968",
    "tt0043626",
    "tt0037535"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.619Z"
}