{
  "imdbId": "tt0000770",
  "title": "The Taming of the Shrew",
  "year": 1908,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shrew",
      "id": "shrew",
      "title": "\"The Taming of the Shrew\" (1908) director D. W. Griffith starring Florence Lawrence",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"The Taming of the Shrew\" is a short comedy based on the play of Shakespeare. The film is included in our program to illustrate the work of our stars Florence Lawrence and Billy Bitzer.  The first thing we want to do is set the record straight about the name of the actor playing Petruchio. All major movie sites, including IMDB and Silent Era, as well as Wikipedia, cite the name of Arthur V. Johnson, but this is wrong. We cannot see Arthur V. Johnson in this film. Florence Lawrence delivers an inspired and truly stellar performance as the ill-tempered Katherina. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Florence Lawrence, Linda Arvidson, Harry Solter, George Gebhardt Distributed by                   Biograph Company Release date                      November 10, 1908 Country                             United States Running time                    11 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 25627147,
      "addedAt": "2026-01-07T00:10:50.366Z",
      "thumbnail": "https://archive.org/services/img/shrew",
      "year": 1908,
      "collection": "feature_films",
      "downloads": 4009
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-taming-of-the-shrew",
      "id": "silent-the-taming-of-the-shrew",
      "title": "The Taming of the Shrew",
      "fileSize": 201842503,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-taming-of-the-shrew",
      "year": 1908,
      "collection": "feature_films",
      "downloads": 469
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.4,
    "imdbVotes": 172,
    "Genre": "Short, Comedy, Romance",
    "Plot": "Based on Shakespeare's play: Two suitors have come to the home of the popular Bianca to court her. But her bad-tempered sister Katharina interrupts, deals with the men roughly and chases them out. Later she also assaults her music teacher. Only Petruchio, just arrived in town, wants to court Katharina. Her father eagerly agrees to arrange a wedding, and soon Petruchio and Katharina are locked in a battle of wills.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith, William Shakespeare, Harry Solter",
    "Actors": "Florence Lawrence, Arthur V. Johnson, Linda Arvidson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001002",
    "tt0000892",
    "tt0000922",
    "tt0001458",
    "tt0000653",
    "tt0000641",
    "tt0001062",
    "tt0000800",
    "tt0000946",
    "tt0001000",
    "tt0000841",
    "tt0001387"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}