{
  "imdbId": "tt0032156",
  "title": "The Story of the Last Chrysanthemum",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-story-of-the-last-chrysaanthemum",
      "id": "the-story-of-the-last-chrysaanthemum",
      "title": "The Story Of The Last Chrysanthemum",
      "description": "This heartrending masterpiece by Kenji Mizoguchi about the give-and-take between life and art marked the first full realization of the hypnotic long takes and eloquent camera movements that would come to define the director’s films. Kikunosuke (Shotaro Hanayagi), the adopted son of a legendary kabuki actor who is striving to achieve stardom by mastering female roles, turns to his infant brother’s wet nurse for support and affection—and she soon gives up everything for her beloved’s creative glory. Offering a fascinating glimpse behind the scenes of kabuki theater in the late nineteenth century,  The Story of the Last Chrysanthemum  provides a critique of the oppression of women and the sacrifices required of them, and represents the pinnacle of Mizoguchi’s early career.",
      "fileSize": 11736062688,
      "addedAt": "2026-01-07T00:12:33.204Z",
      "thumbnail": "https://archive.org/services/img/the-story-of-the-last-chrysaanthemum",
      "language": "jpn",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 6953
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "148 min",
    "imdbRating": 7.8,
    "imdbVotes": 4538,
    "Genre": "Drama, Romance",
    "Plot": "In Tokyo in 1888, Kikunosuke Onoue, the adoptive son of an important actor, discovers that he is praised for his acting only because he is his father's heir, and that the troupe complains how bad he is behind his back. The only person to talk to him honestly about his acting is Otoku, the wet-nurse of his adoptive father's child. She is fired by the family, and Kikunosuke is forbidden to see her, because of the gossip a relationship with a servant would cause. Kikunosuke falls in love with Otoku, and leaves home to try to make a living on his own merits outside Tokyo. He is eventually joined by Otoku, who encourages him to become a famous actor to regain the recognition of his family.",
    "Director": "Kenji Mizoguchi",
    "Writer": "Matsutarô Kawaguchi, Shôfû Muramatsu, Yoshikata Yoda",
    "Actors": "Shôtarô Hanayagi, Kôkichi Takada, Ryôtarô Kawanami",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0046851",
    "tt0033654",
    "tt0164600",
    "tt0032165",
    "tt0031282",
    "tt0031288",
    "tt0031593",
    "tt0032159",
    "tt0031082",
    "tt0033675",
    "tt0031602",
    "tt0031863"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.204Z"
}