{
  "movieId": "tt0038409",
  "title": "The Chase",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1946-the-chase-acosados-arthur-ripley-vose",
      "id": "1946-the-chase-acosados-arthur-ripley-vose",
      "title": "1946 - The Chase - Acosados - Arthur Ripley - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "fileSize": 526970797,
      "addedAt": "2026-01-07T00:06:03.998Z",
      "thumbnail": "https://archive.org/services/img/1946-the-chase-acosados-arthur-ripley-vose",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 1004
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheChase_",
      "id": "TheChase_",
      "title": "The Chase",
      "description": "Returning a lost wallet gains unemployed veteran Chuck Scott (Robert Cummings) a job as chauffeur to Eddie Roman (Steve Cochran), a seeming gangster whose enemies have a way of meeting violent ends. The job proves nerve-wracking, and soon Chuck finds himself pledged to help Eddie's lovely, fearful, prisoner-wife Lorna (Michèle Morgan) to escape. The result leaves Chuck caught like a rat in a trap, vainly seeking a way out through dark streets. But the real chase begins when the strange plot virtually starts all over again...",
      "fileSize": 1985809989,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheChase_",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 176785
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/chase_the",
      "id": "chase_the",
      "title": "The Chase",
      "description": "Taken from IMDB : Chuck Scott gets a job as chauffeur to tough guy Eddie Roman; but Chuck's involvement with Eddie's fearful wife becomes a nightmare. Originally uploaded by www.k-otic.com",
      "fileSize": 1759757650,
      "addedAt": "2026-01-07T00:07:45.168Z",
      "thumbnail": "https://archive.org/services/img/chase_the",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 65678
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=y9T0mEtpeqQ",
      "id": "y9T0mEtpeqQ",
      "title": "The Chase (1946) [Film Noir]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | The Chase (1946) is an American film noir, shot in black and white, directed by Arthur Ripley. The screenplay (adapted by Philip Yordan) is based on the Cornell Woolrich novel The Black Path of Fear. \n\nThis dream-like film noir is about Chuck Scott (Robert Cummings), a World War II vet now a penniless drifter tormented by bizarre dreams, who takes a job as driver to Eddie Roman (Steve Cochran), a vicious gangster. Roman tests his new driver, Scott, by assuming control of his car from the back seat. Unbeknownst to Scott, Roman has an accelerator installed in the rear passenger compartment so that he can \"take over\" the vehicle whenever he wants. This bizarre trick not only unnerves his new driver but also Roman's right-hand man, Gino (Peter Lorre).\n\nScott passes the test and gets the job. But things get tough for Scott when he falls in love with the gangster's wife, Lorna (Michele Morgan), who has attempted to kill herself because life has become unbearable with her sadistic husband. The two run off together to Cuba and a bizarre chase begins wherein Scott is framed for a murder and must therefore avoid both Roman and the police. Finally, at a point when Scott is able to clear his name, he is thrown back into the nightmare in a surprising twist.\n\n---\n\nDirected by Arthur Ripley, produced by Seymour Nebenzal, screenplay by Philip Yordan,  story by Cornell Woolrich (novel \"The Black Path of Fear\"), starring Robert Cummings, Michèle Morgan, Steve Cochran.\n\n---\n\nSource: \"The Chase (1946 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 June 2012. Web. 7 July 2012. http://en.wikipedia.org/wiki/The_Chase_(1946_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:42:12.971Z",
      "thumbnail": "https://i.ytimg.com/vi/y9T0mEtpeqQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAtSqm70LWj9yESzprBEJwnx8bwuw",
      "duration": 5084,
      "language": "en",
      "year": 1946,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7LqXeR5l3I4",
      "id": "7LqXeR5l3I4",
      "title": "The Chase (1946) | Colorized Public Domain Film Noir with Robert Cummings & Steve Cochran",
      "description": "The Chase (1946) is a psychological film noir thriller directed by Arthur Ripley and based on Cornell Woolrich’s novel The Black Path of Fear (1944). This colorized and restored edition revives one of the most haunting and unusual entries of the post-war noir era. With its dreamlike atmosphere, shadow-soaked suspense, and psychological twists, The Chase has earned cult recognition for its blend of romance, obsession, and paranoia. By restoring it in vivid color, this release makes the film more engaging for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nChuck Scott (Robert Cummings), a down-on-his-luck World War II veteran, stumbles upon a wallet filled with money. After returning it to its owner, Miami gangster Eddie Roman (Steve Cochran), Chuck is drawn into the dangerous world of organized crime. Eddie, intrigued by Chuck’s honesty and military discipline, hires him as his chauffeur. But Eddie’s cruel and possessive nature soon becomes clear, especially in his treatment of his wife, Lorna Roman (Michèle Morgan).\n\nLorna, trapped in an abusive marriage, turns to Chuck for comfort and hope. Their forbidden connection sparks a desperate plan to escape Eddie’s control by fleeing to Havana, Cuba. Yet, as the lovers attempt their escape, the story takes a surreal and unsettling turn, blurring the line between reality and nightmare. What begins as a straightforward noir spirals into a chilling meditation on trauma, fate, and the fragility of sanity.\n\nCast and Crew:\n• Director: Arthur Ripley\n• Producer: Seymour Nebenzal\n• Screenplay: Philip Yordan, based on The Black Path of Fear by Cornell Woolrich\n• Cinematography: Franz Planer\n• Editing: Edward Marinick\n• Music: Michel Michelet\n\nStarring:\n• Robert Cummings as Chuck Scott\n• Michèle Morgan as Lorna Roman\n• Steve Cochran as Eddie Roman\n• Peter Lorre as Gino\n• Jack Holt as Cmdr. Davidson\n• Lloyd Corrigan as Job\n• Alex Minotis as Sebastian\n\nFilm Significance:\nThe Chase stands apart from more conventional noirs with its eerie dream sequences, nonlinear storytelling, and psychological disorientation. Cornell Woolrich’s source material was already steeped in paranoia and fatalism, but Arthur Ripley’s direction intensified its surreal qualities. The film became a favorite among noir enthusiasts for its atmosphere and unpredictability, though contemporary audiences found it confusing. Over time, its cult status has grown, and it is now studied as a daring experiment in noir filmmaking that anticipated later psychological thrillers.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Chase remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1946 release was filmed in black and white, relying heavily on shadows and contrasts typical of film noir. While effective for its era, many modern viewers often avoid black-and-white films. This colorized edition enhances the film’s visual appeal, highlighting details in costume, Havana locations, and the menacing expressions of its characters. The restoration offers contemporary audiences a fresh perspective while maintaining the film’s moody noir identity.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from suspenseful noirs to overlooked dramas. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheChase1946 #FilmNoir #RobertCummings #SteveCochran #MicheleMorgan #PeterLorre #PublicDomainMovie #ColorizedClassic #CornellWoolrich #GoldenAgeHollywood #RestoredMovies",
      "addedAt": "2025-12-24T00:50:06.294Z",
      "thumbnail": "https://i.ytimg.com/vi/7LqXeR5l3I4/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYQCBXKGUwDw==&rs=AOn4CLBI94VSQw8WUeYtEQm2CyLoBVLENg",
      "duration": 4996,
      "language": "en",
      "year": 1946,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-chase-1946_202309",
      "id": "the-chase-1946_202309",
      "title": "The Chase (1946)",
      "description": "Chuck Scott gets a job as chauffeur to tough guy Eddie Roman; but Chuck's involvement with Eddie's fearful wife becomes a nightmare. Watch on RetroFlix:  https://retroflix.org/the-chase-1946/",
      "fileSize": 679483978,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-chase-1946_202309",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 214
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-chase-pnm",
      "id": "the-chase-pnm",
      "title": "The Chase (1946) [P&M] 1080p Blu-ray (1.6GB)",
      "description": "For the P&M collection, I scour the web for the highest fidelity uploads of films, whether that be here on the Archive, elsewhere on the web, on bittorrent or even YouTube. When the highest quality version I've found isn't available on the Archive, I upload it! These are often much larger files than what are typically on the Archive, but, if you're like me, this may be no issue for you.",
      "fileSize": 3520701772,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-chase-pnm",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 1966
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thechasefullmoviegreatquality720p1946",
      "id": "thechasefullmoviegreatquality720p1946",
      "title": "The Chase (1946)",
      "description": "Unemployed veteran Chuck Scott (Robert Cummings) suffers from hallucinations and raw nerves. When he returns a lost wallet to violent mobster Eddie Roman (Steve Cochran), the man offers to hire him as a chauffeur. Not only is the job a stressful one, but Chuck gets mixed up in a plot to help Eddie's wife, Lorna (Michèle Morgan), run off to Havana to escape her cruel husband's grasp. But when Scott is framed for murder, they must run from both Eddie and the authorities.",
      "fileSize": 617621653,
      "addedAt": "2026-01-07T00:12:44.280Z",
      "thumbnail": "https://archive.org/services/img/thechasefullmoviegreatquality720p1946",
      "collection": "feature_films",
      "downloads": 5261
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Zz8Lsl5NmtA",
      "id": "Zz8Lsl5NmtA",
      "title": "The Chase (1946) PETER LORRE",
      "description": "Stars: Robert Cummings, Michèle Morgan, Peter Lorre\nDirector: Arthur Ripley\nWriters: Cornell Woolrich (book)\n\nA nightmarish maelstrom erupts after a war veteran takes a gig as the chauffeur for a vicious gangster. He flees to Havana with his boss' wife, hounded by a stiletto-wielding henchman, and wanted by the authorities for murder!",
      "addedAt": "2025-12-26T23:54:50.761Z",
      "thumbnail": "https://i.ytimg.com/vi/Zz8Lsl5NmtA/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBpgWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDiDbeLvmSkBlkAi_a3FbXTVa4dgw",
      "duration": 5083,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/chase-1946",
      "id": "chase-1946",
      "title": "The Chase 1946 colorized (Bob Cummings, Michele Morgan)",
      "description": "A man (Robert Cummings) hired as a chauffeur by a sadistic gangster (Steve Cochran) falls in love with his employer's fearful wife (Michèle Morgan) and plans to run off with her. Based on the novel \"The Black Path of Fear\" by Cornell Woolrich. Robert Cummings as Chuck Scott Michèle Morgan as Lorna Roman Steve Cochran as Eddie Roman Peter Lorre as Gino Lloyd Corrigan as Emmerrich Johnson Jack Holt as Cmdr. Davidson Don Wilson as Fats Alexis Minotis as Lt. Acosta James Westerfield as Job I colorized this using AI software that doesn't always get the colors right, but I think it looks fairly natural. Hopefully a more professional job will be done someday.",
      "fileSize": 579603872,
      "addedAt": "2026-01-07T00:07:45.168Z",
      "thumbnail": "https://archive.org/services/img/chase-1946",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 6675
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "86 min",
    "imdbRating": 6.4,
    "imdbVotes": 3046,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Returning a lost wallet gains unemployed veteran Chuck Scott a job as chauffeur to Eddie Roman, a seeming gangster whose enemies have a way of meeting violent ends. The job proves nerve-wracking, and soon Chuck finds himself pledged to help Eddie's lovely, fearful, prisoner-wife Lorna to escape. The result leaves Chuck caught like a rat in a trap, vainly seeking a way out through dark streets. But the real chase begins when the strange plot virtually starts all over again...",
    "Director": "Arthur Ripley",
    "Writer": "Philip Yordan, Cornell Woolrich, Jacqueline Duffie",
    "Actors": "Robert Cummings, Michèle Morgan, Steve Cochran",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0052293",
    "tt0038991",
    "tt0038455",
    "tt0038956",
    "tt0038965",
    "tt0039017",
    "tt0038453",
    "tt0038669",
    "tt0039101",
    "tt0038369",
    "tt0039305",
    "tt0039023"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:11:22.196Z"
}