{
  "imdbId": "tt0058279",
  "title": "Kwaidan",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kwaidan-1964_202510",
      "id": "kwaidan-1964_202510",
      "title": "Kwaidan (1964)",
      "description": "Kwaidan is a 1964 Japanese anthology horror film directed by Masaki Kobayashi. It is based on stories from Lafcadio Hearn's collections of Japanese folk tales, mainly Kwaidan: Stories and Studies of Strange Things, for which it is named. The film consists of four separate and unrelated stories. Kwaidan is an archaic transliteration of the term kaidan, meaning \"ghost story\". The film  consists of four separate stories based on Japanese folklore, primarily drawn from Lafcadio Hearn's writings. The tales include  \"The Black Hair,\" about a samurai haunted by his past,  \"The Woman of the Snow,\" featuring a woodcutter and a snow spirit, \"Hoichi the Earless,\" which follows a blind musician summoned by ghosts, and \"In a Cup of Tea,\" a story about a samurai tormented by a mysterious presence.",
      "fileSize": 3797110915,
      "addedAt": "2026-01-07T00:09:24.701Z",
      "thumbnail": "https://archive.org/services/img/kwaidan-1964_202510",
      "language": "jpn (English subtitles)",
      "year": 1964,
      "collection": "feature_films",
      "downloads": 232
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kwaidan_202103",
      "id": "kwaidan_202103",
      "title": "Kwaidan",
      "description": "After more than a decade of sober political dramas and socially minded period pieces, the great Japanese director Masaki Kobayashi shifted gears dramatically for this rapturously stylized quartet of ghost stories. Featuring colorfully surreal sets and luminous cinematography, these haunting tales of demonic comeuppance and spiritual trials, adapted from writer Lafcadio Hearn’s collections of Japanese folklore, are existentially frightening and meticulously crafted. This version of  Kwaidan  is the original three-hour cut, never before released in the United States.",
      "fileSize": 15037743481,
      "addedAt": "2026-01-07T00:09:24.701Z",
      "thumbnail": "https://archive.org/services/img/kwaidan_202103",
      "language": "jpn",
      "year": 1965,
      "collection": "feature_films",
      "downloads": 22871
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "183 min",
    "imdbRating": 7.9,
    "imdbVotes": 21660,
    "Genre": "Drama, Fantasy, Horror",
    "Plot": "This film contains four distinct, separate stories. \"Black Hair\": A poor samurai who divorces his true love to marry for money, but finds the marriage disastrous and returns to his old wife, only to discover something eerie about her. \"The Woman in the Snow\": Stranded in a snowstorm, a woodcutter meets an icy spirit in the form of a woman spares his life on the condition that he never tell anyone about her. A decade later he forgets his promise. \"Hoichi the Earless\": Hoichi is a blind musician, living in a monastery who sings so well that a ghostly imperial court commands him to perform the epic ballad of their death battle for them. But the ghosts are draining away his life, and the monks set out to protect him by writing a holy mantra over his body to make him invisible to the ghosts. But they've forgotten something. \"In a Cup of Tea\": a writer tells the story of a man who keep seeing a mysterious face reflected in his cup of tea.",
    "Director": "Masaki Kobayashi",
    "Writer": "Yôko Mizuki, Lafcadio Hearn",
    "Actors": "Rentarô Mikuni, Michiyo Aratama, Misako Watanabe",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "Nominated for 1 Oscar. 5 wins & 3 nominations total"
  },
  "relatedMovies": [
    "tt0054807",
    "tt0062453",
    "tt0056135",
    "tt2784936",
    "tt14292086",
    "tt0018770",
    "tt0012364",
    "tt0058567",
    "tt0037635",
    "tt0021814",
    "tt0016847",
    "tt0070078"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.701Z"
}