{
  "movieId": "tt0017136",
  "title": "Metropolis",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/metropolis-1927-bdrip-1080p-x-265-dts-hd-ma-5.1-d-0ct-0r-lew-sev",
      "id": "metropolis-1927-bdrip-1080p-x-265-dts-hd-ma-5.1-d-0ct-0r-lew-sev",
      "title": "Metropolis (1927)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. Regarded as one of the most influential films ever made, Metropolis was a financial disaster on release. It only made back about a fifth of its budget back. It didn't fare much better with critics or audiences at the time either. Since then it has become beloved by critics and film lovers worldwide, and is still considered one of the best science fiction pictures ever. The film follows a fiscally divided futuristic city that must unite if they are going to survive. ",
      "fileSize": 19211929596,
      "addedAt": "2026-01-07T00:09:46.434Z",
      "thumbnail": "https://archive.org/services/img/metropolis-1927-bdrip-1080p-x-265-dts-hd-ma-5.1-d-0ct-0r-lew-sev",
      "language": "ger",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 949
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Metropolis1925-ShorterVersion",
      "id": "Metropolis1925-ShorterVersion",
      "title": "Metropolis (1925 - shorter version)",
      "description": "Fritz Lang's silent sci-fi classic. NOTE: this was transferred from a vhs copy. The print that this was taken from was well-worn and quite faded in many scenes. Shows the importance of film preservation.",
      "fileSize": 1579130731,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/Metropolis1925-ShorterVersion",
      "collection": "feature_films",
      "downloads": 39993
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "153 min",
    "imdbRating": 8.2,
    "imdbVotes": 198926,
    "Genre": "Drama, Sci-Fi",
    "Plot": "Sometime in the future, the city of Metropolis is home to a Utopian society where its wealthy residents live a carefree life. One of those is Freder Fredersen. One day, he spots a beautiful woman with a group of children, she and the children quickly disappear. Trying to follow her, he is horrified to find an underground world of workers who apparently run the machinery that keeps the Utopian world above ground functioning. One of the few people above ground who knows about the world below is Freder's father, John Fredersen, who is the founder and master of Metropolis. Freder learns that the woman is called Maria, who espouses the need to join the \"hands\" - the workers - to the \"head\" - those in power above - by a mediator who will act as the \"heart\". Freder wants to help the plight of the workers in their struggle for a better life. But when John learns of what Maria is advocating and that Freder has joined their cause, with the assistance of an old colleague. an inventor called Rotwang, who turns out to be But their nemesis goes to works towards quashing a proposed uprising, with Maria at the centre of their plan. John, unaware that Rotwang has his own agenda., makes plans that include shutting down the machines, with the prospect of unleashing total anarchy both above and below ground.",
    "Director": "Fritz Lang",
    "Writer": "Thea von Harbou, Fritz Lang",
    "Actors": "Brigitte Helm, Alfred Abel, Gustav Fröhlich",
    "Language": "German, None",
    "Country": "Germany",
    "Awards": "7 wins & 6 nominations total"
  },
  "relatedMovies": [
    "tt0015174",
    "tt0015175",
    "tt0016049",
    "tt0038057",
    "tt0035966",
    "tt0037075",
    "tt0037469",
    "tt0042579",
    "tt0045564",
    "tt0045555",
    "tt0047101",
    "tt0010208"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T18:17:07.762Z"
}