{
  "movieId": "tt0042707",
  "title": "The Man Who Cheated Himself",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1950themanwhocheatedhimselfelhombrequeseenganoasimismofelixe.feist",
      "id": "1950themanwhocheatedhimselfelhombrequeseenganoasimismofelixe.feist",
      "title": "1950 - The Man Who Cheated Himself - El hombre que se engañó s sí mismo - Felix E. Feist",
      "description": "1950 - The Man Who Cheated Himself - El hombre que se engañó s sí mismo - Felix E. Feist",
      "fileSize": 1197928196,
      "addedAt": "2026-01-07T00:06:06.562Z",
      "thumbnail": "https://archive.org/services/img/1950themanwhocheatedhimselfelhombrequeseenganoasimismofelixe.feist",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 1128
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Man_Who_Cheated_Himself",
      "id": "Man_Who_Cheated_Himself",
      "title": "The Man Who Cheated Himself",
      "description": "\"Tough cop helps his lover cover up the shooting of her wealthy husband. Mainstream noir, primarily distinguished by its acting and San Francisco visuals.\" - noir expert Spencer Selby Cast: Lee J. Cobb, John Dall, Jane Wyatt, Lisa Howard. 81 min.",
      "fileSize": 18940342831,
      "addedAt": "2026-01-07T00:06:38.751Z",
      "thumbnail": "https://archive.org/services/img/Man_Who_Cheated_Himself",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 154621
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheManWhoCheatedHimself1950",
      "id": "TheManWhoCheatedHimself1950",
      "title": "The man who cheated himself",
      "description": "Shot on location in San Francisco and starring Lee J. Cobb, John Dall and Jane Wyatt, The man who cheated himself tells the story of a policeman who pushes the boundaries of the law by covering up a crime committed by his lover. He then finds himself assigned to investigate that very same crime, along with a new rookie partner who is determined to track down the culprit. The film is also available elsewhere on the archive , as a 2.2GB MPEG2 or on a 7.3GB ISO DVD image. The smaller file offered here is intended to make the film more accessible to people otherwise discouraged by larger versions. Both the XViD/AVI file offered here and the MPEG2 mentioned above seem derived from the exact same print and show the same artifacts, except for the fact that the XViD is a progressive (24fps) transfer while the MPEG2 is a telecined (30fps) transfer. Since the film wasn't well-preserved, the artifacts unfortunately include missing frames, white dots, blinking vertical lines and low crackling/scratching sounds. External links IMDB page American Film Institute entry Wikipedia page Noir of the Week review Under the hood VIDEO: XVID, 640x480, 12bpp, 23.976fps, 1093.5kbps AUDIO: MP3, 48000Hz, 2 channels, 16-bit, 128kbps Original copyright registration : THE MAN WHO CHEATED HIMSELF. Twentieth Century-Fox Film Corp., 1950. 81 min., sd., b&w, 35mm. © Twentieth Century-Fox Film Corp.; 30Dec50; LP697. Copyright renewal registration: none",
      "fileSize": 1595540432,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheManWhoCheatedHimself1950",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 47448
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/manwhocheatedhimself",
      "id": "manwhocheatedhimself",
      "title": "The Man Who Cheated Himself",
      "description": "A woman (Jane Wyatt) in the process of divorce shoots her husband and gets her police lieutenant boyfriend (Lee J. Cobb) to help hide the body.",
      "fileSize": 611493191,
      "addedAt": "2026-01-07T00:09:46.427Z",
      "thumbnail": "https://archive.org/services/img/manwhocheatedhimself",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 8423
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bZXsoLg88-o",
      "id": "bZXsoLg88-o",
      "title": "The Man Who Cheated Himself (1950) [Film Noir] [Crime]",
      "description": "Wealthy socialite Lois Frazer wants a divorce from her husband, but he's not ready to let her go so easy. Suspecting that he intends to murder her, she calls Lieutenant Ed Cullen, with whom she's been having an affair, in an effort to save herself from her husband's wrath. When Ed arrives someone dies, but it's not Lois. With his lover's husband shot dead, Ed finds himself the ironic and dangerous position of being assigned a case that no one knows he actually witnessed. In addition to trying to control the investigation, Ed also has the misfortune of having his own younger brother, a new detective on the force, by his side every step of the way, eager to prove himself.\n\n---\n\nDirected by Felix E. Feist, produced by Jack M. Warner, written by Seton I. Miller (screenplay), Philip MacDonald (screenplay) and Seton I. Miller (story), starring Lee J. Cobb as Lt. Ed Cullen, Jane Wyatt as Lois Frazer, John Dall as Andy Cullen, Lisa Howard as Janet Cullen, Harlan Warde as Howard Frazer, Tito Vuolo as Pietro Capa, Charles Arnt as Ernest Quimby, Marjorie Bennett as Muriel Quimby, Alan Wells as Nito Capa, Mimi Aguglia as Mrs. Capa, Bud Wolfe as Officer Blair, Morgan Farley as Rushton, Howard Negley as Detective Olson, William Gould as Doc Munson, Art Millan as United Airlines Clerk, Gordon Richards as Albert the Butler, Terry Frost as Detective, Mario Siletti as Machetti and Charles Victor as Attorney.\n\n---\n\nSource: \"The Man Who Cheated Himself\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 17 November 2013. Web. 12 March 2013. http://en.wikipedia.org/wiki/The_Man_Who_Cheated_Himself.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:42.344Z",
      "thumbnail": "https://i.ytimg.com/vi/bZXsoLg88-o/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB_9dJtGQ17O4mkFS9J48zQLjdvWQ",
      "duration": 4793,
      "language": "en",
      "year": 1950,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mHQgfE8V33A",
      "id": "mHQgfE8V33A",
      "title": "The Man Who Cheated Himself (1950) | Colorized Public Domain Film Noir Crime Thriller | Lee J. Cobb",
      "description": "The Man Who Cheated Himself (1950) is an American film noir crime thriller directed by Felix E. Feist. This restored and colorized public domain classic captures the moral decay, desperation, and fatal choices that define the noir genre at its peak. Released during the post-war era when Hollywood crime dramas reflected growing anxieties about corruption and betrayal, the film combines tense storytelling with the gritty atmosphere of San Francisco. With its themes of love, greed, and deceit, it remains one of the essential noir films rediscovered today by cinephiles in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe story follows Lt. Ed Cullen (Lee J. Cobb), a veteran San Francisco homicide detective respected by his peers but secretly entangled in a dangerous affair with the wealthy and manipulative Lois Frazer (Jane Wyatt). When Lois kills her estranged husband in a heated confrontation, Cullen makes the fateful decision to cover up the crime, believing his experience as a cop will protect them both.\n\nCullen’s troubles deepen when his younger brother Andy Cullen (John Dall), a newly appointed homicide detective, is assigned to investigate the case. Enthusiastic and determined to prove himself, Andy pursues the investigation with vigor, unaware that his brother is obstructing justice and misleading him at every turn. As the evidence begins to close in, Ed Cullen finds himself trapped between loyalty, guilt, and his own self-destruction. The film builds toward a suspenseful climax at San Francisco’s historic Fort Point, where betrayal, morality, and justice collide.\n\nCast and Crew:\n• Director: Felix E. Feist\n• Screenplay: Philip MacDonald and Seton I. Miller\n• Cinematography: Russell Harlan\n• Editing: Desmond Marquette\n• Producer: Jack L. Warner (uncredited association through Warner Bros. veterans in production)\n\nStarring:\n• Lee J. Cobb as Lt. Ed Cullen\n• Jane Wyatt as Lois Frazer\n• John Dall as Andy Cullen\n• Lisa Howard as Janet Cullen\n• Alan Reed as Detective Schwartz\n• Morris Ankrum as District Attorney\n\nFilm Significance:\nThe Man Who Cheated Himself is notable for its authentic San Francisco locations, including the climactic sequence filmed at Fort Point beneath the Golden Gate Bridge. It exemplifies the noir tradition of morally compromised protagonists undone by passion and poor choices. Lee J. Cobb, better known for his stage and screen performances in Death of a Salesman and On the Waterfront, brings gravitas to the role of a conflicted cop torn between love and law. Jane Wyatt, later famous for her wholesome roles in Father Knows Best, delivers a strikingly different performance as a manipulative femme fatale. The film’s combination of location shooting, tense plotting, and strong performances secures its place among the more memorable mid-century noirs.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Man Who Cheated Himself remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1950 release was filmed in black and white, matching the stylistic expectations of film noir. While historically significant, black-and-white features are often bypassed by modern audiences. By offering a colorized and restored version, we preserve the film’s dramatic tension and urban atmosphere while making it more visually dynamic for contemporary viewers. This edition allows the timeless themes of crime, morality, and betrayal to connect with today’s audiences without losing the essence of its noir heritage.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from gripping film noirs to forgotten B-movies and historically significant dramas. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheManWhoCheatedHimself #FilmNoir #LeeJCobb #JaneWyatt #JohnDall #PublicDomainMovie #ColorizedClassic #CrimeThriller #GoldenAgeHollywood #SanFranciscoFilm",
      "addedAt": "2025-12-24T00:48:02.899Z",
      "thumbnail": "https://i.ytimg.com/vi/mHQgfE8V33A/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYSyBZKGUwDw==&rs=AOn4CLAoj_atOSIPBOM-3vWh2DF2rGRQXQ",
      "duration": 4737,
      "language": "en",
      "year": 1950,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dPfaIzYXna0",
      "id": "dPfaIzYXna0",
      "title": "The Man Who Cheated Himself (1950) Film-Noir - a man's weakness and a woman's betrayal!",
      "description": "When a detective's secret affair turns deadly, he must outsmart his own brother to bury the truth.  A tangled web of love, lies, and loyalty in fog-shrouded San Francisco.\nVeteran cop Ed Cullen witnesses his lover Lois Frazer fatally shoot her husband, then helps conceal the crime. But when his rookie brother Andy gets assigned to the case, Ed must sabotage the investigation without destroying Andy's career or exposing his own guilt.\n\nTitle: The Man Who Cheated Himself (1950) | AKA: The Gun\n\nBlack & white version:. https://youtu.be/1DbLv4l5H_U\n\n⭐️ STARRING\nLee J. Cobb - Lt. Ed Cullen\nJane Wyatt - Lois Frazer\nJohn Dall - Andy Cullen\nLisa Howard - Janet Cullen\nHarlan Warde - Howard Frazer\nTito Vuolo - Pietro Capa\nCharles Arnt - Ernest Quimby\nMarjorie Bennett -- Muriel Quimby\nAlan Wells - Nito Capa\n\n🎬 CREW\nDirected by Felix E. Feist (The Devil Thumbs a Ride, Tomorrow is Another Day)\nWritten by Seton I. Miller & Philip MacDonald\nAtmospheric cinematography by Russell Harlan (Gun Crazy)\n\n🎯 WHY WATCH?\n🕵️‍♂️ Twisty Cover-up • 👨‍👦 Brother vs. Brother • 💔 Moral Conflict\nLee J. Cobb masterfully unravels as a cop caught in his own trap!\nIconic Fort Point finale beneath the Golden Gate Bridge – pure visual tension ✨\nNoir perfection – where every shadow hides a new layer of deception!\n\n🔔 SUBSCRIBE @CultCinemaClassics\n\nFilm-Noir • Hard-boiled Detective • Drama • Mystery • Suspense • Colorized classics",
      "addedAt": "2025-12-24T00:59:00.724Z",
      "thumbnail": "https://i9.ytimg.com/vi/dPfaIzYXna0/hqdefault_custom_1.jpg?sqp=COTzrMoG-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA8rQLel0OXLm649_oo-TL7Pew4Gw",
      "duration": 4789,
      "language": "en",
      "year": 1950,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-man-who-cheated-himself-1950_202307",
      "id": "the-man-who-cheated-himself-1950_202307",
      "title": "The Man Who Cheated Himself (1950)",
      "description": "A veteran homicide detective who has witnessed his socialite girlfriend kill her husband sees his inexperienced brother assigned to the case. Watch on RetroFlix.org:  https://retroflix.org/the-man-who-cheated-himself-1950/",
      "fileSize": 765294231,
      "addedAt": "2026-01-07T00:12:10.592Z",
      "thumbnail": "https://archive.org/services/img/the-man-who-cheated-himself-1950_202307",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 839
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "81 min",
    "imdbRating": 6.8,
    "imdbVotes": 2807,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Rich Lois Frazer, divorcing her fortune-hunter husband, finds he's bought a gun. Suspecting he plans to kill her, she calls in her lover, who just happens to be Homicide Lieutenant Ed Cullen. When Ed arrives, the gun gets used...and because of his relationship with Lois, Ed is compelled to compound a felony. The good news: Ed himself is assigned to the case. The bad news: Ed's hotshot younger brother Andy, a new- minted detective, is also on the case...and anxious to prove himself.",
    "Director": "Felix E. Feist",
    "Writer": "Seton I. Miller, Philip MacDonald",
    "Actors": "Lee J. Cobb, Jane Wyatt, John Dall",
    "Language": "English, Italian",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043320",
    "tt0042579",
    "tt0039208",
    "tt0041958",
    "tt0042869",
    "tt0043142",
    "tt0042274",
    "tt0042394",
    "tt0043292",
    "tt0042379",
    "tt0042428",
    "tt0042792"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}