{
  "imdbId": "tt0032774",
  "title": "Meet the Wildcat",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/meet-the-wildcat-1940",
      "title": "Meet The Wildcat",
      "description": "Title: Meet the Wildcat Summary: Magazine photographer Ann Larkin is snapping photos at Mexico's National Museum when she sees Brod Williams steal a painting from its frame. Convinced that Brod is the notorious art thief ... Directed by: Arthur Lubin Actors: Ralph Bellamy, Margaret Lindsay, Joseph Schildkraut Production Company: Universal Pictures Release Date: 22 November 1940 (USA) Aspect Ratio: 1.37 : 1 Magazine photographer Ann Larkin is snapping photos at Mexico's National Museum when she sees Brod Williams steal a painting from its frame. Convinced that Brod is the notorious art thief known as \"The Wildcat,\" Ann follows him into the street and accuses him of being the thief. Even though the police attest that Brod is a New York City police detective, Ann remains dubious and consequently follows Brod when he visits the Dumeray gallery. At the gallery, Brod asks Leon Dumeray to store a painting in his vault. Recognizing the canvas as stolen, Dumeray has Brod arrested. Her interest piqued, Ann visits Brod in jail where he asks her to bring him some fruit from Juan's fruit stand. Ann returns with a pineapple, in which a gun is concealed. Holding Ann at gunpoint, Brod demands that she switch clothing with him and, thus disguised, he blasts his way out of jail. After his escape, the police congratulate Brod on his clever ruse of staging a jail break in order to win the Wildcat's ...",
      "id": "meet-the-wildcat-1940"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/meet-the-wildcat-1940_202110",
      "title": "Meet The Wildcat 1940 202110",
      "description": "Ralph Bellamy, Margaret Lindsay",
      "id": "meet-the-wildcat-1940_202110"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": "6.3",
    "imdbVotes": "75",
    "Genre": "Mystery",
    "Plot": "Magazine photographer Ann Larkin is snapping photos at Mexico's National Museum when she sees Brod Williams steal a painting from its frame. Convinced that Brod is the notorious art thief known as \"The Wildcat,\" Ann follows him into the street and accuses him of being the thief. Even though the police attest that Brod is a New York City police detective, Ann remains dubious and consequently follows Brod when he visits the Dumeray gallery. At the gallery, Brod asks Leon Dumeray to store a painting in his vault. Recognizing the canvas as stolen, Dumeray has Brod arrested. Her interest piqued, Ann visits Brod in jail where he asks her to bring him some fruit from Juan's fruit stand. Ann returns with a pineapple, in which a gun is concealed. Holding Ann at gunpoint, Brod demands that she switch clothing with him and, thus disguised, he blasts his way out of jail. After his escape, the police congratulate Brod on his clever ruse of staging a jail break in order to win the Wildcat's confidence. Pretending to seek refuge, Brod breaks into Dumeray's home where the art dealer reveals that he is the real Wildcat and recruits Brod to join his gang. Learning of a planned robbery at the museum the following night, Brod passes a message, coded in a bar of soap, warning the police. Meanwhile, Ann discovers that Brod really is a police detective, and when she sees him at Dumeray's house, she assumes that the two are working together and unintentionally lets Dumeray know who Brad is. Dumeray then takes Brod, Ann and her driver Max prisoner and ties them up in the power house near the museum. That night, as Dumeray tunnels into the museum, Brod breaks loose of his bonds and flashes an S-O-S signal over the power lines. He then hold the thieves at bay until the police arrive to meet the real Wildcat.",
    "Director": "Arthur Lubin",
    "Writer": "Alex Gottlieb",
    "Actors": "Ralph Bellamy, Margaret Lindsay, Joseph Schildkraut",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0031865",
      "title": "Risky Business",
      "year": 1939,
      "imdbRating": "6.4",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033573",
      "title": "Ellery Queen and the Perfect Crime",
      "year": 1941,
      "imdbRating": "6.0",
      "imdbVotes": "179",
      "language": "German, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033574",
      "title": "Ellery Queen's Penthouse Mystery",
      "year": 1941,
      "imdbRating": "5.6",
      "imdbVotes": "217",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032258",
      "title": "Black Friday",
      "year": 1940,
      "imdbRating": "6.3",
      "imdbVotes": "3,077",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032509",
      "title": "Gangs of Chicago",
      "year": 1940,
      "imdbRating": "6.3",
      "imdbVotes": "94",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034398",
      "title": "The Wolf Man",
      "year": 1941,
      "imdbRating": "7.2",
      "imdbVotes": "32,995",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034602",
      "title": "A Close Call for Ellery Queen",
      "year": 1942,
      "imdbRating": "5.6",
      "imdbVotes": "152",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032017",
      "title": "There's That Woman Again",
      "year": 1938,
      "imdbRating": "6.0",
      "imdbVotes": "261",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030449",
      "title": "Midnight Intruder",
      "year": 1938,
      "imdbRating": "6.3",
      "imdbVotes": "148",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030625",
      "title": "Prison Break",
      "year": 1938,
      "imdbRating": "6.1",
      "imdbVotes": "323",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035252",
      "title": "Ride 'Em Cowboy",
      "year": 1942,
      "imdbRating": "6.5",
      "imdbVotes": "1,774",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032406",
      "title": "Chamber of Horrors",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "731",
      "language": "Italian, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T07:04:59.087Z"
}