{
  "movieId": "tt0036669",
  "title": "Brand of the Devil",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/brand_of_the_devil",
      "id": "brand_of_the_devil",
      "title": "Brand of the Devil",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 3518774133,
      "addedAt": "2026-01-07T00:07:38.720Z",
      "thumbnail": "https://archive.org/services/img/brand_of_the_devil",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 123429
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1J5FNOPr7xs",
      "id": "1J5FNOPr7xs",
      "title": "Brand of The Devil (1944) DAVE O'BRIEN",
      "description": "Stars: Dave O'Brien, James Newill, Guy Wilkerson \n Director: Harry L. Fraser\n\n Texas Rangers Jim Steele, Tex Wyatt and Panhandle Perkins, working undercover, are on the trail of Jack Varno and his cattle-rustling gang who have adopted the insignia of a devil's pitchfork, which has come to be known as \"The Brand of the Devil.\" Varno and his gang---\"Bucko' Lynn, \"Gripper\" Joe and Ed-- also don't hesitate to murder their rustling-and-robbery victims. The Rangers track the gang to Varno's Gold Ace Saloon, where Panhandle, posing as \"Fancy Brand\" McGee, sells branding irons which he claims can not be changed. This gets the attention and confidence of Varno and his gang. Duke Cutter, one of the gang, steals a valuable horse from Molly Dawson. Molly follows Cutter to the saloon, a fight breaks out and Tex and Jim rescue Molly. Molly's foreman Henry Wilburn is working for Varno. He masquerades as Molly and joins Varno's men in a cattle-stealing raid on Jeff Palin's ranch, and Palin tells Sheriff Parker that Molly was the leader. Molly is jailed but Tex and Jim trail the rustlers and capture Wilburn, still wearing Molly's clothes. Wilburn takes her place in jail. The more the Rangers learn about Varno, the more he learns about them and there is a bunch of swapping upper-hand activity before the final shootout in the saloon.",
      "addedAt": "2025-12-26T23:53:44.947Z",
      "thumbnail": "https://i.ytimg.com/vi/1J5FNOPr7xs/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB7gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDUm4Sc-j2QKxXkQKDX_nvYFfdQzA",
      "duration": 3378,
      "language": "en",
      "year": 1944,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "57 min",
    "imdbRating": 5.3,
    "imdbVotes": 114,
    "Genre": "Western",
    "Plot": "Jolley is the leader of the Devil's Brand gang of rustlers. When Molly Dawson sends for the Texas Rangers, Tex, Jim, and Panhandle arrive pretending not to know each other. But eventually their identities become known and they are captured by the gang.",
    "Director": "Harry L. Fraser",
    "Writer": "Elmer Clifton",
    "Actors": "Dave O'Brien, James Newill, Guy Wilkerson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037673",
    "tt0036888",
    "tt0037304",
    "tt0037176",
    "tt0036664",
    "tt0036847",
    "tt0036750",
    "tt0037460",
    "tt0037901",
    "tt0032902",
    "tt0032707",
    "tt0022921"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.720Z"
}