{
  "imdbId": "tt0025006",
  "title": "Cowboy Holiday",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cowboy_holiday",
      "id": "cowboy_holiday",
      "title": "Cowboy Holiday",
      "description": "Buck Sawyer and a Sheriff try to track down an outlaw masquerading as one of Buck's old friends. You can find more information regarding this film on its IMDb page .",
      "fileSize": 3924420131,
      "addedAt": "2026-01-07T00:07:51.625Z",
      "thumbnail": "https://archive.org/services/img/cowboy_holiday",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 31848
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hvruphAjBnU",
      "id": "hvruphAjBnU",
      "title": "Cowboy Holiday (1934) BIG BOY WILLIAMS",
      "description": "Stars: 'Big Boy' Williams, Janet Chandler, Julian Rivero \n Director: Robert F. Hill\n\n A cowboy tries to help his lawman friend, who will lose his job if he doesn't bring in a bandit known as the Juarez Kid.",
      "addedAt": "2025-12-26T23:51:59.969Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/hvruphAjBnU/maxresdefault.webp",
      "duration": 3401,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=52ORqUNIBVA",
      "id": "52ORqUNIBVA",
      "title": "Cowboy Holiday (1934) Action, Comedy, Western | starring Guinn 'Big Boy' Williams | Full Movie",
      "description": "A cowboy tries to help his lawman friend, who will lose his job if he doesn't bring in a bandit known as the Juarez Kid.\n\nDirector: Robert F. Hill (as Bob Hill)\nWriters: Robert F. Hill (as 'Rock Hawkey)\nStars: Guinn 'Big Boy' Williams, Janet Chandler, Julian Rivero \nGenres: Action | Comedy | Drama | Romance | Western \n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:51:24.219Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/52ORqUNIBVA/maxresdefault.webp?v=6295ce93",
      "duration": 3401,
      "language": "en",
      "year": 1934,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "56 min",
    "imdbRating": 4.9,
    "imdbVotes": 79,
    "Genre": "Western",
    "Plot": "Cowboy Buck Sawyer is on his way to a vacation in Waco, Texas, and stops at the house of an old friend, Hank. Hank is in distress because there have been a series of robberies in his county that the residents are blaming on the Juarez Kid, who is really Pablo Escobar. Rumors abound that Hank will be recalled as sheriff in favor of his deputy, Walt Gregor. Hank's mother believes that Walt is framing Hank. Meanwhile, a large man escapes capture and while hiding in a cave, changes out of a Mexican costume. Buck decides to leave for Waco, but on his way out, he is stopped by some men who accuse him of being the Juarez Kid because of his size. Buck knows that Escobar is a small man and after being released, heads into the hills where he hears the disguised man's horse whinny and discovers the costume in the cave. That evening, the Juarez Kid kills a rancher named Hopkins to get the money he paid him for some cattle. Buck rides to the scene, but Ruth, Hopkins' daughter, believes he is the killer and calls her ranch hands for help. Buck escapes but one of the ranch hands shoots him in the arm. Seeing a cabin, Buck enters and makes himself at home, unaware that the two inhabitants are spying on him from a trapdoor in the floor that connects to a small mine. The man, seeing no gun on Buck, advances and Buck recognizes him as Escobar, then faints from the bullet wound. Some time later, Escobar finds gold in the mine while Buck visits Ruth. Walt then arrives and questions Escobar's mother about seeing any strangers. She claims to have seen no one, but Walt sees the hunk of gold ore. Meanwhile, Ruth's ranch hands have gotten rid of Buck, but Hank arrives to tell her that she has misconstrued Buck's actions. At Escobar's cabin, Buck, Escobar and Mama come up with a plan to get Walt. They call him out to the cabin and Mama agrees to sell him the property. That evening, as Mama, Escobar, Hank, Ruth and Buck watch, Walt, disguised as the Juarez Kid, comes to get his money back. They trick Walt into shooting at Mama's bed and after he takes off, with Buck following, Hank and Escobar remove his bullets from the empty bed. His bullets match those that killed Mr. Hopkins, and after Buck subdues him, Walt confesses to the crimes and apologizes. Ruth apologizes to Buck and hires him as her ranch foreman.",
    "Director": "Robert F. Hill",
    "Writer": "Robert F. Hill",
    "Actors": "Guinn 'Big Boy' Williams, Janet Chandler, Julian Rivero",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026260",
    "tt0025143",
    "tt0027167",
    "tt0027006",
    "tt0026253",
    "tt0027789",
    "tt0027874",
    "tt0028491",
    "tt0028101",
    "tt0028188",
    "tt0028712",
    "tt0028865"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.625Z"
}