{
  "imdbId": "tt0002813",
  "title": "Dr. Jekyll and Mr. Hyde",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DrJekyllAndMrHyde1913",
      "title": "Dr Jekyll and Mr Hyde (1913)",
      "description": "William King Baggot stars in this early dramatization of Robert Louis Stephensonâs classic horror story. Although the script maintains the essence of the original story there are a quite a few differences. In this version, for instance, Jekyll is romantically involved with a woman named Alice. Please note that this is a silent movie and no soundtrack has been added. You can learn more about the film at A Passion for Horror",
      "id": "DrJekyllAndMrHyde1913"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-dr-jekyll-and-mr-hyde",
      "title": "Dr. Jekyll and Mr. Hyde",
      "id": "silent-dr-jekyll-and-mr-hyde"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "26 min",
    "imdbRating": "5.1",
    "imdbVotes": "489",
    "Genre": "Short, Drama, Horror",
    "Plot": "Dr. Jekyll. a young London physician, while experimenting, finds a drug by means of which his evil nature predominates, and he is changed into a pale, misshapen creature of malicious and violent passions. During the periods of his transformation he is known as Mr. Hyde. The scene opens in the parlor of Alice, Jekyll 's fiancée. She receives a note from Dr. Jekyll, in which he excuses himself for not being able to take her to the opera as his charity patients have to be attended to, and tells her to go with her father. Alice is angered. We next see Dr. Jekyll attending to his charity patients at his own office. Dr. Lanyon and Lawyer Utterson enter and make fun of Jekyll on account of his professional zeal for strange drug experiments. Later we see Dr. Jekyll in his laboratory, where, in the dead silence of the night, he plans to set free his evil self. He drinks the fluid he has discovered and is transformed from Dr. Jekyll to Mr. Hyde, now presenting the figure of a hideous deformed monster. He writes the following note: \"To My Household Servants. The bearer, Mr. Hyde, is my best friend. Treat him as myself. Dr. Jekyll.\" Hyde gives the note to the butler, who shows it to the nurse. They are both very much frightened at Hyde's fiendish appearance, but consent to carry out the instructions of their master. Hyde enters a dance hall and frightens everybody by his grotesque antics and hideous demeanor. Next we see him beating a poor crippled boy. A crowd assembles and Hyde takes refuge in Dr. Jekyll's laboratory. The crowd follow him there, and Hyde pays for the injuries the boy has sustained through the beating he has given him. The lawyer, Utterson, calls while Hyde is taking the antidote, and as he barely escapes being seen by Utterson before the transformation takes place, Dr. Jekyll vows that he will never again tempt fate. A little later, while he is sitting at the fireplace, Dr. Jekyll feels a strange sensation, and realizes that he is being transformed to Hyde. His evil nature is gradually beginning to predominate without the use of the drug. Dr. Jekyll next dictates his will to Mr. Utterson. One clause of the will reads: \"In case of my death or disappearance, all my worldly possessions revert to Mr. Hyde.\" Alice calls on Dr. Jekyll, and meets Mr. Utterson and Dr. Lanyon. She enters the office of Dr. Jekyll, just as he is being transformed, but he manages to stop the transformation by taking the antidote. At the next attack he is not so fortunate; the attack comes on in front of Alice's house. Alice goes into the house to get a glass of water. In running away to avoid detection. Hyde meets Alice's father, and strangles him. Alice rushes after her lover and finds her father stretched out on the ground dead while Hyde is hiding in the bushes. Hyde makes his escape, and gives a note to a boy he meets, telling him to run with it to Dr. Lanyon. The note asks the doctor to get the antidote Dr. Lanyon secures the antidote, and we next see Hyde in Dr. Lanyon's library, where, by means of the drug he again becomes Dr. Jekyll. The police, however, are now after Hyde, and track him to his bedroom, but he fools them by taking the antidote. Dr. Jekyll emerges from the bedroom, and Hyde cannot be found. But one day, Dr. Jekyll accidentally spills the valuable fluid. He looks around his laboratory for the requisite ingredients to renew it, but cannot find them. Then he writes a prescription, and waving it through the open door so that he cannot be seen, he orders the butler to go to every chemist in London, if necessary, to have the prescription filled. Meanwhile, Mr. Utterson and Dr. Lanyon call to see him. Hyde raves around frantically looking for bottles of medicine, while the police, who are still on his track, are trying to obtain entrance. Owing to his fear of discovery, Hyde's raving turns to fiendish fury, and finally he drops dead. The door is broken open, and Dr. Lanyon covers the corpse with a cloth so as to hide the hideous features of Hyde from the spectators. Presently Alice rushes in, lifts the cloth, and behold, Hyde in death has been transformed to Dr. Jekyll. She gives way to grief while Dr. Lanyon tries to console her by proclaiming Dr. Jekyll a noble martyr to medical science.",
    "Director": "Herbert Brenon",
    "Writer": "Herbert Brenon, Robert Louis Stevenson",
    "Actors": "King Baggot, Jane Gail, Matt Snyder",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0470339",
      "title": "The Haunted Bedroom",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "27",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003424",
      "title": "Suspense",
      "year": 1913,
      "imdbRating": "7.4",
      "imdbVotes": "2,375",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002143",
      "title": "Dr. Jekyll and Mr. Hyde",
      "year": 1912,
      "imdbRating": "6.0",
      "imdbVotes": "893",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002784",
      "title": "Cymbeline",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "50",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "625",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002910",
      "title": "Granddad",
      "year": 1913,
      "imdbRating": "6.0",
      "imdbVotes": "89",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003075",
      "title": "The Little Tease",
      "year": 1913,
      "imdbRating": "5.7",
      "imdbVotes": "44",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003497",
      "title": "The Unwelcome Guest",
      "year": 1913,
      "imdbRating": "6.6",
      "imdbVotes": "33",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003516",
      "title": "The Wanderer",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "65",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0778062",
      "title": "Silent Heroes",
      "year": 1913,
      "imdbRating": "4.9",
      "imdbVotes": "29",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0464694",
      "title": "Tannhäuser",
      "year": 1913,
      "imdbRating": "5.2",
      "imdbVotes": "44",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002816",
      "title": "The Drummer of the 8th",
      "year": 1913,
      "imdbRating": "5.9",
      "imdbVotes": "128",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:16:04.527Z"
}