{
  "movieId": "tt0022651",
  "title": "Back Street",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/back-street-1932-film-noir-drama",
      "id": "back-street-1932-film-noir-drama",
      "title": "Back Street (1932 Film Noir, Drama)",
      "description": "TAGLINES : 01) NOT WIFE...NOT JUST SWEETHEART...BUT MORE! (Print Ad-Toledo News-Bee,-(Toledo, Ohio)- 8 September 1932 ) 02) A story of passion and love-fiction that seems fact. (Print Ad-Daily Star, -Long Island City, NY- 26 October 1932 ) 03) For every woman who has loved unwisely...for every man who has loved too well...Fannie Hurst's great novel comes to the screen as one of the year's great pictures. (Print Ad-New York Evening Post, ((New York, NY)) 26 August 1932 ) 04) Waiting--always waiting--in the shadows of the back streets...longing for the man she loves...asking nothing, receiving nothing--yet content to sacrifice all for him. WHY? PLOT : A woman's love for and devotion to a married man results in her being relegated to the \"back streets\" of his life. _IMDb by IMDb User Review : Signs Of Reality In Dunne's Performance (Mar. 15 2020 by boblipton): This Stahl weeper stars Irene Dunne as John Boles' kept woman, whom George Meeker wants to marry, although I thought that Meeker might be the 6th Marx Brother, judging by his look and voice. It's from a Fanny Hurst opus, but even though the script is not as intelligent as yesterday's Seed, it's a much better movie. It's tighter -- ten minutes shorter -- with a beautiful set-piece opening which purports to be Cincinnati in 1907 , complete with band shell, no automobiles and plenty of horses -- spotless streets, despite the horses. Was you ever in Cincinnati, Charlie? I still don't like soapers, but Irene's oh-well-it-is-what-it-is attitude when she can't help lovin' dat man o' someone else's is far more affecting than the typical overwrought attitude. Satisfied with second place ... (Sep 16, 2020 by CinemaSerf): Irene Dunne (\"Rae\") gives a strong performance here as a woman who sacrifices her first love so she can help her step-sister. Many years later, she encounters the successful, married \"Walter Saxel\" (John Boles) again and they embark on an affair. The plot is simple, and probably rather racy for the early 1930s, but the two stars with some help from Zasu Pitts create a character-driven romantic drama with a sense of kindness and affection belied in the rather poor title. Maybe a touch too long, the story certainly takes a bit too long to get up a head of steam, but it's well worth a watch if you get a chance. TRIVIA : 01) Debut of actress Grace Hayle 02) Final film of Virginia Pearson. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **  (Thank you mjr1114 channel)",
      "fileSize": 286061217,
      "addedAt": "2026-01-07T00:07:31.712Z",
      "thumbnail": "https://archive.org/services/img/back-street-1932-film-noir-drama",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 6047
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "93 min",
    "imdbRating": 7,
    "imdbVotes": 1122,
    "Genre": "Drama, Mystery, Romance",
    "Plot": "A woman's love for and devotion to a married man results in her being relegated to the \"back streets\" of his life.",
    "Director": "John M. Stahl",
    "Writer": "Fannie Hurst, Gladys Lehman, Lynn Starling",
    "Actors": "Irene Dunne, John Boles, George Meeker",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0022989",
    "tt0037865",
    "tt0030359",
    "tt0036037",
    "tt0026124",
    "tt0020146",
    "tt0024989",
    "tt0022879",
    "tt0023537",
    "tt0029855",
    "tt0022628",
    "tt0022662"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.712Z"
}