{
  "imdbId": "tt0036723",
  "title": "Cover Girl",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/you-were-never-lovelier-1942_202109",
      "id": "you-were-never-lovelier-1942_202109",
      "title": "Cover Girl (1944) Modelos",
      "description": "Modelos (Cover Girl - 1944)",
      "fileSize": 1764458024,
      "addedAt": "2026-01-07T00:13:17.038Z",
      "thumbnail": "https://archive.org/services/img/you-were-never-lovelier-1942_202109",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 6996
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "107 min",
    "imdbRating": 6.7,
    "imdbVotes": 6294,
    "Genre": "Comedy, Music, Musical",
    "Plot": "Rusty Parker, a red-headed leggy dancer at Danny McGuire's Night Club in Brooklyn, wants to be a successful Broadway star. She enters a contest to be a 'Cover Girl' as a stepping-stone in her career. She reminds the publisher, John Coudair, of his lost love, showgirl Maribelle Hicks. He was engaged to Maribelle, although his wealthy society mother made fun of her. Maribelle left John at the altar when she saw the piano at her wedding. It reminded her of the piano-player she truly loved. Rusty is Maribelle's granddaughter and there are musical sequences with Maribelle dancing to songs from the beginning of the 20th century. Rusty lands on the cover of her grandmother's former fiancé's magazine (as a bride). She is pursued by Coudair's pal, the wealthy theatrical producer, Noel Wheaton. He produces a lavish musical to star Rusty, surrounded by real cover girls of the mid 1940's. Rusty runs down a huge spiral into the arms of dozens of men who seem clumsy next to her ethereal dancing. But her success threatens Danny McGuire. He expressed his distress that his girlfriend will find success without him in Kelly's famous dance with himself, 'Alter Ego'. He and his sidekick, Genius, leave New York and entertain soldiers fighting in World War II. Rusty agrees to marry Noel, dazzled by success, security, and his power and money. But she drinks and loses weight because her heart belongs to Danny. She receives a symbolic pearl with great power and tells Coudair and Wheaton that she must spend her life with the man she loves.",
    "Director": "Charles Vidor",
    "Writer": "Virginia Van Upp, Marion Parsonnet, Paul Gangelin",
    "Actors": "Rita Hayworth, Gene Kelly, Lee Bowman",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 3 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt0037399",
    "tt0036941",
    "tt0037650",
    "tt0038382",
    "tt0034416",
    "tt0037514",
    "tt0032686",
    "tt0040552",
    "tt0035583",
    "tt0151753",
    "tt0036635",
    "tt0029482"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:17.038Z"
}