{
  "imdbId": "tt0065820",
  "title": "The Hawaiians",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-hawaiians-1970_202507",
      "id": "the-hawaiians-1970_202507",
      "title": "The Hawaiians (1970) Charlton Heston · Geraldine Chaplin",
      "description": "A former South Sea captain who settles in Hawaii and becomes wealthy thanks to pineapple cultivation becomes entangled in a state affair that ultimately leads to the island's annexation to the United States... A lavish adventure and historical spectacle, it's broken down into countless episodes, few of which are touchingly human. The film, based on James A. Michener's thick bestseller, suffers from severe truncation, a consequent lack of concept, and a lack of psychological development of the main character.",
      "fileSize": 3275217669,
      "addedAt": "2026-01-07T00:12:10.587Z",
      "thumbnail": "https://archive.org/services/img/the-hawaiians-1970_202507",
      "language": "eng",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 222
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "134 min",
    "imdbRating": 6.1,
    "imdbVotes": 1461,
    "Genre": "Adventure, Drama",
    "Plot": "The intertwined lives of two kindred souls with ambition begins when Captain Whip Hoxworth discovers that Nyuk Tsin has been smuggled aboard as part of cargo on The Carthaginian, which he captains, a cargo supposed to consist of only male Chinese workers bound for Hawaii. Nyuk Tsin was kidnapped from her Haaka village to be sold to a Honolulu brothel. She is spared when Mun Ki claims she is his wife, and Hoxworth goes along with his wife's suggestion that they can work in the Hoxworth household as domestic servants. Nyuk Tsin becomes known to all as Wu Chow's Auntie (Aunt of Five Continents) when her five sons are named after continents (with Mun Ki's wife in China regarded as their official mother). Whip founds an empire in pineapples, using Japanese laborers, after smuggling his first seed crop from French Guiana as Wu Chow's Auntie grows a family business in Honolulu around her sons.",
    "Director": "Tom Gries",
    "Writer": "James A. Michener, James R. Webb",
    "Actors": "Charlton Heston, Tina Chen, Geraldine Chaplin",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 2 nominations total"
  },
  "relatedMovies": [
    "tt0047470",
    "tt0068642",
    "tt0066049",
    "tt0064093",
    "tt0065988",
    "tt0066335",
    "tt0065374",
    "tt0064965",
    "tt0064615",
    "tt0064639",
    "tt0066987",
    "tt0067216"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.587Z"
}