{
  "imdbId": "tt0041532",
  "title": "The Judge",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheJudge1949",
      "id": "TheJudge1949",
      "title": "The Judge",
      "description": "Title: The Judge Summary: A crooked lawyer blackmails a client into a murder plot against his wife. Directed by: Elmer Clifton Actors: Milburn Stone, Katherine DeMille, Paul Guilfoyle Production Company: Emerald Productions Inc. Release Date: 31 January 1949 (USA) Aspect Ratio: 1.37 : 1 Martin Strong (Milburn Stone), prominent criminal attorney, becomes conscience-stricken when his is forced to come to the defense of an insane killer whom he had freed from a similar charge a year earlier. Goaded by his scheming wife, Lucille (Katherine deMille),who is in love with Dr. James Anderson (Stanley Waxman), the county police psychiatrist, Strang finally goes off the deep end when he realizes his career has become a king-size failure. In a dual plan to seek revenge for his wife's infidelity and betrayal, he writes a will leaving his fortune to the families who have been wronged by the guilty criminals he has aided. His plan is changed when he accidently becomes a witness to a crime committed by a stranger, William Jackson (Paul Guilfoyle). Certain legal aspects of the murder appeal to Strang's warped mind, and he comes to the defense of Jackson, and secures his temporary freedom by a clever legal trick. Trying to prove to himself whether he has been right or wrong in freeing...",
      "fileSize": 564360041,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheJudge1949",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 9965
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jHP1Y84xtvg",
      "id": "jHP1Y84xtvg",
      "title": "The Judge (1949) MILBURN STONE🍕 PSYCHO CRIME THRILLER",
      "description": "It's Friday @PizzaFLIX \nDirector: Elmer Clifton\nStars: Milburn Stone, Katherine DeMille, Paul Guilfoyle \n🍕The inaugural film of Emerald Productions, founded by Ida Lupino and named after her mother, Connie Emerald🍕\nThis gripping psychological crime thriller weaves suspense and moral conflict into a taut courtroom thriller. Set against a backdrop of justice and deception, the film follows a defense attorney drawn into a high-stakes murder case that challenges the limits of loyalty and truth.\n\nStarring Milburn Stone in a powerful leading role, the film also features Paul Guilfoyle, Katherine DeMille, and Jonathan Hale, each delivering nuanced performances that drive the drama forward. Robert Bice, Frank J. Scannell, and other supporting cast members add depth to a tense and atmospheric story that keeps audiences guessing until the final verdict.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nWith its taut direction by Elmer Clifton, shadow-rich cinematography, and compelling character arcs, this late-1940s gem captures the essence of postwar American crime films. Themes of justice, moral compromise, and the cost of ambition make it as thought-provoking now as it was upon release. A must-see for fans of vintage legal dramas and classic film noir storytelling.\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\n#FilmNoir #ClassicMovies #MilburnStone #KatherineDeMille #PaulGuilfoyle #CourtroomDrama #ElmerClifton #1940sCinema #CrimeMovies #VintageHollywood #PizzaFLIX",
      "addedAt": "2025-12-24T01:03:36.691Z",
      "thumbnail": "https://i.ytimg.com/vi/jHP1Y84xtvg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCUGr6yrKQglMFrHx6xK31_cFLy9A",
      "duration": 4224,
      "language": "en",
      "year": 1949,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "69 min",
    "imdbRating": 5.9,
    "imdbVotes": 185,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Martin Strong (Milburn Stone), prominent criminal attorney, becomes conscience-stricken when his is forced to come to the defense of an insane killer whom he had freed from a similar charge a year earlier. Goaded by his scheming wife, Lucille (Katherine deMille),who is in love with Dr. James Anderson (Stanley Waxman), the county police psychiatrist, Strang finally goes off the deep end when he realizes his career has become a king-size failure. In a dual plan to seek revenge for his wife's infidelity and betrayal, he writes a will leaving his fortune to the families who have been wronged by the guilty criminals he has aided. His plan is changed when he accidently becomes a witness to a crime committed by a stranger, William Jackson (Paul Guilfoyle). Certain legal aspects of the murder appeal to Strang's warped mind, and he comes to the defense of Jackson, and secures his temporary freedom by a clever legal trick. Trying to prove to himself whether he has been right or wrong in freeing guilty criminals, Strang plays on Jackson to the point where his plan backfires and he is murdered by Jackson. Evidence planted earlier by Strang places Dr. Anderson and Lucille under suspicion of his murder, and they are arrested.",
    "Director": "Elmer Clifton",
    "Writer": "Anson Bond, Samuel Newman, Elmer Clifton",
    "Actors": "Milburn Stone, Katherine DeMille, Paul Guilfoyle",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041503",
    "tt0041268",
    "tt0041555",
    "tt0041761",
    "tt0041269",
    "tt0041786",
    "tt0042006",
    "tt0041958",
    "tt0041967",
    "tt0041968",
    "tt0041243",
    "tt0041368"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}