{
  "imdbId": "tt0031232",
  "title": "Disbarred",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/disbarred-1939",
      "id": "disbarred-1939",
      "title": "Disbarred (1939)",
      "description": "Robert Preston, Sidney Toler",
      "fileSize": 1479034281,
      "addedAt": "2026-01-07T00:08:07.358Z",
      "thumbnail": "https://archive.org/services/img/disbarred-1939",
      "collection": "feature_films",
      "downloads": 773
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 6,
    "imdbVotes": 49,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "The Bar Association disbars attorney Tyler Cradon when it appears he was implicated in the murder of a prominent vice crusader. Cradon, not wishing to be without an income,is impressed by the way Joan Carroll handled a small-town murder, poses as a real estate agent and offers to get her into a law firm of a friend of his. Placed in the office of Roberts, running a front for Cradon, Joan is taught every trick of the trade. With her cases all prepared for her, she goes from one courtroom victory to another, soon becoming the darling of the underworld and the despair of all law-enforcing authorities. Her performances impress the young assistant district attorney, Bradley Kent, and they begin a budding romance in spite of the fact that Kent criticizes her connections. But when Roberts asks her to defend a notorious racketeer who has murdered a policeman, she realizes that Kent was right and immediately joins the district attorney's office as a deputy. Learning that the authorities are on Roberts' trail, she goes to see Cradon, whom she still believes to be a hard-working, honest real estate agent, to warn him about the kind of company he is keeping.",
    "Director": "Robert Florey",
    "Writer": "Lillie Hayward, Robert Presnell Sr., Harry Sauber",
    "Actors": "Gail Patrick, Robert Preston, Otto Kruger",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033582",
    "tt0034959",
    "tt0030039",
    "tt0030322",
    "tt0041269",
    "tt0042618",
    "tt0030266",
    "tt0028770",
    "tt0032022",
    "tt0031179",
    "tt0031465",
    "tt0031259"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.358Z"
}