{
  "imdbId": "tt0039075",
  "title": "Vacation in Reno",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/vacation-in-reno-1946-",
      "id": "vacation-in-reno-1946-",
      "title": "Vacation In Reno (1946)",
      "description": "Jack Haley, Anne Jeffreys, Wally Brown",
      "fileSize": 959643418,
      "addedAt": "2026-01-07T00:12:55.133Z",
      "thumbnail": "https://archive.org/services/img/vacation-in-reno-1946-",
      "collection": "feature_films",
      "downloads": 938
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "60 min",
    "imdbRating": 5.3,
    "imdbVotes": 174,
    "Genre": "Action, Comedy, Romance",
    "Plot": "Jack Carroll and his wife have a phony argument to teach their friends a lesson, but when he makes a crack that her mother is a \"fat porpoise,\" they fight for real and she leaves him. To make matters worse, Jack runs into two men just before they don masks and rob a bank. Now he is the only one who can identify them. In spite of all this, he takes a vacation in Reno; he is convinced he can use a metal detector to find buried treasure and realize his dream of starting a rabbit farm. Coincidentally, the bank robbers make their getaway to Reno and check into the same dude ranch as Jack. In fact, they bury a suitcase full of the loot and who should find it but hapless Jack himself. This is just the beginning of Jack's troubles, as he finds himself at odds with a deputy sheriff, a roughneck sailor and a gun moll who tries (for complicated reasons) to convince the police she is Mrs. Carroll. Worst of all, Jack's wife arrives and wants a divorce. Before this mess is cleared up, Jack will risk life and limb on a runaway stagecoach.",
    "Director": "Leslie Goodwins",
    "Writer": "Charles E. Roberts, Arthur A. Ross, Charles Kerr",
    "Actors": "Jack Haley, Anne Jeffreys, Wally Brown",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037735",
    "tt0039339",
    "tt0037098",
    "tt0037100",
    "tt0012701",
    "tt0015324",
    "tt0020227",
    "tt0012513",
    "tt0019676",
    "tt0016971",
    "tt0130085",
    "tt0035067"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.133Z"
}