{
  "imdbId": "tt0002512",
  "title": "The Sunbeam",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-sunbeam",
      "id": "silent-the-sunbeam",
      "title": "The Sunbeam",
      "fileSize": 138302133,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-sunbeam",
      "language": "English",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 253
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheSunbeam",
      "id": "TheSunbeam",
      "title": "The Sunbeam",
      "description": "The Sunbeam was directed by D W Griffith in 1912. When a film called The Sunbeam refers to a little girl with a dead mother, you know you are in for a bit of sentimentality and so you are. But given that, it is a neat little film with an interesting picture of life in a tenement house and the social mores of the day.",
      "fileSize": 308724213,
      "addedAt": "2026-01-07T00:07:05.037Z",
      "thumbnail": "https://archive.org/services/img/TheSunbeam",
      "collection": "feature_films",
      "downloads": 4828
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheSunbeam_201507",
      "id": "TheSunbeam_201507",
      "title": "\"The Sunbeam\" (1912) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Sunbeam\" is a short drama. The film is included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame. A friendless bachelor and a lonely spinster have a frosty relationship, which only gets worse as a result of children's pranks. Then one day a tragic event and a friendly little girl known as Sunbeam cause a dramatic change. Directed by                          D.W. Griffith Produced by                        Biograph Company Cinematography                G.W. Bitzer Starring                               Ynez Seabury, Claire McDowell, Dell Henderson, Kate Bruce Distributed by                     The General Film Company Release date                         February 26, 1912 Running time                      15 min. Country                               United States Language                             Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 176431399,
      "addedAt": "2026-01-07T00:07:05.037Z",
      "thumbnail": "https://archive.org/services/img/TheSunbeam_201507",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 1123
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "17 min",
    "imdbRating": 6.2,
    "imdbVotes": 412,
    "Genre": "Drama, Short, Romance",
    "Plot": "Set in a tenement boarding house, a lonely confirmed bachelor occupies a room across the hall from a dour spinster. Children run amok in the hallways playing pranks. Believing the bachelor perpetrated one particular prank, the spinster woman enters his room to confront him. She is followed by a neighbor child. Meanwhile, the other children have stolen a scarlet fever quarantine sign and posted it on the bachelor's door. The police, unaware that the quarentine sign is a prank, enforce the confinement. But aided by the sweet disposition of the toddler quarantined with them, the icy relations between spinster and bachelor begin to thaw, . . .",
    "Director": "D.W. Griffith",
    "Writer": "George Hennessy",
    "Actors": "Ynez Seabury, Kate Bruce, Claire McDowell",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001987",
    "tt0002795",
    "tt0001978",
    "tt0001740",
    "tt0001371",
    "tt0001459",
    "tt0002400",
    "tt0002212",
    "tt0002176",
    "tt0002391",
    "tt0002546",
    "tt0002302"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:38:38.375Z"
}