{
  "imdbId": "tt0017350",
  "title": "The Scarlet Letter",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-movie_202210",
      "id": "my-movie_202210",
      "title": "\"The Scarlet Letter\" (1926) director Victor Sjöström (Seastrom) starring Lillian Gish",
      "description": "This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   The film features director Victor Sjöström (Seastrom), a star of Silent Hall of Fame. Victor Seastrom was successful in his native Sweden before making a career in the USA in 1924-1930.  His Hollywood films are still copyrighted, this is why we show you a film from his previous years.     \"The Scarlet Letter\" is a poignant drama starring Lillian Gish, Lars Hanson, Henry B. Walthall, Karl Dane, Marcelle Corday and others.     In 17th century Boston a woman is ostracized for having a child out of wedlock, which also brings the downfall of the child's father, a minister.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 103902845,
      "addedAt": "2026-01-07T00:09:54.334Z",
      "thumbnail": "https://archive.org/services/img/my-movie_202210",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 5199
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-scarlet-letter_1927",
      "id": "the-scarlet-letter_1927",
      "title": "The Scarlet Letter",
      "fileSize": 1975765333,
      "addedAt": "2026-01-07T00:12:22.158Z",
      "thumbnail": "https://archive.org/services/img/the-scarlet-letter_1927",
      "language": "English",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 2426
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "115 min",
    "imdbRating": 7.6,
    "imdbVotes": 1914,
    "Genre": "Drama",
    "Plot": "In Puritan Boston, seamstress Hester Prynne is punished for playing on the Sabbath day; but kindly minister Arthur Dimmesdale takes pity on her. The two fall in love, but their relationship cannot be: Hester is already married to Roger Prynne, a physician who has been missing seven years. Dimmesdale has to go away to England; when he returns, he finds Hester pregnant with their child, and the focus of the town's censure. In a humiliating public ceremony, she is forced to don the scarlet letter A - for adultery - and wear it the rest of her life. Dimmesdale is encouraged by the church fathers to demand of Hester the person with whom she sinned.",
    "Director": "Victor Sjöström",
    "Writer": "Nathaniel Hawthorne, Frances Marion",
    "Actors": "Lillian Gish, Lars Hanson, Henry B. Walthall",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019585",
    "tt0018836",
    "tt0014972",
    "tt0014014",
    "tt0021044",
    "tt0008663",
    "tt0003014",
    "tt0008879",
    "tt0012364",
    "tt0011362",
    "tt0017632",
    "tt0017735"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.158Z"
}