{
  "imdbId": "tt0001660",
  "title": "Her Crowning Glory",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-her-crowning-glory",
      "id": "silent-her-crowning-glory",
      "title": "Her Crowning Glory",
      "fileSize": 410585509,
      "addedAt": "2026-01-07T00:10:59.119Z",
      "thumbnail": "https://archive.org/services/img/silent-her-crowning-glory",
      "language": "English",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 306
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "14 min",
    "imdbRating": 5.6,
    "imdbVotes": 219,
    "Genre": "Comedy, Short",
    "Plot": "Helen, the daughter of Mr. Bunny, a wealthy widower is a mischievous child, as well as a spoiled one. She comprises the whole family and makes her father her willing and happy slave. Mr. Bunny decides to engage a governess Helen, and for her advent is the signal for rebellion on the part of the child, who does not hesitate to show it by slapping and striking the governess whenever she gets the chance. Mr. Bunny is smitten with the governess, who possesses a luxuriant head of hair and a face that is a shame to speak of. He seems to be fascinated by them and finally asks her to become his wife. Little Helen observes her father's attentions to the governess. Helen's nurse does not think any more of Mr. Bunny's choice than little Helen. \"She puts Helen up to clip the radiant locks of the governess sleeping in the chair by the window where she is drying her hair after giving it a shampoo. Helen does the job with neatness and dispatch. When the governess is awakened by a kiss from Mr. Bunny and discovers the loss of her crowning glory she is a sight, which turns the love of her employer to ridicule. He tells her that she can consider herself dismissed not only from his heart but from his home. She makes a hasty exodus and the home of Bunny runs on with the same tranquility as it did before it was disturbed by the lady with the \"Godiva\" tresses.",
    "Director": "Laurence Trimble",
    "Writer": "N/A",
    "Actors": "John Bunny, Flora Finch, Helene Costello",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002124",
    "tt0258254",
    "tt0259262",
    "tt0001941",
    "tt0368394",
    "tt0001062",
    "tt1247273",
    "tt0002610",
    "tt0493625",
    "tt0460831",
    "tt0001762",
    "tt0233368"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}