{
  "movieId": "tt0047507",
  "title": "The Snow Creature",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheSnowCreature",
      "id": "TheSnowCreature",
      "title": "The Snow Creature",
      "description": "A Himalayan expedition comes across a mountain being, manages to capture it, then transports it back to the United States. You can find more information regarding this film on its IMDb page . In addition to the formats listed to the left, this film is available as: Theora video, Vorbis audio, OGM container, 320x240 at 29.97fps ( click here , 190 MB) Theora video, Vorbis audio, Matroska container, 320x240 at 29.97fps ( click here , 190 MB)",
      "fileSize": 3289002374,
      "addedAt": "2026-01-07T00:07:05.036Z",
      "thumbnail": "https://archive.org/services/img/TheSnowCreature",
      "language": "English",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 102629
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mlKnq-3ICYs",
      "id": "mlKnq-3ICYs",
      "title": "The Snow Creature (1954) [Horror] [Science Fiction]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | The movie has two acts, the first taking place in the exotic locale of the Himalayas and the second occurring in Los Angeles, California. While the first act takes place in an undisclosed Himalayan country (presumably bordering India) the actors portraying the locals speak Japanese. The movie starts with a scientific expedition intent on collecting botanical samples, led by Dr. Frank Parrish (Paul Langton) and encounters difficulties when the wife of the expedition's chief guide is kidnapped. The guide, a sherpa named Subra (played by Teru Shimada), seizes the expedition's guns and takes control of the team when he is unable to convince Parrish to pursue the Yeti and save his wife. Parrish, a man of science, is skeptical of the Yeti's existence, put is forced to participate in Subra's march. Along with his fellow westerner (a photographer named Peter Wells, played by Leslie Denison), Parrish awaits his opportunity to overthrow the renegade sherpa. However, as the team draws closer to the Yeti, evidence emerges that begins to change Parrish's opinion regarding the creature's existence (such as the tell-tale \"giant footprints\"). Finally, the team makes contact with the snow creature, who hurls stones at them from atop his mountain refuge. \n\nThe expedition tracks the creature to his cave, where they encounter the creature, along with two other Yeti's - a female and young one. The team also discover Subra's wife, who is guarded jealously by the snow creature. Parrish forcibly prevents the enraged Subra from shooting the Yeti, reasoning that the creature is more valuable for science alive. This delays the capture long enough to enable the creature to create a cave-in (presumably to keep his family safe from the humans). However, the cave-in works against the Yeti, killing the female and young Yetis and knocking the snow creature himself unconscious. The cave-in also enables Parrish and Wells to take control of the sherpa's guns. Having regained control over the expedition, and successfully capturing a live Yeti, Parrish declares that he is intent upon bringing the creature to the U.S. where it will be studied. \n\nThe Yeti is eventually sedated and placed in a telephone booth-sized freezer. Trapped inside this icebox, the Yeti is transported to Bombay to be flown to California. In an odd geographic twist, the return flight heads west from India to California (via TWA) -- beginning the second act. Upon reaching Los Angeles, Parrish is greeted by reporters who have been made aware of the creature's existence. A U.S. Customs official informs Parrish that the admission of this creature to the U.S. has been made difficult by a newspaper article published by Peter Wells that refers to the creature using the term \"man\". The issue is raised whether the snow-creature is actually human and the officials decide to keep the creature in quarantine until an anthropologist can determine the question of the creature's humanity. It is during this delay at the airport's customs station that the snow creature manages to escape the ice box (which was apparently meant to confine him temporarily only). The snow creature roams the city, terrorizing a woman and finding refuge in the cool temperature of the city's sewers as well as meat-lockers (where it can also feed). \n\nThe police, aided by Parrish, manage to track the Yeti through the sewer system and, where the creature is caught in a roap mesh and grabbed by 5 men. As the creature resists it starts to choke one of the men through the mesh. One of the men shoots the creature once who then stops choking the man. There's a pause after the choked man had been released and then the man with the gun decides to shoot the rare creature with two more slugs just for good measure. Thus, one of the greatest finds of all time is dead.\n\n---\n\nDirected and produced by W. Lee Wilder, written by Myles Wilder, Paul Langton as Frank Parrish, Leslie Denison as Peter Wells, Taru Shimada as Subra, Rollin Moriyana as Leva\nand Robert Kino as Inspector Karma.\n\n---\n\nSource: \"The Snow Creature\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 23 March 2013. Web. 12 June 2013. http://en.wikipedia.org/wiki/The_Snow_Creature.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:20.749Z",
      "thumbnail": "https://i.ytimg.com/vi/mlKnq-3ICYs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBwUwLmNvgYv1dDx6Fj2YuaUaDO0A",
      "duration": 4247,
      "language": "en",
      "year": 1954,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-snow-creature-1954",
      "id": "the-snow-creature-1954",
      "title": "The Snow Creature (1954)",
      "description": "A botanical expedition to the Himalayas captures a Yeti and brings it back alive to Los Angeles, where it escapes and runs amok, seeking food. Watch on RetroFlix:  https://retroflix.org/the-snow-creature-1954/",
      "fileSize": 416943528,
      "addedAt": "2026-01-07T00:12:22.159Z",
      "thumbnail": "https://archive.org/services/img/the-snow-creature-1954",
      "language": "eng",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 192
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XPDYTHyvyQQ",
      "id": "XPDYTHyvyQQ",
      "title": "The Snow Creature (1954) W. LEE WILDER",
      "description": "Stars: Paul Langton, Leslie Denison, Teru Shimada\n Director: W. Lee Wilder\n\n American botanical expedition in the Himalayas stumbles across a Yeti den, capture one and transport it back to Los Angeles, where it escapes while customs officials are debating whether it is animal or human.",
      "addedAt": "2025-12-26T23:52:34.135Z",
      "thumbnail": "https://i.ytimg.com/vi/XPDYTHyvyQQ/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB7gSAAuADigIMCAAQARhrIGsoazAP&rs=AOn4CLDlLlCdc1NRu46eMhCNpOUcyMzFvA",
      "duration": 4246,
      "language": "en",
      "year": 1954,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T9heyciY21Y",
      "id": "T9heyciY21Y",
      "title": "The Snow Creature (1954) Horror, Sci-Fi Full Length Cult Monster Movie",
      "description": "American botanical expedition in the Himalayas stumbles across a Yeti den, capture one and transport it back to Los Angeles, where it escapes while customs officials are debating whether it is animal or human.\n\nDirector: W. Lee Wilder\nWriter: Myles Wilder\nStars: Paul Langton, Leslie Denison, Teru Shimada -\nGenre: Classics, Cult Film, Monster Movie, Horror, Science Fiction & Fantasy\n\nFollow us on social media :\nhttps://www.facebook.com/CultCinemaClassics\nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:52:00.298Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/T9heyciY21Y/maxresdefault.webp?v=62c5a096",
      "duration": 4247,
      "language": "en",
      "year": 1954,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "69 min",
    "imdbRating": 3.2,
    "imdbVotes": 1245,
    "Genre": "Horror, Sci-Fi",
    "Plot": "Botanist Frank Parrish leads an expedition to the Himalayas to seek out new flora, accompanied by hardboiled news photographer Peter Wells. When their lead guide, Subra, learns his wife has been kidnapped by a Yeti, Parrish disbelieves him, so the sherpas commandeer the expedition at gunpoint and turn it into a search-and-rescue party. To Parrish's surprise, they discover a whole family of Yetis in a cave, and are able to subdue the male and carry it back to civilization, to ship to the USA for study. Subra is forgiven his acts because he was right after all. Wells, meanwhile, phones in the story and Parrish finds his discovery - shipped upright in a meat cooler to maintain its natural environment - detained in the US because Wells' story refers to it as a snowMAN, and a decision must be made whether this is a customs or immigration matter. During this bureaucratic snafu, the creature escapes its containers and disappears into Los Angeles, mysteriously appearing in different parts of the city. Parrish teams up with police Lt. Dunbar to find the creature, which kills anyone who stands in his way...",
    "Director": "W. Lee Wilder",
    "Writer": "Myles Wilder",
    "Actors": "Paul Langton, Leslie Denison, Teru Shimada",
    "Language": "English, Japanese",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0047149",
    "tt0046186",
    "tt0049234",
    "tt0046907",
    "tt0046876",
    "tt0046802",
    "tt0047573",
    "tt0047244",
    "tt0047034",
    "tt0046066",
    "tt0048127",
    "tt0048215"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.159Z"
}