{
  "imdbId": "tt0014509",
  "title": "Der steinerne Reiter",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-der-steinerne-reiter",
      "id": "silent-der-steinerne-reiter",
      "title": "Der steinerne Reiter",
      "fileSize": 1008239868,
      "addedAt": "2026-01-07T00:10:59.116Z",
      "thumbnail": "https://archive.org/services/img/silent-der-steinerne-reiter",
      "language": "German",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 778
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "86 min",
    "imdbRating": 6.6,
    "imdbVotes": 98,
    "Genre": "Drama, Fantasy, Horror",
    "Plot": "In a distant Teutonic village, people dance and drink merrily celebrating a wedding feast. However, an elderly man tells the villagers that the valley where they live wasn't always happy but sorrowful. This was due to the tyranny of the master of the mountains ( Herr Rudolf Klein-Rogge as wild as his hairdo ) who ruled the valley despotically.He lived in a Schloss up the mountains, whipped his servants for any reason (Sound familiar?) and when a wedding was going to be celebrated, he descended into the valley asking for his \"droit de seigneur\".During one such encounter, a young bride is accidentally killed by the groom who was trying to protect her from the claws of the master of the mountains. The girl's sister vows revenge and journeys to the Schloss with the intention of killing the tyrant.It is very strange that this remarkable film, \"Der Steinerne Reiter\", directed by Herr Fritz Wendhausen, has not received the attention its many merits deserve, especially considering its Expressionist touches.Outstanding are the settings included in this film, particularly the gloomy Schloss carved out of the mountains contrasting with the idyllic village that lies below. The sense of constant menace is pervasive, exemplified by the superb shot when the master of the mountains approaches the village and his shadow as a rider darkens the town. And of course there are quaint customs to observe( presumed typical but at the same time extravagant, perfect for Expressionism mode ), and there's a fantastic and supernatural ending which fits the pitch dark mood perfectly, all put together in a script by the well known Dame Thea von Harbou Another interesting aspect of the story is a twist in the middle of the oeuvre; the master is redeemed by love but his serfs turn cruel when they take justice into their own hands blurring the thin line between good and evil.And now, if you'll allow me, I must temporarily take my leave because this German Count must complain to his imitator, the master of the mountains, about copyright infringement.Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com/",
    "Director": "Fritz Wendhausen",
    "Writer": "Fritz Wendhausen, Thea von Harbou",
    "Actors": "Rudolf Klein-Rogge, Lucie Mannheim, Gustav von Wangenheim",
    "Language": "None, German",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0012364",
    "tt0016847",
    "tt0017103",
    "tt0013442",
    "tt2784936",
    "tt14292086",
    "tt0062453",
    "tt0018770",
    "tt0014249",
    "tt0054807",
    "tt0014142",
    "tt0037635"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.116Z"
}