{
  "movieId": "tt0001753",
  "title": "Love in the Hills",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewLoveInTheHills",
      "id": "PreviewLoveInTheHills",
      "title": "\"Love In The Hills\" (1911) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Love in the Hills\" is a short drama. The film is included in our program to illustrate the work of   Billy Bitzer, a star of Silent Hall of Fame.  A mountain beauty falls for a city slicker and intends to elope. One of her local suitors tries to prevent that. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Blanche Sweet, Wilfred Lucas, Charles West, Joseph Graybill Distributed by                   Biograph Company Release date                      October 30, 1911 Country                             United States Running time                    13 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 15635606,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewLoveInTheHills",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 6811
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "18 min",
    "imdbRating": 6,
    "imdbVotes": 18,
    "Genre": "Short, Drama",
    "Plot": "The old soldier's little daughter has two persistent suitors. One, a manly fellow, who tells the girl she will marry him in spite of all. Her other suitor is a good-natured, shiftless chap, whose weaknesses are booze and music, he being the village fiddler. He tries to get the lead on his neighbor by presenting her with a mammoth pumpkin. He thinks this little attention should win her, but she has met and become interested in a young stranger from the big city, who is hunting and fishing in these hills. The fiddler, despairing, plays soulfully on his violin, thinking the strains may soften her heart. They do, but for the other fellow, with whom she consents to elope. Her manly friend prevents this, however, by driving the city fellow away. The girl realizes the error of her intentions and accepts her mountain knight, just as the fiddler arrives to renew his suit, aided by the pumpkin. He might have exclaimed, \"Well, I'll be darned,\" but he simply ejaculates, \"Oh! Pumpkins!\"",
    "Director": "D.W. Griffith",
    "Writer": "Dell Henderson",
    "Actors": "Blanche Sweet, Wilfred Lucas, Charles West",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001499",
    "tt0001741",
    "tt0002550",
    "tt0002190",
    "tt0001987",
    "tt0001593",
    "tt0001615",
    "tt0001701",
    "tt0001949",
    "tt0001978",
    "tt0001913",
    "tt0001789"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}