{
  "imdbId": "tt0042912",
  "title": "Rustlers on Horseback",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rohb45458874",
      "id": "rohb45458874",
      "title": "Rustlers on Horseback",
      "description": "Title: Rustlers on Horseback Summary: The people around the town of Sloan Junction think that George Parradine is just a harmless book salesman, but he heads a gang of crooks planning to rob and pillage on a large scale. Their ... Directed by: Fred C. Brannon Actors: Production Company: Republic Pictures (I) Release Date: 23 October 1950 (USA) Aspect Ratio: 1.37 : 1 The people around the town of Sloan Junction think that George Parradine is just a harmless book salesman, but he heads a gang of crooks planning to rob and pillage on a large scale. Their base of operations is the Reynolds ranch acquired by Parradine's front man, Leo Straykin, after killing the former owner. Needing money to finance their plan, they have rigged a scheme to cheat easterner Josh Taylor out of the $125,000 he is carrying to invest in the Reynolds ranch for a large group of people who want to settle there. To help check the titles and boundaries, Taylor has brought along a lawyer, Kenneth Jordan, and a surveyor, Johnny Bennett, who is really Jack Reynolds, the son of the former owner who is trying to find out who murdered his father. Circumstances permit undercover Marshal Rocky Lane to join the outlaw gang as a gunman, and with him is his sidekick, Nugget Clark, an itinerant patient medicine peddler. Rocky is working to uncover the identity of the head man, and his ...",
      "fileSize": 557641980,
      "addedAt": "2026-01-07T00:10:40.949Z",
      "thumbnail": "https://archive.org/services/img/rohb45458874",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 994
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "60 min",
    "imdbRating": 6.5,
    "imdbVotes": 99,
    "Genre": "Drama, Western",
    "Plot": "The people around the town of Sloan Junction think that George Parradine is just a harmless book salesman, but he heads a gang of crooks planning to rob and pillage on a large scale. Their base of operations is the Reynolds ranch acquired by Parradine's front man, Leo Straykin, after killing the former owner. Needing money to finance their plan, they have rigged a scheme to cheat easterner Josh Taylor out of the $125,000 he is carrying to invest in the Reynolds ranch for a large group of people who want to settle there. To help check the titles and boundaries, Taylor has brought along a lawyer, Kenneth Jordan, and a surveyor, Johnny Bennett, who is really Jack Reynolds, the son of the former owner who is trying to find out who murdered his father. Circumstances permit undercover Marshal Rocky Lane to join the outlaw gang as a gunman, and with him is his sidekick, Nugget Clark, an itinerant patient medicine peddler. Rocky is working to uncover the identity of the head man, and his efforts are hampered when Jack Reynolds tries to kill Straykin from ambush.",
    "Director": "Fred C. Brannon",
    "Writer": "Richard Wormser",
    "Actors": "Allan Lane, Black Jack, Eddy Waller",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043853",
    "tt0042232",
    "tt0042383",
    "tt0043013",
    "tt0042313",
    "tt0042286",
    "tt0042224",
    "tt0042506",
    "tt0043017",
    "tt0043137",
    "tt0042576",
    "tt0042356"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.949Z"
}