{
  "movieId": "tt0032599",
  "title": "His Girl Friday",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his_girl_friday",
      "id": "his_girl_friday",
      "title": "His Girl Friday",
      "description": "Hilarious romantic comedy starring Cary Grant and Rosalind Russell. Russell is rough and tumble reporter looking to get out of the news racket by marrying and becoming a house wife after her divorce from newspaper publisher Grant. Just when she is about to leave town with her husband-to-be the still lovesick Grant drafts her to cover one final breaking news sensation. Along with plenty of laughs and fast paced dialog this film provides a witty and cynical look at news business. There is a slight audio sync problem in the first couple minutes of the film. It is present on the source medium and is very brief.",
      "fileSize": 4727178228,
      "addedAt": "2026-01-07T00:08:46.612Z",
      "thumbnail": "https://archive.org/services/img/his_girl_friday",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 1283298
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/GirlFriday",
      "id": "GirlFriday",
      "title": "His Girl Friday",
      "description": "Title: His Girl Friday Summary: A newspaper editor uses every trick in the book to keep his ace reporter ex-wife from remarrying. Directed by: Howard Hawks Actors: Cary Grant, Rosalind Russell, Ralph Bellamy Production Company: Columbia Pictures Release Date: 18 January 1940 (USA) Aspect Ratio: 1.37 : 1 Having been away for four months, Hildy Johnson walks into the offices of the New York City based The Morning Post, where she is a star reporter, to tell her boss, editor Walter Burns, that she is quitting. The reason for her absence was among other things to get a Reno divorce, from, of all people, Walter, who admits he was a bad husband. Hildy divorced Walter largely because she wanted more of a home life, whereas Walter saw her more as a driven hard-boiled reporter than subservient homemaker. Hildy has also come to tell Walter that she is taking the afternoon train to Albany, where she will be getting married tomorrow to staid straight-laced insurance agent, Bruce Baldwin, with whose mother they will live, at least for the first year. Walter doesn't want to lose Hildy, either as a reporter or a wife, and if he does, doesn't believe Bruce is worthy of her. Walter does whatever he can at least to delay Hildy and Bruce's trip, long enough to persuade Hildy to stay for good. His plan ...",
      "fileSize": 486963785,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/GirlFriday",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 2900
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HisGirlFriday",
      "id": "HisGirlFriday",
      "title": "His Girl Friday",
      "description": "A newspaper editor uses every trick in the book to keep his ace reporter ex-wife from remarrying. - IMDB Description",
      "fileSize": 2100369899,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HisGirlFriday",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 50094
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HisGirlFriday1940",
      "id": "HisGirlFriday1940",
      "title": "HIS GIRL FRIDAY (1940)",
      "description": "hosted by The Cinemated Man Directed by Howard Hawks Written by Charles Lederer, Ben Hecht, Charles MacArthur Music by Sidney Cutner, Felix Mills Cinematography by Joseph Walker Editing by Gene Havlick Art Direction by Lionel Banks",
      "fileSize": 1564108924,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HisGirlFriday1940",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 13855
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HisGirlFriday1940_201505",
      "id": "HisGirlFriday1940_201505",
      "title": "His Girl Friday ( 1940)",
      "description": "A newspaper editor uses every trick in the book to keep his ace reporter ex-wife from remarrying.",
      "fileSize": 2245128002,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HisGirlFriday1940_201505",
      "language": "eng",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 30420
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his-girl-friday-1940_202310",
      "id": "his-girl-friday-1940_202310",
      "title": "His Girl Friday (1940)",
      "description": "Walter Burns is an irresistibly conniving newspaper publisher desperate to woo back his paper’s star reporter, who also happens to be his estranged wife. She’s threatening to quit and settle down with a new beau, but, as Walter knows, she has a weakness: she can’t resist a juicy scoop. Watch on RetroFlix:  https://retroflix.org/his-girl-friday-1940/",
      "fileSize": 577136138,
      "addedAt": "2026-01-07T00:08:39.346Z",
      "thumbnail": "https://archive.org/services/img/his-girl-friday-1940_202310",
      "language": "eng",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 382
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his-girl-friday-4-k",
      "id": "his-girl-friday-4-k",
      "title": "His Girl Friday (1940) [Colorized, 4K, 60FPS]",
      "description": "His Girl Friday is a 1940 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 7269385286,
      "addedAt": "2026-01-07T00:08:39.346Z",
      "thumbnail": "https://archive.org/services/img/his-girl-friday-4-k",
      "collection": "feature_films",
      "downloads": 447
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wEx-z1TYPKU",
      "id": "wEx-z1TYPKU",
      "title": "1940 - His Girl Friday - Cary Grant and Rosalind Russell - Ex-lovers become headline hunters",
      "description": "When hard-charging New York newspaper editor Walter Burns (Cary Grant) discovers that his ex-wife, investigative reporter Hildy Johnson, has gotten engaged to milquetoast insurance agent Bruce Baldwin, he unsuccessfully tries to lure her away from tame domestic life by promising her an exclusive interview with a death row convict, Earl Williams. But when Hildy discovers Williams may be innocent, her reporter instincts take over.\n\nColorized version: https://youtu.be/xa12Kur-NCI\n\nDirector: Howard Hawks\nWriters: Charles Lederer, Ben Hecht, Charles MacArthur\nStars: Cary Grant, Rosalind Russell, Ralph Bellamy\nGenres: Rom-Com, Drama, Comedy, Romance\nRelease Date: January 11, 1940 \nFilming Location: Hollywood\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-24T00:59:45.573Z",
      "thumbnail": "https://i.ytimg.com/vi/wEx-z1TYPKU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLACwOl5CjDXKJ-YMEowbU_Ai5ij5A",
      "duration": 5505,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=01ZJL0ZRC9U",
      "id": "01ZJL0ZRC9U",
      "title": "His Girl Friday (1940) CARY GRANT🍕 ROSALIND RUSSELL",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nDirector: Howard Hawks\nStars: Cary Grant, Rosalind Russell, Ralph Bellamy, John Qualen\nWriters: Charles Lederer, Ben Hecht, Charles MacArthur\n\nToday, from 1940, it's Howard Hawks’ timeless screwball comedy—a lightning-paced adaptation of The Front Page with a twist! The ever-charming Cary Grant shines as a sharp-tongued newspaper reporter who will do anything to land the story... and to win his ex-wife back, portrayed with wit and vigor by the dynamic Rosalind Russell.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "addedAt": "2025-12-24T01:04:34.756Z",
      "thumbnail": "https://i.ytimg.com/vi/01ZJL0ZRC9U/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDKD-1NkULzusQfj3fFQriZ847QTw",
      "duration": 5578,
      "language": "en",
      "year": 1940,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HisGirlFriday-1940",
      "id": "HisGirlFriday-1940",
      "title": "His Girl Friday - 1940",
      "description": "His Girl Friday is a 1940 American comedy film directed by Howard Hawks starring Cary Grant, Rosalind Russell and Ralph Bellamy. Walter Burns (Cary Grant) is a newspaper editor who learns his ex-wife is about to marry a bland insurance man and settle down to a quiet life. Walter determines to sabotage these plans and uses every trick in the book to keep his ex-wife from remarrying. This movie is public domain. Source: http://en.wikipedia.org/wiki/His_Girl_Friday http://www.archive.org/details/his_girl_friday This upload is better quality than the movie already posted on Internet Archive.",
      "fileSize": 1658094563,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HisGirlFriday-1940",
      "collection": "feature_films",
      "downloads": 142104
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "92 min",
    "imdbRating": 7.8,
    "imdbVotes": 67176,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Having been away for four months, Hildy Johnson walks into the offices of the New York City based The Morning Post, where she is a star reporter, to tell her boss, editor Walter Burns, that she is quitting. The reason for her absence was among other things to get a Reno divorce, from, of all people, Walter, who admits he was a bad husband. Hildy divorced Walter largely because she wanted more of a home life, whereas Walter saw her more as a driven hard-boiled reporter than subservient homemaker. Hildy has also come to tell Walter that she is taking the afternoon train to Albany, where she will be getting married tomorrow to staid straight-laced insurance agent, Bruce Baldwin, with whose mother they will live, at least for the first year. Walter doesn't want to lose Hildy, either as a reporter or a wife, and if he does, doesn't believe Bruce is worthy of her. Walter does whatever he can at least to delay Hildy and Bruce's trip, long enough to persuade Hildy to stay for good. His plan includes doing whatever he can to place Bruce in a bad light, while dangling a big story under her nose, namely covering what the newspaper believes is the unfair imminent execution of convicted cop killer, Earl Williams. Hildy doesn't trust Walter in dealing with her and Bruce in an above board manner, but the lure of what potentially may become the biggest story in years, which includes true love, a bumbling sheriff and a corrupt mayor, the latter's actions largely in light of an upcoming election, may prove to be too much for Hildy to resist, especially if it ends up being an exclusive. Regardless of the story outcome, Hildy will have to decide if the thrill of the chase was worth the anguish on her personal life.",
    "Director": "Howard Hawks",
    "Writer": "Charles Lederer, Ben Hecht, Charles MacArthur",
    "Actors": "Cary Grant, Rosalind Russell, Ralph Bellamy",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "5 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0032846",
    "tt0032428",
    "tt0041498",
    "tt0033038",
    "tt0033891",
    "tt0031282",
    "tt0031593",
    "tt0031602",
    "tt0032132",
    "tt0027286",
    "tt0030063",
    "tt0034976"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1940s",
      "name": "1940s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:08:01.803Z"
}