{
  "imdbId": "tt0033021",
  "title": "Santa Fe Trail",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Santa_Fe_Trail_movie",
      "title": "Santa Fe Trail",
      "description": "The year is 1854. Robert E. Lee is Superintendent of West Point, where J.E.B. Stuart (Errol Flynn) and George A. Custer (Ronald Reagan) are classmates. In the dormitory, one of the cadets (Van Heflin) reads aloud the secession-promoting pamphlets of abolitionist John Brown. At graduation, the address is given by Secretary of War Jefferson Davis. J.E.B. Stuart and Custer are assigned to the 2nd Cavalry in the Kansas territory, where they have to deal with John Brown. This copy has better video quality than the one already here in the archive. The mpeg2 file contains nav-packets, so you can load it into DVDAuthorGUI (a free program) and create a DVD to watch on your television. If you don't have burning software, I suggest ImgBurn (another free program).",
      "id": "Santa_Fe_Trail_movie"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SantaFeTrail1940",
      "title": "SantaFeTrail1940",
      "description": "J.E.B. Stuart (Errol Flynn) and Custer (Ronald Reagan) are assigned to the 2nd Cavalry in the Kansas territory. Once there they have to deal with John Brown before the Civil War. They both also fall for Kit Carson Holliday (Olivia de Havilland). Mystic Nights Videos",
      "id": "SantaFeTrail1940"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Santa_Fe_Trail",
      "title": "Santa Fe Trail",
      "description": "From Wikipedia: The film loosely follows the life of J.E.B. Stuart (Errol Flynn) before the outbreak of the American Civil War. Among its sub-plots include a romance with the fictional Kit Carson Holliday (Olivia de Havilland), friendship with George Armstrong Custer (Ronald Reagan), and battles against abolitionist John Brown (Raymond Massey). http://www.imdb.com/title/tt0033021/ http://en.wikipedia.org/wiki/Santa_Fe_Trail_(film)",
      "id": "Santa_Fe_Trail"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=drAimbehLWw",
      "title": "Santa Fe Trail (1940) | Colorized Public Domain Western Adventure with Errol Flynn and Ronald Reagan",
      "description": "Santa Fe Trail (1940) is an American Western adventure film directed by Michael Curtiz, starring Errol Flynn, Olivia de Havilland, Raymond Massey, and Ronald Reagan. This restored and colorized public domain edition revives one of the most famous pre-war Hollywood Westerns, dramatizing the turbulent years leading up to the American Civil War. Through digital colorization and restoration, Colorized Public Domain presents this historical drama in vivid detail, giving modern audiences in the United States, Europe, and worldwide a striking view of the conflict between duty, conscience, and national identity.\n\nPlot Summary:\nSet in the 1850s, the story follows a young cavalry officer, Jeb Stuart (Errol Flynn), who graduates from West Point alongside his friend George Custer (Ronald Reagan). Both men are assigned to duty in the Kansas territory, where tensions between abolitionists and pro-slavery settlers are turning violent. The two officers find themselves drawn into the conflict surrounding radical abolitionist John Brown (Raymond Massey), whose fiery campaign against slavery leads him toward his infamous raid on Harpers Ferry.\n\nAmid the chaos, Jeb meets Kit Carson Holliday (Olivia de Havilland), the spirited daughter of a railroad builder. As Stuart and Custer attempt to uphold the Union’s fragile peace, personal loyalties clash with moral convictions. The film climaxes in a dramatic confrontation that foreshadows the coming Civil War. With sweeping landscapes, cavalry charges, and moral debate, Santa Fe Trail captures the complex roots of America’s most defining conflict.\n\nCast and Crew:\n• Director: Michael Curtiz\n• Producer: Robert Fellows\n• Screenplay: Robert Buckner\n• Cinematography: Sol Polito\n• Editing: George Amy\n• Music: Heinz Roemheld\n\nStarring:\n• Errol Flynn as Jeb Stuart\n• Olivia de Havilland as Kit Carson Holliday\n• Raymond Massey as John Brown\n• Ronald Reagan as George Custer\n• Van Heflin as Carl Rader\n• Alan Hale as Tex Bell\n• Henry O’Neill as Cyrus K. Holliday\n• Guinn Williams as Bob Bradshaw\n• Moroni Olsen as Col. Robert E. Lee\n\nFilm Significance:\nSanta Fe Trail represents one of the great collaborations between director Michael Curtiz and Errol Flynn, whose partnership defined Warner Bros. adventure films of the 1930s and 1940s. Released at a time when global tensions were again rising toward war, the film offered audiences both historical spectacle and patriotic resonance. Its depiction of John Brown as a fanatical reformer reflects the complex way Hollywood approached social issues before and during World War II.\n\nOlivia de Havilland’s chemistry with Errol Flynn remains one of Hollywood’s legendary pairings, seen in classics like Captain Blood and The Adventures of Robin Hood. Meanwhile, Ronald Reagan’s role as Custer showcases his early charm before his later political career. The film’s cinematography, fast-paced editing, and Curtiz’s direction deliver a visually dynamic portrayal of moral struggle and national destiny.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Hoosier Schoolboy remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nOriginally released in 1940, Santa Fe Trail was shot in black and white, with striking use of shadows and contrast that reflected Curtiz’s European visual style. This colorized edition restores the vast plains, cavalry uniforms, and frontier settings to their full visual grandeur, enhancing depth and realism for modern high-definition screens. For audiences in the United States and Europe, where historical and adventure genres continue to attract strong interest, this edition bridges the gap between classic Hollywood storytelling and contemporary viewing expectations.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#SantaFeTrail #ErrolFlynn #OliviaDeHavilland #RonaldReagan #RaymondMassey #MichaelCurtiz #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #1940sCinema #WesternClassic #CivilWarDrama #HistoricAdventure #FilmRestoration #ClassicCinema",
      "id": "drAimbehLWw",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4PHLvqr5vNM",
      "title": "Santa Fe Trail (1940) -  Ronald Reagan, Errol Flynn and Olivia de Havilland",
      "id": "4PHLvqr5vNM",
      "channelName": "Public Domain Movies - Classic Old Movies",
      "channelId": "UCT6gOjzXtqeb_oE-wZVHlFA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/santa-fe-trail-1940",
      "title": "Santa Fe Trail (1940)",
      "description": "As a penalty for fighting fellow classmates days before graduating from West Point, J.E.B. Stuart, George Armstrong Custer and four friends are assigned to the 2nd Cavalry, stationed at Fort Leavenworth. While there they aid in the capture and execution of the abolitionist, John Brown following the Battle of Harper's Ferry. Watch on RetroFlix:  https://retroflix.org/santa-fe-trail-1940/",
      "id": "santa-fe-trail-1940"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/santa-fe-trail-4-k",
      "title": "Santa Fe Trail (1940) [Colorized, 4k, 60fps]",
      "description": "Santa Fe Trail is a 1940 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "santa-fe-trail-4-k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gbDmrI9kjxs",
      "title": "Santa Fe Trail (1940) ERROL FLYNN",
      "description": "Movie Class by PizzaFLIX: This was the 2nd movie in Oscar-winner Michael Curtiz's Western trilogy starring Errol Fynn, which also included DODGE CITY (1939) and VIRGINIA CITY (1940).\n\nStars: Errol Flynn, Olivia de Havilland, Ronald Reagan, Raymond Massey \nDirector: Michael Curtiz\n\nThe story of Jeb Stuart, his romance with Kit Carson Holliday, friendship with George Custer, and his battles against abolitionist John Brown in the days leading to the outbreak of the American Civil War. The outstanding supporting cast includes Alan Hale Sr., William Lundigan, Van Heflin, and\nGuinn \"Big Boy\" Williams!",
      "id": "gbDmrI9kjxs",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6Sw8Z787U3A",
      "title": "Santa Fe Trail (1940) Errol Flynn, Ronald Regan, Olivia de Havilland | War, Western",
      "description": "America's Pioneer Heroes Come To Life !\nIn 1854, Jeb Stuart, George Custer and other graduates from West Point are posted to Kansas to help pacify the territory before railroad construction to Santa Fe can resume. \n\nWatch the colorized copy: https://youtu.be/9F-Y_yEy-eE\nDirector: Michael Curtiz \nWriter: Robert Buckner\nActors: Errol Flynn, Olivia de Havilland, Raymond Massey, Ronald Reagan\nCostumes: Edith Head\nGenre:  Classics, Adventure, Biography, Drama, History, Romance, War, Western  \nBudget: $1,000,000\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "6Sw8Z787U3A",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "110 min",
    "imdbRating": "6.2",
    "imdbVotes": "4,478",
    "Genre": "Drama, War, Western",
    "Plot": "The story of Jeb Stuart, his romance with Kit Carson Holliday, friendship with George Custer and battles against John Brown in the days leading up to the outbreak of the American Civil War.",
    "Director": "Michael Curtiz",
    "Writer": "Robert Buckner",
    "Actors": "Errol Flynn, Olivia de Havilland, Raymond Massey",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0052097",
      "title": "The Proud Rebel",
      "year": 1958,
      "imdbRating": "6.9",
      "imdbVotes": "2,395",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035425",
      "title": "Texas to Bataan",
      "year": 1942,
      "imdbRating": "5.3",
      "imdbVotes": "106",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034162",
      "title": "The Sea Wolf",
      "year": 1941,
      "imdbRating": "7.5",
      "imdbVotes": "4,568",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031953",
      "title": "Sons of Liberty",
      "year": 1939,
      "imdbRating": "5.8",
      "imdbVotes": "403",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0135805",
      "title": "Billy the Kid's Gun Justice",
      "year": 1940,
      "imdbRating": "6.0",
      "imdbVotes": "117",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032670",
      "title": "Kit Carson",
      "year": 1940,
      "imdbRating": "6.3",
      "imdbVotes": "694",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032959",
      "title": "Queen of the Yukon",
      "year": 1940,
      "imdbRating": "5.9",
      "imdbVotes": "91",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033132",
      "title": "Take Me Back to Oklahoma",
      "year": 1940,
      "imdbRating": "5.8",
      "imdbVotes": "106",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032706",
      "title": "The Light of Western Stars",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "199",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032972",
      "title": "The Ranger and the Lady",
      "year": 1940,
      "imdbRating": "5.9",
      "imdbVotes": "141",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033047",
      "title": "The Showdown",
      "year": 1940,
      "imdbRating": "6.4",
      "imdbVotes": "191",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033287",
      "title": "Young Buffalo Bill",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "188",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:59:42.230Z"
}