{
  "movieId": "tt0044125",
  "title": "Three Guys Named Mike",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThreeGuysNamedMike1951",
      "id": "ThreeGuysNamedMike1951",
      "title": "Three Guys Named Mike (1951)",
      "description": "A stewardess becomes romantically involved with an airline pilot, a college professor, and a successful businessman, all of whom are named Mike. When the three find out about each other, she has to decide which one she loves the most. Mystic Nights Videos",
      "fileSize": 2314701448,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/ThreeGuysNamedMike1951",
      "collection": "feature_films",
      "downloads": 49016
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LInMr6nf3-M",
      "id": "LInMr6nf3-M",
      "title": "Three Guys Named Mike (1951) | Colorized Public Domain Romantic Comedy with Jane Wyman & Van Johnson",
      "description": "Three Guys Named Mike (1951) is an American romantic comedy directed by Charles Walters and released by Metro-Goldwyn-Mayer. This colorized and restored version of the public domain film brings fresh life to a charming postwar comedy that reflects the optimism, humor, and romance of 1950s American cinema. Starring Academy Award-winning actress Jane Wyman alongside Van Johnson, Howard Keel, and Barry Sullivan, the film captures the spirit of the early jet age while telling a lighthearted story of love, career, and independence. With this restored edition, modern audiences in the United States, Europe, and beyond can rediscover a delightful Golden Age Hollywood film that still entertains more than seventy years later.\n\nPlot Summary:\nThe story follows Marcy Lewis (Jane Wyman), a bright and ambitious young woman who dreams of adventure and independence. She secures a job as a stewardess for American Airlines, where she quickly proves her charm, intelligence, and professionalism. On her journey through both career and love, Marcy meets three very different men who all happen to share the same first name — Mike.\n\nThe first is Mike Lawrence (Barry Sullivan), a steady and dependable businessman whose practicality appeals to Marcy’s sense of security. The second is Mike Jamison (Howard Keel), a charismatic pilot whose confidence and adventurous nature spark Marcy’s sense of excitement. The third is Mike Tracy (Van Johnson), a warmhearted graduate student whose optimism and sincerity win her friendship and affection.\n\nAs Marcy navigates her career and personal life, the film playfully explores her romantic entanglements with these three suitors. Each man represents a different path — stability, excitement, or companionship — and Marcy’s challenge is to discover what she truly wants for her future. The comedic tension builds as the three Mikes unknowingly compete for her attention, leading to humorous misunderstandings, heartfelt moments, and a resolution that balances romance with Marcy’s independence.\n\nCast and Crew:\n• Director: Charles Walters\n• Producer: Armand Deutsch\n• Screenplay: Sidney Sheldon, based on a story by Ruth Brooks Flippen\n• Cinematography: Paul Vogel\n• Editing: Cotton Warburton\n\nStarring:\n• Jane Wyman as Marcy Lewis\n• Van Johnson as Mike Tracy\n• Howard Keel as Mike Jamison\n• Barry Sullivan as Mike Lawrence\n• Phyllis Kirk as Pat\n• Jeff Donnell as Nancy\n• Paula Raymond as Jane\n• Keenan Wynn as Hank\n\nFilm Significance:\nThree Guys Named Mike is notable as one of the lighter romantic comedies of postwar America, reflecting the cultural fascination with aviation, glamour, and women’s growing independence in the workforce. Jane Wyman, already an Academy Award-winning actress by this time, leads the ensemble with charm and comedic timing. The film also highlights MGM’s focus on polished, star-driven productions of the early 1950s. While not among MGM’s most famous works, it remains an important cultural artifact, offering modern audiences insight into the romantic ideals, humor, and gender dynamics of the era. Its combination of romance, comedy, and aviation-themed spectacle makes it a unique entry in Hollywood’s romantic comedy tradition.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Three Guys Named Mike remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1951 release was in black and white, typical of many MGM productions of the time. While historically authentic, many modern viewers skip over older black-and-white comedies. By offering a colorized edition, we make this lighthearted romantic comedy more visually appealing and accessible to today’s audiences while preserving its original charm and humor.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#ThreeGuysNamedMike #JaneWyman #VanJohnson #HowardKeel #BarrySullivan #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #1950sCinema #RomanticComedy #FilmRestoration",
      "addedAt": "2025-12-24T00:47:56.962Z",
      "thumbnail": "https://i.ytimg.com/vi/LInMr6nf3-M/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBlKGUwDw==&rs=AOn4CLB2UAL5pF5eRNxUsuZ1ptL-7obo8A",
      "duration": 5332,
      "language": "en",
      "year": 1951,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wuyZu6fi14s",
      "id": "wuyZu6fi14s",
      "title": "Three Guys Named Mike (1951) JANE WYMAN",
      "description": "Stars: Jane Wyman, Van Johnson, Howard Keel, Barry Sullivan\nDirector: Charles Walters\nScreenplay: Sidney Sheldon\n\nIn this screwball comedy, a career-minded stewardess working her way to the top of American Airlines, romances three men all named Mike.",
      "addedAt": "2025-12-26T23:44:42.706Z",
      "thumbnail": "https://i.ytimg.com/vi/wuyZu6fi14s/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLB6zcZEeO5gyJiGn0LCtizMqugiHg",
      "duration": 5421,
      "language": "en",
      "year": 1951,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 6.2,
    "imdbVotes": 883,
    "Genre": "Comedy, Romance",
    "Plot": "A stewardess becomes romantically involved with an airline pilot, a college professor and a successful businessman, all of whom are named Mike. After the three find out about each other, she has to decide which one she loves the most - but it won't be easy.",
    "Director": "Charles Walters",
    "Writer": "Sidney Sheldon, Ruth Brooks Flippen, Ethel Wells",
    "Actors": "Jane Wyman, Van Johnson, Howard Keel",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0043983",
    "tt0043651",
    "tt0043721",
    "tt0043313",
    "tt0043526",
    "tt0043618",
    "tt0178749",
    "tt0125761",
    "tt0042325",
    "tt0042182",
    "tt0043127",
    "tt0043700"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.886Z"
}