{
  "movieId": "tt0024059",
  "title": "Gigolettes of Paris",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/GigolettesOfParis",
      "id": "GigolettesOfParis",
      "title": "Gigolettes of Paris",
      "description": "A low-budget, pre-code romantic drama about young ladies on the loose in Paris. Directed by Alphonse Martell. Released in 1933. a.k.a. \"Tarnished Youth\" (UK). 2 minutes are missing.",
      "fileSize": 841822273,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/GigolettesOfParis",
      "collection": "feature_films",
      "downloads": 10432
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "64 min",
    "imdbRating": 5.6,
    "imdbVotes": 76,
    "Genre": "Drama, Romance",
    "Plot": "Suzanne Ricord works at an upscale perfume store where women compete to sell from their scent counter. After Suzanne sells a few perfume bottles to a flirtatious wealthy man named Albert, they end up in an intimate relationship and engaged. She's living the good life and very happy when he decides to take his ring back, telling her he got what he wanted from her and she doesn't know how to \"play the game.\" Now Suzanne has to start her life over from scratch, but she's not going back to the retail life. She's wise to these kinds of men, and she wants to use them back. Taking a job as a singer at an upscale nightclub, Suzanne sidelines as a gigolette as a team with Antoine, a gigolo, flirting with admiring patrons and getting them to buy expensive things for them. When Suzanne sees Albert at that club with his new wife wearing her old engagement ring, she's determined to take revenge, and she convinces Antoine to help her.",
    "Director": "Alphonse Martell",
    "Writer": "Mary Flannery, Alphonse Martell",
    "Actors": "Madge Bellamy, Gilbert Roland, Natalie Moorhead",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023742",
    "tt0023319",
    "tt0024300",
    "tt0023904",
    "tt0023955",
    "tt0024031",
    "tt0024151",
    "tt0024421",
    "tt0024436",
    "tt0024564",
    "tt0024628",
    "tt0024120"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}