{
  "imdbId": "tt0027514",
  "title": "Desert Phantom",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DesertPhantom",
      "id": "DesertPhantom",
      "title": "Desert Phantom",
      "description": "An entertaining western starring Johnny Mack Brown",
      "fileSize": 1744996982,
      "addedAt": "2026-01-07T00:06:19.369Z",
      "thumbnail": "https://archive.org/services/img/DesertPhantom",
      "collection": "feature_films",
      "downloads": 17551
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "60 min",
    "imdbRating": 5.8,
    "imdbVotes": 104,
    "Genre": "Western",
    "Plot": "In a remake of 1932's \"Night Rider\", which was later adapted into 1940's \"The Range Busters\", Arizona cowhand Billy Donovan comes to a Texas town and gives sharp-shooting exhibitions in his guise as an ammunition salesman for the Gigantic Shell Company, but is in reality searching for the killer of his brother-in-law who also caused the death of his sister. Bill meets Jean Halloran, who has received several notes signed by \"The Phantom\" ordering her to vacate the Double Bar-A ranch near an abandoned gold mine. The only other occupant on the ranch is Tom Jackson, her stepfather, who is a cripple, with both legs paralyzed. Billy also learns that Salazar, the town's most noted shot, is looking for him. Investigating the mine, Billy falls down the shaft, is knocked senseless but recovers and follows a figure through the mine who climbs up through a trap door. The trap door leads to Jackson's bedroom. He learns that Jackson is a sleep-walker who can walk when sleeping but is crippled when awake. Salizar kidnaps Jean but Billy rescues her and captures Salizar. They are met by Jim Day, who shows a deputy sheriff's badge and takes charge of Salizar. But, Day is actually \"The Phantom\", who is after the ranch in order to gain possession of the still-valuable mine, and he releases Salizar who heads for the ranch to get rid of Jean and Billy.",
    "Director": "S. Roy Luby",
    "Writer": "E.B. Mann, Earle Snell",
    "Actors": "Johnny Mack Brown, Sheila Bromley, Ted Adams",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0132909",
    "tt0028199",
    "tt0028649",
    "tt0127656",
    "tt0029473",
    "tt0026080",
    "tt0203825",
    "tt0029125",
    "tt0033251",
    "tt0033181",
    "tt0032971",
    "tt0034541"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.369Z"
}