{
  "imdbId": "tt0056606",
  "title": "Tower of London",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tower-of-london-1962_202510",
      "id": "tower-of-london-1962_202510",
      "title": "Tower of London (1962)",
      "description": "Tower of London is a 1962 historical drama and gothic horror film directed by Roger Corman and starring Vincent Price and Michael Pate. The film  follows Richard III, played by Vincent Price, as he schemes to seize the throne of England. The story depicts his ruthless rise to power, including the murder of his brother George and the manipulation of the young princes, all while being haunted by the ghosts of his victims, leading to his eventual madness and downfall.",
      "fileSize": 1887098747,
      "addedAt": "2026-01-07T00:12:44.285Z",
      "thumbnail": "https://archive.org/services/img/tower-of-london-1962_202510",
      "language": "eng",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 177
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "79 min",
    "imdbRating": 6.3,
    "imdbVotes": 2748,
    "Genre": "Drama, History, Horror",
    "Plot": "On the death of his brother King Edward IV, Richard of Gloucester conspires to get the throne for himself. The late King had two young sons, his heir, Edward V and the younger Prince Richard, but they are not of age and so names his other brother, Clarence as Lord Protector of the Realm. Gloucester soon kills his younger brother but is haunted by his ghost and what he has done. As he continues to kill those around him, Gloucester is haunted by those he has betrayed hearing voices and slowly descending into madness. He spreads rumors that the late King's two sons are illegitimate and therefore not eligible to ascend to the throne. He assassinates the young princes and is crowned King Richard III. The ghosts from his past have the final say however.",
    "Director": "Roger Corman",
    "Writer": "Leo Gordon, F. Amos Powell, Robert E. Kent",
    "Actors": "Vincent Price, Michael Pate, Joan Freeman",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0055304",
    "tt0053925",
    "tt0058333",
    "tt0059821",
    "tt0054017",
    "tt0057128",
    "tt0055019",
    "tt0054768",
    "tt0058700",
    "tt0054033",
    "tt0055478",
    "tt0054807"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}