{
  "movieId": "tt0007507",
  "title": "The Vagabond",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheVagabond1916",
      "id": "TheVagabond1916",
      "title": "Charlie Chaplin's \"The Vagabond\" (1916)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"The Vagabond\" is one of Charlie Chaplin's Mutual short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Lone Star Corporation Scenario by                Charlie Chaplin           Starring                     Charlie Chaplin, Edna Purviance, Eric Campbell Cinematography        Roland H. Totheroh and W.C. Foster Distributed by           Mutual Film Corporation Release date               July 10, 1916 Running time             26 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 332590473,
      "addedAt": "2026-01-07T00:07:05.037Z",
      "thumbnail": "https://archive.org/services/img/TheVagabond1916",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 16754
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-vagabond",
      "id": "silent-the-vagabond",
      "title": "The Vagabond",
      "fileSize": 2805213940,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-vagabond",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 986
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-vagabond-1916-directed-by-charlie-chaplin",
      "id": "the-vagabond-1916-directed-by-charlie-chaplin",
      "title": "The Vagabond (1916) Directed By Charlie Chaplin",
      "description": "Theatrical poster to The Vagabond Directed by Charlie Chaplin Edward Brewer (technical director) Written by Charlie Chaplin (scenario) Vincent Bryan (scenario) Maverick Terrell (scenario) Produced by Henry P. Caulfield Starring Charlie Chaplin Edna Purviance Eric Campbell Cinematography William C. Foster Roland Totheroh Edited by Charlie Chaplin Distributed by Mutual Film Corporation Release date July 10, 1916 Running time 24 minutes Country United States Language Silent The Vagabond is a 1916 American silent romantic comedy film by Charlie Chaplin and his third film with Mutual Films . Released to theaters on July 10, 1916, it co-starred Edna Purviance , Eric Campbell , Leo White and Lloyd Bacon . This film echoed Chaplin's work on The Tramp , with more drama and pathos mixed in with the comedy. Synopsis The story begins with Charlie, the Tramp, arriving at a bar, playing on a violin to raise money and exciting a rivalry with competing musicians. This results in a barroom brawl and comic mayhem. Wandering off into the vicinity of a gypsy caravan in the country, he encounters the beautiful, though bedraggled, Edna. He entertains her with his violin. She has been abducted and abused by the gypsies, chief among them Eric Campbell, who whips her mercilessly. Charlie comes to her rescue and knocks her tormentors over the head with a stick before riding off with her in a commandeered cart. Love develops between them as Charlie washes Edna's face in a bowl and combs her hair. He makes breakfast while she goes to fetch water. On the way Edna meets an artist who lacks inspiration. Edna is his muse and he paints her, including her unique shamrock-shaped birthmark. Edna falls for him and brings him back to the cart where the two talk, while Charlie is ignored. The artist leaves and she is stuck with Charlie. The resulting painting is seen by the girl's mother who recognizes the unusual birthmark and rushes with the artist to rescue her daughter. They find her with Charlie, who refuses payment from the mother and sadly says goodbye. Edna is driven off in a limousine with her mother, others, and the artist—only to realize she loves Charlie. She orders the car to reverse and take him along with her. [ 1 ] Reception Louis Reeves Harrison wrote in The Moving Picture World , \"The latter part of this story shows Chaplin in a new role, and he handles it well in spite of the necessity of being as funny as possible. He would make an interesting lead in almost any story if it were possible for him to divest himself of the little tricks which have made him famous. Those little tricks still go, and they pay, but it would be a novelty to see Chaplin free to do without them in some opportunity of a reverse, or much different, character.\" [ 2 ] The film was briefly discussed in Motion Picture Magazine , where it was described as \"Almost a comedy-drama, in which heart interest mixes well with broad farce. Edna Purviance, as the 'stolen child,' is an excellent support.\" [ 3 ] Cast Charlie Chaplin as Saloon Violinist Edna Purviance as Gypsy Drudge Eric Campbell as Gypsy Chieftain Leo White as Old Jew/Gypsy Woman Lloyd Bacon as Artist and Gypsy Charlotte Mineau as Girl's Mother Albert Austin as Trombonist John Rand as Trumpeter, Band Leader James T. Kelley as Gypsy and Musician Frank J. Coleman as Gypsy and Musician Phyllis Allen (uncredited) Henry Bergman (uncredited) Fred Goodwins Percussionist / Gypsy (uncredited) Sound version In 1932, Amedee Van Beuren of Van Beuren Studios, purchased Chaplin's Mutual comedies for $10,000 each, added music by Gene Rodemich and Winston Sharples and sound effects, and re-released them through RKO Radio Pictures . Chaplin had no legal recourse to stop the RKO release. [ 4 ] References 1 Simon Louvish (2009) Chaplin: The Tramp's Odyssey . London, Faber and Faber: 105-8; revised from Louvish based on the movie itself 2 \"Reviews of Current Productions\" . The Moving Picture World. July 29, 1916 . Retrieved June 5, 2020 . 3 \"Photoplay Reviews\" . Motion Picture Magazine. September 1916 . Retrieved June 5, 2020 . 4 SilentComedians entry Archived 2014-01-12 at the Wayback Machine",
      "fileSize": 656741677,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-vagabond-1916-directed-by-charlie-chaplin",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 246
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-vagabond-1916_202304",
      "id": "the-vagabond-1916_202304",
      "title": "The Vagabond (1916)",
      "description": "The Vagabond is a 1916 American silent romantic comedy film by Charlie Chaplin and his third film with Mutual Films. Released to theaters on July 10, 1916, it co-starred Edna Purviance, Eric Campbell, Leo White and Lloyd Bacon. This film echoed Chaplin’s work on The Tramp, with more drama and pathos mixed in with the comedy. Watch on RetroFlix.org:  https://retroflix.org/the-vagabond-1916/",
      "fileSize": 150940430,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-vagabond-1916_202304",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 311
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "24 min",
    "imdbRating": 6.8,
    "imdbVotes": 3287,
    "Genre": "Short, Comedy, Drama",
    "Plot": "After passing the hat and taking the donations intended for German street musicians Charlie heads for the country. Here he finds and rescues a girl from a band of gypsies. The girl falls in love with an artist whose portrait is later seen in a shop by the girl's real mother. The mother and the artist arrive in a chauffeured auto and offer Charlie money for his services, money which he rejects.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin, Vincent Bryan, Maverick Terrell",
    "Actors": "Charles Chaplin, Edna Purviance, Eric Campbell",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008133",
    "tt0009018",
    "tt0006414",
    "tt0006548",
    "tt0006689",
    "tt0007613",
    "tt0007832",
    "tt0007880",
    "tt0007194",
    "tt0006684",
    "tt0007264",
    "tt0004936"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}