{
  "movieId": "tt0041700",
  "title": "Not Wanted",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NotWanted4605",
      "id": "NotWanted4605",
      "title": "Not Wanted",
      "description": "Title: Not Wanted Summary: After a beautiful but unsophisticated girl is seduced by a worldly piano player and gives up her out-of-wedlock baby, her guilt compels her to kidnap another child. Directed by: Elmer Clifton, Ida Lupino Actors: Production Company: Emerald Productions Inc. Release Date: 24 June 1949 (USA) Aspect Ratio: 1.37 : 1 Twentyish Sally Kelton is unhappy at home and in the drab town in which she lives, until she meets roving musician Steve Ryan. Sally falls for Steve, but to Steve, she's just another fling before he heads to another town. Sally decides to \"pull up stakes\" and heads on a bus to Steve's next stop. On the road, she meets Drew Baxter, owner of a gaseteria in the town where she's heading. Drew sets Sally up with a room at a local boarding house and a job at his business. Try as he might, Drew can't win Sally's heart from Steve, who has remained indifferent to Sally since her arrival. When Steve heads off to South America, Sally is even more despondent--especially after she learns that she's pregnant with his child.",
      "fileSize": 671503614,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/NotWanted4605",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 2089
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/not-wanted-1949",
      "id": "not-wanted-1949",
      "title": "Not Wanted (1949)",
      "description": "Abandoned by her lover (Leo Penn), a woman (Sally Forrest) shuns a man (Keefe Brasselle) who'll marry her and enters a home for unwed mothers.",
      "fileSize": 1050215699,
      "addedAt": "2026-01-07T00:10:02.899Z",
      "thumbnail": "https://archive.org/services/img/not-wanted-1949",
      "collection": "feature_films",
      "downloads": 434
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/not-wanted-1949_202402",
      "id": "not-wanted-1949_202402",
      "title": "Not Wanted (1949)",
      "description": "After a beautiful but unsophisticated girl is seduced by a worldly piano player and gives up her out-of-wedlock baby, her guilt compels her to kidnap another child. Watch on RetroFlix:  https://retroflix.org/not-wanted-1949/",
      "fileSize": 1050214234,
      "addedAt": "2026-01-07T00:10:02.899Z",
      "thumbnail": "https://archive.org/services/img/not-wanted-1949_202402",
      "language": "eng",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 226
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qmlMWqRKokk",
      "id": "qmlMWqRKokk",
      "title": "Not Wanted (1949) SALLY FORREST",
      "description": "Movie Class by PizzaFLIX: Sally Forest (1928-2015) moved with her parents to Hollywood in 1945. She appeared mostly as a dancer in a few unaccredited roles, until she teamed with Ida Lupino. Producing her first film, Lupino cast Sally in the lead role of NOT WANTED (1949) and then again in YOUNG LOVERS (1950).\n\nDirector : Ida Lupino (uncredited), Elmer Clifton\nScreenplay: Ida Lupino, Paul Jarrico\nStars: Sally Forrest, Keefe Brasselle, Leo Penn\n\nIda Lupino's directorial debut! When a young woman (Sally Forrest) gives up her out-of-wedlock baby, her guilt compels her to kidnap another child. Watch for Sean Penn's father in the role of Steve.\n\nTRIVIA: Ida Lupino took over directing chores after Elmer Clifton suffered a heart attack just 3 days into filming.",
      "addedAt": "2025-12-26T23:43:29.290Z",
      "thumbnail": "https://i.ytimg.com/vi/qmlMWqRKokk/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDPyVsz6UzGT-aSG_Jpqhz2TFCLMw",
      "duration": 5458,
      "language": "en",
      "year": 1949,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "91 min",
    "imdbRating": 6.8,
    "imdbVotes": 975,
    "Genre": "Drama",
    "Plot": "Twentyish Sally Kelton is unhappy at home and in her drab hometown until she meets roving musician Steve Ryan. Sally falls for Steve to whom she's just another fling before he heads to another town. When he leaves, she gets on a bus and follows him to his next stop. On the road she meets Drew Baxter, owner of a gaseteria in the town that's her destination. Drew sets Sally up with a room at a local boardinghouse and a job at his business. Try as he might, Drew can't win Sally's heart from Steve, who has remained indifferent to her since her arrival. When Steve heads off to South America, Sally is even more despondent after she learns that she's pregnant by him.",
    "Director": "Elmer Clifton, Ida Lupino",
    "Writer": "Paul Jarrico, Ida Lupino, Malvin Wald",
    "Actors": "Sally Forrest, Keefe Brasselle, Leo Penn",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0042783",
    "tt0041503",
    "tt0041109",
    "tt0041125",
    "tt0041221",
    "tt0041239",
    "tt0041113",
    "tt0041268",
    "tt0041555",
    "tt0041761",
    "tt0040071",
    "tt0041269"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.899Z"
}