{
  "imdbId": "tt0047443",
  "title": "Salt of the Earth",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SaltOfTheEarth_735",
      "title": "Salt of the Earth",
      "description": "Title: Salt of the Earth Summary: Mexican workers at a Zinc mine call a general strike. It is only through the solidarity of the workers, and importantly the indomitable resolve of their wives, mothers and daughters, that they eventually triumph. Directed by: Herbert J. Biberman Actors: Production Company: Independent Productions Release Date: 14 March 1954 (USA) Aspect Ratio: 1.33 : 1 Based on an actual strike against the Empire Zinc Mine in New Mexico, the film deals with the prejudice against the Mexican-American workers, who struck to attain wage parity with Anglo workers in other mines and to be treated with dignity by the bosses. In the end, the greatest victory for the workers and their families is the realization that prejudice and poor treatment are conditions that are not always imposed by outside forces.",
      "id": "SaltOfTheEarth_735"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/clacinonl_SaltOfTheEarth",
      "title": "Salt Of The Earth",
      "id": "clacinonl_SaltOfTheEarth"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OTnNS82giUk",
      "title": "Salt of the Earth (1954) | Colorized Public Domain Classic Drama on Labor Rights and Social Justice",
      "description": "Salt of the Earth (1954) is an American independent drama film directed by Herbert J. Biberman, a member of the Hollywood Ten. This landmark movie was produced during the height of the Red Scare and became one of the most politically controversial films ever made in the United States. Blacklisted by Hollywood and suppressed upon its release, the film is now recognized as one of the most significant works of mid-century American cinema. Presented here in a restored and colorized version, it allows modern audiences in the United States, Europe, and beyond to revisit a story that speaks powerfully about class, dignity, and equality.\n\nPlot Summary:\nSet in the mining community of New Mexico, the film follows the struggles of Mexican-American zinc miners who are fighting for safer working conditions, fair pay, and respect on the job. At the heart of the story is Esperanza Quintero (Rosaura Revueltas), a miner’s wife who narrates the film and gradually becomes a leader within the community. While the miners initially take the lead in striking against the exploitative mine owners, the women eventually take a central role in sustaining the protest when an injunction prevents the men from picketing.\n\nThe drama portrays both the external conflict between workers and the mining company, as well as the internal struggles of gender equality within the Mexican-American community. Esperanza’s journey reflects both labor justice and the feminist awakening of the time, highlighting how women’s involvement transformed the strike into a broader movement for dignity and equality.\n\nThe film’s authenticity comes from its use of real miners and their families as actors, blending documentary-style realism with dramatized storytelling. This innovative approach set it apart from mainstream Hollywood productions and gave it a raw, uncompromising voice that resonates to this day.\n\nCast and Crew:\n• Director: Herbert J. Biberman\n• Writers: Michael Wilson, Paul Jarrico\n• Producer: Paul Jarrico\nStarring:\n• Rosaura Revueltas as Esperanza Quintero\n• Juan Chacón as Ramón Quintero\n• Will Geer as Sheriff\n• David Wolfe as Barton MacLane\n• Mervin Williams as Hartwell\n• Clinton Jencks as Frank Barnes\n\nFilm Significance:\nSalt of the Earth holds a unique place in film history as the only film ever blacklisted in the United States for its political content. With its production led by blacklisted filmmakers and its cast largely composed of non-professional actors, the movie was targeted by both Hollywood studios and the U.S. government. Despite these obstacles, it endured as a testament to artistic courage and social justice. Today, it is recognized by the Library of Congress as a culturally significant work and is preserved in the National Film Registry.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Salt of the Earth remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1954 release was in black and white, with limited distribution due to political suppression. While historically authentic, the film’s lack of mainstream release meant that many audiences never saw it. By colorizing and restoring this edition, we give modern audiences — especially older viewers who enjoy classic cinema on TV screens — a more vivid experience while preserving its powerful historical message. This colorized version enhances immersion and ensures the story continues to educate and inspire future generations.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from silent comedies to mid-century dramas and forgotten B-movies. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#SaltOfTheEarth1954 #PublicDomainMovie #ColorizedClassic #ClassicDrama #LaborRightsFilm #SocialJusticeCinema #BlacklistedHollywood #1950sFilm #FilmRestoration #WorkingClassDrama",
      "id": "OTnNS82giUk",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/salt-of-the-earth-1954",
      "title": "Salt of the Earth (1954)",
      "description": "At New Mexico's Empire Zinc mine, Mexican-American workers protest the unsafe work conditions and unequal wages compared to their Anglo counterparts. Ramon Quintero helps organize the strike, but he is shown to be a hypocrite by treating his pregnant wife, Esperanza, with a similar unfairness. When an injunction stops the men from protesting, however, the gender roles are reversed, and women find themselves on the picket lines while the men stay at home. Watch on RetroFlix:  https://retroflix.org/salt-of-the-earth-1954/",
      "id": "salt-of-the-earth-1954"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=n3VPWmqaOb4",
      "title": "Salt of the Earth (1954) DRAMA",
      "description": "THE ONLY BLACKLISTED AMERICA FILM!\n\nDirector: Herbert J. Biberman\nStars: Juan Chacón, Rosaura Revueltas, Will Geer\n\nBased on an actual strike against the Empire Zinc Mine in New Mexico, the film deals with the prejudice against the Mexican-American workers, who struck to attain wage parity with Anglo workers in other mines and to be treated with dignity by the bosses. \n\nThis film was written, directed and produced by members of the original \"Hollywood Ten,\" who were blacklisted for refusing to answer Congressional inquiries on First Amendment grounds.",
      "id": "n3VPWmqaOb4",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sk3-As0yh3k",
      "title": "Salt of the Earth (1954) The Forbidden Film That Outran the Feds | Raw. Real. Revolutionary.",
      "description": "When the Men Were Silenced, The Women Roared.\nWhen zinc miner Ramón's strike hits a legal wall, his wife Esperanza rallies the women of the mining town. Watch these powerhouse moms step up with picket signs and strategy to outmaneuver authorities and company pressure. A true underdog victory!\n\n⚙️ Watch with audio commentary: Select \"English Descriptive\" from the Audio options\n\nColorized version: https://youtu.be/l0CxlBe7sp8\n\n🎬 CREATED BY\nDirected by filmmaker Herbert J. Biberman (Hollywood Ten)\nWritten by Oscar-winner Michael Wilson (Laurence of Arabia)\nMusic by Sol Kaplan\n\n⭐️ STARRING\n• Rosaura Revueltas as Esperanza (deported during production!)\n• Real-life miner Juan Chacón as Ramón\n• Will Geer (The Waltons) as the Sheriff\n\n🔍 WHY THIS FILM SHOCKED AMERICA\nFIRST U.S. film to center Mexican-American labor/gender struggles\nREAL miners + families performed alongside professional actors\nCREW were blacklisted Hollywood rebels (Biberman, Wilson, Jarrico)\nLEAD ACTRESS deported mid-production by U.S. government!\nSUPPRESSED by The FBI/State Department: Theaters threatened, labs banned processing\nREELS SMUGGLED to Mexico to finish filming & editing\nPRESERVED: Added to National Film Registry (1992)\n\nKey Scenes\n0:36:45 - \"We Are Human Beings!\" Ramon’s speech = Chicano labor manifesto\n1:15:00 - Tear Gas vs. Tortillas: Women weaponize domesticity against cops\n1:52:30 - Final Picket Line: Interracial unity triumphs\n\n\n#SaltOfTheEarth #ColorizedClassics #BannedFilms #LaborHistory #cultcinema \n🔔 SUBSCRIBE @CultCinemaClassics",
      "id": "sk3-As0yh3k",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "94 min",
    "imdbRating": "7.3",
    "imdbVotes": "4,307",
    "Genre": "Drama, History",
    "Plot": "Based on an actual strike against the Empire Zinc Mine in New Mexico, the film deals with the prejudice against the Mexican-American workers, who struck to attain wage parity with Anglo workers in other mines and to be treated with dignity by the bosses. In the end, the greatest victory for the workers and their families is the realization that prejudice and poor treatment are conditions that are not always imposed by outside forces.",
    "Director": "Herbert J. Biberman",
    "Writer": "Michael Wilson",
    "Actors": "Juan Chacón, Rosaura Revueltas, Will Geer",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "4 wins total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0178536",
      "title": "El grito sagrado",
      "year": 1954,
      "imdbRating": "6.2",
      "imdbVotes": "20",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0254632",
      "title": "Operation Manhunt",
      "year": 1954,
      "imdbRating": "5.8",
      "imdbVotes": "34",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046731",
      "title": "Attila",
      "year": 1954,
      "imdbRating": "5.4",
      "imdbVotes": "806",
      "language": "Italian",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0045473",
      "title": "Admiral Ushakov",
      "year": 1953,
      "imdbRating": "7.3",
      "imdbVotes": "224",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0046029",
      "title": "Malta Story",
      "year": 1953,
      "imdbRating": "6.5",
      "imdbVotes": "1,982",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046269",
      "title": "Salome",
      "year": 1953,
      "imdbRating": "5.8",
      "imdbVotes": "2,279",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046051",
      "title": "Martin Luther",
      "year": 1953,
      "imdbRating": "6.8",
      "imdbVotes": "690",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045487",
      "title": "Break to Freedom",
      "year": 1953,
      "imdbRating": "6.6",
      "imdbVotes": "465",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045935",
      "title": "Gate of Hell",
      "year": 1953,
      "imdbRating": "7.1",
      "imdbVotes": "4,674",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048805",
      "title": "White Feather",
      "year": 1955,
      "imdbRating": "6.4",
      "imdbVotes": "1,195",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044400",
      "title": "Battles of Chief Pontiac",
      "year": 1952,
      "imdbRating": "5.7",
      "imdbVotes": "227",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044418",
      "title": "Big Jim McLain",
      "year": 1952,
      "imdbRating": "5.2",
      "imdbVotes": "2,405",
      "language": "English, Japanese, Hawaiian",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:40.952Z"
}