{
  "imdbId": "tt0054326",
  "title": "Sons and Lovers",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sons-and-lovers-1960",
      "id": "sons-and-lovers-1960",
      "title": "Sons and Lovers (1960)",
      "description": "The son of a working-class British mining family has dreams of pursuing an art career, but when he strikes up an affair with an older, married woman from the town it enrages his kind but possessive mother. Watch on RetroFlix:  https://retroflix.org/sons-and-lovers-1960/",
      "fileSize": 1370018910,
      "addedAt": "2026-01-07T00:11:35.624Z",
      "thumbnail": "https://archive.org/services/img/sons-and-lovers-1960",
      "language": "eng",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 171
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "103 min",
    "imdbRating": 7.1,
    "imdbVotes": 1818,
    "Genre": "Drama",
    "Plot": "It's the early twentieth century. The Morel family lives in the coal mining community of Bestwood, England, just outside of Nottingham. There is little connection now between husband and wife, Walter and Gertrude, due to their differences, while each quietly or not so quietly is able to manipulate emotionally their now adult sons. While eldest son William has escaped the clutches of his parents by moving to London, each of the two remaining sons have ended up having a natural alliance or connection to one parent. Arthur, like brusque Walter, works in the mines, something that Walter believes is their duty and legacy. Artistically inclined Paul, who is self-taught in his art, instead has a lower paying office job, in Gertrude's mind it a longer path but to greater financial gain, Paul who is never to work in the mines. Paul, arguably, would live as a painter if he was able. Paul's relationship with two women is shown in light of the influence Gertrude has had in his life, he who has separated the concepts of love, sex and marriage in his mind. The first is childhood friend, farm girl Miriam Leivers, who Paul has also instilled a romantic notion of the arts and literature. Their relationship is also affected by Mrs. Leivers, who has taught Miriam to have an ugly view of physical sex, it purely a means to procreation. The second is work colleague Clara Dawes, an emancipated woman separated from her laborer husband, Baxter Dawes.",
    "Director": "Jack Cardiff",
    "Writer": "Gavin Lambert, T.E.B. Clarke, D.H. Lawrence",
    "Actors": "Trevor Howard, Dean Stockwell, Wendy Hiller",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "Won 1 Oscar. 8 wins & 16 nominations total"
  },
  "relatedMovies": [
    "tt0054271",
    "tt0052623",
    "tt0053106",
    "tt0054230",
    "tt0168492",
    "tt0053751",
    "tt0054788",
    "tt0054058",
    "tt0054084",
    "tt0054102",
    "tt0054295",
    "tt0054380"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.624Z"
}