{
  "imdbId": "tt0034012",
  "title": "Penny Serenade",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/penny_serenade",
      "title": "Penny Serenade",
      "description": "Touching romantic comedy starring Cary Grant and Irene Dunne. Find out more about this film at its IMDB page .",
      "id": "penny_serenade"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PennySerenade",
      "title": "Penny Serenade",
      "description": "As Julie prepares to leave her husband Roger, she begins to play through a stack of recordings, each of which reminds her of events in their lives together. One of them is the song that was playing when she and Roger first met in a music store. Other songs remind her of their courtship, their marriage, their desire for a child, and the joys and sorrows that they have shared. A flood of memories comes back to her as she ponders their present problems and how they arose.",
      "id": "PennySerenade"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nVxGkvvi9TE",
      "title": "Penny Serenade (1941) | Colorized Public Domain Classic Romance with Cary Grant and Irene Dunne",
      "description": "Penny Serenade (1941) is an American romantic drama film directed by George Stevens and starring Cary Grant and Irene Dunne, two of Hollywood’s greatest Golden Age actors. This colorized and restored edition of the public domain classic brings new emotional depth and visual clarity to a timeless love story. By reviving this film in color and modern quality, today’s audiences in the United States, Europe, and beyond can experience one of the most poignant family dramas of the 1940s, bridging historical cinema with contemporary accessibility.\n\nPlot Summary:\nTold through the framing device of a woman reflecting on her life while listening to old records, the story follows Julie Gardiner (Irene Dunne) and her husband Roger Adams (Cary Grant). As Julie plays each record, the couple’s past unfolds — their whirlwind romance, early struggles, marriage, and heartbreaking attempt to build a family. After suffering a devastating miscarriage, they decide to adopt a baby girl, whose presence fills their lives with joy. However, their happiness is shaken when tragedy strikes again, forcing Roger and Julie to confront grief, financial hardship, and the fragility of love.\nThe film weaves together themes of resilience, loss, and the enduring strength of marriage. Its emotional weight is heightened by Cary Grant’s unforgettable performance, which earned him an Academy Award nomination for Best Actor, and Irene Dunne’s moving portrayal of a woman torn between despair and hope.\n\nCast and Crew:\n• Director: George Stevens\n• Producer: George Stevens\n• Screenplay: Morrie Ryskind\n• Based on: Story by Martha Cheavens\n• Cinematography: Joseph Walker\n• Editing: Otto Meyer\nStarring:\n• Cary Grant as Roger Adams\n• Irene Dunne as Julie Gardiner Adams\n• Beulah Bondi as Miss Oliver\n• Edgar Buchanan as Applejack Carney\n• Ann Doran as Dotty\n• Leonard Willey as Billings\n• Eva Lee Kuney as Trina (the adopted daughter)\n\nFilm Significance:\nPenny Serenade stands as one of the most memorable melodramas of the 1940s, showcasing the emotional power of Hollywood’s Golden Age. The film blends heartfelt sentiment with deeply human struggles, resonating with audiences then and now. Cary Grant’s Academy Award-nominated role remains a career highlight, while Irene Dunne delivers one of her most tender and empathetic performances. Directed by George Stevens, who would later helm acclaimed works like A Place in the Sun (1951) and Giant (1956), this film reflects the studio era’s ability to craft deeply moving, character-driven stories that still connect across generations.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Penny Serenade remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1941 release was in black and white, a standard of its era. While historically authentic, many modern viewers skip over black-and-white films, reducing their cultural reach. By offering a colorized edition, we bridge the gap between film history and today’s viewing preferences. This allows contemporary audiences to engage more fully with the powerful storytelling, performances, and emotions that made Penny Serenade an enduring classic.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten melodramas to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#PennySerenade #CaryGrant #IreneDunne #GeorgeStevens #ClassicRomance #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #FilmRestoration #1940sDrama #AdoptionStory",
      "id": "nVxGkvvi9TE",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/penny-4-k",
      "title": "Penny Serenade (1941) [Colorized, 4K, 60FPS]",
      "description": "Penny Serenade is a 1941 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "penny-4-k"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/penny-serenade",
      "title": "Penny Serenade",
      "description": "Taken from IMDB : As Julie prepares to leave her husband Roger, she begins to play through a stack of recordings, each of which reminds her of events in their lives together. One of them is the song that was playing when she and Roger first met in a music store. Other songs remind her of their courtship, their marriage, their desire for a child, and the joys and sorrows that they have shared. A flood of memories comes back to her as she ponders their present problems and how they arose.",
      "id": "penny-serenade"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/penny-serenade-1941",
      "title": "Penny Serenade (1941)",
      "description": "While listening to a recording of Penny Serenade, Julie Gardiner Adams begins reflecting on her past. She recalls her impulsive marriage to newspaper reporter Roger Adams, which begins on a deliriously happy note but turns out to be fraught with tragedy. Other songs remind her of their courtship, their marriage, their desire for a child, and the joys and sorrows they have shared. A flood of memories come back to her as she ponders on their present problems and how they arose. Watch on RetroFlix:  https://retroflix.org/penny-serenade-1941/",
      "id": "penny-serenade-1941"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=muSKveUgAuI",
      "title": "Penny Serenade (1941) IRENE DUNNE/CARY GRANT",
      "description": "PizzaFLIX is your hub for the largest collection of FREE Full Length movies on YouTube. \nStars: Irene Dunne, Cary Grant, Beulah Bondi\nDirector: George Stevens\nScreenplay: Morrie Ryskind\n\nIn this flawless blend of heartbreak and humor, a wife contemplating divorce reflects on the ups and downs of her marriage. Cary Grant received an Academy Award nomination for Best Actor.",
      "id": "muSKveUgAuI",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tA4mZvL9XEs",
      "title": "Penny Serenade (1941) with Irene Dunne & Cary Grant | Romance Hits All the High Notes",
      "description": "\"Remember the tune they were singing... The night we fell in love?...\"\nA couple's big dreams give way to a life full of unexpected sadness and unexpected joy.\n\nOriginal title: Penny Serenade (1941)\n\nBlack & White version: https://youtu.be/3ER9-pWmdxQ\n\nThis film is available with English, Italian, & Spanish audio, and subtitled in many more languages.\n\nDirector: George Stevens\nWriters: Morrie Ryskind, Martha Cheavens\nStars: Cary Grant, Irene Dunne, Beulah Bondi \nGenre:  Colorized classics, Drama, Romance\n\n\n00:00 Full Movie\n01:41 A conversation between two people about their relationship and marriage.\n15:12 Roger tells Julie about a job opportunity in Japan and proposes to marry her.\n25:49 A couple discusses their inheritance and plans for a trip, but their financial situation causes tension.\n38:28 Discussing the newspaper and the possibility of adopting a child with Julie and Roger.\n46:01 A couple is discussing their application to adopt a child and the requirements they need to meet.\n55:08 A couple agrees to adopt a baby girl and navigates the challenges of caring for her.\n1:19:45 A couple pleads with a judge not to take away their adopted child.\n1:34:00 A family celebrates a birthday and plans for the future, but tragedy strikes when their daughter dies suddenly.\n1:49:56 A couple discusses their failing relationship and reflects on their past together.\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "tA4mZvL9XEs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "119 min",
    "imdbRating": "7.0",
    "imdbVotes": "8,233",
    "Genre": "Drama, Romance",
    "Plot": "As tears well up in her eyes, once-happy Julie listens to her favourite songs, reminiscing about the ups and downs of her life. Indeed, Julie and her husband, Roger, have always been there for each other through thick and thin. However, it seems that the love is gone. But, before leaving the house, Julie decides to listen to their old, memory-laden records for one last time, eager to relive all the fundamental stages of her love story with Roger. Now, a flurry of mixed emotions overcomes Julie. Is all hope lost?",
    "Director": "George Stevens",
    "Writer": "Morrie Ryskind, Martha Cheavens",
    "Actors": "Cary Grant, Irene Dunne, Beulah Bondi",
    "Language": "English, Japanese",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 2 nominations total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0043924",
      "title": "A Place in the Sun",
      "year": 1951,
      "imdbRating": "7.7",
      "imdbVotes": "25,414",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032599",
      "title": "His Girl Friday",
      "year": 1940,
      "imdbRating": "7.8",
      "imdbVotes": "67,176",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031593",
      "title": "Love Affair",
      "year": 1939,
      "imdbRating": "7.3",
      "imdbVotes": "6,880",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033891",
      "title": "Meet John Doe",
      "year": 1941,
      "imdbRating": "7.6",
      "imdbVotes": "16,080",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033399",
      "title": "Blonde Comet",
      "year": 1941,
      "imdbRating": "5.0",
      "imdbVotes": "112",
      "language": "English, Swedish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033526",
      "title": "Desperate Cargo",
      "year": 1941,
      "imdbRating": "5.2",
      "imdbVotes": "140",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033808",
      "title": "Lady from Louisiana",
      "year": 1941,
      "imdbRating": "5.8",
      "imdbVotes": "594",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034272",
      "title": "That Hamilton Woman",
      "year": 1941,
      "imdbRating": "7.2",
      "imdbVotes": "5,180",
      "language": "English, French, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033459",
      "title": "Cheers for Miss Bishop",
      "year": 1941,
      "imdbRating": "6.4",
      "imdbVotes": "852",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0123126",
      "title": "Joven, viuda y estanciera",
      "year": 1941,
      "imdbRating": "8.0",
      "imdbVotes": "16",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033821",
      "title": "Law of the Tropics",
      "year": 1941,
      "imdbRating": "5.9",
      "imdbVotes": "172",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033873",
      "title": "Man Hunt",
      "year": 1941,
      "imdbRating": "7.2",
      "imdbVotes": "6,586",
      "language": "English, German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:12.698Z"
}