{
  "movieId": "tt0058977",
  "title": "Blindfold",
  "year": 1966,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dipwad2_zoho_1653",
      "id": "dipwad2_zoho_1653",
      "title": "Blindfold",
      "description": "\"Blindfold\" is a 1965 American comedy-thriller film directed by Philip Dunne and starring Rock Hudson and Claudia Cardinale.  In the movie, Rock Hudson plays Dr. Bartholomew Snow, a psychiatrist, who becomes embroiled in a complex espionage plot. He is tasked with treating a mysterious patient named Arthur Vincenti, who is being kept in seclusion by the government after witnessing something he shouldn't have. To ensure Snow doesn't inadvertently reveal the patient's whereabouts, government agents \"blindfold\" him whenever he is transported to and from Vincenti's location. As the plot unfolds, Snow finds himself caught in a web of intrigue, with spies, counterspies, and double-crosses, while also developing a romantic relationship with Vincenti's sister, played by Claudia Cardinale. The film blends elements of suspense with comedic moments, capitalizing on Hudson's charm and comedic timing.",
      "fileSize": 1125130311,
      "addedAt": "2026-01-07T00:08:07.356Z",
      "thumbnail": "https://archive.org/services/img/dipwad2_zoho_1653",
      "year": 1965,
      "collection": "feature_films",
      "downloads": 2381
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "102 min",
    "imdbRating": 6.2,
    "imdbVotes": 1148,
    "Genre": "Comedy, Crime, Mystery",
    "Plot": "Dr. Bartholomew Snow, a psychiatrist, is treating a man with emotional problems who, it turns out, is a brilliant scientist being pursued by different international powers and their operatives. Snow soon finds himself caught in the middle and out of desperation, he falls in with a mysterious and beautiful woman named Vicky Vincenti. But is she helping him, or is she yet another sinister figure out to manipulate him?",
    "Director": "Philip Dunne",
    "Writer": "Philip Dunne, W.H. Menger, Lucille Fletcher",
    "Actors": "Rock Hudson, Claudia Cardinale, Jack Warden",
    "Language": "English, Italian",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039645",
    "tt0037960",
    "tt0038577",
    "tt0019690",
    "tt0035758",
    "tt0027807",
    "tt0023528",
    "tt0047434",
    "tt0024545",
    "tt0020785",
    "tt0031221",
    "tt0036774"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.356Z"
}