{
  "imdbId": "tt0025271",
  "title": "The House of Mystery",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house-4-k",
      "title": "The House of Mystery (1934) [Colorized, 4K, 60FPS]",
      "description": "The House of Mystery is a 1934 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "house-4-k"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house-of-mystery-1934",
      "title": "House of Mystery (1934)",
      "description": "Out of the Mystic Temples of Old India crept this terrible Monster to wreak vengeance of the Hindu Gods. One by one its victims fell with not a trace of the bloody assassin. Watch on RetroFlix:  https://retroflix.org/house-of-mystery-1934/",
      "id": "house-of-mystery-1934"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UM6PmI9fh30",
      "title": "The House of Mystery (1934) | Colorized Public Domain Horror Mystery with Verna Hillie and Laya Joy",
      "description": "The House of Mystery (1934) is a pre-Code American horror mystery directed by William Nigh, a filmmaker known for his versatile work across multiple genres. This restored and colorized edition revives one of the most overlooked entries in early horror cinema. Combining exotic curses, ancient temples, and murder-driven suspense, the film reflects the period’s fascination with the supernatural and the mysteries of far-off lands. By presenting this atmospheric thriller in modern color, viewers in the United States, Europe, and worldwide can rediscover an obscure but fascinating classic that blends mystery, horror, and adventure.\n\nPlot Summary:\nThe story begins with archaeologist John Prendergast (Henry B. Walthall), who leads an expedition into the jungles of India. When the group plunders a sacred idol, they unleash a deadly curse that will haunt them for years. A sacred tiger is sent to punish those who desecrated the temple, marking the beginning of a terrifying series of deaths.\n\nYears later, the surviving members gather at a secluded estate. Among them are Dorothy Prendergast (Verna Hillie) and her fiancé, Robert “Bob” Wedgwood (John Sheehan). As tension grows, the group realizes that the curse is still active, and the mysterious tiger continues to strike down victims one by one. Suspicion, fear, and paranoia consume the house as the survivors wonder who—or what—is orchestrating the killings. Is it truly a supernatural curse, or is there a human hand behind the terror? The film builds toward a chilling conclusion that leaves audiences questioning the nature of fate, guilt, and justice.\n\nCast and Crew:\n• Director: William Nigh\n• Screenplay: Albert DeMond\n• Producer: William Nigh\n• Cinematography: Harry Neumann\n• Studio: Monogram Pictures\n\nStarring:\n• Verna Hillie as Dorothy Prendergast\n• Henry B. Walthall as John Prendergast\n• John Sheehan as Robert “Bob” Wedgwood\n• Laya Joy as Chanda\n• Brandon Hurst as Bertram Leeds\n• Holmes Herbert as Sir Arthur Grant\n\nFilm Significance:\nThe House of Mystery is part of Monogram Pictures’ early ventures into horror, following the studio trend of capitalizing on the success of Universal’s monster films. Unlike those larger productions, this film offered low-budget thrills centered on exoticism, superstition, and suspense. Henry B. Walthall, best known for his performance in The Birth of a Nation (1915), anchors the film with a sense of gravitas, while Verna Hillie and John Sheehan provide the romantic subplot common in 1930s genre cinema.\n\nThough overshadowed by more famous horror films of the decade, this picture is a unique artifact of the era’s fascination with “Orientalist” themes and cultural mysteries. It also highlights the growing popularity of the “curse” narrative, which would later inspire films such as The Mummy and countless supernatural thrillers.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The House of Mystery (1934) remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1934 release was filmed in stark black and white, which reflected its budgetary limits but also reinforced its eerie mood. The colorized edition revitalizes the film’s atmosphere by highlighting the lush jungle settings, the haunting interior of the estate, and the vibrant presence of the cursed tiger. This makes the suspense and horror more immediate and captivating for modern audiences while preserving the authenticity of the story.\n\nLegacy:\nAlthough often forgotten, The House of Mystery represents the spirit of independent horror filmmaking in the 1930s. It offers a snapshot of how low-budget studios adapted popular horror trends for mass audiences while still delivering suspense and thrills. For enthusiasts of vintage horror and mystery films, this colorized restoration ensures that this rare gem remains available for study, preservation, and enjoyment in today’s era of streaming and digital access.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from horror and thrillers to romances and dramas. Our mission is to preserve cinematic history while making it more accessible and engaging for audiences in the USA, Europe, and beyond.\n\n#TheHouseOfMystery #1930Horror",
      "id": "UM6PmI9fh30",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zg2ZbV0xeyI",
      "title": "House of Mystery (1934) HORROR",
      "description": "Stars: Ed Lowry, Verna Hillie, John Sheehan \n Director: William Nigh\n\n An ancient curse and a killer ape are contained inside an old dark mansion.",
      "id": "zg2ZbV0xeyI",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": "4.8",
    "imdbVotes": "387",
    "Genre": "Mystery",
    "Plot": "An ancient curse and a killer ape are contained inside an old dark mansion.",
    "Director": "William Nigh",
    "Writer": "Albert DeMond, Adam Shirk",
    "Actors": "Ed Lowry, Verna Hillie, John Sheehan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0025514",
      "title": "Monte Carlo Nights",
      "year": 1934,
      "imdbRating": "5.1",
      "imdbVotes": "174",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026755",
      "title": "The Mysterious Mr. Wong",
      "year": 1934,
      "imdbRating": "4.8",
      "imdbVotes": "872",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025543",
      "title": "Mystery Liner",
      "year": 1934,
      "imdbRating": "4.6",
      "imdbVotes": "515",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028360",
      "title": "The 13th Man",
      "year": 1937,
      "imdbRating": "5.9",
      "imdbVotes": "145",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032404",
      "title": "Doomed to Die",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "1,465",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025830",
      "title": "The Star Packer",
      "year": 1934,
      "imdbRating": "5.1",
      "imdbVotes": "1,323",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032457",
      "title": "The Fatal Hour",
      "year": 1940,
      "imdbRating": "5.4",
      "imdbVotes": "1,328",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031704",
      "title": "The Mystery of Mr. Wong",
      "year": 1939,
      "imdbRating": "6.1",
      "imdbVotes": "1,028",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018867",
      "title": "Escape from Hong Kong",
      "year": 1942,
      "imdbRating": "5.6",
      "imdbVotes": "38",
      "language": "English, German, Chinese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035386",
      "title": "The Strange Case of Doctor Rx",
      "year": 1942,
      "imdbRating": "5.3",
      "imdbVotes": "619",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024984",
      "title": "City Limits",
      "year": 1934,
      "imdbRating": "5.7",
      "imdbVotes": "63",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026458",
      "title": "The Headline Woman",
      "year": 1935,
      "imdbRating": "5.8",
      "imdbVotes": "135",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:46.614Z"
}