{
  "movieId": "tt0051744",
  "title": "House on Haunted Hill",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house_on_haunted_hill_ipod",
      "id": "house_on_haunted_hill_ipod",
      "title": "House on Haunted Hill",
      "description": "Frederick Loren has invited five strangers to a party of a lifetime. He is offering each of them $10,000 if they can stay the night in a house.",
      "fileSize": 1537953452,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/house_on_haunted_hill_ipod",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 1011140
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HouseOnHauntedHill1959",
      "id": "HouseOnHauntedHill1959",
      "title": "House on Haunted Hill (1959)",
      "description": "House on Haunted Hill is quite an atmospheric movie. It has spooky background music, plenty of cobwebs, ceilings that drip blood, and organs that play all by themselves and... oh, I nearly forgot, it also has one of the best horror actors of the day - Vincent Price. You can find out more about House on Haunted Hill at A Passion For Horror .",
      "fileSize": 1484045426,
      "addedAt": "2026-01-07T00:06:30.619Z",
      "thumbnail": "https://archive.org/services/img/HouseOnHauntedHill1959",
      "collection": "feature_films",
      "downloads": 123313
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_House_On_Haunted_Hill",
      "id": "The_House_On_Haunted_Hill",
      "title": "House on Haunted Hill",
      "description": "An eccentric millionaire throws a party for his wife in a haunted house offering each guest $10,000 if they can make it through the night. Only there seem to be schemes at work beyond what the ghosts have planned. You can find out more about this movie on its IMDB page . You can download an AVI of this movie here . And this movie was featured on an episode of Frightmares the Series hosted on the Internet Archive here .",
      "fileSize": 3277257443,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_House_On_Haunted_Hill",
      "language": "English",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 251829
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house-of-hunted-hill-4-k",
      "id": "house-of-hunted-hill-4-k",
      "title": "House On Haunted Hill (1959) [Colorized, 4K, 60FPS]",
      "description": "House On Haunted Hill is a 1959 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 5320901522,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/house-of-hunted-hill-4-k",
      "collection": "feature_films",
      "downloads": 1563
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house-on-haunted-hill-1959_202312",
      "id": "house-on-haunted-hill-1959_202312",
      "title": "House on Haunted Hill (1959)",
      "description": "Frederick Loren has invited five strangers to a party of a lifetime. He is offering each of them $10,000 if they can stay the night in a house. But the house is no ordinary house. This house has a reputation for murder. Frederick offers them each a gun for protection. They all arrived in a hearse and will either leave in it $10,000 richer or leave in it dead! Watch on RetroFlix:  https://retroflix.org/house-on-haunted-hill-1959/",
      "fileSize": 438003144,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/house-on-haunted-hill-1959_202312",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 386
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house-on-haunted-hill-1959_202511",
      "id": "house-on-haunted-hill-1959_202511",
      "title": "House on Haunted Hill (1959)",
      "description": "House on Haunted Hill is a 1959 American cult classic horror film produced and directed by William Castle, written by Robb White and starring Vincent Price, Carol Ohmart, Richard Long, Alan Marshal, Carolyn Craig, Julie Mitchum, and Elisha Cook Jr. In the film,  eccentric millionaire Frederick Loren invites five strangers to spend the night in a supposedly haunted house, offering each $10,000 if they can survive until morning. As the night unfolds, the guests encounter terrifying apparitions and uncover dark secrets, leading to a shocking revelation about betrayal and murder.",
      "fileSize": 731797316,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/house-on-haunted-hill-1959_202511",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 89
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GZ5paTwRA_k",
      "id": "GZ5paTwRA_k",
      "title": "House on Haunted Hill (1959) [Horror] [Thriller]",
      "description": "\"House on Haunted Hill\" is a 1959 American horror film. It was directed by William Castle, written by Robb White and stars Vincent Price as eccentric millionaire Fredrick Loren. He and his fourth wife, Annabelle, have invited five people to the house for a \"haunted house\" party. Whoever stays in the house for one night will earn $10,000 each. As the night progresses, all the guests are trapped inside the house with ghosts, murderers and other terrors.Exterior shots of the house were filmed at the historic Ennis House in Los Feliz, California. \n\nEccentric millionaire Frederick Loren (Vincent Price) invites five people to a \"party\" he is throwing for his fourth wife, Annabelle (Carol Ohmart), in a rented house, promising to give them each $10,000 with the stipulation that they must stay the entire night in the house after the doors are locked at midnight. Arriving late at night in separate funeral cars with a hearse leading the procession, Loren's guests are told the rules of the party, and each are given a .45 caliber pistol for protection. Forced to attend the party, Loren's wife tries to warn the guests that her husband is psychotic, causing them to be very suspicious of him. Nora Manning (Carolyn Craig) becomes convinced that he's trying to kill her when she keeps seeing frightening apparitions, including the ghost of Annabelle, who had apparently hanged herself some time during the night. Almost as frightened as Nora is another party guest, Watson Pritchard (Elisha Cook), the owner of the house. He is convinced that the house is genuinely haunted by the ghosts of those killed there in the past, including his own brother, and that those ghosts have the power to \"come for\" (kill) anyone in the house. Party guest Lance Schroeder (Richard Long) is attacked in a basement room, but is convinced his attacker was real, and tries to calm Nora's fears.\n\nIt is eventually revealed that Annabelle, in league with one of the guests, Dr. Trent (Alan Marshal), faked her death in an attempt to frighten Nora so badly that she will be compelled to shoot Frederick. After being driven into a fit of hysteria by the repeated frights she has experienced during the night, Nora, seeing Frederick walking toward her in the basement with a gun in his hand, does indeed shoot him. After she flees the room, Dr. Trent slips in and tries to get rid of Frederick's body by pushing it into a vat of acid there, but the lights go out, and the sounds of a struggle and splash are heard. Hearing the gunshot, Annabelle rushes down to the basement to confirm that her husband is dead, but finds the room empty. Suddenly, a skeleton rises from the acid accompanied by Frederick's disembodied voice. As the animated spectre approaches her, a screaming Annabelle recoils in horror, accidentally falling into the acid herself. The real Frederick then emerges from the shadows, holding the contraption that he used to manipulate the skeleton. Triumphant, he watches Annabelle dissolve in the acid.\n\nNora tells the other guests that she has shot Loren in the basement, but when they all arrive there they find him alive. He tells Nora that the gun she fired at him had been loaded with blanks, and explains to his guests that his wife and Dr. Trent had been trying to kill him and that they have each met their end in the vat of acid, adding solemnly that he is \"ready for justice to decide\" his guilt or innocence. Watson Pritchard, still an avid believer in the supernatural, looks into the acid and declares that Annabelle and Dr. Trent have now joined the ranks of the house's many ghosts. With a terrified expression on his face, he announces that the ghosts are now coming for him, then, breaking the fourth wall, he turns toward the camera and adds, \"and then they'll come for you.\"\n\n---\n\nDirected by William Castle, prodced by William Castle, Robb White, written by Robb White, starring Vincent Price, Carolyn Craig, Elisha Cook, Carol Ohmart, Alan Marshal, Julie Mitchum and Richard Long.\n\n---\n\nSource: \"House on Haunted Hill\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 8 September 2012. Web. 13 September 2012. http://en.wikipedia.org/wiki/House_on_Haunted_Hill.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:47.867Z",
      "thumbnail": "https://i.ytimg.com/vi/GZ5paTwRA_k/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCBR-WnY5EtbfORIZ9NQR0RGlywvA",
      "duration": 4484,
      "language": "en",
      "year": 1959,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fMovXQn-lng",
      "id": "fMovXQn-lng",
      "title": "House on Haunted Hill (1959) VINCENT PRICE",
      "description": "It's Friday@PizzaFLIX\nStars: Vincent Price, Carol Ohmart, Richard Long, Elisha Cook Jr.\nDirector: William Castle\n\nIn William Castle’s Macabre Masterpiece, an eccentric millionaire offers $10,000 to five strangers who agree to be locked in a large, spooky mansion overnight with him and his wife.\n\nTRIVIA: Exterior shots of the mansion were filmed at the historic 1924 Ennis House in Los Feliz California, designed by Frank Lloyd Wright.",
      "addedAt": "2025-12-24T01:08:23.108Z",
      "thumbnail": "https://i.ytimg.com/vi/fMovXQn-lng/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCvZ0gTw6n5ji9J8kvaFsfsuzF79g",
      "duration": 4505,
      "language": "en",
      "year": 1959,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cxtswm5yVN4",
      "id": "cxtswm5yVN4",
      "title": "House on Haunted Hill (1959) Colorized Cult Film | Vincent Price Horror, Mystery, Movie",
      "description": "The doors are locked at midnight!  A millionaire offers $10,000 to five people who agree to be locked in a large, spooky, rented house overnight with him and his wife.\n\nDirectors: William Castle, Rosemary Horvath\nWriter: Robb White\nStars: Vincent Price, Carol Ohmart, Richard Long \nGenres: Classics, Cult Film, Horror, Mystery\nBudget: $200,000\n\nCCC CHAPTERS: in the general comments, tell us your favorite scene or line in the movie, with a time stamp & we will add it here!\n00:00 Full Length Movie\n10:26 Would you go away for $1 million\n24:19 Scare the crap \n35:26 Meet the players\n35:58 Rules of the game \n1:09:55 Puppet master & manipulator\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:46:29.597Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/cxtswm5yVN4/maxresdefault.webp?v=63173496",
      "duration": 4492,
      "language": "en",
      "year": 1959,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=09w7isSx650",
      "id": "09w7isSx650",
      "title": "House on Haunted Hill (1959) Vincent Price | Horror, Mystery Cult Film",
      "description": "Acclaimed The Super-Shocker Of The Century!\nA millionaire offers $10,000 to five people who agree to be locked in a large, spooky, rented house overnight with him and his wife.\n\nDirectors: William Castle, Rosemary Horvath\nWriter: Robb White\nStars: Vincent Price, Carol Ohmart, Richard Long \nGenres: Classics, Cult Film, Horror, Mystery\nBudget: $200,000\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:51:43.145Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/09w7isSx650/maxresdefault.webp?v=629f1ca1",
      "duration": 4495,
      "language": "en",
      "year": 1959,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/House_On_Haunted_Hill.avi",
      "id": "House_On_Haunted_Hill.avi",
      "title": "The House On Haunted Hill",
      "description": "Vincent Price gives a stellar performance as the suavely malevolent host of a \"haunted house party\" who offers his guests $10,000 if they can survive a night in the murderous mansion. Watch for the great Elisha Cook Jr,(he played Wilmer in the \"Maltese Falcon\") as the groveling homeowner. The eerie looking home used for the exterior shots is the Ennis Brown house in Los Angeles, designed by Frank Lloyd Wright and built in 1924. It was later used in the films \"Blade Runner\", \"Black Rain\", and \"Rocketeer\".",
      "fileSize": 1809591488,
      "addedAt": "2026-01-07T00:06:30.619Z",
      "thumbnail": "https://archive.org/services/img/House_On_Haunted_Hill.avi",
      "language": "English",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 601266
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "75 min",
    "imdbRating": 6.7,
    "imdbVotes": 32673,
    "Genre": "Crime, Horror, Mystery",
    "Plot": "Eccentric millionaire Fredrick Loren and his 4th wife, Annabelle, have invited 5 people to the house on Haunted Hill for a \"haunted House\" party. Whoever will stay in the house for one night will earn ten thousand dollars each. As the night progresses, all the guests are trapped inside the house with ghosts, murderers, and other terrors.",
    "Director": "William Castle",
    "Writer": "Robb White",
    "Actors": "Vincent Price, Carol Ohmart, Richard Long",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0053363",
    "tt0052602",
    "tt0057692",
    "tt0056219",
    "tt0055304",
    "tt0052655",
    "tt0052609",
    "tt0052634",
    "tt0037024",
    "tt0052713",
    "tt0039800",
    "tt0015202"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.614Z"
}