{
  "imdbId": "tt0020502",
  "title": "Tide of Empire",
  "year": 1929,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5sRS9Y0UN1o",
      "id": "5sRS9Y0UN1o",
      "title": "Tide of Empire (1929) RENÉE ADORÉE🍕 TOM KEENE🍕 PRE-CODE HOLLYWOOD WESTERN",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Renée Adorée, Tom Keene/George Duryea, William Collier Jr., Fred Kohler\nDirected by: Allan Dwan\n🍕Presented with the original synchronized orchestral score and sound effects🍕\nDRAMA! ROMANCE! ADVENTURE! A cinematic tale of cultural and personal change set against the backdrop of California’s Gold Rush.\n\nStep into the transformative California Gold Rush era with Tide of Empire (1929), a cinematic treasure directed by Allan Dwan. This Pre-Code romantic drama stars the captivating Renée Adorée and George Duryea (later known as Tom Keene), delivering stellar performances in a story of love, ambition, and cultural change.\n\nExperience the sweeping adventure of a rapidly evolving frontier, where dreams clash with reality and personal destinies are forever altered. Tide of Empire expertly blends historical drama, romance, and adventure, making it a must-watch for fans of silent films, classic westerns, and Pre-Code Hollywood magic.\n\nRenée Adorée, best remembered for The Big Parade (1925), shines in this captivating tale, while Tom Keene showcases the charisma that would later define his Western fame. Directed by Allan Dwan, one of the most prolific filmmakers of the silent and early sound era, this film is a testament to MGM’s artistry during Hollywood’s golden age.\n\nIf you’re a fan of classic westerns, silent cinema, Renée Adorée, or Tom Keene, this PizzaFLIX gem is for you. Don’t miss this rare look into the romance and adventure of a bygone era.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#pizzaflix #TideOfEmpire #1929Film #ReneeAdoree #TomKeene #PreCodeHollywood #ClassicWesterns #SilentFilmEra #AllanDwan #GoldRushDrama #VintageCinema #OldHollywood #PreCodeRomance",
      "addedAt": "2025-12-24T01:05:00.833Z",
      "thumbnail": "https://i.ytimg.com/vi/5sRS9Y0UN1o/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCjDkF5vdoSO8ub2p9w3H6Q6zBz1Q",
      "duration": 4414,
      "language": "en",
      "year": 1929,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tide-of-empire_1929",
      "id": "tide-of-empire_1929",
      "title": "Tide of Empire",
      "fileSize": 5523547616,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/tide-of-empire_1929",
      "language": "English",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 698
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "73 min",
    "imdbRating": 6.1,
    "imdbVotes": 249,
    "Genre": "Western",
    "Plot": "The discovery of gold in California in 1848 brings a tide of gold seekers to the area, disrupting the lives of the Guerrero family who have owned nearby Rancho Chico for generations. Among these are Dermod D'Arcy, in partners with a jailer, Bejabbers. At a fiesta where horse races are traditionally run, a stranger notices Dermod's exceptionally fast horse, Pathfinder, and urges him to enter the horse in the race. It becomes a three-horse race, with Don José Guerrero betting his ranch that his horse will win. When Pathfinder wins, Dermod takes the ranch as his share of the winnings and gives it to Don José's daughter, Josephita, with whom he had fallen in love earlier, when he met her. Dermod and Bejabbers leave to search for gold, and the town grows rich as more and more gold is amassed. Meanwhile, a bandit chief, Cannon, met Josephita's brother, Romauldo, and forced him to join the gang, which planned to loot the town of its gold before Wells and Fargo shipped it east. As two of the gang set a fire to draw most of the townsmen to put it out, Dermod overhears them discussing the plan and warns the townsmen to stay put. The gang is captured, tried and sentenced to be hung. Dermod is convinced Romauldo is innocent and ponders how to save him.",
    "Director": "Allan Dwan",
    "Writer": "Peter B. Kyne, Joseph Farnham",
    "Actors": "Renée Adorée, Tom Keene, George Fawcett",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031346",
    "tt0047334",
    "tt0008309",
    "tt0412344",
    "tt0006736",
    "tt0001925",
    "tt0043017",
    "tt0033180",
    "tt0020030",
    "tt0017841",
    "tt0019976",
    "tt0019945"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.284Z"
}