{
  "movieId": "tt0037165",
  "title": "Partners of the Trail",
  "year": 1944,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gCJ1KfZbKfk",
      "id": "gCJ1KfZbKfk",
      "title": "Partners of the Trail (1944) JOHNNY MACK BROWN",
      "description": "Stars: Johnny Mack Brown, Raymond Hatton, Craig Woods\nDirector: Lambert Hillyer\n\nA Texas Ranger poses as a hired gun to uncover a plot by a cattle baron who is robbing the land of the smaller ranches and homesteaders.",
      "addedAt": "2025-12-24T01:09:39.089Z",
      "thumbnail": "https://i.ytimg.com/vi/gCJ1KfZbKfk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDLoIFZgWD9ni3O7i2xZ5fw_SBaKQ",
      "duration": 3252,
      "language": "en",
      "year": 1944,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "57 min",
    "imdbRating": 6.4,
    "imdbVotes": 53,
    "Genre": "Drama, Western",
    "Plot": "Kate Hilton, returning to her ranch in Springfield via stagecoach after learning of the murder of her father, meets U.S. Marshal Nevada Jack McKenzie. The stage is held up and robbed of the rancher's money, but Nevada manages to bring it in after the driver has been killed. Sandy Hopkins, also a U.S. Marshal, is posing as a cook at the only café in town. Joel Edwards now running the Wells Fargo office after Hilton was killed, and Kate are in love. J. D. Edwards, president of the land-and-cattle company, and step-father to Joel, controls all the interest in Springfield. A number of citizens have been killed for no apparent reason, and Doctor Applegate has sent for Nevada and Sandy to solve the mystery killings. Applegate is killed after he returns from a prospecting trip, but not before he has deposited some of the gold he found in the Wells Fargo safe. J.D. Edwards, in reality the gang leader, means to acquire the property containing the gold that Hilton, originally, and Applegate later found. Nevada and Sandy learn of the location in time to keep the ranchers from selling to Edwards. The latter tries to shoot Nevada, but Joel draws first and kills him. The ranchers are told there is gold on their property, and the whole gang is apprehended.",
    "Director": "Lambert Hillyer",
    "Writer": "Frank H. Young",
    "Actors": "Johnny Mack Brown, Raymond Hatton, Craig Woods",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037009",
    "tt0036421",
    "tt0011779",
    "tt0038106",
    "tt0034505",
    "tt0039782",
    "tt0034785",
    "tt0034638",
    "tt0036835",
    "tt0035965",
    "tt0037245",
    "tt0037296"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:41:07.171Z"
}