{
  "imdbId": "tt0021722",
  "title": "The Cat's Canary",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-cats-canary-1932",
      "id": "the-cats-canary-1932",
      "title": "The Cat's Canary (1932)",
      "description": "The Cat's Canary is an Aesop Fables cartoon directed by Mannie Davis, John Foster. Watch on RetroFlix:  https://retroflix.org/the-cats-canary-1932/",
      "fileSize": 97127037,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-cats-canary-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 44
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "7 min",
    "imdbRating": 5.7,
    "imdbVotes": 68,
    "Genre": "Animation, Short",
    "Plot": "This pre-code entry in Van-Buren's \"Aesop's Sound Fables\" series finds a Brooklyn-cat in a bowler hat, hanging out in the New Jersey meadow-lands (or somewhere in the wild),who traps a canary and then eats it. Actually, he swallows it and it is flying around in his ribcage. Now, instead of meowing, visual musical notes emerge every time he opens his mouth. He consults a doctor---Shultz, by name---who gives him an early-day x-ray after failing to get a good diagnosis via reading the cat's tongue. The good doctor tries a few violent ways of dislodging the bird but the cat takes his departure when he notes a saw is among the doc's instruments of choice. He goes to his neighborhood---which looks like a future glimpse into the burned-out Bronx three decades later---and joins his fellow alley-cats in a bit of fence-serenading skat-singing which goes not meet the approval of the animal-occupants in a wavering high-rise, especially after the bass cat hits some very low notes. The woodland birds band together and rescue the canary.",
    "Director": "Mannie Davis, John Foster",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0161433",
    "tt0147534",
    "tt0147620",
    "tt0146582",
    "tt0147017",
    "tt0146719",
    "tt0147274",
    "tt0146845",
    "tt0161750",
    "tt0161805",
    "tt0147096",
    "tt0147506"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.682Z"
}