{
  "movieId": "tt0047320",
  "title": "The Outcast",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-outcast-1954",
      "id": "the-outcast-1954",
      "title": "The Outcast (1954)",
      "description": "Thanks to the chicanery of his crooked uncle Major Cosgrave, Jet has been cheated out of his father's property and branded a pariah. He spends the rest of the film trying to regain his birthright and clear his name. The two women in Jet's life are Judy Polsen, who chases him for so long that he finally catches her, and Alice Austin, Major Cosgrave's fianee. Watch on RetroFlix:  https://retroflix.org/the-outcast-1954/",
      "fileSize": 813011175,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-outcast-1954",
      "language": "eng",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 108
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 6.4,
    "imdbVotes": 423,
    "Genre": "Drama, Western",
    "Plot": "Following an absence of eight years, Jet Cosgrave (John Derek) returns to his hometown of Colton, Colorado. His quest is for the recovery of his rightful heritage, the great Circle C Ranch, from his uncle, Major Cosgrave (Jim Davis), and to that end, he brings with him nine hired gunmen, headed by \"Dude\" Rankin (Bob Steele). His accusation that his uncle stole the ranch by a will forged after the death of his father brings instant reprisals. Judy Polsen (Joan Evans), one of a poor family of ranchers, falls in love with Jet after saving him from a bushwhacking by two Circle C gunmen, The Kid (Ben Cooper) and Bert (Harry Carey Jr.). She then vouches for him to her father, Chad Polsen (Frank Ferguson) and her brothers Boone (Slim Pickens), Asa (Nicolas Coster) and Zeke (Robert 'Buzz' Henry),",
    "Director": "William Witney",
    "Writer": "John K. Butler, Richard Wormser, Todhunter Ballard",
    "Actors": "John Derek, Joan Evans, Jim Davis",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0044506",
    "tt0043626",
    "tt0049804",
    "tt0039157",
    "tt0040333",
    "tt0041347",
    "tt0038593",
    "tt0038611",
    "tt0040644",
    "tt0039861",
    "tt0029692",
    "tt0039180"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}