{
  "movieId": "tt0088090",
  "title": "Double Feature",
  "year": 1984,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RomanticComedyNightAtTheBijoudoubleFeature",
      "id": "RomanticComedyNightAtTheBijoudoubleFeature",
      "title": "ROMANTIC COMEDY NIGHT AT THE BIJOU (Double Feature)",
      "description": "Another simulated double feature program in a second-run movie house of the type which no longer exists: The lighthearted entertainment begins with coming attractions and a cartoon. Then in \"Half a Sinner\" a makeover and a naughty canary send a bored school marm (Heather Angel) and a handsome stranger (John King) off on a rolicking car chase with a corpse in the back seat. This leads to romance for her, him and the canary. The great Constance Collier is part of the fun. Next Diana Lynn and Guy Madison costarr in the quirky romance \"Texas, Brooklyn & Heaven.\" However it's the noted character actors of its large supporting cast who provide much if not most of the off-beat fun. Director William Castle's first A-feature production, and Audie Murphy's screen debut.",
      "fileSize": 2285878970,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RomanticComedyNightAtTheBijoudoubleFeature",
      "collection": "feature_films",
      "downloads": 8687
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "115 min",
    "imdbRating": 5.9,
    "imdbVotes": 338,
    "Genre": "Drama",
    "Plot": "The film tells the story of the friendship between two men who live their lives through movies. One is a director who is having trouble connecting with his children; the other is a screenwriter and playwright who is having trouble with his wife. They're working on a film together about growing old and connecting with the younger generation.",
    "Director": "José Luis Garci",
    "Writer": "José Luis Garci, Horacio Valcárcel",
    "Actors": "Adolfo Marsillach, Jesús Puente, María Casanova",
    "Language": "Spanish",
    "Country": "Spain",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    "tt0087821",
    "tt0087878",
    "tt0090368",
    "tt0087803",
    "tt0086877",
    "tt0086891",
    "tt0088734",
    "tt0352599",
    "tt0087383",
    "tt0086915",
    "tt0083776",
    "tt0087516"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}