{
  "movieId": "tt0037629",
  "title": "La dama duende",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-dama-duende-1945",
      "id": "la-dama-duende-1945",
      "title": "La Dama Duende (1945)",
      "description": "La dama duende  es una  película   argentina  de 1945 en blanco y negro, dirigida por  Luis Saslavsky , con guion de los autores de la  Generación del 27 ,  María Teresa León  y  Rafael Alberti  según la  comedia homónima  de  Pedro Calderón de la Barca . Está protagonizada por  Delia Garcés  y  Enrique Álvarez Diosdado . Fue estrenada en  Buenos Aires  el 17 de mayo de 1945. Ganó cinco  Premios Cóndor de Plata  en 1946, entre ellos el de mejor película. Fue reconocida como la  octava mejor película del cine argentino de todos los tiempos  en la encuesta realizada por el  Museo del Cine Pablo Ducrós Hicken  en 1977, mientras que ocupó el puesto 38 en la edición de 2000. [ 1 ] ​(Wikipedia) Sinopsis Doña Ángelica -una hermosa joven recientemente viuda de 18 años- se enamora y quiere casarse con un Oficial del Ejército llamado Don Manuel, pero para ello debe burlar la vigilancia de su cuñada que desea enviarla al convento por el resto de su vida. Para ello elabora un ingenioso engaño que le permita comunicarse con Don Manuel de manera aparentemente misteriosa e inexplicable, apareciendo como un duende o fantasma. Reparto Delia Garcés ...Doña Angélica Pimentel \"La Perulera\" Enrique Álvarez Diosdado ...Don Manuel Enrique Paquita Garzón  ... Jerónima de Olmedo \"la Jeronimilla\" Manuel Collado Montes  ...Don Juan Antonia Herrero  ... Doña Guiomar Amalia Sánchez Ariño  ... Juana Alejandro Maximino Helena Cortesina Andrés Mejuto  ...Don Hernando Peralta Ernesto Vilches Manuel Perales María José Manuel Díaz de la Haza Francisco López Silva  ... Don Luis, duque de Tarsis Consuelo Abad Félix Galimi Fulvio Galimi",
      "fileSize": 4526797313,
      "addedAt": "2026-01-07T00:09:24.701Z",
      "thumbnail": "https://archive.org/services/img/la-dama-duende-1945",
      "language": "spa",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 58
    }
  ],
  "metadata": {
    "Rated": "Btl",
    "Runtime": "101 min",
    "imdbRating": 7.2,
    "imdbVotes": 51,
    "Genre": "Drama, Romance",
    "Plot": "Doña Ángelica - a young widow recently 18 years old - falls in love and wants to marry an army officer named Don Manuel, but to do so she must evade the vigilance of her sister-in-law who wishes to send her to the convent for the rest of her life. For this he elaborates an ingenious deception that allows him to communicate with Don Manuel in a seemingly mysterious and inexplicable way, appearing like a goblin or ghost.",
    "Director": "Luis Saslavsky",
    "Writer": "Rafael Alberti, Pedro Calderón de la Barca, María Teresa León",
    "Actors": "Manuel Collado, Helena Cortesina, Alberto de Mendoza",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "5 wins"
  },
  "relatedMovies": [
    "tt0199895",
    "tt0037547",
    "tt0037865",
    "tt0037811",
    "tt0037447",
    "tt0038190",
    "tt0037701",
    "tt0037558",
    "tt0037588",
    "tt0184326",
    "tt0037702",
    "tt0037800"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.701Z"
}