{
  "movieId": "tt0027007",
  "title": "Skull and Crown",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SkullanCrown",
      "id": "SkullanCrown",
      "title": "Skull and Crown",
      "description": "Bob Franklin (Regis Toomey), Border Patrolman on the Mexican border, is preparing for the homecoming of his sister Barbara (Lois January) from a fashionable school. His dog Rinty is even gathering flowers in anticipation of her arrival. Border Patrolman Ed (Jack Mulhall) drops by to tell Bob that Zorro (Jack Mower), a notorious smuggler, has just crossed the line with a cargo of contraband. Leaving Rinty at the railroad station at the wheel of his car with a note of regret to Barbara, Bob and Ed hit the trail to catch Zorro.",
      "fileSize": 1599872496,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/SkullanCrown",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 9489
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X6NHS_SVSXE",
      "id": "X6NHS_SVSXE",
      "title": "Skull and Crown (1935) RIN TIN TIN",
      "description": "Stars: Rin Tin Tin Jr., Regis Toomey, Jack Mulhall \nDirector: Elmer Clifton\n\nRin Tin Tin brings the killer of his mistress to justice!",
      "addedAt": "2025-12-26T23:49:50.117Z",
      "thumbnail": "https://i.ytimg.com/vi/X6NHS_SVSXE/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB-gSAAuADigIMCAAQARhmIGYoZjAP&rs=AOn4CLCLSlcxM2nkcEmp7SGsb-fsDAAY_w",
      "duration": 3413,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hq2GJqnxPro",
      "id": "hq2GJqnxPro",
      "title": "Skull and Crown (1935) Action, Adventure, Romance",
      "description": "Rin-Tin-Tin, Jr. in a riot of Crashing Action!  Rin-Tin-Tin brings the killer of his mistress to justice.\n\nDirector: Elmer Clifton\nWriters: James Oliver Curwood, Carl Krusada\nStars: Rin Tin Tin Jr., Regis Toomey, Jack Mulhall\nGenres: Classics, Action, Adventure, Romance, Western  \n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:51:06.200Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/hq2GJqnxPro/maxresdefault.webp?v=61eee078",
      "duration": 3327,
      "language": "en",
      "year": 1935,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "56 min",
    "imdbRating": 5.5,
    "imdbVotes": 116,
    "Genre": "Action, Adventure, Romance",
    "Plot": "Bob Franklin, Border Patrolman on the Mexican border, is preparing for his sister Barbara's homecoming from a fashionable school; his dog Rinty is even gathering flowers in anticipation of her arrival. Border Patrolman Ed drops by to tell Bob that notorious smuggler Zorro has just crossed the line with a cargo of contraband. Leaving Rinty at the railroad station at the wheel of his car with a note of regret for Barbara, Bob and Ed hit the trail to catch Zorro. They capture the truck and its driver, Matt Brent, but Zorro escapes on foot. Meanwhile, Barbara has arrived and taken herself and Rinty to Bob's cabin, and Zorro shows up, decides that driving is better than walking, and enters the cabin bent on getting the keys. Rinty valiantly defends Barbara, but Zorro stuns him and murders her. Bob arrives and, unaware that Rinty put up a good fight before being knocked out, kicks him out of the cabin in contempt and anger. Bob resigns from the service and, masquerading as a smuggler named Rocky Morgan and friend of the captured Matt, he goes to \"Skull and Crown\", a fashionable resort owned by John Norton, whom Zorro and his gang are holding hostage there along with his daughter Ann, while they themselves enjoy the resort. Faithful Rinty has not renounced his devotion to Bob; having followed him there, he's promptly captured. Henchman Jennings, who was with Zorro at the cabin and recognizes the dog, and knowing that Rinty will go to his master, lines up all the gang including the newly-inducted Bob, with instructions to another henchmen--evidently the only one he trusted--to shoot down the first man the dog recognizes. Having seen this before (or been told about it by Rin-Tin-Tin the Elder), snubs everybody, especially Bob. Meanwhile, the Border Patrol has purposely released Matt in order to follow him to the hideout, but they lose him and Matt shows up and blows the whistle on Bob. Imprisioned, Bob awaits Zorro's arrival, as Zorro has a rule against killing anybody when he isn't around to take part. Worst of all, Rinty is all tied up and can't help his master.",
    "Director": "Elmer Clifton",
    "Writer": "James Oliver Curwood, Carl Krusada, Bennett Cohen",
    "Actors": "Rin Tin Tin Jr., Regis Toomey, Jack Mulhall",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028776",
    "tt0029830",
    "tt0026216",
    "tt0282813",
    "tt0029130",
    "tt0032642",
    "tt0026038",
    "tt0026937",
    "tt0026177",
    "tt0029847",
    "tt0030798",
    "tt0024936"
  ],
  "collections": [
    {
      "id": "cloak-and-dagger",
      "name": "Cloak and Dagger"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.869Z"
}