{
  "imdbId": "tt0013688",
  "title": "The Toll of the Sea",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheTollOfTheSeanovember261922",
      "id": "TheTollOfTheSeanovember261922",
      "title": "The Toll of the Sea",
      "description": "From the Wikipedia entry for \"The Toll of the Sea\": \"The Toll of the Sea is a 1922 American motion picture, directed by Chester M. Franklin, produced by the Technicolor Motion Picture Corporation, and released by Metro Pictures in 1922, featuring Anna May Wong in her first leading role. It was the eighth color feature film, the second Technicolor feature, the first color feature made in Hollywood, and the first color feature anywhere that did not require a special projector to be shown. The original camera negative survives except for the final 2 reels. In 1985 the UCLA Film and Television Archive preserved the film from the original 35 mm nitrate negative. Because modern film technology was used to create a color print instead of the original Technicolor Process 2, which involved cementing together two film strips base to base, the resulting image quality is likely better than the original prints appeared.\" Original text can be found at http://en.wikipedia.org/wiki/The_Toll_of_the_Sea License terms for re-use of this text can be found at http://creativecommons.org/licenses/by-sa/3.0/",
      "fileSize": 1445887581,
      "addedAt": "2026-01-07T00:07:05.037Z",
      "thumbnail": "https://archive.org/services/img/TheTollOfTheSeanovember261922",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 23262
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-toll-of-the-sea",
      "id": "silent-the-toll-of-the-sea",
      "title": "The Toll of the Sea",
      "fileSize": 1114060654,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-toll-of-the-sea",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 5054
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-toll-of-the-sea-1922-2160p-60fps",
      "id": "the-toll-of-the-sea-1922-2160p-60fps",
      "title": "The Toll Of The Sea (1922)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The second Technicolor film ever, The Toll of the Sea is also the first film that star Anna May Wong had a leading role. The story is a drama-tragedy that displays the horror and cost of racism through the American characters while also showing the humanity of the lead. The film was originally thought to be lost, but was discovered and restored by UCLA in 1985. Sourced from \"Gene Smiley\" Youtube: https://www.youtube.com/watch?v=6EwwFFKO1q0",
      "fileSize": 9786772640,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-toll-of-the-sea-1922-2160p-60fps",
      "language": "eng",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 94
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "54 min",
    "imdbRating": 6.6,
    "imdbVotes": 913,
    "Genre": "Drama, Family, Fantasy",
    "Plot": "When young Lotus Flower sees an unconscious man floating in the water near the seashore, she quickly gets help for him. The man is Allen Carver, an American visiting China. Soon the two have fallen in love, and Carver promises to take her with him when he returns home. But Carver's friends discourage him from doing this, and he returns to the USA alone. By the time the two of them meet again, much has changed, and their reunion proves very trying for them both.",
    "Director": "Chester M. Franklin",
    "Writer": "Frances Marion",
    "Actors": "Anna May Wong, Kenneth Harlan, Beatrice Bentley",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0017033",
    "tt0066344",
    "tt0026972",
    "tt10399114",
    "tt0772176",
    "tt1646876",
    "tt0014249",
    "tt0012364",
    "tt0014721",
    "tt0014509",
    "tt0012349",
    "tt0440877"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}