{
  "imdbId": "tt0057598",
  "title": "Toys in the Attic",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/toys-in-the-attic-1963",
      "id": "toys-in-the-attic-1963",
      "title": "Toys In The Attic (1963) Dean Martin · Geraldine Page",
      "description": "A chamber drama adaptation of a stage play by Lillian Hellman: The morbid, selfish love of a woman in New Orleans for her married brother, whose marriage she destroyed in order to have him all to herself.",
      "fileSize": 3632076474,
      "addedAt": "2026-01-07T00:12:44.285Z",
      "thumbnail": "https://archive.org/services/img/toys-in-the-attic-1963",
      "language": "eng",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 419
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "90 min",
    "imdbRating": 6.7,
    "imdbVotes": 1376,
    "Genre": "Drama",
    "Plot": "Newlyweds Julian and Lily Berniers have been in Chicago on business before returning to their hometown, New Orleans, where they'll meet with Julian's older spinster sisters Anna and Carrie, who still live in the longtime unpaid-for family home and have always kept their little brother Julian afloat during his wheelings and dealings. Julian has largely kept Lily in the dark about his activities, including the mysterious meetings he has had in New Orleans in the week prior to meeting up with Anna and Carrie. Despite losing the factory in Chicago, Julian comes bearing expensive gifts for his sisters, including paying off the house and sending them on a trip to Europe, something they've long wished to do. This money makes Lily think that her wealthy mother, Albertine Prine, might have paid Julian to marry her to get rid of her. Things change for the women in Julian's life when they learn that he's been meeting Charlotte Warkins, whom he dated 10 years ago. Lily suspects that Julian and married Charlotte are having an affair, but Carrie actually knows the truth, though through secondhand means. In her obsessive, more-than-a-sibling love for Julian, Carrie decides to take matters into her own hands to have Julian all to herself.",
    "Director": "George Roy Hill",
    "Writer": "Lillian Hellman, James Poe",
    "Actors": "Dean Martin, Geraldine Page, Yvette Mimieux",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 3 nominations total"
  },
  "relatedMovies": [
    "tt0058756",
    "tt0055905",
    "tt0057415",
    "tt0056810",
    "tt0178515",
    "tt0057062",
    "tt0057207",
    "tt12658952",
    "tt0056656",
    "tt0056937",
    "tt0315164",
    "tt0184086"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}