{
  "movieId": "tt0013674",
  "title": "The Three Must-Get-Theres",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-three-must-get-theres",
      "id": "silent-the-three-must-get-theres",
      "title": "The Three Must-Get-Theres",
      "fileSize": 715203952,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-three-must-get-theres",
      "language": "English",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 515
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "58 min",
    "imdbRating": 6.9,
    "imdbVotes": 645,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "This delightful burlesque of Alexandre Dumas' famous adventure narrative (and then-leading screen swashbuckler Douglas Fairbanks' hit films) represented one of writer/director/star Max Linder's attempts to conquer Hollywood on its own turf. He'd been an enormous star in early silent cinema, influencing the style of such subsequent silent comedy luminaries as Charles Chaplin and Buster Keaton. But his health suffered after he was gassed fighting for France in World War I. Despite the support of Chaplin himself (among others), his subsequent career in America never reached the popular heights he had at home. The commercial failure of this final U.S. effort seems particularly bewildering now, since THE THREE MUST-GET-THERES holds up so well. This spoof has the antic star as Dart-in-Again, a rapier-wielding dandy with a lovelorn horse (pining for the cow it left behind in the country) and a tendency to make an idiot of himself whilst attempting to conquer the forces of tyranny. Making scant effort to hide its incongruous modern Southern California backdrops, the movie is full of gags both slapstick and absurdist. Critics gratefully received it at the time. Audiences? Not so much. - Dennis Harvey",
    "Director": "Max Linder",
    "Writer": "Alexandre Dumas, Max Linder, Tom Miranda",
    "Actors": "Max Linder, Bull Montana, Frank Cooke",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0012642",
    "tt0011948",
    "tt0127834",
    "tt0015163",
    "tt0015772",
    "tt0017925",
    "tt0023243",
    "tt0041098",
    "tt0046414",
    "tt0066565",
    "tt0039133",
    "tt0023808"
  ],
  "collections": [
    {
      "id": "cloak-and-dagger",
      "name": "Cloak and Dagger"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}