{
  "imdbId": "tt0059936",
  "title": "Patriotism",
  "year": 1966,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/patriotism_202103",
      "id": "patriotism_202103",
      "title": "Patriotism",
      "description": "Playwright and novelist Yukio Mishima foreshadowed his own violent suicide with this ravishing short feature, his only foray into filmmaking, yet made with the expressiveness and confidence of a true cinema artist. All prints of  Patriotism  ( Yûkoku ), which depicts the seppuku of an army officer, were destroyed after Mishima's death in 1970, though the negative was saved, and the film resurfaced thirty-five years later. New viewers will be stunned at the depth and clarity of Mishima's vision, as well as his graphic depictions of sex and death.",
      "fileSize": 2256196706,
      "addedAt": "2026-01-07T00:10:12.697Z",
      "thumbnail": "https://archive.org/services/img/patriotism_202103",
      "language": "jpn",
      "year": 1966,
      "collection": "feature_films",
      "downloads": 7157
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "30 min",
    "imdbRating": 7.4,
    "imdbVotes": 2091,
    "Genre": "Drama, Short",
    "Plot": "Two characters on a Noh stage dramatize the rite of love and death of Lieutenant Shinji Takeyama and his wife Reiko. Takeyama was one of a cadre of young officers who staged a coup d'état in February, 1936. He was not arrested when the coup failed, but as an officer of the palace guard, he knew he would be given the order to execute his friends. The night before the execution, he and his wife prepare for hara-kiri, first with passion without shyness, then in uniform and kimono with sword and dagger. Calligraphy figures in the preparation, as Reiko gathers her keepsakes to give to survivors. They embrace in death.",
    "Director": "Yukio Mishima",
    "Writer": "Yukio Mishima",
    "Actors": "Yukio Mishima, Yoshiko Tsuruoka",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0260221",
    "tt0313018",
    "tt12658952",
    "tt0259898",
    "tt0060107",
    "tt0001032",
    "tt0001265",
    "tt0001431",
    "tt0002381",
    "tt1419606",
    "tt0002054",
    "tt0001150"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.697Z"
}