{
  "imdbId": "tt0016104",
  "title": "The Merry Widow",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-merry-widow-1925-directed-by-erich-von-stroheim-starring-mae-murray-john-gil",
      "id": "the-merry-widow-1925-directed-by-erich-von-stroheim-starring-mae-murray-john-gil",
      "title": "The Merry Widow (1925)",
      "description": "When Prince Danilo falls in love with American dancer Sally O’Hara, his uncle, King Nikita I of Monteblanco, forbids him to marry her because Sally is a commoner. Thinking she has been jilted by her prince, Sally marries wealthy Baron Sadoja. When the elderly man dies suddenly, Sally must be wooed all over again by Danilo.",
      "fileSize": 1927348307,
      "addedAt": "2026-01-07T00:12:22.154Z",
      "thumbnail": "https://archive.org/services/img/the-merry-widow-1925-directed-by-erich-von-stroheim-starring-mae-murray-john-gil",
      "collection": "feature_films",
      "downloads": 2776
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-merry-widow-1925_202507",
      "id": "the-merry-widow-1925_202507",
      "title": "The Merry Widow (1925)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. Erich von Stroheim's final fully silent picture, The Merry Widow was a massive critical and financial hit upon release. In fact, it was his most successful film, which was quite a boon to his reputation after the box office failure of Greed just one year earlier. The story follows two rival princes who both fall in love with the same girl, a theater performer, and their attempts to woo her. Even as an overwhelming success, the studio refused to work with Stroheim again due to the sexually explicit scenes and tonal changes he had made to the original story. I've uploaded two versions of the film here. One has a quaint but dated soundtrack. The other has a much improved soundtrack, but a shorter runtime, and also has French subtitles \"burnt-in\" to the intertitle cards. ",
      "fileSize": 3347425607,
      "addedAt": "2026-01-07T00:12:22.154Z",
      "thumbnail": "https://archive.org/services/img/the-merry-widow-1925_202507",
      "language": "eng",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 111
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "137 min",
    "imdbRating": 7.2,
    "imdbVotes": 2641,
    "Genre": "Drama, Romance",
    "Plot": "Prince Danilo falls in love with dancer Sally O'Hara. His uncle, King Nikita I of Monteblanco forbids the marriage because she is a commoner. Thinking she has been jilted by her prince, Sally marries old, lecherous Baron Sadoja, whose wealth has kept the kingdom afloat. When he dies suddenly, Sally must be wooed all over again by Danilo.",
    "Director": "Erich von Stroheim",
    "Writer": "Erich von Stroheim, Benjamin Glazer, Viktor Léon",
    "Actors": "Mae Murray, John Gilbert, Roy D'Arcy",
    "Language": "None",
    "Country": "United States",
    "Awards": "3 wins"
  },
  "relatedMovies": [
    "tt0009937",
    "tt0015624",
    "tt0014972",
    "tt0015881",
    "tt0015693",
    "tt0016548",
    "tt0016473",
    "tt0220305",
    "tt0015627",
    "tt0016005",
    "tt0016491",
    "tt0016198"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.154Z"
}