{
  "movieId": "tt0087553",
  "title": "The Killing Fields",
  "year": 1984,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-killing-fields.-1984",
      "id": "the-killing-fields.-1984",
      "title": "The Killing Fields (1984)",
      "description": "The Killing Fields is a powerful drama based on the true story of the Cambodian genocide during the Khmer Rouge regime in the 1970s. The film primarily follows the relationship between two journalists in Cambodia: Sydney Schanberg , played by Sam Waterston, and Dith Pran , portrayed by Haing S. Ngor. The film is set during the Cambodian Civil War, leading to the rise of the Khmer Rouge and the subsequent reign of terror that claimed millions of lives.Sydney, a New York Times reporter, forms a close bond with Dith, who serves as his interpreter and guide. Their friendship highlights the differences in their backgrounds and experiences.As the Khmer Rouge takes control of Cambodia, the situation becomes increasingly dangerous. Schanberg realizes the extent of the atrocities occurring under the regime, while Dith faces the threat of persecution due to his association with Westerners.Amidst the chaos, Dith is captured by the Khmer Rouge, leading to a heartbreaking separation from Sydney. The film poignantly depicts the fear and uncertainty of Dith's fate as he endures life in a brutal labor camp.The latter part of the film focuses on Schanberg’s struggle to escape and his persistent efforts to locate Dith after the war. Dith's harrowing experiences are revealed in flashbacks, showing the brutality he faces, including starvation and forced labor. Ultimately, Dith manages to escape the camp and reunites with Sydney, symbolizing hope and resilience amidst immense suffering.",
      "fileSize": 1247541691,
      "addedAt": "2026-01-07T00:12:10.589Z",
      "thumbnail": "https://archive.org/services/img/the-killing-fields.-1984",
      "language": "eng",
      "year": 1984,
      "collection": "feature_films",
      "downloads": 521
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "141 min",
    "imdbRating": 7.8,
    "imdbVotes": 61830,
    "Genre": "Biography, Drama, History",
    "Plot": "Sydney Schanberg is a New York Times journalist covering the civil war in Cambodia. Together with the local journalist Dith Pran, they cover some of the tragedy and madness of the war. When the American forces leave, Dith Pran sends his family with them, but stays behind himself to help Schanberg cover the event. As an American, Schanberg won't have any trouble leaving the country, but the situation is different for Pran; he's a local, and the Khmer Rouge are moving in.",
    "Director": "Roland Joffé",
    "Writer": "Bruce Robinson",
    "Actors": "Sam Waterston, Haing S. Ngor, John Malkovich",
    "Language": "English, French, Central Khmer, Russian",
    "Country": "United Kingdom",
    "Awards": "Won 3 Oscars. 28 wins & 24 nominations total"
  },
  "relatedMovies": [
    "tt0086891",
    "tt0085622",
    "tt1316616",
    "tt1441953",
    "tt0045473",
    "tt0060107",
    "tt0024966",
    "tt0266425",
    "tt0033451",
    "tt9071322",
    "tt0007801",
    "tt0053800"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.589Z"
}