{
  "imdbId": "tt0028342",
  "title": "Taming the Wild",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Taming_The_Wild36",
      "title": "Taming The Wild36",
      "description": "Title: Taming the Wild Summary: Madcap society girl June Bolton has a talent for trouble. Trying to evade a subpoena in connection with one of her misadventures, she winds up in jail and has to be bailed out by the family... Directed by: Robert F. Hill Actors: Production Company: Victory Pictures Corporation Release Date: 15 February 1936 (USA) Aspect Ratio: 1.37 : 1 Madcap society girl June Bolton has a talent for trouble. Trying to evade a subpoena in connection with one of her misadventures, she winds up in jail and has to be bailed out by the family attorney, Dick Clayton. But June is soon in trouble again, this time involved with a mob boss and a shady lady. Exasperated by his wealthy client's reckless escapades, Clayton determines to quit... until he realizes he has fallen in love with the little madcap.",
      "id": "Taming_The_Wild36"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Luqjcc7W_7w",
      "title": "Taming the Wild (1936) ROM-COM",
      "description": "Stars: Maxine Doyle, Rod La Rocque, Barbara Pepper\nDirector: Robert F. Hill\n\nA madcap socialite has a talent for landing in jail, and every time she is bailed out her family's attorney. Exasperated, the man decides to quit until he realizes he has fallen in love with her.",
      "id": "Luqjcc7W_7w",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "55 min",
    "imdbRating": "5.8",
    "imdbVotes": "62",
    "Genre": "Comedy, Crime, Romance",
    "Plot": "June Bolton (Maxine Doyle) is strong-willed, beautiful, reckless girl,blessed with money and a fond mother, Mrs. Elizabeth Bolton (Zella Russell), who knows not the first principle of maternal rule. Emerging from a reckless, on her part, automobile wreck and escaping the police, she is sought by police detectives as she escapes to Los Angeles. Her mother, a passenger aboard the incoming steamship Melolo, learns of June's latest escapade by cable and she wires the family legal adviser, Dick Clayton (Rod LaRocque), to find June and guard her until she arrives home. Clayon catches up with June in a downtown hotel but, already, Jimmy Taylor, a tabloid newspaper reporter, has also located her and headline again threaten the family name. In front of the hotel, June escapes Clayton by jumping into a limousine and rides away with Bret Graham, a charming but vicious racketeer. Clayton follows her to Graham's notorious inn, the Red Mill, where June has instantly acquired the friendship of Hazel White (Barbara Pepper), a dancer. Clayton arrives and he and Graham have a fistfight and,in the confusion, June and Hazel are arrested. Steve McDonald, a Graham henchman, who is in love with Hazel, bails both girls out of jail. The enraged Graham orders Steve to \"take Clayton for a one-way ride\" but allows Clayton to escape. This enrages Graham to the point that he murders Steve. June now finds herself caught in the midst of Los Angeles crime but more than ever determined to have her fill of adventure. She bitterly resents Clayton's attempts to get her out of the wild-side life, slaps him and dismisses him as her attorney. The resigned and hopeless Clayton does so. Riding with Graham and Hazel, June is a witness as Graham's gangster enemy, Red Hogan (Vincent Dennis) fires a hail of lead into the car, striking the racketeer down, Graham recuperates at a hospital and Junes finds her name in the news again. Hogan determines to silence June and goes to her hotel room. Clayton breaks in as Hogan is overpowering June with brutal strength. Clayton put the gangster down as the police arrive, June laughs. \"The man doesn't live who can tame me,\" she taunts Clayton. Clayton seizes her and takes a hair brush from the dressing table. He then delivers a a sound spanking to June and it has a sobering effect. June calls him back as he is leaving and hands him the spanking brush. \"Perhaps,\"she tells him, \"you'll need it again.\"",
    "Director": "Robert F. Hill",
    "Writer": "Peter B. Kyne, Al Martin",
    "Actors": "Rod La Rocque, Maxine Doyle, Barbara Pepper",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0027515",
      "title": "Desire",
      "year": 1936,
      "imdbRating": "7.1",
      "imdbVotes": "3,153",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026863",
      "title": "The Perfect Clue",
      "year": 1935,
      "imdbRating": "5.7",
      "imdbVotes": "84",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032428",
      "title": "East Side Kids",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "292",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025755",
      "title": "Search for Beauty",
      "year": 1934,
      "imdbRating": "6.0",
      "imdbVotes": "760",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025612",
      "title": "The Outcast",
      "year": 1934,
      "imdbRating": "5.5",
      "imdbVotes": "29",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028241",
      "title": "Shadow of Chinatown",
      "year": 1936,
      "imdbRating": "4.5",
      "imdbVotes": "303",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027839",
      "title": "Kelly of the Secret Service",
      "year": 1936,
      "imdbRating": "4.9",
      "imdbVotes": "35",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0028140",
      "title": "Prison Shadows",
      "year": 1936,
      "imdbRating": "4.6",
      "imdbVotes": "159",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028396",
      "title": "Too Much Beef",
      "year": 1936,
      "imdbRating": "5.8",
      "imdbVotes": "49",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0029701",
      "title": "Two Minutes to Play",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "36",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0028637",
      "title": "Blake of Scotland Yard",
      "year": 1937,
      "imdbRating": "5.0",
      "imdbVotes": "194",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032602",
      "title": "Hold That Woman!",
      "year": 1940,
      "imdbRating": "5.6",
      "imdbVotes": "182",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:31:09.203Z"
}