{
  "movieId": "tt0013515",
  "title": "The Prisoner of Zenda",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThePrisonerOfZenda",
      "id": "ThePrisonerOfZenda",
      "title": "\"The Prisoner of Zenda\" (1922)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Prisoner of Zenda\" is a drama, adventure, romance and a swashbuckler featuring Snitz Edwards, a star of Silent Hall of Fame. Directed by                Rex Ingram Produced by              Metro Pictures Corporation Scenario by                 Mary O’Hara Based on                     the novel The Prisoner of Zenda by Anthony Hope Starring                       Lewis Stone, Alice Terry, Robert Edeson, Stuart Holmes, Ramon Novarro, Barbara La Marr, Malcolm McGregor, Snitz Edwards Cinematography        John F. Seitz Distributed by           Metro Pictures Corporation Release date               September 11, 1922 Running time             113 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 1213345395,
      "addedAt": "2026-01-07T00:07:05.035Z",
      "thumbnail": "https://archive.org/services/img/ThePrisonerOfZenda",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 18285
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-prisoner-of-zenda",
      "id": "silent-the-prisoner-of-zenda",
      "title": "The Prisoner of Zenda",
      "fileSize": 4149129220,
      "addedAt": "2026-01-07T00:11:24.923Z",
      "thumbnail": "https://archive.org/services/img/silent-the-prisoner-of-zenda",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 1336
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "125 min",
    "imdbRating": 6.7,
    "imdbVotes": 544,
    "Genre": "Adventure, Romance",
    "Plot": "Upon the death of his father the King, Rudolph V is set to assume the throne of Ruritania. Both he and his half-brother, Grand Duke Michael, love Princess Flavia, their orphaned cousin who lives in a wing of the palace located in the Ruritanian capital of Strelsau. While half the populace favor the King and the other half the Grand Duke, the entire populace loves Flavia. She is attracted to the Grand Duke's magnetism, but she, in a sense of obligation to her country to support his reign, believes that she will marry the King despite she not being in love with him due to he indulging excessively in his vices, such as the drink, and thus often acting irresponsibly and not in the manner of a king. The Grand Duke, with his longtime faithful companions De Gautet, Bersonin, Detchard, and Rupert of Hentzau, plan to detain the King at the Grand Duke's hunting lodge on the grounds of his castle at Zenda on the day of the coronation so that Michael can assume the throne in Strelsau in his place. Complicating this plan is the arrival into Ruritania of British gentry Rudolf Rassendyll the day before the coronation, he having been fascinated with everything Ruritanian ever since he learned of the purported blood connection between the English Rassendylls and the Ruritanian royal family, the Elphbergs. The complicating factor is that Rassendyll bears a striking resemblance to the King. Upon meeting Rassendyll, two of the King's faithful aides, Colonel Zapt and Captain Fritz von Tarlenheim, ask him, due to the extenuating circumstances, to impersonate the King at the coronation, to which Rassendyll reluctantly agrees. Further complicating the situation is that Rassendyll, as the King, falls immediately in love with Flavia, who in turns falls in love with the new man she believes the King has transformed into. Beyond the dangers posed to the King by the Grand Duke and his men, Rassendyll's life, by association is also in danger, especially if the Grand Duke discovers the switched identities. The wild card in this maze is Parisienne Antoinette de Mauban, also in Ruritania for the coronation, she who personally knows Rassendyll, who is love with the Grand Duke herself but does not know of his want to marry Flavia, and who is the unrequited object of affection of Rupert.",
    "Director": "Rex Ingram",
    "Writer": "Anthony Hope, Mary O'Hara, Edward E. Rose",
    "Actors": "Lewis Stone, Alice Terry, Robert Edeson",
    "Language": "None",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0012190",
    "tt0014440",
    "tt0012068",
    "tt0013556",
    "tt0012657",
    "tt0012675",
    "tt0014496",
    "tt0011439",
    "tt0015310",
    "tt0011474",
    "tt0014679",
    "tt0009900"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.923Z"
}