{
  "imdbId": "tt0012538",
  "title": "Outside the Law",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OutsideTheLaw",
      "id": "OutsideTheLaw",
      "title": "Outside The Law",
      "description": "Outside the Law is a 1920 crime film directed by Tod Browning. Browning remade the film in 1930. Black Mike (Lon Chaney) is a despicable gangster who lures Molly (Priscilla Dean), the daughter of a San Francisco underworld leader, back to a life of crime. Mike frames Molly's father for murder and then plots to double-cross her as well. But Molly's hard heart is slowly melted by her gangster lover. The film ends with in a climactic shootout. The print in a little murky so some title cards are difficult to read. Adjusting contrast should fix this.",
      "fileSize": 1807276919,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/OutsideTheLaw",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 26456
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_FXWkqaDAq8",
      "id": "_FXWkqaDAq8",
      "title": "Outside the Law (1920) | Colorized Public Domain Crime Drama | Directed by Tod Browning | Lon Chaney",
      "description": "Outside the Law (1920) is an American silent crime drama directed by Tod Browning and produced by Universal Pictures during the golden years of early Hollywood. Starring Priscilla Dean, Lon Chaney, and Wheeler Oakman, this film explores betrayal, morality, and the search for redemption within the gritty world of San Francisco’s Chinatown. This restored and colorized edition revives a groundbreaking classic that helped define the crime genre and cement Lon Chaney’s reputation as one of cinema’s most versatile actors.\n\nPlot Summary:\nThe story centers on Molly Madden, known as \"Silky Moll\" (Priscilla Dean), the daughter of gangster Silent Madden (Ralph Lewis). After a life steeped in crime, she is influenced by Chang Lo (E. Alyn Warren), a wise Confucian philosopher who urges her to leave her criminal path behind. Silky tries to reform, but her past comes back to haunt her when she and her partner Dapper Bill Ballard (Wheeler Oakman) become entangled in a heist.\n\nStanding in their way is Black Mike Sylva (Lon Chaney), a ruthless gangster who seeks to destroy Molly and reclaim dominance in the underworld. Chaney’s portrayal of Sylva is one of his most chilling early performances, embodying greed and brutality. His role contrasts with that of Chang Lo, whose teachings about honesty and morality underscore the film’s deeper message.\n\nAs betrayal and greed spiral into violence, Molly faces a choice between staying in the world of crime or embracing redemption. The climactic scenes deliver a mix of suspense and moral reckoning, making Outside the Law one of the first Hollywood films to explore the psychological dimensions of crime rather than simply glorifying it.\n\nCast and Crew:\n• Director: Tod Browning\n• Producer: Carl Laemmle\n• Screenplay: Tod Browning, Lucien Hubbard\n• Cinematography: William Fildew\nStarring:\n• Priscilla Dean as Molly \"Silky Moll\" Madden\n• Lon Chaney as Black Mike Sylva and Ah Wing\n• Wheeler Oakman as Dapper Bill Ballard\n• Ralph Lewis as Silent Madden\n• E. Alyn Warren as Chang Lo\n• Stanley Goethals as The Kid\n\nFilm Significance:\nOutside the Law is historically important as one of Tod Browning’s earliest collaborations with Lon Chaney, predating their later masterpieces The Unholy Three (1925) and the legendary Dracula (1931). The film was groundbreaking for presenting Chinese characters in a dignified and philosophical light, which was highly unusual for its time in Hollywood.\n\nChaney’s dual performance as both the villainous Black Mike Sylva and the Chinese servant Ah Wing demonstrated his early mastery of makeup and character transformation, earning him recognition as the \"Man of a Thousand Faces.\" Priscilla Dean, meanwhile, was one of Universal’s biggest stars in the 1920s, and this film solidified her reputation as a leading actress in crime and melodrama stories.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Outside the Law remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1920 release was in black and white, as was standard for silent cinema. While authentic, silent black-and-white films often appear dated to modern viewers. By colorizing and digitally enhancing Outside the Law, we create a vivid and accessible version of this classic crime drama. This edition makes it easier for contemporary audiences in the United States, Europe, and beyond to connect with the performances, the settings of San Francisco, and the emotional weight of the story.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from silent crime thrillers to dramatic historical epics. Our work ensures that these treasures remain discoverable, enjoyable, and preserved for audiences worldwide.\n\n#OutsideTheLaw #LonChaney #TodBrowning #SilentCrimeFilm #PriscillaDean #1920sCinema #PublicDomainMovie #ColorizedClassic #SilentDrama #FilmRestoration #ClassicCinema",
      "addedAt": "2025-12-24T00:49:18.371Z",
      "thumbnail": "https://i.ytimg.com/vi/_FXWkqaDAq8/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBMKD8wDw==&rs=AOn4CLCYYcXhwhpeqyx0C7JVz8e75I7yiA",
      "duration": 4475,
      "language": "en",
      "year": 1920,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/outsidelaw4k",
      "id": "outsidelaw4k",
      "title": "Outside The Law (1921) [Colorized, 4K, 60FPS]",
      "description": "Outside The Law is a 1921 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io A.I. Upscaling to 4K:  https://ffmpeg.org GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6455428957,
      "addedAt": "2026-01-07T00:10:12.694Z",
      "thumbnail": "https://archive.org/services/img/outsidelaw4k",
      "collection": "feature_films",
      "downloads": 92
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-outside-the-law",
      "id": "silent-outside-the-law",
      "title": "Outside the Law",
      "fileSize": 1787191857,
      "addedAt": "2026-01-07T00:11:07.410Z",
      "thumbnail": "https://archive.org/services/img/silent-outside-the-law",
      "language": "English",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 596
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nHOhPcKH4K0",
      "id": "nHOhPcKH4K0",
      "title": "Outside the Law (1920) Lon Chaney - Crime, Romance, Thriller, Silent Film",
      "description": "In this early collaboration with director Tod Browning (Dracula, Freaks), Chaney delivers a dual performance of dramatic intensity, starring as Ah Wing, a kind-hearted student of Confucian philosophy, and Black Mike Sylva, a murderous rake of the San Francisco underworld.\n\nDirector: Tod Browning\nWriters: Gardner Bradford, Tod Browning \nStars: Priscilla Dean, Wheeler Oakman, Lon Chaney\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:47:05.339Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/nHOhPcKH4K0/maxresdefault.webp?v=61f2ac10",
      "duration": 4511,
      "language": "en",
      "year": 1920,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "75 min",
    "imdbRating": 6.5,
    "imdbVotes": 770,
    "Genre": "Crime, Romance, Thriller",
    "Plot": "In this early collaboration with director Tod Browning (Dracula, Freaks), Chaney delivers a dual performance of dramatic intensity, starring as Ah Wing, a kind-hearted student of Confucian philosophy, and Black Mike Sylva, a murderous rake of the San Francisco underworld.",
    "Director": "Tod Browning",
    "Writer": "Gardner Bradford, Tod Browning, Lucien Hubbard",
    "Actors": "Priscilla Dean, Wheeler Oakman, Lon Chaney",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010890",
    "tt0016473",
    "tt0020581",
    "tt0020197",
    "tt0018528",
    "tt0018097",
    "tt0009905",
    "tt0009894",
    "tt0013086",
    "tt0013719",
    "tt0022662",
    "tt0022002"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.410Z"
}