{
  "movieId": "tt0048933",
  "title": "Street of Shame",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/street-of-shame",
      "id": "street-of-shame",
      "title": "Street Of Shame",
      "description": "For his final film, Mizoguchi brought a lifetime of experience to bear on the heartbreaking tale of a brothel full of women whose dreams are constantly being shattered by the socioeconomic realities surrounding them. Set in Tokyo’s Red Light District (the literal translation of the Japanese title),  Street of Shame  was so cutting, and its popularity so great, that when an antiprostitution law was passed in Japan just a few months after the film's release, some said it was a catalyst.",
      "fileSize": 7059585765,
      "addedAt": "2026-01-07T00:11:35.630Z",
      "thumbnail": "https://archive.org/services/img/street-of-shame",
      "language": "jpn",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 9439
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "86 min",
    "imdbRating": 7.8,
    "imdbVotes": 5150,
    "Genre": "Drama",
    "Plot": "Five prostitutes work at Dreamland, in Tokyo's Yoshiwara district. As the Diet considers a ban on prostitution, the women's daily dramas play out. Each has dreams and motivations. Hanae is married, her husband unemployed; they have a young child. Yumeko, a widow, uses her earnings to raise and support her son, who's now old enough to work and care for her. The aging Yorie has a man who wants to marry her. Yasumi saves money diligently to pay her debt and get out; she also has a suitor who wants to marry her, but she has other plans for him. Mickey seems the most devil-may-care, until her father comes from Kobe to bring her news of her family and ask her to come home.",
    "Director": "Kenji Mizoguchi",
    "Writer": "Masashige Narusawa, Yoshiko Shibaki",
    "Actors": "Machiko Kyô, Aiko Mimasu, Ayako Wakao",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "2 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0046478",
    "tt0046851",
    "tt0047445",
    "tt0045112",
    "tt0033654",
    "tt0040980",
    "tt0028021",
    "tt0015847",
    "tt0027672",
    "tt0032156",
    "tt0020510",
    "tt0049783"
  ],
  "collections": [
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.630Z"
}