{
  "imdbId": "tt0004181",
  "title": "Judith of Bethulia",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JudithOfBethulia",
      "title": "JudithOfBethulia",
      "id": "JudithOfBethulia"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-judith-of-bethulia",
      "title": "Judith of Bethulia",
      "id": "silent-judith-of-bethulia"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Yiqixomp-wc",
      "title": "Judith of Bethulia (1914) D.W. Griffith- Drama Silent Film",
      "description": "A religious woman seeks to save her people from destruction by seducing and murdering the enemy leader, but her plans get complicated once she falls for him.\n\nDirector: D.W. Griffith\nWriters: Thomas Bailey Aldrich, D.W. Griffith \nStars: Blanche Sweet, Henry B. Walthall, Mae Marsh \nGenre:  Classics, Cult Film, Crime, Drama, Horror, Silent film\nBudget: $40,000 \n\nJoin the rest of the cult on social media :\nFacebook : https://www.facebook.com/CultCinemaClassics\nInsta : https://www.instagram.com/cultcinemaclassics -\nhttps://www.twitch.tv/cultcinema",
      "id": "Yiqixomp-wc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "61 min",
    "imdbRating": "6.2",
    "imdbVotes": "1,469",
    "Genre": "Drama",
    "Plot": "A fascinating work of high artistry, \"Judith of Bethulia\" will not only rank as an achievement in this country, but will make foreign producers sit up and take notice. It has a signal and imperative message, and the technique displayed throughout an infinity of detail, embracing even the delicate film tinting and toning, marks an encouraging step in the development of the new art. Ancient in story and settings, it is modern in penetrative interpretation - it is a vivid history of one phase of the time it concerns, and is redemptive as well as relative, a lesson from one of those vital struggles that made and unmade nations as well as individuals, yet it is not without that inspiring influence that appeals powerfully to human sense of justice. The entire vigorous action of the play works up to the personal sacrifice of Judith of Bethulia, a perilous chance she takes for the sake of the lives and happiness of her people. She dares expose herself to overwhelming humiliation and dishonor in a challenge of beauty to strength, struggles through a conversion of sentiment that makes the high crisis more acute, and sets at defiance the \"better-death-than-dishonor\" platitude, escaping both through that all-conquering combination in a woman, great physical beauty joined to lofty intelligence. She enters upon a relation of constant peril - only delicate treatment saves the situation at times - abandons her native purity of conduct and dares her own undoing, yet the noble end justified the dangerous means, and she emerges idealized by her people, an apotheosis of splendid womanhood. Bethulia is a fortified town of Judea, guarding a hill pass through which an invading Assyrian army must march in order to enter Judea. In the town lives Judith, a devout young woman of lofty character and remarkable beauty, when the place is stormed by Holofernes at the head of a large army. The fighting before the gate brings into action an enormous number of soldiers on both sides, and those engines of war, such as the battering ram and catapult, which were used by the fighting male of other days under close condition of furious combat. One desperate assault after another is repelled, scaling ladders are thrown down, great rocks are showered upon the invaders, and the wonder is that they keep at it. The reason is that Holofernes has a way of torturing and killing unsuccessful captains. As officer had better die in the thick of battle than return with a confession of defeat. Holofernes is as merciless as nature to all who fail. The great leader's brutality of his captains when they do not succeed in carrying the fortress by storm indicates what the inhabitants of Bethulia may expect in the event of capture and serves to intensify the clash of character later on - it adds peril to the undertaking of Judith when she resolves to sacrifice herself for her people. Holofernes, after making a horrible example of defeated captains by frightful torture, resorts to strategy. His soldiers have seized the wells from which the inhabitants of Bethulia obtained their water supply, and their leader adopts waiting tactics, diverting himself with dancing girls to break the tedium. Bethulia is on the verge of famine, and the besieged are almost ready to surrender the fortress and all Judea to the spoilers, when Judith goes forth in her finest raiment, accompanied only by her maid, enters the Assryian camp and obtains an interview with the merciless Holofernes. Against his formidable strength, his brutal ferocity and cunning, his absolute power, are matched her fascinating personality directed by intelligence and hidden purpose. She is willing to carry \"her fault on her shoulders like a coronation mantle.\" The dangerous and difficult situation from this point to Judith's terrible triumph and the defeat of the invading Assyrians is pictured without loss of force or charm by extreme delicacy of treatment. Beauty is constantly asserted by almost reckless prodigality in the matter of costume, and by the appeal of delightful acting. The feminine sweetness and shyness of the lovely Judith are intensified by her advances and retreats in measuring her sex attractions against his formidable power. She is weakened at the critical moment by a sudden flame of passion and compassion aroused in her breast, but self-control returns at a thought of all that is at stake, the safety and happiness of thousands of her people, and she dares be all and do all that revolts her finer nature from a deep hatred of injustice and wrong meted out to her peace-loving kindred and friends, from a noble desire to preserve her country and the destinies of her race.",
    "Director": "D.W. Griffith",
    "Writer": "Thomas Bailey Aldrich, D.W. Griffith, Grace Pierce",
    "Actors": "Blanche Sweet, Henry B. Walthall, Mae Marsh",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0003643",
      "title": "The Avenging Conscience: or 'Thou Shalt Not Kill'",
      "year": 1914,
      "imdbRating": "6.4",
      "imdbVotes": "1,502",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004972",
      "title": "The Birth of a Nation",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "26,892",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "625",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002212",
      "title": "The God Within",
      "year": 1912,
      "imdbRating": "5.6",
      "imdbVotes": "44",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002303",
      "title": "The Lesser Evil",
      "year": 1912,
      "imdbRating": "5.6",
      "imdbVotes": "204",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003167",
      "title": "Home, Sweet Home",
      "year": 1914,
      "imdbRating": "5.8",
      "imdbVotes": "274",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003075",
      "title": "The Little Tease",
      "year": 1913,
      "imdbRating": "5.7",
      "imdbVotes": "44",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003516",
      "title": "The Wanderer",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "65",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003436",
      "title": "The Telephone Girl and the Lady",
      "year": 1913,
      "imdbRating": "5.5",
      "imdbVotes": "112",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002082",
      "title": "The Burglar's Dilemma",
      "year": 1912,
      "imdbRating": "6.0",
      "imdbVotes": "429",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006864",
      "title": "Intolerance",
      "year": 1916,
      "imdbRating": "7.7",
      "imdbVotes": "17,618",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002342",
      "title": "Man's Genesis",
      "year": 1912,
      "imdbRating": "5.7",
      "imdbVotes": "112",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:59:48.514Z"
}