{
  "movieId": "tt0017894",
  "title": "Flying Luck",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/flying-luck_1927",
      "id": "flying-luck_1927",
      "title": "Flying Luck",
      "fileSize": 6293150557,
      "addedAt": "2026-01-07T00:08:24.396Z",
      "thumbnail": "https://archive.org/services/img/flying-luck_1927",
      "language": [
        "None",
        "English"
      ],
      "year": 1927,
      "collection": "feature_films",
      "downloads": 1337
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "71 min",
    "imdbRating": 6.4,
    "imdbVotes": 26,
    "Genre": "Comedy",
    "Plot": "Monty Banks wants to be like his hero Charles Lindbergh, and will do anything to learn to fly a plane. After building his own doesn't go so well, he winds up enlisting in the Army. During basic training, Monty falls in love with the Colonel's daughter (played by a young Jean Arthur), tangles with a mean drill sergeant (Kewpie Morgan) and is mistaken for a visiting French dignitary. But eventually Monty winds up in a plane and wins the big Army-Navy air polo match! On May 20, 1927 Charles Lindbergh successfully performed the first transatlantic solo flight, captivating the nation, if not the world. Two months later, motion picture trade papers announced that comedian Monty Banks' next feature-length comedy would be &lt;I&gt;An Ace in the Hole&lt;/I&gt; -- which was released on December 5, 1927 as &lt;I&gt;Flying Luck&lt;/I&gt;. This aviation-inspired comedy was the last produced of a string of Monty Banks features made 1924-27. Monty Banks entered films in 1916 and, after supporting other comedians for a few years, had a successful series of starring shorts from 1920 to 1924. Banks is probably best known for the climactic reels of his thrill comedy feature &lt;I&gt;Play Safe&lt;/I&gt; (1927), which were featured in Robert Youngson's compilation movie &lt;I&gt;The Days of Thrills and Laughter&lt;/I&gt; (1961). &lt;I&gt;Flying Luck&lt;/I&gt; capitalizes on the 1927 airplane craze and co-stars a young Jean Arthur (&lt;I&gt;Easy Living, Mr. Smith Goes to Washington, Shane&lt;/I&gt;). This extremely rare silent film has never been available on home video, and is seen here in a transfer from a rare, vintage 35mm nitrate print. BONUS: This DVD includes 40 minutes of newsreels covering Lucky Lindy's infamous flight from New York to Paris from \"weeklies\" (newsreels) produced by Kinograms, the William J. Ganz Company and Pathé News. 100 mins, B&amp;W, unrated; stereo. Musical scores copyright 2014 by Ben Model, all rights reserved. Produced",
    "Director": "Herman C. Raymaker",
    "Writer": "Monty Banks, Charles Horan, Paul Perez",
    "Actors": "Monty Banks, Jean Arthur, Jack W. Johnston",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0312544",
    "tt0020364",
    "tt0440334",
    "tt0017634",
    "tt0017765",
    "tt0018394",
    "tt0019339",
    "tt0017739",
    "tt0017926",
    "tt0017560",
    "tt0017604",
    "tt0017610"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.396Z"
}