{
  "movieId": "tt0060315",
  "title": "Django",
  "year": 1966,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/django.-1966_202512",
      "id": "django.-1966_202512",
      "title": "Django (1966)",
      "description": "Django , directed by Sergio Corbucci , is a spaghetti western film that premiered in Italy on April 6, 1966 . It stars Franco Nero in a breakthrough role, alongside Loredana Nusciak and José Bódalo . The film's plot revolves around Django, a Union soldier-turned-drifter, who becomes embroiled in a violent feud between Confederate soldiers and Mexican bandits, with an iconic coffin in tow. The film centers on Django, a mysterious man who drags a coffin behind him. After rescuing a mixed-race prostitute named María , Django becomes embroiled in the conflict between the racist ex-Confederate officer Major Jackson and a group of Mexican revolutionaries led by Hugo . As the plot unfolds, Django confronts Jackson and his gang, leading to a series of violent encounters and revenge-driven actions.",
      "fileSize": 795342939,
      "addedAt": "2026-01-07T00:08:07.359Z",
      "thumbnail": "https://archive.org/services/img/django.-1966_202512",
      "language": "ita",
      "year": 1966,
      "collection": "feature_films",
      "downloads": 804
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "91 min",
    "imdbRating": 7.2,
    "imdbVotes": 33156,
    "Genre": "Action, Drama, Western",
    "Plot": "Squelching across a God-forsaken ghost town near the US/Mexican border, always dragging a heavy coffin, blue-eyed Django, a drifting, mud-spattered, former Union soldier, saves runaway María from certain death. But, the wooden container with the mysterious content has already caught the attention of the racist ex-Confederate officer, Major Jackson, and his gang of white supremacists, and before long, things get nasty. Now, the guns have the final say, and as if that weren't enough, Jackson's sworn enemy, General Hugo Rodríguez, and his feared revolutionaries, enter the picture, wanting to have a piece of the action. Can Django, the taciturn stranger with the lighting-fast right hand, take on two armies of murderous henchmen, and live to tell the tale?",
    "Director": "Sergio Corbucci",
    "Writer": "Sergio Corbucci, Bruno Corbucci, Franco Rossetti",
    "Actors": "Franco Nero, José Canalejas, José Bódalo",
    "Language": "Italian",
    "Country": "Italy, Spain",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0060261",
    "tt0063032",
    "tt0061846",
    "tt0060897",
    "tt0061709",
    "tt0215842",
    "tt0060325",
    "tt0063293",
    "tt0061074",
    "tt0064395",
    "tt0216546",
    "tt0026846"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.359Z"
}