{
  "movieId": "tt0041204",
  "title": "Boys in Brown",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bib8874541",
      "id": "bib8874541",
      "title": "Boys in Brown",
      "description": "Title: Boys in Brown Summary: A slice of life in a British Borstal reform institution for young criminals. Directed by: Montgomery Tully Actors: Jack Warner, Richard Attenborough, Dirk Bogarde Production Company: Gainsborough Pictures Release Date: December 1949 (UK) Aspect Ratio: 1.37 : 1 During post-war England, a young petty crook, Jackie Knowles, is on probation for committing petty crimes. Jackie wants to marry his girlfriend Kitty but they don't have enough money to live on. Jackie foolishly accepts to be the getaway driver for a robbery job. The robbery goes wrong and Jackie is arrested. Because of his previous probation breach, the judge sentences him to three years in a Borstal institution. In the UK, the Borstal institutions are trying to rehabilitate rather than punish young offenders. Jackie Knowles arrives at a Borstal institution run by a sympathetic governor. Initially, Jackie intends to keep his nose clean, do his time and get out. Unfortunatelly, he falls in with a crowd planning to escape. The wrong crowd is run by scheming Welsh boy Alfie Rawlins who senses Jackie's naiveté and innocence. Alfie manipulates Jackie into wanting to join his group by playing on Jackie's anxiety about his girlfriend, Kitty. Alfie lies that Kitty already has forgotten about...",
      "fileSize": 602670494,
      "addedAt": "2026-01-07T00:07:38.716Z",
      "thumbnail": "https://archive.org/services/img/bib8874541",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 1728
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": 6.1,
    "imdbVotes": 294,
    "Genre": "Crime, Drama",
    "Plot": "During post-war England, a young petty crook, Jackie Knowles (Sir Richard Attenborough), is on probation for committing petty crimes. Jackie wants to marry his girlfriend Kitty (Barbara Murray), but they don't have enough money to live on. Jackie foolishly accepts to be the getaway driver for a robbery job. The robbery goes wrong and Jackie is arrested. Because of his previous probation breach, the judge sentences him to three years in a Borstal institution. In the U.K., the Borstal institutions are trying to rehabilitate rather than punish young offenders. Jackie Knowles arrives at a Borstal institution run by a sympathetic Governor (Jack Warner). Initially, Jackie intends to keep his nose clean, do his time and get out. Unfortunatelly, he falls in with a crowd planning to escape. The wrong crowd is run by scheming Welsh boy Alfie Rawlins (Sir Dirk Bogarde) who senses Jackie's naiveté and innocence. Alfie manipulates Jackie into wanting to join his group by playing on Jackie's anxiety about his girlfriend, Kitty. Alfie lies that Kitty already has forgotten about Jackie, and she is seeing another boy, Bill Foster (Jimmy Hanley), a former Borstal institution inmate. A paranoid Jackie decides to join Alfie's group and escape. During the escape, Jackie hits a Borstal guard, sending him to the hospital with life-threatening injuries. This could lead to murder charges, if Jackie is captured.",
    "Director": "Montgomery Tully",
    "Writer": "Reginald Beckwith, Montgomery Tully",
    "Actors": "Jack Warner, Richard Attenborough, Dirk Bogarde",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0221319",
    "tt0039220",
    "tt0040481",
    "tt0041503",
    "tt0041109",
    "tt0041268",
    "tt0041555",
    "tt0041761",
    "tt0041269",
    "tt0041786",
    "tt0042006",
    "tt0041958"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.716Z"
}