{
  "movieId": "tt0009682",
  "title": "Tarzan of the Apes",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TarzanoftheApes1918AndyDivx",
      "id": "TarzanoftheApes1918AndyDivx",
      "title": "Tarzan of the Apes",
      "description": "Original (PD) version of this classic, NOT the VHS version \"copyrighted\" in 1982. http://www.imdb.com/title/tt0009682/ At this early point in American film history, Tarzan of the Apes was an instant success. Elmo Lincoln was perhaps the best actor at the time for the role. It's a fairly straight forward telling of the novel, tho Edgar Rice Burroughs was frequently on the set in an advisory role and his input was seldom utilized. In the books, Tarzan was quite the self-made scholar and this was barely touched upon in the film. For 1918, this turned out to be an excellent film, parts of which still hold up today. It's a solid 7 out of 10, and well worth seeing.",
      "fileSize": 1345803440,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/TarzanoftheApes1918AndyDivx",
      "language": "English dialogue cards",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 230550
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z9ESB1C-V8U",
      "id": "Z9ESB1C-V8U",
      "title": "Tarzan of the Apes (1918) | Colorized Public Domain Silent Adventure | Elmo Lincoln as Tarzan",
      "description": "Tarzan of the Apes (1918) is a silent adventure film directed by Scott Sidney, adapted from the world-famous novel by Edgar Rice Burroughs. It stands as the first ever screen adaptation of the Tarzan stories and introduced audiences to the Lord of the Jungle on film. Starring Elmo Lincoln in the title role, the film became a major box-office success in its day and set the stage for one of Hollywood’s longest-running adventure franchises. This restored and colorized edition by Colorized Public Domain breathes new life into the landmark production, making it accessible for modern audiences in the United States, Europe, and worldwide. By digitally enhancing the visuals, cleaning imperfections, and adding careful colorization, we preserve the authenticity of the original while creating a more immersive experience for today’s viewers.\n\nPlot Summary:\nThe story begins with Lord and Lady Greystoke, who are stranded in the African jungle after a mutiny. Following their tragic deaths, their infant son is adopted by a tribe of great apes and raised in the wild. Growing up without knowledge of civilization, the boy becomes Tarzan (Elmo Lincoln), the legendary ape man, mastering survival in the jungle. His life changes when an expedition arrives, including Jane Porter (Enid Markey), the daughter of one of the explorers. Tarzan rescues Jane from danger, and the two form a deep connection, though Tarzan’s unfamiliarity with human society complicates their relationship.\n\nThe film features iconic moments such as Tarzan’s first interactions with humans, his daring rescues, and his discovery of his own heritage. While constrained by the technical limits of the silent era, Tarzan of the Apes delivers impressive outdoor cinematography, dramatic storytelling, and physical action sequences that brought Burroughs’ creation vividly to life for audiences in 1918.\n\nCast and Crew:\n• Director: Scott Sidney\n• Producer: William Parsons\n• Based on: Tarzan of the Apes (1912 novel) by Edgar Rice Burroughs\nStarring:\n• Elmo Lincoln as Tarzan\n• Enid Markey as Jane Porter\n• True Boardman as John Clayton, Lord Greystoke\n• Kathleen Kirkham as Lady Alice Greystoke\n• George B. French as Professor Porter\n• Colin Kenny as William Cecil Clayton\n\nFilm Significance:\nTarzan of the Apes was groundbreaking as one of the first major jungle adventure films, offering audiences exotic locations, daring stunts, and a powerful new heroic figure. Its commercial success proved the popularity of Burroughs’ character and laid the foundation for decades of Tarzan films, radio serials, and later television adaptations. Elmo Lincoln’s muscular, imposing portrayal created a template for Tarzan that influenced nearly every subsequent actor who played the role.\n\nThe production also made history as one of the first large-scale location shoots in the Louisiana swamps, which stood in for the African jungle. While primitive by today’s standards, these sequences gave the film a sense of realism and atmosphere that captivated audiences. Tarzan of the Apes remains not only a cultural milestone but also a vital artifact of the silent film era.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Tarzan of the Apes remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1918 release was a black-and-white silent film. While authentic to its era, modern audiences often skip over silent films, especially when presented in faded or degraded prints. By restoring and colorizing this foundational Tarzan adventure, we bring new visual clarity to one of cinema’s earliest blockbusters. This edition preserves the pioneering spirit of the film while making it approachable for contemporary viewers who stream on TVs, mobile devices, and computers.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten silent shorts to culturally significant adventure features. Our mission is to preserve these treasures while making them enjoyable for audiences in the USA, Europe, and worldwide.\n\n#TarzanOfTheApes #ElmoLincoln #SilentAdventure #PublicDomainMovie #ColorizedClassic #ClassicCinema #1920sFilm #EdgarRiceBurroughs #SilentFilmLegend #FilmRestoration #1918Movies #JungleAdventure",
      "addedAt": "2025-12-24T00:47:48.255Z",
      "thumbnail": "https://i.ytimg.com/vi/Z9ESB1C-V8U/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYQyBKKHIwDw==&rs=AOn4CLCPxIVxZI9Jeh-IIkF4g7gI3MLYBg",
      "duration": 3623,
      "language": "en",
      "year": 1918,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-tarzan-of-the-apes",
      "id": "silent-tarzan-of-the-apes",
      "title": "Tarzan of the Apes",
      "fileSize": 2549647988,
      "addedAt": "2026-01-07T00:11:15.974Z",
      "thumbnail": "https://archive.org/services/img/silent-tarzan-of-the-apes",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 744
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TarzanoftheApes1918_20150",
      "id": "TarzanoftheApes1918_20150",
      "title": "Tarzan of the Apes 1918",
      "description": "This movie has fallen into the Public Domain.",
      "fileSize": 906431124,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/TarzanoftheApes1918_20150",
      "collection": "feature_films",
      "downloads": 5306
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "73 min",
    "imdbRating": 5.8,
    "imdbVotes": 951,
    "Genre": "Action, Adventure",
    "Plot": "John and Alice Clayton set sail for Africa. Mutineers maroon them. After his parents die, the newborn Tarzan is taken by a great Ape, Kala. Later the boy finds his father's knife and uses it to become King of Apes. Binns, the sailor who saved the Claytons and who has been held by Arab slavers for ten years, finds the young Tarzan and then heads for England to notify his kin. A scientist arrives to check out Binns' story. Tarzan, now a man, kills the native who killed Kala; when their chief is killed the black villagers appease Tarzan with gifts and prayers. The scientist's daughter Jane is carried off by a native, rescued by Tarzan (who has burnt the native village), aggressively loved by him (\"Tarzan is a man, and men do not force the love of women\"), and at last accepts him with open arms.",
    "Director": "Scott Sidney",
    "Writer": "Edgar Rice Burroughs, Fred Miller, Lois Weber",
    "Actors": "Elmo Lincoln, Enid Markey, True Boardman",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010446",
    "tt0010708",
    "tt0006333",
    "tt0011387",
    "tt0011753",
    "tt0007260",
    "tt0006409",
    "tt0011717",
    "tt0006206",
    "tt0012739",
    "tt0012752",
    "tt0012642"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:32:12.577Z"
}