{
  "movieId": "tt0008133",
  "title": "The Immigrant",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CC_1917_06_17_TheImmigrant",
      "id": "CC_1917_06_17_TheImmigrant",
      "title": "Charlie Chaplin's \"The Immigrant\"",
      "description": [
        "Charlie Chaplin's 61st Film Released June 17 1917. The Immigrant (also called Broke) starring the Charlie Chaplin Tramp character as an immigrant coming to the United States who is accused of theft on the voyage across the Atlantic Ocean, and befriends a young woman along the way. It also stars Edna Purviance and Eric Campbell. The movie was written and directed by Chaplin. According to Kevin Brownlow and David Gill's documentary series Unknown Chaplin, the first scenes to be written and filmed take place in what became the movie's second half, in which the penniless Tramp finds a coin and goes for a meal in a restaurant, not realising that the coin has fallen out of his pocket. It was not until later that Chaplin decided the reason the Tramp was penniless was that he had just arrived on a boat from Europe, and used this notion as the basis for the first half. Purviance reportedly was required to eat so many plates of beans during the many takes to complete the restaurant sequence (in character as another immigrant who falls in love with Charlie) that she became physically ill. The scene in which Chaplin's character kicks an immigration officer was cited later as evidence of his anti-Americanism when he was forced to leave the United States in the 1950s. The film has been selected for preservation in the United States National Film Registry. http://www.imdb.com/title/tt0008133/",
        "Charlie Chaplin In The Internet Archive http://www.archive.org/details/CC_1914_02_02_MakingALiving http://www.archive.org/details/CC_1914_02_07_KidsAutoRaceAtVenice http://www.archive.org/details/CC_1914_02_09_MabelsStrangePredicament http://www.archive.org/details/CC_1914_02_28_BetweenShowers http://www.archive.org/details/CC_1914_03_02_FilmJohnny http://www.archive.org/details/CC_1914_03_16_HisFavoritePasttime http://www.archive.org/details/CC_1914_03_26_CruelCruelLove http://www.archive.org/details/CC_1914_04_04_TheLandladysPet http://www.archive.org/details/CC_1914_04_20_TwentyMinutesofLove http://www.archive.org/details/CC_1914_04_27_CaughtinaCaberet http://www.archive.org/details/CC_1914_05_07_ABusyDay http://www.archive.org/details/CC_1914_06_01_TheFatalMallet http://www.archive.org/details/CC_1914_06_11_TheKnockout http://www.archive.org/details/CC_1914_06_13_MabelsBusyDay http://www.archive.org/details/CC_1914_06_20_CharlottEtLeMannequin http://www.archive.org/details/CC_1914_07_09_LaffingGas http://www.archive.org/details/CC_1914_08_01_CharolotGargonDeTheater http://www.archive.org/details/CC_1914_08_10_FaceOnTheBarroomFloor http://www.archive.org/details/CC_1914_08_13_CharliesRecreation http://www.archive.org/details/CC_1914_08_27_TheMasquerader http://www.archive.org/details/CC_1914_08_31_TheGoodforNothing http://www.archive.org/details/CC_1914_09_07_TheRounders http://www.archive.org/details/CC_1914_09_14_TheNewJanitor http://www.archive.org/details/CC_1914_10_10_TheRivalMashers http://www.archive.org/details/CC_1914_10_26_DoughandDynamite http://www.archive.org/details/CC_1914_10_29_CharlottMabelAuxCourses http://www.archive.org/details/CC_1914_11_14_TilliesPuncturedRomance http://www.archive.org/details/CC_1914_11_07_MusicalTramps http://www.archive.org/details/CC_1914_11_09_HisTrystingPlace http://www.archive.org/details/CC_1914_12_05_AFairExchange http://www.archive.org/details/CC_1914_12_07_HisPrehistoricpast http://www.archive.org/details/CC_1915_02_01_HisNewJob http://www.archive.org/details/CC_1915_02_15_ANightOut http://www.archive.org/details/CC_1915_03_01_TheChampion http://www.archive.org/details/CC_1915_03_18_InThePark http://www.archive.org/details/CC_1915_04_11_TheTramp http://www.archive.org/details/CC_1915_04_29_ByTheSea http://www.archive.org/details/CC_1915_06_21_Work http://www.archive.org/details/CC_1915_07_12_AWoman http://www.archive.org/details/CC_1915_08_09_TheBank http://www.archive.org/details/CC_1915_10_04_CharlieShanghaied http://www.archive.org/details/CC_1915_11_20_ANightInTheShow http://www.archive.org/details/CC_1915_12_18_ABurlesqueOnCarmen http://www.archive.org/details/CC_1916_05_15_TheFloorwalker http://www.archive.org/details/CC_1916_05_27_Police http://www.archive.org/details/CC_1916_06_12_TheFireman http://www.archive.org/details/CC_1916_07_10_TheVagabond http://www.archive.org/details/CC_1916_08_07_One_A_M http://www.archive.org/details/CC_1916_09_04_TheCount http://www.archive.org/details/CC_1916_10_02_ThePawnshop http://www.archive.org/details/CC_1916_11_13_BehindtheScreen http://www.archive.org/details/CC_1916_12_04_TheRink http://www.archive.org/details/CC_1917_04_16_TheCure http://www.archive.org/details/CC_1917_06_17_TheImmigrant http://www.archive.org/details/CC_1917_10_22_TheAdventurer http://www.archive.org/details/CC_1918_09_29_TheBond http://www.archive.org/details/CC_1918_10_20_ShoulderArms http://www.archive.org/details/CC_1918_xx_xx_TripleTrouble http://www.archive.org/details/CC_1919_06_15_Sunnyside http://www.archive.org/details/CC_1919_12_15_ADaysPleasure __________________________________________________"
      ],
      "fileSize": 377153537,
      "addedAt": "2026-01-07T00:06:14.040Z",
      "thumbnail": "https://archive.org/services/img/CC_1917_06_17_TheImmigrant",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 248720
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheImmigrant",
      "id": "TheImmigrant",
      "title": "Charlie Chaplin's \"The Immigrant\" (1917)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Immigrant\" is another one of Charlie Chaplin's short comedies, featuring Edna Purviance, a star of Silent Hall of Fame.   \"The Immigrant\" was added to the National Film Registry in 1998 as being deemed \"culturally, historically, or aesthetically significant\". Directed by               Charlie Chaplin Produced by             Lone Star Corporation Scenario by                Charlie Chaplin           Starring                     Charlie Chaplin, Edna Purviance, Eric Campbell Cinematography        Roland H. Totheroh and W.C. Foster Distributed by           Mutual Film Corporation Release date               June 17, 1917 Running time             24 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 308239577,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheImmigrant",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 28735
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-immigrant",
      "id": "silent-the-immigrant",
      "title": "The Immigrant",
      "fileSize": 1880958631,
      "addedAt": "2026-01-07T00:11:15.977Z",
      "thumbnail": "https://archive.org/services/img/silent-the-immigrant",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 560
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-immigrant-1917-directed-by-charlie-chaplin",
      "id": "the-immigrant-1917-directed-by-charlie-chaplin",
      "title": "The Immigrant (1917) Directed By Charlie Chaplin",
      "description": "Theatrical poster for The Immigrant (1917) Directed by Charlie Chaplin Written by Charlie Chaplin (scenario) Vincent Bryan (scenario) Maverick Terrell (scenario) Produced by John Jasper Charlie Chaplin Starring Charlie Chaplin Edna Purviance Eric Campbell Cinematography Roland Totheroh George C. Zalibra Edited by Charlie Chaplin Music by Charlie Chaplin Distributed by Mutual Film Corporation Release date June 17, 1917 Running time 22 minutes Country United States Languages Silent film English intertitles The Immigrant is a 1917 American silent romantic comedy short written and directed by Charlie Chaplin . The film stars Chaplin's Tramp character as an immigrant coming to the United States who is accused of theft on the voyage across the Atlantic Ocean and falls in love with a beautiful young woman along the way. It also stars Edna Purviance and Eric Campbell . According to Kevin Brownlow and David Gill's documentary series Unknown Chaplin , the first scenes to be written and filmed take place in what became the movie's second half, in which the penniless Tramp finds a coin and goes for a meal in a restaurant, not realizing that the coin has fallen out of his pocket. It was not until later that Chaplin's Tramp was penniless because he had just arrived on a boat from Europe and used this notion as the basis for the first half. Purviance reportedly was required to eat so many plates of beans during the many takes to complete the restaurant sequence (in character as another immigrant who falls in love with Charlie) that she became physically ill. The scene in which Chaplin's character kicks an immigration officer was cited later as evidence of his anti-Americanism when he was forced to leave the United States in 1952. In 1998, The Immigrant was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" [ 1 ] [ 2 ] Plot The film begins aboard a steamship crossing the Atlantic Ocean and initially showcases an unnamed immigrant's misadventures, the Little Tramp (Chaplin), who finds himself in assorted mischief. The scene opens with Charlie bent double over the side of the ship, appearing to be seasick. Then it is revealed he is only fishing. Much humor is derived from the heavy sway of the boat, with much sliding around the deck. Charlie, among other things, plays cards, eats in the mess hall and avoids seasick passengers. Along the way, he befriends another unnamed immigrant (Purviance) who is traveling to America with her ailing mother. The two have been robbed by a pickpocket who loses the money to the Tramp in a card game. The Tramp, feeling sorry for the two penniless women, attempts to secretly place his winnings from his card game in the woman's pocket but ends up being mistakenly accused of being a pickpocket. The woman manages to clear the Tramp's name. Upon arrival in America, the passengers stare at the Statue of Liberty but once landed, the Tramp and the woman part company. Later, hungry and broke, the Tramp finds a coin on the street outside a restaurant and pockets it. He doesn't realize there is a hole in his pocket, and the coin has fallen straight through and is back on the ground. He enters the restaurant, where he orders a plate of beans, at first eating one bean at a time. There, he is reunited with the woman and discovers her mother is dead. The Tramp orders a second bowl of beans for her. As they eat, they watch the restaurant's burly head waiter (Campbell) and other waiters attack and forcibly eject a patron who is short 10 cents in paying his bill. The Tramp, intimidated by the waiter, checks and now realizes he has lost his coin. Terrified of facing the same treatment as the man he saw thrown out, the Tramp begins planning how he will fight the huge man. However, a stranger enters, flaunting the coin he found outside. When the headwaiter takes the coin, it also falls from his pocket onto the floor. The Tramp then makes many failed attempts to retrieve it without notice. He finally retrieves the coin and nonchalantly pays the waiter, only to be thunderstruck when the waiter reveals the coin to be fake. Once again, the Tramp prepares for the fight of his life. Just then, a visiting artist spots the Tramp and the woman and offers them a job to pose for a painting. The two agree. The artist offers to pay for the Tramp and the woman's meal, but the Tramp declines the offer several times for reasons of etiquette, intending to accept the artist's offer eventually; however, he's dismayed when the artist does not renew his offer to pay at the last moment. The artist pays for his own meal and leaves a tip for the waiter. The Tramp notices that the tip is enough to cover the couple's meal and, without the artist noticing, palms the tip and presents it to the waiter as his payment for his and the woman's meal. As a final riposte, he lets the waiter keep the remaining change - one small coin - after paying his bill. The waiter thinks the artist himself has given no tip whatsoever and is upset at this supposed action. Afterward, outside a marriage license office in the rain, the Tramp proposes marriage to the woman, who is coy and reluctant until the Tramp physically carries her into the office while she waves her arms and kicks her feet in protest. Cast Charlie Chaplin - Immigrant Edna Purviance - Immigrant Eric Campbell - The head waiter Albert Austin - Seasick immigrant / A diner Henry Bergman - The artist Kitty Bradbury - The Mother Frank J. Coleman - The cheater on the boat / Restaurant Owner Tom Harrington - Marriage Registrar James T. Kelley - Shabby Man in Restaurant John Rand - Tipsy Diner Who Cannot Pay Production Episode 1 of the 1983 documentary series Unknown Chaplin reveals that Chaplin developed the storyline for The Immigrant as filming progressed. Initially, the movie began as a comedy set in an artists' cafe, with Purviance as a brightly dressed patron. This plot was abandoned almost immediately, before Chaplin's character was introduced, the documentary states, and Chaplin began again, with a story, still set in a cafe, about a man who has never been in a restaurant before displaying terrible table manners before meeting a lovely girl (Purviance) and shaping up. Initially, Henry Bergman played the bully-ish head waiter, but Chaplin eventually replaced him with Eric Campbell . According to Unknown Chaplin , Chaplin developed the idea of the tramp and Purviance's character being immigrants when he realized he needed more plot to justify the restaurant scenes. After filming the film's opening sequences of the arrival in America, he reshot parts of the restaurant scene to be consistent with the new plot (bringing Bergman back in a new role as an artist who resolves the subplot of Charlie being unable to pay for dinner), and added the epilogue in which the Tramp and Purviance are married. Sound version In 1932, Amedee Van Beuren of Van Beuren Studios, purchased Chaplin's Mutual comedies for $10,000 each, added music by Gene Rodemich and Winston Sharples and sound effects, and re-released them through RKO Radio Pictures . Chaplin had no legal recourse to stop the RKO release. [ 3 ] Reception Like many American films of the time, The Immigrant was subjected to some cuts by city and state film censorship boards . The Chicago Board of Censors required two cuts to the film, the first being the closeup showing the stealing of a moneybag, and the second involving nose thumbing as an insult. [ 4 ] References 1 Complete National Film Registry Listing 2 \"Hooray for Hollywood (December 1998) - Library of Congress Information Bulletin\" . www.loc.gov . Retrieved June 30, 2020 . 3 SilentComedians entry Archived 2014-01-12 at the Wayback Machine 4 \"Official Cut-Outs by the Chicago Board of Censors\" . Exhibitors Herald . 5 (2). New York City: Exhibitors Herald Company: 33. July 7, 1917 . Retrieved November 7, 2014 .",
      "fileSize": 1710818029,
      "addedAt": "2026-01-07T00:12:10.588Z",
      "thumbnail": "https://archive.org/services/img/the-immigrant-1917-directed-by-charlie-chaplin",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 323
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-immigrant-1917_202304",
      "id": "the-immigrant-1917_202304",
      "title": "The Immigrant (1917)",
      "description": "The Immigrant is a 1917 American silent romantic comedy short. The film stars Charlie Chaplin’s Tramp character as an immigrant coming to the United States who is accused of theft on the voyage across the Atlantic Ocean and falls in love with a beautiful young woman along the way. It also stars Edna Purviance and Eric Campbell. Watch on RetroFlix.org:  https://retroflix.org/the-immigrant-1917/",
      "fileSize": 431456509,
      "addedAt": "2026-01-07T00:12:10.588Z",
      "thumbnail": "https://archive.org/services/img/the-immigrant-1917_202304",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 794
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "30 min",
    "imdbRating": 7.5,
    "imdbVotes": 9530,
    "Genre": "Short, Comedy, Drama",
    "Plot": "Charlie is on his way to the USA. He wins in a card game, puts the money in Edna's bag (she and her sick mother have been robbed of everything). When he retrieves a little for himself he is accused of being a thief. Edna clears his name. Later, broke, Charlie finds a coin and goes into a restaurant. There he finds Edna, whose mother has died, and asks her to join him. When he reaches for the coin to pay for their meals it is missing (it has fallen through a hole in his pocket).",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin, Vincent Bryan, Maverick Terrell",
    "Actors": "Charles Chaplin, Edna Purviance, Eric Campbell",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0007507",
    "tt0009018",
    "tt0007613",
    "tt0007832",
    "tt0007880",
    "tt0006414",
    "tt0006548",
    "tt0006689",
    "tt0007194",
    "tt0006684",
    "tt0008907",
    "tt0009611"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.588Z"
}