{
  "movieId": "tt0062362",
  "title": "Thoroughly Modern Millie",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thoroughly-modern-millie-1967-slumber-party-scene",
      "id": "thoroughly-modern-millie-1967-slumber-party-scene",
      "title": "Thoroughly Modern Millie (1967) Slumber Party Scene",
      "description": "Slumber Party scene from \"Thoroughly Modern Millie\" (1967)",
      "fileSize": 91933882,
      "addedAt": "2026-01-07T00:12:44.283Z",
      "thumbnail": "https://archive.org/services/img/thoroughly-modern-millie-1967-slumber-party-scene",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 81
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thoroughly-modern-millie-1967_202507",
      "id": "thoroughly-modern-millie-1967_202507",
      "title": "Thoroughly Modern Millie (1967)",
      "description": "THOROUGHLY MODERN MILLIE (1967) Film Overview Thoroughly Modern Millie is a vibrant musical comedy directed by George Roy Hill , starring Julie Andrews as Millie Dillmount, a spirited young woman navigating New York City in the Roaring Twenties. With a screenplay by Richard Morris , colorful visuals shot in Technicolor , and production by Ross Hunter , the film embraces flapper culture, jazz-age energy, and comedic melodrama. The cast includes Mary Tyler Moore , Carol Channing , James Fox , John Gavin , Beatrice Lillie , Jack Soo , Pat Morita , and more. Cinematography was handled by Russell Metty and editing by Stuart Gilmore , with music by Elmer Bernstein and additional songs inspired by 1920s standards. Released March 21, 1967 by Universal Pictures, the film runs 151 minutes and became a major commercial hit, earning $40 million on a $6 million budget. Andrews’ performance further cemented her status as one of the decade’s most bankable stars.",
      "fileSize": 5853379103,
      "addedAt": "2026-01-07T00:12:44.283Z",
      "thumbnail": "https://archive.org/services/img/thoroughly-modern-millie-1967_202507",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 267
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "138 min",
    "imdbRating": 6.9,
    "imdbVotes": 7418,
    "Genre": "Comedy, Musical, Romance",
    "Plot": "In 1922 New York City, Millie Dillmount (Dame Julie Andrews) and Miss Dorothy Brown (Mary Tyler Moore) are just two of the girls living at the Priscilla Hotel for Single Young Ladies run by Mrs. Meers (Beatrice Lillie). Orphaned, Miss Dorothy, just recently arrived, is a naive, old-fashioned girl from a seemingly privileged background who has aspirations to be a stage actress. From more modest means, Millie, in New York City for three months, used to be old-fashioned, but now has a new modern sensibility and look to match, complete with bobbed hair and dresses with hemlines above the knee. Included in this new modern sensibility is Millie's goal of getting a job as a stenographer, with a quick promotion to being her wealthy boss' \"Mrs.\" Love is not to factor into the equation. She believes she's found the right employer in the form of chisel-jawed Trevor Graydon (John Gavin) of the Sincere Trust Insurance Company. Millie's pursuit of Mr. Graydon is despite the fact that Mr. Graydon sees her as one of the boys, he has old-fashioned sensibilities, and Millie has a mutual attraction to another boy named Jimmy Smith (James Fox). Although she likes Jimmy, Millie feels that Jimmy, as a paper clip salesman with an overwhelming happy-go-lucky attitude, is not driven enough to be husband material. That doesn't stop Jimmy's pursuit of Millie. In her association with Jimmy, Millie meets flamboyant wealthy Renaissance woman Muzzy Van Hossmere (Carol Channing). Jimmy's father once worked as Muzzy's gardener. Originally from humble means much like Millie, Muzzy tries to convince Millie that true love will lead to happiness, as that is what happened when she met the now deceased Mr. Van Hossmere, who she had no idea was rich. In other goings-on amongst this new circle of friends, Miss Dorothy leaves New York City without a word to anyone except Mrs. Meers. Thinking this situation rather odd, Millie connects Miss Dorothy's leaving with that of other girls previously living at the Priscilla Hotel. With Mr. Graydon's help, Jimmy and Millie try to find out what happened to Miss Dorothy.",
    "Director": "George Roy Hill",
    "Writer": "Richard Morris",
    "Actors": "Julie Andrews, James Fox, Mary Tyler Moore",
    "Language": "English, Spanish, French, German, Italian, Hebrew",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 5 wins & 12 nominations total"
  },
  "relatedMovies": [
    "tt0062532",
    "tt0182029",
    "tt0325200",
    "tt0183514",
    "tt0183741",
    "tt0168469",
    "tt0043983",
    "tt0031763",
    "tt0033632",
    "tt0033878",
    "tt0034265",
    "tt0036066"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.283Z"
}