{
  "imdbId": "tt0022587",
  "title": "You Don't Know What You're Doin'!",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ydkwyd45478",
      "title": "You Don't Know What You're Doin'!",
      "description": "Title: You Don't Know What You're Doin'! Summary: Piggy was the Harmon/Ising studio's second attempt to create a star for the Merrie Melodies cartoon series. Piggy replaced Foxy. Foxy lasted for only three cartoons. Piggy's tenure was even... Directed by: Rudolf Ising Actors: Production Company: Warner Bros. Release Date: 31 October 1931 (USA) Aspect Ratio: 1.20 : 1 Piggy was the Harmon/Ising studio's second attempt to create a star for the Merrie Melodies cartoon series. Piggy replaced Foxy. Foxy lasted for only three cartoons. Piggy's tenure was even shorter. He appears in only two cartoons. This cartoon, his first screen appearance, was made for adult audiences. It is a wild surrealistic trip through the jazzy nightlife of a bit city. There is almost no plot - just a lot of visual gags. Opens with a close in shot in in a theater's orchestra pit. A conductor is leading a band consisting of animal musicians performing the title song. He is so energetic his pants fall off. An orchestra member takes advantage of this popping up to slap out the rhythm on the conductors rear end. Next scene shows a huge crowd entering this theater then it cuts to Piggy riding a kind of motorized tricycle. He arrives at his girlfriend's home. Since she's not quite ready Piggy stands on the sidewalk watching her dress (through a drawn curtain) and pokes a statue of a ...",
      "fileSize": 98613520,
      "id": "ydkwyd45478"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/you-dont-know-what-youre-doin-1931",
      "title": "You Don't Know What You're Doin'! (1931)",
      "description": "You Don’t Know What You’re Doin’! is a 1931 Warner Bros. Merrie Melodies cartoon short directed by Rudolf Ising. The short was released on October 21, 1931, and stars Piggy, one of the series’ early recurring characters. First released on October 21, 1931, the film is perhaps one of the most amusing and effective of the cartoons from the studio’s earliest years. Watch on RetroFlix.org:  https://retroflix.org/you-dont-know-what-youre-doin-1931/",
      "fileSize": 35220576,
      "id": "you-dont-know-what-youre-doin-1931"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/you-dont-know-what-youre-doin-1931_202502",
      "title": "You Don't Know What You're Doin'! (1931)",
      "description": "Hecklers hijack a stage show.",
      "fileSize": 810374564,
      "id": "you-dont-know-what-youre-doin-1931_202502"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.6,
    "imdbVotes": 359,
    "Genre": "Animation, Short, Comedy",
    "Plot": "Piggy was the Harmon/Ising studio's second attempt to create a star for the Merrie Melodies cartoon series. Piggy replaced Foxy. Foxy lasted for only three cartoons. Piggy's tenure was even shorter. He appears in only two cartoons. This cartoon, his first screen appearance, was made for adult audiences. It is a wild surrealistic trip through the jazzy nightlife of a bit city. There is almost no plot - just a lot of visual gags. Opens with a close in shot in in a theater's orchestra pit. A conductor is leading a band consisting of animal musicians performing the title song. He is so energetic his pants fall off. An orchestra member takes advantage of this popping up to slap out the rhythm on the conductors rear end. Next scene shows a huge crowd entering this theater then it cuts to Piggy riding a kind of motorized tricycle. He arrives at his girlfriend's home. Since she's not quite ready Piggy stands on the sidewalk watching her dress (through a drawn curtain) and pokes a statue of a pan in it's navel. The statue reacts by tooting it's pipes. This alerts the girlfriend of Piggy's arrival. They head off to the theater on the tricycle with Piggy driving and the girlfriend in the side car. At the theater they have a bit of trouble gaining entrance but manage to get in. The pit orchestra is still playing but now there's a chorus line of cats on stage. Piggy and the girlfriend find seats. She likes the show, Piggy does not. He heckles the players stating \"You Don't Know What Your Doin' \". He heads for the pit, picks up a saxophone, goes one stage and begins to play. A trio of drunks now heckle him. Piggy and the drunks sing the title song after which the drunks get a big round of applause. One of them takes such a big bow he falls onto a bass drum in the pit then bounces onto the stage. There he pulls out a bottle and swigs some more alcohol. His breathing on Piggy makes Piggy tipsy. Piggy grabs the drunk's bottle and the two of them do a dance then head for the exit. (At this point the girlfriend has been forgotten). Outside Piggy pours the contents of the bottle into a car's radiator. They car becomes drunk. Piggy hops in and he and the car take a weaving ride through the town. (recall Piggy came here on a motorized tricycle). The drunk follows them on foot. Perhpas as a way to indicate all three are drunk eveything starts swaying including the road and the buildings. Things get even more surreal as inanimate objects spring to life and attack Piggy and the drunk. Without explanation Piggy begins falling through a star studded haze landing in the bed of a dump trunk. The drunk ends up in there too. The dump trunk wobble through town to the dump where both Piggy and the drunk are dropped over an embankment into a trash can. They emege from the can to yell \"Whoopie\" and the cartoon is over.",
    "Director": "Friz Freleng, Rudolf Ising",
    "Writer": "N/A",
    "Actors": "Marcellite Garner, Rudolf Ising, The King's Men",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0022956",
      "title": "Goopy Geer",
      "year": 1932,
      "imdbRating": 5.4,
      "imdbVotes": 287,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023237",
      "title": "Moonlight for Two",
      "year": 1932,
      "imdbRating": 5.3,
      "imdbVotes": 347,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019014",
      "title": "Homeless Homer",
      "year": 1929,
      "imdbRating": 4.1,
      "imdbVotes": 32,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021964",
      "title": "Hittin' the Trail for Hallelujah Land",
      "year": 1931,
      "imdbRating": 5.2,
      "imdbVotes": 404,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018885",
      "title": "Fiery Fireman",
      "year": 1928,
      "imdbRating": 5.7,
      "imdbVotes": 55,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022914",
      "title": "Freddy the Freshman",
      "year": 1932,
      "imdbRating": 5.3,
      "imdbVotes": 267,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023043",
      "title": "I Love a Parade",
      "year": 1932,
      "imdbRating": 5.2,
      "imdbVotes": 247,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023313",
      "title": "Pagan Moon",
      "year": 1932,
      "imdbRating": 5.2,
      "imdbVotes": 215,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024555",
      "title": "Shuffle Off to Buffalo",
      "year": 1933,
      "imdbRating": 5.5,
      "imdbVotes": 288,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024547",
      "title": "The Shanty Where Santy Claus Lives",
      "year": 1933,
      "imdbRating": 5.2,
      "imdbVotes": 425,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021687",
      "title": "Bosko the Doughboy",
      "year": 1931,
      "imdbRating": 5.7,
      "imdbVotes": 348,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022405",
      "title": "Smile, Darn Ya, Smile!",
      "year": 1931,
      "imdbRating": 5.6,
      "imdbVotes": 772,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:17.038Z"
}