{
  "imdbId": "tt0020983",
  "title": "Hold Anything",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hold-anything-1930",
      "id": "hold-anything-1930",
      "title": "Hold Anything (1930)",
      "description": "Hold Anything is the third short in the Looney Tunes series from Warner Bros., released to theaters in October 1930. Featuring Bosko (the star of Looney Tunes shorts of that time), it is loosely based on the lost film Hold Everything, one of whose songs, “Don’t Hold Everything,” features prominently in the cartoon. It was directed by Hugh Harman and Rudolf Ising, and animated by Isadore “Friz” Freleng and Norman Blackburn. Watch on RetroFlix.org:  https://retroflix.org/hold-anything-1930/",
      "fileSize": 39879839,
      "addedAt": "2026-01-07T00:08:46.612Z",
      "thumbnail": "https://archive.org/services/img/hold-anything-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 1078
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.4,
    "imdbVotes": 291,
    "Genre": "Animation, Short, Comedy",
    "Plot": "Bosko is a construction worker, whistling happily as he uses his riveter, and making musical instruments out of everything in sight. The mice laying bricks dance as they work. Bosko uses a handsaw to decapitate a mouse and then bounce the mouse's head and its body (which is frantically trying to retrieve the head) even higher. Later, the reconnected mouse and a rivet-eating goat send a beam up to Bosko, who rides it high into the air. From this lofty position, he spots Honey in her high-rise apartment. He plucks musical notes out of the ropes of a pulley, and then uses the floating notes to step from his beam into the apartment. He puts sheet music in Honey's typewriter, and types out music as if it were a piano. Honey dances to the music, periodically disconnecting her torso from her legs. Bosko grabs the goat, which is now filled with hot air and floating like a balloon, and plays it like bagpipes. But a sudden spray of goat's milk knocks Bosko to the ground, splitting him into several selves, which play the bricks on a wall like piano keys.",
    "Director": "Hugh Harman, Rudolf Ising",
    "Writer": "N/A",
    "Actors": "Bernard B. Brown, Rochelle Hudson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021590",
    "tt0021660",
    "tt0020705",
    "tt0020784",
    "tt0021380",
    "tt0020699",
    "tt0022405",
    "tt0021824",
    "tt0021686",
    "tt0022584",
    "tt0022956",
    "tt0024547"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.612Z"
}