{
  "imdbId": "tt0047463",
  "title": "The Sea Shall Not Have Them",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SeaShallNotHaveIt",
      "id": "SeaShallNotHaveIt",
      "title": "The Sea Shall Not Have Them",
      "description": "Title: The Sea Shall Not Have Them Summary: In the North Sea in 1944, passengers of a downed RAF transport aircraft talk about their lives while awaiting rescue in their dinghy. Directed by: Lewis Gilbert Actors: Michael Redgrave, Dirk Bogarde, Anthony Steel Production Company: Angel Productions Release Date: June 1955 (USA) Aspect Ratio: 1.65 : 1 During autumn of 1944, an RAF Hudson carrying a VIP passenger in possession of highly secret information is shot down and ditches in the North Sea. Fighting the elements and trying to keep up morale, the occupants of the aircraft's dinghy talk about their lives awaiting the rescue they hope will come. The film's title reflects the motto of the RAF's Air Sea Rescue Service, one of whose high speed launches battles against its own mechanical problems, enemy action, time and the weather to locate and rescue the downed crew and the vital secret papers they carry.",
      "fileSize": 704489783,
      "addedAt": "2026-01-07T00:06:51.868Z",
      "thumbnail": "https://archive.org/services/img/SeaShallNotHaveIt",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 3629
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "91 min",
    "imdbRating": 6.3,
    "imdbVotes": 763,
    "Genre": "Drama, War",
    "Plot": "During autumn 1944, a Royal Air Force Hudson carrying a very important passenger in possession of highly secret information is shot down and ditches in the North Sea. Fighting the elements and trying to keep up morale, the occupants of the aircraft's dinghy talk about their lives awaiting the rescue they hope will come. This movie's title reflects the motto of the R.A.F.'s Air Sea Rescue Service, one of whose high speed launches battles against its own mechanical problems, enemy action, time, and the weather to locate and rescue the downed crew and the vital secret papers they carry.",
    "Director": "Lewis Gilbert",
    "Writer": "John Harris, Lewis Gilbert, Vernon Harris",
    "Actors": "Michael Redgrave, Dirk Bogarde, Bonar Colleano",
    "Language": "English, German",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0045487",
    "tt0051454",
    "tt0047040",
    "tt0046746",
    "tt0055884",
    "tt0047230",
    "tt0046816",
    "tt0047376",
    "tt0045844",
    "tt0046029",
    "tt0048413",
    "tt0046478"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.868Z"
}