{
  "imdbId": "tt0037638",
  "title": "Detour",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Detour",
      "title": "Detour",
      "description": "\"Man is involved in two freakish accidents that make him look like a murderer. Poverty row masterwork that is the most precise elucidation of the noir theme of explicit fatalism.\" - noir expert Spencer Selby | Cast: Tom Neal, Ann Savage, Claudia Drake, Edmund MacDonald. | A B-movie, it was shot in six days. The film, budgeted for $89,000 and ended up costing $117,000 to make.",
      "id": "Detour"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detour-1945_202310",
      "title": "Detour (1945)",
      "description": "The life of Al Roberts, a pianist in a New York nightclub, turns into a nightmare when he decides to hitchhike to Los Angeles to visit his girlfriend. Watch on RetroFlix:  https://retroflix.org/detour-1945/",
      "id": "detour-1945_202310"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detour.-1945.1080p.-blu-ray.-remux.-avc.-lpcm.-1.0-fgt",
      "title": "Detour (1945) [P&M] 1080p Blu-ray (17.5GB)",
      "description": "I wasn't satisfied with the video quality of the uploads here on the Archive, so I found this version on Bittorrent after much searching. It's a massive download, but, if that doesn't bother you, it's beautiful. Thank you to the original encoder and seeders.",
      "id": "detour.-1945.1080p.-blu-ray.-remux.-avc.-lpcm.-1.0-fgt"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detour1945HD",
      "title": "Detour (1945) [HD]",
      "description": "The epitome of the American Film Noir Genre, Detour tells the story of a down-on-his-luck pianist who goes on an ill-fated car ride leaving the driver dead. Worse, he gets stuck with a woman who blackmails him to no end under the threat she will go to the police and claim he murdered the driver, even though the driver's death had nothing to do with him.",
      "id": "detour1945HD"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tap67KjjPu8",
      "title": "Detour (1945) [Film Noir] [Drama]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | Piano player Al (Tom Neal) is bitter about having to work in a New York nightclub. After his girlfriend Sue (Claudia Drake) leaves to seek fame in Hollywood, he decides to join her. With little money, he has to hitchhike his way across the country. In Arizona, bookie Charles Haskell Jr. (Edmund MacDonald) gives him a ride in his convertible. Haskell has Al pass him pills several times along the way. That night, Al is driving while Haskell sleeps, when a rainstorm forces Al to pull over to put up the top. Unable to rouse Haskell, Al opens the passenger-side door. Haskell falls out and strikes his head on the ground. Al then realizes the bookie is dead. Fearful that the police will believe he killed Haskell, Al dumps the body off the side of the road, takes Haskell's money, clothes and identification, then drives away. After spending the night in a motel, Al picks up another hitchhiker, Vera (Ann Savage), at a gas station. By sheer bad luck, it turns out that the femme fatale had also been picked up by Haskell earlier. She scratched him deeply in the arm and got out after he tried to become too friendly. When Al identifies himself as Haskell, she blackmails him by threatening to turn him in.\n\nIn Hollywood, they rent an apartment, posing as Mr. and Mrs. Haskell to provide an address when they go to sell the car. However, Vera learns from a newspaper that Haskell's wealthy father is near death and looking for his son, who ran away as a youth after accidentally injuring his friend. Vera demands that Al impersonate Haskell, but Al balks at this notion, pointing out that he knows nothing about the dead man. Back in the apartment, Vera gets drunk, and they begin arguing. She threatens to call the police, running into the bedroom with the telephone and locking the door. She falls into a stupor on the bed, with the telephone cord tangled around her neck. Al tries to break the cord. Then, when he breaks down the door, he sees that he has accidentally strangled her. He goes hitchhiking again, but is picked up by the police.\n\n---\n\nDirected by Edgar G. Ulmer, produced by Leon Fromkess, written by Martin Goldsmith and Martin Mooney, starring Tom Neal as Al Roberts, Ann Savage as Vera, Claudia Drake as Sue Harvey, Edmund MacDonald as Charles Haskell Jr, Tim Ryan as Nevada Diner Proprietor, Esther Howard as Holly, Diner Waitress, Pat Gleason as Joe, Trucker at Diner and Don Brodie as the Used Car Salesman. \n\n---\n\nSource: \"Detour\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 4 January 2013. Web. 07 April 2013. http://en.wikipedia.org/wiki/Detour_(1945_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "tap67KjjPu8",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ze_Y6fnlq8g",
      "title": "Detour (1945) | Colorized Public Domain Film Noir Classic with Tom Neal and Ann Savage",
      "description": "Detour (1945) is an American film noir directed by Edgar G. Ulmer, produced by Producers Releasing Corporation, and starring Tom Neal and Ann Savage. Long regarded as one of the most iconic and haunting examples of classic noir, this restored and colorized edition breathes new life into a gritty story of fate, deception, and desperation. By enhancing this public domain masterpiece with digital cleaning, restoration, and careful colorization, Colorized Public Domain ensures modern viewers across the United States, Europe, and worldwide can experience one of Hollywood’s most fatalistic dramas with a fresh perspective.\n\nPlot Summary:\nAl Roberts (Tom Neal), a down-on-his-luck nightclub pianist in New York City, dreams of joining his girlfriend Sue (Claudia Drake) in California. With no money to travel, he hitchhikes west, relying on chance and the kindness of strangers. When gambler Charles Haskell Jr. (Edmund MacDonald) gives him a ride, fate takes a dark turn: Haskell dies suddenly, and Al, fearing police suspicion, assumes his identity to continue the journey.\n\nMatters spiral when Al picks up Vera (Ann Savage), a sharp-witted drifter who immediately sees through his story. What follows is a tense battle of wills as Vera manipulates and blackmails Al, pushing him deeper into a nightmare of paranoia and moral collapse. Through its claustrophobic storytelling, stark narration, and chilling performances, Detour captures the very essence of film noir: ordinary people trapped by fate, luck, and their own flawed choices.\n\nCast and Crew:\n• Director: Edgar G. Ulmer\n• Producer: Leon Fromkess\n• Screenplay: Martin Goldsmith\n• Cinematography: Benjamin H. Kline\n• Editing: Holbrook N. Todd\n\nStarring:\n• Tom Neal as Al Roberts\n• Ann Savage as Vera\n• Claudia Drake as Sue Harvey\n• Edmund MacDonald as Charles Haskell Jr.\n• Tim Ryan as Gus\n• Esther Howard as Holly\n\nFilm Significance:\nDetour is a benchmark in American film noir, celebrated for its raw intensity and fatalistic themes despite being made on a shoestring budget. Ann Savage’s performance as Vera is widely recognized as one of the most venomous femme fatales in cinema history, while Tom Neal’s portrayal of Al Roberts embodies the noir archetype of a doomed antihero. In 1992, Detour was selected for preservation in the National Film Registry by the Library of Congress for being “culturally, historically, or aesthetically significant.” Its short runtime of just 68 minutes packs an unforgettable punch, proving that budgetary limitations can enhance rather than hinder artistic impact.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Detour remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1945 release was filmed in black and white, capturing the stark contrasts and shadows that defined film noir. While visually striking, black-and-white films often discourage modern audiences from engaging. By offering a colorized edition, we preserve the film’s suspenseful tone while making it visually immersive for contemporary viewers. This balance of authenticity and modernization ensures Detour’s story of fate and misfortune resonates with new generations while honoring its historical roots.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant Hollywood treasures. Our mission is to keep these films discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Detour1945 #FilmNoir #AnnSavage #TomNeal #PublicDomainMovie #ColorizedClassic #ClassicCinema #GoldenAgeHollywood #NationalFilmRegistry #CultFilm",
      "id": "Ze_Y6fnlq8g",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Detour_66",
      "title": "Detour",
      "description": "In flashback, New York nightclub pianist Al Roberts hitchhikes to Hollywood to join his girl Sue. On a rainy night, the sleazy gambler he's riding with mysteriously dies; afraid of the police, Roberts takes the man's identity. But thanks to a blackmailing dame, Roberts' every move plunges him deeper into trouble... - IMDB Description",
      "id": "Detour_66"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Detour_movie",
      "title": "Detour",
      "description": "In a classic poverty-row noir, the protagonist struggles helplessly in the grip of inexorable fate. Currently rated 7.4 at the IMDB . This was the first poverty-row film chosen by the Library of Congress for its National Film Registry, in 1992. Don't miss it. The copy you find here is sharper than the two that have already been uploaded. And the mpeg2 file contains nav packets, so you can load it into DVDAuthorGUI (a free program) and quickly create a DVD to watch on your television.",
      "id": "Detour_movie"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5TfWhy--6a4",
      "title": "Detour (1945)  EDGAR G. ULMER",
      "description": "Stars: Tom Neal, Ann Savage, Claudia Drake\nDirector: Edgar G. Ulmer\n\nIn this noir classic, a world-weary musician is involved in an ambiguous death while hitching to Los Angeles. His first mistake is keeping the guy's car; the second is hitting the brakes for a vulturous vixen... hunting for roadkill!",
      "id": "5TfWhy--6a4",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rteEkq6qz1w",
      "title": "Detour (1945) Crime, Mystery, Film Noir | Tom Neal, Ann Savage |",
      "description": "On a quest for love, he stumbled into a maze of Betrayal... Peril... and Intrigue!\nAfter his girlfriend Sue leaves New York to advance her career in Hollywood, piano player Al Roberts decides to join her. Not having much money, he decides to hitchhike across the country. In Arizona, he gets a ride from Charles Haskell, a gambler and a bookie who happens to be headed to L.A. himself. When Haskell dies of natural causes, Al decides to take his identity. His biggest mistake is giving a ride to another hitchhiker, Vera, a pretty tough cookie who had previously encountered the real Haskell when he gave her a ride. She draws him into a crazy scheme.\n\nOriginal title: Detour (1945)\nThis film is available with dubbed Italian & Spanish audio, and subtitles in many language options.\n\nColorized version: https://youtu.be/G3zN9cP91cw\n\n\nDirector: Edgar G. Ulmer\nWriter: Martin Goldsmith \nStars: Tom Neal, Ann Savage, Claudia Drake\nGenre: Film Noir, Classics, Cult Movies, Drama, Mystery & Suspense, Colorized \nBudget: $30,000\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "rteEkq6qz1w",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1945-detour-el-desvio-edgar-g-ulmer_202005",
      "title": "1945 - Detour - El desvío - Edgar G. Ulmer",
      "description": "For Academic / Educational Use Only",
      "id": "1945-detour-el-desvio-edgar-g-ulmer_202005"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Detour-WeirdnessBadMovie",
      "title": "Detour - Weirdness Bad Movie",
      "description": "Public Access TV show \"Weirdness Really Bad Movie\" hosts public domain movies and ads clean comedy sketches enjoyable for the whole family. Today's film is Detour from 1945.",
      "id": "Detour-WeirdnessBadMovie"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DetourVostfr",
      "title": "Detour Vostfr",
      "description": "Thriller Policier Realise par Edgar G. Ulmer",
      "id": "DetourVostfr"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detour-1945",
      "title": "Detour 1945 Colorized",
      "description": "A NYC piano player hitchhikes to California and gets into trouble along the way. A cult Film Noir movie directed by Edgar G. Ulmer.",
      "id": "detour-1945"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detour-1945-1080-p-subtitulada",
      "title": "PELIGROS DEL DESTINO - (1945)",
      "description": "Peligros del destino [ Detour ], probablemente la más sombría de todas las películas del Film Noir , es la historia de Al Roberts ( Tom Neal ), un pianista sin suerte que decide cruzar el país haciendo autostop (irse de aventón) para reconciliarse con su exnovia. En el camino, el destino le da al pobre Al una serie de jugadas realmente horribles, una de las cuales es encontrarse con Vera ( Ann Savage ), una mujer descarada y vengativa que empeora aún más la desgracia cósmica de Al.   Fiel al espíritu nihilista de Peligros del destino , Vera es totalmente irredimible. Ella es completamente depravada, motivada completamente por la codicia, y ni siquiera se molesta con la pretensión de amar, y mucho menos gustar, a Al. De hecho, es menos un ser humano que una manifestación de la visión sombría del destino ciego del Noir . Ella existe únicamente para atormentar a Al, lo que hace hasta el final y más allá.  D e COLLIDER por WALTER JONES",
      "id": "detour-1945-1080-p-subtitulada"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detour-1945-colorized-movie-720p-hd",
      "title": "Detour (restored, colorized) (1946, film-noir, imdb score: 7.3)",
      "description": "Detour is a 1945 American film noir directed by Edgar G. Ulmer starring Tom Neal and Ann Savage. The screenplay was adapted by Martin Goldsmith and Martin Mooney (uncredited) from Goldsmith's 1939 novel of the same title, and released by the Producers Releasing Corporation, one of the so-called Poverty Row film studios in mid-20th-century Hollywood. In 1992, Detour was selected for the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".",
      "id": "detour-1945-colorized-movie-720p-hd"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detour-1945-restored-movie-720p-hd",
      "title": "Detour (restored, with intro and outro) (1945, film-noir, imdb score: 7.3)",
      "description": "Detour is a 1945 American independent film noir directed by Edgar G. Ulmer and starring Tom Neal and Ann Savage . The screenplay was adapted by Martin Goldsmith and an uncredited Martin Mooney from Goldsmith's 1939 novel of the same title , and released by the Producers Releasing Corporation , one of the so-called Poverty Row film studios in mid-20th-century Hollywood . The film, which today is in the public domain and freely available for viewing at various online sources, was restored by the Academy Film Archive in 2018. In April that year, the 4K restoration premiered in Los Angeles at the TCM Festival. In 1992, Detour was selected for the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".",
      "id": "detour-1945-restored-movie-720p-hd"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/detour_ipod",
      "title": "Detour (iPod)",
      "description": "\"Man is involved in two freakish accidents that make him look like a murderer. Poverty row masterwork that is the most precise elucidation of the noir theme of explicit fatalism.\" - noir expert Spencer Selby A B-movie, it was shot in six days. The film, budgeted for $89,000, but cost $117,000 to make. Cast: Tom Neal, Ann Savage, Claudia Drake, Edmund MacDonald, Tim Ryan, Roger Clark, Pat Gleason, Esther Howard. Originally uploaded by: www.k-otic.com",
      "id": "detour_ipod"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": "7.3",
    "imdbVotes": "20,553",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "In flashback, New York nightclub pianist Al Roberts hitchhikes to Hollywood to join his girl Sue. On a rainy night, the sleazy gambler he's riding with mysteriously dies; afraid of the police, Roberts takes the man's identity. But thanks to a blackmailing dame, Roberts' every move plunges him deeper into trouble.",
    "Director": "Edgar G. Ulmer",
    "Writer": "Martin Goldsmith, Martin Mooney",
    "Actors": "Tom Neal, Ann Savage, Claudia Drake",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0038126",
      "title": "Strange Illusion",
      "year": 1945,
      "imdbRating": "6.2",
      "imdbVotes": "1,189",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035944",
      "title": "Girls in Chains",
      "year": 1943,
      "imdbRating": "4.5",
      "imdbVotes": "265",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0037622",
      "title": "Crime, Inc.",
      "year": 1945,
      "imdbRating": "5.4",
      "imdbVotes": "195",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037518",
      "title": "Apology for Murder",
      "year": 1945,
      "imdbRating": "5.7",
      "imdbVotes": "429",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038683",
      "title": "The Last Crooked Mile",
      "year": 1946,
      "imdbRating": "6.1",
      "imdbVotes": "336",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038057",
      "title": "Scarlet Street",
      "year": 1945,
      "imdbRating": "7.7",
      "imdbVotes": "20,501",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037932",
      "title": "My Name Is Julia Ross",
      "year": 1945,
      "imdbRating": "7.0",
      "imdbVotes": "3,830",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037749",
      "title": "The Great Flamarion",
      "year": 1945,
      "imdbRating": "6.6",
      "imdbVotes": "1,473",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037858",
      "title": "The Lady Confesses",
      "year": 1945,
      "imdbRating": "5.9",
      "imdbVotes": "446",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037505",
      "title": "Allotment Wives",
      "year": 1945,
      "imdbRating": "6.0",
      "imdbVotes": "559",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037598",
      "title": "Circumstantial Evidence",
      "year": 1945,
      "imdbRating": "5.3",
      "imdbVotes": "163",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037633",
      "title": "Dangerous Intruder",
      "year": 1945,
      "imdbRating": "5.9",
      "imdbVotes": "91",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T19:22:33.382Z"
}