{
  "imdbId": "tt0034928",
  "title": "The Jungle Book",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JungleBook",
      "title": "Jungle Book",
      "description": "Teenaged Mowgli, who was raised by wolves, appears in a village in India and is adopted by Messua. Mowgli learns human language and some human ways quickly, though keeping jungle ideas. Influential Merchant Buldeo is bigoted against 'beasts' including Mowgli; not so Buldeo's pretty daughter, whom Mowgli takes on a jungle tour where they find a treasure, setting the evil of human greed in motion. Nominated for 4 Oscars. Another 2 wins",
      "fileSize": 2377964298,
      "id": "JungleBook"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jungle-book-1942_202312",
      "title": "Jungle Book (1942)",
      "description": "Mowgli, lost in the jungle when a toddler, raised by wolves, years later happens upon his human village and reconnects with its inhabitants, including his widowed mother. Continuing to maintain a relationship with the jungle, adventures follow. Watch on RetroFlix:  https://retroflix.org/jungle-book-1942/",
      "fileSize": 615942438,
      "id": "jungle-book-1942_202312"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MOn6QCh0D5g",
      "title": "Jungle Book (1942) [Action] [Adventure]",
      "description": "Jungle Book is an American color action-adventure film from 1942 based on the famous Rudyard Kipling book. The film was directed by the Hungarian Zoltán Korda based on a screenplay adaptation by Laurence Stallings. The cinematography was by Lee Garmes and W. Howard Greene and music by Miklós Rózsa. The film starred Sabu Dastagir as Mowgli. The film was nominated for four Academy Awards including \"Best Art Direction-Interior Decoration\", \"Color\" for the director's brother, Vincent Korda and creative partner Julia Heron. This film was the first one in history with a separate released soundtrack on vinyl.\n\nIn an Indian village, Buldeo, an elderly storyteller, is paid by a visiting British memsahib to tell a story of his youth. He speaks of the animals of the jungle and of the ever-present threats to human life posed by the jungle itself. He then recalls his earlier life:\n\nAs a younger man he dreams that his village could one day become an important town and that the jungle could be conquered. However, when he is speaking about these dreams, an attack by Shere Khan, the tiger, leads to the death of a man and the loss of the man's child. The child is adopted by wolves in the jungle and grows to be the wild youth Mowgli. Years later, Mowgli is captured by the villagers and taken in by his mother Messua, though she does not recognize him as her lost child. He learns to speak and tries to imitate the ways of men, as well as becomes friendly with Buldeo's daughter, Mahala – much to Buldeo's distress, since he is convinced that the wild Mowgli is dangerous. When Mowgli and Mahala explore the jungle, they discover a hidden chamber in a ruined palace, containing fabulous wealth. Warned by an aged cobra that the wealth brings death, they leave, but Mahala takes one coin as a memento. When Buldeo sees the coin, he tries to force Mowgli to tell him where the treasure is, but Mowgli refuses. Buldeo resolves to follow Mowgli to the site of the treasure.\n\nLater Mowgli fights and kills Shere Khan, with some last minute help from Kaa, the python. As he is skinning the body, Buldeo arrives. He threatens Mowgli with a gun, but is attacked by Mowgli's friend Bagheera, the black panther. Buldeo becomes convinced that Bagheera is Mowgli himself, shape-shifted into panther form. He tells the villagers that Mowgli is a witch, as is his mother. Mowgli is chained up and threatened with death, but escapes with his mother's help. However, she and another villager who tries to defend her are tied up and themselves threatened with burning for witchcraft.\n\nMowgli is followed by the greedy Buldeo and two friends, a priest and a barber, to the lost city. They find the treasure (including a golden elephant goad with a big ruby intact) and leave for the village with as much as they can carry. But when they stop for the night, the priest tries to steal a jewel-encrusted axe from the barber's share and murders him when the barber wakes up. The priest unconvincingly tells Buldeo that the barber had attacked him and that he had killed in self-defense, but Buldeo knows better. The next day, the priest attacks Buldeo while his back is turned, but Buldeo knocks him into the swamp where he is killed by a crocodile. Mowgli, who'd been trailing the men, tells Bagheera to chase Buldeo, the sole survivor, from the jungle, and Buldeo flees for his life, jettisoning the treasure he'd been carrying.\n\nEnraged and maddened, Buldeo tries to murder Mowgli and even the jungle itself, by starting a forest fire. The fire rages, but the wind turns and threatens the village. The villagers flee, but Mowgli's mother and her defender are trapped. Mowgli brings the elephants to the village and breaks open the building, escaping to the river with his mother, Mahala and other villagers. He is invited to follow them to a new life downriver, but refuses to leave the jungle, turning back to help animals trapped by the fire.\n\nThe scene returns to the present day, with the elderly Buldeo telling his story and admitting that the jungle defeated his youthful dreams. When asked what became of Mowgli and his daughter, as well as how he escaped from the fire himself, he looks into the camera and says that is another story.\n\n---\n\nDirected by Zoltan Korda, produced by Alexander Korda, screenplay by Laurence Stallings, based on \"The Jungle Book\" (1894 collections by Rudyard Kipling), starring Sabu as Mowgli, Joseph Calleia as Buldeo\nJohn Qualen as The barber, Frank Puglia as The pundit, Rosemary DeCamp as Messua, Patricia O'Rourke as Mahala, Ralph Byrd as Durgaived, Faith Brook as English girl, Noble Johnson as Sikh. \n\n---\n\nSource: \"Jungle Book (1942 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 16 March 2017. Web. 24 April 2017. https://en.wikipedia.org/wiki/Jungle_Book_(1942_film)\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "id": "MOn6QCh0D5g",
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-8EJ9uhsfQQ",
      "title": "The Jungle Book (1942) Sabu, Joseph Calleia | Adventure film | Movie, subtitles",
      "description": "MOWGLI, HALF-BOY, HALF WOLF . . . armed only with a knife and the love of a girl, meets the challenge of Shere Khan, the Killer Tiger! \nA boy raised by wild animals tries to adapt to human village life.\n\nDirector: Zoltan Korda\nWriter: Laurence Stallings (adaptation) & Rudyard Kipling (novel)\nStars: Sabu, Joseph Calleia, John Qualen \nGenres: Classics, Action, Adventure, Family, Literary\n\n\n00:00 Full Movie (with subtitles)\n01:56 Exploration of the jungle's inhabitants and their laws, featuring key figures like Baloo, Shere Khan, and Kaa.\n15:26 Story of a wild boy raised by wolves in the jungle, facing threats from a tiger.\n22:49 A boy raised in the jungle is taken in by a woman, causing fear and superstition in the village.\n33:25 A young boy named Mowgli, raised by wolves in the jungle, seeks revenge on a tiger named Shere Khan.\n43:14 Exploration of treasures, encounters with cobras, and a mysterious ruby in the jungle.\n51:58 A tale of bravery and cunning unfolds as Mowgli seeks to defeat the tiger Shere Khan.\n1:08:04 Mowgli avenges and kills Shere Khan, leading to a conflict over treasure in the Lost City.\n1:18:59 Adventure in the jungle with treasure, conflicts, and betrayal leading to deadly consequences.\n1:33:33 A tale of survival and revenge in the jungle, where a boy is raised by animals and faces challenges.\n\n@CultCinemaClassics\n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "-8EJ9uhsfQQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "108 min",
    "imdbRating": 6.7,
    "imdbVotes": 4869,
    "Genre": "Action, Adventure, Family",
    "Plot": "Teenaged Mowgli, who was raised by wolves, appears in a village in India and is adopted by Messua. Mowgli learns human language and some human ways quickly, though keeping jungle ideas. Influential Merchant Buldeo is bigoted against 'beasts' including Mowgli; not so Buldeo's pretty daughter, whom Mowgli takes on a jungle tour where they find a treasure, setting the evil of human greed in motion.",
    "Director": "Zoltan Korda",
    "Writer": "Laurence Stallings, Rudyard Kipling",
    "Actors": "Sabu, Joseph Calleia, John Qualen",
    "Language": "English",
    "Country": "United States, United Kingdom",
    "Awards": "Nominated for 4 Oscars. 2 wins & 5 nominations total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0033317",
      "title": "Adventures of Captain Marvel",
      "year": 1941,
      "imdbRating": 7.2,
      "imdbVotes": 1572,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032475",
      "title": "Flash Gordon Conquers the Universe",
      "year": 1940,
      "imdbRating": 6.6,
      "imdbVotes": 1573,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0036323",
      "title": "Sahara",
      "year": 1943,
      "imdbRating": 7.5,
      "imdbVotes": 10173,
      "language": "English, German, Italian, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030832",
      "title": "Tarzan and the Green Goddess",
      "year": 1938,
      "imdbRating": 4.4,
      "imdbVotes": 569,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030138",
      "title": "Flash Gordon's Trip to Mars",
      "year": 1938,
      "imdbRating": 6.9,
      "imdbVotes": 1106,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0057197",
      "title": "Jason and the Argonauts",
      "year": 1963,
      "imdbRating": 7.3,
      "imdbVotes": 33404,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0034428",
      "title": "Across the Pacific",
      "year": 1942,
      "imdbRating": 6.8,
      "imdbVotes": 5563,
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034908",
      "title": "Jacaré",
      "year": 1942,
      "imdbRating": 4.7,
      "imdbVotes": 44,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029081",
      "title": "King Solomon's Mines",
      "year": 1937,
      "imdbRating": 6.3,
      "imdbVotes": 1484,
      "language": "Spanish, English, Portuguese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036164",
      "title": "Miss V from Moscow",
      "year": 1942,
      "imdbRating": 5,
      "imdbVotes": 92,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012752",
      "title": "The Three Musketeers",
      "year": 1921,
      "imdbRating": 6.9,
      "imdbVotes": 1177,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034572",
      "title": "Canal Zone",
      "year": 1942,
      "imdbRating": 6,
      "imdbVotes": 49,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.997Z"
}