{
  "imdbId": "tt0000439",
  "title": "The Great Train Robbery",
  "year": 1903,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGreatTrainRobbery_555",
      "id": "TheGreatTrainRobbery_555",
      "title": "The Great Train Robbery",
      "description": "Filmed in November 1903 at Edison's New York studio, at Essex County Park in New Jersey, and along the Lackawanna railroad and released in December 1903, \"The Great Train Robbery\" is considered to be one of the first significant early US narrative films. Greatly influenced by the British film \"Daring Daylight Robbery\" (1903) it introduced many new cinematic techniques (cross cutting, double exposure, camera movement and location shooting) to American audiences. It was directed by Edwin S Porter and stars Justus D. Barnes as the head bandit, G. M. Anderson as a slain passenger and a robber, Walter Cameron as the sheriff. From the Edison Film Catalogue 1904: This sensational and highly tragic subject will certainly make a decided `hit' whenever shown. In every respect we consider it absolutely the superior of any moving picture ever made. It has been posed and acted in faithful duplication of the genuine `Hold Ups' made famous by various outlaw bands in the far West, and only recently the East has been shocked by several crimes of the frontier order, which fact will increase the popular interest in this great Headline Attraction. Scene 1 - Interior of railroad telegraph office. Two masked robbers enter and compel the operator to set the `signal block' to stop the approaching train, also making him write an order to the engineer to take water at this station.... Scene 2 - At the railroad water tank. The bandit band are seen hiding behind the tank as a train stops to take water (according to false order). Just before she pulls out they stealthily board the train between the express car and the tender. Scene 3 - Interior of express car.... the two robbers have succeeded in effecting an entrance. They enter cautiously. The messenger opens fire on them. A desperate pistol duel takes place, in which the messenger is killed. One of the robbers stands watch while the other tries to open the treasure box. Finding it locked, he searches the messenger for the key. Not finding it, he blows the safe up with dynamite.... Scene 4 - The fight on the tender. This thrilling scene was taken from the mail car showing the tender and interior of locomotive cab, while the train is running forty miles an hour.... Scene 5 - The train uncoupled.... Scene 6 - Exterior of passenger coaches. The bandits compel the passengers to leave coaches with hands aloft, and line up along the tracks. One of the robbers covers them with large pistols in either hand, while the others ransack travelers' pockets. A passenger makes an attempt to escape, but is instantly shot down.... Scene 7 - The escape. The desperadoes board the locomotive with their booty, command the engineer to start his machine, and disappear in the distance. Scene 8 - Off to the mountains. The robbers bring the engine to a stop several miles from the scene of the `Hold Up,' and take to the mountains. Scene 9 - A beautiful scene in a valley. The bandits come down the side of a hill on a run and cross a narrow stream. Mounting their horses, which were tied to nearby trees, they vanish into the wilderness. Scene 10 - Interior of telegraph office. The operator lies bound and gagged on the floor. After a desperate struggle, he succeeds in standing up. Leaning on the table, he telegraphs for assistance by manipulating the key with his chin, and then faints from exhaustion. His little daughter enters.... cuts the ropes, and, throwing a glass of water in his face, restores him to consciousness. Arising in a bewildered manner, he suddenly recalls his thrilling experience, and rushes forth to summon assistance. Scene 11 - Interior of a dance hall.... typical Western dance house scene.... Suddenly the door opens and the half dead telegraph operator staggers in. The crowd gathers around him, while he relates what has happened.... The men secure their guns and hastily leave in pursuit of the outlaws. Scene 12 - The posse in pursuit. Shows the robbers dashing down a rugged mountain at a terrible pace, followed closely by a large posse, both parties firing as they proceed. One of the desperadoes is shot.... Scene 13 - The remaining three bandits, thinking they had eluded their pursuers, have dismounted from their horses.... and begin to examine the contents of the mail bags.... The pursuers, having left their horses, steal noiselessly down upon them until they are completely surrounded. A desperate battle then takes place. After a brave stand, all of the robbers and several of the posse bite the dust. Scene 14 - Realism. Full frame of Barnes, leader of the outlaw band, taking aim and firing point blank at the audience. (This effect was gained by foreshortening in making the picture). \"The resulting excitement is great. This section of the scene can be used either to begin the subject or to end it, as the operator may choose. Remastered, tinted and new soundtrack added in 2010.",
      "fileSize": 358746359,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGreatTrainRobbery_555",
      "year": 1903,
      "collection": "feature_films",
      "downloads": 238696
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-great-train-robbery",
      "id": "silent-the-great-train-robbery",
      "title": "The Great Train Robbery",
      "fileSize": 357640643,
      "addedAt": "2026-01-07T00:11:15.976Z",
      "thumbnail": "https://archive.org/services/img/silent-the-great-train-robbery",
      "language": "English",
      "year": 1903,
      "collection": "feature_films",
      "downloads": 1718
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-great-train-robbery-1903-directed-by-edwin-s.-porter",
      "id": "the-great-train-robbery-1903-directed-by-edwin-s.-porter",
      "title": "The Great Train Robbery (1903) Directed By Edwin S. Porter",
      "description": "The Great Train Robbery (1903) Directed by Edwin S. Porter Director: Edwin S. Porter The Great Train Robbery is a 1903 American silent film made by Edwin S. Porter for the Edison Manufacturing Company. It follows a gang of outlaws who hold up and rob a steam train at a station in the American West, flee across mountainous terrain, and are finally defeated by a posse of locals. The short film draws on many sources, including a robust existing tradition of Western films, recent European innovations in film technique, the play of the same name by Scott Marble, the popularity of train-themed films, and possibly real-life incidents involving outlaws such as Butch Cassidy. Porter supervised and photographed the film in New York and New Jersey in November 1903; the Edison studio began selling it to vaudeville houses and other venues in the following month. The cast included Justus D. Barnes and G. M. Anderson, who may have also helped with planning and staging. Porter's storytelling approach, though not particularly innovative or unusual for 1903, allowed him to include many popular techniques of the time, including scenes staged in wide shots, a matte effect, and an attempt to indicate simultaneous action across multiple scenes. Camera pans, location shooting, and moments of violent action helped give The Great Train Robbery a sense of rough-edged immediacy. A special close-up shot, which was unconnected to the story and could either begin or end the film depending on the projectionist's whim, showed Barnes, as the outlaw leader, emptying his gun directly into the camera. Due in part to its popular and accessible subject matter, as well as to its dynamic action and violence, The Great Train Robbery was an unprecedented commercial success. Though it did not significantly influence or advance the Western film genre, it was widely distributed and copied, including in a parody by Porter himself. During the twentieth century, inaccurate legends about The Great Train Robbery developed, claiming it was the first Western or even the first film to tell a story. Film scholars have repeatedly disproved these claims, demonstrating that The Great Train Robbery was a stylistic dead-end for its maker and genre; its commercial success and mythic place in American film lore nonetheless remain undisputed. The film, especially the close-up of Barnes, has become iconic in American culture, appearing in numerous film and television references and homages. In 1990, The Great Train Robbery was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". -From Wikipedia",
      "fileSize": 81344097,
      "addedAt": "2026-01-07T00:12:10.587Z",
      "thumbnail": "https://archive.org/services/img/the-great-train-robbery-1903-directed-by-edwin-s.-porter",
      "year": 1903,
      "collection": "feature_films",
      "downloads": 163
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DeliveringNewspapersAmericanMutoscopeAndBiographCompany",
      "id": "DeliveringNewspapersAmericanMutoscopeAndBiographCompany",
      "title": "Delivering newspapers / American Mutoscope and Biograph Company.",
      "description": "CREATED/PUBLISHED United States : American Mutoscope and Biograph Company, 1903. SUMMARY The film shows a group of about fifty pre-adolescent boys running and crowding around a one-horse paneled newspaper van that pulls up in the foreground of the picture. On the side of the van is a sign reading \"New York World.\" As they gather around the rear of the vehicle, a fight breaks out between two of the boys. The film ends as the crowd forms around the two fighters. Probably filmed at Union Square. NOTES Copyright: American Mutoscope & Biograph Co.; 24Apr1903; H30745. Duration: 0:53 at 15 fps. Camera, G.W. \"Billy\" Bitzer, Arthur Marvin. Photographed May 1, 1899. Location: New York, N.Y. Received: 4/24/03; paper pos; copyright deposit; Paper Print Collection. Received: 1989/90 from UCLA; arch neg; preservation; Paper Print Collection. Received: 1991 from LC lab; ref prints and dupe neg; preservation; Paper Print Collection. SUBJECTS Paperboys--New York (State)--New York. Newspaper carriers--New York (State)--New York. American newspapers--New York (State)--New York. World (New York, N.Y. : 1860-1931) Commercial vehicles--New York (State)--New York. Horse-drawn vehicles--New York (State)--New York. Boys--New York (State)--New York. Actuality--Short. RELATED NAMES Bitzer, G. W., 1872-1944, camera. Marvin, Arthur W., 1861-1911, camera. American Mutoscope and Biograph Company. Paper Print Collection (Library of Congress) MEDIUM 1 roll (68 ft.) : si., b&w ; 35 mm. paper pos. CALL NUMBER LC 373 (paper pos) FEB 9798 (ref print) FEB 9778 (ref print, copy 2) FPE 5531 (dupe neg) FPE 5594 (arch neg) REPOSITORY Library of Congress Motion Picture, Broadcasting and Recorded Sound Division Washington, D.C. 20540 USA DIGITAL ID lcmp002 m2a31757 http://hdl.loc.gov/loc.mbrsmi/lcmp002.m2a31757",
      "fileSize": 15982621,
      "addedAt": "2026-01-07T00:06:19.369Z",
      "thumbnail": "https://archive.org/services/img/DeliveringNewspapersAmericanMutoscopeAndBiographCompany",
      "collection": "feature_films",
      "downloads": 1281
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGreatTrainRobbery1903",
      "id": "TheGreatTrainRobbery1903",
      "title": "The Great Train Robbery 1903",
      "description": "In this silent short, bandits rob the passengers on a train in this pioneering western. In 1903, an employee of Thomas Edison's motion picture company produced a movie with a story. It was called \"The Great TrainRobbery.\" It told a simple story of a group of western criminals who steal money from a train. Later they are killed by a group of police in a gun fight. The movie was extremely popular. \"The Great TrainRobbery\" started the huge motion picture industry. The Great Train Robbery was directed and photographed by Edwin S. Porter - a former Thomas Edison cameraman. It was a primitive one-reeler action picture, about 10 minutes long, with 14-scenes, filmed in November 1903 - not in the western expanse of Wyoming but on the East Coast in various locales in New Jersey (at Edison's New York studio, at Essex County Park in New Jersey, and along the Lackawanna railroad). The precursor to the western film genre was based on an 1896 story by Scott Marble. The film's title was also the same as a popular contemporary stage melodrama. It was the most popular and commercially successful film of the pre-nickelodeon era, and established the notion that film could be a commercially-viable medium. The film was originally advertised as \"a faithful duplication of the genuine 'Hold Ups' made famous by various outlaw bands in the far West.\" The plot was inspired by a true event that occurred on August 29, 1900, when four members of George Leroy Parker's (Butch Cassidy) 'Hole in the Wall' gang halted the No. 3 train on the Union Pacific Railroad tracks toward Table Rock, Wyoming. The bandits forced the conductor to uncouple the passenger cars from the rest of the train and then blew up the safe in the mail car to escape with about $5,000 in cash. The film used a number of innovative techniques, many of them for the first time, including parallel editing, minor camera movement, location shooting and less stage-bound camera placement. Jump-cuts or cross-cuts were a new, sophisticated editing technique, showing two separate lines of action or events happening continuously at identical times but in different places. The film is intercut from the bandits beating up the telegraph operator (scene one) to the operator's daughter discovering her father (scene ten), to the operator's recruitment of a dance hall posse (scene eleven), to the bandits being pursued (scene twelve), and splitting up the booty and having a final shoot-out (scene thirteen). The film also employed the first pan shots (in scenes eight and nine), and the use of an ellipsis (in scene eleven). Rather than follow the telegraph operator to the dance, the film cut directly to the dance where the telegraph operator enters. It was also the first film in which gunshots forced someone to dance (in scene eleven) - an oft-repeated, cliched action in many westerns. And the spectacle of the fireman (replaced by a dummy with a jump cut in scene four) being thrown off the moving train was a first in screen history. In the film's fourteen scenes, a narrative story with multiple plot lines was told - with elements that were copied repeatedly afterwards by future westerns - of a train holdup with six-shooters, a daring robbery accompanied by violence and death, a hastily-assembled posse's chase on horseback after the fleeing bandits, and the apprehension of the desperadoes after a showdown in the woods. The steam locomotive always provided a point of reference from different filming perspectives. The first cowboy star, Gilbert M. 'Broncho Billy' Anderson played several roles: a bandit, a wounded passenger, and a tenderfoot dancer.",
      "fileSize": 179838423,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGreatTrainRobbery1903",
      "collection": "feature_films",
      "downloads": 22946
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blancheville-monster-1963-colorized-movie-576p-sd",
      "id": "blancheville-monster-1963-colorized-movie-576p-sd",
      "title": "The Blancheville Monster (restored, colorized) (1963, horror, imdb score: 5.1)",
      "description": "The Blancheville Monster , released in the UK and Italy as Horror , is a 1963 horror film directed by Alberto de Martino . The film's script by Gianni Grimaldi and Bruno Corbucci is promoted as being based on the works of Edgar Allan Poe , but actually only borrows elements from the short stories \" The Fall of the House of Usher \", \" A Tale of the Ragged Mountains \" and \" Some Words with a Mummy \". Long after its release, director Alberto de Martino described his film as \"a little film of no importance\".",
      "fileSize": 1224885970,
      "addedAt": "2026-01-07T00:07:38.718Z",
      "thumbnail": "https://archive.org/services/img/blancheville-monster-1963-colorized-movie-576p-sd",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 291
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "11 min",
    "imdbRating": 7.3,
    "imdbVotes": 21493,
    "Genre": "Short, Action, Adventure",
    "Plot": "Among the earliest existing films in American cinema - notable as an early film to present a narrative story to tell - it depicts a group of outlaws who hold up a train and rob the passengers. They are then pursued by a Sheriff's posse. Several scenes have color included - all hand tinted.",
    "Director": "Edwin S. Porter",
    "Writer": "Scott Marble, Edwin S. Porter",
    "Actors": "Gilbert M. 'Broncho Billy' Anderson, A.C. Abadie, George Barnes",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0234913",
    "tt0232932",
    "tt0231523",
    "tt0232181",
    "tt0231639",
    "tt0477387",
    "tt0000471",
    "tt0366268",
    "tt0273542",
    "tt0231549",
    "tt0245125",
    "tt0231758"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:07:33.551Z"
}