{
  "imdbId": "tt0049335",
  "title": "Hot Rod Girl",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HotRodGirl",
      "title": "Hot Rod Girl",
      "description": "When his younger brother, Steve (Del Erickson), is killed racing a hot-rod, Jeff Northup (John Smith) blames himself for the accident since he had built the car for his brother and had encouraged him to race it, with other boys on a special course provided by police detective Ben Merrill (Chuck Connors), who is working to reduce the city's hot-rod fatalities by providing supervision for the dangerous hobby. Jeff withdraws from participating in races on Merrill's course and, without his leadership, revert to racing on the streets. \"Bronc\" Talbott (Mark Andrews), a newcomers, makes a play for Jeff's girlfriend, Lisa Vernon (Lori Nelson). Eventually, the taunting-Talbott forces Jeff into a race which results in the death of a bicycling child, and evidence seems to indicate Jeff was at fault.",
      "fileSize": 1979836191,
      "id": "HotRodGirl"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hot-rod-girl-1956-",
      "title": "Hot Rod Girl (1956)",
      "description": "Lori Nelson, Chuck Connors",
      "fileSize": 1522075587,
      "id": "hot-rod-girl-1956-"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hot_rod_girl_1956",
      "title": "Hot Rod Girl",
      "description": "Taken from IMDB : After his kid brother is killed in a street race, a champion drag-racer quits racing. However, a new kid comes to town determined to force him back into racing so he can take his title--and he's already taken his girlfriend.",
      "fileSize": 1788129324,
      "id": "hot_rod_girl_1956"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mO9qTTRgdXg",
      "title": "Hot Rod Girl (1956) | Colorized Public Domain Classic Teen Rebel Car Culture Drama with Lori Nelson",
      "description": "Hot Rod Girl (1956) is an American teen-oriented crime drama that captures the raw energy of postwar car culture, juvenile delinquency, and the rise of hot rod street racing in 1950s America. Directed by Leslie H. Martinson, the film reflects a cultural moment when youth rebellion, speed, and rock ’n’ roll values collided with adult fears about morality and safety. This restored and colorized edition revitalizes the film’s visual appeal, allowing modern viewers in the USA, Europe, and beyond to experience the chrome, fashion, and atmosphere of mid-century Americana in vivid detail.\n\nPlot Summary:\nJeff Northrup (John Smith) is a young hot-rod enthusiast struggling with guilt after his brother is killed during an illegal street race. Seeking a safer outlet for young drivers, police officer Ben Merrill (Chuck Connors) helps set up a supervised drag strip to curb reckless racing. Despite these efforts, tensions rise when a reckless outsider named Bronc Talbott (Mark Andrews) enters the scene. Bronc thrives on danger, pushing Jeff and his friends into increasingly hazardous confrontations.\n\nMeanwhile, Jeff’s girlfriend Lisa Vernon (Lori Nelson) becomes caught in the emotional conflict between Jeff’s grief, his loyalty to his late brother’s memory, and the growing temptation to settle scores on the road. The film builds toward a climactic showdown between responsibility and reckless abandon, dramatizing the struggles of America’s 1950s “lost youth” searching for identity, thrills, and independence behind the wheel of powerful hot rods.\n\nCast and Crew:\n• Director: Leslie H. Martinson\n• Producer: Norman T. Herman\n• Screenplay: John McGreevey\n• Cinematography: Carl E. Guthrie\n• Editing: George White\nStarring:\n• Lori Nelson as Lisa Vernon\n• John Smith as Jeff Northrup\n• Chuck Connors as Ben Merrill\n• Mark Andrews as Bronc Talbott\n• Roxanne Arlen as Judy\n• Eddie Ryder as Flat Top\n• Frank Gorshin as Street Racer\n• Fred Essler as Mr. Vernon\n\nFilm Significance:\nHot Rod Girl reflects the anxieties and thrills of 1950s American youth culture. Released at the height of the hot rod craze, the film stands alongside other juvenile delinquency pictures of its time, warning of the dangers of rebellion while still celebrating the excitement of cars, speed, and teenage freedom. For younger audiences of the 1950s, it was an adrenaline-filled reflection of their reality. For today’s viewers, the film offers a fascinating cultural document of American fears about reckless driving, teenage morality, and generational conflict.\n\nThe casting is notable for including Lori Nelson, a rising star of Universal-International films, and Chuck Connors, who would later gain fame in the popular TV series The Rifleman. Its combination of melodrama, action, and cultural commentary makes it a cult classic for fans of mid-century Americana, auto culture historians, and vintage cinema enthusiasts.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Hot Rod Girl remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1956 release was in black and white, like many modestly budgeted teen exploitation films of its time. While historically authentic, the lack of color can make car culture films less appealing to modern audiences who expect vibrancy and visual energy. By offering a colorized edition, we enhance the hot rods, costumes, and rebellious energy that defined 1950s teen cinema, making the film more engaging for viewers in the USA, Europe, and beyond.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#HotRodGirl #1950sMovies #TeenRebelCinema #ClassicCarCulture #PublicDomainMovie #ColorizedClassic #ChuckConnors #LoriNelson #GoldenAgeHollywood #FilmRestoration #VintageTeenDrama",
      "id": "mO9qTTRgdXg",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jVmmYXp4h0U",
      "title": "Hot Rod Girl (1956) LORI NELSON",
      "description": "Movie Class by PizzaFLIX: Lori Nelson began her show biz career at the age of two-and-a-half, dancing in a show in her native Santa Fe, New Mexico. At age four, Nelson moved to Hollywood with her parents and there was named Little Miss America.\n\nStars: Lori Nelson, Chuck Connors, Frank Gorshin\nDirector: Leslie H. Martinson\n\nA champion drag-racer quits the sport after his younger brother is killed in a street race accident. But a new kid comes to town determined to get him back into racing so he can take his title--and he's already taken his girl!",
      "id": "jVmmYXp4h0U",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "79 min",
    "imdbRating": 5,
    "imdbVotes": 400,
    "Genre": "Action, Drama, Romance",
    "Plot": "When his younger brother, Steve, is killed racing a hot-rod, Jeff Northup blames himself for the accident since he had built the car for his brother and had encouraged him to race it, with other boys on a special course provided by police detective Ben Merrill, who is working to reduce the city's hot-rod fatalities by providing supervision for the dangerous hobby. Jeff withdraws from participating in races on Merrill's course and, without his leadership, revert to racing on the streets. \"Bronc\" Talbott, a newcomers, makes a play for Jeff's girlfriend, Lisa Vernon. Eventually, the taunting-Talbott forces Jeff into a race which results in the death of a bicycling child, and evidence seems to indicate Jeff was at fault.",
    "Director": "Leslie H. Martinson",
    "Writer": "John McGreevey",
    "Actors": "Lori Nelson, Chuck Connors, John Smith",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0053399",
      "title": "Up Periscope",
      "year": 1959,
      "imdbRating": 6.4,
      "imdbVotes": 2314,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045604",
      "title": "Captain Scarface",
      "year": 1953,
      "imdbRating": 4.8,
      "imdbVotes": 279,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053341",
      "title": "Ten Seconds to Hell",
      "year": 1959,
      "imdbRating": 6.5,
      "imdbVotes": 1241,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028592",
      "title": "Atlantic Flight",
      "year": 1937,
      "imdbRating": 4.6,
      "imdbVotes": 92,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028634",
      "title": "Bill Cracks Down",
      "year": 1937,
      "imdbRating": 5.6,
      "imdbVotes": 108,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027366",
      "title": "Black Gold",
      "year": 1936,
      "imdbRating": 5.2,
      "imdbVotes": 103,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033399",
      "title": "Blonde Comet",
      "year": 1941,
      "imdbRating": 5,
      "imdbVotes": 112,
      "language": "English, Swedish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026489",
      "title": "Hong Kong Nights",
      "year": 1935,
      "imdbRating": 4.8,
      "imdbVotes": 66,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029376",
      "title": "Park Avenue Logger",
      "year": 1937,
      "imdbRating": 5.8,
      "imdbVotes": 100,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013607",
      "title": "Sky High",
      "year": 1922,
      "imdbRating": 6.1,
      "imdbVotes": 393,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0140551",
      "title": "Sky Racket",
      "year": 1937,
      "imdbRating": 4.6,
      "imdbVotes": 117,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004635",
      "title": "The Squaw Man",
      "year": 1914,
      "imdbRating": 5.7,
      "imdbVotes": 1035,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.613Z"
}