{
  "movieId": "tt0034225",
  "title": "Sport Chumpions",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sport-chumpions-1941",
      "id": "sport-chumpions-1941",
      "title": "Sport Chumpions (1941)",
      "description": "Sport Chumpions is a 1941 Merrie Melodies short directed by Friz Freleng. Watch on RetroFlix.org:  https://retroflix.org/sport-chumpions-1941/",
      "fileSize": 44629508,
      "addedAt": "2026-01-07T00:11:35.627Z",
      "thumbnail": "https://archive.org/services/img/sport-chumpions-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 244
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6,
    "imdbVotes": 303,
    "Genre": "Animation, Short, Comedy",
    "Plot": "A series of unrelated sports gags. Archery: The bullseyes make sense when we see where the archer is standing. Billiards: A trick shot: All the balls move together. Ping pong: The spectators eyes follow the ball... Ski jump: A long, long chute and a very short jump. Track: The hurdlers climb the hurdles like ladders. Swimming: The women's champion turns out to be a mermaid. A men's champion demonstrates strokes, ending with the crawl (on the bottom of the pool, on all fours). We see dives, ending with a seedy bar. Crew: We pull back from the first three precision rowers to see a real mess. Bicycle track racing: \"Monotonous, isn't it?\" Baseball: A talkative catcher gets knocked back by the ball. Football: Avery Memorial Stadium, with every seat on the 50-yard line one row wide and hundreds tall. On field: The QB calls signals and hops around. A ref emerges from under a pileup: \"Is it a touchdown? Mmm, could be.\" The play is diagrammed into a huge tangle. Auto racing: The winner is blurred even standing still.",
    "Director": "Friz Freleng",
    "Writer": "Michael Maltese",
    "Actors": "Jim Bannon, Mel Blanc, Robert C. Bruce",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0034047",
    "tt0034654",
    "tt0034744",
    "tt0032930",
    "tt0035288",
    "tt0035872",
    "tt0155186",
    "tt0033892",
    "tt0033962",
    "tt0034052",
    "tt0032185",
    "tt0032298"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.627Z"
}