{
  "imdbId": "tt0031204",
  "title": "Danger Flight",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/danger_flight",
      "title": "Danger Flight",
      "description": "Our hero tries to straighten out some juvenile delinquents in this adventure based on the comic strip \"Tailspin Tommy.\" You can find more information regarding this film on its IMDb page .",
      "fileSize": 4309105318,
      "id": "danger_flight"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aTQx4dyrQj0",
      "title": "Danger Flight (1939) | Colorized Public Domain Aviation Adventure | John Trent and Marjorie Reynolds",
      "description": "Danger Flight (1939) is an American aviation adventure film produced by Grand National Pictures and directed by Howard Bretherton. Starring John Trent, Marjorie Reynolds, and Milburn Stone, this public domain classic captures the excitement of early aviation cinema while weaving in themes of mentorship, loyalty, and youthful ambition. This restored and colorized edition brings a forgotten 1930s gem into vivid new life for modern audiences in the United States, Europe, and worldwide, making it more engaging for both classic movie fans and first-time viewers.\n\nPlot Summary:\nThe story centers on Tailspin Tommy Tompkins (John Trent), an experienced pilot and mentor who inspires the next generation of aviators. A young boy, Whitey (Billy Halop), dreams of becoming a pilot and looks up to Tommy as a role model. Despite Whitey’s troubled background, Tommy sees his potential and encourages him to pursue aviation through the Junior Air Defenders, a youth aviation club designed to promote discipline, teamwork, and patriotism.\n\nThe narrative unfolds as Whitey struggles between the guidance of Tommy and the negative influences of his criminal older brother. When gangsters become involved in a daring theft, Whitey finds himself caught between loyalty to family and the values instilled by his aviation hero. The climax of the film involves both suspense in the skies and a test of Whitey’s moral compass, with Tommy stepping in to help him make the right choice.\n\nDanger Flight combines the thrills of flight sequences with heartfelt drama, highlighting the inspirational role of aviation during the 1930s. Released just before World War II, the film also reflects the era’s cultural fascination with aviation as both a symbol of progress and national pride.\n\nCast and Crew:\n• Director: Howard Bretherton\n• Screenplay: George Waggner (adaptation of Hal Forrest’s Tailspin Tommy comic strip)\n• Story: Based on “Tailspin Tommy” by Hal Forrest and Glenn Chaffin\n• Cinematography: Fred Jackman Jr.\n• Editing: Edward Schroeder\nStarring:\n• John Trent as Tailspin Tommy Tompkins\n• Marjorie Reynolds as Betty Lou Barnes\n• Milburn Stone as Skeeter Milligan\n• Billy Halop as Whitey\n• William Ruhl as Big Bill\n• George Lynn as Joe\n• Robert Kent as Reporter\n\nFilm Significance:\nDanger Flight is part of the “Tailspin Tommy” film series, based on one of America’s earliest aviation comic strips. By the late 1930s, aviation-themed films were highly popular, tapping into the public’s fascination with airplanes and technological progress. The film also offered Depression-era audiences messages of hope and responsibility, encouraging young people to embrace aviation not just as an adventure, but as a path to character-building.\n\nThough modest in budget, Danger Flight stands out for its combination of aviation thrills, crime drama, and wholesome moral themes. It features early performances from actors like Milburn Stone, who would later become widely known as Doc Adams on the long-running TV series “Gunsmoke.” The presence of Marjorie Reynolds adds warmth and charm, while John Trent’s portrayal of Tailspin Tommy captures the heroic, aspirational figure so beloved by 1930s audiences.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Danger Flight remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white in 1939, Danger Flight delivered excitement through aerial stunts and heartfelt storytelling. While authentic to its time, black-and-white visuals can feel distant to modern viewers. This colorized version revitalizes the action and drama, bridging the gap between history and contemporary entertainment. It enhances immersion without sacrificing authenticity, making the film’s adventure and moral lessons more impactful for today’s global audiences.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#DangerFlight #TailspinTommy #JohnTrent #MarjorieReynolds #MilburnStone #1930sMovies #AviationAdventure #PublicDomainMovie #ColorizedClassic",
      "id": "aTQx4dyrQj0",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-bmgfy3BBo4",
      "title": "Danger Flight (1939) TAILSPIN TOMMY",
      "description": "Stars: John Trent, Marjorie Reynolds, Milburn Stone\nDirector: Howard Bretherton\n\nTailspin Tommy is flying through a severe storm to deliver a payroll. What he doesn't know is that a gang of crooks is setting a trap for him in order to get their hands on the money!",
      "id": "-bmgfy3BBo4",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WXXJfHZImw4",
      "title": "Danger Flight (1939) Tailspin Tommy: An American Hero Soaring Above Fear",
      "description": "Danger Flight (aka Scouts of the Air) is a 1939 American film directed by Howard Bretherton and starring John Trent as Tailspin Tommy Tompkins, Marjorie Reynolds, Milburn Stone and Jason Robards Sr. The film featured young aviation enthusiasts in a model club.\n\nBlack & White version: https://youtu.be/Nt0fqPyryYY\n\nMain actors:\nJohn Trent - Tailspin Tommy Tompkins\nMarjorie Reynolds - Betty Lou\nMilburn Stone - Skeeter\nJason Robards Sr. - Paul Smith\nTommy Baker - Whitey Lewis\nDennis Moore - Mike Lewis\nJulius Tannen - Dawson\nEddie Parker - Williams\nJoseph E. Bernard - Brown\nHarry Harvey Jr. - Johnny\nWalter Wills - Cap\nForrest Taylor - Police Radio Dispatcher\n\nSubtitles are available",
      "id": "WXXJfHZImw4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "65 min",
    "imdbRating": 5.6,
    "imdbVotes": 107,
    "Genre": "Adventure, Romance",
    "Plot": "Tailspin Tommy is flying through a severe storm to deliver a payroll. What he doesn't know is that a gang of crooks is setting a trap for him in order to get their hands on the money.",
    "Director": "Howard Bretherton",
    "Writer": "Byron Morgan, Edwin C. Parsons, Hal Forrest",
    "Actors": "John Trent, Marjorie Reynolds, Milburn Stone",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0033060",
      "title": "Sky Patrol",
      "year": 1939,
      "imdbRating": 5.2,
      "imdbVotes": 113,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032790",
      "title": "Midnight Limited",
      "year": 1940,
      "imdbRating": 5.1,
      "imdbVotes": 258,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031715",
      "title": "Navy Secrets",
      "year": 1939,
      "imdbRating": 5.7,
      "imdbVotes": 112,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0031703",
      "title": "Mystery Plane",
      "year": 1939,
      "imdbRating": 5.1,
      "imdbVotes": 90,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0031495",
      "title": "Irish Luck",
      "year": 1939,
      "imdbRating": 5.5,
      "imdbVotes": 224,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031975",
      "title": "Star Reporter",
      "year": 1939,
      "imdbRating": 5.2,
      "imdbVotes": 132,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034188",
      "title": "Sign of the Wolf",
      "year": 1941,
      "imdbRating": 5.8,
      "imdbVotes": 74,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029055",
      "title": "It Happened Out West",
      "year": 1937,
      "imdbRating": 4.9,
      "imdbVotes": 28,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0031082",
      "title": "Barricade",
      "year": 1939,
      "imdbRating": 5.7,
      "imdbVotes": 158,
      "language": "English, Mandarin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031691",
      "title": "Mutiny on the Blackhawk",
      "year": 1939,
      "imdbRating": 6.4,
      "imdbVotes": 72,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031619",
      "title": "The Man in the Iron Mask",
      "year": 1939,
      "imdbRating": 7,
      "imdbVotes": 1988,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029847",
      "title": "Air Devils",
      "year": 1938,
      "imdbRating": 4.8,
      "imdbVotes": 84,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.628Z"
}