{
  "movieId": "tt0045573",
  "title": "Born to the Saddle",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/born_to_the_saddle",
      "id": "born_to_the_saddle",
      "title": "Born to the Saddle",
      "description": "While investigating his father's death, a man become friendly with the rancher he thinks killed his father. You can find more information regarding this film on its IMDb page .",
      "fileSize": 4490587469,
      "addedAt": "2026-01-07T00:07:38.720Z",
      "thumbnail": "https://archive.org/services/img/born_to_the_saddle",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 132256
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WjiG6GU4Y0k",
      "id": "WjiG6GU4Y0k",
      "title": "Born to the Saddle (1953) WESTERN",
      "description": "Stars: Leif Erickson, Donald Woods, Rand Brooks\nDirector: William Beaudine\n\nWhen a young man agrees to race a wonderful quarter horse, a crooked, wife abusing, gambler has plans to sabotage the contest.",
      "addedAt": "2025-12-26T23:49:07.845Z",
      "thumbnail": "https://i.ytimg.com/vi/WjiG6GU4Y0k/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDKXrmySevPHRcSXjShLIpIx6XZ4g",
      "duration": 4495,
      "language": "en",
      "year": 1953,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": 5.8,
    "imdbVotes": 111,
    "Genre": "Western",
    "Plot": "Bent on revenge for the death of his father and the theft of their ranch, young Bill Walton rides into town seeking the aid of his uncle. As he rides into town, he takes a bullet meant for gambler Matt Daggett and across the street lies his uncle, victim of the gambler's gun. Dagget looks on Bill as 'good luck' and nurses him back to health and gives him the job of training \"Blue Chip\", the fastest quarter horse in the west, for a big race. Bill doesn't know that Dagget plans to fix the race and put his own money on another horse at heavy odds. Quartered at the nearby ranch of John Grant, Bill meets Jerri Marshall, daughter of Bob Marshall, who lost \"Blue Chip\" to Daggett in a crooked gambling deal. Grant gets mixed up in a stage coach robbery and killing and rides back to the ranch with Daggett henchman Red Roper. When Roper tries to molest a woman, Bill bluffs him with an empty gun and forces him back to town. Roper is arrested for the killing and implicates Grant. Incited by Daggett, who fears exposure as the outlaw leader, a paid mob breaks into the jail and both Grant and Roper are hanged, but Grant, barely able to touch a plank with the toe of his boot, clings to life until Bill finds him and cuts him down. On the day of the race, Daggett lures Bill away from \"Blue Chip\" long enough for a wire to be twisted around the horse's leg at the fetlock. \"Blue Chip\" goes lane partly through the race but races on in agony and wins. Daggett tries to hide his treachery by blaming the lameness on a broken leg and draws his gun to shoot the horse. Marshall intervenes and is shot by the gambler. Bill discovers the wire and now also knows that Daggett is the outlaw leader responsible for his father's death and the hanging of his friend Grant. Bill heads for the saloon to confront Daggett. Just as the gambler turns to fire on Bill, Grant appears. When the smoke clears both Daggett and Grant are dead.",
    "Director": "William Beaudine",
    "Writer": "Gordon Ray Young, Adele Buffington",
    "Actors": "Leif Erickson, Donald Woods, Rand Brooks",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041976",
    "tt0060558",
    "tt0046105",
    "tt0044406",
    "tt0045645",
    "tt0045954",
    "tt0046384",
    "tt0046140",
    "tt0046399",
    "tt0045840",
    "tt0046347",
    "tt0046422"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.720Z"
}