{
  "movieId": "tt0051435",
  "title": "The Brothers Karamazov",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vx2IU53lmbk",
      "id": "Vx2IU53lmbk",
      "title": "The brothers Karamazov, Part One",
      "description": "Based on the novel by F.M. Dostoevsky. The tragic story of the Karamazov family takes place in the Russian province at the end of the 19th century. The relationship between the father and three brothers who are completely different from each other is complex and contradictory. One of the brothers is accused of murdering father, which he did not commit. The brothers are unable to help him, and only a loving girl follows him to hard labor. \n\nAfter the death of director Ivan Pyriev , work on the film was completed by actors M. Ulyanov and K. Lavrov.\n\nIMDb rating: 7.7\n\nYear of production: 1968\n\nDirector: Ivan Pyrev, Kirill Lavrov, Mikhail Ulyanov\nScreenwriter: Ivan Pyryev\nComposer: Isaac Schwartz\nCinematographer: Sergei Vronsky\nArt director: Volkov Stalen\n\nStarring: Andrey Abrikosov, Andrey Myagkov, Nikulin Valentin, Yevgeny Teterin, Sergey Kalinin, Kirill Lavrov, Mikhail Ulyanov, Ivan Lapikov, Osenev Vladimir, Danilova Alexandra, Georgiou Georgiu, Pavlenko Pavel, Khvylia Alexander, Filippov Victor, Stanislav Chekan, Tamara Nosova , Korkoshko Svetlana, Urusova Evdokia (Edda), Pertsovsky Mark, Pyreva Lionella, Yukhtin Gennady, Kolpakov Viktor, Podgorny Nikita, Prudkin Mark, Korneva Lyubov, Bubnov Nikolai, Prokopovich Nikolai, Chuvaeva Olga, Vlasov Ivan, Volshaninova Rada, Dianova Zhanna, Matov Vasily, Varvara Popova, Yury Rodionov, Pavel Strelin, Mykola Parfenov, Alexey Stroev",
      "addedAt": "2025-12-23T03:44:44.980Z",
      "thumbnail": "https://i.ytimg.com/vi/Vx2IU53lmbk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCvY000ISAN9DDo0bJsC4W4XVG6BA",
      "duration": 4858,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Hk9EqtkaE4M",
      "id": "Hk9EqtkaE4M",
      "title": "The brothers Karamazov, Part Two",
      "addedAt": "2025-12-23T03:44:45.481Z",
      "thumbnail": "https://i.ytimg.com/vi/Hk9EqtkaE4M/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCojJ55ut1f2evNE5Diz5yVdOmwEQ",
      "duration": 4360,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8L89ZiQuBiM",
      "id": "8L89ZiQuBiM",
      "title": "The brothers Karamazov, Part Three",
      "addedAt": "2025-12-23T03:44:45.982Z",
      "thumbnail": "https://i.ytimg.com/vi/8L89ZiQuBiM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDqFxcn1ze4gEJEZ8UC-xJmiLerzQ",
      "duration": 4518,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "145 min",
    "imdbRating": 6.7,
    "imdbVotes": 3126,
    "Genre": "Drama, Romance",
    "Plot": "It's the 1870s in the small Russian town of Ryevsk. The lusty Fyodor Karamazov, a bit of a cad who has lived off the wealth of his long deceased first wife, has never loved any of his four now adult sons, including his illegitimate epileptic son, Pavel Smerdjakov, who he employs as his personal servant. The four brothers were largely raised apart. Alexi, the youngest, is the only one who loves his father, but does so as he loves all mankind in his piety. Second eldest Ivan, who lives most of the time in Moscow working in the newspaper business, is the emotionally troubled one. And the eldest Dmitri, an army lieutenant and the only offspring on Fyodor's first wife, knows that he is most like their father, and as such has the greatest animosity toward him in their mutual depravity. Dmitri has knowingly racked up gambling debts in waiting for what he considers his fair share of his mother's wealth, something that Fyodor will not willingly give to him but will loan on a request by request basis which now does not include paying for Dmitri's gambling debts. As a matter of circumstance, Dmitri gets engaged to a virtuous young woman named Katya, for both as a matter of honor, although Katya mistakes that honor for love. The situation between all members of the Karamazov family becomes more complex when Fyodor takes measures to make it more difficult for Dmitri, who meets tavern owner Grushenka in the process. Dmitri falls in love with Grushenka and eventually wants to become an honorable man in all aspects of his life for her, their relationship despite Fyodor himself having asked her previously to marry him.",
    "Director": "Richard Brooks",
    "Writer": "Julius J. Epstein, Fyodor Dostoevsky, Constance Garnett",
    "Actors": "Yul Brynner, Maria Schell, Claire Bloom",
    "Language": "English, Polish, Russian",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 2 wins & 7 nominations total"
  },
  "relatedMovies": [
    "tt0047162",
    "tt0050782",
    "tt0053793",
    "tt0051429",
    "tt0051476",
    "tt0051987",
    "tt0053226",
    "tt0052270",
    "tt0051666",
    "tt0053270",
    "tt0051411",
    "tt0052106"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:31:03.523Z"
}