{
  "imdbId": "tt0034264",
  "title": "Tanks a Million",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TanksaMillion",
      "id": "TanksaMillion",
      "title": "Tanks a Million",
      "description": "The movie starts with William Tracy as Dodo Doubleday, proving his incredible memory on a radio talk show. He joins the army after memorizing the regulations, which gets him quickly promoted to sergeant. His youth and inexperience bothers the other NCO's, namely Sgt. Ames (Joe Sawyer), who spends the movie trying to get Doubleday in trouble. But because of is inherent honesty and cleverness, Doubleday is able to bumble through the requisite series of mishaps and inspire loyalty in what looked to be a renegade unit. You can find the third film of this series of four here Hay Foot",
      "fileSize": 1497168330,
      "addedAt": "2026-01-07T00:06:58.271Z",
      "thumbnail": "https://archive.org/services/img/TanksaMillion",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 12132
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dATfnaS08Zg",
      "id": "dATfnaS08Zg",
      "title": "Tanks a Million (1941) WWII COMEDY",
      "description": "Stars: William Tracy, Joe Sawyer, Noah Beery Jr.\n Director: Fred Guiol\n\n William Tracy stars as Dodo Doubleday, a feckless Army draftee blessed with a photographic memory. On the verge of being booted out of service because of his constant bumbling, Doubleday redeems himself by curing his commanding officer of a bad case of \"mike fright\" just before a network radio broadcast.",
      "addedAt": "2025-12-26T23:52:14.425Z",
      "thumbnail": "https://i.ytimg.com/vi/dATfnaS08Zg/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhaIFooWjAP&rs=AOn4CLCCWTmZ7EVwUcrAjmpy-89vYDW7LA",
      "duration": 3013,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "50 min",
    "imdbRating": 5.9,
    "imdbVotes": 308,
    "Genre": "Adventure, Comedy, Romance",
    "Plot": "Dorian \"Dodo\" Doubeday (William Tracy), an information clerk in a railroad station, has a photography memory. \"Dodo\" takes advantage of every free moment to devour the pages of the U. S. army manuals, because he knows he will soon be drafted at the same time as his buddy Charlie Cobb (Noah Beery, Jr.), who is addicted to playing practical jokes and doesn't share the same enthusiasm for being in the army. They are sent to same basic-training camp as Jeanne (Elyse Knox), who has joined the Servicemen Entertainment League, attached to all the service encampments. Because of his genius for memorizing data \"Dodo\" is made a sergeant.T his arouses resentment among the group of tough guys with whom he and Charlie had been drafted and, also , regular-army Sergeant William Ames, who does everything in his power to prove \"Dodo's \" inefficiency to Captain Rossmead (Douglas Fowley0 and Major Greer (Wiliam Gould). But \"Dodo\" always comes out on top when he manages to recite some obscure army regulation which justifies his unorthodox action. To make things tougher on \"Dodo\", Sergeant Ames has him assigned as an orderly to Colonel \"Spitfire\" Barkley (James Gleason), the toughest taskmaster in the army...who also knows the army regulations from A-to-Z. Is there trouble on the horizon for \"Dodo\"?",
    "Director": "Fred Guiol",
    "Writer": "Paul Gerard Smith, Warren Wilson, Edward E. Seabrook",
    "Actors": "William Tracy, James Gleason, Noah Beery Jr.",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    "tt0033912",
    "tt0033696",
    "tt0034831",
    "tt0037033",
    "tt0028662",
    "tt0034009",
    "tt0032511",
    "tt0033787",
    "tt0044962",
    "tt0034089",
    "tt0033646",
    "tt0025681"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.271Z"
}