{
  "imdbId": "tt0028343",
  "title": "Tango",
  "year": 1936,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=P84Bh5lSlL8",
      "id": "P84Bh5lSlL8",
      "title": "Tango (1936) ROMANCE",
      "description": "Stars: Marian Nixon, Chick Chandler, Marie Prevost\nDirector: Phil Rosen\n\nA beautiful chorus girl falls for a wealthy playboy, but his family wants him to marry someone more respectable. With the help of her bandleader will she find true love?",
      "addedAt": "2025-12-26T23:45:15.883Z",
      "thumbnail": "https://i.ytimg.com/vi/P84Bh5lSlL8/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLBqlHglEwxHKmx1DcBqXrDOfjT2lA",
      "duration": 4159,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": 5.2,
    "imdbVotes": 60,
    "Genre": "Drama",
    "Plot": "In New York City, hungry orphan \"Treasure\" McGuire tries to get a job as a stenographer at the advertising firm of Carver, Enright and Burt, but is turned down. Sneaking into the office, Treasure walks in on a team of composers writing a \"jingle\" for Kluckmeyer's Hosiery Radio Hour , who ask for her advice and offer to buy her a meal. One of the writers, Oliver Huston, introduces Treasure to a photographer named Oscar, who is taking pictures for an advertising campaign for \"Tango\" hosiery, a Kluckmeyer brand. After donning a pair of silk stockings, Treasure is transformed into a masked Spanish lady, and Oscar offers her a job as a model. At home, Treasure's roommate, Betty Barlow, refuses to speak to her boyfriend, taxi driver Joe Sloan, who wants to marry her. The next day, when Treasure meets one of the firm's partners, playboy Foster Carver, he asks her to dinner to entertain an important client, but when she realizes they will be dining alone, she sneaks out of the restaurant. The next day, Foster's more sincere-natured brother Tony asks Treasure to lunch, and Foster threatens to fire her. Just then Kluckmeyer enters, however, and, raving about Treasure's photos, makes her \"The Tango Girl\" and orders hundreds of photos of her in his hosiery. At lunch, Tony tells Treasure that when he gets his inheritance at age twenty-one, he will be starting his own ad agency. Foster, scheming to ruin Treasure, tells his mother that Tony will cause a family scandal by slumming with Treasure. Later, Foster warns Treasure not to see Tony and, when she refuses to be \"bought off,\" tries to fire her. She quits first, though, as does Oliver, after punching Foster. Treasure then refuses to see Tony, and after Joe suggests that she date mechanic Gerry Moriarity, she tells Tony that she is engaged to Gerry. Tony earnestly proposes, however, and he and Treasure marry across state lines, planning to announce their marriage when Tony is twenty-one. Meanwhile, Betty finally agrees to marry Joe. Although Tony and Treasure rent an apartment as \"Mr. and Mrs. Anthony McGuire,\" Foster finds out about the marriage because the license was made out in their real names. Deeming Treasure's magazine ads scandalous, Foster and his mother decide to have the marriage annulled, and Foster schemes to disillusion Tony about his bride. Foster instructs his valet to steal Tony's keys, then changes one of Treasure's cashed paychecks from twenty dollars to two-thousand, to make her appear to be a gold digger. Foster then visits Treasure and informs her of the annulment, then slips an expensive cigarette case in her chair. Tony finds the case, but remains unsuspicious, and Treasure makes him promise to return to her on June 3rd, his twenty-first birthday. Meanwhile, Tony is forced to live at his mother's house, where Foster, finding the case, tells Tony it belongs to him, then shows Tony a duplicate key to his apartment and the forged check stub. Believing that Treasure has betrayed him, Tony leaves for London to work, and Foster mails Treasure money and letters in Tony's name. Now pregnant, Treasure moves into a boardinghouse, and during the next year, gives birth to a boy. One night, Treasure visits Oliver, whose club is closing, and offers to approach Kluckmeyer for funds to keep the club open. Excited to see his \"Tango Girl\" again, Kluckmeyer decides to open the \"Club Tango\" with Oliver and Treasure. The club's opening is a success, and Treasure plans to quit on June 2nd, in anticipation of Tony's return, and rent their old apartment. On June 3rd, however, the newspapers announce Tony's engagement to a woman of his own class. Oliver then visits with flowers, offers to take care of Treasure and the baby, and confesses his love for her. During Oliver's show, Kluckmeyer finally gets through on the telephone to the Carvers', and Oliver races to confront Tony. When Oliver mentions Tony's letters, he realizes that Foster wrote them and that he has been duped. As Treasure packs for a move to Chicago, Tony finally arrives and tells her he is not engaged. As Tony swears his love for Treasure, Betty enters the bedroom with the baby. While Tony meets his son, Betty and Joe kiss.",
    "Director": "Phil Rosen",
    "Writer": "Arthur T. Horman, Vida Hurst",
    "Actors": "Marian Nixon, Chick Chandler, Marie Prevost",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027568",
    "tt0027974",
    "tt0027398",
    "tt0027564",
    "tt0028135",
    "tt0027399",
    "tt0026131",
    "tt0029812",
    "tt0026003",
    "tt0024870",
    "tt0028375",
    "tt0023128"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:31:38.616Z"
}