{
  "movieId": "tt0012468",
  "title": "Molly O'",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MollyO1921",
      "id": "MollyO1921",
      "title": "MOLLY O (1921)",
      "description": "MOLLY O' Mack Sennett-Associated First National, [Mack Sennett-Paramount] 7,588 ft., rel. Dec. 1, 1921 dir. F. Richard Jones, assisted by Ray Grey, photography Homer Scott, auth. Mary Hunt and Fred Stowers, film edtr. Allen McNeil, Titles John Gray, Art Director S. D. Barnes, Costumes Violet Schrader cast: Mabel Normand (Molly O), Jack Mulhall (Dr. John S. Bryant), George Nichols (Tim O'Dair), Lowell Sherman (Fred Mancester), Eddie Gribbon (Jim Smith), Anna Hernandez (Mrs. Tim O'Dair), Jacqueline Logan (Miriam Mancester), Albert Hackett (Billy O'Dair), Ben Deeley (Albert Faulkner), Carl Stockdale (The Silhouette Man), Eugenie Besserer (Antonia Bacigalupi), Gloria Davenport (Mrs. James Wheaton Robbins) filmed: 5/30 to 6/29, 1921 Locations: Los Angeles, CA, Pensacola, FL copyright: Oct. 24, 1921 This copy is from the print that surfaced at the Gosfilmofund in Moscow, Russia in the early 1990's; and at least a pair of reels are missing. However, their absence occurs in the early part of the movie and does not seriously impair watching the film in toto. Until UCLA comes out on DVD with their restored version (and why, after all, don't they?), this is about as good a print as one's likely to see. For the script and title cards in English, see: http://www.angelfire.com/mn/hp/mollyotxt.html Special thanks to Marilyn Slater, Mabel Normand archivist and historian, for making this upload possible. Note. The version for .avi download here is somewhat better in picture quality than the one presented on video.",
      "fileSize": 1900224069,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/MollyO1921",
      "collection": "feature_films",
      "downloads": 1659
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MollyOForYT",
      "id": "MollyOForYT",
      "title": "\"Molly O'\" (1921) starring Mabel Normand",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"Molly O'\" is a romantic comedy with touches of drama. A simple girl suddenly comes face to face with the man of her dreams.   Directed by                    F. Richard Jones Produced by                  Mack Sennett-Mabel Normand Productions Written by                     Mack Sennett Starring                         Mabel Normand, Jack Mulhall, George Nichols, Jacqueline Logan Release date                   November 20, 1921 Running time                 58 minutes Country                          United States Language                        Silent film   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 111984462,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/MollyOForYT",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 3249
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6.3,
    "imdbVotes": 73,
    "Genre": "Comedy",
    "Plot": "An Irish washerwoman's daughter falls in love with one of America's most eligible bachelors, much to the dismay of the girl's parents -- and the young doctor's newly acquired fiancée! Events come to a head at the charity masked ball, which the two girls happen to attend in very similar costumes, thanks to the largesse of Molly's benevolent \"fairy godfather\"; Molly is mistaken for her rival, much to the indignation both of her working-class would-be suitor and the doctor's would-be bride. However, the repercussions that follow serve only to thrust her into her dream man's arms, and all looks set for a fairytale ending... until the disgruntled rival finds a way to get back at Molly through her family...",
    "Director": "F. Richard Jones",
    "Writer": "John Grey, Mary Hunt, Mack Sennett",
    "Actors": "Mabel Normand, George Nichols, Anna Dodge",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0014522",
    "tt0014029",
    "tt0010925",
    "tt0005475",
    "tt0009369",
    "tt0011848",
    "tt0381908",
    "tt0012701",
    "tt0011916",
    "tt0012224",
    "tt0012253",
    "tt0012353"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}