{
  "imdbId": "tt0030089",
  "title": "The Duke Is Tops",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheDukeisTops",
      "id": "TheDukeisTops",
      "title": "The Duke is Tops",
      "description": "Duke Davis (Ralph Cooper) has invested all his savings to back his sweetheart, Ethel (Lena Horne), in a road show over the old T.O.B.A. circuit, on which they have both been performers since childhood. Marshall (Monte Hawley), a New York talent scout, makes an offer to Ethel as a single and, to induce her to take it, Duke writes a fake check, made out to him, for $5000 pretending he has sold his contract with Ethel to Marshall. Resentful and heartbroken, she accepts and becomes a big hit in New York.",
      "fileSize": 1913505129,
      "addedAt": "2026-01-07T00:06:58.274Z",
      "thumbnail": "https://archive.org/services/img/TheDukeisTops",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 20546
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=F2chqVMn4Jw",
      "id": "F2chqVMn4Jw",
      "title": "The Duke Is Tops (1938) | Colorized Public Domain Musical Romance with Lena Horne and Ralph Cooper",
      "description": "The Duke Is Tops (1938) is an American musical romance directed by William L. Nolte and produced by Million Dollar Productions, one of the first Black-owned film studios in Hollywood. This colorized and restored version celebrates a milestone in African-American cinema, marking the screen debut of the legendary Lena Horne. Through color restoration and digital enhancement, Colorized Public Domain reintroduces this vibrant piece of history to modern audiences in the United States, Europe, and beyond — preserving its charm, rhythm, and cultural legacy for a new generation.\n\nPlot Summary:\nThe story follows Duke Davis, a charismatic stage producer and performer who manages a touring musical revue across the country. He discovers and falls in love with Ethel Andrews, a talented young singer whose voice captivates every audience. When a major opportunity arises in New York, Duke sacrifices his own career to help Ethel chase her dream of stardom, hiding his heartbreak as her fame grows.\n\nAs Ethel’s career flourishes, she faces the pressures of fame, loneliness, and exploitation by those who seek to profit from her success. Meanwhile, Duke’s fortunes fade — until fate brings them back together for one final show that tests their love, pride, and artistic integrity. The film’s blend of jazz numbers, dance performances, and heartfelt drama captures the spirit of 1930s Black entertainment culture — full of rhythm, resilience, and romantic optimism amid social hardship.\n\nCast and Crew:\n• Director: William L. Nolte\n• Producer: Alfred N. Sack\n• Screenplay: Ralph Cooper\n• Cinematography: Jack Greenhalgh\n• Editing: Holbrook N. Todd\nStarring:\n• Ralph Cooper as Duke Davis\n• Lena Horne as Ethel Andrews\n• Laurence Criner as Doc Dorando\n• Monte Hawley as Mr. Marshall\n• Edward Thompson as Mr. Burns\n• Vernon McCalla as Mr. Smith\n• Amon Davis as Mr. Powers\n• Ralph Brown as Doc Patterson\n\nFilm Significance:\nThe Duke Is Tops stands as an essential example of early African-American filmmaking during an era of racial segregation in Hollywood. Produced outside the major studio system, the film showcased talented Black performers who were often excluded from mainstream cinema. It also marked Lena Horne’s film debut, predating her rise to stardom at MGM.\nThe movie combines romance, comedy, and musical variety, echoing the energy of Harlem’s nightlife and the artistic pride of the 1930s Black entertainment scene. Its original jazz soundtrack and live performance sequences helped preserve the cultural flavor of the pre-war era. Colorized Public Domain’s restoration adds visual vibrancy to the sets, costumes, and stage lights, bringing the musical spectacle closer to how audiences might have experienced it live.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Duke Is Tops remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1938 version was filmed in black and white with limited resources, typical of independent Black productions of the time. By colorizing this edition, audiences can now experience the vibrancy of the music, costumes, and nightlife that defined the Harlem Renaissance era. The restored visuals highlight Lena Horne’s elegance and the lively choreography that once electrified segregated theaters. This edition offers both entertainment and cultural insight — a true revival of one of the earliest musical romances led by an all-Black cast.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheDukeIsTops #LenaHorne #RalphCooper #1930sMusical #PublicDomainMovie #ColorizedClassic #AfricanAmericanCinema #JazzAge #ClassicRomance #GoldenAgeHollywood #BlackCinemaHistory #FilmRestoration #HarlemRenaissance #1938Movies #ClassicMusicFilm",
      "addedAt": "2025-12-24T00:47:05.221Z",
      "thumbnail": "https://i.ytimg.com/vi/F2chqVMn4Jw/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBWKEswDw==&rs=AOn4CLBz-08F6Gy47L6Ru5RilxP1O7gzMQ",
      "duration": 4425,
      "language": "en",
      "year": 1938,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2SgN8J_v2cw",
      "id": "2SgN8J_v2cw",
      "title": "The Duke is Tops (1938) LENA HORNE",
      "description": "BLACK HISTORY MONTH\nStars: Ralph Cooper, Lena Horne, Laurence Criner \nDirectors: William L. Nolte, Ralph Cooper\n\nA theatrical producer puts aside his own success to boost the career of a talented singer.",
      "addedAt": "2025-12-26T23:48:50.583Z",
      "thumbnail": "https://i.ytimg.com/vi/2SgN8J_v2cw/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDmlYGBLsGzlABw441mqR70vxojww",
      "duration": 4513,
      "language": "en",
      "year": 1938,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6oY3FfazgEg",
      "id": "6oY3FfazgEg",
      "title": "The Duke Is Tops (1938) Lena Horne - Comedy, Drama, Musical, Full Length Movie",
      "description": "A theatrical producer puts aside his own success to boost the career of a talented singer.\n \nDirectors: William L. Nolte, Ralph Cooper\nWriters: Phil Dunham, Ralph Cooper\nStars: Ralph Cooper, Lena Horne, Laurence Criner \nGenres: Classics, Comedy, Drama, Musical\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:49:26.185Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/6oY3FfazgEg/maxresdefault.webp?v=6295e619",
      "duration": 4491,
      "language": "en",
      "year": 1938,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "73 min",
    "imdbRating": 5.4,
    "imdbVotes": 391,
    "Genre": "Comedy, Drama, Musical",
    "Plot": "Duke Davis has invested all his savings to back his sweetheart, Ethel, in a road show over the old T.O.B.A. circuit, on which they have both been performers since childhood. Marshall, a New York talent scout, makes an offer to Ethel as a single and, to induce her to take it, Duke writes a fake check, made out to him, for $5000 pretending he has sold his contract with Ethel to Marshall. Resentful and heartbroken, she accepts and becomes a big hit in New York. Marshall then books her at the swanky Century Club, plans her show himself, and it flops miserably. Meanwhile, Duke has used his last resources to start a new show, but without Ethel it also fails. He joins the Doc Dorando medicine show, and with him as the speiler for the quack elixir sold by Dorando, it is successful. He becomes Doc's partner with an elaborate trailer and a company of entertainers, including Willie Covans, the Basin Street Boys, The Cats and the Fiddle, \"Rubberneck\" Holmes and Joe Stevenson. Money is rolling in but he drops everything to hurry to Ethel's side when he hears of her misfortune. Ella, Ethel's faithful companion and maid, has also told Ethel of Duke's sacrifice in order to give her a chance in New York. Duke talks the Century Club owner, Fenton, into allowing him to build an elaborate show based on a medicine show concept, and sends for Doc Dorando and the other entertainers.",
    "Director": "William L. Nolte, Ralph Cooper",
    "Writer": "Phil Dunham, Ralph Cooper",
    "Actors": "Ralph Cooper, Lena Horne, Laurence Criner",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029626",
    "tt0032410",
    "tt0032847",
    "tt0027347",
    "tt0049397",
    "tt0029939",
    "tt0023845",
    "tt0030445",
    "tt0019933",
    "tt0030063",
    "tt0030359",
    "tt0030540"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.274Z"
}