{
  "movieId": "tt0020866",
  "title": "Extravagance",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Extravagance1930",
      "id": "Extravagance1930",
      "title": "Extravagance (1930)",
      "description": "Alice Kendall is part of the social elite, and her mother has spent a fortune giving her luxuries. When Alice marrries Fred Garlan her mother wishes him luck as he will need it. Alice wants a new sable coat but Fred can't afford it. When she shows up with a coat, suspicions start to fly. Mystic Nights Videos",
      "fileSize": 1701229894,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/Extravagance1930",
      "collection": "feature_films",
      "downloads": 27748
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Extravagance1930bwPre-codeFilm",
      "id": "Extravagance1930bwPre-codeFilm",
      "title": "Extravagance",
      "description": "* Released: 1930 * Drama (Eng USA) * 1930s Pre-Code B&W Film * Tiffany Pictures * SUMMARY: Story of cheat, deception, and (possibly) even murder. * DIRECTOR: Phil Rosen * WRITER: A.P. Younger (Orig Story) * STARRING: June Collyer (Alice Kendall Hughes), Lloyd Hughes (Fred), Owen Moore (Jim Hamilton), Dorothy Christy (Esther Hamilton), Jameson Thomas (Morrell), Bobbie [Robert] Agnew (Billy), Gwen Lee (Sally), Nella Walker (Mrs. Kendall) * SOURCE: 1) MrFilmschatten 2) Film itself 3) Wikipedia * I OWN ZERO % OF THIS MOVIE. I upload for EDUCATIONAL purposes ONLY. Doreen (def gp ddh)",
      "fileSize": 533710507,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/Extravagance1930bwPre-codeFilm",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 4910
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/extravagance-1930",
      "id": "extravagance-1930",
      "title": "Extravagance (1930)",
      "description": "Alice Kendall is the darling of her social set, the sons and daughters of millionaires, although Alice's mother has impoverished herself to provide Alice with the luxuries she expects as her right. Mom blows what's left of her fortune to provide the best trousseau that money can buy when Alice marries Fred Garlan, and then wishes Fred lots of luck. Now, Alice is trying to coax Fred into buying her a new sable coat while Fred is busily trying to borrow enough money to keep his business afloat. Watch on RetroFlix:  https://retroflix.org/extravagance-1930/",
      "fileSize": 386535387,
      "addedAt": "2026-01-07T00:08:24.393Z",
      "thumbnail": "https://archive.org/services/img/extravagance-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 167
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z-S1vBPqm3w",
      "id": "Z-S1vBPqm3w",
      "title": "Extravagance (1930) [Drama]",
      "description": "\"Extravagance\" is a 1930 American film directed by Phil Rosen. Alice Kendall is the darling of her social set, the sons and daughters of millionaires, although Alice's mother has impoverished herself to provide Alice with the luxuries she expects as her right. Mom blows what's left of her fortune to provide the best trousseau that money can buy when Alice marries Fred Garlan, and then wishes Fred lots of luck. Now, Alice is trying to coax Fred into buying her a new sable coat---all of her friends are sporting them---while Fred is busily trying to borrow enough money to keep his business afloat. This marriage business certainly isn't working out like living-with-Mom, and Alice just doesn't know how she can be seen if she isn't wearing a new sable coat. But, help is lurking just around the corner in the form of a sleaze-ball named Morrell. He's a stock-broker and he is a bachelor and he enjoys the benefits of married life by making available sable coats to little brides who are in dire need of one and whose husbands can't meet their needs. But the wives can meet Morrell's needs. Soon, Fred is asking lots of snooping questions of his new bride, such as where did you get that new sable coat? Fred has doubts that Alice caught and skinned a sable in their back yard.\n\n---\n\nDirected by Phil Rosen, written by A.P. Younger (story), Adele S. Buffington (scenario), Phil Rosen (scenario) and and Frances Hyland (scenario), starring June Collyer as Alice Kendall, Lloyd Hughes as Fred Garlan, Owen Moore as Jim Hamilton, Dorothy Christy as Esther Hamilton, Jameson Thomas as Morrell, Gwen Lee as Sally, Robert Agnew as Billy, Nella Walker as Mrs. Kendall, Martha Mattox as Guest and Arthur Hoyt as Guest.\n\n---\n\n\nSource: \"Extravagance (1930)\" IMDb, Internet Movie Database (www.imdb.com). Written by Les Adams. 20 July 2012. http://www.imdb.com/title/tt0020866/plotsummary.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:42:06.445Z",
      "thumbnail": "https://i.ytimg.com/vi/Z-S1vBPqm3w/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDzRfM-gR9qn9t2DLU3iLUsCQNQRg",
      "duration": 3711,
      "language": "en",
      "year": 1930,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4ayS451RLV0",
      "id": "4ayS451RLV0",
      "title": "Extravagance (1930) PRE-CODE HOLLYWOOD",
      "description": "Stars: June Collyer, Lloyd Hughes, Owen Moore \nDirector: Phil Rosen\n\nThe marriage between Jim and Esther Hamilton spirals downhill rapidly when Esther purchases a sable coat for herself and begins imagining herself a glamorpuss!\n\nTRIVIA: Owen Moore was Mary Pickford's stylish leading man in her early career and they secretly married in 1911. Mary left Owen for Douglas Fairbanks, however, and the couple eventually divorced in 1920. A few years later Owen wed silent film actress Kathleen Perry, a marriage that lasted until his sudden death of a heart attack at 54.",
      "addedAt": "2025-12-26T23:50:41.872Z",
      "thumbnail": "https://i.ytimg.com/vi/4ayS451RLV0/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhcIFwoXDAP&rs=AOn4CLCXNjDguVi2yalm-58dk9ytYT-Ggw",
      "duration": 3711,
      "language": "en",
      "year": 1930,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "71 min",
    "imdbRating": 5.7,
    "imdbVotes": 167,
    "Genre": "Drama, Music, Romance",
    "Plot": "Alice Kendall is the darling of her social set, the sons and daughters of millionaires. Alice marries Fred Garlan, and then tries to coax Fred into buying her a sable coat - all of her friends are sporting them - while Fred is busily trying to borrow enough money to keep his business afloat. This marriage business certainly isn't working out like living-with-Mom, and Alice just doesn't know how she can be seen if she isn't wearing a new sable coat. But, help is lurking just around the corner in the form of a sleaze-ball named Morrell. He's a stock-broker and he is a bachelor and he enjoys the benefits of married life by making available sable coats to little brides who are in dire need of one and whose husbands can't meet their needs. But the wives can meet Morrell's needs. Soon, Fred is asking lots of snooping questions of his new bride, such as where did you get that new sable coat? Fred has doubts that Alice caught and skinned a sable in their back yard.",
    "Director": "Phil Rosen",
    "Writer": "Andrew Percival Younger, Adele Buffington, Phil Rosen",
    "Actors": "Owen Moore, June Collyer, Lloyd Hughes",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023128",
    "tt0020697",
    "tt0021243",
    "tt0020446",
    "tt0023587",
    "tt0027568",
    "tt0026131",
    "tt0027564",
    "tt0035261",
    "tt0013802",
    "tt0029812",
    "tt0027399"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.393Z"
}