{
  "movieId": "tt0029584",
  "title": "The Soldier and the Lady",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=65-5znvkJtE",
      "id": "65-5znvkJtE",
      "title": "The Adventures of Michael Strogoff (1937) EPIC SWASHBUCKLER",
      "description": "CLASSIC MOVIE MONDAY~FIRST TIME ON YOUTUBE\nStarring: Anton Walbrook, Akim Tamiroff, Margot Grahame\nBased on a novel by: Jules Verne\nDirected by: George Nichols Jr.\n\nWhen the Russian Empire is threatened by a Tartar uprising, a soldier in the Imperial Army is sent by Tsar Alexander II on a dangerous mission to warn the troops of the pending invasion. Also known as \"The Soldier And The Lady.\"",
      "addedAt": "2025-12-24T01:09:13.077Z",
      "thumbnail": "https://i.ytimg.com/vi/65-5znvkJtE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA1yGQ1Wj1ABfRiRNC9I4UH3p-fog",
      "duration": 5097,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": 6.2,
    "imdbVotes": 271,
    "Genre": "Adventure, History, Romance",
    "Plot": "In Siberia, in 1879, allied Tartar and Mongol hordes, under the leadership of the vulgar rebel Ivan Ogareff, pillage the land and threaten the Tsar Alexander II's rule. From Russia, Alexander II dispatches courier Michael Strogoff to deliver secret military plans to Grand Duke Vladimir, 2,500 miles away at Irkutsk, a Siberian town that is now isolated because telegraph lines have been cut. Because his journey will take him through the town where his mother Martha resides, Michael must deny his natural inclination and pledge not to see her, so that his true identity will not be discovered. While en route by train, the disguised Michael meets the lone girl Nadia and the spy Zangarra, along with two amusing war correspondents, Cyril Blount and Eddie Packer. On a boat to Omsk, Michael saves Zangarra from a bear attack, and in appreciation, she prevents his assassination by Ogareff's henchman Vasiley. Then while Michael, Zangarra and Nadia are traveling by ferry, Tartars attack, and Nadia is captured and Michael, wounded. After awakening in a shepherd's hut, Michael realizes he is behind enemy lines. At a nearby inn, Martha recognizes her son, who must deny her presence to preserve his cover, but he reveals himself when Ogareff orders her flogged. Michael is sentenced to be blinded by a white-hot blade passed before his eyes, but Zangarra bribes the executioner to save Michael's sight by positioning the sword over his forehead. Although Martha dies and Zangarra is later executed, Michael continues on his mission with Nadia and is ignored by the Tartars because they believe he is blind. Upon arriving in Irkutsk, Ogareff pretends he is the Tsar's courier and delivers a message to trick Vladimir. Michael and Nadia arrive just as Ogareff sets fire to the town. Michael kills Ogareff, who is stunned to discover that his enemy can see, and explains the truth to Vladimir. Leading a sortie, Michael routs the invaders and is later decorated by the Tsar and marries Nadia.",
    "Director": "George Nicholls Jr.",
    "Writer": "Jules Verne, Anthony Veiller, Anne Morrison Chapin",
    "Actors": "Anton Walbrook, Elizabeth Allan, Akim Tamiroff",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028872",
    "tt0031619",
    "tt0028668",
    "tt0044466",
    "tt0028767",
    "tt0029130",
    "tt0029712",
    "tt0028662",
    "tt0029508",
    "tt0133850",
    "tt0062925",
    "tt0029168"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-24T17:09:24.024Z"
}