{
  "imdbId": "tt0040249",
  "title": "Counterblast",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Counterblast",
      "id": "Counterblast",
      "title": "Counterblast",
      "description": "A low budget British thriller about a post war Nazi scheme to develop germ warfare for world war 3. The farfetched plot is partially saved by skillful direction and a good cast. Directed by Paul L Stein. UK release 1948. US release 1953. Complete print. a.k.a. \"Devil's Plot\" (US re-release title). CAST NOTE: Nova Pilbeam also is here at IA in the Hitchcock romantic thriller \"Young and Innocent.\" ON THE LIGHTER SIDE; If you get a kick out of hilariously awful Nazi post war plots, check out \"The Yesterday Machine,\" which is here at IA. Then there's \"The Madmen of Mandoras\" with Hitler's head in a jar - really! It isn't here, but it is on DVD.",
      "fileSize": 1385302232,
      "addedAt": "2026-01-07T00:06:19.367Z",
      "thumbnail": "https://archive.org/services/img/Counterblast",
      "collection": "feature_films",
      "downloads": 4568
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 6,
    "imdbVotes": 244,
    "Genre": "Crime, Drama",
    "Plot": "This film was not known as \"Devil's Plot\" until 1953, when distributor Herbert Bregstein acquired the USA theatre rights and changed the title from \"Counterblast\" to \"Devil's Plot.\" The reason for the title change was to disguise the fact that this was the same movie that had already been sold to television,and was currently playing on British and American television as \"Counterblast.\" A more apt changed title would have been \"Cheater's Plot,\" since the title change was an obvious ploy to keep the theatre exhibitors and public from knowing this film could be seen for free at home. The story has Mervyn Johns as a Nazi doctor and escaped prisoner-of-war who goes to London. There, via the Nazi underground, he poses as an Australian bacteriologist, whom he has killed and taken his place, assigned to do some medical research. His plot is, using British labs and knowledge, to find a method of immunizing the German people against a plague the Nazis are going to use in their next war. Complications arise when his British assistant, Robert Beatty, becomes suspicious of his actions, and an Australian girl who knew the real doctor shows up.",
    "Director": "Paul L. Stein",
    "Writer": "Guy Morgan, Jack Whittingham",
    "Actors": "Robert Beatty, Mervyn Johns, Nova Pilbeam",
    "Language": "German, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043078",
    "tt0019979",
    "tt0040779",
    "tt0039220",
    "tt0040797",
    "tt0041187",
    "tt0040237",
    "tt0040257",
    "tt0040366",
    "tt0040444",
    "tt0040512",
    "tt0040643"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.367Z"
}