{
  "imdbId": "tt0042453",
  "title": "Federal Agent at Large",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/federal-agent-at-large-1950",
      "id": "federal-agent-at-large-1950",
      "title": "Federal Agent At Large (1950)",
      "description": "Dorothy Patrick, Robert Rockwell Republic Pictures",
      "fileSize": 1226782241,
      "addedAt": "2026-01-07T00:08:24.394Z",
      "thumbnail": "https://archive.org/services/img/federal-agent-at-large-1950",
      "collection": "feature_films",
      "downloads": 847
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "60 min",
    "imdbRating": 5.9,
    "imdbVotes": 70,
    "Genre": "Action, Adventure, Crime",
    "Plot": "The United States Customs Department uncovers a scheme to smuggle gold from Mexico into the U.S. and from there to Asia by freighter. An organized crime outfit of expatriate Americans uses a Mexican border town as a base for their gold smuggling into the U.S. The gold is hidden in crates of Aztec artifacts bound for a university in Los Angeles. The gold itself is smuggled aboard freighters to Asia where it fetches much higher prices than in the U.S. The U.S. Customs departments sends agent Mark Reed to Mexico to investigate. Reed, posing as a diamond peddler and using the alias Nick Ravel, hopes to ingratiate himself with the gold smugglers and penetrate their crime ring in order to destroy it. The danger is real since all those who previously tried to infiltrate the ring ended up dead. In Mexico, Customs agent Reed traces the gold smugglers' crime ring to a cabaret run by a voluptuous vixen named Solitare. She is assisted by a handful of thugs such as Big Bill Dixon, Jumpy Jordan and Angel Badillo. Although Solitare is giving the orders, Customs agent Reed suspects that a man is the top boss. Reed wants to find out the identity of this top boss and the ways by which the gold is being smuggled into the U.S. After a confrontation between Reed and the crime outfit, Solitaire decides to hire him to process the gold into gold dust and participate to the smuggling operations. Reed and Solitaire have a mutual attraction but her henchmen don't trust him. They suspect that Reed is either a cop or a member of a rival crime ring. They decide to secretly shadow Reed and put him to the test. With the date of the next big shipment of smuggled gold fast approaching, it is rumored that the big boss himself might come down to supervise the operation. Reed hopes to meet him and discover his true identity.",
    "Director": "George Blair",
    "Writer": "Albert DeMond",
    "Actors": "Dorothy Patrick, Robert Rockwell, Kent Taylor",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040447",
    "tt0039914",
    "tt0041108",
    "tt0043024",
    "tt0042392",
    "tt0040269",
    "tt0042543",
    "tt0043144",
    "tt0041547",
    "tt0042261",
    "tt0041822",
    "tt0044209"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.394Z"
}