{
  "imdbId": "tt0064223",
  "title": "El dependiente",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-dependiente-1969",
      "id": "el-dependiente-1969",
      "title": "El Dependiente(1969)",
      "description": "El dependiente  es una  película argentina   dramática  de 1969 dirigida por  Leonardo Favio  sobre su propio guion en colaboración con Roberto Irigoyen y  Jorge Zuhair Jury , y basada en el cuento homónimo de este último. Es protagonizada por  Walter Vidarte ,  Graciela Borges ,  Fernando Iglesias  (Tacholas)  y  Nora Cullen . Fue filmada en blanco y negro y se estrenó el 1 de enero de 1969. La película incluye música de  Johann Sebastian Bach ,  Francisco Canaro  y  Juan de Dios Filiberto , interpretada por  Yako Zeller  y orquesta. En una encuesta de las  100 mejores películas del cine argentino  llevada a cabo por el  Museo del Cine Pablo Ducrós Hicken  en el año 2000, la película alcanzó el puesto 14. 1 ​ En una nueva versión de la encuesta organizada en 2022 por las revistas especializadas  La vida útil ,  Taipei  y  La tierra quema , presentada en el  Festival Internacional de Cine de Mar del Plata , la película alcanzó el puesto 4. 2 ​ En julio de 2022 fue declarada Bien de Interés Artístico Nacional por el gobierno argentino para garantizar la conservación del soporte material (negativos, positivos y negativos de sonido) ya que, junto con otras películas de Favio, son consideradas un «testimonio de la producción cinematográfica nacional» (Wikipedia) Sinopsis En un pequeño pueblo, Fernández, el protagonista, está empleado en el negocio de venta de artículos de ferretería de propiedad de Don Vila, y sueña lo que sería cuando su patrón muera, pues no olvida que una vez le prometió, al pasar, que algún día el negocio sería suyo. A partir de aquel momento Fernández, que está enamorado de la señorita Plasini (personificada por Graciela Borges), solo espera que ese día llegue. Mientras Fernández alterna el mundo masculino de la ferretería con el femenino de la casa de los Plasini, en la que solo viven la madre, la hija y un hijo tonto, pues el padre ha muerto. Las mujeres por su parte poseen en igual proporción ganas de salir y de quedarse, temor a quedarse y temor al exterior Reparto Walter Vidarte  como Fernández Graciela Borges  como señorita Plasini Fernando  Tacholas  Iglesias  como Don Vila Nora Cullen  como señora Plasini Martín Andrade  como Estanislao José E. Felicetti como Fernández niño. Linda Peretz Leonardo Favio  como Voz en off Edgardo Suárez  como Voz en off",
      "fileSize": 1204106198,
      "addedAt": "2026-01-07T00:08:15.378Z",
      "thumbnail": "https://archive.org/services/img/el-dependiente-1969",
      "language": "spa",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 249
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "87 min",
    "imdbRating": 7.6,
    "imdbVotes": 589,
    "Genre": "Drama",
    "Plot": "Fernandez is a lonely man leading a lonely life. All he does is work for an old man in a hardware store. But all that changes, when he meets the girl of his dreams...and her family.",
    "Director": "Leonardo Favio",
    "Writer": "Leonardo Favio, Roberto Irigoyen, Jorge Zuhair Jury",
    "Actors": "Walter Vidarte, Graciela Borges, Nora Cullen",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "2 wins & 1 nomination"
  },
  "relatedMovies": [
    "tt0075248",
    "tt0070250",
    "tt0062388",
    "tt0064268",
    "tt0065179",
    "tt0064965",
    "tt0064571",
    "tt0065602",
    "tt0144119",
    "tt0064137",
    "tt0064217",
    "tt0064240"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.378Z"
}