{
  "movieId": "tt0060270",
  "title": "Curse of the Swamp Creature",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CurseOfTheSwampCreature1966_742",
      "id": "CurseOfTheSwampCreature1966_742",
      "title": "Curse of the Swamp Creature (1966)",
      "description": "A mad scientist is conducting experiments with evolution on the locals deep in the rural swamps of Texas. Listed as PD http://www.archive.org/post/285670/are-these-public-domain Mystic Nights Videos",
      "fileSize": 2237005076,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/CurseOfTheSwampCreature1966_742",
      "collection": "feature_films",
      "downloads": 121478
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lSmVPxPwR7I",
      "id": "lSmVPxPwR7I",
      "title": "Curse of the Swamp Creature (1966) [Horror] [Science Fiction]",
      "description": "\"Curse of the Swamp Creature\" is an American film directed by Larry Buchanan. Although Buchanan was making many remakes around this time, this was an original.\n\nDeep in the rural swamps of Texas the insane Dr. Simond Trent is conducting experiments on the local swamp people in an attempt to discover the secret of evolution. When a party of oil surveyors comes upon his isolated laboratory he decides to take the final step and turn one of them into a grotesque amphibious creature.\n\n---\n\nDirected by Larry Buchanan, produced by Larry Buchanan (producer) and Edwin Tobolowsky (associate producer), written by Tony Huston, starring John Agar as Barry Rogers, Francine York as Pat Trent, Jeff Alexander as Dr. Simond Trent, Shirley McLine as Brenda Simmons, Cal Duggan as Ritchie, Charles McLine, Bill McGhee, Ted Mitchell\nRoger Ready as Frenchie, Bill Thurman as Driscoll West / The Swamp Creature, Tony Huston as Tom, Gayle Johnson, Michael Tolden, Annabelle Weenick as Hotel Clerk, Patrick Cranshaw, J.V. Lee and Naomi Bruton.\n\n---\n\nSource: \"Curse of the Swamp Creature\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 2 June 2013. Web. 22 July 2013. http://en.wikipedia.org/wiki/Curse_of_the_Swamp_Creature.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "addedAt": "2025-12-26T00:26:20.227Z",
      "thumbnail": "https://i.ytimg.com/vi/lSmVPxPwR7I/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBv0RJgjitPiUmtxWkjVhXY8SQWTg",
      "duration": 4828,
      "language": "en",
      "year": 1966,
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Curse_of_the_Swamp_Creature",
      "id": "Curse_of_the_Swamp_Creature",
      "title": "Curse of the Swamp Creature",
      "description": "One of Larry Buchanan's notorious \"Azalea\" pictures -- made-for-TV color remakes of American International Pictures black and white drive-in creature features, made for a fraction of the originals' budgets. Curse of the Swamp Creature is a rehash of 1957's Voodoo Woman. A mad scientist works in the middle of the swamp to create a monster that will serve his bidding. The actor playing the scientist is a ham of the highest order, and everyone else (including especially our hero, John Agar) is a block of wood. Buchanan's signature editing style is in evidence here -- shots cut together that no rational mind can possibly connect to each other in either space or time, presented as \"different angles\" of the same scene. While it is indisputably bad, it is far from his wackiest editing adventure. THIS MOTION PICTURE LACKS A COPYRIGHT NOTICE, AND IS THEREFORE IN THE PUBLIC DOMAIN.",
      "fileSize": 1683298189,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/Curse_of_the_Swamp_Creature",
      "language": "English",
      "year": 1966,
      "collection": "feature_films",
      "downloads": 16808
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "80 min",
    "imdbRating": 2.5,
    "imdbVotes": 822,
    "Genre": "Horror, Sci-Fi",
    "Plot": "Deep in the rural swamps of Texas the mad Dr. Simond Trent is conducting experiments on the local swamp people in an attempt to discover the secret of evolution. When a party of oil surveyors comes upon his isolated laboratory he decides to take the final step and turn one of them into a grotesque amphibious creature.",
    "Director": "Larry Buchanan",
    "Writer": "Tony Huston",
    "Actors": "John Agar, Francine York, Jeff Alexander",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0061217",
    "tt0061529",
    "tt0060536",
    "tt0063145",
    "tt0059161",
    "tt0062036",
    "tt0063195",
    "tt0063206",
    "tt0130633",
    "tt0061683",
    "tt0062168",
    "tt0062411"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.368Z"
}