{
  "movieId": "tt0024282",
  "title": "Der Läufer von Marathon",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1933-der-laufer-von-marathon-brigitte-helm-viktor-de-kowa-oscar-sabo-ursula-grab",
      "id": "1933-der-laufer-von-marathon-brigitte-helm-viktor-de-kowa-oscar-sabo-ursula-grab",
      "title": "1933 Der Läufer Von Marathon ( Brigitte Helm, Viktor De Kowa, Oscar Sabo, Ursula Grabley, Hans Brausewetter, Paul Hartmann)",
      "description": "Film aus dem deutschen dritten Reich von 1933. Der Läufer von Marathon.  U.a mit Brigitte Helm und Viktor de Kowa",
      "fileSize": 2183353588,
      "addedAt": "2026-01-07T00:06:00.052Z",
      "thumbnail": "https://archive.org/services/img/1933-der-laufer-von-marathon-brigitte-helm-viktor-de-kowa-oscar-sabo-ursula-grab",
      "language": "ger",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 293
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "98 min",
    "imdbVotes": 9,
    "Genre": "Romance, Sport",
    "Plot": "There are, in the nature of things as they sadly remain, many early films that I have only be able to see in abbreviated Pathescope versions. In this case it means not only that the film is only half as long as it should be (48 rather than 96 minutes) but is also silent as many of the Pathescope versions continued to be in the early thirties.In many cases where only a Pathescope version exists (or where I have only been able to see a Pathescope version), it scarcely matters. I am not sure, for instance, that I am too bothered about having full versions of Die Kleine vom Varieté or Die drei Kuckucksuhren (both 1926) but this film is rather a different matter. Dupont is still very much an under-rated talent who had made the superb Varieté in 1925 and would go on to make the excellent Moulin Rouge 1928 and Piccadilly 1929 (both in Britain).Although this film, set just before and during the 1932 Olympic Games in Los Angeles, is not the theatre-world for which he showed such a special affinity, it has, even on the evidence of the truncated Pathescope version, many of the same virtues as those other films. There is the same strongly naturalistic feel (including actual footage of the games) and the same fine direction of acting (he gets an extraordinary performance out of Jannings in Varieté and was virtually the only director to do justice to Anna May Wong in Piccadilly). Here Brigitte Helm gives a fine performance quite different from the more melodramatic roles which made her famous.The other virtue is the superb photography (by one of the great experts, Eugen Schüfftan). In Varieté (filmed by Karl Freund) one could smell the sweat and the greasepaint. Here too one has a very convincing evocation of the atmosphere of tension, personal and professional, amongst competitors at the Olympics. It would be wonderful to see a complete restored version of the film. One day, who knows......The film is made in a tragic year for Germany. Dupont did not even wait for the première of this film before departing on the steamship Europa fro the US where, alas, his talents would not be appreciated and he would end up, like many other German exiles, working on B films. So, even if The Neanderthal Man 1953 has a minor \"cult\" following, this is really the last major Dupont film.......",
    "Director": "Ewald André Dupont",
    "Writer": "Werner Scheff, Thea von Harbou",
    "Actors": "Brigitte Helm, Hans Brausewetter, Ursula Grabley",
    "Language": "German",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025302",
    "tt0129972",
    "tt0028507",
    "tt9731440",
    "tt0020469",
    "tt0029364",
    "tt0020359",
    "tt0020439",
    "tt0020392",
    "tt0024554",
    "tt0024300",
    "tt0023791"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.052Z"
}