{
  "movieId": "tt0040166",
  "title": "The Black Arrow",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-black-arrow-1948",
      "id": "the-black-arrow-1948",
      "title": "The Black Arrow (1948)",
      "description": "A young British nobleman comes back from fighting in the War of the Roses to discover that his father has been murdered by an old family friend who is now an outlaw. However, he becomes suspicious about the exact circumstances of his father's death and determines to find out exactly what happened. Watch on RetroFlix:  https://retroflix.org/the-black-arrow-1948/",
      "fileSize": 271982133,
      "addedAt": "2026-01-07T00:11:46.533Z",
      "thumbnail": "https://archive.org/services/img/the-black-arrow-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 134
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "76 min",
    "imdbRating": 6.1,
    "imdbVotes": 454,
    "Genre": "Action, Adventure, History",
    "Plot": "Sir Richard Shelton, a young British nobleman, returns from the War of the Roses to find his father dead and his accused murderer, Sir John Sedley, living in the forest with a fugitive band of die-hard rebels like Robin Hood. Shelton's uncle, his father's sinister and cruel half-brother, Sir Daniel Brackley, is living on his father's estates and has reinstated cruel corporal punishment among the peasants, something his father had abolished. Shelton's suspicions are aroused when a yeoman loyal to Brackley is murdered using a black arrow. Other Brackley henchman, including Shelton's former mentor and Master-at-Arms, who had access to the supposed murder of his father by Sedley are also on the Black Arrow's death list. Shelton's growing antipathy toward Brackley is complicated by his uncle's desire to marry Sedley's beautiful daughter, an ambition shared by Shelton.",
    "Director": "Gordon Douglas",
    "Writer": "Richard Schayer, David P. Sheppard, Tom Seller",
    "Actors": "Louis Hayward, Janet Blair, George Macready",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0061024",
    "tt0038478",
    "tt0040946",
    "tt0040208",
    "tt0040269",
    "tt0040447",
    "tt0040567",
    "tt14111328",
    "tt0040744",
    "tt0040761",
    "tt0046054",
    "tt0052365"
  ],
  "collections": [
    {
      "id": "cloak-and-dagger",
      "name": "Cloak and Dagger"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}