{
  "movieId": "tt0061140",
  "title": "The Undertaker and His Pals",
  "year": 1966,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheUndertakerAndHisPals",
      "id": "TheUndertakerAndHisPals",
      "title": "The Undertaker And His Pals",
      "description": "Mort the Mortician, and his two friends Spike and Doc (who run the aptly named “Greasy Spoon Diner”), collaborate on an interesting business model. The owners kill and dismember people – with body parts ending up on the following day’s menu – and Mort provides $144.98 funerals to the survivors.   Of course, Mort’s add-ons drive the price up a good bit…but he also gives trading stamps to cushion the financial blow.  Things turn for the worse after the entrepreneurs serve pieces of the late Anne Poultry (as “breast of chicken,” of course)., as well as of a young woman named Friday. Ms. Poultry was the secretary/girlfriend of Detective Harry Glass, and he soon realizes something’s amiss when he’s hired to locate the missing Friday by her identical twin sister Thursday.   “The Undertaker and His Pals” is available from Desert Island Films, which offers “the oldest, largest and highest quality public domain film library in the world” to clients such as A&E, Warner Brothers, Time-Life and Viacom; as well as from The RetroFilm Vault, “the original and definitive one-stop source for public domain movies and television for broadcast programing or stock footage use. From the heart of movie land, The RetroFilm Vault has the largest virtual catalog for broadcast quality public domain films on the planet.”",
      "fileSize": 1530840488,
      "addedAt": "2026-01-07T00:07:05.037Z",
      "thumbnail": "https://archive.org/services/img/TheUndertakerAndHisPals",
      "collection": "feature_films",
      "downloads": 10731
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mhlGoAUx20o",
      "id": "mhlGoAUx20o",
      "title": "The Undertaker and His Pals (1966) HORROR COMEDY",
      "description": "Stars: Ray Dannis, Warrene Ott, James Westmoreland \nWriter/Director: T.L.P. Swicegood\n\nAn undertaker and his two friends, who are restaurant owners, drum up business by going out on the town and killing people; the restaurant owners use parts of the bodies for their menu, and the undertaker gets paid by the families to bury the remainder. Their racket goes awry when 2 detectives suspect that something isn't quite kosher.",
      "addedAt": "2025-12-26T23:48:34.689Z",
      "thumbnail": "https://i.ytimg.com/vi/mhlGoAUx20o/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB9gSAAuADigIMCAAQARhNIFUoZTAP&rs=AOn4CLBI_23YSp-XDuB3YcC8YPgIooYz2g",
      "duration": 3788,
      "language": "en",
      "year": 1966,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "63 min",
    "imdbRating": 4.5,
    "imdbVotes": 1264,
    "Genre": "Comedy, Horror",
    "Plot": "An undertaker and his two friends, who are restaurant owners, drum up business by going out on the town and killing people; the restaurant owners use parts of the bodies for their menu, and the undertaker gets paid by the families to bury the remainder. Their racket goes awry when 2 detectives suspect that something is not quite kosher.",
    "Director": "T.L.P. Swicegood",
    "Writer": "T.L.P. Swicegood",
    "Actors": "Warrene Ott, James Westmoreland, Marty Friedman",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0061005",
    "tt0059161",
    "tt0059466",
    "tt0058606",
    "tt0057156",
    "tt26659378",
    "tt0062957",
    "tt0055650",
    "tt0044925",
    "tt0052655",
    "tt0043255",
    "tt0044406"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.037Z"
}