{
  "movieId": "tt0055380",
  "title": "Rocket Attack U.S.A.",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ROCKETATTACKUSA",
      "id": "ROCKETATTACKUSA",
      "title": "ROCKET ATTACK USA",
      "description": "“It’s the height of the Cold War between the United States and the Soviet Union with the Communists launching a spy satellite that has the Free World leaders in a panic. Fears about the nature of the satellite force the United States to send an agent undercover behind the Iron Curtain to discover what the Soviets have learned. What he finds is the Communists have used the information acquired from their spy satellite to help them perfect a new and even more deadly nuclear weapon.” (boxed-set booklet description) Research by oldbones indicates this Cold War propaganda movie is PD. I’ve improved the source material's contrast a bit.  ",
      "fileSize": 2327176851,
      "addedAt": "2026-01-07T00:06:45.468Z",
      "thumbnail": "https://archive.org/services/img/ROCKETATTACKUSA",
      "collection": "feature_films",
      "downloads": 12173
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "68 min",
    "imdbRating": 1.7,
    "imdbVotes": 1184,
    "Genre": "Thriller",
    "Plot": "Based on the assumption that Sputnik is gathering intelligence for the Soviets, a spy is sent to Moscow to determine just how far along their missile program is. Surprise, surprise: Sputnik gave them all the data they need to build one nuclear missile, which is ready to launch against the U.S. This Cold-War propaganda film, released soon after the launch of Sputnik, intended to rally public support for an anti-ballistic missile program.",
    "Director": "Barry Mahon",
    "Writer": "Barry Mahon",
    "Actors": "Monica Davis, John McKay, Phillip St. George",
    "Language": "Russian, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0054393",
    "tt0054295",
    "tt0054380",
    "tt0053719",
    "tt2017464",
    "tt0054041",
    "tt0052811",
    "tt0053337",
    "tt0054627",
    "tt0052609",
    "tt0054691",
    "tt0052702"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.468Z"
}