{
  "imdbId": "tt0044853",
  "title": "Love Island",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/love_island",
      "title": "Love Island",
      "description": "A young Eva Gabor plays a Balinese woman in this romantic story filled with lovely locales. An American flyer stranded in Bali falls for the sarong-swathed Gabor, much to the chagrin of an island creep who blackmails Gabor by having her father arrested on false charges. You can find more information regarding this film on its IMDb page .",
      "id": "love_island"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E_RNiOrlC0w",
      "title": "Love Island (1952) | Colorized Public Domain Romantic Adventure with Eva Gabor and Paul Valentine",
      "description": "Love Island (1952) is an American romantic adventure directed by Lew Landers, originally released as a low-budget exotic drama that combined romance, wartime intrigue, and island escapism. This colorized and digitally restored edition revives a forgotten public domain film and brings it into high-quality visual clarity for modern audiences in the United States, Europe, and worldwide. Starring Paul Valentine and Eva Gabor, the movie blends tropical atmosphere with melodramatic tension, offering a glimpse into the postwar era’s fascination with exotic love stories and adventure romances.\n\nPlot Summary:\nThe story follows Lt. Richard Tabor (Paul Valentine), an American Air Force officer stationed in the Pacific after World War II. During a leave on a lush South Pacific island, he falls in love with the beautiful and captivating Sarna (Eva Gabor), a local woman whose charm and mystery draw him in. Their romance, however, faces cultural tensions and jealous rivals who see Tabor as an outsider. As their love deepens, Sarna must contend with challenges from within her community, while Richard struggles with duty and the possibility of being reassigned.\n\nThe island setting becomes a character in itself, with the lush landscapes and postwar military presence creating a backdrop for passion, jealousy, and the clash of cultures. The story builds toward a dramatic resolution that asks whether love can survive across cultural divides and shifting loyalties.\n\nCast and Crew:\n• Director: Lew Landers\n• Screenplay: Don Martin\n• Cinematography: Fred Jackman Jr.\n• Editing: Martin G. Cohn\nStarring:\n• Paul Valentine as Lt. Richard Tabor\n• Eva Gabor as Sarna\n• Bernard Gorin as Tenga\n• Malcolm Beggs as Major Davis\n• Leonard Strong as Island Elder\n• Clarence Lung as Servant\n\nFilm Significance:\n“Love Island” is notable as one of Eva Gabor’s early screen appearances before her later fame in television and Hollywood society. The film reflects Hollywood’s postwar interest in exotic romance and cultural melodrama, where distant locations and cross-cultural love stories provided audiences with escapism in the early 1950s. Director Lew Landers, known for his efficient handling of low-budget productions, delivers a film that captures both the limitations and charm of mid-century adventure melodramas. While not a mainstream classic, the film is a time capsule of shifting American entertainment tastes as studios sought to combine romance with adventure for budget-conscious audiences.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Love Island remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1952 release was in black and white, standard for many low-budget productions of the time. While historically accurate, such presentation struggles to attract modern audiences. This colorized edition revitalizes the South Pacific setting, making the landscapes, costumes, and romantic tension more vivid and appealing. Enhanced sound and image quality improve the viewing experience across televisions, tablets, and mobile devices, ensuring accessibility for a broader audience.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including forgotten adventure romances, Westerns, screwball comedies, and dramatic classics. Our channel ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#LoveIsland #EvaGabor #PaulValentine #1950sRomance #PublicDomainMovie #ColorizedClassic #RomanticAdventure #FilmRestoration #1952Movies #GoldenAgeHollywood",
      "id": "E_RNiOrlC0w",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nEgjxWOEbG0",
      "title": "Love Island (1952) EVA GABOR",
      "description": "Stars: Eva Gabor,Paul Valentine, Malcolm Lee Beggs\n Director: Bud Pollard\n\n US-Navy pilot Lt. Richard Tabor crash-lands on a south Pacific isle called Love Island in English. Richard befriends the Balinese beauty Sarna. The bad and jealous Jaraka doesn't like their friendship, so he has Sarna's father Aryuna arrested on a vague charge. Jaraka tells Aryuna that he only will be released when his daughter marries him.",
      "id": "nEgjxWOEbG0",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": "3.5",
    "imdbVotes": "112",
    "Genre": "Comedy, Romance",
    "Plot": "US-Navy pilot Lt. Richard Tabor crash-lands on a south Pacific isle called Love Island in English. Richard befriends the Balinese beauty Sarna. The bad and jealous Jaraka doesn't like their friendship, so he has Sarna's father Aryuna arrested on a vague charge. Jaraka tells Aryuna that he only will be released when his daughter marries him.",
    "Director": "Bud Pollard",
    "Writer": "John E. Godson, Daniel Kusell",
    "Actors": "Paul Valentine, Eva Gabor, Malcolm Lee Beggs",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0044370",
      "title": "April in Paris",
      "year": 1952,
      "imdbRating": "5.9",
      "imdbVotes": "1,540",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045020",
      "title": "Penny Princess",
      "year": 1952,
      "imdbRating": "6.0",
      "imdbVotes": "313",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044000",
      "title": "The White Sheik",
      "year": 1952,
      "imdbRating": "7.2",
      "imdbVotes": "7,087",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0162342",
      "title": "Geisha Girl",
      "year": 1952,
      "imdbRating": "5.2",
      "imdbVotes": "85",
      "language": "English, Japanese",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0043983",
      "title": "Royal Wedding",
      "year": 1951,
      "imdbRating": "6.7",
      "imdbVotes": "6,211",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043651",
      "title": "Home Town Story",
      "year": 1951,
      "imdbRating": "5.0",
      "imdbVotes": "1,128",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044962",
      "title": "Never Wave at a WAC",
      "year": 1953,
      "imdbRating": "5.9",
      "imdbVotes": "620",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043721",
      "title": "The Lady Says No",
      "year": 1951,
      "imdbRating": "5.2",
      "imdbVotes": "439",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044125",
      "title": "Three Guys Named Mike",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "883",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045670",
      "title": "Dangerous When Wet",
      "year": 1953,
      "imdbRating": "6.2",
      "imdbVotes": "1,209",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043313",
      "title": "Early Summer",
      "year": 1951,
      "imdbRating": "8.1",
      "imdbVotes": "9,910",
      "language": "Japanese, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043526",
      "title": "Father's Little Dividend",
      "year": 1951,
      "imdbRating": "6.5",
      "imdbVotes": "4,427",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:38.894Z"
}