{
  "imdbId": "tt0028994",
  "title": "Here's Flash Casey",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/heres_flash_casey",
      "title": "Heres Flash Casey",
      "id": "heres_flash_casey"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/heres_flash_casey_1938",
      "title": "Heres Flash Casey",
      "description": "Taken from IMDB : Flash Casey, after working his way through college by taking pictures, finds the newspaper world harder to break into than he had expected.",
      "id": "heres_flash_casey_1938"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ignRNIHTxeQ",
      "title": "Here’s Flash Casey (1937) | Colorized Public Domain Crime Classic with Eric Linden & Boots Mallory",
      "description": "Here’s Flash Casey (1937) is an American crime drama directed by Lynn Shores and based on the popular pulp character created by George Harmon Coxe. Originally a black-and-white film released during the Great Depression era, this fast-paced newsroom thriller has been restored and colorized by Colorized Public Domain to deliver a visually engaging experience for modern audiences in the United States, Europe, and beyond. By blending journalism, crime, and romance, the film captures both the energy of 1930s pulp fiction and the gritty atmosphere of classic Hollywood B-pictures.\n\nPlot Summary:\nThe film follows Flash Casey (Eric Linden), an ambitious young press photographer eager to make his mark in the competitive world of big-city newspapers. Determined to prove himself, Casey lands a job at the Globe, where his relentless pursuit of scoops and his quick wit earn him recognition. But his rise is not without obstacles — Casey clashes with corrupt businessmen, ruthless criminals, and rivals who seek to undermine him at every turn.\n\nWhen Casey stumbles upon a scandal involving shady politicians and underworld figures, his photographic evidence becomes the key to exposing corruption. With the support of Kay Lanning (Boots Mallory), a fellow journalist who believes in his integrity, Casey must risk both his career and his life to deliver the truth. In true pulp tradition, the film combines sharp dialogue, a fast-moving plot, and a youthful lead whose determination embodies the spirit of 1930s crime cinema.\n\nCast and Crew:\n• Director: Lynn Shores\n• Based on: Character “Flash Casey” by George Harmon Coxe\n• Screenplay: Wellyn Totman and John T. Neville\n• Cinematography: Jack Greenhalgh\n• Editing: Ernest J. Nims\n\nStarring:\n• Eric Linden as Flash Casey\n• Boots Mallory as Kay Lanning\n• Cully Richards as Collins\n• Donald Cook as Editor Blaine\n• Charles C. Wilson as Editor Blaine (alternate credit in some sources)\n• George Meeker as Lawrence\n• Frank Jenks as Reporter\n\nFilm Significance:\n“Here’s Flash Casey” reflects the popularity of pulp fiction and hardboiled journalism stories of the 1930s, where newspapermen were portrayed as both heroes and underdogs battling crime and corruption. The film also shows Hollywood’s ability to adapt serialized magazine characters into quick, energetic B-movies designed for mass audiences. Eric Linden’s performance captures the idealism and grit of young strivers in Depression-era America, while Boots Mallory provides both charm and strength as his steadfast ally. The film holds cultural importance as an example of journalism-based crime dramas that preceded later noir traditions.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Here’s Flash Casey remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1937 release was in black and white, common for B-movie productions of the Depression era. While historically authentic, many modern viewers tend to skip over monochrome films. This colorized edition enhances the film’s newsroom settings, character interactions, and cityscape visuals, bringing its pulp-inspired drama to life in a way that feels more immediate to contemporary audiences in the USA and Europe. It preserves the energy of its original release while adding a visual richness for new generations of classic film fans.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#HeresFlashCasey #1930sCrimeDrama #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #PulpFictionFilm #JournalismDrama #1937Movies #FilmNoirRoots",
      "id": "ignRNIHTxeQ",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FCY9hjbZuME",
      "title": "Here's Flash Casey (1938) COMEDY",
      "description": "Stars: Eric Linden, Boots Mallory, Cully Richards \nDirector: Lynn Shores\n\nAfter winning a prize in a photography contest, Flash vows that within two years of his graduation, he'll own his own newsphoto agency. To attain his goal, Flash goes after a big scoop, and nearly breaks his neck in the process.",
      "id": "FCY9hjbZuME",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": "5.6",
    "imdbVotes": "101",
    "Genre": "Action, Drama, Romance",
    "Plot": "Flash Casey, after working his way through college by taking pictures, finds the newspaper world harder to break into than he had expected. Free-lancing, he snaps a picture of Rodney Addison, son of the Globe-Press owner Major Addison, kissing French dancer Mitzi LaRue and submits it to Globe-Press city editor Blaine. He gets a job on the paper because Blaine wants to suppress the picture. He is confined to assisting regular staff photographer Wade who gets all the credit for the pictures Flash takes. His only bright spot is a romance with Kay Lanning, the paper's society editor and sob-sister columnist. Through her he meets Lawrence, editor of the weekly pictorial magazine called Snap News that the Globe-Press publishes. Gus Payton, the photographer assigned to Lawrence but who has been bribed by Bliane to turn over his best pictures to the city desk, quits when Lawrence accuses him of double-dealing. Payton opens a camera shop that is secretly financed by gangland chief Ricker. Flash goes to work for Lawrence and, as a favor to Kay, attends the Globe-Press annual charity garden-bazaar and takes random candid shots for her society page. Among them is a picture of Major Addison with his arms thrown casually around a young girl's shoulders. Flash takes the film to Payton's shop for development and Payton alters the shot to make Major Addison and the girl to appear, respectively, to be in pajamas and a negligee, and gives the picture to Ricka. Ricka attempts to blackmail Addison with a copy of the picture but Addison throws him out, and then shows Flash and Kay a copy of the picture and fires Flash. Followed by the protesting couple, Addison leaves the building and is shot down by Ricka, Payton and their henchman, waiting in a parked car.",
    "Director": "Lynn Shores",
    "Writer": "John W. Krafft, George Harmon Coxe",
    "Actors": "Eric Linden, Boots Mallory, Cully Richards",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0030090",
      "title": "The Duke of West Point",
      "year": 1938,
      "imdbRating": "6.4",
      "imdbVotes": "185",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030911",
      "title": "Under the Big Top",
      "year": 1938,
      "imdbRating": "5.8",
      "imdbVotes": "84",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028592",
      "title": "Atlantic Flight",
      "year": 1937,
      "imdbRating": "4.6",
      "imdbVotes": "92",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028634",
      "title": "Bill Cracks Down",
      "year": 1937,
      "imdbRating": "5.6",
      "imdbVotes": "108",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029376",
      "title": "Park Avenue Logger",
      "year": 1937,
      "imdbRating": "5.8",
      "imdbVotes": "100",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0140551",
      "title": "Sky Racket",
      "year": 1937,
      "imdbRating": "4.6",
      "imdbVotes": "117",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030839",
      "title": "Telephone Operator",
      "year": 1937,
      "imdbRating": "5.6",
      "imdbVotes": "193",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0169357",
      "title": "Valley of Terror",
      "year": 1937,
      "imdbRating": "5.9",
      "imdbVotes": "102",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027366",
      "title": "Black Gold",
      "year": 1936,
      "imdbRating": "5.2",
      "imdbVotes": "103",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030023",
      "title": "Crashing Through Danger",
      "year": 1936,
      "imdbRating": "4.6",
      "imdbVotes": "81",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029830",
      "title": "Ten Laps to Go",
      "year": 1936,
      "imdbRating": "4.7",
      "imdbVotes": "64",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0029701",
      "title": "Two Minutes to Play",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "36",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:37:43.129Z"
}