{
  "movieId": "tt0031857",
  "title": "Ride 'em, Cowgirl",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RideEmCowgirl",
      "id": "RideEmCowgirl",
      "title": "Ride em Cowgirl",
      "description": "Cowgirl in danger of losing her ranch to the dastardly town villain is helped by good-guy cowboy and his buddy. Advertising tag line is: HI-HO! LADY BUCKAROO! Rhythm never rode the range as delightfully as with the screen's first Lady Buckaroo!",
      "fileSize": 1127230150,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RideEmCowgirl",
      "collection": "feature_films",
      "downloads": 9117
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZdoE3aJ-FmY",
      "id": "ZdoE3aJ-FmY",
      "title": "Ride 'em Cowgirl (1939) DOROTHY PAGE",
      "description": "Stars: Dorothy Page, Vince Barnett, Milton Frome \nDirector: Samuel Diege\n\n In the late 1930s, Page made three cowgirl movies for Grand National Pictures and this is the last one.",
      "addedAt": "2025-12-26T23:44:25.832Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ZdoE3aJ-FmY/maxresdefault.webp",
      "duration": 3195,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "53 min",
    "imdbRating": 5.6,
    "imdbVotes": 49,
    "Genre": "Drama, Music, Western",
    "Plot": "Sandy Doyle, gambler and political chief of a small border town, seeks to gain control of the Bar-X Ranch, owned by Rufe Rickson, to further some undercover activities of his own. He counts on Rickson's inability to stay away from gambling as the means to his ultimate success. Government investigator Oliver Shea and his assistant, Dan Haggerty, start a fight in Doyle's place when they see Rickson being cheated and are invited to the Bar-X where Oliver and Helen Rickson, Rufe's daughter, discover interest in each other and Dan finds himself pursued by Bell, the ranch cook. Sheriff Larson brings the prize money for the $5,000 race of the Rodeo Association, and that night it is stolen from her safe. The next day, Doyle says it was paid to him by Rickson for a gambling debt. Realizing that she must be free in order to prove her father's innocence, and that now her horse, Snowy, must win the race, Helen confesses to the theft and makes good her escape. Her sleuthing establishes that Doyle has been engaged in ore-smuggling activities, and his intent to gain the Bar-X is because the ranch offers a perfect crossing place for his gang, who salt the smuggled silver into a non-productive mine and ship it to the Mint as domestic production.",
    "Director": "Samuel Diege",
    "Writer": "Arthur Hoerl",
    "Actors": "Dorothy Page, Vince Barnett, Milton Frome",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031927",
    "tt0032112",
    "tt0031051",
    "tt0031216",
    "tt0031247",
    "tt0031860",
    "tt0031859",
    "tt0031406",
    "tt0031889",
    "tt0031929",
    "tt0032107",
    "tt0030006"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}