{
  "imdbId": "tt0020945",
  "title": "Half Shot at Sunrise",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/half-shot",
      "title": "Half Shot at Sunrise (1930)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The second film together for comedy duo Wheeler and Woolsey, Half Shot at Sunrise follows two soldiers who impersonate superior officers to pick up girls. The soundtrack for this film was the first to be scored by Max Steiner, who would go on to write music for films like Casablanca, King Kong, and many more. ",
      "fileSize": 8424085572,
      "id": "half-shot"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/half-shot-at-sunrise-1930",
      "title": "Half Shot at Sunrise (1930)",
      "description": "Two soldiers go absent without leave in Paris during World War I. Watch on RetroFlix:",
      "fileSize": 670996407,
      "id": "half-shot-at-sunrise-1930"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PgSVJ9JgHhc",
      "title": "Half Shot at Sunrise (1930) | Wheeler & Woolsey Colorized Public Domain Comedy | Classic Funny Film",
      "description": "Half Shot at Sunrise (1930) is a pre-Code American comedy film directed by Paul Sloane, featuring the comedy team of Bert Wheeler and Robert Woolsey, who were among the most popular screen duos of early sound cinema. Originally released by RKO Radio Pictures, this fast-paced comedy combines slapstick, witty dialogue, and musical interludes, offering a glimpse into the transitional era from silent films to talking pictures. This restored and colorized edition from Colorized Public Domain revitalizes the 1930 classic, making it more engaging for modern audiences in the United States, Europe, and worldwide. Through digital cleaning, restoration, and careful colorization, we preserve its historical authenticity while ensuring an immersive experience for today’s viewers.\n\nPlot Summary:\nSet in post-World War I Paris, the film follows two mischievous U.S. Army deserters, Willie (Bert Wheeler) and Georgie (Robert Woolsey), who charm and bluff their way into high society while avoiding military police. Their antics become increasingly complicated when they fall for two young women, Annette (Dorothy Lee) and Eileen (Leni Stengel), while still having to dodge the wrath of Colonel Marshall (George MacFarlane) and his wife (Edna May Oliver). With quick banter, disguises, and plenty of misunderstandings, the pair hilariously navigate romance, authority, and chaos in classic Wheeler and Woolsey style.\n\nThe story culminates in a series of comic escapades, blending romance and slapstick with the irreverence that defined pre-Code Hollywood comedies. Musical numbers and lighthearted satire add charm, reflecting the era’s experimentation with sound films and vaudeville-inspired humor.\n\nCast and Crew:\n• Director: Paul Sloane\n• Producer: William LeBaron\n• Screenplay: Anne Caldwell, Ralph Spence\n• Studio: RKO Radio Pictures\nStarring:\n• Bert Wheeler as Willie\n• Robert Woolsey as Georgie\n• Dorothy Lee as Annette\n• Leni Stengel as Eileen\n• George MacFarlane as Colonel Marshall\n• Edna May Oliver as Mrs. Marshall\n\nFilm Significance:\nHalf Shot at Sunrise represents Wheeler and Woolsey at the height of their popularity during the early 1930s. Known for their wisecracking humor and chemistry, they were RKO’s answer to other comedy teams like Laurel and Hardy and the Marx Brothers. While less remembered today, their films enjoyed major success in Depression-era America, offering audiences escapism through laughter and music.\n\nThe presence of Edna May Oliver, a beloved character actress known for her sharp wit, further elevates the film’s comedic value. Half Shot at Sunrise also highlights the pre-Code era’s willingness to play with risqué jokes, flirtatious dialogue, and playful irreverence that would soon be restricted by Hollywood’s Production Code starting in 1934. For modern audiences, it offers not only laughs but also a valuable cultural snapshot of early sound cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Half Shot at Sunrise remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1930 release was in black and white, as was standard at the time. While authentic, many modern audiences skip over older black-and-white comedies, especially those from the early sound era. By offering a colorized edition, we bridge the gap between historical preservation and modern viewing habits, making Wheeler and Woolsey’s witty antics accessible for casual viewers as well as classic film enthusiasts.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten comedies to culturally significant pre-Code classics. Our mission is to ensure these treasures remain preserved, discoverable, and enjoyable for audiences in the USA, Europe, and worldwide.\n\n#HalfShotAtSunrise #WheelerAndWoolsey #PreCodeComedy #PublicDomainMovie #ColorizedClassic #ClassicCinema #1930sFilm #FilmRestoration #RKOComedy #EdnaMayOliver #GoldenAgeHollywood",
      "id": "PgSVJ9JgHhc",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AqQ62aAuJHU",
      "title": "Half Shot at Sunrise (1930) WHEELER & WOOLSEY",
      "description": "Stars: Bert Wheeler, Robert Woolsey, Dorothy Lee\n Director: Paul Sloane\n\n In the Pre-code Hollywood comedy, stage stars Wheeler and Woolsey play two soldiers who go absent without leave in Paris, during World War I.",
      "id": "AqQ62aAuJHU",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "78 min",
    "imdbRating": 5.9,
    "imdbVotes": 406,
    "Genre": "Comedy, Musical",
    "Plot": "The stage stars Wheeler and Woolsey play two soldiers who go absent without leave in Paris, during World War I.",
    "Director": "Paul Sloane",
    "Writer": "James Ashmore Creelman, Anne Caldwell, Ralph Spence",
    "Actors": "Bert Wheeler, Robert Woolsey, Dorothy Lee",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0020987",
      "title": "Hook, Line and Sinker",
      "year": 1930,
      "imdbRating": 5.9,
      "imdbVotes": 416,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020332",
      "title": "Rio Rita",
      "year": 1929,
      "imdbRating": 6,
      "imdbVotes": 770,
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020902",
      "title": "Free and Easy",
      "year": 1930,
      "imdbRating": 5.5,
      "imdbVotes": 1057,
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021016",
      "title": "Just Imagine",
      "year": 1930,
      "imdbRating": 5.4,
      "imdbVotes": 870,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021025",
      "title": "King of Jazz",
      "year": 1930,
      "imdbRating": 6.7,
      "imdbVotes": 1675,
      "language": "English, Spanish, German, Russian, French, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021057",
      "title": "Leathernecking",
      "year": 1930,
      "imdbRating": 6.6,
      "imdbVotes": 44,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021334",
      "title": "The Sap from Syracuse",
      "year": 1930,
      "imdbRating": 5.9,
      "imdbVotes": 108,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019933",
      "title": "Glorifying the American Girl",
      "year": 1929,
      "imdbRating": 5.7,
      "imdbVotes": 836,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022000",
      "title": "Indiscreet",
      "year": 1931,
      "imdbRating": 6.2,
      "imdbVotes": 1610,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022263",
      "title": "Le petit café",
      "year": 1931,
      "imdbRating": 6.6,
      "imdbVotes": 26,
      "language": "French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020034",
      "title": "It's a Great Life",
      "year": 1929,
      "imdbRating": 6,
      "imdbVotes": 313,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020049",
      "title": "Jungle Rhythm",
      "year": 1929,
      "imdbRating": 5.8,
      "imdbVotes": 452,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.343Z"
}