{
  "movieId": "tt0039492",
  "title": "The Inheritance",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/us88885",
      "id": "us88885",
      "title": "The Inheritance",
      "description": "Title: The Inheritance Summary: Following her father's death, a British teen-aged heiress goes to live with her guardian uncle who is broke and scheming to murder his niece for her vast inheritance. Directed by: Charles Frank Actors: Jean Simmons, Derrick De Marney, Katina Paxinou Production Company: Two Cities Films Release Date: 23 April 1948 (Finland) Aspect Ratio: 1.37 : 1 Caroline Ruthyn is the teen-aged niece of the her uncle Silas, a sickly and at one time unbalanced man who becomes her guardian on the death of her father. The fact that Silas is broke and greedy and young Caroline is the heir to her father's great fortune is reason enough for Caroline to be wary, but her fears escalate when she meets Silas's perverted son and when she discovers that her fearsome former governess, Madame de la Rougierre, is in league with her uncle.",
      "fileSize": 774115077,
      "addedAt": "2026-01-07T00:12:55.132Z",
      "thumbnail": "https://archive.org/services/img/us88885",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 6517
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "98 min",
    "imdbRating": 6.6,
    "imdbVotes": 814,
    "Genre": "Drama, Mystery, Thriller",
    "Plot": "Caroline Ruthyn is the teen-aged niece of the her uncle Silas, a sickly and at one time unbalanced man who becomes her guardian on the death of her father. The fact that Silas is broke and greedy and young Caroline is the heir to her father's great fortune is reason enough for Caroline to be wary, but her fears escalate after she meets Silas's perverted son and she discovers that her fearsome former governess, Madame de la Rougierre, is in league with her uncle.",
    "Director": "Charles Frank",
    "Writer": "Sheridan Le Fanu, Ben Travers",
    "Actors": "Jean Simmons, Derrick De Marney, Katina Paxinou",
    "Language": "English, French",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037179",
    "tt0040799",
    "tt0035937",
    "tt9214844",
    "tt0039757",
    "tt0039768",
    "tt0053318",
    "tt0478832",
    "tt0045931",
    "tt0073418",
    "tt6207878",
    "tt0020103"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.132Z"
}