{
  "imdbId": "tt0035249",
  "title": "Remember Pearl Harbor",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/remember-pearl-harbor-1942",
      "id": "remember-pearl-harbor-1942",
      "title": "Remember Pearl Harbor (1942)",
      "description": "Donald \"Red\" Barry  Republic Pictures",
      "fileSize": 1675547989,
      "addedAt": "2026-01-07T00:10:30.753Z",
      "thumbnail": "https://archive.org/services/img/remember-pearl-harbor-1942",
      "collection": "feature_films",
      "downloads": 452
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "75 min",
    "imdbRating": 6,
    "imdbVotes": 72,
    "Genre": "Drama, Romance, War",
    "Plot": "On 16 November, 1941 at the La Dessa U. S. army post in the Philippines, a Japanese carrier ship off the coast transmits a coded message to the contraband radio of Nazi spies. The spies then stick the message, which states that a Tokyo battleship is approaching Pearl Harbor, to a bottle of German liquor called Kümmel. Just then, the womanizing private Steve \"Lucky\" Smith meets his fellow soldiers Bruce Gordon and \"Portly\" Porter in the Casa Marina bar, and Lucky and Steve both try to attract a beautiful woman, who soon informs them she is Portly's sister Marcia. Portly arranges a job for Marcia as the secretary to Andy L. Anderson, the owner of the bar. When a businessman named Littlefield slips into Marcia's booth and bothers her while reading the message on the bottle of Kümmel, Lucky defends her by attacking Littlefield, and Bruce and Portly join the fight. Captain Hudson disciplines the three by assigning them to find the spy's radio. Though Lucky is in charge of the mission, he soon returns to the bar to find Marcia. Bruce and Portly, meanwhile, pick up a coded radio transmission from a Japanese boat and follow the beam to the hideout of Littlefield and his two henchmen. A gunfight erupts during which Portly is killed and Littlefield escapes, and when Lucky later admits to the captain that he was not there, the captain court-martials him and promotes Bruce to corporal. Lucky quickly escapes from jail and soon after, Anderson, who is one of the spies, meets with Van Hoorten, another Nazi who is posing as a Dutch Indian. They discuss the success of their plan to stockpile ammunition and gas for the Japanese troops who plan to invade. Anderson agrees to kill Littlefield and arrange for the gas to be transported to their warehouse, and when Lucky turns to Anderson for help, believing the bar owner to be a friend, Anderson slyly tips him off to Littlefield's whereabouts. That night, Lucky attacks Littlefield and Anderson shoots him, then offers Lucky the job of transporting some \"crude oil\" to his warehouse. On the way, Bruce stops Lucky's truck and asks him to turn himself in that evening. At the warehouse, Lucky realizes that the cargo is not crude oil but gasoline, and when he and Marcia sneak into Van Hoorten's office that night, they find ammunition and a Nazi flag. Just then, Van Hoorten bursts in and attacks them, forcing Lucky to shoot him. Then Bruce, who has tracked Lucky to the warehouse, runs in just as the radio announces that Pearl Harbor has been bombed. Before the three can leave, Japanese planes land in the nearby field and the soldiers enter the office with Anderson. The three Americans run into the hills, where they find a radio and wire Captain Hudson for help. When the American troops arrive, Hudson spots another Japanese aircraft carrier in the bay. Understanding that the Japanese will soon outnumber them, Lucky courageously saves the Americans by flying the armed Japanese plane into the carrier in a suicide mission. Bruce receives a Distinguished Service Cross while Marcia collects the award on Lucky's behalf.",
    "Director": "Joseph Santley",
    "Writer": "Malcolm Stuart Boylan, Isabel Dawn, Jack Natteford",
    "Actors": "Don 'Red' Barry, Alan Curtis, Fay McKenzie",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0034647",
    "tt0035431",
    "tt0036217",
    "tt0036037",
    "tt0034000",
    "tt0034092",
    "tt0036474",
    "tt0036824",
    "tt0037280",
    "tt0228438",
    "tt0027184",
    "tt0035581"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.754Z"
}