{
  "movieId": "tt0010103",
  "title": "Eyes of Youth",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/EyesOfYouth",
      "id": "EyesOfYouth",
      "title": "Eyes of Youth",
      "description": "A young woman, confronted by four options for proceeding in her life, is granted the ability to see what results would come from her choice of of the options. After she sees her future along three of the roads, she makes her choice. This film is often credited for giving Valentino the role that led to him being cast in The Four Horseman of the Apocalypse (1921). Stars: Clara Kimball Young, Gareth Hughes and Pauline Starke Features: Rudolph Valentino Runtime: 78 min Sound Mix: Silent Color: Black and White",
      "fileSize": 778088276,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/EyesOfYouth",
      "language": "English",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 3059
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/EyesOfYouthPd19",
      "id": "EyesOfYouthPd19",
      "title": "Eyes of Youth",
      "description": "Title: Eyes of Youth Summary: A young woman at a crossroads is shown what her future would be like for each choice. Directed by: Albert Parker Actors: Clara Kimball Young, Gareth Hughes, Pauline Starke Production Company: Harry Garson Productions Release Date: 30 November 1919 (USA) Aspect Ratio: 1.33 : 1 A young woman, confronted by four options for proceeding in her life, is granted the ability to see what results would come from her choice of of the options. After she sees her future along three of the roads, she makes her choice.",
      "fileSize": 1095686354,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/EyesOfYouthPd19",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 768
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-eyes-of-youth",
      "id": "silent-eyes-of-youth",
      "title": "Eyes of Youth",
      "fileSize": 2135232972,
      "addedAt": "2026-01-07T00:10:59.117Z",
      "thumbnail": "https://archive.org/services/img/silent-eyes-of-youth",
      "language": "English",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 499
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "78 min",
    "imdbRating": 5.8,
    "imdbVotes": 692,
    "Genre": "Drama",
    "Plot": "Gina Ashling's father is in financial trouble, and Gina must decide whether to marry a wealthy man, become an opera singer, or marry the man she loves. An East Indian yogi allows her to look into the future and see what her fate will be if she chooses a path other than the one pointed out by love. Gazing into a crystal ball, the paths of duty, ambition, and wealth are all shown to lead to unhappiness. She sees herself in the crystal ball as a diligent schoolteacher, as a successful opera singer who has bought her fame at the price of her honor, and as a millionaire's wife whose reputation is sullied so that her husband may be granted a divorce. The visions of the three paths strengthen her decision to marry the man she loves.",
    "Director": "Albert Parker",
    "Writer": "Max Marcin, Albert Parker, Charles E. Whittaker",
    "Actors": "Clara Kimball Young, Gareth Hughes, Pauline Starke",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0013597",
    "tt0026610",
    "tt0328815",
    "tt0018113",
    "tt0009559",
    "tt0009968",
    "tt0010137",
    "tt0010208",
    "tt0010316",
    "tt0010402",
    "tt0010418",
    "tt0010890"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.117Z"
}