{
  "imdbId": "tt0008892",
  "title": "'Blue Blazes' Rawden",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BlueBlazesRawden",
      "id": "BlueBlazesRawden",
      "title": "\"Blue Blazes Rawden\" (1918)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   'Blue Blazes' Rawden is a drama about lumberjack country.  This film illustrates the work of Jack Hoxie, a star of Silent Hall of Fame. A tough lumberjack is challenged by a saloon owner and kills him, winning the property and the former owner's girlfriend. Later the killed man's mother arrives and the new boss has to confront his demons as he is forced to invent false stories. In this film Jack Hoxie still goes by the name Hart Hoxie, which he would change the following year, 1919, to become one of the most famous luminaries of Westerns. Directed by                          William S. Hart Produced by                        Artcraft Pictures Corporation Scenario by                          J.G. Hawks Cinematography                Joseph H. August Starring                                William S. Hart, Robert McKim, Jack Hoxie, Gertrude Claire, Maude George Distributed by                     Paramount Pictures Release date                         February 1, 1918 Running time                       51 min. Country                                United States Language                              Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 778448135,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BlueBlazesRawden",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 13651
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "65 min",
    "imdbRating": 5.9,
    "imdbVotes": 112,
    "Genre": "Drama, Western",
    "Plot": "Rawden, a lumberjack in the North woods, fights with crooked dance hall owner 'Ladyfingers' Hilgard over the affections of Babette DuFresne. Hilgard is killed. When Hilgard's mother and younger brother arrive in the remote logging town, Rawden attempts to ease their suffering by creating the fiction that Hilgard had been a well-loved man who died naturally. But when young Eric Hilgard learns the truth of his brother's death, he comes gunning for Rawden.",
    "Director": "William S. Hart",
    "Writer": "J.G. Hawks",
    "Actors": "William S. Hart, Maude George, Robert McKim",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008571",
    "tt0005172",
    "tt0011779",
    "tt0007260",
    "tt0009273",
    "tt0010316",
    "tt0007610",
    "tt0008319",
    "tt0010726",
    "tt0010853",
    "tt0011635",
    "tt0197903"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}