{
  "imdbId": "tt0002621",
  "title": "The Ambassador's Daughter",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-ambassadors-daughter",
      "title": "The Ambassador's Daughter",
      "fileSize": 284570345,
      "id": "silent-the-ambassadors-daughter"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "14 min",
    "imdbRating": 5.3,
    "imdbVotes": 84,
    "Genre": "Short, Drama",
    "Plot": "Richard Farnsworth, an attaché at the U.S. Embassy in London, is in love with Helen, the ambassador's daughter, and we see her at the embassy ball refuse his proposal of marriage. The next day, while the ambassador is at work in his office, a letter containing an important document is received. This he slips under the blotting pad on his desk and goes out with Helen. A clerk in the embassy. Charles Dumont, who is really a spy in the hire of a foreign power, has seen the ambassador hide the document, and during the latter's absence avails himself of the opportunity to steal it, but hearing somebody coming, he slips it into a vase and returns to his office unseen. Meantime, Farnsworth, entering the ambassador's office, finds on the floor a glove which Helen has dropped. He acts rather foolish over it, kisses it and is just putting it in his pocket, close to his heart, when the ambassador returns with Helen. The ambassador goes to his desk and discovers that the document is gone. He questions Crompton and Dumont, but to no avail, and finally turning to Farnsworth, asks him what he had placed in his pocket. He becomes foolishly embarrassed, but refuses to tell, and Helen, divining he has her glove, throws her father off the scent by suggesting that he make a thorough search before accusing anyone. This they proceed to do and Dumont, taking advantage of the opportunity, takes the document from its hiding place and hurries from the room. Helen becomes suspicious of him and follows him unobserved. Of course the search of the desk proves unavailing and the ambassador again turns to Farnsworth for explanation. Realizing the seriousness of his silence he shows the glove and explains the reason for his embarrassment. The ambassador understands, but just then Crompton enters, telling them of the disappearance of Dumont. Farnsworth, eager for action, hurries out to see if he can get on his track. Meantime, Dumont, followed by Helen, had gone to an Italian restaurant to turn over the document to two European spies. She manages to get into the courtyard of the restaurant outside the open window at which the spies are sitting. She watches her chance, and, unobserved, takes the document from the table, but the gate by which she had expected to escape from the courtyard proves to be locked and she is caught. Farnsworth arrives in time to rescue her; having seen Dumont come out of the restaurant, he rightly assumes that there he will find her. Dumont returns to the embassy unaware of what has taken place in the restaurant. He is closely questioned by the ambassador and Crompton, but holds his own until Helen and Farnsworth arrive with the document and their story of his guilt. He is arrested and Helen discovers that she does love Farnsworth after all.",
    "Director": "Charles Brabin",
    "Writer": "Bannister Merwin",
    "Actors": "Miriam Nesbitt, George Lessey, Robert Brower",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0132221",
      "title": "Hope, a Red Cross Seal Story",
      "year": 1912,
      "imdbRating": 5.1,
      "imdbVotes": 69,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0234953",
      "title": "An Unsullied Shield",
      "year": 1913,
      "imdbRating": 5.1,
      "imdbVotes": 97,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0405424",
      "title": "The Usurer's Grip",
      "year": 1912,
      "imdbRating": 5.7,
      "imdbVotes": 75,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002421",
      "title": "The Passer-by",
      "year": 1912,
      "imdbRating": 6.1,
      "imdbVotes": 122,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002098",
      "title": "Children Who Labor",
      "year": 1912,
      "imdbRating": 5.9,
      "imdbVotes": 152,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0123245",
      "title": "Romeo and Juliet",
      "year": 1911,
      "imdbRating": 4.6,
      "imdbVotes": 46,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005955",
      "title": "The Raven",
      "year": 1915,
      "imdbRating": 5.4,
      "imdbVotes": 120,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002784",
      "title": "Cymbeline",
      "year": 1913,
      "imdbRating": 5,
      "imdbVotes": 50,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": 6.1,
      "imdbVotes": 625,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002910",
      "title": "Granddad",
      "year": 1913,
      "imdbRating": 6,
      "imdbVotes": 89,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003075",
      "title": "The Little Tease",
      "year": 1913,
      "imdbRating": 5.7,
      "imdbVotes": 44,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003497",
      "title": "The Unwelcome Guest",
      "year": 1913,
      "imdbRating": 6.6,
      "imdbVotes": 33,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.974Z"
}