{
  "movieId": "tt0030648",
  "title": "Racing Blood",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RacingBlood",
      "id": "RacingBlood",
      "title": "Racing Blood",
      "description": "Frankie Darro buys a broken-down horse and turns him into a racing winner, despite the racketeers who try to fix the races and put him out of business.",
      "fileSize": 1033036425,
      "addedAt": "2026-01-07T00:06:45.468Z",
      "thumbnail": "https://archive.org/services/img/RacingBlood",
      "collection": "feature_films",
      "downloads": 14089
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 4.7,
    "imdbVotes": 47,
    "Genre": "Crime, Drama, Romance",
    "Plot": "Frankie Reynolds (Frankie Darro'), youngest member of a family of jockeys, borrows $4.85 (yes, four dollars and eighty-five cents) from his sister Phyllis (Gladys Blake), who is not a jockey, to buy a crippled colt from the stables owned by Clay Harrison (Kane Richmond). He nurses the colt back to health, and in two years has one of the fastest horses in the country. He borrows money from his pals to enter his horse in the opening race of the meet. The favorite, from the Harrison stables, is to be ridden by his brother Smokey (James Eagles as Jimmie Eagles). Race track racketeer Tex O'Donnell (Matthew Betz) frames Smoky and keeps him from winning the race, which Frankie wins. Smokey is ruled off the track for life. Frankie innocently has been responsible because of $500 he has accepted for his brother from a drunk named \"Legs\" (Arthur Housman). Frankie swears to find the drunk and clear his brother. Legs accidentally stumbles into the sister's restaurant and Clay and Frankie haul him off to the racing commissioner's office. But henchmen of Tex O'Donnell intercept them, beat them up and takes Legs away from them. With Derby Day approaching, an attempt to poison Frankie's horse fails, but O'Donnell has Frankie kidnapped to keep him from riding his horse, as the horse is known around and about by one and all to be a one-man horse. Frankie is still held captive on the day of the race but he writes out a prescription for henchman Dopey (Si Wills) that tips of the police to the location where he is being held. Before the police arrive, Frankie is shot attempting to escape and the police arrive and call for an ambulance, although the wounded Frankie begs to be taken to the track.",
    "Director": "Victor Halperin",
    "Writer": "Peter B. Kyne, Joseph O'Donnell",
    "Actors": "Frankie Darro, Kane Richmond, Gladys Blake",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021239",
    "tt0027568",
    "tt0027784",
    "tt0027348",
    "tt0027477",
    "tt0027564",
    "tt0027590",
    "tt0026436",
    "tt0029810",
    "tt0028607",
    "tt0028770",
    "tt0029050"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.468Z"
}