{
  "movieId": "tt0065671",
  "title": "Uncle Vanya",
  "year": 1970,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EF3A9mmRzGc",
      "id": "EF3A9mmRzGc",
      "title": "Uncle Vanya | CHEKHOV DRAMA",
      "description": "Based on the play by Anton Chekhov. End of 19th century, Russian province. The film is set in a family manor house whose inhabitants are bored with their lives, which they view as pointlessly and needlessly wasted. For many years the country estate has been looked after by Ivan Petrovich Voynitsky. \n\nUncle Vanya, a Russian intellectual barely making ends meet in these backwoods, falls in love with a woman who happens to be on his estate ...\nWhile making the film, the director set out to preserve the style and content of the original theatre piece as much as possible.\n\nThe film is recognised as one of the most successful adaptations of Chekhov's plays.\n\nIMDb rating: 7,3\n\nYear of production: 1970\n\nDirected by: Andrei Mikhalkov-Konchalovsky\nWritten by: Andrei Mikhalkov-Konchalovsky\nMusic: Alfred Schnittke\nDirectors of photography: Georgy Rerberg, Evgeny Guslinsky\nProduction designer: Nikolai Dvigubsky\nStarring: Innokenty Smoktunovsky, Sergei Bondarchuk, Irina Kupchenko, Irina Miroshnichenko\n\n#Uncle_Vanya #FullMoviesWithEngSubs #Chekhov #Literature",
      "addedAt": "2025-12-23T03:45:40.543Z",
      "thumbnail": "https://i.ytimg.com/vi/EF3A9mmRzGc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAaQ-0b5RypO5VqNgINpR5uoQ7hlQ",
      "duration": 6165,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Uncle_Vanya_1970",
      "id": "Uncle_Vanya_1970",
      "title": "Uncle_Vanya_1970",
      "description": "Uncle_Vanya_1970",
      "fileSize": 1418853354,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/Uncle_Vanya_1970",
      "collection": "feature_films",
      "downloads": 7936
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "104 min",
    "imdbRating": 7.3,
    "imdbVotes": 803,
    "Genre": "Drama",
    "Plot": "A retired professor has returned to his estate to live with his beautiful young wife, Yelena. The estate originally belonged to his first wife, now deceased; her mother and brother still live there and manage the farm. For many years the brother (Uncle Vanya) has sent the farm's proceeds to the professor, while receiving only a small salary himself. Sonya, the professor's daughter, who is about the same age as his new wife, also lives on the estate. The professor is pompous, vain, and irritable. He calls the doctor (Astrov) to treat his gout, only to send him away without seeing him. Astrov is an experienced physician who performs his job conscientiously, but has lost all idealism and spends much of his time drinking. The presence of Yelena introduces a bit of sexual tension into the household. Astrov and Uncle Vanya both fall in love with Yelena; she spurns them both. Meanwhile, Sonya is in love with Astrov, who fails even to notice her. Finally, when the professor announces he wants to sell the estate, Vanya, whose admiration for the man died with his sister, tries to kill him.",
    "Director": "Andrey Konchalovskiy",
    "Writer": "Anton Chekhov, Andrey Konchalovskiy",
    "Actors": "Irina Anisimova-Wulf, Sergey Bondarchuk, Irina Kupchenko",
    "Language": "Russian",
    "Country": "Soviet Union",
    "Awards": "3 wins & 2 nominations"
  },
  "relatedMovies": [
    "tt0064268",
    "tt0059585",
    "tt0103838",
    "tt0066495",
    "tt0066344",
    "tt0148692",
    "tt0065911",
    "tt0066049",
    "tt0182701",
    "tt0065451",
    "tt0065466",
    "tt0064093"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:41:49.741Z"
}