{
  "movieId": "tt0026700",
  "title": "Men of Action",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MenOfAction",
      "id": "MenOfAction",
      "title": "Men of Action",
      "description": "An actioner built around stock footage of Hoover Dam's construction. It plays like an extended serial chapter. Costarrs Roy Mason and Frankie Darro. Directed by Alan James. Released in 1935. 6 minutes are missing. CAST NOTE; Syd Saylor built a long and successful career mostly out of comedy relief. Between 1926 and 1966 he appeared in more than 450 film and television productions. His last role was in the feature film, \"The Crawling Hand.\" Its trailer is here at IA.",
      "fileSize": 1129171107,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/MenOfAction",
      "collection": "feature_films",
      "downloads": 5676
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 5.5,
    "imdbVotes": 38,
    "Genre": "Drama",
    "Plot": "Filled with stock footage from beginning to end of construction scenes on Hoover/Boulder Dam in Nevada, the story centers on the construction of the fictitious Sweetwater Dam being built in California. Evans Construction Company, run by Arthur Hooyt, has all its money tied up in the work and must finish the dam on time in order to collect. Meanwhile crooked banker Edwin Markham has other plans and sends in a collection of all-star B-feature heavies, including Fred Kohler, Wally Wales, Slim Whitaker and the Dillard brothers, to wreck the dam. The saboteurs dynamite a mountain and cover up John Ince, the father of water-boy Frankie Darro, who vows to avenge his dad's death. Frankie works his way up to a job as a rider in the radio-dispatched horse-mounted patrol organized by Evans'daughter, and, alongside the construction foreman (LeRoy Mason) makes a last-ditch effort to halt the dynamiting of the dam.",
    "Director": "Alan James",
    "Writer": "Peter B. Kyne, Forrest Sheldon, John W. Krafft",
    "Actors": "Frankie Darro, LeRoy Mason, Barbara Worth",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027165",
    "tt0024444",
    "tt0027366",
    "tt0025114",
    "tt0027087",
    "tt0036101",
    "tt0026867",
    "tt0030164",
    "tt0030648",
    "tt0027917",
    "tt0025269",
    "tt0134216"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}