{
  "imdbId": "tt0006736",
  "title": "The Good Bad-Man",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-good-bad-man",
      "id": "silent-the-good-bad-man",
      "title": "The Good Bad Man",
      "fileSize": 4540178460,
      "addedAt": "2026-01-07T00:11:15.976Z",
      "thumbnail": "https://archive.org/services/img/silent-the-good-bad-man",
      "language": "English",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 498
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "50 min",
    "imdbRating": 6.7,
    "imdbVotes": 270,
    "Genre": "Romance, Western",
    "Plot": "An eccentric outlaw, himself ignorant of his parentage, exhibits as the motive for the majority of his crimes his desire to aid unfortunate children. For instance, he robs a grocery store and gives the loot to a little orphan kid. Always cheerful, always smiling, he goes to such lengths as to hold up the Pacific Express to get the conductor's ticket punch. One day he rides into the alleged mine where Bud Frazer's band of bandits made their rendezvous. Just \"Passing' Through,\" he replies to their queries as to his identity. They send him to the shack of \"The Weazel\" for shelter and there he finds Amy. It is love at first sight and the stranger doesn't stay long. He doesn't know who he is so he rides away from the girl and shoots up a saloon in Maverick City just because he is in love and doesn't care what happens. A sheriff handy with the rope puts a halt to the proceedings but a United States marshal prevents a lynching. The marshal proves to be a former suitor of the prisoner's mother and from him \"Passin' Through\" learns that he has a right to hold his head as high as any man's. Bud Frazer coveted her and when he lost her he shot his rival and hounded mother and child until the former died. Meanwhile Frazer, now known as \"The Wolf,\" has learned the real identity of the stranger. He now covets Amy and she is forced to accompany his band to Maverick City to await the killing of \"Passin' Through\" and then become the wife of \"The Wolf\" \"Passin' Through,\" gunning for Frazer, is taken by surprise but escapes when the marshal arrives with his posse. Frazer is killed, the bandits are exterminated and \"Passin' Through\" rides away to the horizon with Amy sitting behind.",
    "Director": "Allan Dwan",
    "Writer": "Douglas Fairbanks",
    "Actors": "Douglas Fairbanks, Sam De Grasse, Pomeroy Cannon",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0007031",
    "tt0008309",
    "tt0009142",
    "tt0013556",
    "tt0001925",
    "tt0043017",
    "tt0008775",
    "tt0006780",
    "tt0006751",
    "tt0011439",
    "tt0412344",
    "tt0026124"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.976Z"
}