{
  "movieId": "tt0043975",
  "title": "Roaring City",
  "year": 1951,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_BaDN6nVKCE",
      "id": "_BaDN6nVKCE",
      "title": "Roaring City (1951) Action, Adventure, Crime, Film-Noir | Full Length Movie",
      "description": "A private detective is gets hired for two jobs: the first is to bet on a particular fighter during a fixed boxing match, and the second is to pose as a woman's husband for an evening. Both jobs turn out to be not quite as simple as they appeared to be at first.\n\nDirector: William Berke\nWriters: Julian Harmon, Victor West, Lou Morheim\nStars: Hugh Beaumont, Edward Brophy, Richard Travis\nGenres: ction, Adventure, Crime, Film Noir\n\nCCC CHAPTERS: in the general comments tell us your favorite scene and we will add it  \n00:00 Full Length Movie\n03:44 Whats your price?\n08:07 Fixed match?\n18:33 No is a bad word\n23:04 Tryna tell me he's dead?\n24:29 Ingrown toenail \n31:44 2 parts garden 1 part chloroform \n34:15 2 pretty women\n47:05 Made of the same kind of animal!\n49:35 Murder rap for sale\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:48:04.656Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/_BaDN6nVKCE/maxresdefault.webp?v=617283c6",
      "duration": 3458,
      "language": "en",
      "year": 1951,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "59 min",
    "imdbRating": 5.7,
    "imdbVotes": 186,
    "Genre": "Drama",
    "Plot": "Dennis O'Brien is hired by Barton to bet on Harper, an old fighter, against Lundy, placing the bets in the name of Steve Belzig. Lundy dies of a blood clot during the bout. At Barton's hotel, after the fight, Dennis finds Gannon and Lundy, where he learns that Belzig is Lundy's real name and that Barton and Gannon had the fight fixed for Lundy to take a dive in the first round, but Barton told Lundy to wait until the seventh and Harper didn't last that long. Dennis is knocked out and comes to to find police Lt. Burger in the room with him with Lundy dead. Accused of the murder and out on bail, Dennis starts his own investigation and finds that Gale Chase is connected with Gannon. He makes Gannon think that Gale is double-crossing him, but is arrested by Burger before he can harm Gale...(end first story... start second story)... Irma Rand hires Dennis to pose as Ted Fallon, husband of her step-daughter Sylvia. She introduces him to Eddie and Bill Rafferty, who knock him out and he awakens to find himself next to the body of the real Ted Fallon. He goes to Sylvia's apartment where he is again slugged by the two thugs, but this time he awakens and finds both men dead. The always-late Lt.Burger accuses him of these crimes. He learns from his buddy, Professor Shicker that Sylvia had cashed $30,000 worth of bonds belonging to Rafferty and is planning to flee the country with Irma. Catching up to them Dennis and Burger learn that Irma killed Ted Fallon... and Sylvia, believing that Rafferty did it, killed him and Eddie.",
    "Director": "William Berke",
    "Writer": "Julian Harmon, Victor West, Lou Morheim",
    "Actors": "Hugh Beaumont, Edward Brophy, Richard Travis",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043920",
    "tt0041133",
    "tt0178896",
    "tt0043516",
    "tt0040827",
    "tt0042224",
    "tt0042811",
    "tt0043064",
    "tt0044778",
    "tt0041986",
    "tt0040196",
    "tt0040437"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:53:43.028Z"
}