{
  "imdbId": "tt0034083",
  "title": "Rawhide Rangers",
  "year": 1941,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=khQzJ-qW6MY",
      "id": "khQzJ-qW6MY",
      "title": "Rawhide Rangers (1941) JOHNNY MACK BROWN",
      "description": "Director: Ray Taylor\nStars: Johnny Mack Brown, Fuzzy Knight, Kathryn Adams\n\nWhen Rangers Brand Calhoun and his brother investigate Blackie's outlaw gang, the brother is killed in a gunfight. Brand quits the Rangers and becomes an outlaw to infiltrate the gang and bring justice to the outlaws.",
      "addedAt": "2025-12-24T01:10:05.919Z",
      "thumbnail": "https://i.ytimg.com/vi/khQzJ-qW6MY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCAVHYP4eRc0B4MV3a1CgBzitc81g",
      "duration": 3359,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "56 min",
    "imdbRating": 6,
    "imdbVotes": 87,
    "Genre": "Western",
    "Plot": "One of the most recycled plots of the B-western genre in which a friend/brother of a lawman/Ranger/Mountie is killed by a gang of outlaws, and the lawman/Ranger/Mountie quits his job (as a ruse), turns outlaw (in a fashion) and joins the gang to bring them to justice. Columbia alone made two versions with Buck Jones and also used it for Charles Starrett and Russell Hayden later on. This Universal version (of at least three they did) has Brand Calhoun quitting the Rangers in disgust when his brother, Steve, is killed in a gunfight with the outlaw gang led by Blackie. He stages a few hold-ups and his exploits capture the attention of Blackie and his gang and they, since he is doing better than they are, force him to join them. By doing so, he is able to expose the real leader of the gang as the townsman who is giving the Rangers the most grief over their inability to put an end to the lawlessness.",
    "Director": "Ray Taylor",
    "Writer": "Ed Earl Repp",
    "Actors": "Johnny Mack Brown, Fuzzy Knight, Kathryn Adams",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030655",
    "tt0029289",
    "tt0030849",
    "tt0036290",
    "tt0039559",
    "tt0039993",
    "tt0025114",
    "tt0179209",
    "tt0026940",
    "tt0028372",
    "tt0034647",
    "tt0036421"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:41:36.246Z"
}