{
  "imdbId": "tt0005571",
  "title": "A Jitney Elopement",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AJitneyElopement",
      "title": "Charlie Chaplin's \"A Jitney Elopement\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"A Jitney Elopement\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin           Starring                     Charlie Chaplin, Edna Purviance, Leo White Cinematography        Harry Ensign Distributed by           Essanay Films Release date               April 1, 1915 Running time             26 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "AJitneyElopement"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-jitney-elopement-1915-directed-by-charlie-chaplin",
      "title": "A Jitney Elopement (1915) Directed By Charlie Chaplin",
      "description": "A Jitney Elopement Theatrical poster to A Jitney Elopement Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Lloyd Bacon Ernest Van Pelt Edna Purviance Leo White Cinematography Harry Ensign Edited by Charlie Chaplin Music by Robert Israel (Kino video release) Distributed by Essanay Studios General Film Company Release date April 1, 1915 Running time 33 minutes Country United States Languages Silent film English (original intertitles) A Jitney Elopement was Charlie Chaplin 's fifth film for Essanay Films . It starred Chaplin and Edna Purviance as lovers, with Purviance wanting Chaplin to take her away from an arranged marriage her father (played by Fred Goodwins) had planned for her. Chaplin does take her away in a jitney, a type of share taxi popular in the US between 1914 and 1916. Most of the film was made in San Francisco and includes scenes of San Francisco 's Golden Gate Park and the large windmills still on the park's west side. A scene filmed in Golden Gate Park Synopsis Edna's father greedily wants her to marry wealthy Count Chloride de Lime whom neither she nor he has ever met. Unknown to Edna's father, his daughter already has a true love: Charlie. Edna drops a note to her Charlie explaining her plight and asking him be her knight and save her. Charlie agrees. He arrives at Edna's home and impersonates the Count at dinner. Charlie humorously consumes beans with a knife, but still manages to keep up the facade of being a count. However, the true Count de Lime arrives and Charlie is roughly escorted away as an impostor. The count takes Edna to a nearby park to woo her, but Charlie is close by, as is Edna's father. Charlie interrupts the Count's romantic plans and begins a fight with the Count, Edna's father and three park policemen. An automobile chase featuring Edna and Charlie in one car (a two-seater roadster) and the pursuers in another (a four-seater) ends with a few timely and accurate brick tosses by Charlie and the pursuing vehicle being bumped off a pier. The movie ends with Edna and Charlie shyly kissing in their vehicle. Curiously Edna's name is given as Edna in an early title card and Edena mid-way. When she throws a note out of her window to Charlie, it is signed Iona Lott (I own a lot). Review A reviewer for Motion Picture World wrote, \"There is a vein of romance throughout the story which, combined with Chaplin's inimitable comedy, gives the picture a general appeal.\" Cast Charlie Chaplin as Suitor, the Fake Count Edna Purviance as Edna/Edena/Iona Lott Ernest Van Pelt as Edna's father Leo White as Count Chloride de Lime, Edna's Suitor Lloyd Bacon as Young Butler / Cop (uncredited) Paddy McGuire as Old Butler/Cop Bud Jamison as Cop with Baton Carl Stockdale as Cop Fred Goodwins as Car owner From Wikipedia, the free encyclopedia",
      "id": "a-jitney-elopement-1915-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-jitney-elopement",
      "title": "A Jitney Elopement",
      "id": "silent-a-jitney-elopement"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "26 min",
    "imdbRating": "5.9",
    "imdbVotes": "1,464",
    "Genre": "Short, Comedy",
    "Plot": "Edna's father wants her to marry wealthy Count He-Ha. Charlie, Edna's true love, impersonates the Count at dinner, but the real Count shows up and Charlie is thrown out. Later on Charlie and Edna are chased by her father, The Count, and three policeman. The pursuers drive off a pier.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Edna Purviance, Lloyd Bacon",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0006684",
      "title": "The Fireman",
      "year": 1916,
      "imdbRating": "6.5",
      "imdbVotes": "3,032",
      "language": "English, None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005812",
      "title": "A Night in the Show",
      "year": 1915,
      "imdbRating": "6.4",
      "imdbVotes": "2,446",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004936",
      "title": "The Bank",
      "year": 1915,
      "imdbRating": "6.6",
      "imdbVotes": "2,325",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006177",
      "title": "The Tramp",
      "year": 1915,
      "imdbRating": "6.9",
      "imdbVotes": "3,953",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007194",
      "title": "Police",
      "year": 1916,
      "imdbRating": "6.4",
      "imdbVotes": "2,047",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006548",
      "title": "The Count",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,527",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006689",
      "title": "The Floorwalker",
      "year": 1916,
      "imdbRating": "6.6",
      "imdbVotes": "2,839",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007162",
      "title": "The Pawnshop",
      "year": 1916,
      "imdbRating": "7.0",
      "imdbVotes": "3,922",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007507",
      "title": "The Vagabond",
      "year": 1916,
      "imdbRating": "6.8",
      "imdbVotes": "3,287",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007264",
      "title": "The Rink",
      "year": 1916,
      "imdbRating": "7.0",
      "imdbVotes": "4,406",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008133",
      "title": "The Immigrant",
      "year": 1917,
      "imdbRating": "7.5",
      "imdbVotes": "9,530",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}