{
  "movieId": "tt0038477",
  "title": "The Diary of a Chambermaid",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-diary-of-a-chambermaid-1946_202508",
      "id": "the-diary-of-a-chambermaid-1946_202508",
      "title": "The Diary of a Chambermaid (1946)",
      "description": "Celestine, the chamber-maid, has a new job in the country, at the Lanlaires. She has decided to use her beauty to seduce a wealthy man, but Mr. Lanlaire is not a right choice: the house is firmly controlled by Madame Lanlaire, helped by the strange valet Joseph. Then she tries the neighbour, former officer Mauger. This seems to work. But soon the son of the Lanlaires comes back. He is young, attractive and does not share his mother's antirepublican opinions. So Celestine's beauty attracts Captain Mauger, young Georges Lanlaire, and Joseph. Three men, from three different social classes, with three different conceptions of life. Will Celestine be able to convince Georges of her sincerity? Watch on RetroFlix:  https://retroflix.org/the-diary-of-a-chambermaid-1946/",
      "fileSize": 697273386,
      "addedAt": "2026-01-07T00:11:57.684Z",
      "thumbnail": "https://archive.org/services/img/the-diary-of-a-chambermaid-1946_202508",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 278
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "86 min",
    "imdbRating": 6.6,
    "imdbVotes": 1536,
    "Genre": "Drama, Romance",
    "Plot": "Célestine (Paulette Goddard), the chambermaid, has a new job in the country, at the Lanlaires. She has decided to use her beauty to seduce a wealthy man, but Mr. Lanlaire (Reginald Owen) is not a right choice: the house is firmly controlled by Madame Lanlaire (Dame Judith Anderson), helped by the strange valet Joseph (Francis Lederer). Then she tries the neighbor, former officer Mauger (Burgess Meredith). This seems to work. But soon the son of the Lanlaires comes back. He is young, attractive, and does not share his mother's anti-Republican opinions. So Célestine's beauty attracts Captain Mauger, young Georges Lanlaire (Hurd Hatfield), and Joseph. Three men, from three different social classes, with three different conceptions of life. Will Célestine be able to convince Georges of her sincerity? Will sinister and inflexible Joseph let his views on Célestine be ruined? A quite disillusioned depiction of humanity.",
    "Director": "Jean Renoir",
    "Writer": "Burgess Meredith, Octave Mirbeau, André Heuzé",
    "Actors": "Paulette Goddard, Burgess Meredith, Hurd Hatfield",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0014898",
    "tt0038107",
    "tt0038342",
    "tt0038988",
    "tt0038990",
    "tt0038592",
    "tt0039114",
    "tt0038733",
    "tt0038398",
    "tt0037578",
    "tt0038492",
    "tt0038499"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.684Z"
}