{
  "movieId": "tt0042261",
  "title": "The Blonde Bandit",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blonde-bandit-1950",
      "id": "blonde-bandit-1950",
      "title": "Blonde Bandit (1950)",
      "description": "Gerald Mohr, Dorothy Patrick, Robert Rockwell",
      "fileSize": 1251318968,
      "addedAt": "2026-01-07T00:07:38.718Z",
      "thumbnail": "https://archive.org/services/img/blonde-bandit-1950",
      "collection": "feature_films",
      "downloads": 1131
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "60 min",
    "imdbRating": 6.5,
    "imdbVotes": 68,
    "Genre": "Action, Crime, Drama",
    "Plot": "Newly arrived in a Western city, Kansan Gloria Dell waits at the train station to meet the fiance she has corresponded with, but never met, Larry Goodrich. When Larry does not arrive, Mrs. Henley of the Woman's Welfare League advises Gloria to look for him at the address he has given her. Gloria walks to the nearby address, only to find a bar where the bartender says an employee, Larry Richards, was arrested earlier that day for bigamy. Gloria decides to follow the bartender's advice and sell her engagement ring to pay for a ticket home. She goes to a jeweler named Charles Winters, who offers her $1,000 for the ring, much more than it is worth. After Gloria leaves with the money, Winters quickly burns the sales receipt, ransacks the shop and phones the police to report that his shop has been robbed. When Gloria returns to the train station, an investigator is waiting to arrest her. At the police station, Gloria is placed in jail after they find the money Winters had given her for the ring. A short time later, Winters pays off a three-hundred dollar debt to mob boss Joe Sapelli, stating that he received the money as payment from his insurance company for the robbery. Joe suspects that Winters has framed Gloria, so he decides to post her $10,000 bail. Before she is discharged, District Attorney James Deveron insists she help him break up Joe's syndicate, threatening to tell her family about the charges if she refuses. Deveron gives her the money that Joe has left for her, but when she meets Joe for dinner that evening, she returns it and asks him for a job instead. Later, when the vice squad raids Joe's bookmaking operation, some of his men are arrested, but Joe, who had been forewarned by the corrupt Lt. Metzger and Capt. E. V. Roberts. Later, Joe takes Gloria to his restaurant, where they meet Metzger and Roberts. That evening, Joe takes Gloria to his mother's house, where he shows her the record book that Deveron says he needs for a conviction. Joe shows her the page noting that Winters' debt has been paid, saying that it proves her innocence. That evening, Joe takes Gloria for a flight aboard his private plane, and during the trip, he proposes, promising to retire from his life of crime if she accepts. Stunned, Gloria asks for a few days to think it over, but agrees to wear his ring in the meantime. She goes to Deveron and says she will no longer help him, but Metzger and Roberts have already delivered the stolen record book to Deveron. When Joe realizes his book is gone, Gloria confesses her involvement with Deveron. Although she explains she did not take the book, Joe hits her in the face and leaves. Moments later, Gloria overhears Metzger ordering his men to kill Joe and grabs a gun, asking Joe's mother to hold it while she goes to the airport to warn Joe. Deveron, who has learned of Metzger's and Roberts' involvement with Joe, follows them to the airport and is fired upon when he tries to arrest them. Gloria arrives just as Joe and his henchman, Benny, take off, but their plane crashes due to lack of fuel. Gloria pleads with Joe, saying she will wait for him, but he arranges for her to return to Kansas. As Gloria boards the train, Joe says goodbye, but when she returns his ring, Joe is convinced of her love and asks her to stay.",
    "Director": "Harry Keller",
    "Writer": "John K. Butler",
    "Actors": "Robert Rockwell, Dorothy Patrick, Gerald Mohr",
    "Language": "Italian, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043024",
    "tt0041246",
    "tt0041133",
    "tt0178896",
    "tt0042176",
    "tt0040843",
    "tt0040196",
    "tt0040210",
    "tt0042343",
    "tt0042453",
    "tt0040676",
    "tt0040895"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.718Z"
}