{
  "imdbId": "tt0043521",
  "title": "The Family Secret",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1951-the-family-secret-secreto-de-familia-henry-levin-vose",
      "title": "1951 The Family Secret Secreto De Familia Henry Levin Vose",
      "id": "1951-the-family-secret-secreto-de-familia-henry-levin-vose"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-family-secret-1951-john-derek-lee-j-cobb-jody-lawrence",
      "title": "The Family Secret (1951) John Derek, Lee J Cobb, Jody Lawrence",
      "description": "The Family Secret is a 1951 American FILM NOlR crime film directed by Henry Levin and starring John Derek and Lee J. Cobb. A lawyer faces a difficult decision when his son accidentally kills his best friend with no witnesses present, and a rift develops in which his mother and father offer contradictory solutions to their son's dilemma. You can find out more about this movie from Wikipedia .",
      "id": "the-family-secret-1951-john-derek-lee-j-cobb-jody-lawrence"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": "6.1",
    "imdbVotes": "383",
    "Genre": "Crime, Drama",
    "Plot": "Outside a tavern, best friends Art Bradley and David Clark exchange punches over a girl. Art is drunk and pulls a knife on David, who hits Art over the head with a rock. Art dies and a panicked David drives home, where his parents are having a card party. Outside the house David hoses down his car to get rid of the mud stains, then runs upstairs to wash his dirty, bloody face and change his dirty clothes, then walks downstairs to greet his parents' guests like nothing is wrong. But the police call the house to inform David's father Howard, a retired criminal attorney, of Art's death; Art's mother is one of the Clarks' guests. They all go to the morgue to identify the body and the doctor gives Art's mother a sedative and sends her to bed. David feigns surprise about Art's death, but later his father confronts him and he admits that he killed Art. Although it looks like a classic case of self-defense, David hesitates to inform the police. David's father urges him to surrender to the police and also tell his mother that he did it. She takes a radically-different approach, advising him to keep quiet because he could go to prison. David's father tells him to follow his conscience about confessing, to the district attorney. The day David and his father walk into D.A.'s office for David to confess, the D.A. receives word that Art's killer has been arrested. The suspect is Joe Eisner, a well-known illegal bookie to whom Art owed money. Realizing that an innocent man has been wrongfully arrested for Art's killing, David sees his chance to avoid prison time by allowing Joe Elsner to take the blame. Ashamed about his son, David's father keeps quiet but urges David to do the right thing--then Joe Eisner's wife asks David's father to defend her innocent husband. She knows that Howard Clark is retired but she argues that he is the best criminal lawyer in town who's been recommended to her. Of course, Howard Clark refuses to help her, knowing his son David is the culprit. However, David and his mother Ellen convince David's father to take the case and defend the innocent Joe Elsner, to ensure that an innocent man won't take the blame for David's deed. Persuaded by these arguments, Howard Clark agrees to defend Joe Elsner, but the court proceedings don't go as planned: a tough prosecutor and an untruthful witness for the prosecution complicate matters. At the same time, a guilt-ridden David becomes more and more desperate to find inner peace by confessing to the killing.",
    "Director": "Henry Levin",
    "Writer": "Marie Baumer, James P. Cavanagh, Francis M. Cockrell",
    "Actors": "John Derek, Lee J. Cobb, Jody Lawrance",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0042343",
      "title": "Convicted",
      "year": 1950,
      "imdbRating": "6.8",
      "imdbVotes": "1,547",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038774",
      "title": "Night Editor",
      "year": 1946,
      "imdbRating": "6.7",
      "imdbVotes": "1,068",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042707",
      "title": "The Man Who Cheated Himself",
      "year": 1950,
      "imdbRating": "6.8",
      "imdbVotes": "2,807",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045124",
      "title": "Scandal Sheet",
      "year": 1952,
      "imdbRating": "7.4",
      "imdbVotes": "3,681",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041555",
      "title": "Knock on Any Door",
      "year": 1949,
      "imdbRating": "6.6",
      "imdbVotes": "4,414",
      "language": "English, Italian, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041958",
      "title": "Thieves' Highway",
      "year": 1949,
      "imdbRating": "7.5",
      "imdbVotes": "7,130",
      "language": "English, Italian, Greek",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046204",
      "title": "The President's Lady",
      "year": 1953,
      "imdbRating": "6.8",
      "imdbVotes": "980",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044364",
      "title": "Another Man's Poison",
      "year": 1951,
      "imdbRating": "6.8",
      "imdbVotes": "3,699",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043435",
      "title": "Cry Danger",
      "year": 1951,
      "imdbRating": "7.3",
      "imdbVotes": "3,004",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043390",
      "title": "Cause for Alarm!",
      "year": 1951,
      "imdbRating": "6.4",
      "imdbVotes": "2,709",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043465",
      "title": "Detective Story",
      "year": 1951,
      "imdbRating": "7.5",
      "imdbVotes": "9,898",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043625",
      "title": "He Ran All the Way",
      "year": 1951,
      "imdbRating": "7.0",
      "imdbVotes": "3,252",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:56:15.163Z"
}