{
  "imdbId": "tt0023616",
  "title": "Trailing the Killer",
  "year": 1932,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=75mhnwJHM28",
      "id": "75mhnwJHM28",
      "title": "Trailing the Killer (1932) Adventure, Western | Full Length Movie",
      "description": "Caesar the dog prowls around the woods of the Northwest, dispatches a rattlesnake, visits his she-wolf mate and their pups, pauses to watch the dainty habits of a raccoon, and then saves sheepherder Pierre, from getting et up by one mean mountain lion.\n\nDirector: Herman C. Raymaker\nWriter: Jackson Richards \nStars: Caesar the Dog, Francis McDonald, Heinie Conklin\nGenres: Adventure, Western\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:45:15.670Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/75mhnwJHM28/maxresdefault.webp?v=63a49ab8",
      "duration": 3781,
      "language": "en",
      "year": 1932,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "65 min",
    "imdbRating": 4.7,
    "imdbVotes": 44,
    "Genre": "Adventure, Thriller, Western",
    "Plot": "While the original title, \"Trailing the Killer\" isn't a misnomer, it was a bit misleading since the \"trailer\" is a dog named Caesar Caesar the Dog) and the killer is a mountain lion, aka as a cougar or puma the narrator was quick to point out. But the makers also pointed out that Caesar \"is the most intelligent dog actor since Rin-Tin-Tin\" which probably lured a few Rin-Tin-Tin fans with a show-me attitude. Caesar prowls around the woods of the Northwest, dispatches a rattlesnake, visits his she-wolf mate and their pups, pauses to watch the dainty habits of a raccoon personally washing every morsel of food before eating it---and that raccoon had enough food to use up several minutes of running time---and then saves sheepherder Pierre (Francis McDonald)) from getting et up by one mean mountain lion. Rin-Tin-Tin he ain't, but then who was? Commonwealth changed the title to \"Call of the Wilderness\" when they acquired it for 16mm rental to the school market.",
    "Director": "Herman C. Raymaker",
    "Writer": "Jackson Richards",
    "Actors": "Caesar the Dog, Francis McDonald, Heinie Conklin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0042033",
    "tt1268864",
    "tt0252810",
    "tt0126214",
    "tt0025940",
    "tt0023566",
    "tt0023005",
    "tt0026673",
    "tt0020320",
    "tt0158043",
    "tt0023243",
    "tt0009900"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:51:24.942Z"
}