{
  "movieId": "tt0002113",
  "title": "À la conquête du pôle",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1912GeorgesMeliesALaConqueteDuPoleConquestOfTheNorthPole",
      "id": "1912GeorgesMeliesALaConqueteDuPoleConquestOfTheNorthPole",
      "title": "À La Conquête Du Pôle",
      "description": "Conquest Of The North Pole: Scientists from all over the world are meeting to discuss the best way to reach the North Pole. Professor Maboul demonstrates for them the innovative equipment that he has designed for the purpose. When everything is ready, Maboul and several other scientists depart for the pole. Their trip will prove to be even more eventful than expected. Country: France Language: French Release Date: 1912 (France) Also Known As: À la conquête du pôle, The Conquest of the Pole Production Co: Georges Méliès, Star-Film Runtime 33 min  17 min (Portugal)  30 min (Flicker Alley print) (France) Sound Mix Silent Color Black and White Aspect Ratio 1.37 : 1 Negative Format 35 mm Cinematographic Process Spherical Printed Film Format 35 mm",
      "fileSize": 123963402,
      "addedAt": "2026-01-07T00:06:00.051Z",
      "thumbnail": "https://archive.org/services/img/1912GeorgesMeliesALaConqueteDuPoleConquestOfTheNorthPole",
      "language": "fre",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 10795
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "33 min",
    "imdbRating": 6.9,
    "imdbVotes": 1249,
    "Genre": "Short, Adventure, Horror",
    "Plot": "Nearly one decade after his extraordinary feat in Le voyage à travers l'impossible (1904), the indefatigable and unorthodox engineering scientist, Professor Mabouloff, convinces his esteemed colleagues at the International Aero Club Congress to join him on yet another impossible expedition: a journey to the vast landscapes of the North Pole. Aboard the futuristic flying machine of his own invention, the intercultural explorers weed out the fierce competition and zoom off to the densely-occupied skies, until the team lands at the glacial terrains of their final destination. What wonders await the bold adventurers?",
    "Director": "Georges Méliès",
    "Writer": "Georges Méliès, Jules Verne",
    "Actors": "Georges Méliès, Fernande Albany",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0135180",
    "tt0223755",
    "tt0000417",
    "tt0000575",
    "tt0000465",
    "tt0215938",
    "tt0223492",
    "tt0228696",
    "tt0222785",
    "tt0002143",
    "tt0228986",
    "tt0222731"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.051Z"
}