{
  "imdbId": "tt0011904",
  "title": "The Ace of Hearts",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Ace_of_Hearts_1921",
      "title": "The Ace of Hearts",
      "description": "From IMDb : A secret society holds a meeting to determine what to do about a powerful and dangerous man whom they have been studying closely for the past three months. They all agree that he deserves to die. Two of the members, Farallone and Forrest, are both in love with Lilith, the group's only female member. But Lilith accepts neither of them, preferring to devote herself to the group's cause. When the group meets again and deals cards to all the members, Forrest draws the ace of hearts, meaning that he will be the one to carry out the assassination. Lilith then suddenly agrees to marry him, in order to give him courage. But after their first night together, both of them begin to feel differently about what they have planned. Stars: Lon Chaney, Leatrice Joy, John Bowers, Hardee Kirkland, Raymond Hatton, and Edwin N. Wallock *I would have loved to include the music for this film, but like almost all music made for silent films released on DVD it was under copyright.*",
      "id": "Ace_of_Hearts_1921"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rINFaG8ES-0",
      "title": "The Ace of Hearts (1921) | Colorized Public Domain Lon Chaney Silent Crime Drama Restored Classic",
      "description": "The Ace of Hearts (1921) is a silent American crime drama directed by Wallace Worsley, starring Lon Chaney, Leatrice Joy, and John Bowers. This restored and colorized edition revives a moody and tense story of love, betrayal, and justice, bringing new life to one of Chaney’s lesser-known but highly atmospheric works. Released during the early 1920s, the film blends suspense with social commentary, reflecting the anxieties of its era while showcasing Chaney’s unmatched talent for embodying morally complex characters. By enhancing this public domain treasure in modern color and quality, Colorized Public Domain makes the film accessible for today’s audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story revolves around a secret society dedicated to vigilante justice, whose members aim to rid the world of corruption and greed by targeting those they see as oppressors. The group assigns its missions through a symbolic card game, with the chosen assassin receiving the Ace of Hearts. Forrest (John Bowers) is deeply in love with the idealistic Lilith (Leatrice Joy), but she is drawn to Farallone (Lon Chaney), a fellow member of the society.\n\nWhen Farallone is chosen by the Ace of Hearts to carry out an assassination, personal loyalties clash with duty. The love triangle intensifies as Lilith marries Forrest, only to later realize her true feelings for Farallone. In a dramatic twist, Farallone’s mission forces him to confront the society’s ideals, and his final act of sacrifice becomes the film’s haunting moral centerpiece.\n\nThe film stands out for its moral ambiguity, silent-era atmosphere, and Lon Chaney’s commanding performance. While Chaney was famous for his transformative makeup roles, here he plays a character defined not by deformity but by inner conflict, showcasing his versatility as one of cinema’s first great character actors.\n\nCast and Crew:\n• Director: Wallace Worsley\n• Producer: Samuel Goldwyn\n• Cinematography: Percy Hilburn\n• Editing: Wallace Worsley\nStarring:\n• Lon Chaney as Farallone\n• Leatrice Joy as Lilith\n• John Bowers as Forrest\n• Hardee Kirkland as The Chief\n• Kenneth Harlan as Brother Carl\n\nFilm Significance:\nThough not as widely remembered as Chaney’s classics such as The Phantom of the Opera or The Hunchback of Notre Dame, The Ace of Hearts captures the post–World War I mood of disillusionment, secrecy, and revolutionary ideas. It reflects the era’s fascination with shadowy societies and justice outside the law, while also presenting one of the silent era’s more complex romantic dilemmas. Today, it is valued by film historians as a key example of Chaney’s range and the darker, socially conscious side of early Hollywood storytelling.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Ace of Hearts remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1921 release was silent and in black and white, like most films of its time. While authentic to the period, such presentation often alienates modern viewers. By colorizing and restoring the film, we bridge historical preservation with contemporary expectations, allowing new audiences to connect with Lon Chaney’s emotional performance and the gripping narrative more directly. This colorized edition preserves the artistry of the original while making it easier for today’s audiences to appreciate.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including early crime dramas, forgotten thrillers, and influential works of the silent era. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheAceOfHearts #LonChaney #SilentFilm #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentDrama #ClassicCinema #FilmRestoration #CrimeDramaClassic",
      "id": "rINFaG8ES-0",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theaceofhearts4k",
      "title": "The Ace Of Hearts (1921) [Colorized, 4K, 60FPS]",
      "description": "The Ace Of Hearts is a 1921 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "theaceofhearts4k"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "75 min",
    "imdbRating": "6.8",
    "imdbVotes": "1,314",
    "Genre": "Crime, Drama, Mystery",
    "Plot": "A secret society holds a meeting to determine what to do about a powerful and dangerous man whom they have been studying closely for the past three months. They all agree that he deserves to die. Two of the members, Farallone and Forrest, are both in love with Lilith, the group's only female member. But Lilith accepts neither of them, preferring to devote herself to the group's cause. When the group meets again and deals cards to all the members, Forrest draws the ace of hearts, meaning that he will be the one to carry out the assassination. Lilith then suddenly agrees to marry him, in order to give him courage. But after their first night together, both of them begin to feel differently about what they have planned.",
    "Director": "Wallace Worsley",
    "Writer": "Gouverneur Morris, Ruth Wightman",
    "Actors": "Leatrice Joy, John Bowers, Lon Chaney",
    "Language": "None",
    "Country": "United States",
    "Awards": "2 wins & 2 nominations"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0011565",
      "title": "The Penalty",
      "year": 1920,
      "imdbRating": "7.3",
      "imdbVotes": "2,769",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012651",
      "title": "The Haunted Castle",
      "year": 1921,
      "imdbRating": "6.1",
      "imdbVotes": "2,022",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014142",
      "title": "The Hunchback of Notre Dame",
      "year": 1923,
      "imdbRating": "7.2",
      "imdbVotes": "6,381",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010890",
      "title": "The Wicked Darling",
      "year": 1919,
      "imdbRating": "6.4",
      "imdbVotes": "474",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038494",
      "title": "Dressed to Kill",
      "year": 1946,
      "imdbRating": "6.8",
      "imdbVotes": "7,431",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028231",
      "title": "Secret Agent",
      "year": 1936,
      "imdbRating": "6.4",
      "imdbVotes": "9,469",
      "language": "English, French, German, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0204626",
      "title": "The Watcher",
      "year": 2000,
      "imdbRating": "5.3",
      "imdbVotes": "29,163",
      "language": "English, Vietnamese",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt3319920",
      "title": "Regression",
      "year": 2015,
      "imdbRating": "5.6",
      "imdbVotes": "44,155",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Moviedome"
    },
    {
      "imdbId": "tt0044314",
      "title": "5 Fingers",
      "year": 1952,
      "imdbRating": "7.6",
      "imdbVotes": "5,573",
      "language": "English, German, Portuguese, Turkish, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047119",
      "title": "An Inspector Calls",
      "year": 1954,
      "imdbRating": "7.5",
      "imdbVotes": "5,549",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052634",
      "title": "Chance Meeting",
      "year": 1959,
      "imdbRating": "6.7",
      "imdbVotes": "933",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035694",
      "title": "The Boss of Big Town",
      "year": 1942,
      "imdbRating": "5.1",
      "imdbVotes": "118",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:44.280Z"
}