{
  "imdbId": "tt0029487",
  "title": "Ridin' the Lone Trail",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bvQPXK4IbWc",
      "id": "bvQPXK4IbWc",
      "title": "Ridin’ the Lone Trail (1937) BOB STEELE🍕 COWBOY WESTERN",
      "description": "Stars: Bob Steele, Claire Rochelle, Buck Connors\nDirector: Sam Newfield\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TWGtEwPijI7-Ff89pphoNOX\nRide into the heart of frontier justice with this 1937 Western from Ambassador Pictures, directed by Sam Newfield. With a screenplay by Charles F. Royal based on a story by E.B. Mann, this fast-paced film delivers all the hallmarks of classic B-Western action from Hollywood’s Poverty Row era.\n\nBob Steele stars as a determined lawman confronting corruption and treachery in a rugged Western town. Known for his athleticism and steely screen presence, Steele leads a cast that includes Claire Rochelle, Charles King, and Ernie Adams. Packed with deception, gunplay, and moral grit, the film captures the essence of 1930s Western storytelling—straightforward, thrilling, and deeply rooted in themes of justice.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nShot during the height of the Western boom, this production exemplifies the genre’s enduring appeal and the resourceful filmmaking that defined low-budget studios of the era. Ideal for fans of vintage cinema and public domain treasures, it’s a must-watch for lovers of Old Hollywood Westerns.\n\n📽️ Be sure to like, comment, and subscribe for more classic Westerns restored from the archives.\n\n#RidinTheLoneTrail #BobSteele #ClassicWestern #SamNewfield #1930sCinema #ClaireRochelle #BWestern #Charles King # #VintageWestern #Ambassador Pictures #PizzaFLIX",
      "addedAt": "2025-12-24T01:02:54.816Z",
      "thumbnail": "https://i.ytimg.com/vi/bvQPXK4IbWc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBZ53ntBEDbqGLPo0ISFzIxKpKVWQ",
      "duration": 3390,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "56 min",
    "imdbRating": 5.6,
    "imdbVotes": 32,
    "Genre": "Romance, Western",
    "Plot": "The Golden Girl Mine, owned by Randall (Frank Ball) and Furman (Hal Price), is suffering great losses, as their gold shipments by stagecoach are being held up and stolen. The only clue is a horse called White Peril, ridden by the masked outlaw leader at every hold-up. Strangely enough, the horse is owned by Rndall's daughter, Joan (Claire Rochelle), the only one known to be able to ride the horse. Bob MacArthur (Bob Steele) becomes the deputy of Sheriff Carson (Steve Clark), and hires himself out to the Lazy-R ranch. There, he makes an enemy of \"Dusty\" Williams (Charles King), a neighboring rancher, when he is kept from shooting White Peril. Peters (Ernie Adams), the ranch foreman, makes himself helpful to Bob, answering all questions concerning the robberies, murders and White Peril. Bob follows White Peril to the outlaw's hideout, only to be captured. \"Dusty\", revealed as the masked chief's head henchman, leaves Bob to be killed by his henchmen, but he escapes after being led to believe that Joan is the masked chief. After a fast chase, another stagecoach robbery and a chase on a railroad handcar, Bob brings the masked chief, who is John Doe, to justice and who had owned White Peril as a colt, and was able to ride him unknown to anyone.",
    "Director": "Sam Newfield",
    "Writer": "E.B. Mann, Charles F. Royal",
    "Actors": "Bob Steele, Claire Rochelle, Charles King",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029147",
    "tt0028645",
    "tt0028969",
    "tt0028967",
    "tt0028914",
    "tt0028583",
    "tt0133763",
    "tt0030870",
    "tt0030556",
    "tt0031267",
    "tt0029126",
    "tt0028604"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:06.901Z"
}