{
  "imdbId": "tt0032179",
  "title": "21 Days Together",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/21DaysTogether",
      "id": "21DaysTogether",
      "title": "21 Days Together",
      "description": "EDIT: 1/9/19. A sharper print (\"21 DAYS TOGETER upgrade\") has been added.  “Superb suspense thriller” “Well played out story” “Well-worth watching” “Limp and unconvincing” “Disappointed” (IMDB reviews quotes). A romantic suspense thriller that failed to hit the mark, and thus its release was delayed for three years, that is until Olivier and Leigh were better known on both sides of the Atlantic. (see TRIVIA) Good supporting cast. IMDB rating 6.3. Directed by Basil Dean. Released in 1940 Complete print. TRIVIA: This was the second of three films Vivien Leigh and Laurence Olivier appeared in together. The other two were “Fire Over England” and “Lady Hamilton” (AKA “That Hamilton Woman”). A good print of “Fire Over England” is available here: https://archive.org/details/FireOverEnglandVideoQualityUpgrade  ",
      "fileSize": 2116792856,
      "addedAt": "2026-01-07T00:06:06.565Z",
      "thumbnail": "https://archive.org/services/img/21DaysTogether",
      "collection": "feature_films",
      "downloads": 26520
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/21dffd5587",
      "id": "21dffd5587",
      "title": "21 Days Together",
      "description": "Title: 21 Days Together Summary: After Larry Darrent accidentally kills his lover's blackmailing husband, someone else is arrested for the crime. Larry and Wanda have just three weeks together before the trial and if the ... Directed by: Basil Dean Basil Dean Actors: Vivien Leigh, Leslie Banks, Laurence Olivier Production Company: London Film Productions Release Date: 29 April 1940 (USA) Aspect Ratio: 1.37 : 1 Color: Black and White After Larry Darrent accidentally kills his lover's blackmailing husband, someone else is arrested for the crime. Larry and Wanda have just three weeks together before the trial and if the man is found guilty then Larry will give himself up and prevent an innocent man going to the gallows.",
      "fileSize": 1010949731,
      "addedAt": "2026-01-07T00:06:06.565Z",
      "thumbnail": "https://archive.org/services/img/21dffd5587",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 1874
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 6.1,
    "imdbVotes": 1285,
    "Genre": "Crime, Drama, Romance",
    "Plot": "After Larry Darrent accidentally kills his lover's blackmailing husband, someone else is arrested for the crime. Larry and Wanda have just three weeks together before the trial and if the man is found guilty then Larry will give himself up and prevent an innocent man going to the gallows.",
    "Director": "Basil Dean",
    "Writer": "John Galsworthy, Basil Dean, Graham Greene",
    "Actors": "Vivien Leigh, Leslie Banks, Laurence Olivier",
    "Language": "Italian, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033526",
    "tt0033873",
    "tt0031863",
    "tt0031975",
    "tt0034272",
    "tt0030323",
    "tt0030981",
    "tt0030122",
    "tt0032976",
    "tt0028607",
    "tt0028770",
    "tt0029050"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.565Z"
}