{
  "imdbId": "tt0028404",
  "title": "The Traitor",
  "year": 1936,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7McJAkgtEBk",
      "id": "7McJAkgtEBk",
      "title": "The Traitor (1936) TIM McCOY🍕 COWBOY WESTERN",
      "description": "Stars: Tim McCoy, Frances Grant, Frank Melton\nDirector: Sam Newfield\n\nSaddle up for another thrilling ride with cowboy legend Tim McCoy in a vintage Western film directed by Sam Newfield and co-starring Frances Grant and Frank Melton. This action-packed B-Western is a must-watch for fans of classic 1930s Westerns, old-school gunfights, and frontier justice.\n\nIn this classic Tim McCoy Western, a respected lawman must uncover betrayal and deceit in a rugged frontier town. With gripping suspense, blazing shootouts, and McCoy's signature stoic heroism, The Traitor delivers everything fans love about early American Westerns.\n\nIf you're a fan of vintage cowboy movies or rare Western films, don’t miss this restored gem on PizzaFLIX – your #1 destination for classic cinema and legendary cowboy heroes.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nWhether you're a fan of Tim McCoy’s iconic cowboy roles, tales of Western outlaws, or riveting revenge dramas, The Traitor delivers the action and suspense you crave. Perfect for PizzaFLIX enthusiasts and lovers of Western classics, this film is a must-watch for those who cherish stories of courage, loyalty, and the relentless pursuit of justice.\n\n#TimMcCoy #ClassicWestern #TheTraitor1936 #CowboyMovies #PizzaFLIX #WesternFullMovie #VintageWestern #SamNewfield #1930sCowboyCinema",
      "addedAt": "2025-12-24T01:04:27.583Z",
      "thumbnail": "https://i.ytimg.com/vi/7McJAkgtEBk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBS4QzP2JBq7kfjOsXvse2Eumbw2w",
      "duration": 3387,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "56 min",
    "imdbRating": 5.6,
    "imdbVotes": 49,
    "Genre": "Drama, Western",
    "Plot": "To prevent a lynching, Ranger Tim lets two outlaws go saying he will get them later. This gets him kicked out of the Rangers and he goes across the border and joins Big George's gang who are running contraband. But the outlaw Jimmy overhears Tim tell his sister that the dismissal was a fake. Big George and his gang then go after Tim and trap him in a cabin.",
    "Director": "Sam Newfield",
    "Writer": "John T. Neville, Joseph O'Donnell",
    "Actors": "Tim McCoy, Frances Grant, Frank Melton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028195",
    "tt0027669",
    "tt0031164",
    "tt0031769",
    "tt0028645",
    "tt0026133",
    "tt0028969",
    "tt0029147",
    "tt0030159",
    "tt0133763",
    "tt0030870",
    "tt0030556"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:34:31.904Z"
}