{
  "movieId": "tt0030324",
  "title": "King of the Sierras",
  "year": 1938,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=24X3H66pNq8",
      "id": "24X3H66pNq8",
      "title": "King of the Sierras (1938) | Classic Western | Full Length Movie",
      "description": "As Hank and his young nephew Tommy observe men trying to capture wild horses near their ranch, Hank tells Tommy that he doesn't believe in taking horses away from the wild. The next day, Hank, who tries to be as much like a parent as possible to the orphaned Tommy, promises to tell him a story about how Whitey, their beautiful stallion, came to stay at their ranch. \n\nDirector: Samuel Diege, Arthur Rosson \nWriters: Scott Darling, Paul Franklin \nStarring: Rex, Hobart Bosworth, Harry Harvey Jr., Frank Campeau, Harry Harvey, Sheik the Horse,                                                                                                                                                                           Genres: Western\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:45:47.199Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/24X3H66pNq8/maxresdefault.webp?v=63aefa23",
      "duration": 3348,
      "language": "en",
      "year": 1938,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "53 min",
    "imdbRating": 4.8,
    "imdbVotes": 49,
    "Genre": "Drama, Western",
    "Plot": "An unusual film in that it was composed of new film footage tacked onto an original film produced by M. H. Hoffman Sr. and Jr.,and never released because of the collapse and merger of the Hoffman's Liberty Company into the newly-formed Republic operation in mid-1935, and consequently has two different sets of actors and production crew members. The \"Hoffman\" group was made up of director Arthur Rosson, writers Frank Gay (who also doubled as Associate Producer) and W. Scott Darling, cameraman Tom Galligan, editor Dan Milner, assistant director Milton Brown, noted animal trainer Jack Lindell(who also had a film role) and actors Frank Campeau, Wally Albright, Edward Peil Sr. and Morgan Brown. It was filmed in the vicinity of Fredonia, Arizona and this group in no way functioned as a 2nd unit. They were making their own film. The film went unreleased, and George A. Hirliman took it over for his Condor Productions unit at Grand National, and shot additional footage directed by Samuel Diege, with Jack Greenhalgh on camera, Carl Pierson editing, two songs from Lew Porter, and Arthur Hoerl and Paul Franklin writing additional dialogue for the \"Hirliman\" flash-back cast of Hobart Bosworth, Harry Harvey and his son Harry Harvey, Jr. The Hoffman group was in Arizona, where a group of ranchers in the area south of the Utah border and east of the Colorado River had appealed to the Department of the Interior for relief against the great herds of wild mustangs that roamed the range, already stripped of most vegetation by dust storms and drought. The U.S. government contractors, under the authority of the Taylor Grazing Bill, undertook the task of rounding up nearly 3000 wild mustangs using airplanes, mounted cowboys and bright reflectors. Frank Gay wrote a wild horse story built around this impending roundup involving a rancher's son(Wally Albright) and a crusty old-timer (Frank Campeau). Jack Lindell had work for his stable of trained horses, including \"Rex\", King of the Wild Horses (as \"El Diablo\",the villain horse) and \"Sheik\", the New Wonder Hose (as \"Whitey\", the hero horse), who are the only credited \"names\" on the posters and advertising.",
    "Director": "Samuel Diege, Arthur Rosson",
    "Writer": "Scott Darling, Paul Franklin, Frank Gay",
    "Actors": "Rex, Hobart Bosworth, Harry Harvey Jr.",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030006",
    "tt0030159",
    "tt0030409",
    "tt0030655",
    "tt0030689",
    "tt0030969",
    "tt0133763",
    "tt0030208",
    "tt0030443",
    "tt0030870",
    "tt0030742",
    "tt0029962"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:51:49.077Z"
}