{
  "imdbId": "tt0041187",
  "title": "Blonde Ice",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BlondeIce",
      "title": "Blonde Ice",
      "description": "A society reporter (Leslie Brooks) keeps herself in the headlines by marrying a series of wealthy men, all of whom die under mysterious circumstances",
      "id": "BlondeIce"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blonde-ice-1948",
      "title": "Blonde Ice",
      "description": "A golddigging femme fatale leaves a trail of men behind her, rich and poor, alive and dead. Watch on RetroFlix:  https://retroflix.org/blonde-ice-1948/",
      "id": "blonde-ice-1948"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blonde-ice-1948_202510",
      "title": "Blonde Ice 1948 202510",
      "description": "A society reporter keeps herself in the headlines by marrying a series of wealthy men, all of whom die under mysterious circumstances.",
      "id": "blonde-ice-1948_202510"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-yGqctCOcNQ",
      "title": "Blonde Ice (1948) [Film Noir] [Crime] [Drama]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"Blonde Ice\" is a 1948 American femme fatale crime film directed by Jack Bernhard and starring Leslie Brooks, Robert Paige and Michael Whalen. It was based on a novel by Whitman Chambers.\n\nClaire is a society reporter who will do whatever she has to for a story. Claire manages to keep herself in the headlines by marrying and romancing a series of wealthy men, all of whom die under mysterious circumstances. To deflect suspicion from herself, Claire frames her former boyfriend, sportswriter Les Burns.\n\n---\n\nDirected by Jack Bernhard, produced by Robert E. Callahan (associate producer) and Martin Mooney (producer), written by Whitman Chambers (novel \"Once Too Often\") Kenneth Gamet (writer) and Dick Irving Hyland (adaptation), starring Robert Paige as Les Burns, Leslie Brooks as Claire Cummings Hanneman, Russ Vincent as Blackie Talon (the Pilot), Michael Whalen as Stanley Mason (Attorney), James Griffith as Al Herrick, Emory Parnell as Police Capt. Bill Murdock, Walter Sande as Hack Doyle, John Holland as Carl Hanneman, Mildred Coles as June Taylor, Selmer Jackson as District Attorney Ed Chalmers, David Leonard as Dr. Geoffrey Kippinger and Jack Del Rio as Roberts (the Butler).\n\n---\n\nSource: \"Blonde Ice\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 12 June 2013. Web. 22 July 2013. http://en.wikipedia.org/wiki/Blonde_Ice.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "-yGqctCOcNQ",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=y7yYzEAdWBQ",
      "title": "Blonde Ice (1948) | Colorized Public Domain Film Noir Classic with Leslie Brooks and Robert Paige",
      "description": "Blonde Ice (1948) is an American film noir crime drama directed by Jack Bernhard, featuring Leslie Brooks in her most iconic role as a ruthless femme fatale. Restored and colorized by Colorized Public Domain, this public domain classic brings one of the most striking examples of post-war noir cinema to life for modern audiences in the USA, Europe, and beyond. Its themes of manipulation, greed, and moral corruption remain chillingly relevant, while its sharp black-and-white origins have been reimagined in vivid color for today’s viewers.\n\nPlot Summary:\nClaire Cummings Hanneman (Leslie Brooks) is a cold, calculating society columnist whose ambitions stretch far beyond the pages of the newspaper. Determined to rise in wealth and status at any cost, she manipulates men with charm, intelligence, and ruthless efficiency. Claire marries wealthy publisher Carl Hanneman (John Holland), but her ambition and duplicity soon drive her to betrayal and murder.\n\nWhen Carl dies under suspicious circumstances, Claire continues her relentless pursuit of power, quickly setting her sights on another influential man. Reporter Les Burns (Robert Paige), who knows her past too well, tries to resist her dangerous allure. However, Claire’s web of deceit grows deadlier, leading to more lives destroyed in her path.\n\nThe tension builds as District Attorney Dixon (Russ Vincent) unravels Claire’s trail of lies, while Les struggles between exposing her crimes and his lingering attraction to her. The film crescendos into a shocking climax that exemplifies noir’s brutal morality: those who exploit love and trust for personal gain cannot escape the consequences.\n\nCast and Crew:\n• Director: Jack Bernhard\n• Producer: Martin Mooney\n• Screenplay: Kenneth Gamet\n• Based on: Novel “Once Too Often” by Whitman Chambers\n• Cinematography: George Robinson\n• Editing: Martin G. Cohn\n\nStarring:\n• Leslie Brooks as Claire Cummings Hanneman\n• Robert Paige as Les Burns\n• Michael Whalen as Stanley Mason\n• Russ Vincent as District Attorney Dixon\n• John Holland as Carl Hanneman\n• James Griffith as Al Herrick\n\nFilm Significance:\nBlonde Ice stands out in the pantheon of 1940s film noir as one of the most unapologetically cold portrayals of a femme fatale. Unlike other noir heroines who might be conflicted or tragic, Leslie Brooks’s Claire is a pure predator — charming, manipulative, and utterly devoid of conscience. The film captures the anxieties of post-World War II America, where gender roles were shifting, and female ambition was often coded as dangerous. Its gritty atmosphere, fast-paced dialogue, and moral ambiguity make it a must-see for fans of classic noir and social commentary.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Blonde Ice remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1948 release was in black and white, typical of the noir style that emphasized shadows, moral ambiguity, and psychological tension. While effective for its time, many modern audiences overlook black-and-white films. Our colorized edition bridges the gap between authenticity and accessibility, giving younger and international audiences a fresh way to experience the fatal elegance and sharp cynicism of this classic.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood, from gritty noirs and suspense thrillers to forgotten dramas and culturally significant features. Our work keeps these treasures alive, ensuring they remain engaging, discoverable, and appreciated by audiences in the USA, Europe, and worldwide.\n\n#BlondeIce #FilmNoir #LeslieBrooks #PublicDomainMovie #ColorizedClassic #1940sNoir #ClassicCinema #FemmeFatale #CrimeDrama #GoldenAgeHollywood #FilmRestoration #1948Movies",
      "id": "y7yYzEAdWBQ",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BlondeIce1948",
      "title": "Blonde Ice (1948)",
      "description": "A society reporter keeps herself in the headlines by marrying a series of wealthy men. They all die mysteriously afterwards though. Mystic Nights Videos",
      "id": "BlondeIce1948"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CbYYQxRL7xs",
      "title": "Blonde Ice (1948) FILM NOIR",
      "description": "Stars: Leslie Brooks, Robert Paige, Russ Vincent\nDirector: Jack Bernhard\n\nA blonde bombshell rises from humble beginnings to become a successful society columnist by romancing wealthy men who all die under mysterious circumstances. One of the most deadly femme fatales in the history of Film Noir!",
      "id": "CbYYQxRL7xs",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "73 min",
    "imdbRating": "6.0",
    "imdbVotes": "1,410",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "A society reporter keeps herself in the headlines by marrying a series of wealthy men, all of whom die under mysterious circumstances.",
    "Director": "Jack Bernhard",
    "Writer": "Kenneth Gamet, Whitman Chambers, Dick Irving Hyland",
    "Actors": "Robert Paige, Leslie Brooks, Russ Vincent",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0040239",
      "title": "The Cobra Strikes",
      "year": 1948,
      "imdbRating": "5.3",
      "imdbVotes": "64",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039386",
      "title": "The Flame",
      "year": 1947,
      "imdbRating": "6.5",
      "imdbVotes": "428",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040779",
      "title": "Shed No Tears",
      "year": 1948,
      "imdbRating": "6.3",
      "imdbVotes": "473",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0039220",
      "title": "Brighton Rock",
      "year": 1948,
      "imdbRating": "7.3",
      "imdbVotes": "7,156",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040237",
      "title": "Close-Up",
      "year": 1948,
      "imdbRating": "5.7",
      "imdbVotes": "199",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040257",
      "title": "Cry of the City",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "3,838",
      "language": "English, Italian, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040366",
      "title": "Force of Evil",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "8,043",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040444",
      "title": "Hollow Triumph",
      "year": 1948,
      "imdbRating": "6.7",
      "imdbVotes": "3,284",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040512",
      "title": "Kiss the Blood Off My Hands",
      "year": 1948,
      "imdbRating": "6.8",
      "imdbVotes": "2,308",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040647",
      "title": "No Orchids for Miss Blandish",
      "year": 1948,
      "imdbRating": "6.0",
      "imdbVotes": "782",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040160",
      "title": "The Big Clock",
      "year": 1948,
      "imdbRating": "7.6",
      "imdbVotes": "10,549",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040947",
      "title": "Walk a Crooked Mile",
      "year": 1948,
      "imdbRating": "6.3",
      "imdbVotes": "1,188",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:02:12.652Z"
}