{
  "imdbId": "tt0006032",
  "title": "Shanghaied",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/movie-ccs",
      "title": "Movie Ccs",
      "id": "movie-ccs"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shanghaied-1915",
      "title": "Shanghaied (1915)",
      "description": "Shanghaied is a 1915 American comedy silent film made by Essanay Studios starring Charlie Chaplin. Watch on RetroFlix.org:  https://retroflix.org/shanghaied-1915/",
      "id": "shanghaied-1915"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shanghaied-1915-directed-by-charlie-chaplin-colorzied",
      "title": "Shanghaied (1915) Directed By Charlie Chaplin",
      "description": "Shanghaied Swedish theatrical poster Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Edna Purviance Wesley Ruggles Bud Jamison Billy Armstrong Paddy McGuire Leo White John Rand Fred Goodwins Lee Hill Cinematography Harry Ensign Distributed by Essanay Studios Release date October 4, 1915 Running time 30 minutes Country United States Languages Silent film English (Original titles) Shanghaied is a 1915 American comedy silent film made by Essanay Studios starring Charlie Chaplin . Synopsis The owner of the S.S. Vaquero intends to scuttle his ship on its last voyage to get much-needed insurance money. He collaborates with the ship's captain to do the job with kegs of dynamite. Meanwhile, the captain's daughter is in love with Charlie, a tramp. Her father sees his daughter and Charlie romantically embracing and immediately disapproves. He violently separates them. Charlie leaves heartbroken. He passes by the pier where the Vaquero is docked. An assistant to the captain offers Charlie $3 to help him shanghai three sailors for a new crew. Charlie agrees and successfully subdues three men with a mallet. They are each flung onto the deck of the ship unconscious. After Charlie is paid his $3 fee by the captain, he too is struck over the head with a mallet and tossed on board the Vaquero . Upset by her father ruining her romance, his daughter leaves him a brief note saying she is stowing away on the Vaquero to escape from him. The father panics. Realizing his daughter will be aboard the ship when it is dynamited, he commandeers a small motor boat to attempt to get to her before his ship is scuttled. Meanwhile, Charlie creates all sorts of comical havoc on the ship's deck and while assisting in the kitchen. While trying to deal with sea sickness during a strong gale, Charlie finds the owner's daughter below deck. Soon afterward the collaborators set the fuse for the dynamite and make their escape by rowboat. Charlie sees the dynamite and tosses it overboard where it explodes in the collaborators' boat. Charlie and the captain's daughter are rescued by her father who is strangely ungrateful to Charlie for his role in saving her. Charlie feigns a suicidal leap into the ocean. However, he emerges on the other side of the owner's boat and kicks the owner into the water. Reviews Julian Johnson of Photoplay wrote: \" Shanghaied , Mr. Chaplin's latest ray of sunshine, is just what its name implies...And as usual, Mr. Chaplin is funny with a funniness which transcends his dirt and his vulgarity.\" [ citation needed ] Sime Silverman of Variety penned this review of Shanghaied : \"The picture is actually funny in the sense it would cause anyone to laugh without offending. That's odd for a Chaplin [movie], and through it Shanghaied is doubly amusing. The picture appears to be following a scenario...Without much, if anything, to its discredit, Shanghaied with Chaplin is really entertaining.\" [ citation needed ] Cast Charlie Chaplin - Tramp Edna Purviance - Ship owner's daughter Wesley Ruggles - Ship owner unknown - Captain Lawrence A. Bowes - First mate Bud Jamison - Second mate, The Other Man (running winch) Billy Armstrong - First shanghaied Seaman Paddy McGuire - Second shanghaied seaman Leo White - Third shanghaied seaman John Rand - Ship's cook Fred Goodwins - Cabin boy in coveralls Lee Hill - Sailor in rain hat From Wikipedia, the free encyclopedia",
      "id": "shanghaied-1915-directed-by-charlie-chaplin-colorzied"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-shanghaied",
      "title": "Shanghaied",
      "id": "silent-shanghaied"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "27 min",
    "imdbRating": "6.1",
    "imdbVotes": "1,732",
    "Genre": "Short, Comedy",
    "Plot": "A shipowner intends to scuttle his ship on its last voyage to get the insurance money. Charlie, a tramp in love with the owner's daughter, is grabbed by the captain and promises to help him shanghai some seamen. The daughter stows away to follow Charlie. Charlie assists in the galley and attempts to serve food during a gale.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Billy Armstrong, Lawrence A. Bowes",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0004936",
      "title": "The Bank",
      "year": 1915,
      "imdbRating": "6.6",
      "imdbVotes": "2,325",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006309",
      "title": "A Woman",
      "year": 1915,
      "imdbRating": "6.4",
      "imdbVotes": "1,990",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005044",
      "title": "By the Sea",
      "year": 1915,
      "imdbRating": "5.7",
      "imdbVotes": "1,967",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005489",
      "title": "His New Job",
      "year": 1915,
      "imdbRating": "6.0",
      "imdbVotes": "2,089",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005542",
      "title": "In the Park",
      "year": 1915,
      "imdbRating": "5.6",
      "imdbVotes": "1,782",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006313",
      "title": "Work",
      "year": 1915,
      "imdbRating": "6.2",
      "imdbVotes": "1,891",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006177",
      "title": "The Tramp",
      "year": 1915,
      "imdbRating": "6.9",
      "imdbVotes": "3,953",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005812",
      "title": "A Night in the Show",
      "year": 1915,
      "imdbRating": "6.4",
      "imdbVotes": "2,446",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005571",
      "title": "A Jitney Elopement",
      "year": 1915,
      "imdbRating": "5.9",
      "imdbVotes": "1,464",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005810",
      "title": "A Night Out",
      "year": 1915,
      "imdbRating": "5.9",
      "imdbVotes": "1,915",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005074",
      "title": "The Champion",
      "year": 1915,
      "imdbRating": "6.7",
      "imdbVotes": "2,846",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:29:40.875Z"
}