{
  "movieId": "tt0015559",
  "title": "Alice Wins the Derby",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/alice-wins-the-derby-1925",
      "id": "alice-wins-the-derby-1925",
      "title": "Alice Wins the Derby (1925)",
      "description": "Alice, Julius, and one other character are in a combined auto/horse race. Julius gets off to a bad start when his car takes off, without him, in the wrong direction; it takes him a while to get it straightened out. Alice and the bad guy battle a bit for the lead, which Alice takes; they pass a detour, which the bad guy changes the sign for. Julius, taking the bad road, eventually drives up a cliff and, after a mighty struggle at the top, makes it, in third place, to the changeover. Alice and the bad guy ride off on horses; Julius has a wind-up wooden horse. Julius' horse keeps breaking down, eventually losing the back legs (Julius uses an empty thought balloon to hold up the rear). Alice's horse jumps a fence, and won't continue. The bad guy looks like he'll win, but Alice makes a mighty leap and knocks him off to win the race. Watch on RetroFlix:  https://retroflix.org/alice-wins-the-derby-1925/",
      "fileSize": 106722017,
      "addedAt": "2026-01-07T00:07:24.998Z",
      "thumbnail": "https://archive.org/services/img/alice-wins-the-derby-1925",
      "language": "eng",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 79
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.2,
    "imdbVotes": 103,
    "Genre": "Comedy, Family, Animation",
    "Plot": "Alice, Julius, and one other character are in a combined auto/horse race. Julius gets off to a bad start when his car takes off, without him, in the wrong direction; it takes him a while to get it straightened out. Alice and the bad guy battle a bit for the lead, which Alice takes; they pass a detour, which the bad guy changes the sign for. Julius, taking the bad road, eventually drives up a cliff and, after a mighty struggle at the top, makes it, in third place, to the changeover. Alice and the bad guy ride off on horses; Julius has a wind-up wooden horse. Julius' horse keeps breaking down, eventually losing the back legs (Julius uses an empty thought balloon to hold up the rear). Alice's horse jumps a fence, and won't continue. The bad guy looks like he'll win, but Alice makes a mighty leap and knocks him off to win the race.",
    "Director": "Walt Disney",
    "Writer": "N/A",
    "Actors": "Margie Gay",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0016589",
    "tt0015563",
    "tt0015552",
    "tt0015555",
    "tt0015556",
    "tt0016583",
    "tt0015561",
    "tt0015564",
    "tt0015558",
    "tt0013323",
    "tt0016582",
    "tt0016585"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.998Z"
}