{
  "movieId": "tt0005871",
  "title": "Passing of the Oklahoma Outlaws",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-passing-of-the-oklahoma-outlaws",
      "id": "silent-passing-of-the-oklahoma-outlaws",
      "title": "Passing of the Oklahoma Outlaws",
      "fileSize": 398298592,
      "addedAt": "2026-01-07T00:11:15.971Z",
      "thumbnail": "https://archive.org/services/img/silent-passing-of-the-oklahoma-outlaws",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 455
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 6.8,
    "imdbVotes": 26,
    "Genre": "Western",
    "Plot": "The background for this film is amazingly strange. In the early 20th century, ex-outlaws were made heroes in books, article and films. One film in particular irritated Marshal Bill Tillman--one that made Al and Frank Jennings look like heroes. Now considering that Tillman himself had arrested the Jennings brothers after a shootout, he wanted to set the record straight. So, along with two other Oklahoman lawman, they formed the Eagle Film Company just to produce \"Oklahoma Outlaws\" and to portray the villains accurately. They were NOT motivated by a desire to right wrongs or steal from the rich to give to the poor--these villains were just bad and needed to be stopped! Crazy as it sounds, however, the Tillman narrative never stuck and films continued glamorizing the myths of the 'good outlaw'--all through the sound era. So, although Tillman is REALLY appreciated by historians who want to get the stories right, the public evidently DON'T want to know the truth, as it's apparently pretty dull! Sadly, the version I saw was NOT the original six-reel version but just a six minute fragment showing just a few of the many vignettes that used to be in the film. That's because like so many old nitrate prints, it's simply disintegrated--and what we have in this version is one of the more complete pieces. Hopefully one day they'll find another print and will be able to show it in its entirety. Until then, this well made and rather realistic piece is all we have. Worth seeing but just a tease of what we once had. And, impossible to rate in its current condition.",
    "Director": "William Tilghman",
    "Writer": "N/A",
    "Actors": "Arkansas Tom, Bud Ledbetter, Chris Madsen",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0192120",
    "tt0162496",
    "tt0005992",
    "tt0003943",
    "tt0004209",
    "tt0004766",
    "tt0006780",
    "tt0006801",
    "tt0006913",
    "tt0004555",
    "tt0006399",
    "tt0006736"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.971Z"
}