{
  "movieId": "tt0034754",
  "title": "Freckles Comes Home",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FrecklesComesHome",
      "id": "FrecklesComesHome",
      "title": "Freckles Comes Home",
      "description": "College student \"Freckles\" Winslow (Johnny Downs) come home to Indiana to help a friend, Danny Doyle (Marvin Stephens), who runs his uncle's hotel and took a mortgage on it in order to invest in a 'gold-finding-machine,' with his friend Jeff (Mantan Moreland), the hotel porter. On the bus-trip home, \"Freckles\" meets a Chicago gangster, \"Muggsy Dolan\" (Walter Sande), posing as Jack Leach, on the lam from a bank-robbery, who decides a quiet Indian town would be the best place to hole up. \"Freckles\" also finds that his father (Irving Mitchell) has financial problems but, because of a long-standing feud between him and the town banker, Hiram Potter (John Ince), is too proud and stubborn to ask Potter for help. \"Freckles\" decides that a major highway built through Fairfield would solve everybody's problems. Jack Leach, boarding at the hotel and casing the local bank, tells \"Freckles\" he has a friend that is a big financier, Nate Quigley (Bradley Page), and just the man to put the deal over.",
      "fileSize": 1620745667,
      "addedAt": "2026-01-07T00:06:25.399Z",
      "thumbnail": "https://archive.org/services/img/FrecklesComesHome",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 16204
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=f1xDNhnACLU",
      "id": "f1xDNhnACLU",
      "title": "Freckles Comes Home (1942) MANTAN MORELAND",
      "description": "Stars: Johnny Downs, Gale Storm, Mantan Moreland\nDirector: Jean Yarbrough\n\nWhen Freckles (Johnny Downs) comes home from college, the sheriff accuses him of murder, a gangsters put him on the spot, and his girl friend falls in love with a confidence man.",
      "addedAt": "2025-12-26T23:56:08.067Z",
      "thumbnail": "https://i.ytimg.com/vi/f1xDNhnACLU/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCbijLfnGtj_RGZvu4ei7RMa7ABew",
      "duration": 3543,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "63 min",
    "imdbRating": 4.9,
    "imdbVotes": 203,
    "Genre": "Action, Comedy, Crime",
    "Plot": "College student \"Freckles\" Winslow come home to Indiana to help a friend, Danny Doyle, who runs his uncle's hotel and took a mortgage on it in order to invest in a 'gold-finding-machine,' with his friend Jeff, the hotel porter. On the bus-trip home, \"Freckles\" meets a Chicago gangster, \"Muggsy Dolan\", posing as Jack Leach, on the lam from a bank-robbery, who decides a quiet Indiana town would be the best place to hole up. \"Freckles\" also finds that his father has financial problems but, because of a long-standing feud between him and the town banker, Hiram Potter, is too proud and stubborn to ask Potter for help. \"Freckles\" decides that a major highway built through Fairfield would solve everybody's problems. Jack Leach, boarding at the hotel and casing the local bank, tells \"Freckles\" he has a friend that is a big financier, Nate Quigley, and just the man to put the deal over. Quigley, with Oil-Can Harry written all over him, shows up and calls for a town meeting, with the intention of stealing the townspeople's \"subscription\" money collected when they buy in on the highway project. Quickley also shows up with an uniformed chauffeur, Roxbury B. Brown the Third. Since Roxbury is played by Laurence Criner and Jeff by Mantan Moreland, and they spend a goodly portion (not enough, alas)of the film running through burlesque skits with all the perfection, skill, slapstick, insults and timing only two masters such as they could muster, their exchanges alone make this a must for those who have the ability to watch and enjoy a film in the context of the period in which it was made. The DVD comes from the 16-mm television-print and is missing a few segments involving some of the currently-shown (uncredited) players.",
    "Director": "Jean Yarbrough",
    "Writer": "Jeannette Stratton-Porter, Edmond Kelso",
    "Actors": "Johnny Downs, Gale Storm, Mantan Moreland",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035051",
    "tt0035028",
    "tt0033646",
    "tt0033510",
    "tt0033787",
    "tt0032246",
    "tt0036690",
    "tt0036953",
    "tt0034621",
    "tt0031245",
    "tt0031330",
    "tt0034221"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}