{
  "movieId": "tt0037409",
  "title": "Two-Man Submarine",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/two-man-submarine",
      "id": "two-man-submarine",
      "title": "Two Man Submarine",
      "description": "Two-Man Submarine Bruce Bennett",
      "fileSize": 1042118066,
      "addedAt": "2026-01-07T00:12:55.131Z",
      "thumbnail": "https://archive.org/services/img/two-man-submarine",
      "collection": "feature_films",
      "downloads": 443
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": 6.4,
    "imdbVotes": 24,
    "Genre": "Action, Drama, Romance",
    "Plot": "A film that is among the umpteen hundred films that some source has given Mario Castelnuovo-Tedesco a \"credited\" composers credit, although his name appears actually nowhere in connection with the vast majority of these umpteen hundred films, and one of four films that Tom Neal and Ann Savage were in together. This one has Robert B. Williams as some kind of scientist on an unnamed South Pacific island and he is making penicillin out of jungle mold at a time when penicillin was so new that all the players in the film pronounce it as \"pey-nen-sol-lon\" or something like that. Tom Neal is also there as some kind of guard or protector of Williams' work and is hacked off something fierce about it as his goal is to get off the island and into hand-to-hand action \"against the japs.\" Before long an unidentified plane flies over the island and Neal has his pistol at the ready to shoot it down in case it is an enemy plane but a figure parachutes out and in parachutes none other than Ann Savage, who is there as Neal's replacement, although Neal now isn't as ready to leave as he was before. Then a man, George Lynn, washes ashore and is accepted as a crewman from a torpedoed American ship. Later, Williams is murdered, after some of his \"pey-non-sol-len or whatever\" samples disappear, and Neal concludes that either Savage, island-doctor J.Carroll Naish or Abner Biberman is the guilty party working for the Axis to get the penicillin formula. This isn't exactly Holmes-or-Chan sleuthing on his part as he knows he isn't guilty and the only people on the island, with the exception of three natives, are those he names as suspects. He doesn't know that a two-man Japanese submarine (with five or six Germans on board plus the two Japanese crewmen)is lurking offshore, but his list of suspects is basically correct, as none of the people from the sub have come ashore yet. Well, one has but he floated in. Discounting the floater, it doesn't take a rocket scientist to figure out that between Savage, Naish and Biberman, which one who can least bear scrutiny.",
    "Director": "Lew Landers",
    "Writer": "Robert Creighton Williams, Griffin Jay, Leslie T. White",
    "Actors": "Tom Neal, Ann Savage, J. Carrol Naish",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037701",
    "tt0034572",
    "tt0035378",
    "tt0037253",
    "tt0036449",
    "tt0037622",
    "tt0040078",
    "tt0041100",
    "tt0044371",
    "tt0031177",
    "tt0037446",
    "tt0033399"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.131Z"
}