{
  "movieId": "tt0079292",
  "title": "Da wu shi yu xiao piao ke",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/da-wu-shi-yu-xiao-piao-ke-1977",
      "id": "da-wu-shi-yu-xiao-piao-ke-1977",
      "title": "Da wu shi yu xiao piao ke (1977)",
      "description": "A regional champion martial artist that moonlights as an honour-bound assassin, Tu Ta Shen, solidifies his reputation by challenging top fighters en route to the other champion, Nan Pa Tien, in order to unify both titles. Along the way he defeats a man who's shame in defeat drives him to suicide. Before he dies, recognizing Tu Ta Shen honour, he asks Tu Ta Shen to defeat a group of Manchu supporters led by none other that Nan Pa Tien. The dying mans son, Sa Woo, tries to kill Tu Ta Shen but is easily outmatched. Tu Ta Shen offer to teach Sa Yoo enough so that he can take revenge for his father. The two set out together; One to fulfill a promise to a dying man, one to keep a promise of revenge. Watch on RetroFlix:  https://retroflix.org/da-wu-shi-yu-xiao-piao-ke-1977/",
      "fileSize": 1221038801,
      "addedAt": "2026-01-07T00:07:51.627Z",
      "thumbnail": "https://archive.org/services/img/da-wu-shi-yu-xiao-piao-ke-1977",
      "language": "eng",
      "year": 1977,
      "collection": "feature_films",
      "downloads": 68
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "92 min",
    "imdbRating": 5.3,
    "imdbVotes": 150,
    "Genre": "Action, Drama",
    "Plot": "A regional champion martial artist that moonlights as an honour-bound assassin, Tu Ta Shen, solidifies his reputation by challenging top fighters en route to the other champion, Nan Pa Tien, in order to unify both titles. Along the way he defeats a man who's shame in defeat drives him to suicide. Before he dies, recognizing Tu Ta Shen honour, he asks Tu Ta Shen to defeat a group of Manchu supporters led by none other that Nan Pa Tien. The dying mans son, Sa Woo, tries to kill Tu Ta Shen but is easily outmatched. Tu Ta Shen offer to teach Sa Yoo enough so that he can take revenge for his father. The two set out together; One to fulfill a promise to a dying man, one to keep a promise of revenge.",
    "Director": "Chi Chang",
    "Writer": "Chi Chang, Hsin-Yi Chang, Kuang Ni",
    "Actors": "Sing Chen, Jeong-lee Hwang, Chun-Erh Lung",
    "Language": "Mandarin",
    "Country": "Taiwan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0165174",
    "tt0187040",
    "tt0080600",
    "tt0076300",
    "tt0076024",
    "tt0074634",
    "tt0081382",
    "tt0205750",
    "tt0315254",
    "tt0333955",
    "tt0074836",
    "tt0074845"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.627Z"
}