{
  "imdbId": "tt0023604",
  "title": "Tombstone Canyon",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TombstoneCanyon",
      "title": "Tombstone Canyon",
      "description": "Ken Maynard hears the cry of the weird masked \"phantom\" of Tombstone Canyon. The plot thickens when Maynard discovers a man with a key to his past has been murdered by the phantom.",
      "fileSize": 1629706602,
      "id": "TombstoneCanyon"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bbMTCSzi0uk",
      "title": "Tombstone Canyon (1932) | Colorized Public Domain Western with Ken Maynard and the Phantom Bandit",
      "description": "Tombstone Canyon (1932) is a Pre-Code American Western film directed by Alan James and starring Ken Maynard. This restored and colorized edition of the public domain classic revives one of the early 1930s B-Westerns that combined action, suspense, and mystery in the rugged landscapes of Arizona. Known for its blend of traditional Western storytelling and masked-villain intrigue, the film remains a valuable glimpse into the cinematic traditions of the early sound era. With this colorized restoration, audiences in the USA, Europe, and beyond can rediscover a film that blends the open-range adventure of the Western with the pulp mystery sensibilities of its time.\n\nPlot Summary:\nThe story follows Ken (Ken Maynard), a wandering cowboy who finds himself entangled in the violent conflicts of Tombstone Canyon. The peaceful desert settlement is plagued by raids from a mysterious masked figure known only as the Phantom Bandit. This outlaw spreads fear across the canyon, striking without warning and vanishing before justice can be served.\n\nAs Ken investigates, he discovers that the bandit’s vendetta is deeply personal and tied to hidden family secrets. Along the way, Ken forms a bond with Jenny Morgan (Cecilia Parker), a courageous ranch owner whose land and livelihood are threatened by the ongoing attacks. Guided by his sense of justice, Ken must confront both hired gunmen and the masked Phantom to bring peace to Tombstone Canyon.\n\nThe film builds to a dramatic revelation where the true identity of the Phantom Bandit is uncovered, exposing a tragic past of betrayal and vengeance. Combining fistfights, horse chases, and tense standoffs, the film showcases both the action and melodrama that characterized early B-Westerns.\n\nCast and Crew:\n• Director: Alan James\n• Cinematography: Ted D. McCord\n• Editing: Charles J. Hunt\nStarring:\n• Ken Maynard as Ken\n• Cecilia Parker as Jenny Morgan\n• Sheldon Lewis as The Phantom Bandit\n• Jack Rockwell as Sheriff\n• Frank Brownlee as Morgan\n• Henry Hall as Old Man\n• Edward Coxen as Deputy\n\nFilm Significance:\nTombstone Canyon is emblematic of the low-budget but highly popular Westerns of the early 1930s. These films catered to Depression-era audiences seeking escapism through tales of frontier justice, moral clarity, and thrilling gunfights. Ken Maynard, one of the era’s most recognized cowboy stars, brought a charismatic screen presence and horsemanship that made him a favorite with Western fans. The inclusion of a masked villain shows the influence of pulp serials on the genre, foreshadowing later Western-mystery hybrids.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Tombstone Canyon remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1932 release of Tombstone Canyon was produced in black and white during the Pre-Code Hollywood era. While authentic, black-and-white films are often overlooked by modern audiences. By offering a high-quality colorized edition, we bridge the gap between historical preservation and contemporary viewing expectations. The colorization highlights the rugged Western landscapes, costumes, and action sequences, allowing viewers to experience the film with renewed vibrancy.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, ranging from B-Westerns to landmark dramas and mysteries. Our mission is to keep these cinematic treasures alive, engaging, and discoverable for audiences in the USA, Europe, and worldwide.\n\n#TombstoneCanyon #KenMaynard #1930sWestern #PublicDomainMovie #ColorizedClassic #ClassicWestern #GoldenAgeHollywood #FilmRestoration #PhantomBandit #1932Movies",
      "id": "bbMTCSzi0uk",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tombstone-canyon-1932",
      "title": "Tombstone Canyon (1932)",
      "description": "A range lawman (Ken Maynard) unmasks a black-cloaked phantom killer (Sheldon Lewis). Watch on RetroFlix:  https://retroflix.org/tombstone-canyon-1932/",
      "fileSize": 369008576,
      "id": "tombstone-canyon-1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tombstone_canyon",
      "title": "Tombstone Canyon",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4235120981,
      "id": "tombstone_canyon"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x-J1guu-p4E",
      "title": "Tombstone Canyon (1932) KEN MAYNARD",
      "description": "Stars: Ken Maynard, Cecilia Parker, Sheldon Lewis\nDirector: Alan James\n\nMaynard hears the cry of the weird masked \"phantom\" of Tombstone Canyon. The plot thickens when Maynard discovers a man with a key to his past has been murdered by the phantom.",
      "id": "x-J1guu-p4E",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "62 min",
    "imdbRating": 5.4,
    "imdbVotes": 214,
    "Genre": "Western",
    "Plot": "Traveling thru Tombstone Canyon, Ken is aided by the mysterious Phantom when a gang attacks him. He later finds the man that was going to tell him of his true identity murdered. Alf Sykes was the murderer and when the Phantom kills one of his men he blaims Ken. Planning to hang Ken, Sykes lets him out of his cell and then shoots the Sheriff. But Ken escapes and with everyone after him heads for Tombstone Canyon where both his identity and the Phantom's will be revealed.",
    "Director": "Alan James",
    "Writer": "Claude Rister",
    "Actors": "Ken Maynard, Bob Burns, Cecilia Parker",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0025269",
      "title": "Honor of the Range",
      "year": 1934,
      "imdbRating": 6.4,
      "imdbVotes": 96,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024267",
      "title": "The Lone Avenger",
      "year": 1933,
      "imdbRating": 6.5,
      "imdbVotes": 70,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024444",
      "title": "Phantom Thunderbolt",
      "year": 1933,
      "imdbRating": 5.6,
      "imdbVotes": 143,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036101",
      "title": "The Law Rides Again",
      "year": 1943,
      "imdbRating": 5.6,
      "imdbVotes": 139,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027165",
      "title": "Valley of Wanted Men",
      "year": 1935,
      "imdbRating": 5.7,
      "imdbVotes": 50,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027917",
      "title": "Lucky Terror",
      "year": 1936,
      "imdbRating": 6.1,
      "imdbVotes": 82,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0134216",
      "title": "Wild Horse Round-Up",
      "year": 1936,
      "imdbRating": 6.4,
      "imdbVotes": 17,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0172155",
      "title": "Back Fire",
      "year": 1922,
      "imdbRating": 6.6,
      "imdbVotes": 20,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023257",
      "title": "Mystery Ranch",
      "year": 1932,
      "imdbRating": 7.3,
      "imdbVotes": 87,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022988",
      "title": "Hell-Fire Austin",
      "year": 1932,
      "imdbRating": 6.3,
      "imdbVotes": 101,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030959",
      "title": "West of Rainbow's End",
      "year": 1938,
      "imdbRating": 5.8,
      "imdbVotes": 44,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0023692",
      "title": "Whistlin' Dan",
      "year": 1932,
      "imdbRating": 6.2,
      "imdbVotes": 74,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}