{
  "imdbId": "tt0000439",
  "title": "The Great Train Robbery",
  "year": 1903,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGreatTrainRobbery_555",
      "title": "TheGreatTrainRobbery 555",
      "description": "Filmed in November 1903 at Edison's New York studio, at Essex County Park in New Jersey, and along the Lackawanna railroad and released in December 1903, \"The Great Train Robbery\" is considered to be one of the first significant early US narrative films. Greatly influenced by the British film \"Daring Daylight Robbery\" (1903) it introduced many new cinematic techniques (cross cutting, double exposure, camera movement and location shooting) to American audiences. It was directed by Edwin S Porter and stars Justus D. Barnes as the head bandit, G. M. Anderson as a slain passenger and a robber, Walter Cameron as the sheriff. From the Edison Film Catalogue 1904: This sensational and highly tragic subject will certainly make a decided `hit' whenever shown. In every respect we consider it absolutely the superior of any moving picture ever made. It has been posed and acted in faithful duplication of the genuine `Hold Ups' made famous by various outlaw bands in the far West, and only recently the East has been shocked by several crimes of the frontier order, which fact will increase the popular interest in this great Headline Attraction. Scene 1 - Interior of railroad telegraph office. Two masked robbers enter and compel the operator to set the `signal block' to stop the approaching train, also making him write an order to the engineer to take water at this station.... Scene 2 - At the railroad water tank. The bandit band are seen hiding behind the tank as a train stops to take water (according to false order). Just before she pulls out they stealthily board the train between the express car and the tender. Scene 3 - Interior of express car.... the two robbers have succeeded in effecting an entrance. They enter cautiously. The messenger opens fire on them. A desperate pistol duel takes place, in which the messenger is killed. One of the robbers stands watch while the other tries to open the treasure box. Finding it locked, he searches the messenger for the key. Not finding it, he blows the safe up with dynamite.... Scene 4 - The fight on the tender. This thrilling scene was taken from the mail car showing the tender and interior of locomotive cab, while the train is running forty miles an hour.... Scene 5 - The train uncoupled.... Scene 6 - Exterior of passenger coaches. The bandits compel the passengers to leave coaches with hands aloft, and line up along the tracks. One of the robbers covers them with large pistols in either hand, while the others ransack travelers' pockets. A passenger makes an attempt to escape, but is instantly shot down.... Scene 7 - The escape. The desperadoes board the locomotive with their booty, command the engineer to start his machine, and disappear in the distance. Scene 8 - Off to the mountains. The robbers bring the engine to a stop several miles from the scene of the `Hold Up,' and take to the mountains. Scene 9 - A beautiful scene in a valley. The bandits come down the side of a hill on a run and cross a narrow stream. Mounting their horses, which were tied to nearby trees, they vanish into the wilderness. Scene 10 - Interior of telegraph office. The operator lies bound and gagged on the floor. After a desperate struggle, he succeeds in standing up. Leaning on the table, he telegraphs for assistance by manipulating the key with his chin, and then faints from exhaustion. His little daughter enters.... cuts the ropes, and, throwing a glass of water in his face, restores him to consciousness. Arising in a bewildered manner, he suddenly recalls his thrilling experience, and rushes forth to summon assistance. Scene 11 - Interior of a dance hall.... typical Western dance house scene.... Suddenly the door opens and the half dead telegraph operator staggers in. The crowd gathers around him, while he relates what has happened.... The men secure their guns and hastily leave in pursuit of the outlaws. Scene 12 - The posse in pursuit. Shows the robbers dashing down a rugged mountain at a terrible pace, followed closely by a large posse, both parties firing as they proceed. One of the desperadoes is shot.... Scene 13 - The remaining three bandits, thinking they had eluded their pursuers, have dismounted from their horses.... and begin to examine the contents of the mail bags.... The pursuers, having left their horses, steal noiselessly down upon them until they are completely surrounded. A desperate battle then takes place. After a brave stand, all of the robbers and several of the posse bite the dust. Scene 14 - Realism. Full frame of Barnes, leader of the outlaw band, taking aim and firing point blank at the audience. (This effect was gained by foreshortening in making the picture). \"The resulting excitement is great. This section of the scene can be used either to begin the subject or to end it, as the operator may choose. Remastered, tinted and new soundtrack added in 2010.",
      "id": "TheGreatTrainRobbery_555"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-great-train-robbery",
      "title": "The Great Train Robbery",
      "id": "silent-the-great-train-robbery"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-great-train-robbery-1903-directed-by-edwin-s.-porter",
      "title": "The Great Train Robbery (1903) Directed By Edwin S. Porter",
      "description": "The Great Train Robbery (1903) Directed by Edwin S. Porter Director: Edwin S. Porter The Great Train Robbery is a 1903 American silent film made by Edwin S. Porter for the Edison Manufacturing Company. It follows a gang of outlaws who hold up and rob a steam train at a station in the American West, flee across mountainous terrain, and are finally defeated by a posse of locals. The short film draws on many sources, including a robust existing tradition of Western films, recent European innovations in film technique, the play of the same name by Scott Marble, the popularity of train-themed films, and possibly real-life incidents involving outlaws such as Butch Cassidy. Porter supervised and photographed the film in New York and New Jersey in November 1903; the Edison studio began selling it to vaudeville houses and other venues in the following month. The cast included Justus D. Barnes and G. M. Anderson, who may have also helped with planning and staging. Porter's storytelling approach, though not particularly innovative or unusual for 1903, allowed him to include many popular techniques of the time, including scenes staged in wide shots, a matte effect, and an attempt to indicate simultaneous action across multiple scenes. Camera pans, location shooting, and moments of violent action helped give The Great Train Robbery a sense of rough-edged immediacy. A special close-up shot, which was unconnected to the story and could either begin or end the film depending on the projectionist's whim, showed Barnes, as the outlaw leader, emptying his gun directly into the camera. Due in part to its popular and accessible subject matter, as well as to its dynamic action and violence, The Great Train Robbery was an unprecedented commercial success. Though it did not significantly influence or advance the Western film genre, it was widely distributed and copied, including in a parody by Porter himself. During the twentieth century, inaccurate legends about The Great Train Robbery developed, claiming it was the first Western or even the first film to tell a story. Film scholars have repeatedly disproved these claims, demonstrating that The Great Train Robbery was a stylistic dead-end for its maker and genre; its commercial success and mythic place in American film lore nonetheless remain undisputed. The film, especially the close-up of Barnes, has become iconic in American culture, appearing in numerous film and television references and homages. In 1990, The Great Train Robbery was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". -From Wikipedia",
      "id": "the-great-train-robbery-1903-directed-by-edwin-s.-porter"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "11 min",
    "imdbRating": "7.3",
    "imdbVotes": "21,493",
    "Genre": "Short, Action, Adventure",
    "Plot": "Among the earliest existing films in American cinema - notable as an early film to present a narrative story to tell - it depicts a group of outlaws who hold up a train and rob the passengers. They are then pursued by a Sheriff's posse. Several scenes have color included - all hand tinted.",
    "Director": "Edwin S. Porter",
    "Writer": "Scott Marble, Edwin S. Porter",
    "Actors": "Gilbert M. 'Broncho Billy' Anderson, A.C. Abadie, George Barnes",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0234913",
      "title": "Train Wreckers",
      "year": 1905,
      "imdbRating": "5.7",
      "imdbVotes": "161",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0232932",
      "title": "What Happened in the Tunnel",
      "year": 1903,
      "imdbRating": "5.7",
      "imdbVotes": "369",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0231523",
      "title": "Electrocuting an Elephant",
      "year": 1903,
      "imdbRating": "2.7",
      "imdbVotes": "1,999",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0232181",
      "title": "New York City 'Ghetto' Fish Market",
      "year": 1903,
      "imdbRating": "5.1",
      "imdbVotes": "255",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0231639",
      "title": "The Gay Shoe Clerk",
      "year": 1903,
      "imdbRating": "5.7",
      "imdbVotes": "1,218",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0477387",
      "title": "Turning the Tables",
      "year": 1903,
      "imdbRating": "4.7",
      "imdbVotes": "158",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000471",
      "title": "Uncle Tom's Cabin",
      "year": 1903,
      "imdbRating": "5.2",
      "imdbVotes": "520",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0366268",
      "title": "Burning of Durland's Riding Academy",
      "year": 1902,
      "imdbRating": "5.1",
      "imdbVotes": "181",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0273542",
      "title": "Dog Factory",
      "year": 1904,
      "imdbRating": "5.6",
      "imdbVotes": "443",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0231549",
      "title": "European Rest Cure",
      "year": 1904,
      "imdbRating": "5.3",
      "imdbVotes": "225",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0245125",
      "title": "Fun in a Bakery Shop",
      "year": 1902,
      "imdbRating": "5.9",
      "imdbVotes": "430",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0231758",
      "title": "How a French Nobleman Got a Wife Through the 'New York Herald' Personal Columns",
      "year": 1904,
      "imdbRating": "5.3",
      "imdbVotes": "287",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:58:49.070Z"
}