{
  "imdbId": "tt0023646",
  "title": "Uptown New York",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/UptownNewYork",
      "id": "UptownNewYork",
      "title": "Uptown New York",
      "description": "Patricia Smith (Shirley Grey) is a middle-class New York City gal in love with Max Silver (Leon Waycoff), but Max is forced by his ambitious Jewish family into a marriage to a girl he doesn't love but will further his career in the medical profession, which he does, leaving Pat behind. Later in Coney Island, Pat meets Eddie (Jack Oakie), a bubble gum machine operator. Their relationship starts off on the rocky side, but eventually Pat decides to marry Eddie on the rebound even though she's still thinks of Max.",
      "fileSize": 1847029479,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/UptownNewYork",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 74719
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=f86Xv5G2I-k",
      "id": "f86Xv5G2I-k",
      "title": "Uptown New York (1932) PRE-CODE HOLLYWOOD",
      "description": "Stars: Jack Oakie, Shirley Grey, Leon Ames\n Director: Victor Schertzinger\n\n In New York City, the family of young Doctor breaks up his romance by arranging a marriage for him and sending him to Vienna.",
      "addedAt": "2025-12-26T23:49:59.254Z",
      "thumbnail": "https://i.ytimg.com/vi/f86Xv5G2I-k/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLAP-NvDNTfIqnv7yfKph5ivsLVCyg",
      "duration": 4498,
      "language": "en",
      "year": 1932,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "80 min",
    "imdbRating": 6.4,
    "imdbVotes": 158,
    "Genre": "Drama, Romance",
    "Plot": "Pat and Max are in a serious relationship, talking about their future together. After they spend a night together for the first time at his impetus, he graduates with his degree to become a doctor and his father pushes ahead for his planned arranged marriage. Though he's not happy about it, he does go through with it and doesn't argue when his father says he's going to send Max and his soon-to-be wife to Vienna for a strong start in his career. When Max tells Pat, it breaks her heart and she runs off. She follows his career through the newspaper. Later, she meets Eddie, a gangster running gumball machines, when he helps her out of a bathroom where the door is stuck. After taking her on a date, he confesses he'd like to marry her because of how pure, good, and clean she is, which fills her with guilt and doubt. Unsure whether to say yes, Pat asks for a day to decide. When Max comes back into her life hoping to rekindle what they had even though he's married, she must decide which relationship to move forward with.",
    "Director": "Victor Schertzinger",
    "Writer": "Viña Delmar, Warren Duff",
    "Actors": "Jack Oakie, Shirley Grey, Leon Ames",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023904",
    "tt0020577",
    "tt0022569",
    "tt0022879",
    "tt0023537",
    "tt0022628",
    "tt0022662",
    "tt0022689",
    "tt0022989",
    "tt0023025",
    "tt0023030",
    "tt0023128"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.887Z"
}