{
  "imdbId": "tt0031921",
  "title": "She Married a Cop",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/she-married-a-cop-1939-",
      "title": "She Married A Cop (1939)",
      "description": "Ben Hardaway, Phil Regan, Jean Parker, Jerome Cowan Republic Pictures",
      "fileSize": 884254230,
      "id": "she-married-a-cop-1939-"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": 5.3,
    "imdbVotes": 82,
    "Genre": "Comedy, Musical",
    "Plot": "At the New York branch of Mammoth Studios, motion picture animator Linda Fay and her boss, Bob Adams, search for a singing voice for their star cartoon, \"Paddy the Pig.\" Linda holds auditions in her apartment, but a neighbor, disturbed by the noise, calls the police. Officers Jimmy Duffy and Joe Nash answer the call and sell Linda tickets to the policeman's ball after cautioning her to keep the noise down. As Jimmy ushers one of the singers out, he instructs him on how to sing. Linda hears his beautiful voice and eagerly awaits the ball. Linda, Bob, their pianist Sidney and secretary, Mabel Dunne, attend the ball and agree after Jimmy sings that he has the voice they need. The others then convince Linda to hire Jimmy without telling him that he is supplying the voice of a pig, but instead, letting him think that he will be a real actor. Two weeks pass as Jimmy records Paddy's songs, and he and Linda rapidly fall in love. Bob is jealous because he also loves Linda, but he realizes that there is little he can do and therefore signs Jimmy to a contract. Thrilled with the contract, Jimmy informs his family that he is quitting the police force. His parents are dismayed by his proclamation and also by his interest in Linda, whom they are afraid is too upper class for Jimmy, but their son's enthusiasm wins them over. Jimmy and Linda marry on the day of the cartoon's sneak preview, and Linda does not get a chance to tell Jimmy the truth before he sees it. All of Jimmy's family and police friends are there, and their laughter upon hearing his voice coming from the mouth of a pig wounds Jimmy to the core. That night, Joe finds Jimmy after he has gotten drunk and takes him to Linda's apartment. The next day, Jimmy bitterly accuses Linda of marrying him so that he would not break his contract, and soon after, he returns to the force. Determined to win back Jimmy, Linda moves in with his family. Jimmy counters by volunteering to work the night shift, thereby turning their schedules upside down. Bob convinces Linda to work at the studio while Jimmy is patrolling his beat, and as a week goes by, the Duffy family becomes suspicious as Linda is brought home by Bob early each morning. Meanwhile, Jimmy's cartoon is a hit and demand for a sequel grows. One afternoon, Jimmy, Linda and the family attend the policeman's picnic, and Jimmy is pleasantly surprised by the acclaim of young Paddy fans when they discover who Jimmy is. Jimmy promises Linda that they will make a fresh start, but late that night when Bob is rushing Linda home, Jimmy stops Bob's speeding car and sees his wife. Jimmy jumps to conclusions and punches Bob, after which Linda calls off their reconciliation. The next day, Jimmy's sister Trudy attempts to play peacemaker, and she sees a cartoon baby Linda has drawn with the caption \"James Duffy, Jr. as I imagine him.\" Trudy is interviewed by reporters after she leaves Linda's apartment, and she leaks the news that Linda is pregnant. Jimmy sees the story in the newspaper and rushes to the studio, where Linda is previewing a cartoon about Paddy and his children. Jimmy is delighted that Paddy is a father, and he embraces Linda as she confirms that he is to be one too.",
    "Director": "Sidney Salkow, Cal Dalton, Ben Hardaway",
    "Writer": "Robert Bennett, Olive Cooper, Samuel Fuller",
    "Actors": "Phil Regan, Jean Parker, Jerome Cowan",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0030540",
      "title": "Outside of Paradise",
      "year": 1938,
      "imdbRating": 5.4,
      "imdbVotes": 30,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031763",
      "title": "Opernball",
      "year": 1939,
      "imdbRating": 6.7,
      "imdbVotes": 91,
      "language": "German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0166324",
      "title": "Renate im Quartett",
      "year": 1939,
      "imdbVotes": 11,
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031278",
      "title": "Escape to Paradise",
      "year": 1939,
      "imdbRating": 4.7,
      "imdbVotes": 84,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031634",
      "title": "Me and My Pal",
      "year": 1939,
      "imdbRating": 5.6,
      "imdbVotes": 25,
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031716",
      "title": "Never Say Die",
      "year": 1939,
      "imdbRating": 6.8,
      "imdbVotes": 658,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031077",
      "title": "Band Waggon",
      "year": 1940,
      "imdbRating": 5.4,
      "imdbVotes": 222,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030089",
      "title": "The Duke Is Tops",
      "year": 1938,
      "imdbRating": 5.4,
      "imdbVotes": 391,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029885",
      "title": "Artists and Models Abroad",
      "year": 1938,
      "imdbRating": 5.8,
      "imdbVotes": 139,
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032309",
      "title": "Carnaval de antaño",
      "year": 1940,
      "imdbRating": 6.2,
      "imdbVotes": 27,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030071",
      "title": "Dos amigos y un amor",
      "year": 1938,
      "imdbVotes": 7,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032410",
      "title": "Down Argentine Way",
      "year": 1940,
      "imdbRating": 6.4,
      "imdbVotes": 1346,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.366Z"
}