{
  "movieId": "tt0039779",
  "title": "Robin Hood of Monterey",
  "year": 1947,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JVf_UTG0KL0",
      "id": "JVf_UTG0KL0",
      "title": "Robin Hood of Monterey (1947) THE CISCO KID🍕 GILBERT ROLAND",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Gilbert Roland, Chris-Pin Martin, Evelyn Brent, and Jack La Rue\nDirector: Christy Cabanne\n\nThe Cisco Kid and Pancho set out to prove the innocence of a young rancher charged with murdering his father.\n\nTRIVIA: The Cisco Kid is a fictional character created by O. Henry for his short story \"The Caballero's Way,\" first published in 1907. Four actors portrayed this Western hero in 25 films during the sound era. In 1928, the first all-talking western starred Warner Baxter as the Cisco Kid, followed by Cesar Romero, Duncan Renaldo, and Gilbert Roland.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "addedAt": "2025-12-24T01:05:37.630Z",
      "thumbnail": "https://i.ytimg.com/vi/JVf_UTG0KL0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCyK2BB7BXuInt9NKC6ICRzDqtENQ",
      "duration": 3463,
      "language": "en",
      "year": 1947,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "55 min",
    "imdbRating": 6,
    "imdbVotes": 120,
    "Genre": "Drama, Family, Western",
    "Plot": "Eduardo Belmonte overhears his new step-mother, Maria, and her lover, Don Ricardo Gonzales plotting to take over the Belmonte rancho on the night of the fiesta given by her husband, Don Carlos Belmonte. Eduardo offers Maria money if she will depart the hacienda premises, but she refuses and then accuses Eduardo of making love to her. The old Don doesn't take kindly to his son hitting on his step-mother and attacks him in a rage. The lights go out, the father is killed and Maria blames Eduardo, who escapes from the house, chased by Ricardo's men. The Cisco Kid and Pancho rescue Eduardo, who has been shot, and hide him while they investigate. Cisco discovers that bullets from Maria's gun, a handy little derringer, are the same type that killed Don Carlos. But the Alcalde arrests Cisco and Pancho, and Cisco is \"supposedly\" executed by a firing squad, but IS NOT shot and escapes by a trick. And now Maria and Ricardo are in real trouble with Cisco on the loose.",
    "Director": "Christy Cabanne",
    "Writer": "Bennett Cohen, O. Henry, Gilbert Roland",
    "Actors": "Gilbert Roland, Chris-Pin Martin, Evelyn Brent",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039533",
    "tt0040402",
    "tt0039771",
    "tt0038552",
    "tt0043895",
    "tt0037893",
    "tt0038071",
    "tt0039157",
    "tt0039181",
    "tt0051936",
    "tt0039861",
    "tt0024787"
  ],
  "collections": [
    {
      "id": "cloak-and-dagger",
      "name": "Cloak and Dagger"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:35:38.344Z"
}