{
  "imdbId": "tt0034636",
  "title": "The Dark Tower",
  "year": 1943,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c4v4Zay7Kgw",
      "id": "c4v4Zay7Kgw",
      "title": "The Dark Tower (1943) [Thriller] [Crime] [Drama]",
      "description": "Stephen Torg (Lom) seeks work at a struggling traveling circus. While there, a lion escapes; Torg is able to control it with his skill at hypnotism. Phil Danton (Lyon), the head of the circus, is so impressed, he hires the newcomer. Then someone comes up with an idea. Torg hypnotizes Mary (Crawford) so that she can perform a dangerous aerial stunt without props. Her partner and boyfriend, Tom Danton (Farrar) is suspicious, but is overruled by the others.\n\nWith Torg's help, the circus becomes very successful, and Torg is able to force Phil into making him a partner. Meanwhile, Torg falls in love with Mary, though she makes it clear to him that her heart belongs to Tom. As time goes on, Torg begins to exert control over Mary. Before one performance, he tells her under hypnosis that she will be so tired that she will be unable to hold onto Tom during their trapeze act. As a result, Tom falls and is injured so badly, he has to stay in the hospital. The others suspect what is going on, but have no proof and are powerless to do anything.\n\nWhen Tom recovers enough to return to the circus, he finds that Torg has Mary performing an even more dangerous stunt. While watching it, he unthinkingly cries out her name, breaking her trance and almost causing her fall from the high wire. While Torg is being lowered to the ground, Phil cuts the rope and Torg falls to his death. However, in a twist, the doctor reveals that Torg was shot in the head in mid-air, a feat that could only have been done by the circus's sharpshooter, Dora (Josephine Wilson).\n\n---\n\nDirected by John Harlow,  produced by Max Milder, written by Reginald Purdell and Brock Williams, based on the play by George S. Kaufman and Alexander Woollcott, starring Ben Lyon, Herbert Lom, Anne Crawford and David Farrar.\n\n---\n\nSource: \"The Dark Tower (1943 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 1 July 2016. Web. 19 November 2016. https://en.wikipedia.org/wiki/The_Dark_Tower_(1943_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:01.668Z",
      "thumbnail": "https://i.ytimg.com/vi/c4v4Zay7Kgw/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDUiTtuE83Dusc_56zzHC9ZvFtSyQ",
      "duration": 5600,
      "language": "en",
      "year": 1943,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Dark_Tower_1943",
      "id": "Dark_Tower_1943",
      "title": "The Dark Tower",
      "description": "A British circus-drama. Read about it at the IMDb.",
      "fileSize": 1721014822,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/Dark_Tower_1943",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 64992
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mlHTkNMoMUo",
      "id": "mlHTkNMoMUo",
      "title": "The Dark Tower (1943) CIRCUS THRILLER",
      "description": "Stars: Ben Lyon, Anne Crawford, David Farrar\nDirector: John Harlow\n\nA struggling circus finds salvation in the form of an exciting new twist on their high-wire act.",
      "addedAt": "2025-12-26T23:47:31.783Z",
      "thumbnail": "https://i.ytimg.com/vi/mlHTkNMoMUo/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gOAAoADigIMCAAQARhfIF8oXzAP&rs=AOn4CLA21HYTJRtQYfUFAIbmz2vPQ0Jjyg",
      "duration": 5599,
      "language": "en",
      "year": 1943,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 6,
    "imdbVotes": 446,
    "Genre": "Drama, Thriller",
    "Plot": "High drama beneath the big top. Forbidden romance, rivalry, murder, betrayed friends. A retired hypnotist falls in love with a trapeze artiste whose jealous partner is the brother of the circus owner.",
    "Director": "John Harlow",
    "Writer": "Sam Harris, George S. Kaufman, Reginald Purdell",
    "Actors": "Ben Lyon, Anne Crawford, David Farrar",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037666",
    "tt0035612",
    "tt0036549",
    "tt0035966",
    "tt0036307",
    "tt0035937",
    "tt0034538",
    "tt0037330",
    "tt0035301",
    "tt0035121",
    "tt0035452",
    "tt0034857"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.368Z"
}