{
  "movieId": "tt0002212",
  "title": "The God Within",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheGodWithin",
      "id": "PreviewTheGodWithin",
      "title": "\"The God Within\" (1912) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The God Within\" is a short drama. The film is included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame.  In a mining town a newborn loses its mother and a woman loses her baby. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Henry Walthall, Charles Hill Mailes, Claire McDowell, Blanche Sweet, Lionel Barrymore Distributed by                   Biograph Company Release date                      December 26, 1912 Country                             United States Running time                    11 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 13453417,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheGodWithin",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 4366
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.6,
    "imdbVotes": 44,
    "Genre": "Short, Drama",
    "Plot": "The woman of the camp implores her lover to marry her, and he promises to do so, but goes away and does not return. Target of the camp's jeers, she lives alone until her child is born dead. The doctor fears for her reason if she discovers that all her shame and anguish have been in vain. He has another maternity case on the outskirts of the camp, where the Saint, as the trapper's wife is known, dies in giving birth to a child. For the sake of the baby and of the woman bereft, the doctor gains the trapper's consent to a plan, and brings his two patients together. The woman's quarters being squalid, the doctor insists that she go to the trapper's cabin, and the trapper moves out to make room for her. The sight of his child drawing life from an alien breast has awakened the trapper's soul. And the touch of baby hands the strangeness of human kindness, stir the God within the woman. The doctor hopes to see her marry the trapper. At this moment the woman's former lover returns, bent on making such amends as he can. He, too, has discovered the living God within him. At the doctor's suggestion the woman chooses between the two men. For a long time she hesitates, then places her hand in the trapper's palm.",
    "Director": "D.W. Griffith",
    "Writer": "F.P. Bayer",
    "Actors": "Henry B. Walthall, Claire McDowell, Blanche Sweet",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002546",
    "tt0002795",
    "tt0002082",
    "tt0002162",
    "tt0002176",
    "tt0002415",
    "tt0002550",
    "tt0002190",
    "tt0002303",
    "tt0002512",
    "tt0001987",
    "tt0001753"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}