{
  "imdbId": "tt0028346",
  "title": "Reefer Madness",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/reefer_madness1938",
      "title": "Reefer Madness",
      "description": "Considered THE archetypal sensationalized anti-drug movie, but it's really an exploitation film made to capitalize on the hot taboo subject of marijuana use. Like many exploitation films of the time, \"Reefer Madness\" tried to make a quick buck off of a forbidden subject while skirting the Motion Picture Production Code of 1930. The Code forbade the portrayal of immoral acts like drug use. ( The illegal drug traffic must not be portrayed in such a way as to stimulate curiosity concerning the use of, or traffic in, such drugs; nor shall scenes be approved which show the use of illegal drugs, or their effects, in detail. ) The film toured around the country for many years - often being re-edited and re-titled (\"Tell Your Children\", \"Dope Addict\", \"Doped Youth\", \"Love Madness\", \"The Burning Question\"). It was re-discovered in the early 1970s by NORML (National Organization for the Reform of Marijuana Laws) and screened again as an example of the government's demonization of marijuana. NORML may have been confused about the film's sponsorship since one of the film's distributors, Dwain Esper, testified to the Arizona Supreme Court that \"Reefer Madness\" was not a trashy exploitation film but was actually sponsored by the U.S. Government - a convincing lie, but a lie nonetheless. That being said, the film is still quick enjoyable since it dramatizes the \"violent narcotic's ... soul destroying\" effects on unwary teens, and their hedonistic exploits enroute to the bottom. You can find more information regarding this film on its IMDb page . Also, if you are interested in the rich, uniquely American history of exploitation films, there are two excellent books on the subject: \"Forbidden Fruit - The Golden Age of the Exploitation Film\", Felicia Feaster and Bret Wood, Midnight Marquee Press, 1999. \"Bold! Daring! Shocking! True! A History of Exploitation Films, 1919 - 1959\" Eric Schaefer, Duke University Press, 1999.",
      "fileSize": 3775015919,
      "id": "reefer_madness1938"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ReeferMadness_479",
      "title": "Reefer Madness",
      "description": "A trio of drug dealers lead innocent teenagers to become addicted to \"reefer\" cigarettes by holding wild parties with jazz music. - IMDB Description",
      "fileSize": 1803285929,
      "id": "ReeferMadness_479"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pe20JbYJXFI",
      "title": "Reefer Madness (1936) | Colorized Public Domain Propaganda Classic Anti-Marijuana Film | Anti-Drug",
      "description": "Reefer Madness (1936), originally released as Tell Your Children, is one of the most infamous exploitation films of American cinema. Directed by Louis J. Gasnier, the film was financed by a church group and intended as a morality tale warning against the dangers of marijuana. Over the decades, it has transformed from a once-serious propaganda piece into a cult classic of unintentional comedy. Presented here in a fully restored and colorized edition, this public domain oddity gains new visual depth while preserving its place in film history as both cautionary tale and cultural curiosity.\n\nPlot Summary:\nThe film opens with a stern warning to parents about the dangers of marijuana use, setting the stage for its melodramatic story. High school students Bill Harper (Kenneth Craig) and Jimmy Lane (Warren McCollum) fall under the influence of unscrupulous drug peddlers Mae Coleman (Thelma White) and Jack Perry (Carleton Young), who lure teens into smoking cannabis.\n\nOnce exposed, the film depicts marijuana as a substance that drives its users into madness, crime, and moral corruption. Bill’s life unravels after he smokes, leading to reckless behavior, an accident, and ultimately the accidental shooting of his girlfriend Mary (Dorothy Short). The story escalates into a courtroom drama filled with hysteria, wrongful blame, and tragedy. By the conclusion, the film reiterates its alarmist warning: that unchecked marijuana use threatens the youth of America.\n\nCast and Crew:\n• Director: Louis J. Gasnier\n• Producer: George A. Hirliman\n• Screenplay: Lawrence Meade, Arthur Hoerl\n• Music: Abe Meyer\n• Cinematography: Jack Greenhalgh\n• Editing: Carl Pierson\nStarring:\n• Dorothy Short as Mary Lane\n• Kenneth Craig as Bill Harper\n• Lillian Miles as Blanche\n• Dave O’Brien as Ralph Wiley\n• Thelma White as Mae Coleman\n• Carleton Young as Jack Perry\n• Warren McCollum as Jimmy Lane\n• Joseph Forte as Dr. Alfred Carroll\n\nFilm Significance:\nThough intended as a moralistic educational tool, Reefer Madness (1936) has since become a cult film celebrated for its over-the-top performances, exaggerated warnings, and unintentionally humorous depiction of marijuana use. It exemplifies 1930s exploitation cinema, a genre that often used social concerns to mask sensationalist storytelling. Rediscovered in the 1970s by pro-cannabis activists, the film gained a second life as a midnight movie favorite. Today, it serves as both a camp curiosity and a historical snapshot of America’s early anti-drug propaganda.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Reefer Madness remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1936 release was in black and white and distributed under various titles, including Tell Your Children, The Burning Question, and Dope Addict. While authentic to its time, modern audiences often dismiss black-and-white propaganda films as unwatchable. This colorized edition adds vibrancy and novelty, making the exaggerated drama and moral panic even more entertaining. It allows viewers to appreciate the film both as historical artifact and campy cult classic, bridging the gap between serious study and tongue-in-cheek enjoyment.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from lost B-movies to culturally significant propaganda features. Our goal is to ensure these works remain discoverable, engaging, and preserved for audiences in the USA, Europe, and worldwide.\n\n#ReeferMadness #1930sCinema #PublicDomainMovie #ColorizedClassic #FilmRestoration #PropagandaFilm #CultClassic #PreWarHollywood #ExploitationCinema #MarijuanaHistory",
      "id": "pe20JbYJXFI",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/reefer-madness-4-k",
      "title": "Reefer Madness (1936) [Colorized, 4K, 60FPS]",
      "description": "Reefer Madness is a 1936 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 5510624805,
      "id": "reefer-madness-4-k"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/reefer_madness1938_201508",
      "title": "Reefer Madness",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 3499697515,
      "id": "reefer_madness1938_201508"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/reefer_madness_ipod",
      "title": "Reefer Madness",
      "description": "Overly dramatized cautionary tale of marijuana usage.",
      "fileSize": 1072500202,
      "id": "reefer_madness_ipod"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5NEnoqr0vvo",
      "title": "Reefer Madness (1936) EXPLOITATION",
      "description": "Stars: Dorothy Short, Kenneth Craig, Lillian Miles\nDirector: Louis J. Gasnier\n\nCautionary tale features a fictionalized and highly exaggerated take on the use of marijuana. A trio of drug dealers lead innocent teenagers to become addicted to \"reefer\" cigarettes by holding wild parties with jazz music.",
      "id": "5NEnoqr0vvo",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8kg0sK-dY98",
      "title": "Reefer Madness (1936) Cult Classic | Full Movie | Subtitled",
      "description": "Cautionary tale features a fictionalized take on the use of marijuana. A trio of drug dealers lead innocent teenagers to become addicted to \"\"reefer\"\" cigarettes by holding wild parties with jazz music.\n\nOriginal title: Tell Your Children\nDirector: Louis J. Gasnier\nWriters: Lawrence Meade, Arthur Hoerl, Paul Franklin\nStars: Dorothy Short, Kenneth Craig, Lillian Miles\nGenres: Comedy, Crime, Drama, Propaganda \n\nCCC Chapters:\n00:00:00 Full length movie title credits\n00:01:03 Frightful Foreword\n00:02:45 Hysteria in the headlines\n00:03:14 PTA meeting\n00:07:23 May's flop house\n00:12:11 Joe's jazz parties\n\n@CultCinemaClassics",
      "id": "8kg0sK-dY98",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "66 min",
    "imdbRating": 3.7,
    "imdbVotes": 9511,
    "Genre": "Comedy, Crime, Drama",
    "Plot": "Film that relates the story, as told by high school principal Dr. Carroll to parents at a PTA meeting, of the scourge of marijuana. The tale revolves around Mae and Jack, accomplices in the distribution of marijuana, who manage to entice the local high school kids to stop by Mae's apartment to smoke reefer. The lives of all who are involved with this menace are inevitably shattered. One man becomes so addicted to the killer weed that the guilt over framing a teen for murder causes a judge to order him to be committed for life to a mental hospital. Dr. Carroll closes by advising us to not incur the same tragedy.",
    "Director": "Louis J. Gasnier",
    "Writer": "Lawrence Meade, Arthur Hoerl, Paul Franklin",
    "Actors": "Dorothy Short, Kenneth Craig, Lillian Miles",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0028607",
      "title": "Bank Alarm",
      "year": 1937,
      "imdbRating": 5.3,
      "imdbVotes": 296,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029199",
      "title": "A Man Betrayed",
      "year": 1936,
      "imdbRating": 5.6,
      "imdbVotes": 119,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027501",
      "title": "The Dark Hour",
      "year": 1936,
      "imdbRating": 5.4,
      "imdbVotes": 337,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0182242",
      "title": "I'll Name the Murderer",
      "year": 1936,
      "imdbRating": 5.2,
      "imdbVotes": 205,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028405",
      "title": "Trapped by Television",
      "year": 1936,
      "imdbRating": 5.8,
      "imdbVotes": 366,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0028083",
      "title": "Panic on the Air",
      "year": 1936,
      "imdbRating": 5.4,
      "imdbVotes": 121,
      "language": "Cantonese, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027863",
      "title": "Lady Luck",
      "year": 1936,
      "imdbRating": 5.4,
      "imdbVotes": 54,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0029670",
      "title": "Thunder in the City",
      "year": 1937,
      "imdbRating": 6.1,
      "imdbVotes": 436,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028774",
      "title": "The Great Hospital Mystery",
      "year": 1937,
      "imdbRating": 6.1,
      "imdbVotes": 74,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028748",
      "title": "The Crime Nobody Saw",
      "year": 1937,
      "imdbRating": 6.1,
      "imdbVotes": 85,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027214",
      "title": "The Whole Town's Talking",
      "year": 1935,
      "imdbRating": 7.3,
      "imdbVotes": 3405,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024985",
      "title": "City Park",
      "year": 1934,
      "imdbRating": 5.4,
      "imdbVotes": 46,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:10:30.753Z"
}