{
  "movieId": "tt0031715",
  "title": "Navy Secrets",
  "year": 1939,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a0JWS-FCuFA",
      "id": "a0JWS-FCuFA",
      "title": "Navy Secrets (1939) FAY WRAY",
      "description": "Stars: Fay Wray, Grant Withers, Dewey Robinson\nDirector: Howard Bretherton\n\nIn this lost Fay Wray classic, romance grows between two undercover agents, neither of whom know the truth about each others' identity.",
      "addedAt": "2025-12-26T23:44:06.558Z",
      "thumbnail": "https://i.ytimg.com/vi/a0JWS-FCuFA/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBjAWAAuADigIMCAAQARhbIFsoWzAP&rs=AOn4CLDaQjBVl003CWeC7vS_PuvN_VPmYg",
      "duration": 3563,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cnnX3k-bkxU",
      "id": "cnnX3k-bkxU",
      "title": "Navy Secrets (1939) Fay Wray | Crime, Spy Thriller | Full Length Movie",
      "description": "A Nervy Girl Succeeds in a Game of Death Where Men Failed!  A Navy officer is assigned to break up a spy ring within the service itself.\n \nDirector: Howard Bretherton\nWriters: Harvey Gates, Steve Fisher \nStars: Fay Wray, Grant Withers, Craig Reynolds \nGenres: Classics, Adventure, Crime, Drama, Romance, Thriller\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:45:03.385Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/cnnX3k-bkxU/maxresdefault.webp?v=61a60e37",
      "duration": 3657,
      "language": "en",
      "year": 1939,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": 5.7,
    "imdbVotes": 112,
    "Genre": "Adventure, Thriller",
    "Plot": "Due to the work of a Naval-intelligence officer, Carol Mathews, posing as Carol Evans, Chief-Petty-Officer Jimmy Woodford is arrested and charged with selling military secrets to agents of a foreign government, via the ruse of buying-and-selling foreign postage stamps. Chief Petty Officer Steve Fletcher, posing as Steve Roberts is assigned to find the members and leader of the gang by delivering an envelope to them with the explanation that Jimmy asked him to do so as a favor as Jimmy was spending a few days in the brig for being A.W.O.L. Steve Fletcher/Roberts has no idea of where to start other than knowing the name of Jimmy's girl-friend. But Navy \"intelligence\" neglects to inform him that the \"girl-friend\" is also an agent working undercover. He contrives to meet her accidentally at a show-shine stand with an explanation that he is a buddy of Jimmy's, and have her take him on Jimmy's usual route. She agrees, and they start at Nick Salado's café, have a fine grilled-fish dinner but Nick will not accept deliverance of the envelope. But Nick suggests that they take the envelope to Joe Benji's cocktail lounge, but not before Nick has a waiter spill soup on Steve so that Steve will need to go to the restroom and clean up...where Nick has a pickpocket, posing as a singing drunk, ready to relieve Steve of the envelope. But Steve has left the envelope at the table. Steve and Carol glide over to Joe Benji's, and Joe thinks Slavins might take the envelope and Slavins passes them on to Eldredge, posing as Peter Drake for no evident reason, and it takes a while before a man with a German-accent shows up ready to pay for the envelope.",
    "Director": "Howard Bretherton",
    "Writer": "Harvey Gates, Steve Fisher",
    "Actors": "Fay Wray, Grant Withers, Craig Reynolds",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031204",
    "tt0033060",
    "tt0032790",
    "tt0034188",
    "tt0031119",
    "tt0034027",
    "tt0031680",
    "tt0031211",
    "tt0031495",
    "tt0031975",
    "tt0032076",
    "tt0034538"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:51:14.751Z"
}