{
  "imdbId": "tt0001262",
  "title": "In Life's Cycle",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewInLifesCycle",
      "id": "PreviewInLifesCycle",
      "title": "\"In Life's Cycle\" (1910) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"In Life's Cycle\" is a short drama. The film is included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame  A widower, whose only comfort are his two children, gets heartbroken when his daughter runs away from home. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             George Nichols, Stephanie Longfellow, Henry Walthall, Charles West Distributed by                   Biograph Company Release date                      September 15, 1910 Country                             United States Running time                    14 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 26989057,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewInLifesCycle",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 4861
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.2,
    "imdbVotes": 32,
    "Genre": "Short, Drama",
    "Plot": "James Mullen, living in retirement at his country villa since the death of his wife, finds consolation in the love of his two children. Clara and Vincent, aged ten and twelve years respectively. It has been their custom to visit their mother's grave and place a wreath of flowers upon it. Seven years later, the children now grown, Vincent leaves for the seminary to study for the priesthood, while Clara undertakes to console their father, promising not to forget their mother's grave. Vincent, now a seminarian, writes to his sister of how happy he is in the call of the church. Clara, while returning from the post office, whither she had gone in quest of a letter from Vincent, meets a handsome young man from the city. This stranger immediately lays siege to her heart, which feeling is more than reciprocated by Clara. She yields to the temptation to meet him clandestinely and during these meetings the stranger tries to persuade her to elope with him. At last she consents, and leaving a letter for her father, runs off to the city with the tempter. Vincent has s premonition of something wrong and hastens to his father's side where he learns the truth. He breathes a prayer for her deliverance, hut she is made to suffer for her false step. She goes through a purgatory ten years with this man who not only denies her the right to the name of wife, hut subjects her and their child to abject poverty, he drinking up what little she earns. In a drunken brawl at the saloon he falls against the rail of the bar, injuring himself fatally, but before he dies, he, in a measure, makes reparation by marrying Clara. During all this time, Vincent has attended to the mother's grave, begging her Interception before God in his sister's behalf, the whereabouts of whom he is ignorant. After the death of her profligate consort Clara takes her little one and starts off to make a last visit to her mother's grave. Here she falls prostrate, praying for help and forgiveness. In this position she is found by Vincent who arrives on his regular pilgrimage. At last his prayers have been answered for later, Vincent, Clara and her little one are folded to the old father's breast.",
    "Director": "D.W. Griffith",
    "Writer": "Charles Simone",
    "Actors": "George Nichols, Stephanie Longfellow, Henry B. Walthall",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001385",
    "tt0001050",
    "tt0001118",
    "tt0001326",
    "tt0001245",
    "tt0001315",
    "tt0001340",
    "tt0001401",
    "tt0001439",
    "tt0001371",
    "tt0001388",
    "tt0001459"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}