{
  "imdbId": "tt0017463",
  "title": "3 Bad Men",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/3-bad-men-1926_202508",
      "id": "3-bad-men-1926_202508",
      "title": "3 Bad Men (1926)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. Director John Ford's final silent western, 3 Bad Men doesn't seem to have made much of an impact upon release, critically or financially. Modern viewers however have a lot to praise about the film, especially in regards to the acting and cinematography. The picture follows three outlaws as they attempt to protect a woman from other criminals during the gold rush in South Dakota. ",
      "fileSize": 4279743588,
      "addedAt": "2026-01-07T00:06:06.565Z",
      "thumbnail": "https://archive.org/services/img/3-bad-men-1926_202508",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 62
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "122 min",
    "imdbRating": 7.5,
    "imdbVotes": 1537,
    "Genre": "Drama, Romance, Western",
    "Plot": "In 1876, an old man finds gold in the Sioux lands, provoking a gold and land rush from immigrants to Dakota. On the way to Custer, the lonely cowboy Dan O'Malley helps to fix the wheel of Mr. Carlton's wagon and flirts with his daughter Lee Carlton. Later, Lee and her father are attacked by horse thieves and Mr. Carlton is murdered; however, the outlaws \"Bull\" Stanley, Mike Costigan and \"Spade\" Allen save her from the criminals and head with her to the camp where the pioneers are waiting for President Grant proclamation to explore the lands. In the site, the corrupt Sheriff Layne Hunter rules with his henchmen with horror and injustice. The trio of outlaws decides that Lee needs to get married and select Dan to be her husband. When Bull's sister Millie Stanley is murdered by Hunter's right arm Nat Lucas, \"Bull\" organizes the men to chase Hunter. But it is 1877 and the gold and land race of wagons is ready to start.",
    "Director": "John Ford",
    "Writer": "Herman Whitaker, John Stone, Ralph Spence",
    "Actors": "George O'Brien, Olive Borden, Lou Tellegen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015016",
    "tt0018972",
    "tt0015627",
    "tt0013735",
    "tt0023955",
    "tt0025335",
    "tt0046384",
    "tt0031971",
    "tt0054292",
    "tt0011358",
    "tt0052902",
    "tt0055558"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.565Z"
}