{
  "imdbId": "tt0005660",
  "title": "Love, Loot and Crash",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/love-loot-and-crash-1915-directed-by-mack-sennett",
      "id": "love-loot-and-crash-1915-directed-by-mack-sennett",
      "title": "Love, Loot And Crash (1915) Directed By Mack Sennett",
      "description": "Love, Loot and Crash Directed by Mack Sennett Produced by Mack Sennett Starring Josef Swickard Fontaine La Rue Charley Chase The Keystone Cops Distributed by Mutual Film Corporation Release date April 24, 1915 Running time 11 minutes Country United States Languages Silent English intertitles Love, Loot and Crash is a 1915 American short comedy film . It features Harold Lloyd in an uncredited role. [ 1 ] Plot Dora and her father are at a loss in the kitchen (they have just fired their cook). Their advertisement for a new cook in a newspaper attracts two crooks (one of which is Fritz Schade). He dresses like a woman to apply for the job. At his first opportunity he plans to loot the house. Dora's suitor, Harold passes her a note through the window, saying to come when he whistles. She goes upstairs to pack a bundle of clothes. A policeman calls at the kitchen door with a posy of flowers. The cook pours the cop a glass from a large jug. Father is suspicious when he hears Harold's whistle and goes to Dora's room. Schade tricks the cop into the basement to get more drink and locks the trap-door. He pulls a heavy bit of furniture over the trap-door and picks up his bundle of stolen silverware to leave. He escapes through the window where Harold is expecting Dora to appear. As the crook has his head covered Harold thinks it is Dora and speeds off on his motorcycle with the crook riding pillion. Father helps the policeman escape but meanwhile Schade's accomplice has arrived outside the window in a car. He whistles and Dora comes out of the window. and gets in the back seat. Father grabs the back of the car as it speeds off. The motorcycle crashes through various objects. Father pulls himself into the back of the car with his daughter. The Keystone Cops commandeer a second car and give chase. After a crash Dora and her father catch up with Harold and father then rides pillion giving chase to the two crooks who are now together in the first car. The car ends at a seaside boardwalk and the driverless car spins round with the crooks on the bonnet before knocking two anglers into the sea. Harold and father fly off a ramp into the sea as Dora watches in shock. The second car arrives and the police get out. As the policeman peer into the sea the driver of the second car bumps them and everyone ends in the sea. Cast Charley Chase as Harold, Dora's Suitor Fontaine La Rue (credited as Dora Rodgers) as Dora Josef Swickard as Dora's Father, a Banker Nick Cogley William Hauber (billed as W.C. Hauber) Fritz Schade as Plump crook Joseph Sweet as Thin Crook Harold Lloyd as Italian Fruit Vendor (uncredited) The Keystone Cops References 1 \"Progressive Silent Film List: Love, Loot and Crash\" . Silent Era . Retrieved September 28, 2008 .",
      "fileSize": 126885542,
      "addedAt": "2026-01-07T00:09:38.894Z",
      "thumbnail": "https://archive.org/services/img/love-loot-and-crash-1915-directed-by-mack-sennett",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 112
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-love-loot-and-crash",
      "id": "silent-love-loot-and-crash",
      "title": "Love, Loot and Crash",
      "fileSize": 229799093,
      "addedAt": "2026-01-07T00:11:07.408Z",
      "thumbnail": "https://archive.org/services/img/silent-love-loot-and-crash",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 188
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.3,
    "imdbVotes": 150,
    "Genre": "Short, Comedy",
    "Plot": "A flustered father seeks a cook for his kitchen, his daughter seeks to elope and a pair of crooks seek to get some loot. Add the Keystone cops and stir vigorously.",
    "Director": "Frank Griffin",
    "Writer": "N/A",
    "Actors": "Charley Chase, Fontaine La Rue, Josef Swickard",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006457",
    "tt0006671",
    "tt0003949",
    "tt0004101",
    "tt0004279",
    "tt0005812",
    "tt0004936",
    "tt0005571",
    "tt0005810",
    "tt0006309",
    "tt0005044",
    "tt0005489"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.408Z"
}