{
  "movieId": "tt0049446",
  "title": "Lisbon",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lisbon-1956_202506",
      "id": "lisbon-1956_202506",
      "title": "Lisbon (1956)",
      "description": "For Capt. Robert John Evans, smuggling black-market goods is nothing out of the ordinary. But one day he's hired by Aristides Mavros for a more involved assignment -- sneaking an imprisoned American out of communist-controlled territory. The job seems challenging enough, but when he meets the prisoner's sultry wife, Sylvia, he realizes his mission comes with a startling catch: Not only must he rescue this man, he must bring him back from the dead. Watch on RetroFlix:  https://retroflix.org/lisbon-1956/",
      "fileSize": 1282982971,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/lisbon-1956_202506",
      "language": "eng",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 132
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lisbon-ray-milland-1956",
      "id": "lisbon-ray-milland-1956",
      "title": "Lisbon (1956)",
      "description": "Ray Milland, Maureen O'Hara, Claude Rains, Jay Novello Directed by R. Milland",
      "fileSize": 1531537014,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/lisbon-ray-milland-1956",
      "collection": "feature_films",
      "downloads": 2208
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 5.9,
    "imdbVotes": 737,
    "Genre": "Adventure, Crime, Drama",
    "Plot": "In 1950s Portugal, American expatriate Captain Robert John Evans does a bit of smuggling using his fast boat. He mostly smuggles consumer goods and contraband such as cigarettes and booze. Lisbon's police inspector, Joao Casimiro Fonseca, is aware of this and often times tries to catch Evans red-handed but to no avail. At the same time, American Sylvia Merrill, wife of industrialist Lloyd Merrill, arrives in Lisbon to arrange the secret release from a Communist prison from behind the Iron Curtain of her husband. She first complains to the State Department about her husband's imprisonment but U.S. officials seem unable to make any progress to obtain his release. Sylvia Merrill contacts big shot criminal, jewel thief and smuggler Aristides Mavros, a Greek living in Lisbon, to negotiate a bribe for Communist officials and have her hubby released from their prisons. Mavros is a man with many useful connections but he's also a scoundrel not to be trusted by anyone. He figures to woo the wealthy Sylvia Merrill and convince her to agree to have her husband murdered after his rescue from Communist custody. This way, Sylvia Merrill, who is very much younger than her elderly husband, can inherit all his money and reward Mavros with one million dollars for his assistance. Mavros hires the services of Captain Evans to use his boat for the Lloyd Merrill rescue mission. Mavros also tasks his henchman Serafim to kill Merill after his rescue and make it look like an accident. He also tells Serafim to kill Captain Evans on the return trip, in order to eliminate all witnesses. However, Mavros fails to take into account the perseverance of police inspector Fonseca or the love for Captain Evans of one of Mavros' young secretaries, local beauty Maria Maddalena Masanet.",
    "Director": "Ray Milland",
    "Writer": "John Tucker Battle, Martin Rackin, Lord Byron",
    "Actors": "Ray Milland, Maureen O'Hara, Claude Rains",
    "Language": "English, Portuguese, French",
    "Country": "United States, Portugal",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0050903",
    "tt0048682",
    "tt0047872",
    "tt0047917",
    "tt0050431",
    "tt0048640",
    "tt0044788",
    "tt0046692",
    "tt0047213",
    "tt0031505",
    "tt0035317",
    "tt0040797"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.891Z"
}