{
  "imdbId": "tt0036094",
  "title": "Lady of Burlesque",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LadyofBurlesque",
      "title": "LadyofBurlesque",
      "description": "Barbara Stanwyck portrays Dixie Daisy, a striptease artist at a Broadway theater in New York at the end of the 1930s. In the course of fending off the unwanted advances of brash comic Biff Brannigan (Michael O'Shea), with whom she is teamed in several numbers, and staying clear of the dressing room feuds of her fellow dancers.",
      "id": "LadyofBurlesque"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iD-_issHc4A",
      "title": "Lady of Burlesque (1943) [Comedy] [Horror]",
      "description": "Lady of Burlesque (also known as \"The G-String Murders\" and in the UK, \"Striptease Lady\") is a 1943 American mystery film, based on the novel The \"G-String Murders\" written by strip tease artist Gypsy Rose Lee (with ghost-writing assistance from mystery writer Craig Rice). The plot concerns the murder of two strippers, backstage of a New York burlesque theatre and the detection of the killer.\n\nThe film is a faithful, if sanitized due to the censorship of the time, adaptation of the original novel, although Gypsy Rose Lee, who appears as a character in her own book, is here renamed \"Dixie Daisy\" (Stanwyck). Michael O'Shea plays her romantic interest, comedian Biff Brannigan, and Iris Adrian portrays a showgirl. Pinky Lee, a burlesque comic in real life, is another notable supporting player, as is Gerald Mohr as villain Louie Grindero. The film depicted as much as the censors would allow with respect to the precise nature of \"bumps\" and \"grinds\", and the slapdash nature of burlesque shows.\n\n---\n\nDirected by William A. Wellman, produced by Hunt Stromberg, written by James Gunn and Craig Rice, starring Barbara Stanwyck, Michael O'Shea and Iris Adrian.\n\n---\n\nSource: \"Lady of Burlesque\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 1 May 2013. Web. 12 June 2013. http://en.wikipedia.org/wiki/Lady_of_Burlesque.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "iD-_issHc4A",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CV_WlJM_pFg",
      "title": "Lady of Burlesque (1943) | Colorized Public Domain Classic with Barbara Stanwyck & Michael O’Shea",
      "description": "Lady of Burlesque (1943) is an American musical mystery comedy directed by William A. Wellman and based on the novel The G-String Murders by famed burlesque star Gypsy Rose Lee. This colorized and restored edition revives a film that blends showbiz glamour, sharp wit, and a thrilling murder mystery. Originally shot in black and white, our enhanced color version makes the dazzling costumes, backstage chaos, and sultry performances more vivid and accessible to modern audiences in the USA, Europe, and worldwide.\n\nPlot Summary:\nThe story is set in the vibrant but precarious world of burlesque, centering on Dixie Daisy (Barbara Stanwyck), a smart and independent performer who captivates audiences with her talent and charm. Behind the stage lights, however, rivalries, jealousies, and secrets simmer among the dancers and comedians of the theater. When a series of shocking strangulation murders occurs—using exotic costumes as the murder weapon—suspicion and paranoia spread rapidly through the troupe. Dixie teams up with fellow performer Biff Brannigan (Michael O’Shea), a fast-talking comic with street smarts, to uncover the truth.\n\nAs Dixie navigates gossip, danger, and her budding romance with Biff, the film delivers both humor and suspense. Each performance number and backstage moment adds layers to the whodunit, culminating in a dramatic reveal that exposes the killer’s identity. With its mix of music, dance, romance, and noir-style mystery, Lady of Burlesque offers a unique glimpse into 1940s entertainment culture.\n\nCast and Crew:\n• Director: William A. Wellman\n• Based on: The G-String Murders (novel) by Gypsy Rose Lee\n• Screenplay: James Gunn\n• Cinematography: Robert De Grasse\n• Editing: James E. Newcom\nStarring:\n• Barbara Stanwyck as Dixie Daisy\n• Michael O’Shea as Biff Brannigan\n• J. Edward Bromberg as S.B. Foss\n• Iris Adrian as Gee Gee Graham\n• Gloria Dickson as Dolly Baxter\n• Charles Dingle as Inspector Harrigan\n• Victoria Faust as Princess Nirvena\n• Marion Martin as Lola\n• Stephanie Bachelor as Blossom Terraine\n\nFilm Significance:\nLady of Burlesque stands out as one of Barbara Stanwyck’s most memorable 1940s roles, showcasing her versatility as both a dramatic and comedic actress. Its mixture of backstage musical and murder mystery was unusual for its time, giving audiences both spectacle and suspense. Directed by Academy Award-winner William Wellman (Wings, The Public Enemy), the film is an example of Hollywood’s fascination with burlesque culture during the war years. Today, it remains a cult favorite for fans of classic mysteries and vintage showbiz stories.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Lady of Burlesque remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1943 release was in black and white, standard for the period. While historically authentic, modern viewers—especially those watching on large TVs in the USA and Europe—often skip over black-and-white films. Our colorized edition bridges that gap, giving new vibrancy to the costumes, stage numbers, and the tense mystery at the heart of the story.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#LadyOfBurlesque #BarbaraStanwyck #1940sMovies #ClassicMystery #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #FilmRestoration #WilliamWellman #VintageCinema",
      "id": "CV_WlJM_pFg",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=38SEsZCYP04",
      "title": "Lady of Burlesque (1943) BARBARA STANWYCK",
      "description": "Stars: Barbara Stanwyck, Michael O'Shea and Iris Adrian\nDirector: William A. Wellman\nWriters: Gypsy Rose Lee (novel)\n\nA striptease artist becomes the prime suspect when two dancers are found strangled by their own g-strings!  Based on the novel \"The G-String Murders\" by Gypsy Rose Lee.",
      "id": "38SEsZCYP04",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=I-e9dPnFL34",
      "title": "Lady of Burlesque (1943) Mystery, Musical | Barbara Stanwyck, Michael O'Shea | Full Movie",
      "description": "Bold Murder... Bare Truths... Secrets Unveiled! \nAfter one member of their group is murdered, the performers at a burlesque house must work together to find out who the killer is before they strike again.\n\nOriginal title: Lady of Burlesque (1943) AKA: The G-String Murders\n\nColorized version: https://youtu.be/wWlj5ZqBP9I\n\nDirector: William A. Wellman\nWriter: Gypsy Rose Lee, James Gunn \nStars: Barbara Stanwyck, Michael O'Shea, J. Edward Bromberg \nGenre: Comedy, Mystery, Romance, Burlesque, Musical, Performing Arts\n\nThis film is available with additional French & Spanish dubbed audio. Go to video settings ⚙️  to change your audio / subtitle language options.\n\n00:00 Full Movie\n01:18  Dixie Daisy, the Queen of Variety, performs in a crowded opera house.\n12:24  A chaotic backstage scene unfolds as the characters prepare for a performance, deal with personal conflicts, and encounter unexpected events.\n21:06  A mysterious incident occurs in a theater, leading to suspicions and accusations among the characters.\n28:12  A backstage drama unfolds as tensions rise among the theater crew and performers.\n35:33  A murder mystery unfolds in a theater as the characters navigate their relationships and secrets.\n47:00  A group of people discuss the murder of Lolita and try to piece together the events leading up to her death.\n53:14  During a conversation, the inspector accuses Dixie of the murder and reveals evidence against her.\n1:00:17  A conversation between two individuals about a murder weapon and their relationship.\n1:09:18  A murder mystery unfolds during a theater performance, and suspects are questioned by the inspector.\n1:17:58  The theater employees decide to stay and defend their property.\n1:25:36  A burlesque theater is haunted by a ghost who tries to kill the performers, but two actors solve the mystery.\n\n\n@CultCinemaClassics",
      "id": "I-e9dPnFL34",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "91 min",
    "imdbRating": "6.3",
    "imdbVotes": "2,908",
    "Genre": "Comedy, Horror, Music",
    "Plot": "Sassy Dixie Daisy is the hot new attraction at a former opera house that's been turned into a burlesque theater. She's popular with the customers, although not with Lolita La Verne, a stuck-up diva who was hoping she'd get the top spot. Also complicating matters is the return of the Princess Nirvena, the show's former star who once had a fling with the boss. When the Princess blackmails her way into the top spot, Dixie is none too pleased. When both Lolita and the Princess are murdered, Dixie becomes a prime suspect. She then sets up a trap to nail the real killer.",
    "Director": "William A. Wellman",
    "Writer": "Gypsy Rose Lee, James Gunn",
    "Actors": "Barbara Stanwyck, Michael O'Shea, Iris Adrian",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0021133",
      "title": "Maybe It's Love",
      "year": 1930,
      "imdbRating": "5.0",
      "imdbVotes": "356",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037336",
      "title": "Swing Hostess",
      "year": 1944,
      "imdbRating": "5.9",
      "imdbVotes": "198",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036941",
      "title": "I'm from Arkansas",
      "year": 1944,
      "imdbRating": "5.3",
      "imdbVotes": "210",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035272",
      "title": "Roxie Hart",
      "year": 1942,
      "imdbRating": "6.9",
      "imdbVotes": "1,973",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035939",
      "title": "Ghosts on the Loose",
      "year": 1943,
      "imdbRating": "5.0",
      "imdbVotes": "1,583",
      "language": "English, Yiddish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036391",
      "title": "Stormy Weather",
      "year": 1943,
      "imdbRating": "7.3",
      "imdbVotes": "2,945",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt15374070",
      "title": "Studio 666",
      "year": 2022,
      "imdbRating": "5.6",
      "imdbVotes": "16,671",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036382",
      "title": "Spotlight Scandals",
      "year": 1943,
      "imdbRating": "5.6",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0037151",
      "title": "One Body Too Many",
      "year": 1944,
      "imdbRating": "5.4",
      "imdbVotes": "1,582",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037399",
      "title": "Trocadero",
      "year": 1944,
      "imdbRating": "5.6",
      "imdbVotes": "138",
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036762",
      "title": "Dixie Jamboree",
      "year": 1944,
      "imdbRating": "4.6",
      "imdbVotes": "110",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036861",
      "title": "Ghost Catchers",
      "year": 1944,
      "imdbRating": "5.5",
      "imdbVotes": "199",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:39:43.807Z"
}