{
  "movieId": "tt0016004",
  "title": "Lady Windermere's Fan",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LadyWindermeresFan",
      "id": "LadyWindermeresFan",
      "title": "Lady Windermere's Fan",
      "description": "Mrs Erlynne (Irene Rich), the mother of Lady Windermere (May McAvoy) - her daughter does not know about her - wants to be introduced in society, so that she can marry Lord Augustus Lorton (Edward Martindel). Lord Windermere (Bert Lytell), who helped her with a cheque, invites her to his wifes birthday-party, but Lady Windermere thinks, she has reason to be jealous, so she decides to leave her husband and go to Lord Darlington (Ronald Colman), who is pining for her. Mrs Erlynne finds this out and tries to prevent her of this mistake, but her daughter leaves her fan in Lord Darlingtons residence.",
      "fileSize": 1402398225,
      "addedAt": "2026-01-07T00:06:30.622Z",
      "thumbnail": "https://archive.org/services/img/LadyWindermeresFan",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 68711
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "120 min",
    "imdbRating": 7.2,
    "imdbVotes": 1468,
    "Genre": "Comedy",
    "Plot": "Mrs Erlynne, the mother of Lady Windermere - her daughter does not know about her - wants to be introduced in society, so that she can marry Lord Augustus Lorton. Lord Windermere, who helped her with a cheque, invites her to his wifes birthday-party, but Lady Windermere thinks, she has reason to be jealous, so she decides to leave her husband and go to Lord Darlington, who is pining for her. Mrs Erlynne finds this out and tries to prevent her of this mistake, but her daughter leaves her fan in Lord Darlingtons residence.",
    "Director": "Ernst Lubitsch",
    "Writer": "Oscar Wilde, Julien Josephson, Maude Fulton",
    "Actors": "Irene Rich, May McAvoy, Bert Lytell",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0017409",
    "tt0014925",
    "tt0015119",
    "tt0011960",
    "tt0020112",
    "tt0034274",
    "tt0028575",
    "tt0029929",
    "tt0010281",
    "tt0025493",
    "tt0011371",
    "tt0010600"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.622Z"
}