{
  "imdbId": "tt0029606",
  "title": "A Star Is Born",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AStarIsBorn",
      "id": "AStarIsBorn",
      "title": "A Star Is Born",
      "description": "Esther Blodgett (Janet Gaynor) is just another starry-eyed farm kid trying to break into the movies. Waitressing at a Hollywood party, she catches the eye of alcoholic star Norman Maine (Fredric March), is given a test, and is caught up in the Hollywood glamor machine. She and her idol Norman marry; but his career abruptly dwindles to nothing This was also Lana Turner's film debut as an extra.",
      "fileSize": 2469125928,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/AStarIsBorn",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 255851
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-star-is-born-1937",
      "id": "a-star-is-born-1937",
      "title": "A Star is Born (1937)",
      "description": "Esther Blodgett is just another starry-eyed farm kid trying to break into the movies. Waitressing at a Hollywood party, she catches the eye of her idol Norman Maine, is sent for a screen test, and before long attains stardom as newly minted Vicki Lester. She and Norman marry, though his career soon dwindles to nothing due to his chronic alcoholism. Watch on RetroFlix:  https://retroflix.org/a-star-is-born-1937/",
      "fileSize": 652284074,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-star-is-born-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 404
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pWhNwvPkL3o",
      "id": "pWhNwvPkL3o",
      "title": "A Lawman Is Born (1937) | Colorized Public Domain Western Classic with Johnny Mack Brown",
      "description": "A Lawman Is Born (1937) is an American Western film directed by Sam Newfield and released by Republic Pictures during Hollywood’s golden age of B-Westerns. This colorized and digitally restored edition revives a fast-paced frontier story originally shot in black and white, making it more appealing for today’s audiences across the United States, Europe, and worldwide. With strong performances from Johnny Mack Brown and Iris Meredith, this public domain classic delivers the action, justice, and morality tales that defined the 1930s Western genre.\n\nPlot Summary:\nThe film follows Tom Mitchell (Johnny Mack Brown), a drifter wrongly accused of murder when a confrontation with a notorious outlaw leads to bloodshed. Pursued by both lawmen and outlaws, Tom’s struggle for survival forces him to step into the very role he is accused of defying — a lawman. When the local sheriff is killed, Tom finds himself reluctantly wearing the badge, determined to clear his name and uphold justice. His courage is tested as he takes on ruthless cattle rustlers and corrupt town forces that threaten the peace of the frontier.\nAlong the way, Tom is supported by Alice Wheeler (Iris Meredith), the daughter of a respected rancher who believes in his integrity. As the townspeople question his legitimacy, Tom’s sense of honor and determination to bring criminals to justice ultimately earn him recognition as the rightful lawman. The story builds toward a dramatic showdown, underscoring the genre’s timeless themes of redemption, courage, and justice in a lawless land.\n\nCast and Crew:\n• Director: Sam Newfield\n• Producer: A.W. Hackel\n• Cinematography: Bert Longenecker\n• Editing: S. Roy Luby\nStarring:\n• Johnny Mack Brown as Tom Mitchell\n• Iris Meredith as Alice Wheeler\n• Warner Richmond as Honest John Pender\n• Karl Hackett as Sheriff Wheeler\n• Earle Hodgins as Lawyer Clemons\n• Forrest Taylor as Marshal Ed Brady\n• Ed Cassidy as Rancher\n• Al St. John as Deputy “Stubby”\n\nFilm Significance:\n“A Lawman Is Born” is a hallmark of Republic Pictures’ mid-1930s Western output, reflecting the era’s demand for quick-paced, morally clear frontier dramas. Johnny Mack Brown, a former football star turned actor, was known for his heroic roles in B-Westerns, and this film is a key example of his early career as a cowboy star. The movie stands as a cultural snapshot of Depression-era entertainment, when Westerns offered American audiences an escape into tales of law, order, and rugged heroism.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like A Lawman Is Born remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1937 release was in black and white, which was standard for B-Westerns of its time. While historically authentic, modern audiences often bypass black-and-white productions, especially on streaming platforms. This colorized edition bridges the gap by maintaining historical authenticity while presenting the story in a visually accessible way. The restored sound and enhanced picture quality also ensure a smoother viewing experience on modern devices such as smart TVs, tablets, and mobile phones.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, spanning forgotten B-movies to culturally significant works. Our channel ensures that these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#ALawmanIsBorn #JohnnyMackBrown #1930sWestern #PublicDomainMovie #ColorizedClassic #ClassicWestern #RepublicPictures #FilmRestoration #1937Movies #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:47:51.135Z",
      "thumbnail": "https://i.ytimg.com/vi/pWhNwvPkL3o/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBMKEAwDw==&rs=AOn4CLBSZJ6FesrcA9CvVCulB3a424myJQ",
      "duration": 3527,
      "language": "en",
      "year": 1937,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ALawmanIsBorn",
      "id": "ALawmanIsBorn",
      "title": "A Lawman Is Born",
      "description": "The wanted outlaw Tom Mitchell (Johnny Mack Brown) has put away his guns and now works in Root's store. When Sheriff Lance (Earle Hodgins) is killed, Martha Lance (Mary MacLaren) gets Tom to take the job. He straps the guns on again but Brownlee (Steve Clark) arrives and reveals him to be a wanted man.",
      "fileSize": 1618184031,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/ALawmanIsBorn",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 17518
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AStarIsBorn1937FullHDMovie",
      "id": "AStarIsBorn1937FullHDMovie",
      "title": "A Star Is Born (1937) high quality print",
      "description": "When a young actress (Janet Gaynor) arrives in Hollywood with hopes of stardom, a chance encounter places her under the wing of older actor Norman Maine (Fredric March). Adopting the stage name Vicki Lester, she co-stars with Norman in a major motion picture, but his success is clearly fading even a s her career begins. After the couple wed, Vicki's fame continues to grow, but Norman descends into alcoholism, and she must decide between pursuing her dream and caring for him.",
      "fileSize": 2511210361,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/AStarIsBorn1937FullHDMovie",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 55066
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TLKwa2qxf38",
      "id": "TLKwa2qxf38",
      "title": "A Star is Born (1937) ORIGINAL CLASSIC",
      "description": "Movie Class by PizzaFLIX: At the 10th Academy Awards in 1938, this David O. Selznick production was nominated for 8 Oscars including Best Picture, Best Actress, Best Actor, Best Director, Best Adapted Screenplay, but only took home the prize for Best Story.\n\nStars: Janet Gaynor, Fredric March, Adolphe Menjou\nDirector: William A. Wellman\nScreenplay: Dorothy Parker, Alan Campbell\n\nWhen a young woman arrives in Hollywood with dreams of stardom, she achieves them with the help of an alcoholic leading man whose best days are behind him.",
      "addedAt": "2025-12-26T23:43:58.673Z",
      "thumbnail": "https://i.ytimg.com/vi/TLKwa2qxf38/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLAPWZoe9Pc57Ha4vYiDpnDO9Jda-g",
      "duration": 6659,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U0LGKLhrXOA",
      "id": "U0LGKLhrXOA",
      "title": "A Lawman Is Born (1937) JOHNNY MACK BROWN",
      "description": "Stars: Johnny Mack Brown, Iris Meredith, Warner Richmond\n Director: Sam Newfield\n\n An outlaw falsely accused of murder realizes the only way to clear himself is to become a lawman.",
      "addedAt": "2025-12-26T23:49:17.237Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/U0LGKLhrXOA/maxresdefault.webp",
      "duration": 3484,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=425yT-mqbkw",
      "id": "425yT-mqbkw",
      "title": "A Star Is Born (1937) Janet Gaynor, Fredric March | Hollywood Dreams: From Farm Girl to Film Icon",
      "description": "Fate Raised Her To Fame - and killed the man she loved !\nA young woman comes to Hollywood with dreams of stardom, and achieves them only with the help of an alcoholic leading man whose best days are behind him.\n\nDirectors: William A. Wellman, Jack Conway, Victor Fleming\nWriters: Dorothy Parker, Alan Campbell, Robert Carson\nStars: Janet Gaynor, Fredric March Adolphe Menjou\nGenres: Classics, Drama, Musical, Romance\n\nOriginal title: A Star Is Born (1937)\nThis movie is available with dubbed audio on German, Italian, Portuguese & Spanish.  And Subtitles in 30+ languages. \n\nCCC Chapters:\n00:00:00 Full Movie - title credits\n00:01:12 Opening scene - Movie script\n00:09:31 Hollywood\n\n@CultCinemaClassics\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:42:21.520Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/425yT-mqbkw/maxresdefault.webp?v=647efe7f",
      "duration": 6664,
      "language": "en",
      "year": 1937,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "111 min",
    "imdbRating": 7.3,
    "imdbVotes": 11515,
    "Genre": "Drama, Romance",
    "Plot": "Esther Blodgett is just another starry-eyed farm kid trying to break into the movies. Waitressing at a Hollywood party, she catches the eye of alcoholic star Norman Maine, is given a test, and is caught up in the Hollywood glamor machine (ruthlessly satirized). She and her idol Norman marry; but his career abruptly dwindles to nothing",
    "Director": "William A. Wellman, Jack Conway, Victor Fleming",
    "Writer": "Dorothy Parker, Alan Campbell, Robert Carson",
    "Actors": "Janet Gaynor, Fredric March, Adolphe Menjou",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 7 wins & 7 nominations total"
  },
  "relatedMovies": [
    "tt0026264",
    "tt0028592",
    "tt0028634",
    "tt0030460",
    "tt0029376",
    "tt0030675",
    "tt0140551",
    "tt0030839",
    "tt0028557",
    "tt0028575",
    "tt0028607",
    "tt0028770"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}