{
  "movieId": "tt0027090",
  "title": "Things Are Looking Up",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThingsAreLookingUp_201811",
      "id": "ThingsAreLookingUp_201811",
      "title": "Things Are Looking Up",
      "description": "“Lots of fun” “Delightful British screwball comedy” “Hurrah hurrah hooray hooray” (IMDB reviews quotes). The screen writers sacrificed any semblance of believability in favor of Cicely Courtneidge’s extroverted comedic style in this screwballer in which she plays two roles. William Gargan and Max Miller appear in support. IMDB rating 7.1. Directed by Albert de Courville. Released in 1935 (UK only). Complete print (PAL transfer). CAST NOTE: Vivien Leigh’s feature film debut.",
      "fileSize": 1134271095,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/ThingsAreLookingUp_201811",
      "collection": "feature_films",
      "downloads": 10865
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6.1,
    "imdbVotes": 143,
    "Genre": "Comedy, Musical",
    "Plot": "Bertha Fytte is a serious and strict schoolmistress, and not well liked by the schoolgirls. Her sister Cicely runs a nearby circus, more or less successfully, and Bertha heartily disapproves. But spinster Bertha suddenly elopes, and Cicely is induced to take her place ... only for one day. Cicely scrapes by teaching advanced geometry and finds an ally in van Gaard, the romantic American music teacher, who discloses to her that his qualifications are not 100% genuine. The school headmistress is retiring and Bertha is on the short list to get her job. Will Cicely try to succeed for her sister, and if she tries can she put on a good enough show to pull it off?",
    "Director": "Albert de Courville",
    "Writer": "Albert de Courville, Stafford Dickens, Daisy Fisher",
    "Actors": "Cicely Courtneidge, Max Miller, William Gargan",
    "Language": "English, French",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023580",
    "tt0026694",
    "tt0251192",
    "tt0168105",
    "tt0027037",
    "tt0026113",
    "tt0026419",
    "tt0016029",
    "tt0327689",
    "tt0025960",
    "tt0025094",
    "tt0025187"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.886Z"
}