{
  "movieId": "tt0019152",
  "title": "The Mating Call",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMatingCallForYT",
      "id": "TheMatingCallForYT",
      "title": "\"The Mating Call\" (1928)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"The Mating Call\" is a crime drama.  Stemming from real and intended infidelities, trouble occurs in a small town where the ultimate authority is KKK.   Directed by                    James Cruze Produced by                  The Caddo Company Based on                        the novel by Rex Beach Starring                         Thomas Meighan, Evelyn Brent, Renée Adorée, Alan Roscoe, Helen Foster, Gardner James Release date                   July 21, 1928 Running time                 70 minutes Country                          United States Language                        Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 125236155,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheMatingCallForYT",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 4001
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "72 min",
    "imdbRating": 6.7,
    "imdbVotes": 398,
    "Genre": "Drama",
    "Plot": "Farmer turned WWI hero Leslie returns home hoping to reunite with his wife Rose, but it turns out her parents had the unconsummated marriage annulled so she could wed the rich Lon Henderson. Rose throws herself at Leslie, itching for an affair due to her husband's penchant for infidelity, but he spurns her, marrying a young French immigrant named Catherine to get her off his back. When one of Lon's lovers commits suicide after he has cast her aside, he pins it all on Les and has his KKK-inspired group take action against him...",
    "Director": "James Cruze",
    "Writer": "Rex Beach, Walter Woods, Herman J. Mankiewicz",
    "Actors": "Thomas Meighan, Evelyn Brent, Renée Adorée",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "4 wins total"
  },
  "relatedMovies": [
    "tt0017226",
    "tt0016235",
    "tt0030169",
    "tt0024151",
    "tt0030627",
    "tt0010635",
    "tt0019414",
    "tt0029799",
    "tt0030005",
    "tt0019035",
    "tt0014137",
    "tt0018795"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}