{
  "imdbId": "tt0033654",
  "title": "The 47 Ronin",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The47Ronin",
      "id": "The47Ronin",
      "title": "The 47 Ronin",
      "description": "“History speaks for itself” “Immersion in an ancient and different culture” “Most inspiring movie” “Slow and talky” (IMDB reviews quotes). A lengthy propaganda epic loosely based on the 18th  century tale of samurai whose loyalty to their master transcended his death. Produced for the Japanese military government as a way to instill the public with the so-called Bushido virtues for the impending war. Huge cast and flawless production. IMDB rating 7.5. Directed by Kengi Mizoguchi. Released in 1941 & 1942 (JP only). Complete print. Japanese language with English subtitles. AKA “Genroku Chushingura\"",
      "fileSize": 2003500518,
      "addedAt": "2026-01-07T00:06:58.272Z",
      "thumbnail": "https://archive.org/services/img/The47Ronin",
      "collection": "feature_films",
      "downloads": 39746
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "241 min",
    "imdbRating": 7.2,
    "imdbVotes": 2739,
    "Genre": "Drama, History",
    "Plot": "In 1701, Lord Takuminokami Asano has a feud with Lord Kira and he tries to kill Kira in the corridors of the Shogun's palace. The Shogun sentences Lord Asano to commit suppuku and deprives the palace and lands from his clan, but does not punish Lord Kira. Lord Asano's vassals leave the land and his samurais become ronin and want to seek revenge against the dishonor of their Lord. But their leader Kuranosuke Oishi asks the Shogun to restore the Asano clan with his brother Daigaku Asano. One year later, the Shogun refuses his request and Oishi and forty-six ronin revenge their Lord.",
    "Director": "Kenji Mizoguchi",
    "Writer": "Kenichiro Hara, Seika Mayama, Yoshikata Yoda",
    "Actors": "Chôjûrô Kawarasaki, Yoshizaburo Arashi, Utaemon Ichikawa",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032156",
    "tt0033451",
    "tt0136277",
    "tt0034272",
    "tt0159476",
    "tt0035294",
    "tt0135746",
    "tt0032710",
    "tt0035112",
    "tt0031628",
    "tt0035958",
    "tt0036506"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.272Z"
}