{
  "imdbId": "tt0011193",
  "title": "The Flapper",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheFlapper1920",
      "title": "TheFlapper1920",
      "id": "TheFlapper1920"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Flapper",
      "title": "The Flapper",
      "description": "A small town girl attends boarding school, dreams of romantic adventures, and has some. Stars: Olive Thomas, Theodore Westman, Jr., William P. Carlton, Jr., Warren Cook, Katherine Johnston, Arthur Johnston, Frances Marshall, and Marcia Harris IMDb Page Wikipedia Page",
      "id": "The_Flapper"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pGRTD_45Wlg",
      "title": "The Flapper (1920) | Colorized Public Domain Silent Comedy with Olive Thomas in Jazz Age Classic",
      "description": "The Flapper (1920) is a landmark American silent comedy film directed by Alan Crosland and starring Olive Thomas, one of the earliest icons of the Jazz Age. This restored and colorized public domain classic is historically important as the first American film to popularize the term “flapper,” symbolizing the rebellious spirit of young women in the 1920s who broke with tradition and embraced freedom, fashion, and modern lifestyles. The film is both a lighthearted romantic comedy and a cultural milestone, offering modern audiences a vivid snapshot of the beginnings of flapper culture, which would dominate the decade.\n\nPlot Summary:\nThe story follows Genevieve “Ginger” King, a spirited teenage girl played by Olive Thomas, who yearns for excitement beyond her strict boarding school life. Tired of rules and restrictions, Ginger dreams of adventure, romance, and independence. When she returns home to Florida, she finds herself entangled in comic misadventures, mistaken identities, and flirtations with older men, all while navigating the expectations of family and society.\n\nThe heart of the film lies in Ginger’s transformation from a naïve schoolgirl into a young woman embodying the flapper ideal: bold, fashionable, and unapologetically modern. Through dance, fashion, and humor, The Flapper captures the generational tension of post–World War I America, when young women challenged Victorian standards and embraced jazz, cinema, and personal freedom.\n\nCast and Crew:\n• Director: Alan Crosland\n• Producer: Selznick Pictures Corporation\n• Screenwriter: Frances Marion\nStarring:\n• Olive Thomas as Genevieve “Ginger” King\n• Warren Cook as Senator King\n• William P. Carleton as Richard Channing\n• Arthur Housman as Bill Forbes\n• Theodore Westman Jr. as Bertie Bird\n• Katherine Johnston as Hortense\n\nFilm Significance:\nThe Flapper holds a unique place in cinema history as the first feature film to introduce the term “flapper” into American pop culture. Olive Thomas’s performance epitomized the spirit of the new decade, and though she tragically died later in 1920, the film immortalized her as a symbol of Jazz Age youth. Screenwriter Frances Marion, one of the most important female voices in early Hollywood, crafted a script that combined humor with social commentary, making the film both entertaining and culturally resonant. For historians, film enthusiasts, and general audiences, The Flapper is a vivid time capsule of a society on the edge of transformation.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Flapper remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1920 release was a silent black-and-white production, reflecting the era’s filmmaking technology. While authentic, many modern audiences avoid silent films due to dated visuals. By presenting a colorized and restored edition, this version bridges the gap between historical preservation and modern entertainment. Olive Thomas’s charisma, the 1920s fashions, and the atmosphere of the Jazz Age all come alive in color, making the viewing experience richer and more accessible to contemporary audiences.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheFlapper1920 #OliveThomas #SilentComedy #PublicDomainMovie #ColorizedClassic #JazzAgeCinema #1920sMovies #SilentFilmEra #FilmRestoration #ClassicComedy",
      "id": "pGRTD_45Wlg",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-flapper",
      "title": "The Flapper",
      "id": "silent-the-flapper"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-flapper-four-tl-edition",
      "title": "The Flapper (1920)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The first film in the United States to portray the flapper subculture, The Flapper is also noteworthy for being one of the final films that Olive Thomas led in before her untimely poisoning death. While the ending of the film was criticized, for the most part the film was critically acclaimed, especially for Ms. Thomas' role.  I wasn't able to find a soundtrack for this film that I was satisfied with. I therefore took the opportunity to create one using public domain jazz, folk and blues from this time period. I labeled the video as \"FourTL Edition\" due to this. ",
      "id": "the-flapper-four-tl-edition"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "88 min",
    "imdbRating": "6.4",
    "imdbVotes": "420",
    "Genre": "Comedy, Romance",
    "Plot": "Small town girl Ginger King ( Olive Thomas ) , attends a Eastern boarding school and yearns for a more glamorous life. Dissatisfied with her military school boyfriend, Bill Forbes, she meets the older Richard Channing and goes to a country club dance with him. More bold after that adventure, Ginger, while on her way home for a holiday, meets two crooks who entrust some stolen jewels to her for safekeeping. Ginger then puts the jewels on and appears in her home town dressed as a vamp. Once the crooks reappear, however, she realizes the seriousness of the situation and gives up her pretensions to return to Bill.",
    "Director": "Alan Crosland",
    "Writer": "Frances Marion",
    "Actors": "Olive Thomas, Theodore Westman Jr., William P. Carleton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0020238",
      "title": "On with the Show!",
      "year": 1929,
      "imdbRating": "5.8",
      "imdbVotes": "353",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011508",
      "title": "Neighbors",
      "year": 1920,
      "imdbRating": "7.6",
      "imdbVotes": "4,771",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011521",
      "title": "Number, Please?",
      "year": 1920,
      "imdbRating": "6.9",
      "imdbVotes": "1,263",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011741",
      "title": "Suds",
      "year": 1920,
      "imdbRating": "6.3",
      "imdbVotes": "294",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011848",
      "title": "What Happened to Rosa",
      "year": 1920,
      "imdbRating": "6.6",
      "imdbVotes": "110",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011157",
      "title": "Erotikon",
      "year": 1920,
      "imdbRating": "6.4",
      "imdbVotes": "1,100",
      "language": "None, Swedish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011371",
      "title": "Kohlhiesel's Daughters",
      "year": 1920,
      "imdbRating": "6.5",
      "imdbVotes": "477",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011474",
      "title": "The Mollycoddle",
      "year": 1920,
      "imdbRating": "6.6",
      "imdbVotes": "206",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011652",
      "title": "The Saphead",
      "year": 1920,
      "imdbRating": "6.1",
      "imdbVotes": "1,804",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012701",
      "title": "A Small Town Idol",
      "year": 1921,
      "imdbRating": "6.3",
      "imdbVotes": "77",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012513",
      "title": "The Nut",
      "year": 1921,
      "imdbRating": "6.5",
      "imdbVotes": "307",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010806",
      "title": "True Heart Susie",
      "year": 1919,
      "imdbRating": "6.9",
      "imdbVotes": "2,034",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:57:08.317Z"
}