{
  "movieId": "tt0049961",
  "title": "A Woman's Devotion",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/battle-shock-republic",
      "id": "battle-shock-republic",
      "title": "A Woman's Devotion",
      "description": "Title: A Woman's Devotion Summary: A newly married American couple vacationing in Mexico is prevented by the police from leaving Acapulco when the husband becomes prime suspect in a local girl's homicide. Directed by: Paul Henreid Actors: Ralph Meeker, Janice Rule, Paul Henreid Production Company: Republic Pictures (I) Release Date: 16 November 1956 (USA) Aspect Ratio: 2.35 : 1 After six months of marriage to Trevor Stevenson (",
      "fileSize": 6279993200,
      "addedAt": "2026-01-07T00:07:31.713Z",
      "thumbnail": "https://archive.org/services/img/battle-shock-republic",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 3843
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "88 min",
    "imdbRating": 5.8,
    "imdbVotes": 352,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "After six months of marriage to Trevor Stevenson (Ralph Meeker), well-known painter and much-decorated hero of World War Two, Stella (Janice Rule)has found such complete fulfillment of all her romantic dreams that when he is accused or murdering a pretty cantina waitress, on their first night in Acapulco, she angrily defends him to Police Captain Henrique Montros (Paul Henreid),. nephew of Senora Reidl (Fanny Schiller), owner of the pension where they are staying. But when the maid,. Maria (Rosenda Monteros), tries to blackmail her with sketches of the dead girl, made by TRevor on the night she was murdered, and found in the house by the husband and Maria's lover, Amigo Herrera (Yerye Beirute), Stella begins to have second thoughts regarding the innocence of her husband. And his bouts of amnesia enforces her doubts.",
    "Director": "Paul Henreid",
    "Writer": "Robert Hill",
    "Actors": "Ralph Meeker, Janice Rule, Paul Henreid",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0051663",
    "tt0048261",
    "tt0044628",
    "tt0049340",
    "tt0049406",
    "tt0049904",
    "tt0049955",
    "tt0049769",
    "tt0049636",
    "tt0050087",
    "tt0050271",
    "tt0049621"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.713Z"
}