{
  "movieId": "tt0044931",
  "title": "Murder Will Out",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tvom4445687",
      "id": "tvom4445687",
      "title": "Murder Will Out",
      "description": "Title: Murder Will Out Summary: The story of four people directly and indirectly involved with the murder of a female blackmailer. The three male suspects are the girl's publisher employer; an up-and-coming writer (Edward... Directed by: John Gilling Actors: Valerie Hobson, Edward Underdown, James Robertson Justice Production Company: Tempean Films Release Date: December 1952 (UK) Aspect Ratio: 1.37 : 1 The story of four people directly and indirectly involved with the murder of a female blackmailer. The three male suspects are the girl's publisher employer; an up-and-coming writer (Edward Underdown); a brillant established writer (James Robertson Justice) who is an intellectual snob who disdains everything and everybody; and his wife (Valerie Hobson.) The latter meets the struggling writer and, propelled by her loveless marriage, falls in love with him and helps him with his ascending career, with the unwitting aid of her ailing husband. Meanwhile, the police are still investigating the murder.",
      "fileSize": 603061886,
      "addedAt": "2026-01-07T00:12:55.130Z",
      "thumbnail": "https://archive.org/services/img/tvom4445687",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 2744
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "83 min",
    "imdbRating": 6.7,
    "imdbVotes": 303,
    "Genre": "Crime, Mystery, Romance",
    "Plot": "The story of four people directly and indirectly involved in the murder of a female blackmailer. The three male suspects are the girl's employer (publisher Henry Kendall); an up-and-coming writer (Edward Underdown); a brilliant established writer (James Robertson Justice), an intellectual snob who disdains everything and everybody; and his wife (Valerie Hobson.) The latter meets the struggling writer and, propelled by her loveless marriage, falls in love with him and helps him with his ascending career, with the unwitting aid of her ailing husband. Meanwhile, the police are still investigating the murder.",
    "Director": "John Gilling",
    "Writer": "John Gilling, Terence Austin, Gerald Landeau",
    "Actors": "Valerie Hobson, Edward Underdown, James Robertson Justice",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028360",
    "tt0044314",
    "tt0024554",
    "tt0023791",
    "tt0031125",
    "tt0026177",
    "tt0021763",
    "tt0028788",
    "tt0044673",
    "tt0025530",
    "tt0025758",
    "tt0025014"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.130Z"
}