{
  "movieId": "tt0031678",
  "title": "Mr. Moto's Last Warning",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mr.MotosLastWarning720p1939",
      "id": "Mr.MotosLastWarning720p1939",
      "title": "Mr. Moto's Last Warning",
      "description": "Title: Mr. Moto's Last Warning Summary: Moto thwarts a ruthless band of international agents who try to foment an international incident by mining the entrance to the Suez Canal and blaming the British. Directed by: Norman Foster Actors: Peter Lorre, Ricardo Cortez, Virginia Field Production Company: Twentieth Century Fox Release Date: 20 January 1939 (USA) Aspect Ratio: 1.37 : 1 A Japanese man claiming to be Mr Moto, of the International Police, is abducted and murdered soon after disembarking from a ship at Port Said in Egypt. The real Mr Moto is already in Port Said, investigating a conspiracy against the British and French governments. The dead man was his colleague, impersonating him to throw the conspirators off his scent. Mr Moto recognises one of the conspirators as a British Secret Service agent, and together they discover that the gang have mined the harbour in preparation for the arrival of the French fleet. Their aim is to throw the blame onto the British, which may start a second World War.",
      "fileSize": 833182833,
      "addedAt": "2026-01-07T00:06:38.753Z",
      "thumbnail": "https://archive.org/services/img/Mr.MotosLastWarning720p1939",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 7709
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mr.-motos-last-warning-1938",
      "id": "mr.-motos-last-warning-1938",
      "title": "Mr. Moto's Last Warning (1938)",
      "description": "A Japanese man claiming to be Mr. Moto, of the International Police, is abducted and murdered soon after disembarking from a ship at Port Said in Egypt. The real Mr. Moto is already in Port Said, investigating a conspiracy against the British and French governments. Watch on RetroFlix:  https://retroflix.org/mr-motos-last-warning-1938/",
      "fileSize": 1061462161,
      "addedAt": "2026-01-07T00:09:54.331Z",
      "thumbnail": "https://archive.org/services/img/mr.-motos-last-warning-1938",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 161
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qYq0VrOUgTw",
      "id": "qYq0VrOUgTw",
      "title": "Mr. Moto’s Last Warning (1939) | Colorized Public Domain Spy Thriller with Peter Lorre Classic",
      "description": "Mr. Moto’s Last Warning (1939) is a suspenseful espionage thriller directed by Norman Foster and produced by Twentieth Century-Fox. Starring Peter Lorre in his iconic role as the Japanese detective Mr. Moto, the film blends international intrigue, espionage, and wartime naval strategy. This restored and colorized edition gives modern audiences in the United States, Europe, and beyond the chance to experience a World War II-era spy story with fresh visual vibrancy, while preserving the historical atmosphere of the late 1930s.\n\nPlot Summary:\nSet in the Egyptian port city of Port Said, the story follows the brilliant detective Kentaro Moto (Peter Lorre), who uncovers a sinister plot to sabotage the French fleet stationed in the Mediterranean. The mastermind behind the conspiracy is the ruthless smuggler and saboteur Eric Norvel (George Sanders), who intends to disrupt the fragile political balance and ignite chaos. Working under the cover of criminal operations, Norvel plots to mine the harbor and frame innocent parties for the act.\n\nMr. Moto, posing as a harmless tourist, quickly discovers the layers of deception at play. Alongside his investigation, Moto crosses paths with singer Lily Dalbray (Virginia Field), a cabaret performer caught between loyalty and survival, and Clive Armitage (Ricardo Cortez), an undercover British officer. The film moves through a tense web of disguises, betrayals, and naval strategy, culminating in Mr. Moto’s clever unraveling of the plot before disaster can strike the Allied fleet.\n\nThe film captures the tense atmosphere of a world on the brink of global war. Released in 1939, just months before World War II began, it reflects anxieties over sabotage, espionage, and the vulnerability of international alliances.\n\nCast and Crew:\n• Director: Norman Foster\n• Producer: Sol M. Wurtzel\n• Screenplay: John P. Marquand (character), Philip MacDonald and John P. Whitcomb\n• Cinematography: Virgil Miller\n• Editing: Nick DeMaggio\nStarring:\n• Peter Lorre as Kentaro Moto\n• Ricardo Cortez as Clive Armitage\n• Virginia Field as Lily Dalbray\n• George Sanders as Eric Norvel\n• John Carradine as Hawkins\n• Sig Rumann as Fabian\n• Robert Coote as Henry Featherstone\n• Margaret Irving as Madame Delacour\n\nFilm Significance:\n“Mr. Moto’s Last Warning” is the sixth installment in the Mr. Moto film series produced by Twentieth Century-Fox between 1937 and 1939. While these films are adventure mysteries, they also reflect Hollywood’s growing interest in international politics on the eve of World War II. Peter Lorre’s performance as Moto is one of his most recognizable screen personas, balancing intelligence, charm, and moral authority. George Sanders adds sophistication as the villain, later becoming famous for his roles in classics like All About Eve (1950). For modern audiences, the film stands as a cultural time capsule, showing how Hollywood framed global anxieties and espionage fears before the war.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Mr. Moto’s Last Warning remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1939 release was in black and white, reflecting both the studio style and budget of its time. While historically accurate, many viewers today skip over monochrome films. This colorized edition revives the film’s exotic settings, tense espionage atmosphere, and Peter Lorre’s captivating performance in a way that speaks to modern viewing habits, without erasing its original cinematic impact.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from spy thrillers and wartime dramas to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#MrMoto #PeterLorre #1930sMovies #SpyThriller #PublicDomainMovie #ColorizedClassic #FilmRestoration #GoldenAgeHollywood #EspionageDrama #1939Cinema",
      "addedAt": "2025-12-24T00:48:40.593Z",
      "thumbnail": "https://i.ytimg.com/vi/qYq0VrOUgTw/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYTiBLKGUwDw==&rs=AOn4CLBYeq4AXbFx_45LmHIMOX49Bhf44Q",
      "duration": 4203,
      "language": "en",
      "year": 1939,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tFVHBGmxXCg",
      "id": "tFVHBGmxXCg",
      "title": "Mr. Moto's Last Warning (1939) PETER LORRE",
      "description": "Stars: Peter Lorre, Ricardo Cortez, John Carradine\n Director: Norman Foster\n\n Moto thwarts a ruthless band of international agents who try to foment an international incident by mining the entrance to the Suez Canal and blaming the British.",
      "addedAt": "2025-12-26T23:52:31.377Z",
      "thumbnail": "https://i.ytimg.com/vi/tFVHBGmxXCg/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB7ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLB4APqbzeGDYkXyvSyboelP2S3aOA",
      "duration": 4242,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=p450XB7JQuQ",
      "id": "p450XB7JQuQ",
      "title": "Mr. Moto's Last Warning (1939) Peter Lorre - Crime, Drama, Mystery",
      "description": "Moto thwarts a ruthless band of international agents who try to foment an international incident by mining the entrance to the Suez Canal and blaming the British.\n\nDirector: Norman Foster\nWriters: Philip MacDonald, Norman Foster \nStars: Peter Lorre, Ricardo Cortez, Virginia Field\nGenres: Crime, Drama, Mystery, Romance, Thriller\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:49:28.436Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/p450XB7JQuQ/maxresdefault.webp?v=61e6c00a",
      "duration": 4242,
      "language": "en",
      "year": 1939,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 6.4,
    "imdbVotes": 1464,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "A Japanese man claiming to be Mr Moto, of the International Police, is abducted and murdered soon after disembarking from a ship at Port Said in Egypt. The real Mr Moto is already in Port Said, investigating a conspiracy against the British and French governments. The dead man was his colleague, impersonating him to throw the conspirators off his scent. Mr Moto recognises one of the conspirators as a British Secret Service agent, and together they discover that the gang have mined the harbour in preparation for the arrival of the French fleet. Their aim is to throw the blame onto the British, which may start a second World War.",
    "Director": "Norman Foster",
    "Writer": "Philip MacDonald, Norman Foster, John P. Marquand",
    "Actors": "Peter Lorre, Ricardo Cortez, Virginia Field",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028846",
    "tt0027775",
    "tt0030049",
    "tt0030341",
    "tt0031338",
    "tt0029811",
    "tt0031497",
    "tt0031865",
    "tt0025452",
    "tt0028231",
    "tt0032404",
    "tt0028511"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.331Z"
}