{
  "imdbId": "tt0028770",
  "title": "Daughter of Shanghai",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/daughter-of-shanghai-1937",
      "id": "daughter-of-shanghai-1937",
      "title": "Daughter Of Shanghai (1937) ,",
      "description": "Anna May Wong",
      "fileSize": 1101053983,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/daughter-of-shanghai-1937",
      "collection": "feature_films",
      "downloads": 4953
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 6.6,
    "imdbVotes": 628,
    "Genre": "Crime, Drama, Romance",
    "Plot": "In an unidentified airplane flying over the ocean in which six aliens are huddled, alien-smugglers Frank Barden and Andrew Sleete are trying to evade a government pursuit plane. They dump the screaming \"evidence\" into the sea. Escaping pursuit, they later approach wealthy merchant Quan Lin and demand he take some aliens off of their hands. They kill him when he refuses. Lan Ying Lin, his daughter, goes to wealthy society matron Mrs. Mary Hunt for help. She introduces her to an inspector and Kim Lee, a government agent. Unknown to all, Mrs. Hunt is the power behind the smuggling ring. Turning detective to catch her father's killers, Lan Ying Lin finds herself on a remote island where she takes a job as a dancer in a honky-tonk operated by Otto Hartman, and discovers the island resort is a blind for an alien receiving station. She gets the evidence on Hartman and flees the island with agent Lee, disguised as a man, in the hold of the smuggling vessel. They are discovered by the ship's captain who radios for a sea plane. They are loaded into the plane, piloted by Barden and Sleete, and are being flown out to sea to be disposed of.",
    "Director": "Robert Florey",
    "Writer": "Gladys Unger, Garnett Weston, William Hurlbut",
    "Actors": "Anna May Wong, Charles Bickford, Buster Crabbe",
    "Language": "French, English, Cantonese",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0030039",
    "tt0030322",
    "tt0031232",
    "tt0028607",
    "tt0029050",
    "tt0029238",
    "tt0029319",
    "tt0028737",
    "tt0029362",
    "tt0029378",
    "tt0029812",
    "tt0025709"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.603Z"
}