{
  "movieId": "tt0049857",
  "title": "Time Table",
  "year": 1956,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4Vj_lMvczow",
      "id": "4Vj_lMvczow",
      "title": "Time Table (1956) [Film Noir] [Drama]",
      "description": "A physician, whose license has been revoked, poses as a practicing doctor aboard a train passing through Arizona. His presence there is part of a caper involving a fictitious patient, on whose behalf he gains access to his checked baggage, including his physician's \"black bag,\" in the baggage car, whereupon he blows and then robs the safe. Then he arranges for both the fictitious patient, which he claims is infected with a communicable disease which poses an immediate and extremely serious public health risk, and himself to leave the train, presumably departing for the closest hospital, which is also far from any scheduled train stop, the two thereby escaping with $500,000 in an ambulance. The railroad officials do not discover the robbery until the train reaches Phoenix, many hours after their escape has been effected.\n\nIn response, the insurance company puts the protagonist, Charlie Norman, on the case, forcing him to postpone his previously scheduled vacation to Mexico. Joe Armstrong, an old friend who is the investigator for the railroad, works with him. Gradually evidence starts to turn up that the thieves ditched the ambulance and escaped in a rented helicopter. The scheme was thus elaborate, showing that the robbery had been carried out according to a strict timetable. But there was one misstep that kept it from being the perfect crime. As the investigators pursue this misstep, the intended timetable starts to unravel and the audience suddenly discovers who the secret mastermind is.\n\nFinally, as the American and Mexican authorities begin to close in, the mastermind pulls his last clean-escape opportunity from his sleeve, only to have his well-intentioned wife pull a practical joke on him, in the process making a duplicate key to his locked attache case and substituting vacation travel magazines for his work papers only to discover that the robbery money is in his case, which she immediately returns, anonymously, to the railroad, thereby completely foiling what had started out to be \"the perfect crime.\"\n\n---\n\nDirected by Mark Stevens, produced by Mark Stevens, written by Aben Kandel (screenplay) and Robert Angus (story), starring Mark Stevens as Charlie Norman, King Calder as Joe Armstrong, Felicia Farr as Linda Brucker, Marianne Stewart as Ruth Norman, Wesley Addy as Dr. Paul Brucker, Alan Reed as Al Wolfe, Rodolfo Hoyos Jr. as Lt. Castro, Jack Klugman as Frankie Page and John Marley as Bobik\n\n---\n\nSource: \"Time Table (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 17 November 2013. Web. 12 March 2013. http://en.wikipedia.org/wiki/Time_Table_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:42.845Z",
      "thumbnail": "https://i.ytimg.com/vi/4Vj_lMvczow/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBnqLfduc6pdnUPdYp_ok5m3V13ng",
      "duration": 4821,
      "language": "en",
      "year": 1956,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_YyOCJOfkXY",
      "id": "_YyOCJOfkXY",
      "title": "Time Table (1956) | Colorized Public Domain Noir Crime Heist with Mark Stevens and Felicia Farr",
      "description": "Time Table (1956) is a gripping film noir crime thriller directed by and starring Mark Stevens. Restored and colorized for modern audiences, this public domain classic delivers a suspenseful tale of deception, betrayal, and a meticulously planned train robbery gone wrong. With its concise 79-minute runtime and shocking twist ending, Time Table remains a standout example of 1950s noir cinema.\n\nPlot Summary:\nThe story begins with a daring train robbery executed with surgical precision. Disguised as “Dr. Sloan,” disgraced physician Paul Brucker boards the train with his wife Linda, posing as a sick passenger. Using the ruse to gain access to the baggage car, Brucker blows open the safe and escapes with a stolen payroll of half a million dollars. Their plan, timed to the minute, seems flawless as they slip away in an ambulance from a remote desert town hospital.\n\nInsurance investigator Charlie Norman, teamed with railroad policeman Joe Armstrong, is assigned to track down the culprits. What appears to be a straightforward case soon reveals layers of deceit. The twist: Norman himself is secretly the mastermind behind the heist, using his authority to cover his tracks while trying to secure the stolen fortune. But greed, mistrust, and desperation spiral out of control as accomplices falter and suspicions grow. By the climax, double crosses and moral reckonings expose the fragility of loyalty when crime is driven by greed.\n\nCast and Crew:\n• Director: Mark Stevens\n• Screenplay: Aben Kandel, story by Robert Angus\n• Cinematography: Charles Van Enger\n• Music: Walter Scharf\n\nStarring:\n• Mark Stevens as Charlie Norman\n• King Calder as Joe Armstrong\n• Felicia Farr as Linda Brucker\n• Marianne Stewart as Ruth Norman\n• Wesley Addy as Dr. Paul Brucker\n• Alan Reed as Al Wolfe\n• Jack Klugman as Frankie Page\n• John Marley as Bobik\n\nFilm Significance:\nTime Table is a tightly paced noir thriller that captures the postwar fascination with heists, moral corruption, and the thin line between respectability and crime. Mark Stevens not only directed but also starred in the picture, giving it a distinctive personal imprint. The film features strong performances from Felicia Farr, Wesley Addy, and a young Jack Klugman in one of his early roles. Its themes of betrayal, deception, and justice gone awry resonate strongly with fans of classic noir.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Time Table remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1956 release was in black-and-white, typical of film noir. While historically authentic, many modern viewers skip past monochrome titles. By offering a colorized version, we bridge the gap between historical preservation and contemporary viewing habits. This edition revitalizes the suspense and moral tension of the original while giving it visual appeal for today’s audiences across the United States, Europe, and beyond.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TimeTable1956 #FilmNoir #PublicDomainMovie #ColorizedClassic #MarkStevens #FeliciaFarr #JackKlugman #CrimeThriller #HeistMovie #ClassicCinema",
      "addedAt": "2025-12-24T00:48:29.524Z",
      "thumbnail": "https://i.ytimg.com/vi/_YyOCJOfkXY/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBkKEowDw==&rs=AOn4CLDWooNK_pNd7j0Z8fLg4KudMVgdSw",
      "duration": 4736,
      "language": "en",
      "year": 1956,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/time-table-1956",
      "id": "time-table-1956",
      "title": "Time Table (1956)",
      "description": "An insurance detective encounters numerous surprises when he is assigned to investigate a meticulously-planned train robbery in Arizona. Watch on RetroFlix:  https://retroflix.org/time-table-1956/",
      "fileSize": 174931628,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/time-table-1956",
      "language": "eng",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 216
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=byrHVXunq6Q",
      "id": "byrHVXunq6Q",
      "title": "Time Table (1956) MARK STEVENS",
      "description": "Stars: Mark Stevens, King Calder, Felicia Farr\nDirector: Mark Stevens\n\nAs a train speeds through the Arizona night, a man posing as a physician holds up the baggage-car crew and escapes with a $500,000 payroll.",
      "addedAt": "2025-12-26T23:57:25.985Z",
      "thumbnail": "https://i.ytimg.com/vi/byrHVXunq6Q/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhiIGIoYjAP&rs=AOn4CLAxTSM4kqsVQWB7TFoRDl7_Q39R9A",
      "duration": 4821,
      "language": "en",
      "year": 1956,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1956-time-table-mark-stevens",
      "id": "1956-time-table-mark-stevens",
      "title": "1956 - Time Table - Mark Stevens",
      "description": "1956 - Time Table - Mark Stevens",
      "fileSize": 1042725897,
      "addedAt": "2026-01-07T00:06:06.563Z",
      "thumbnail": "https://archive.org/services/img/1956-time-table-mark-stevens",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 1144
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 6.6,
    "imdbVotes": 943,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "As a train speeds through the Arizona night, a man posing as a physician holds up the baggage-car crew and escapes with a $500,000 payroll. The fake doctor, Paul Bruckner, leaves the train with his \"patient\" and the \"patient's wife\", who is really Bruckner's wife Linda. The insurance company puts its best investigator, Charlie Norman, on the case to work with the railroad's investigator, Joe Armstrong. The men are friends and Joe is upset that Charlie and his wife, Ruth, will have to postpone their Mexico vacation. Charlie's concern goes beyond the spoiled vacation as he was the brains behind the holdup, who had fallen in love with Linda several months earlier while investigating a claim Bruckner had filed against his insurance company. At first, Joe is unable to find anything out about the flawlessly timetable planning for the robbery other than what Charlie wants him to find out.",
    "Director": "Mark Stevens",
    "Writer": "Robert Angus, Aben Kandel",
    "Actors": "Mark Stevens, King Calder, Felicia Farr",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0046885",
    "tt0049340",
    "tt0049406",
    "tt0049904",
    "tt0049955",
    "tt0049769",
    "tt0049636",
    "tt0050087",
    "tt0050271",
    "tt0049621",
    "tt0049718",
    "tt0049922"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T17:45:12.285Z"
}