{
  "imdbId": "tt0043068",
  "title": "Trial Without Jury",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/trial-without-jury-1950",
      "id": "trial-without-jury-1950",
      "title": "Trial Without Jury (1950) ,",
      "description": "Trial Without Jury",
      "fileSize": 1055200248,
      "addedAt": "2026-01-07T00:12:55.129Z",
      "thumbnail": "https://archive.org/services/img/trial-without-jury-1950",
      "collection": "feature_films",
      "downloads": 638
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "60 min",
    "imdbRating": 6.1,
    "imdbVotes": 44,
    "Genre": "Crime, Drama",
    "Plot": "At theater producer Phillip Mannings' Hollywood office, playwright Jed Kilgore demands to know why his latest play was rejected. Phillip tells him the play is no good, and suggests that Jed try a mystery instead. They fight, but are interrupted by the arrival of a visitor. After Phillip asks Jed to keep his upcoming trip to Honolulu a secret, Jed leaves, taking the visitor's scarf with him. The next morning, Jed reads in the newspaper that Phillip has been murdered. Jed confers with his girl friend, talent agent Myra Peters, whose brother Bill, a police lieutenant, is leading the investigation into Phillip's death. Although he did not see the murderer, Jed starts a rumor that he has inside information about the crime, hoping to scare the killer into revealing his or her identity. They go to the theater, where Bill has assembled everyone for the investigation, and Myra suggests that Jed rewrite his play to incorporate the facts of the case. Jed and Myra tell Bill about their plan, and he informs them that Phillip was strangled, and that some fingerprints found on the door will soon be identified. Jed and Myra listen through the intercom as Bill questions Mrs. Mannings and Phillip's associates, including John Webb, his financial backer. Mrs. Mannings says that she hated her husband, who was unfaithful, and suggests that Bill question Corinne Hollister, who was set to star in Jed's play before Phillip rejected it. Bill tells Jed that a panhandler named Shuffalong reported seeing a man matching Jed's description entering Phillip's building the previous night. After Bill leaves, Jed receives an anonymous telegram warning him that if he writes the play, he must do justice to the role of Jed Kilgore. While Bill is at the telegraph office trying to find out who sent the message, Jed is attacked by an unidentified man. They fight and the man escapes, taking the scarf with him. Rehearsals for Jed's new play begin, and Bill becomes increasingly suspicious of Jed. Speculating that Corinne was going to accompany Phillip to Honolulu, Jed goes to the airport and inquires about reservations under her name, and the clerk immediately calls Bill to report this. As Jed is leaving the airport, someone shoots at him and misses. During intermission on opening night of Jed's play, Bill arrests Jed, but Jed escapes on the way to the police station. Meanwhile, the killer hides inside Myra's dressing room, but Jed arrives in time to rescue her, although the killer gets away. Jed then takes over the leading man's role himself, and when he confronts Corinne onstage with a scarf that Myra knit for him, she says that she knitted it for her father. To the audience's surprise, Webb then walks onto the stage and objects to Jed's accusations. Corinne reproaches Webb for being a controlling father, adding that she changed her name to get away from him. Webb tells her that he is her foster father, her real father having deserted her, and admits to killing Phillip because of his affair with Corinne. Bill arrests Webb, and Jed and Myra get married.",
    "Director": "Philip Ford",
    "Writer": "Albert DeMond, Rose Simon Kohn, Lawrence L. Goldman",
    "Actors": "Robert Rockwell, Barbra Fuller, Kent Taylor",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043810",
    "tt0040895",
    "tt0043144",
    "tt0038431",
    "tt0038683",
    "tt0038768",
    "tt0042392",
    "tt0274965",
    "tt0042261",
    "tt0042869",
    "tt0043142",
    "tt0042176"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.129Z"
}