{
  "movieId": "tt0043362",
  "title": "The Browning Version",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/15062tbv",
      "id": "15062tbv",
      "title": "The Browning Version",
      "description": "Title: The Browning Version Summary: Forced to retire from an English public school, an unpopular professor must confront his failure as a teacher and husband. Directed by: Anthony Asquith Anthony Asquith Actors: Michael Redgrave, Jean Kent, Nigel Patrick Production Company: Javelin Films Release Date: 6 April 1951 (UK) Aspect Ratio: 1.37 : 1 Color: Black and White Andrew Crocker-Harris, a classics teacher at an English school, is afflicted with a heart ailment and an unfaithful wife. His interest in his pupils wanes as he looks towards his final days in employment.",
      "fileSize": 731861741,
      "addedAt": "2026-01-07T00:06:00.051Z",
      "thumbnail": "https://archive.org/services/img/15062tbv",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 11789
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 8,
    "imdbVotes": 5576,
    "Genre": "Drama",
    "Plot": "Andrew Crocker-Harris (Michael Redgrave) is a classics teacher at an English boys school. After 18 years of teaching there, today is his last day before moving on to a position at another school. The students speculate on why he is leaving, but don't much care since despite being academically brilliant, he is universally despised as being strict, stern and humorless. They have nicknamed him \"The Crock.\" Even the school administrators treat him poorly regardless of his long tenure. Millie Crocker-Harris (Jean Kent), his wife, is quite a bit different than her husband: she's younger and vivacious. She no longer loves her husband but rather loves Frank Hunter (Nigel Patrick), another teacher, who despite having an affair with him, knows that he is not in love with her. On this last day, one student named Taplow (Brian Smith), who doesn't hate Mr. Crocker-Harris but feels sorry for him, provides him with a small going-away gift. The gift brings about a series of actions which make Mr. Crocker-Harris reflect on his past, contemplate his future, and evaluate how he is going to finish his tenure at the school.",
    "Director": "Anthony Asquith",
    "Writer": "Terence Rattigan",
    "Actors": "Michael Redgrave, Jean Kent, Nigel Patrick",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "Nominated for 2 BAFTA 7 wins & 3 nominations total"
  },
  "relatedMovies": [
    "tt0045769",
    "tt0036516",
    "tt0020793",
    "tt0054086",
    "tt0059927",
    "tt0043885",
    "tt0043938",
    "tt0044364",
    "tt0043332",
    "tt0043435",
    "tt0043338",
    "tt0043390"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.051Z"
}