{
  "imdbId": "tt0047127",
  "title": "Jail Bait",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1954-jail-bait-hidden-face-ed-wood-vose",
      "title": "1954 - Jail Bait - Hidden Face - Ed Wood - VOSE",
      "description": "For Academic - Educational Use Only",
      "fileSize": 343959377,
      "id": "1954-jail-bait-hidden-face-ed-wood-vose"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JailBait",
      "title": "Jail Bait",
      "description": "Jail Bait (1954) Directed by Edward D Wood Jr. A Howco Release A vicious criminal uses plastic surgery to escape the police.This movie features Steve Reeves (undubbed). This is the original version of the film released in 1954. This film was registered for copyright (1954 LP3883) and never renewed. It entered the public domain on 1 January 1983.",
      "fileSize": 1248294643,
      "id": "JailBait"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Jailbait_339",
      "title": "Jail Bait",
      "description": "Title: Jail Bait Summary: Vic Brady draws young Don Gregor into a life of crime. He then blackmails Gregor's plastic surgeon father into fixing up his face so he can evade the cops. Directed by: Edward D. Wood Jr. Actors: Production Company: Howco Productions Inc. Release Date: 12 May 1954 (USA) Aspect Ratio: 1.37 : 1 Vic Brady draws young Don Gregor into a life of crime. He then blackmails Gregor's plastic surgeon father into fixing up his face so he can evade the cops.",
      "fileSize": 488071247,
      "id": "Jailbait_339"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jail-bait-1954",
      "title": "Jail Bait (1954)",
      "description": "Don Gregor, the son of famous plastic surgeon Dr. Boris Gregor, begins to hang around with young criminal Vic Brady and carry a gun. The pair attempt an armed holdup, and when things start to go wrong Gregor accidentally kills a night watchman. Fearing that Gregor plans to turn himself in, Brady kills him and blackmails Dr. Gregor into giving him a new face. Watch on RetroFlix:  https://retroflix.org/jail-bait-1954/",
      "fileSize": 139907028,
      "id": "jail-bait-1954"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jailbait1954_202001",
      "title": "Jail Bait (1954) Dir: Ed Wood, Starring Lyle Talbot, Dolores Fuller - Film Noir",
      "description": "Jail Bait (also known as Hidden Face) is a 1954 American film noir directed by Ed Wood, with a screenplay by Wood and Alex Gordon. The film stars Clancy Malone, Dolores Fuller, Lyle Talbot and famed bodybuilder Steve Reeves, making his first major screen appearance in the film.   Notable for their campy aesthetics, technical errors, unsophisticated special effects, ill-fitting stock footage, eccentric casts, idiosyncratic stories, and non sequitur dialogue, Wood's films remained largely obscure until he was posthumously awarded a Golden Turkey Award for Worst Director of All Time in 1980, renewing public interest in his life and work.   Wikipedia: https://en.wikipedia.org/wiki/Jail_Bait_(1954_film) Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 196466254,
      "id": "jailbait1954_202001"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nH3HMnA6_Og",
      "title": "Jail Bait (1954) | Colorized Public Domain Crime Thriller by Ed Wood with Steve Reeves & Lyle Talbot",
      "description": "Jail Bait (1954) is a gritty American crime thriller directed by Ed Wood, one of Hollywood’s most notorious independent filmmakers. This colorized and digitally restored version from Colorized Public Domain reimagines Wood’s cult noir through high-quality visuals and modern restoration techniques, making it more immersive and watchable for today’s audiences across the United States, Europe, and beyond. The film blends criminal underworld tension with identity horror, exploring vanity, corruption, and the dark side of ambition in postwar America. By transforming the original black-and-white footage into vivid color, this edition gives a new dimension to Ed Wood’s bold storytelling and the raw performances of Lyle Talbot, Dolores Fuller, and a young Steve Reeves.\n\nPlot Summary:\nThe story follows Don Gregor (Clancy Malone), the reckless son of respected plastic surgeon Dr. Boris Gregor (Herbert Rawlinson). Don’s thirst for easy money drags him into a world of crime under the influence of the ruthless Vic Brady (Timothy Farrell). After a botched robbery leaves a man dead, Don becomes a liability to his criminal associates, who plot to silence him before he can expose their operation. In a desperate twist, Don’s father uses his surgical skills to perform a drastic operation that will change his son’s face — and his identity — forever.\n\nAs the narrative unfolds, the film blurs the line between crime and punishment, guilt and redemption. Dr. Gregor’s moral conflict mirrors the ethical decay of a society obsessed with appearances. When Vic Brady turns on Don, the consequences erupt into a violent finale that delivers one of Ed Wood’s most infamous and haunting endings.\n\nCast and Crew:\n• Director: Ed Wood\n• Producer: Alex Gordon\n• Screenplay: Ed Wood\n• Cinematography: William C. Thompson\n• Editing: Edward D. Wood Jr.\n• Music: Hoyt S. Curtin\nStarring:\n• Lyle Talbot as Inspector Johns\n• Dolores Fuller as Marilyn Gregor\n• Clancy Malone as Don Gregor\n• Herbert Rawlinson as Dr. Boris Gregor\n• Timothy Farrell as Vic Brady\n• Steve Reeves as Police Officer\n• Theodora Thurman as Loretta\n\nFilm Significance:\nJail Bait stands as one of Ed Wood’s most ambitious early projects, showcasing his raw narrative instincts and fascination with crime, identity, and transformation. Though often cited for its low-budget execution, the film’s script reveals complex themes of moral decay beneath the pulp surface. For modern viewers, this movie serves as both a time capsule of 1950s B-movie production and a precursor to later crime and horror hybrids. It also features an early appearance by future Hercules actor Steve Reeves before his international fame. The film’s experimental tone and eccentric direction give it an enduring cult status, solidifying its place among mid-century American noir curiosities.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Jail Bait remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1954 release of Jail Bait was filmed in stark black and white, reflecting Ed Wood’s limited resources but ambitious vision. This colorized restoration enhances the film’s visual appeal for modern audiences, particularly those viewing on large screens and high-definition devices. The added color depth brings new life to the tense performances and postwar American atmosphere, allowing viewers to experience the noir world through a modern cinematic lens. This edition is perfect for audiences aged 55–64 in the USA, Germany, and Serbia who enjoy rediscovering restored classics from the Golden Age of cinema.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from Hollywood’s Golden Age, including crime dramas, thrillers, and forgotten gems. Each restoration is designed for optimal viewing on TVs and desktops, helping audiences worldwide rediscover classic cinema in modern quality while preserving the cultural history of American film.\n\n#JailBait1954 #EdWood #FilmNoir #PublicDomainMovie #ColorizedClassic #CrimeThriller #SteveReeves #LyleTalbot #DoloresFuller #ClassicCinema #GoldenAgeHollywood #FilmRestoration #ColorizedPublicDomain #1950sCrimeFilm #CultClassic",
      "id": "nH3HMnA6_Og",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FCdUssXwuKM",
      "title": "1954 - Jail Bait - Face-swap Heist:  She's A Good Girl... To Leave Alone!",
      "description": "When a troubled teen's petty crimes spiral into murder, a desperate plastic surgery scheme unleashes chaos. Spoiler: Bandages hide more than scars in this twisty tale!\n\nWritten & Directed by Ed Wood\n\nColorized version: https://youtu.be/xs3b1Fvjzyo\n\nCast:\nLyle Talbot - Inspector Johns\nSteve Reeves - Lieutenant Bob Lawrence, Johns's associate\nHerbert Rawlinson - Dr. Boris Gregor, a plastic surgeon and father of Don and Marilyn\nClancy Malone - Don Gregor, Dr. Gregor's son and an associate of gangster Vic Brady\nDolores Fuller - Marilyn Gregor, Dr. Gregor's daughter and Don's sister\nTimothy Farrell - Vic Brady, a gangster\nTheodora Thurman - Loretta, Brady's mistress\n\nGenres: Crime, Drama, Film-Noir, Thriller\nRelease date: May 1954 \nFilming location: Los Angeles, California, USA",
      "id": "FCdUssXwuKM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=C16oPQPNtLw",
      "title": "Jail Bait (1954) Edward D. Wood Jr. | Crime, Drama, Film-Noir",
      "description": "Vic Brady draws young Don Gregor into a life of crime. He then blackmails Gregor's plastic surgeon father into fixing up his face so he can evade the cops.\n\nDirector: Edward D. Wood Jr.\nWriters: Alex Gordon, Edward D. Wood Jr. \nStars: Lyle Talbot, Dolores Fuller, Herbert Rawlinson\nGenre:  Classics, Cult film, Drama, Crime, Film Noir\nBudget: $22,000\n\n@CultCinemaClassics \nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "C16oPQPNtLw",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 3.7,
    "imdbVotes": 2933,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Vic Brady draws young Don Gregor into a life of crime. He then blackmails Gregor's plastic surgeon father into fixing up his face so he can evade the cops.",
    "Director": "Edward D. Wood Jr.",
    "Writer": "Alex Gordon, Edward D. Wood Jr.",
    "Actors": "Lyle Talbot, Dolores Fuller, Herbert Rawlinson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0047542",
      "title": "Suddenly",
      "year": 1954,
      "imdbRating": 6.8,
      "imdbVotes": 7583,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046969",
      "title": "The Fast and the Furious",
      "year": 1954,
      "imdbRating": 5.3,
      "imdbVotes": 1707,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046790",
      "title": "Black Tuesday",
      "year": 1954,
      "imdbRating": 6.7,
      "imdbVotes": 1024,
      "language": "English, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046885",
      "title": "Cry Vengeance",
      "year": 1954,
      "imdbRating": 6.4,
      "imdbVotes": 786,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046935",
      "title": "Drive a Crooked Road",
      "year": 1954,
      "imdbRating": 6.9,
      "imdbVotes": 2173,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047263",
      "title": "Naked Alibi",
      "year": 1954,
      "imdbRating": 6.5,
      "imdbVotes": 1585,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047370",
      "title": "Private Hell 36",
      "year": 1954,
      "imdbRating": 6.7,
      "imdbVotes": 1952,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047479",
      "title": "Shield for Murder",
      "year": 1954,
      "imdbRating": 6.8,
      "imdbVotes": 1780,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047679",
      "title": "Witness to Murder",
      "year": 1954,
      "imdbRating": 6.6,
      "imdbVotes": 3523,
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047681",
      "title": "World for Ransom",
      "year": 1954,
      "imdbRating": 5.8,
      "imdbVotes": 654,
      "language": "English, Cantonese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047087",
      "title": "Highway Dragnet",
      "year": 1954,
      "imdbRating": 6.2,
      "imdbVotes": 1070,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047417",
      "title": "Riot in Cell Block 11",
      "year": 1954,
      "imdbRating": 7,
      "imdbVotes": 2518,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.188Z"
}