{
  "movieId": "tt0061770",
  "title": "Hombre",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hombre-1967_202509",
      "id": "hombre-1967_202509",
      "title": "Hombre (1967) Paul Newman · Fredric March",
      "description": "Paul Newman as a taciturn outsider. A gripping Western by Martin Ritt.. Paul Newman plays the white man John Russell, raised among the Apaches and thus familiar with their way of thinking and acting. Together with a group of travelers who view the outsider with contempt, Russell becomes embroiled in a stagecoach robbery in which the bandits are after the embezzled money of an Indian agent. Without food or sufficient water, the bandits abandon the group in the wilderness except for one hostage. The motley crew must reluctantly entrust themselves to the leadership of the experienced Russell, increasingly irritated by his behavior and Indian philosophy of life.   An unsentimental film, superbly photographed by James Wong Howe , in which the dialogue and the inner tension of the characters take center stage and which features Paul Newman in an exceptional role.",
      "fileSize": 3574484115,
      "addedAt": "2026-01-07T00:08:46.612Z",
      "thumbnail": "https://archive.org/services/img/hombre-1967_202509",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 416
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hombre-1967_202511",
      "id": "hombre-1967_202511",
      "title": "Hombre (1967)",
      "description": "Hombre is a 1967 American revisionist Western film directed by Martin Ritt, based on the 1961 novel of the same name by Elmore Leonard and starring Paul Newman, Fredric March, Richard Boone and Diane Cilento. The story  follows John Russell, a white man raised by Apaches, who inherits a boarding house after his adoptive father's death. He reluctantly returns to the white world, where he becomes the only hope for a group of stagecoach passengers when they are attacked by outlaws, leading to a moral dilemma about loyalty and survival.",
      "fileSize": 1524539334,
      "addedAt": "2026-01-07T00:08:46.613Z",
      "thumbnail": "https://archive.org/services/img/hombre-1967_202511",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 194
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "111 min",
    "imdbRating": 7.4,
    "imdbVotes": 14257,
    "Genre": "Drama, Western",
    "Plot": "John 'Hombre' Russell is a white man raised by the Apaches on an Indian reservation and later by a white man in town. As an adult he prefers to live on the reservation. He is informed that he has inherited a lodging-house in the town. He goes to the town and decides to trade the place for a herd. He has to go to another city. The only stagecoach is one being hired for a special trip paid by Faver and his wife Audra. As there are several seats others join the stagecoach making seven very different passengers in all. During the journey they are robbed. With the leadership of John Russell they escape with little water and the money that the bandits want. They are pursued by the bandits. As they try to evade the bandits they reveal their true nature in a life threatening situation.",
    "Director": "Martin Ritt",
    "Writer": "Irving Ravetch, Harriet Frank Jr., Elmore Leonard",
    "Actors": "Paul Newman, Fredric March, Richard Boone",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 nominations"
  },
  "relatedMovies": [
    "tt0061709",
    "tt0064208",
    "tt0055278",
    "tt0061787",
    "tt0062309",
    "tt0063501",
    "tt0061832",
    "tt0062472",
    "tt0062479",
    "tt0060325",
    "tt0060315",
    "tt0060355"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.613Z"
}