{
  "movieId": "tt0043910",
  "title": "Payment on Demand",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PaymentOnDemand",
      "id": "PaymentOnDemand",
      "title": "Payment on Demand",
      "description": "tr",
      "fileSize": 20185019,
      "addedAt": "2026-01-07T00:06:45.466Z",
      "thumbnail": "https://archive.org/services/img/PaymentOnDemand",
      "collection": "feature_films",
      "downloads": 2071
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 6.9,
    "imdbVotes": 1851,
    "Genre": "Drama",
    "Plot": "Well-to-do Joyce Ramsey is the dominant and domineering force in her household comprised of her lawyer husband David Ramsey, their young adult daughter Diana Ramsey and their late teenaged daughter Martha Ramsey. Everything Joyce has done in the course of her marriage to David has been in the pursuit of wealth, prestige, comfort and security for her and the family, which belies her and David's humble beginnings. Their current wealth and status began with a white lie told by Joyce to one of David's potential clients when David was still struggling as a lawyer, that lie which had the consequence of Joyce, and by association David, stepping on the back of a friend as they climbed the social ladder, Joyce never to look back after this and subsequent such actions. Joyce has no real idea of how her actions have negatively affected David's feelings for her, Joyce who is blindsided when David asks her for a divorce in no longer loving her. As such, Joyce has no idea why David wants the divorce. Although Joyce's friends put into her mind that another woman may be involved which does make Joyce curious if that is the sole reason for David's want, Joyce begins to reflect on key points in the course of her and David's marriage. Those reflections, Joyce's investigation into David's possible infidelity, she getting a glimpse of her future without David and his love, and she getting a sense of that young, pure love again that she and David truly had when they wed may affect what Joyce decides to do about David's request for the divorce.",
    "Director": "Curtis Bernhardt",
    "Writer": "Bruce Manning, Curtis Bernhardt",
    "Actors": "Bette Davis, Barry Sullivan, Jane Cowl",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0044364",
    "tt0043390",
    "tt0027347",
    "tt0018588",
    "tt0041694",
    "tt0042192",
    "tt0045029",
    "tt0045932",
    "tt0043885",
    "tt0043362",
    "tt0043938",
    "tt0043332"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.466Z"
}