{
  "movieId": "tt0027504",
  "title": "Death from a Distance",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DeathFromADistance1935",
      "id": "DeathFromADistance1935",
      "title": "Death from a Distance",
      "description": "Title: Death from a Distance Summary: While a distinguished astronomer is giving a lecture in a planetarium, a shot rings out and one of the audience members is found dead. A tough detective and a brassy female reporter lock horns as they both try to break the case. Directed by: Frank R. Strayer Actors: Production Company: Invincible Pictures Corp. Release Date: 30 December 1935 (UK) Aspect Ratio: 1.37 : 1 While a distinguished astronomer is giving a lecture in a planetarium, a shot rings out and one of the audience members is found dead. A tough detective and a brassy female reporter lock horns as they both try to break the case.",
      "fileSize": 573150733,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/DeathFromADistance1935",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 11671
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/death_from_a_distance",
      "id": "death_from_a_distance",
      "title": "Death From a Distance",
      "description": "Taken from IMDB : While a distinguished astronomer is giving a lecture in a planetarium, a shot rings out and one of the audience members is found dead. A tough detective and a brassy female reporter lock horns as they both try to break the case.",
      "fileSize": 5157614665,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/death_from_a_distance",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 42742
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sb8nEOtyAYk",
      "id": "sb8nEOtyAYk",
      "title": "Death From a Distance (1935) DETECTIVE",
      "description": "Stars: Russell Hopton, Lola Lane, George F. Marion\n Director: Frank R. Strayer\n\n While a distinguished astronomer is giving a lecture in a planetarium, a shot rings out and one of the audience members is found dead. A tough detective and a brassy female reporter lock horns as they both try to break the case.",
      "addedAt": "2025-12-26T23:54:02.427Z",
      "thumbnail": "https://i.ytimg.com/vi/sb8nEOtyAYk/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLBLGH3jdmB8xSrQLkHA28Vvx80jfw",
      "duration": 4222,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "68 min",
    "imdbRating": 5.2,
    "imdbVotes": 208,
    "Genre": "Mystery, Thriller",
    "Plot": "As the eminent scientist, Dr. Ernst Einfeld, is giving a special lecture on astronomy at the Forest Park Observatory, a shot is fired, killing Dr. Frederick Stone. The police are called by planetarium director Dr. A. M. Trowbridge, and Lieutenant Ted Mallory and Detective Regan quickly arrive. Everyone present at the lecture takes their seats as Mallory questions them and learns that all were invited guests, except for Hayden Amal, a Hindu. When Clay Gorman, Dr. Stone's secretary, claims Stone and Amal had quarreled, Amal is arrested and the others are released. After Mallory questions Kay Palmer, an attractive newspaper reporter, about her age and marital status, he returns to the station and tells his boss \"Chief,\" the district attorney, that Amal is only being held for illegal entry into the country and is not suspected of the murder. As Mallory investigates the backgrounds of possible suspects, he learns that Langsdale, Dr. Trowbridge's assistant, is an ex-convict, formerly known as Fremont, who tried to kill a scientist named Griffith for stealing one of his formulas. Another aid, Morgan, sold Amal his invitation to the lecture, and Einfeld claims to have never met Stone. Kay concocts a story for her newspaper indicating that Einfeld has suspicions as to the identity of the murderer, and Dr. Trowbridge calls Einfeld's hotel at the same time as Einfeld receives a threat on his life. Upon returning to the observatory that evening, Einfeld is heavily guarded, and a gun that had been stolen from him earlier is found on the floor near the giant telescope. Gorman is caught speeding on his way out of town, and Jim Gray, the observatory watchman, goes to the district attorney with evidence that Einfeld did in fact know Stone. Everyone present at the scene of Stone's murder is reassembled at the observatory, and after a shot is heard, Einfeld is found crumpled on the floor near the gun. Mallory excuses everyone from the room except Kay, and Einfeld stands up, alive. A firing mechanism that is activated by the star Arcturus is discovered attached to the telescope, and appears to have been inspired by an exposition at the Chicago World's Fair. After the telescope and firing mechanism are re-set, the suspects are gathered together once more, with Einfeld still playing dead as Mallory reports that Einfeld committed suicide after killing Stone. Mallory then reviews his reasons for suspecting Gorman, Morgan and Langsdale, who was under investigation because Mallory discovered that Stone had once gone by the name Griffith, the scientist whom Langsdale had attempted to murder. Jim's evidence, however, was clearly faked, and Mallory declares that he shot Stone for letting his son die in an operation. Jim is killed when his own device in the telescope fires again. As the guests file out, Einfeld gives a private astronomy lecture to Mallory and Kay, and then leaves them in the darkness of the planetarium.",
    "Director": "Frank R. Strayer",
    "Writer": "John W. Krafft",
    "Actors": "Russell Hopton, Lola Lane, George F. Marion",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026230",
    "tt0025169",
    "tt0026882",
    "tt0024727",
    "tt0026740",
    "tt0027136",
    "tt0026975",
    "tt0026029",
    "tt0026868",
    "tt0026971",
    "tt0023236",
    "tt0023187"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.606Z"
}