{
  "movieId": "tt0011916",
  "title": "All Dolled Up",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AllDolledUpArc",
      "id": "AllDolledUpArc",
      "title": "\"All Dolled Up\" (1921)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   We have included this film in our program to illustrate the work and contributions of Florence Turner, a star of Silent Hall of Fame. \"All Dolled Up\" is a comedy-drama. A simple girl shows her true character in dramatic events that can change her social status. Directed by               Rollin S. Sturgeon Produced by             Universal Film Manufacturing Company Scenario                     A.P. Younger Based on                    a screen story by John Colton Starring                     Gladys Walton, Edward Hearn, Florence Turner, Fred Malatesta Cinematography        Alfred Gosden Distributed by           Universal Film Manufacturing Company Release date               March 1921 Running time             47 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 84407795,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AllDolledUpArc",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 3480
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "50 min",
    "imdbRating": 5.9,
    "imdbVotes": 102,
    "Genre": "Comedy",
    "Plot": "Spinster heiress Eva Bundy, who is in love with Rodolpho, a swindler after her money, is saved by cashier Maggie Quick from being robbed in a department store. When a jealous rival presents evidence of Rodolpho's previous marriage, Eva is heartbroken and sends her elegant wardrobe to Maggie as a reward. In escaping from an unwelcome admirer, Maggie meets James Montgomery Johnson, whom she believes to be an aristocrat; actually, he is Eva's chauffeur. Together they succeed in averting a blackmail plot against Miss Bundy, and as a result she adopts the couple, who then decide to marry.",
    "Director": "Rollin S. Sturgeon",
    "Writer": "John Colton, Andrew Percival Younger",
    "Actors": "Gladys Walton, Edward Hearn, Richard Norton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0381908",
    "tt0012701",
    "tt0012224",
    "tt0012253",
    "tt0012353",
    "tt0012465",
    "tt0012468",
    "tt0012499",
    "tt0012570",
    "tt0011984",
    "tt0012255",
    "tt0012278"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}