{
  "movieId": "tt0046001",
  "title": "The Limping Man",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheLimpingMan",
      "id": "TheLimpingMan",
      "title": "The Limping Man",
      "description": "World War II vet Frank Pryor (Lloyd Bridges) returns to London from America after six years to look up an old flame, Pauline French (Moira Lister), now a successful actress. As he and the other passengers deplane and walk across to the terminal, Frank pauses for a moment and asks the man beside him for a light. There's a gunshot and the man crumples to the ground, shot by a marksman with a high-powered rifle, an assassin with a limp. It's not long before Frank Pryor is up to his neck in murderous intrigue.",
      "fileSize": 1845637835,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheLimpingMan",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 125315
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "76 min",
    "imdbRating": 5.6,
    "imdbVotes": 736,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "American Frank Pryor (Lloyd Bridges)) arrives in London to take up an interrupted romance with Pauline French (Moira Lister), whom he hasn't seen in six years. At the airport a man standing alongside Pryor is slain by an unseen sniper, and he is detained by Scotland Yard for questioning. Released, he goes to Pauline's apartment, and learns that she had an intimate association with the slain man and is not interested in talking about it. Scotland Yard also knows this and Pryor and Pauline are kept under surveillance. After complications involving the dead man's wife, it is found that the man Pauline knows isn't dead at all and isn't who he is supposed to be.",
    "Director": "Cy Endfield",
    "Writer": "Ian Stuart Black, Reginald Long, Anthony Verney",
    "Actors": "Lloyd Bridges, Moira Lister, Alan Wheatley",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043075",
    "tt0051713",
    "tt0043066",
    "tt0045533",
    "tt0045566",
    "tt0045631",
    "tt0046187",
    "tt0045564",
    "tt0045825",
    "tt0045877",
    "tt0046514",
    "tt0045555"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}