{
  "movieId": "tt0052270",
  "title": "A Tale of Two Cities",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-tale-of-two-cities-1958",
      "id": "a-tale-of-two-cities-1958",
      "title": "A Tale of Two Cities (1958)",
      "description": "Set against the conditions leading up to the French Revolution and the Reign of Terror, French doctor Alexandre Manette serves an 18-year imprisonment in the Bastille in Paris, followed by his release to live in London with the daughter he has never met. Watch on RetroFlix:  https://retroflix.org/a-tale-of-two-cities-1958/",
      "fileSize": 335965038,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-tale-of-two-cities-1958",
      "language": "eng",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 121
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "117 min",
    "imdbRating": 7.1,
    "imdbVotes": 1647,
    "Genre": "Drama, History, Romance",
    "Plot": "During the French Revolution, French national Lucie Manette (Dorothy Tutin) meets and falls in love with Englishman Charles Darnay (Paul Guers). He is, however, hiding his true identity as a member of the French aristocratic Evrémonde family, whom he has denounced in private. The Marquis St. Evrémonde (Sir Christopher Lee) in particular was a cruel man. Those he wronged have vowed to see the end of the family line at any cost. Lucie's father Dr. Alexandre Manette (Stephen Murray) was imprisoned in the Bastille for eighteen years because of actions of the Marquis. Into their lives comes English barrister Sydney Carton (Sir Dirk Bogarde), who enjoys his alcohol to excess. Carton earlier defended Darnay in a trial on trumped up charges of treason. Carton doesn't really like Darnay in part because Carton also loves Lucie, he realizing that that love is unrequited. But Carton does eventually learn of Darnay's true heritage at a critical time. Carton takes extraordinary measures to ensure Lucie's happiness during this time, which has the potential to be explosive if others also found out about Darnay's true identity.",
    "Director": "Ralph Thomas",
    "Writer": "Charles Dickens, T.E.B. Clarke",
    "Actors": "Dirk Bogarde, Dorothy Tutin, Cecil Parker",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0050225",
    "tt0056696",
    "tt0049870",
    "tt0054476",
    "tt0053354",
    "tt0027727",
    "tt0051429",
    "tt0051476",
    "tt0035294",
    "tt0051987",
    "tt0012532",
    "tt0014854"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}