{
  "movieId": "tt0042229",
  "title": "The Baron of Arizona",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tboa554609",
      "id": "tboa554609",
      "title": "The Baron of Arizona",
      "description": "Title: The Baron of Arizona Summary: Master swindler James Reavis painstakingly spends years forging documents and land grants that will make his wife and him undisputed owners of the entire state of Arizona. Directed by: Samuel Fuller Actors: Vincent Price, Ellen Drew, Vladimir Sokoloff Production Company: Deputy Corporation Release Date: 4 March 1950 (USA) Aspect Ratio: 1.37 : 1 The U.S. government recognizes land grants made when the West was under Spanish rule. This inspires James Reavis to forge a chain of historical evidence that makes a foundling girl the Baroness of Arizona. Reavis marries the girl and presses his claim to the entire Arizona territory.",
      "fileSize": 722083173,
      "addedAt": "2026-01-07T00:11:46.528Z",
      "thumbnail": "https://archive.org/services/img/tboa554609",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 2947
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-baron-of-arizona-1950",
      "id": "the-baron-of-arizona-1950",
      "title": "The Baron of Arizona (1950)",
      "description": "The U.S. government recognizes land grants made when the West was under Spanish rule. This inspires James Reavis to forge a chain of historical evidence that makes a foundling girl the Baroness of Arizona. Reavis marries the girl and presses his claim to the entire Arizona territory. Watch on RetroFlix:  https://retroflix.org/the-baron-of-arizona-1950/",
      "fileSize": 1584153407,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-baron-of-arizona-1950",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 101
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "97 min",
    "imdbRating": 6.9,
    "imdbVotes": 2561,
    "Genre": "Biography, Crime, Drama",
    "Plot": "Master swindler James Reavis devotes years to forging documents that will give him claim to the entire state of Arizona. He finds a young girl whom he believes is an orphan and hires a governess to educate her in the manner of the Spanish aristocracy. He invents deceased parents for her whose ancestry can be traced to a mythical Spanish nobleman. He then insinuates himself into a Spanish monastery for three years so he can access its biblioteca which carries the records of Spanish land grants. He later joins a gypsy band to have access to the library of a Spanish noblemen where he can alter duplicate documents. When everything is in place, he marries the now-grown young woman and puts in his claim as her husband as the Baron of Arizona.",
    "Director": "Samuel Fuller",
    "Writer": "Samuel Fuller, Homer Croy",
    "Actors": "Vincent Price, Ellen Drew, Vladimir Sokoloff",
    "Language": "Spanish, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0046187",
    "tt0048182",
    "tt0052713",
    "tt0058390",
    "tt0041269",
    "tt0100234",
    "tt0050155",
    "tt0054102",
    "tt0041437",
    "tt0042609",
    "tt0055798",
    "tt0123066"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.532Z"
}