{
  "imdbId": "tt0049468",
  "title": "Man Beast",
  "year": 1956,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bgzaK254s4g",
      "id": "bgzaK254s4g",
      "title": "Man Beast (1956) PSYCHOTRONIC",
      "description": "It's Friday@PizzaFLIX\nDirector: Jerry Warren (Pauper of Trashcan Cinema)\nStars: Virginia Maynor (former Mrs. “Kookie” Byrnes), Ray Corrigan (unconfirmed), Rock Madison (?)\n\n “Hair-raising excitement in the icy lair of giant man-like creatures that roam the roof of the world!” Sounds like we got ourselves a true-to-life YETI MOVIE!  Featured in Michael J. Weldon's Psychotronic Encyclopedia of Film, an 815-page compilation of mini-reviews of over 3,000 cult films.-- PizzaFLIX\n\nFACTS: The Yeti is a giant bipedal creature purported to inhabit the Himalayan mountain range in Asia. In Western pop culture, this hairy beast is most commonly referred to as the Abominable Snowman. Its North American cousin is known as Big Foot.\n\nTRIVIA: The monster suit was originally used in the 1945 movies \"The White Gorilla\" and \"White Pongo,\" both played by former action star Ray Corrigan.\n\nMYSTERY: Although Rock Madison is given top billing for playing the role \"Lon Raynon,\" there is no character of that name in the film. Could he be the Sixth mountain climber of this 5-party Himalayan expedition?",
      "addedAt": "2025-12-24T01:08:30.881Z",
      "thumbnail": "https://i.ytimg.com/vi/bgzaK254s4g/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBpFgq8ay6enjEuQxfj9Sx_XnXVxA",
      "duration": 3790,
      "language": "en",
      "year": 1956,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "67 min",
    "imdbRating": 4.2,
    "imdbVotes": 651,
    "Genre": "Horror, Sci-Fi",
    "Plot": "Connie Hayward mounts an expedition into the Himalayan Mountains looking for her brother, who has not returned from a previous trek trying to locate the Yeti, or \"Abominable Snowman\". Arriving at her brother's last-known camp Connie and her companions find only a strange old guide, Varga. They are soon attacked by gigantic Snowmen but are not half as surprised as when Vargas reveals his secret origin and the plans he has for Connie.",
    "Director": "Jerry Warren",
    "Writer": "B. Arthur Cassidy",
    "Actors": "Rock Madison, Asa Maynor, George Skaff",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0407696",
    "tt0051064",
    "tt0197521",
    "tt0049370",
    "tt0049363",
    "tt0049900",
    "tt0049366",
    "tt0049103",
    "tt0049248",
    "tt0053944",
    "tt0050177",
    "tt0050723"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:39:39.515Z"
}