{
  "movieId": "tt0047298",
  "title": "One Good Turn",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/one-good-turn",
      "id": "one-good-turn",
      "title": "One Good Turn",
      "description": "Norman is the oldest orphan at Greenwood Children's Home and now acts as their caretaker. All the orphans are very happy and well cared for. The adventures start when a nasty property developer (boo hiss) who is also the chairman of the orphanage board wants to close the orphanage and build a factory on the site. The children are sent to Brighton for the day and Norman is very excited because he's \"Never seen the Sea\". When they get back they discover the plan to close the orphanage and have to decide what to do.",
      "fileSize": 7273769772,
      "addedAt": "2026-01-07T00:10:02.902Z",
      "thumbnail": "https://archive.org/services/img/one-good-turn",
      "language": "eng",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 1048
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 6.5,
    "imdbVotes": 683,
    "Genre": "Comedy",
    "Plot": "Norman is the oldest orphan at Greenwood Children's Home and now acts as their caretaker. All the orphans are very happy and well cared for. The adventures start when a nasty property developer (boo hiss!) who is also the chairman of the orphanage board wants to close the orphanage and build a factory on the site. The children are sent to Brighton for the day and Norman is very excited because he's \"never seen the sea\". When they get back, they discover the plan to close the orphanage and must decide what to do.",
    "Director": "John Paddy Carstairs",
    "Writer": "John Paddy Carstairs, Sid Colin, Maurice Cowan",
    "Actors": "Norman Wisdom, Joan Rice, Shirley Abicair",
    "Language": "English, German",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0048346",
    "tt0050580",
    "tt0046464",
    "tt0052233",
    "tt0044864",
    "tt0048700",
    "tt4887484",
    "tt0047900",
    "tt0048001",
    "tt0048018",
    "tt0048188",
    "tt0048290"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.902Z"
}