{
  "movieId": "tt0038640",
  "title": "The Inner Circle",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Inner_Circle_1946",
      "id": "Inner_Circle_1946",
      "title": "The Inner Circle",
      "description": "A low-budget private-detective movie from Republic.",
      "fileSize": 2032995052,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/Inner_Circle_1946",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 15948
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tbJQLIPdGjY",
      "id": "tbJQLIPdGjY",
      "title": "The Inner Circle (1946) | Colorized Public Domain Film Noir Mystery with Adele Mara & Warren Douglas",
      "description": "The Inner Circle (1946) is an American film noir mystery directed by Philip Ford, produced by Republic Pictures during the post-war crime cinema boom. This restored and colorized public domain classic revives a tense detective story that blends hard-boiled suspense, femme fatale intrigue, and 1940s Los Angeles atmosphere. By presenting it in colorized form, modern viewers across the United States, Europe, and beyond can rediscover its visual grit, sharp dialogue, and noir mood that defined mid-century American mystery filmmaking.\n\nPlot Summary:\nPrivate detective Johnny Strange (Warren Douglas) runs the Action Incorporated agency, where cases rarely come easy and clients often bring trouble. When a mysterious woman named Gerry Smith (Adele Mara) appears at his office, she hires him to find a missing person. But what seems like a routine case quickly spirals into deceit, murder, and betrayal. As Johnny follows the trail through smoky clubs and shadowy streets, he realizes he’s caught between the police, gangsters, and a woman whose motives are anything but innocent.\n\nWhen a corpse appears connected to his client, Johnny becomes the prime suspect in a web of lies that tests his instincts and morality. With the help of his loyal secretary, Hazel (Adele Rowland), he must outsmart both criminals and law enforcement to uncover the truth. The film’s tight pacing and witty exchanges create a suspenseful rhythm that captures the essence of the 1940s detective genre.\n\nCast and Crew:\n• Director: Philip Ford\n• Producer: Rudolph E. Abel\n• Screenplay: Jerome Gruskin and Mortimer Braus\n• Based on: Original story by George Callahan\n• Cinematography: Reggie Lanning\n• Editing: Ralph Dixon\n• Music: Mort Glickman\n\nStarring:\n• Warren Douglas as Johnny Strange\n• Adele Mara as Gerry Smith\n• William Frawley as Lt. Webb\n• Ricardo Cortez as Duke York\n• Frank Wilcox as Inspector\n• Ken Niles as Radio Announcer\n• Robert Dudley as Desk Clerk\n• Adele Rowland as Hazel\n\nFilm Significance:\nThe Inner Circle stands as a textbook example of the low-budget yet stylish crime thrillers that flourished after World War II. Its noir elements—moral ambiguity, sharp lighting contrasts, cynical detectives, and seductive women—make it a vital snapshot of the genre’s rise before television crime dramas took over. Adele Mara’s performance adds a seductive tension that defined post-war noir femininity, while Warren Douglas brings gritty charm to the archetype of the flawed but decent detective.\n\nRepublic Pictures, known for efficient and fast-paced production, gave this film a distinct working-class energy, lacking the polish of major studios but compensating with authentic atmosphere and realism. King lighting, shadow angles, and dialogue pacing show how low-budget noir mastered storytelling through restraint.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Hoosier Schoolboy remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1946 release was shot in black and white to emphasize shadow and contrast—core elements of the noir style. In this colorized restoration, subtle tones enhance visual detail without losing the film’s gritty atmosphere. The Los Angeles backdrops, trench coats, smoke-filled rooms, and classic automobiles gain depth for today’s high-resolution screens, particularly for TV viewers in the United States and Europe who favor cinematic texture and visual authenticity.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheInnerCircle #FilmNoir #AdeleMara #WarrenDouglas #PhilipFord #PublicDomainMovie #ColorizedClassic #1940sMystery #RepublicPictures #ClassicCinema #NoirDetective #GoldenAgeHollywood #CrimeThriller #VintageHollywood",
      "addedAt": "2025-12-24T00:49:37.425Z",
      "thumbnail": "https://i.ytimg.com/vi/tbJQLIPdGjY/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYRiBUKGUwDw==&rs=AOn4CLARgt2UkqHnxbeBKVgTJOSRA6de4Q",
      "duration": 3326,
      "language": "en",
      "year": 1946,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2TxEUkfuAsg",
      "id": "2TxEUkfuAsg",
      "title": "The Inner Circle (1946) DETECTIVE",
      "description": "Stars: Adele Mara, Warren Douglas, William Frawley\n Director: Philip Ford\n\n A private detective finds himself with a perfect new secretary. But after a notorious gossip columnist turns up murdered, she may prove too good to be true. Co-stars William Frawley best known as Fred Mertz from I Love Lucy!",
      "addedAt": "2025-12-26T23:54:10.456Z",
      "thumbnail": "https://i.ytimg.com/vi/2TxEUkfuAsg/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gOAAoADigIMCAAQARhlIGUoZTAP&rs=AOn4CLC1D5RjvWmlazYY0kkIvOavUSsdQg",
      "duration": 3369,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-V1g6zbsqG8",
      "id": "-V1g6zbsqG8",
      "title": "The Inner Circle (1946) Mystery, Film-Noir, Parody | Full Movie | Subtitles",
      "description": "A private detective finds himself with a perfect new secretary. But after a notorious gossip columnist turns up murdered, she may prove too good to be true.\n\nDirector: Philip Ford \nWriters: Dorrell McGowan, Stuart E. McGowan \nStars: Adele Mara, Warren Douglas, William Frawley\nGenres: Classics, Film-Noir, Mystery\n\n00:00 Full Movie\n01:35 👨‍💼 Johnny Strange of Action Incorporated places an ad for a female secretary and hires Geraldine Smith.\n06:18 🤔 A conversation between two individuals about a mysterious meeting and payment.\n14:00 🕵️ John is accused of having something to hide by Anthony Fitch and his secretary, Geraldine Smith, witnesses the conversation from outside the window.\n18:21 🔒 A self-defense story and the consequences of obstructing justice.\n21:58 🔍 Discussing Fitch's beliefs on marriage and a suspicious woman\n29:19 🎵 Rhoda encounters a stranger in her dressing room who claims to know her and asks about Anthony Fitch.\n33:36 🔍  Discussing a crime and a potential witness.\n37:48 🔎 Discovers Fitch had an item in his next broadcast, which he believes was the motive for Fitch's murder, but they are unable to find it in his study.\n47:27 ✈️ Mrs. Lowe is in a hurry to catch a plane and leaves her sister and Mr. Strange behind with Mr. Webb, who apologizes for not being able to release them.\n52:12🎤 Rhoda Roberts denies knowing Fitch well and claims their interactions were strictly business.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:49:29.213Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/-V1g6zbsqG8/maxresdefault.webp?v=6530d4b6",
      "duration": 3369,
      "language": "en",
      "year": 1946,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "57 min",
    "imdbRating": 6,
    "imdbVotes": 523,
    "Genre": "Crime, Film-Noir, Mystery",
    "Plot": "Before he can finish placing his help-wanted ad over the phone, the perfect candidate shows up at the office of Johnny Strange and fills the position of secretary without even giving Johnny a chance to say yes. She immediately takes the call from a new client, a mysterious woman with a Spanish accent. When Johnny meets her, the client is dressed all in black and wearing a heavy veil that conceals her face. She takes him to a house with a corpse lying in it, and asks him to take care of it. Before Johnny can call the police she knocks him unconscious with a bookend. He wakes up to see Det. Lt. Webb, who tells him the dead man is a notorious gossip columnist with a popular radio program. A nightclub manager, a singer, a housekeeper, a hard-of-hearing groundskeeper and two beautiful blondes are among the whos who may have done it.",
    "Director": "Philip Ford",
    "Writer": "Dorrell McGowan, Stuart E. McGowan, Leonard St. Clair",
    "Actors": "Adele Mara, Warren Douglas, William Frawley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038683",
    "tt0274965",
    "tt0038431",
    "tt0038768",
    "tt0038828",
    "tt0038958",
    "tt0037691",
    "tt0039439",
    "tt0037752",
    "tt0038110",
    "tt0039972",
    "tt0037985"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}