{
  "imdbId": "tt0047200",
  "title": "The Mad Magician",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-mad-magician-1954",
      "id": "the-mad-magician-1954",
      "title": "The Mad Magician (1954)",
      "description": "The Mad Magician is a 1954 American horror film directed by John Brahm starring Vincent Price, Mary Murphy and Eva Gabor. It follows Don Gallico, a master illusionist who, after being betrayed by his employer and losing his wife to him, seeks revenge by murdering the man who wronged him. Disguised as a rival magician, he continues to perform while trying to cover up his crimes, leading to a series of dark and thrilling events.",
      "fileSize": 1914776794,
      "addedAt": "2026-01-07T00:12:10.592Z",
      "thumbnail": "https://archive.org/services/img/the-mad-magician-1954",
      "language": "eng",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 351
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 6.5,
    "imdbVotes": 2484,
    "Genre": "Drama, Horror",
    "Plot": "Don Gallico is a master at devising magicians' illusions and tries to establish his own stage show as Gallico the Great. His performance is interrupted mid-show by his employer Ross Ormond who has obtained a court injunction to stop him. Gallico had long ago signed an exclusive contract with Ormond to provide him with any illusions he might create. Gallico sets out to get his revenge against those who have wronged him, including Ormond, his ex-wife Claire, who happens to be Ormnond's wife and magician The Great Rinaldi who is Ormond's business partner and the main beneficiary or Gallico's new magic tricks. A clever young detective, Lt. Alan Bruce, uses a new identification technique, fingerprints, to identify the killer.",
    "Director": "John Brahm",
    "Writer": "Crane Wilbur",
    "Actors": "Vincent Price, Mary Murphy, Eva Gabor",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037761",
    "tt0047872",
    "tt0047470",
    "tt0047976",
    "tt0045826",
    "tt0051622",
    "tt0049900",
    "tt0049366",
    "tt0049248",
    "tt0039217",
    "tt0047205",
    "tt0053925"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}