{
  "imdbId": "tt0034613",
  "title": "The Corpse Vanishes",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheCorpseVanishes",
      "id": "TheCorpseVanishes",
      "title": "The Corpse Vanishes",
      "description": "A newspaper reporter begins to investigate after a series of brides die suddenly during their wedding. Her quest leads her to the secret of eternal youth and almost gets her killed. You can find more information regarding this film on its IMDb page .",
      "fileSize": 2804614728,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheCorpseVanishes",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 138012
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/corpse4k",
      "id": "corpse4k",
      "title": "The Corpse Vanishes (1942) [Colorized, 4K, 60FPS]",
      "description": "The Corpse Vanishes is a 1942 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com    Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io    A.I. Upscaling to 4K:  https://ffmpeg.org    GPU: Google Colab.  This movie is in public domain category and it is Copyright free.",
      "fileSize": 4704580372,
      "addedAt": "2026-01-07T00:07:51.625Z",
      "thumbnail": "https://archive.org/services/img/corpse4k",
      "collection": "feature_films",
      "downloads": 251
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ygr-Pb9WlQg",
      "id": "ygr-Pb9WlQg",
      "title": "The Corpse Vanishes (1942) | Colorized Public Domain Horror with Bela Lugosi Classic Thriller",
      "description": "The Corpse Vanishes (1942) is a public domain American horror mystery directed by Wallace Fox and starring Bela Lugosi in one of his chilling mid-career performances. This restored and colorized edition brings new life to a cult horror classic from Monogram Pictures, allowing modern audiences across the United States, Europe, and beyond to experience the eerie suspense of 1940s low-budget Gothic cinema with fresh vibrancy.\n\nPlot Summary:\nA series of mysterious deaths occurs when young brides collapse at the altar on their wedding day. Their bodies, strangely preserved with no signs of decay, are secretly stolen by a sinister scientist, Dr. Lorenz (Bela Lugosi). Obsessed with preserving the beauty of his aging wife, Countess Lorenz (Elizabeth Russell), the doctor extracts fluids from the bodies of these young women to keep her youth intact. Reporter Patricia Hunter (Luana Walters), suspicious of the bizarre events, investigates the case. Her search leads her to the Lorenz mansion, where she discovers a twisted world of corruption, obsession, and macabre science. With the help of her colleague and a determined sense of justice, Patricia risks her life to expose Lorenz’s monstrous crimes before more innocent lives are taken.\n\nThe Corpse Vanishes reflects the hallmarks of 1940s B-horror films: eerie Gothic mansions, mad scientists, helpless victims, and a blend of mystery and suspense. While modest in budget, its unsettling premise and Bela Lugosi’s commanding presence have cemented it as a cult favorite among horror enthusiasts.\n\nCast and Crew:\n• Director: Wallace Fox\n• Screenplay: Harvey Gates\n• Producer: Sam Katzman\n• Cinematography: Robert E. Cline\n• Editing: Holbrook N. Todd\nStarring:\n• Bela Lugosi as Dr. Lorenz\n• Luana Walters as Patricia Hunter\n• Tristram Coffin as Dr. Foster\n• Elizabeth Russell as Countess Lorenz\n• Angelo Rossitto as Toby\n• Minerva Urecal as Fagah\n• Vince Barnett as Sandy, the Photographer\n• Joan Barclay as Alice Wentworth\n\nFilm Significance:\n“The Corpse Vanishes” exemplifies Monogram Pictures’ formula of low-budget yet memorable horror cinema. Bela Lugosi, once the star of Dracula (1931), was often cast in such roles during the 1940s as he shifted from Universal’s big productions to Poverty Row studios. Despite its limitations, the film has endured as a fascinating piece of horror history. Its themes of vanity, mortality, and obsession resonate with audiences even decades later. Lugosi’s haunting performance, coupled with eerie set design and unsettling atmosphere, make it one of the more memorable Poverty Row horror releases.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Corpse Vanishes remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1942 release was filmed in black and white, standard for low-budget horror of its time. While authentic to the era, many modern viewers pass over monochrome films. Our colorized edition bridges historical authenticity with contemporary viewing preferences, making the eerie atmosphere of Bela Lugosi’s performance more vivid and immersive.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten horror thrillers to culturally significant dramas. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheCorpseVanishes #BelaLugosi #1940sHorror #PublicDomainMovie #ColorizedClassic #ClassicHorror #FilmRestoration #GoldenAgeHollywood #MonogramPictures #CultHorror",
      "addedAt": "2025-12-24T00:48:38.952Z",
      "thumbnail": "https://i.ytimg.com/vi/ygr-Pb9WlQg/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBdKFEwDw==&rs=AOn4CLCUiQdunOmqca9MqNk7fD5AuhN7Gw",
      "duration": 3744,
      "language": "en",
      "year": 1942,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-corpse-vanishes-1942",
      "id": "the-corpse-vanishes-1942",
      "title": "The Corpse Vanishes (1942)",
      "description": "A scientist keeps his wife young by killing, stealing the bodies of, and taking the gland fluid from virgin brides. Watch on RetroFlix:  https://retroflix.org/the-corpse-vanishes-1942/",
      "fileSize": 1288455363,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-corpse-vanishes-1942",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 122
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-corpse-vanishes-1942-bela-lugosi-horror-sci-fi-full-length-movie",
      "id": "the-corpse-vanishes-1942-bela-lugosi-horror-sci-fi-full-length-movie",
      "title": "The Corpse Vanishes (1942) Bela Lugosi Horror, Sci Fi",
      "description": "Dr. George Lorenz (Bela Lugosi) and his wife (Elizabeth Russell) are getting on in years, but they've thought of a way to thwart aging. Lorenz abducts a nubile bride-to-be, Alice (Joan Barclay), and plans to extract her valuable bodily fluids to inject into his wife, restoring her health and vitalit y. Journalist Patricia Hunter (Luana Walters) is investigating the case of the missing bride, but, when the trail leads her to Lorenz, she doesn't realize she's in danger of becoming his next victim.",
      "fileSize": 1288462398,
      "addedAt": "2026-01-07T00:11:57.683Z",
      "thumbnail": "https://archive.org/services/img/the-corpse-vanishes-1942-bela-lugosi-horror-sci-fi-full-length-movie",
      "collection": "feature_films",
      "downloads": 2272
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HoisrKEgFp0",
      "id": "HoisrKEgFp0",
      "title": "The Corpse Vanishes (1942) BELA LUGOSI",
      "description": "Stars: Bela Lugosi, Luana Walters, Tristram Coffin\nDirector: Wallace Fox\n\nA scientist, aided by an old hag & her two sons - a malicious dwarf and a brutish moron, kills virgin brides, steals their bodies, & extracts gland fluid to keep his ancient wife alive and young.",
      "addedAt": "2025-12-26T23:56:36.480Z",
      "thumbnail": "https://i.ytimg.com/vi/HoisrKEgFp0/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDzjDHrN8Jnufsuh_7mD854I7lTQA",
      "duration": 3790,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": 4.6,
    "imdbVotes": 3653,
    "Genre": "Horror, Sci-Fi",
    "Plot": "Dr. Lorenz, a mad scientist, wants to keep his elderly wife young. He does this by kidnapping young females and extracting fluid from them. He then injects this fluid into his wife.",
    "Director": "Wallace Fox",
    "Writer": "Sam Robins, Gerald Schnitzer, Harvey Gates",
    "Actors": "Bela Lugosi, Luana Walters, Tristram Coffin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035640",
    "tt0032390",
    "tt0034546",
    "tt0031951",
    "tt0036125",
    "tt0037084",
    "tt0032245",
    "tt0032753",
    "tt0036999",
    "tt0044406",
    "tt0034521",
    "tt0024188"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.683Z"
}