{
  "movieId": "tt0024449",
  "title": "Picture Brides",
  "year": 1934,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=v5oBqpsyv5Q",
      "id": "v5oBqpsyv5Q",
      "title": "Picture Brides (1934) CRIME-ADVENTURE",
      "description": "Stars: Dorothy Mackaill, Regis Toomey, Alan Hale \n Director: Phil Rosen\n\nTwo guys on the lam take off for the jungles of Brazil. They go to work in a diamond mine, and \"order\" mail-order brides. When the young women get to their destination, they find out that everything isn't quite what it's cracked up to be!",
      "addedAt": "2025-12-26T23:54:00.893Z",
      "thumbnail": "https://i.ytimg.com/vi/v5oBqpsyv5Q/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhaIFooWjAP&rs=AOn4CLBwfF4WoRwFh33At71VuLGBMcG7CA",
      "duration": 3536,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "66 min",
    "imdbRating": 5.8,
    "imdbVotes": 103,
    "Genre": "Adventure, Crime, Music",
    "Plot": "Four \"Picture Brides\", from New Orleans, arrive in the Brazilian jungle on a riverboat, brought there to marry workers at Lottagrasso, a remote mining site of the Standard Diamond Mines.Also on the boat with the four \"mail-order\" brides (Americans Mame Smith, Flo Lane, and Gwen from England and Lena from Europe) is Mary Lee, a frightened and innocent girl, who has come to see the mine's brutal supervisor, Von Luden , about a job. Knowing von Luden's inhuman reputation, Mame transfers the photo assigning her to Dave Hart, to Mary's Identification card. Castro, the mail-runner, delivers a letter to von Luden informing him that Hart, his partner, is wanted in the United States on an embezzlement charge. Mame, in order to protect Mary, presents herself as a job applicant while Mary is introduced to Dave and his fellow supervisors (Pete, Joe and Bill) as a bride applicant. Dave rescues Mary from a lustful and brutish attack by von Luden. Pretty Mataeo Rogers, half-breed daughter of the camp's drunken doctor, is celebrating her 18th birthday and is lured to von Luden's jungle castle. Later, natives find her body in the swamp. Detectives Steve and Al arrive to extradite Dave.",
    "Director": "Phil Rosen",
    "Writer": "Adele Buffington, Will Ahern, Charles E. Blaney",
    "Actors": "Dorothy Mackaill, Regis Toomey, Dorothy Libaire",
    "Language": "Spanish, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0024605",
    "tt0026131",
    "tt0024443",
    "tt0029054",
    "tt0029066",
    "tt0034117",
    "tt0026003",
    "tt0023096",
    "tt0027568",
    "tt0027807",
    "tt0027974",
    "tt0027398"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T01:59:07.624Z"
}