{
  "imdbId": "tt0040653",
  "title": "North of the Border",
  "year": 1946,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IIdJ00xBXUg",
      "id": "IIdJ00xBXUg",
      "title": "North of the Border (1946) RUSSELL HAYDEN🍕 COWBOY WESTERN",
      "description": "Stars: Russell Hayden, Inez Cooper, Douglas Fowley\nDirector: B. Reeves Eason\n\nGet ready for action, suspense, and classic Western justice in this 1946 frontier thriller starring Russell Hayden, Inez Cooper, and Douglas Fowley. Directed by veteran filmmaker B. Reeves Eason, this gripping tale takes viewers beyond the U.S. frontier and deep into the wilds of Canada, where betrayal and murder ride alongside honor and loyalty.\n\nWhen an American rancher is falsely accused of murdering his business partner north of the border, he must go on the run and track down the real killer to clear his name. Packed with tense confrontations, dramatic twists, and rugged landscapes, this Classic Western delivers everything fans love—justice on horseback, outlaws, and a hero who won’t back down.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPresented by PizzaFLIX, this vintage gem is a must-watch for fans of Cowboy Westerns, 1940s Westerns, and Russell Hayden films. With strong performances from Inez Cooper and Douglas Fowley, and tight direction from B. Reeves Eason, it’s a forgotten treasure from Hollywood’s golden era.\n\nHit like, drop a comment, and subscribe for more timeless Western adventures restored for today’s audience!\n\n#RussellHayden #ClassicWesterns #CowboyMovies #InezCooper #DouglasFowley #BReevesEason #PizzaFLIX #VintageWesterns #OldWesternMovies #1940sWesterns #WesternMystery",
      "addedAt": "2025-12-24T01:03:18.564Z",
      "thumbnail": "https://i.ytimg.com/vi/IIdJ00xBXUg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBoSp46Cr3a61sq30pFt6xAhqv5Qg",
      "duration": 2515,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "45 min",
    "imdbRating": 7.2,
    "imdbVotes": 50,
    "Genre": "Western",
    "Plot": "Rancher \"Utah\" Neyes crosses the border into Canada to meet his partner, only to find that the latter has been murdered by a gang led by \"Nails\" Nelson. \"Utah\", with the aid of RCMP Jack Craig and fur-trapper Ivy Jenkins, manages to clear his own name of suspicion and also break up Nelson's fur-stealing and smuggling racket.",
    "Director": "B. Reeves Eason",
    "Writer": "James Oliver Curwood, Arthur V. Jones",
    "Actors": "Russell Hayden, Inez Cooper, Douglas Fowley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038277",
    "tt0041811",
    "tt0028163",
    "tt0039782",
    "tt0038284",
    "tt0038593",
    "tt0038611",
    "tt0038877",
    "tt0038968",
    "tt0038979",
    "tt0038499",
    "tt0038762"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:29.330Z"
}