{
  "imdbId": "tt0013825",
  "title": "All for Money",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-all-for-money",
      "id": "silent-all-for-money",
      "title": "All for Money",
      "fileSize": 1731594465,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-all-for-money",
      "language": "German",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 480
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "83 min",
    "imdbRating": 5.2,
    "imdbVotes": 19,
    "Genre": "Drama",
    "Plot": "Rupp (Jannings) is a former butcher, made rich in the meat packing industry as a result of the reversal of fortunes brought on by WWI. He is crude, uncouth and uneducated. His son, Fred, is the apple of his father's eye and is an auto enthusiast. The widowed Rupp falls in love with a former aristocrat, Helen, now down on her luck and pawning her last heirloom. He proposes marriage and she accepts in order to save her ailing mother who needs a monetary influx to avoid death. Her former boyfriend, Platen, warns Helen against Rupp's intentions - he and Rupp are enemies, Rupp having caused his being fired for protecting a chorus girl against Rupp's unwanted advances. Meanwhile, Graf, a shyster, arranges purchase of a near bankrupt auto manufacturing firm, Phoenix, to Rupp's great advantage with practically no monetary recognition to Graf, who swears revenge. Rupp comes upon his son begging Helen not to marry his father but to return to Platen. Rupp misinterprets the scene, thinks his son is after his intended, and banishes him. The last twenty minutes involve an auto race and its aftermath. Fred unknown to all becomes the driver of his father's rival auto maker. Platen is driving for Rupp's firm, Phoenix. In order to win, Rupp has bribed Graf to make sure his rival won't.",
    "Director": "Reinhold Schünzel",
    "Writer": "Hanns Kräly, Rudolf Stratz",
    "Actors": "Emil Jannings, Hermann Thimig, Dagny Servaes",
    "Language": "None, German",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015064",
    "tt0013741",
    "tt0012092",
    "tt0013841",
    "tt0014112",
    "tt0014440",
    "tt0014606",
    "tt0014249",
    "tt0161953",
    "tt0014463",
    "tt0133813",
    "tt0014014"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}