{
  "imdbId": "tt0022161",
  "title": "Morals for Women",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MoralsForWomen_452",
      "id": "MoralsForWomen_452",
      "title": "Morals for Women",
      "description": "A pre-code melodrama in which a country girl who has been naughty in wicked New York, returns home to put her life back in order. Big mistake, because her reputation as a party girl had preceded her. Stars Bessie Love who played Paula White in \"The Lost World\" 1925, which is available here at IA Directed by Mort Blumenstock Released in 1931 a.k.a. \"Big City Interlude\" & \"Farewell Party\"",
      "fileSize": 734994072,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/MoralsForWomen_452",
      "collection": "feature_films",
      "downloads": 14755
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "65 min",
    "imdbRating": 5.1,
    "imdbVotes": 142,
    "Genre": "Drama",
    "Plot": "Helen Huston is having an affair with her boss, Van Dyne, who puts her up in a swanky apartment where she entertains his clients with ladies to pair them off. Helen's old sweetheart, Paul, gets back in touch with her after making good and wants to marry her if a particular business deal goes through. He's built his life around marrying her. Surprised, she decides to quit her scandalous job and go home so she's no longer in a compromising position, although she's not sure Paul will accept her once he knows about her past. At home, Helen's younger sister is practically engaged to a wealthy man and needs money to go to his family's place over the summer. Helen gives her the cash. Meanwhile, her brother tells her openly that rumors about her are pretty ugly. When he gets into a severe physical fight with someone talking badly of her, she must pay the bully's medical bills or else her brother will go to jail. To pay them, she has to go back to her scandalous life, even if it risks her potential marriage.",
    "Director": "Mort Blumenstock",
    "Writer": "Frances Hyland",
    "Actors": "Bessie Love, Conway Tearle, John Holland",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020959",
    "tt0019729",
    "tt0021635",
    "tt0021649",
    "tt0022836",
    "tt0021820",
    "tt0021770",
    "tt0022021",
    "tt0022149",
    "tt0022206",
    "tt0022418",
    "tt0022436"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}