{
  "movieId": "tt0044916",
  "title": "Monkey Business",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/monkey-business-1952_202507",
      "id": "monkey-business-1952_202507",
      "title": "Monkey Business (1952)",
      "description": "Research chemist Barnaby Fulton works on a fountain of youth pill for a chemical company. One of the labs chimps gets loose in the laboratory and mixes chemicals, but then pours the mix into the water cooler. When trying one of his own samples, washed down with water from the cooler, Fulton begins to act just like a twenty-year-old and believes his potion is working. Soon his wife and boss are also behaving like children. Watch on RetroFlix:  https://retroflix.org/monkey-business-1952/",
      "fileSize": 275909444,
      "addedAt": "2026-01-07T00:09:54.329Z",
      "thumbnail": "https://archive.org/services/img/monkey-business-1952_202507",
      "language": "eng",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 155
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DoubleFeatureHell14monkeyBusiness",
      "id": "DoubleFeatureHell14monkeyBusiness",
      "title": "DOUBLE FEATURE HELL 14 (Monkey Business).",
      "description": "In response to overwhelming public apathy the 2am Theater presents this special wildlife conservation double feature with lots of guys in gorilla suits: The simulated simian adventures begin with coming attractions followed by \"The Gorilla\" with the Ritz Brothers, Bela Lugosi and a guy in a gorilla suit. Who could ask for anything more? (Tough luck, you're getting it anyway.) The intermission short, \"The Chimp,\" features two of our oldest best friends and a guy in a gorilla suit. The second feature presentation is the notorious audience rip-off and unintentionally hilarious \"The White Gorilla\" with TWO guys in gorilla suits. Wow!",
      "fileSize": 2441323994,
      "addedAt": "2026-01-07T00:06:19.369Z",
      "thumbnail": "https://archive.org/services/img/DoubleFeatureHell14monkeyBusiness",
      "collection": "feature_films",
      "downloads": 8532
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "97 min",
    "imdbRating": 6.9,
    "imdbVotes": 16120,
    "Genre": "Comedy, Sci-Fi",
    "Plot": "Barnaby Fulton is a research chemist working on a fountain of youth pill for a chemical company. While trying a sample dose on himself, he accidentally gets a dose of a mixture added to the water cooler and believes his potion is what is working. The mixture temporarily causes him to feel and act like a teenager, including correcting his vision. When his wife gets a dose that is even larger, she regresses even further into her childhood. When an old boyfriend meets her in this state, he believes that her never wanting to see him again means a divorce and a chance for him.",
    "Director": "Howard Hawks",
    "Writer": "Ben Hecht, Charles Lederer, I.A.L. Diamond",
    "Actors": "Cary Grant, Ginger Rogers, Marilyn Monroe",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0045810",
    "tt0041498",
    "tt0032599",
    "tt0044406",
    "tt0044876",
    "tt0046729",
    "tt0046802",
    "tt0018937",
    "tt0044566",
    "tt0058324",
    "tt0041514",
    "tt0043603"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:02:49.263Z"
}