{
  "movieId": "tt0028359",
  "title": "13 Hours by Air",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/13-hours-by-air-1936",
      "id": "13-hours-by-air-1936",
      "title": "13 Hours By Air (1936)",
      "description": "Fred MacMurray, Joan Bennett, Zasu Pitts Directed by Mitchell Leisen",
      "fileSize": 1402333965,
      "addedAt": "2026-01-07T00:06:00.051Z",
      "thumbnail": "https://archive.org/services/img/13-hours-by-air-1936",
      "collection": "feature_films",
      "downloads": 4270
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 6.2,
    "imdbVotes": 197,
    "Genre": "Action, Comedy, Crime",
    "Plot": "Airline pilot Jack Gordon (Fred MacMurray) on a flight from New York to San Francisco, is immediately attracted to beautiful passenger Felice Rollins (Joan Bennett). Known as a \"lady's man\", he bets stewardess Vi Johnson (Ruth Donnelly) that he will take Felice out to dinner that evening. A jewel robbery is in the news and a beautiful blonde is implicated, with Jack suspecting that Felice may be the culprit. On a stop over in Chicago, Jack learns instead that his passenger is a wealthy socialite at odds with another passenger, Count Stephani (Fred Keating). Jack worries that he may have a crisis involving the Count when he finds Stephani has a gun aboard. Other passengers include Dr. Evarts (Brian Donlevy) and Curtis Palmer (Alan Baxter, both of whom seem to be harboring a secret. Felice is trying to get to San Francisco in order to prevent her sister from marrying the Count's brother, but the flight runs into bad weather. Jack and Freddie Scott (John Howard), his co-pilot are persuaded to fly on but are eventually forced to make an emergency landing. Dr. Evarts tells Jack he is a federal agent pursuing Palmer, a notorious criminal, who now takes the opportunity to shoot Freddie and Dr. Everts, commandeering the aircraft. Jack manages to overcome Palmer, and with the help of Felice, is able to take off and fly to San Francisco. When the flight lands, he is able to have his dinner with Felice, collecting his bet, knowing that he will need the money for a marriage licence.",
    "Director": "Mitchell Leisen",
    "Writer": "Bogart Rogers, Frank Mitchell Dazey, Kenyon Nicholson",
    "Actors": "Fred MacMurray, Joan Bennett, Zasu Pitts",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028574",
    "tt0028785",
    "tt0029757",
    "tt0029626",
    "tt0030455",
    "tt0029885",
    "tt0035051",
    "tt0031245",
    "tt0024573",
    "tt0031330",
    "tt0028816",
    "tt0032246"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.051Z"
}