{
  "movieId": "tt0070673",
  "title": "The Severed Arm",
  "year": 1973,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/THESEVEREDARM",
      "id": "THESEVEREDARM",
      "title": "THE SEVERED ARM",
      "description": "No, this isn’t about one of Thing’s relatives.   A group of friends is trapped by a cave-in. Fearful of starvation, they eventually hack off one guy’s arm. But wouldn’t you know it…they’re all rescued just minutes later! Flash ahead five years. The original victim has vanished – and a mysterious someone is killing the other survivors by lopping off their arms in a similar fashion. Who is behind it? And who is next…? “ From the opening moments involving an arm getting hacked off by a burglar in a mortuary, it's clear that this won't be a happy ride for anyone involved. The Severed Arm piles on the atmosphere by taking place mostly at night, with lots of shadowy lighting and isolated characters suffering from paranoia; furthermore, the eerie synthesizer score seethes almost nonstop for the entire running time, creating a constant sense of doom and unease similar to Messiah of Evil. “ The exposition scenes are indisputably a bit monotonous and pokey at times, but the suspense set pieces are actually quite effective including two standout bits involving a disc jockey attacked in his radio station and a pre- Dressed to Kill blood-spattered murder in an elevator. Also, the creepy and claustrophobic twist ending is just fantastic.” http://www.mondo-digital.com/severedarm.html   “The Severed Arm” is available from Desert Island Films, which offers “the oldest, largest and highest quality public domain film library in the world” to clients such as A&E, Warner Brothers, Time-Life and Viacom; as well as from The RetroFilm Vault, “the original and definitive one-stop source for public domain movies and television for broadcast programing or stock footage use. From the heart of movie land, The RetroFilm Vault has the largest virtual catalog for broadcast quality public domain films on the planet.”",
      "fileSize": 1248820221,
      "addedAt": "2026-01-07T00:06:58.270Z",
      "thumbnail": "https://archive.org/services/img/THESEVEREDARM",
      "collection": "feature_films",
      "downloads": 21361
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-severed-arm-full-horror-movie",
      "id": "the-severed-arm-full-horror-movie",
      "title": "The Severed Arm",
      "description": "A man seeks revenge against the starving explorers that devoured his arm while trapped in a cave.",
      "fileSize": 865994759,
      "addedAt": "2026-01-07T00:12:22.159Z",
      "thumbnail": "https://archive.org/services/img/the-severed-arm-full-horror-movie",
      "collection": "feature_films",
      "downloads": 340
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r8PoX2rIeP0",
      "id": "r8PoX2rIeP0",
      "title": "The Severed Arm (1973) SLASHER",
      "description": "Stars: Deborah Walley, Paul Carr, David G. Cannon\nWriter/Director: Thomas S. Alderman\n\nTrapped in a cave, five men cut the arm off of another companion in order to ward off starvation. After they are saved, their victim seeks revenge on them one by one.",
      "addedAt": "2025-12-26T23:57:41.357Z",
      "thumbnail": "https://i.ytimg.com/vi/r8PoX2rIeP0/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_ASAAuADigIMCAAQARhLIEcoWTAP&rs=AOn4CLBjELn8VawNp7eFQM3c-MGCwhddqg",
      "duration": 5452,
      "language": "en",
      "year": 1973,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "91 min",
    "imdbRating": 4.9,
    "imdbVotes": 1150,
    "Genre": "Horror",
    "Plot": "Jeff Ashton recoiled in horror after finding a severed arm inside a package just delivered to his door. It immediately reminded him of what happened five years ago, when he and five of his pals were trapped in a cave inside a desolate mine they'd been exploring. After two weeks and facing starvation, their only option had been to resort of cannibalism in order to survive. Reluctantly they agreed to draw straws and Ted sacrificed a limb so everybody could have a meal. Seconds after cutting off their friend's arm they were rescued and blamed the amputation on the rockfall. The five men swore never to tell anyone what had really happened. Ted said he'd never foget what they'd done to him and vowed revenge.",
    "Director": "Tom Alderman",
    "Writer": "Marc B. Ray, Larry Alexander, Kelly Estill",
    "Actors": "Deborah Walley, Paul Carr, David G. Cannon",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0070222",
    "tt0069838",
    "tt0069933",
    "tt0069994",
    "tt0070654",
    "tt0068481",
    "tt0070908",
    "tt0069715",
    "tt0069855",
    "tt0071508",
    "tt0122722",
    "tt0070270"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.159Z"
}