{
  "movieId": "tt0037824",
  "title": "Ivan the Terrible, Part I",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ivan-the-terrible-part-i-1944",
      "id": "ivan-the-terrible-part-i-1944",
      "title": "Ivan The Terrible, Part I (1944)",
      "description": "IVAN, O TERRÍVEL - PARTE II ( Ivan the Terrible, Part I, 1944 - URSS ) ( Filme Completo / Legendado em Português ) Data de Lançamento:  30 de dezembro de 1944 » SOBRE O FILME: Em 1547, Ivan IV (1530-1584), arquiduque de Moscou, se auto-proclama o Czar de Rússia e se prepara para retomar territórios russos perdidos. Superando uma série de dificuldades e intrigas, Ivan consegue manipular as pessoas destramente e consolidar seu poder. » » DIREÇÃO: Sergei M. Eisenstein GÊNERO: Histórico, Biografia ORIGEM: URSS DURAÇÃO: 1h 43min » » ELENCO PRINCIPAL: Aleksandr Mgebrov: Novgorod's Archbishop Pimen Amvrosi Buchma: Czar's Guard Aleksei Basmanov Andrei Abrikosov: Boyar Fyodor Kolychev Lyudmila Tselikovskaya: Czarina Anastasia Romanovna Maksim Mikhajlov: Archdeacon Mikhail Kuznetsov: Fyodor Basmanov Mikhail Nazvanov: Prince Andrei Kurbsky Mikhail Zharov: Czar's Guard Malyuta Skuratov Nikolai Cherkasov: Czar Ivan IV Pavel Kadochnikov: Vladimir Andreyevich Staritsky Serafima Birman: Boyarina Efrosinia Staritskaya Vsevolod Pudovkin: Nikola, Simpleton Beggar",
      "fileSize": 3333365698,
      "addedAt": "2026-01-07T00:08:54.188Z",
      "thumbnail": "https://archive.org/services/img/ivan-the-terrible-part-i-1944",
      "language": "rus",
      "collection": "feature_films",
      "downloads": 2456
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "95 min",
    "imdbRating": 7.7,
    "imdbVotes": 11083,
    "Genre": "Biography, Drama, History",
    "Plot": "In 1547, Ivan IV (1530-1584), archduke of Moscow, crowns himself Tsar of Russia and sets about reclaiming lost Russian territory. In scenes of his coronation, his wedding to Anastasia, his campaign against the Tartars in Kazan, his illness when all think he will die, recovery, campaigns in the Baltic and Crimea, self-imposed exile in Alexandrov, and the petition of Muscovites that he return, his enemies among the boyars threaten his success. Chief among them are his aunt, who wants to advance the fortunes of her son, a simpleton, and Kurbsky, a warrior prince who wants both power and the hand of Anastasia. Ivan deftly plays to the people to consolidate his power.",
    "Director": "Sergei Eisenstein",
    "Writer": "Sergei Eisenstein",
    "Actors": "Nikolay Cherkasov, Lyudmila Tselikovskaya, Serafima Birman",
    "Language": "Russian",
    "Country": "Soviet Union",
    "Awards": "2 wins & 1 nomination"
  },
  "relatedMovies": [
    "tt0015648",
    "tt0033451",
    "tt0039178",
    "tt0032710",
    "tt1441953",
    "tt0045473",
    "tt0060107",
    "tt0086891",
    "tt0024966",
    "tt0266425",
    "tt9071322",
    "tt0007801"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1940s",
      "name": "1940s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.188Z"
}