{
  "movieId": "tt0029532",
  "title": "Secret Valley",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=j4TmxjgIyBQ",
      "id": "j4TmxjgIyBQ",
      "title": "Secret Valley (1937) RICHARD ARLEN 🍕 VIRGINIA GREY",
      "description": "Stars: Richard Arlen, Virginia Grey, Syd Saylor\nDirector: Howard Bretherton\n\nStep into the rugged beauty of 1930s Nevada with this unique blend of Classic Western and crime drama, starring Richard Arlen, Virginia Grey, and fan-favorite sidekick Syd Saylor. Directed by Howard Bretherton, this rare gem combines romantic tension, gangster danger, and frontier charm in a unique Western-style story that offers a fresh twist on the traditional Cowboy Western narrative.\n\nA woman, seeking solitude and a fresh start while awaiting a divorce, finds shelter on a remote ranch. Her host, a kind-hearted rancher, offers her peace, safety, and maybe even the hope of a new beginning. But that peace is shattered when her estranged husband—an unpredictable gangster—arrives, determined to win her back at any cost. As danger looms and tensions mount, the quiet valley becomes the setting for a dramatic standoff between lawless love and Western justice.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPerfect for fans of Richard Arlen Westerns, the classic screen presence of Virginia Grey, and the comic relief of Syd Saylor, this vintage film delivers suspense, heart, and a touch of humor. Restored and presented by PizzaFLIX, it's a hidden treasure from Hollywood's golden era.\n\n👍 Like, 💬 Comment, and 🔔 Subscribe for more forgotten gems and timeless Cowboy Western classics.\n\n#RichardArlen #VirginiaGrey #ClassicWesterns #CowboyMovies #HowardBretherton #SydSaylor #PizzaFLIX #VintageWestern #1930sMovies #WesternDrama #OldHollywood",
      "addedAt": "2025-12-24T01:03:48.672Z",
      "thumbnail": "https://i.ytimg.com/vi/j4TmxjgIyBQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCezxbJrLuT0whRG_e5_fj1SrqtUg",
      "duration": 3451,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/secret_valley",
      "id": "secret_valley",
      "title": "Secret Valley",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 3574005176,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/secret_valley",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 69182
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "60 min",
    "imdbRating": 5.9,
    "imdbVotes": 57,
    "Genre": "Drama, Music, Western",
    "Plot": "Rancher Lee Rogers allows Jean Carlo/Collins to hide out on his Reno ranch until she can get a divorce from racketeer \"Slick\" Collins, who tricked her into a marriage. She accompanies Lee on a cattle round-up and innocently causes a stampede that puts Lee into danger of losing his ranch, due to the crooked work of lawyer Austin Martin who is in league with Collins. Jean gives a check to Lee's friend, Russell Parker, to pay off the note and makes him pretend he has arranged a loan from the bank. Collins and his henchmen catch up with Jean, and fearing that her husband will kill Lee, she agrees to accompany him back to New York. But Federal Men are on the trail of Collins for income-tax evasion.",
    "Director": "Howard Bretherton",
    "Writer": "Harold Bell Wright, Daniel Jarrett, Earle Snell",
    "Actors": "Richard Arlen, Virginia Grey, Norman Willis",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028582",
    "tt0028934",
    "tt0029005",
    "tt0029445",
    "tt0029501",
    "tt0029602",
    "tt0029289",
    "tt0029694",
    "tt0029801",
    "tt0030849",
    "tt0033047",
    "tt0027361"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.954Z"
}