{
  "movieId": "tt0033029",
  "title": "Second Chorus",
  "year": 1940,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rsJqDUrz7pk",
      "id": "rsJqDUrz7pk",
      "title": "Second Chorus (1940) | Colorized Public Domain Musical Comedy with Fred Astaire and Paulette Goddard",
      "description": "Second Chorus (1940) is a lively American musical comedy directed by H.C. Potter and featuring some of Hollywood’s brightest stars of the Golden Age. With Fred Astaire showcasing his signature dance charm, Paulette Goddard delivering wit and charisma, and Burgess Meredith adding humor, this restored and colorized public domain gem breathes new life into a film that blends music, romance, and comedy. This edition makes the film more accessible to modern audiences across the United States, Europe, and beyond while preserving its historical legacy.\n\nPlot Summary:\nThe story follows Danny O’Neill (Fred Astaire) and Hank Taylor (Burgess Meredith), two competitive trumpet players who lead a college swing band. Their rivalry extends beyond music, as both men vie for the attention of Ellen Miller (Paulette Goddard), a smart and ambitious woman with dreams of success in the music business. When Ellen becomes the band’s manager, tensions rise as Danny and Hank sabotage each other in pursuit of both her affection and their careers. The plot takes a turn when the legendary bandleader Artie Shaw (playing himself) enters the picture, offering a shot at professional stardom. With comic mishaps, vibrant swing music, and Astaire’s iconic dancing, the film captures the energy of late-1930s big band culture.\n\nCast and Crew:\n• Director: H.C. Potter\n• Producer: Boris Morros\n• Screenplay: Elaine Ryan and Ian McLellan Hunter\n• Music: Artie Shaw and His Orchestra\n• Cinematography: Robert De Grasse\n• Editing: William Hamilton\n\nStarring:\n• Fred Astaire as Danny O’Neill\n• Paulette Goddard as Ellen Miller\n• Burgess Meredith as Hank Taylor\n• Charles Butterworth as Mr. Chisholm\n• Artie Shaw as Himself\n• Frank Melton as Stu\n• Elvia Allman as Mrs. Chisholm\n\nFilm Significance:\nSecond Chorus holds a unique place in film history as one of Fred Astaire’s lesser-known musical comedies, showcasing his talent outside his famed Ginger Rogers collaborations. The film is also notable for featuring real-life jazz legend Artie Shaw and his orchestra, providing authentic big band performances that reflect the swing era’s cultural peak. While not a major studio production, its charm lies in the combination of witty rivalry, jazzy energy, and the timeless magnetism of Astaire.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Second Chorus remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1940 release of Second Chorus was in black and white, in line with Hollywood’s standards of the era. While historically authentic, black-and-white films are often skipped over by modern audiences. Our colorized edition bridges the gap between historical preservation and contemporary viewing, allowing today’s viewers to enjoy Astaire’s dance sequences and Artie Shaw’s performances in a fresh, engaging way.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten musicals and B-movies to culturally significant dramas and comedies. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#SecondChorus #FredAstaire #PauletteGoddard #BurgessMeredith #ArtieShaw #1940sMusical #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #FilmRestoration #BigBandEra #ClassicMusicalComedy #SwingEra",
      "addedAt": "2025-12-24T00:48:18.876Z",
      "thumbnail": "https://i.ytimg.com/vi/rsJqDUrz7pk/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBUKFEwDw==&rs=AOn4CLDLE6cC4zBiQqJme1Szc_A38eypwQ",
      "duration": 4406,
      "language": "en",
      "year": 1940,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/second-chorus-1940",
      "id": "second-chorus-1940",
      "title": "Second Chorus (1940)",
      "description": "Danny O'Neill and Hank Taylor are rival trumpeters with the Perennials, a college band, and both men are still attending college by failing their exams seven years in a row. In the midst of a performance, Danny spies Ellen Miller who ends up being made band manager. Both men compete for her affections while trying to get the other one fired. Watch on RetroFlix:  https://retroflix.org/second-chorus-1940/",
      "fileSize": 2306816105,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/second-chorus-1940",
      "language": "eng",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 241
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/second-chorus-1940-comedy-musical-romance-full-length-film",
      "id": "second-chorus-1940-comedy-musical-romance-full-length-film",
      "title": "Second Chorus (1940) Comedy, Musical, Romance",
      "description": "Two music students, rather than face the responsibilities of life, repeatedly fail their exams so that they can stay in college. The students change their attitude, however, when they meet a woman who agrees to be their manager and both attempt to woo her as a way of getting a job in Artie Shaw's ba nd. Featuring the Oscar-nominated `Would You Like to Be the Love of My Life?'.",
      "fileSize": 2306824890,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/second-chorus-1940-comedy-musical-romance-full-length-film",
      "collection": "feature_films",
      "downloads": 4202
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/second-chorus-4-k",
      "id": "second-chorus-4-k",
      "title": "Second chorus (1940) [Colorized,4k,60fps]",
      "description": "Second chorus is a 1940  black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6057362875,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/second-chorus-4-k",
      "collection": "feature_films",
      "downloads": 182
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/second_chorus",
      "id": "second_chorus",
      "title": "Second Chorus",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 5128287368,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/second_chorus",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 59461
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/second_chorus_1940",
      "id": "second_chorus_1940",
      "title": "Second Chorus",
      "description": "Taken from IlMDB : When perennial college students Danny O'Neill and Hank Taylor are forced to make it on their own, the competitive pair get jobs with Artie Shaw's band and reunite with ex-manager Ellen Miller.",
      "fileSize": 1774596586,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/second_chorus_1940",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 95966
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": 5.7,
    "imdbVotes": 1798,
    "Genre": "Comedy, Musical, Romance",
    "Plot": "Danny and Hank are surprised when Artie Shaw hires competent manager Ellen away from their college band. The two trumpet players scheme to get into Shaw's outfit themselves, each trying to trump the other's plays.",
    "Director": "H.C. Potter",
    "Writer": "Frank Cavett, Elaine Ryan, Ian McLellan Hunter",
    "Actors": "Fred Astaire, Paulette Goddard, Artie Shaw",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 2 Oscars. 2 nominations total"
  },
  "relatedMovies": [
    "tt0033704",
    "tt0034055",
    "tt0035583",
    "tt0032624",
    "tt0031763",
    "tt0033632",
    "tt0033878",
    "tt0034265",
    "tt0031278",
    "tt0031716",
    "tt0030540",
    "tt0029885"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.954Z"
}