{
  "imdbId": "tt0040810",
  "title": "So This Is New York",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-oldify-new-york-old-penn-station-all-audio-1080p-s-ai-1950s",
      "id": "de-oldify-new-york-old-penn-station-all-audio-1080p-s-ai-1950s",
      "title": "New York: wonderful old Penn station around and before 1950 in color! [A.I. enhanced & colorized]",
      "description": "Great colorized film footage of New York's old Penn Station before it was demolished in 1963. Many New Yorkers and visitors from all over the World have scorned the dreadful decision of the Pennsylvania Railroad company together with New York's city council to demolished the beautiful building of old Penn station (opened in 1910). It was replaced by a montrous highrise building for Madison Square Garden and Penn Plaza. The decision to demolish old Penn station meant that almost the entire new station was constructed under ground. At the time the The New York Times wrote: \"Until the first blow fell, no one was convinced that Penn Station really would be demolished, or that New York would permit this monumental act of vandalism against one of the largest and finest landmarks of its age of Roman elegance.\" Fortunately it seems that there are now plans to more or less restore Penn station to its original glory by moving it across the street or other plans to open it up. As usual there is a lot of controversy about the various plans. The original video has been motion-stabilized, slightly speed-corrected, enhanced and A.I. colorized. This is raw footage, probably shot for a movie or documentary. Source: archive.org Music: Francis Wells with \"New York City\" and \"New York Love\"",
      "fileSize": 767414076,
      "addedAt": "2026-01-07T00:07:59.604Z",
      "thumbnail": "https://archive.org/services/img/de-oldify-new-york-old-penn-station-all-audio-1080p-s-ai-1950s",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 113
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/stiny7734534581",
      "id": "stiny7734534581",
      "title": "So This Is New York",
      "description": "Title: So This Is New York Summary: A small town man inherits a significant fortune and takes his family to New York City. Urban culture shock takes the form of strange ways and oddball characters Based on Ring Lardner's novel \"The Big Town.\" Directed by: Richard Fleischer Actors: Henry Morgan, Rudy Vallee, Bill Goodwin Production Company: Enterprise Productions Release Date: June 1948 (USA) Aspect Ratio: 1.37 : 1 A small town man inherits a significant fortune and takes his family to New York City. Urban culture shock takes the form of strange ways and oddball characters Based on Ring Lardner's novel \"The Big Town.\"",
      "fileSize": 865742364,
      "addedAt": "2026-01-07T00:11:35.629Z",
      "thumbnail": "https://archive.org/services/img/stiny7734534581",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 1254
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "79 min",
    "imdbRating": 6.3,
    "imdbVotes": 325,
    "Genre": "Comedy",
    "Plot": "A small town man inherits a significant fortune and takes his family to New York City. Urban culture shock takes the form of strange ways and oddball characters Based on Ring Lardner 's novel \"The Big Town.\"",
    "Director": "Richard Fleischer",
    "Writer": "Carl Foreman, Herbert Baker, Ring Lardner",
    "Actors": "Henry Morgan, Rudy Vallee, Bill Goodwin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040919",
    "tt0040586",
    "tt0040178",
    "tt0041165",
    "tt0041983",
    "tt0041252",
    "tt0042182",
    "tt0040762",
    "tt0040431",
    "tt0040626",
    "tt0040720",
    "tt0040884"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.629Z"
}