{
  "imdbId": "tt0061549",
  "title": "Yongary, Monster from the Deep",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/YongaryMonsterFromTheDeep",
      "id": "YongaryMonsterFromTheDeep",
      "title": "Yongary Monster From the Deep",
      "description": "Hosted by The Cinemated Man Directed by Ki-duk Kim Written by Ki-duk Kim, Yun-sung Special Effects by Kenichi Nakagawa",
      "fileSize": 1195801224,
      "addedAt": "2026-01-07T00:07:18.437Z",
      "thumbnail": "https://archive.org/services/img/YongaryMonsterFromTheDeep",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 18278
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Yongary-MonsterFromTheDeep",
      "id": "Yongary-MonsterFromTheDeep",
      "title": "YONGARY - Monster from the Deep",
      "description": "In the Middle East, a bomb is set off that creates massive earthquakes. Meanwhile in South Korea, a young couple is about to get married and the tension builds when South Korea sends a space shuttle to investigate the bomb site. The earthquake makes its way to South Korea, caused by a giant monster named Yongary (inspired by a mythical creature in Korean lore). Yongary attacks Seoul and makes his way to the oil refineries where he consumes the oil. A child related to the aforementioned couple turns off the refineries' oil basins; Yonggary, enraged, starts attacking until an explosion at the refinery proves to have a chemical effect on it. The Korean Government then uses oil to draw Yonggary to a local river, and kills it with a refined version of the compound.",
      "fileSize": 1287560346,
      "addedAt": "2026-01-07T00:07:18.437Z",
      "thumbnail": "https://archive.org/services/img/Yongary-MonsterFromTheDeep",
      "collection": "feature_films",
      "downloads": 79297
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "80 min",
    "imdbRating": 3.8,
    "imdbVotes": 1746,
    "Genre": "Adventure, Drama, Fantasy",
    "Plot": "A South Korean family celebrates the wedding of an astronaut. Then the groom receives a call on his wedding night that he is needed for a reconnaissance flight during which he observes a nuclear test that triggers an earthquake in Korea. Strangely, the quake's epicenter keeps moving towards Seoul. A photographer who was documenting the moving temblor's damage notifies authorities that its cause is a gigantic underground creature making its way toward Seoul. Martial law is declared. As the creature, Yongary, emerges, it begins to wreak havoc on the city. Later, it is seen drinking from a refinery's storage tanks to fuel its flaming breath. Icho, an eight-year-old boy, also notices that it disliked a tank of ammonia when it was ruptured. Il-Woo, the boyfriend of Icho's sister, is a scientist. He recognizes the creature's aversion response and concocts a precipitate of ammonia. The first batch puts Yongary temporarily to sleep, so a stronger form needs to be created. This is taken up in a helicopter to be deployed.",
    "Director": "Kim Ki-duk",
    "Writer": "Kim Ki-duk, Yun-sung Seo",
    "Actors": "Yeong-il Oh, Jeong-im Nam, Lee Soon-jae",
    "Language": "Korean",
    "Country": "South Korea, Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0060584",
    "tt0392276",
    "tt0055117",
    "tt0062150",
    "tt0056211",
    "tt0029162",
    "tt4404296",
    "tt3159412",
    "tt0002130",
    "tt0015174",
    "tt0015175",
    "tt0060261"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:44:05.463Z"
}