{
  "movieId": "tt0038126",
  "title": "Strange Illusion",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1945-strange-illusion-extrana-ilusion-edgar-g.-ulmer-vose",
      "id": "1945-strange-illusion-extrana-ilusion-edgar-g.-ulmer-vose",
      "title": "1945 - Strange Illusion - Extraña ilusión - Edgar G. Ulmer - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "fileSize": 396979912,
      "addedAt": "2026-01-07T00:06:03.998Z",
      "thumbnail": "https://archive.org/services/img/1945-strange-illusion-extrana-ilusion-edgar-g.-ulmer-vose",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 1796
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Strange_Illusion",
      "id": "Strange_Illusion",
      "title": "Strange Illusion",
      "description": "\"Adolescent believes that his widowed mother's suitor may have murdered his father. Stylish cheapie by the recognized master of stylish cheapies.\" - noir expert Spencer Selby",
      "fileSize": 12115254632,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/Strange_Illusion",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 77164
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=C0ph5mulhe0",
      "id": "C0ph5mulhe0",
      "title": "Strange Illusion (1945) | Colorized Public Domain Film Noir Thriller | Jimmy Lydon & Warren William",
      "description": "Strange Illusion (1945) is an American film noir thriller directed by Edgar G. Ulmer and produced by Producers Releasing Corporation (PRC). Starring Jimmy Lydon, Warren William, and Sally Eilers, this suspenseful psychological drama blends mystery, crime, and family intrigue with undertones inspired by Shakespeare’s Hamlet. This restored and colorized edition revitalizes the haunting atmosphere of a 1940s noir gem, bringing it to life for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story follows Paul Cartwright (Jimmy Lydon), a young man haunted by recurring dreams of his father’s untimely death in a mysterious car accident. Troubled by these visions, Paul grows increasingly suspicious of Brett Curtis (Warren William), a charming yet sinister suitor who is courting his widowed mother, Virginia Cartwright (Sally Eilers). Convinced that Curtis is connected to his father’s death and harbors dangerous intentions, Paul investigates further.\n\nAs Paul’s suspicions intensify, he discovers that Curtis is not only manipulative but also has a dark criminal past involving mental institutions, fraud, and deception. The more Paul learns, the more isolated he becomes, as Curtis weaves himself into the family’s life and dismisses Paul’s warnings as youthful paranoia. Ultimately, Paul must confront Curtis directly, leading to a dramatic climax that blurs the lines between illusion, dream, and reality.\n\nBlending psychological suspense with classic noir elements, Strange Illusion delivers tension-filled performances, shadowy cinematography, and themes of manipulation and mistrust that resonate strongly with noir enthusiasts.\n\nCast and Crew:\n• Director: Edgar G. Ulmer\n• Producer: Martin Mooney\n• Screenplay: Adele Comandini, based on a story by Edgar G. Ulmer\n• Cinematography: Eugen Schüfftan (credited as Eugene Shufftan)\n• Editing: John M. Foley\n\nStarring:\n• Jimmy Lydon as Paul Cartwright\n• Warren William as Brett Curtis\n• Sally Eilers as Virginia Cartwright\n• Regis Toomey as Dr. Vincent\n• Charles Arnt as Press\n• George Reed as George the Butler\n• Gloria Holden as Lydia Hynes\n\nFilm Significance:\nStrange Illusion is considered a minor yet fascinating entry in the film noir canon, notable for being directed by Edgar G. Ulmer, who was also behind cult classics such as Detour (1945). While produced by PRC, a studio known for its low budgets, the film rises above its limitations thanks to its creative use of dream sequences, layered performances, and Ulmer’s talent for building atmospheric tension.\n\nThe film stands out for its Hamlet-inspired narrative, with Paul Cartwright serving as a modern-day Hamlet, Brett Curtis as a sinister Claudius figure, and Virginia Cartwright as the Gertrude-inspired mother. These Shakespearean parallels lend the film a deeper literary resonance that distinguishes it from many B-noir productions of the time.\n\nThough not widely known upon release, Strange Illusion has grown in appreciation among noir fans, film historians, and classic cinema enthusiasts. Its availability in the public domain has allowed it to be preserved, studied, and reintroduced to modern audiences who can now experience it in color.\n\nEnhanced Public Domain Explanation:\nStrange Illusion is in the public domain, making it free of copyright restrictions and open for preservation, restoration, and creative adaptation. At Colorized Public Domain, we specialize in restoring these cinematic treasures by digitally enhancing picture quality and thoughtfully colorizing black-and-white classics. Our goal is to bridge the gap between history and modern entertainment, ensuring films like Strange Illusion remain relevant and engaging for today’s viewers while maintaining respect for their original artistry.\n\nWhy Watch This Colorized Edition:\nThe original black-and-white cinematography of Strange Illusion captures the moody, expressionistic essence of film noir. By carefully adding color, this edition enhances the viewing experience for contemporary audiences, making the suspense and emotional intensity more immersive. For younger generations or those unfamiliar with classic cinema, colorization provides a gateway into appreciating timeless works that might otherwise be overlooked.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more restored and colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload weekly public domain gems spanning film noir, adventure, horror, comedy, and drama — each restored to ensure they remain discoverable and enjoyable for audiences in the USA, Europe, and worldwide.\n\n#StrangeIllusion #FilmNoir #EdgarGUlmer #JimmyLydon #WarrenWilliam #SallyEilers #ClassicNoir #PublicDomainMovie #ColorizedClassic #1940sCinema #GoldenAgeHollywood #PsychologicalThriller #HamletInspired #1945Movies #FilmRestoration",
      "addedAt": "2025-12-24T00:47:38.533Z",
      "thumbnail": "https://i.ytimg.com/vi/C0ph5mulhe0/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYVSBlKDUwDw==&rs=AOn4CLB4vbIttIhu3PRgDvSIRT1AwaKsnw",
      "duration": 5036,
      "language": "en",
      "year": 1945,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/strange-illusion-1945",
      "id": "strange-illusion-1945",
      "title": "Strange Illusion (1945)",
      "description": "An adolescent believes that his widowed mother's suitor may have murdered his father. Watch on RetroFlix.org:  https://retroflix.org/strange-illusion-1945/",
      "fileSize": 273479715,
      "addedAt": "2026-01-07T00:11:35.629Z",
      "thumbnail": "https://archive.org/services/img/strange-illusion-1945",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 424
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uWamErNN_LE",
      "id": "uWamErNN_LE",
      "title": "Strange Illusion (1945) FILM NOIR",
      "description": "Director: Edgar G. Ulmer\nStars: Jimmy Lydon, Sally Eilers, Warren William \n\nIn this classic Film Noir directed by the great Edgar G. Ulmer, a young man's dreams of death and destruction begin to come true!",
      "addedAt": "2025-12-26T23:46:23.483Z",
      "thumbnail": "https://i.ytimg.com/vi/uWamErNN_LE/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLC09N949wvyX2zQy3LQUqm5ke3zfA",
      "duration": 5111,
      "language": "en",
      "year": 1945,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "87 min",
    "imdbRating": 6.2,
    "imdbVotes": 1189,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Paul, a young man whose father was once lieutenant Governor of California before his untimely death, has a strange, recurring dream in which his mother falls in love with a dangerous man (Brett Curtis), a dream which also contains the image of his father's death in an automobile accident under mysterious circumstances. Through the help of his friend, a psychiatrist, Paul realizes that his dream is coming true, and that his mother is falling under Curtis's influence. Curtis, in fact, is a homicidal maniac who lives as an out-patient at the sanitarium of the unscrupulous Dr. Muhlbach. When Curtis makes an attempt to marry Paul's mother, Paul intervenes, and after a series of events discovers the truth behind his dreams.",
    "Director": "Edgar G. Ulmer",
    "Writer": "Adele Comandini, Fritz Rotter",
    "Actors": "Jimmy Lydon, Sally Eilers, Warren William",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037638",
    "tt0035944",
    "tt0038057",
    "tt0037622",
    "tt0037932",
    "tt0037749",
    "tt0037858",
    "tt0037505",
    "tt0037518",
    "tt0037598",
    "tt0037633",
    "tt0037794"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.629Z"
}