{
  "movieId": "tt0048123",
  "title": "The Glass Tomb",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QGxoja5vNRY",
      "id": "QGxoja5vNRY",
      "title": "The Glass Tomb (1955) COLORIZED | Murder Mystery | Full Movie | Subtitles added!",
      "description": "JAGGED EDGE OF VIOLENCE!…THAT SHATTERS THE SCREEN WITH SUSPENSE!\nA circus barker stages a sensational new act, the world’s longest fast undertaken by “Sapolio”, on view in a glass cage. But this act also results in several murders, a kidnapping, and a poisoning!\n\nB&W version https://youtu.be/f8nr2svU5XU\n\nDirector: Montgomery Tully\nWriters: Richard H. Landau, A.E. Martin (novel \"The Outsiders\")\nStars: John Ireland, Honor Blackman, Geoffrey Keen\nGenres: Classics, Mystery\n\n0:00 The Glass Tomb (1955) : A Person's Conflicted Feelings about Trust, Blackmail, and Marriage, Financial Challenges, Hunger, Artwork, Tattoos, Crime, Tigers, and a 70-Day Fast in a Glass Tomb, Leading to Suspicion, Escape, and a Coma\n4:43 💔 A person is feeling conflicted about a situation involving someone they trust and a potential marriage.\n6:03 💰 A conversation about a business opportunity and the financial challenges associated with it.\n10:46 🍽️ The speaker's wife is cooking and using their hard-earned money to feed others, while they themselves are hungry.\n16:49 🎭 A group of people discuss artwork, tattoos, and a party invitation at a social gathering.\n22:43 🔍 A conversation about a party and a potential crime.\n28:24 🎭 A conversation about a concern for tigers, a favor being done, and a potential mistake made\n33:58 🎪 A man named Sapolio is about to begin a 70-day fast in a glass tomb, surrounded by spectators.\n40:01 🔍 The speaker discusses various events and conversations, including a mysterious person going into an apartment and a suspicion about their identity.\n47:27 ! The speaker reveals their fear and decision to escape, and discusses the potential harm to someone named Peter. They also mention meeting someone who talked about a person named Tony Lewis. The speaker admits to intentionally involving someone else in their plans and expresses regret for their actions. They explain their involvement in an incident resulting in blood and the picking up of a girl. The speaker then receives a message for Mr. Pelham and later discusses the cause of death of someone named Henri.\n53:26 🏥 A man is in a coma and there are concerns about his condition. People are encouraged to attend his speech when he wakes up.\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:44:41.718Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/QGxoja5vNRY/maxresdefault.webp?v=64d0ac02",
      "duration": 3538,
      "language": "en",
      "year": 1955,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "59 min",
    "imdbRating": 5.5,
    "imdbVotes": 324,
    "Genre": "Mystery",
    "Plot": "'Pel' Pelham is a veteran carnival barker who's happily married and desperately wants a good education for his young son. With money borrowed from bookie Tony Lewis, he persuades Sapolio, a professional \"starving man,\" to attempt to break his own world's record of 65 days without food. Pel, a natural promoter, persuades a real estate broker to donate land for the show, which will feature Sapolio inside a glass cage housed in a tent to be ogled by the curious paying public. Prior to the start of the ordeal, Sapolio and his wife throw a party in their flat. When a girl in an upstairs apartment is murdered, suspicion falls on Pel and Tony Lewis, the girl's former boyfriend. Sapolio unknowingly has glimpsed the murderer, but initially cannot remember what he looked like. That makes \"The Starving Man\" a target for the real killer.",
    "Director": "Montgomery Tully",
    "Writer": "Richard H. Landau, A.E. Martin",
    "Actors": "John Ireland, Honor Blackman, Geoffrey Keen",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0221319",
    "tt0048938",
    "tt0048301",
    "tt0048507",
    "tt0047849",
    "tt0048396",
    "tt0048426",
    "tt0047299",
    "tt0254627",
    "tt0046761",
    "tt0211663",
    "tt0047149"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:50:54.999Z"
}