{
  "movieId": "tt0090368",
  "title": "A Cruel Romance",
  "year": 1984,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_394TmF4DKY",
      "id": "_394TmF4DKY",
      "title": "A Cruel Romance",
      "description": "A drama directed by Eldar Ryazanov based on Alexander Ostrovsky’s play Bespridannitsa (Without a Dowry). The film gained admiration from the audience. In 1984, it was recognized as the best film of the year by Soviet Screen magazine and won several awards. A brilliant role for Nikita Mikhalkov and a tender debut for Larisa Guzeeva. The film differs significantly from its source material, and is considered by many a piece of work in its own right. It is set in a small provincial town on the coast of the Volga River. Kharita Ignatievna Ogudalova is a widow with three grown-up daughters. Having become poor after the death of her husband Dmitry Stepanovich, she does everything to arrange for her daughters, that is, to marry them off to sufficiently rich and noble suitors. Despite her lack of funds, she keeps an open house, reckoning that the company of beautiful, musically gifted young ladies will attract single men rich enough to marry the dowerless... \n\nThe drama of the love affair between a destitute woman and a rich ship-owner is intensified by the social problem of the woman’s situation in the era of the decline of nobility as a class in the Russian Empire. \n\nYear of production: 1984\n\nWritten and directed by: Eldar Ryazanov \nDirector of photography: Vadim Alisov \nMusic: Andrey Petrov \nProduction designer: Alexander Borisov \nStarring: Larisa Guzeeva, Nikita Mikhalkov, Alisa Freindlich, Andrey Myagkov, Alexey Petrenko, Viktor Proskurin\n\nThe film was digitally restored by Mosfilm Cinema Concern\nFind out more: https://cg.mosfilm.ru/en\nSubscribe to our YouTube channel, and be sure to click the bell so that you won’t miss the best Soviet movies! \n\n#Guzeeva #Mikhalkov #cruel_love #FullMovieWithEngSubs",
      "addedAt": "2025-12-23T03:46:01.069Z",
      "thumbnail": "https://i.ytimg.com/vi/_394TmF4DKY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDhTNdUNr51Vt2VzFqZKHbWrOAoDA",
      "duration": 8550,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "142 min",
    "imdbRating": 7.9,
    "imdbVotes": 4122,
    "Genre": "Drama, Romance",
    "Plot": "Cinematographic adaptation of classical Russian play \"Dowry-less\" by A. Ostrovsky. Noble but poor widow seeks to arrange marriage for her three daughters. She maintains \"open house\" or provincial form of salon hoping to attract gentlemen well-off enough to marry for love to a dowry-less.",
    "Director": "Eldar Ryazanov",
    "Writer": "Aleksandr Ostrovskiy, Eldar Ryazanov",
    "Actors": "Alisa Freyndlikh, Larisa Guzeeva, Nikita Mikhalkov",
    "Language": "Russian",
    "Country": "Soviet Union",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0084873",
    "tt0076727",
    "tt0096492",
    "tt0087821",
    "tt0088734",
    "tt0087071",
    "tt0087910",
    "tt0311144",
    "tt0086242",
    "tt0087650",
    "tt0091364",
    "tt0091702"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1980s",
      "name": "1980s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-23T04:02:57.827Z"
}