{
  "movieId": "tt0033646",
  "title": "The Gang's All Here",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGngsAllThere",
      "id": "TheGngsAllThere",
      "title": "The Gang's All Here",
      "description": "Two friends take jobs as truck drivers, unaware that the trucking company is being targeted by a gang of saboteurs who will stop at nothing, including murder, to stop them.",
      "fileSize": 1688777494,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGngsAllThere",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 17751
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LaoFQgNQYWA",
      "id": "LaoFQgNQYWA",
      "title": "The Gang's All Here (1941) MANTAN MORELAND",
      "description": "Stars: Mantan Morelan, Frankie Darro, Marcia Mae Jones\nDirector: Jean Yarbrough\n\nTwo friends take jobs as truck drivers, unaware that the trucking company is being targeted by a gang of saboteurs who will stop at nothing, including murder, to stop them.",
      "addedAt": "2025-12-26T23:55:41.605Z",
      "thumbnail": "https://i.ytimg.com/vi/LaoFQgNQYWA/maxresdefault.jpg",
      "duration": 3665,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 5.4,
    "imdbVotes": 228,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "Frankie O'Malley and Jefferson Smith are broke and looking for work. In the help-wanted section of the newspaper they see employment offered at the Overland Transport Company, a hauling firm owned by \"Pop\" Wallace. Unaware that a trucking war is going on and that Wallace's trucks are being wrecked and his men killed, Frankie and Jefferson apply for work and are hired by \"Chick\" Daly , mechanic at the garage, and by Patsy Wallace, the daughter of \"Pop\" Wallace. On their first haul---Frankie is the driver and Jefferson is the helper---they have a run-in with the hi-jackers, but escape after a race between the two five-ton trucks. But they aren't as lucky on their second trip as their truck is run off the road and the hi-jackers take them prisoner. Frankie recognizes the assailants as drivers for a rival trucking firm. Meanwhile, George Lee, Chinese undercover agent for the insurance company that is covering Wallace's claims, has learned that Wallace is working with Ray Saunders, division superintendent for the insurance company. Saunders has a hold over Wallace and his forcing him to participate against his will. Frankie and Jefferson, after a knock-down battle, escape for the hi-jacker's garage in a stolen truck and return to Wallace's garage to find him slugged and unconscious. Frankie and Jefferson decide to get the evidence that will clear Wallace before the police move in. Frankie, Jefferson, \"Chick\" and Patsy break into the hi-jacker's stronghold, but are captured by Norton's men. Norton has the foursome loaded into a truck and driven out into the country-side to be killed.",
    "Director": "Jean Yarbrough",
    "Writer": "Edmond Kelso",
    "Actors": "Frankie Darro, Marcia Mae Jones, Jackie Moran",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033827",
    "tt0033787",
    "tt0034754",
    "tt0035051",
    "tt0035028",
    "tt0034081",
    "tt0034375",
    "tt0031124",
    "tt0036161",
    "tt0042251",
    "tt0034221",
    "tt0029898"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}