{
  "imdbId": "tt0015016",
  "title": "The Iron Horse",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-iron-horse",
      "id": "silent-the-iron-horse",
      "title": "The Iron Horse",
      "fileSize": 38978752720,
      "addedAt": "2026-01-07T00:11:15.977Z",
      "thumbnail": "https://archive.org/services/img/silent-the-iron-horse",
      "language": "English",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 4384
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "150 min",
    "imdbRating": 7.2,
    "imdbVotes": 2649,
    "Genre": "Drama, History, Romance",
    "Plot": "Springfield, Illinois. Brandon, a surveyor, dreams of building a railway to the west, but Marsh, a contractor, is sceptical. Abraham Lincoln looks on as their children, Davy Brandon and Miriam Marsh, play together. Brandon sets off with Davy to survey a route. They discover a new pass which will shave 200 miles off the expected distance, but they are set upon by a party of Cheyenne. One of them, a white renegade with only two fingers on his right hand, kills Brandon and scalps him. Davy buries his father... Years pass. It is 1862 and Lincoln signs the bill authorizing construction of the Union Pacific and Central Pacific railways. Marsh is principal contractor and Miriam is engaged to Jesson, the chief engineer... Crews of Chinese, Italians, and Irish work to build the railway while resisting Indian attack. When the pay train is delayed by Indian ambush, the Italians go on strike. Miriam persuades them to return to work... Marsh needs to find a shortcut through the Black Hills. To finish on time, he needs to shorten the route by 200 miles. Bauman, the biggest land owner, wants the route to stay the same - through his land. Marsh has entrusted Jesson with finding the new route. Bauman has Ruby, a saloon girl, persuade Jesson to do otherwise... Davy, now a pony express rider, recalls his father's discovery. He sets off to find the pass. He goes alone, except for Jesson...",
    "Director": "John Ford",
    "Writer": "Charles Kenyon, John Russell, Charles Darnton",
    "Actors": "George O'Brien, Madge Bellamy, Charles Edward Bull",
    "Language": "English",
    "Country": "United States",
    "Awards": "2 wins total"
  },
  "relatedMovies": [
    "tt0017463",
    "tt0013735",
    "tt0014854",
    "tt0015022",
    "tt0014702",
    "tt0018972",
    "tt0023955",
    "tt0025335",
    "tt0015494",
    "tt0052902",
    "tt0028141",
    "tt0012532"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.977Z"
}