{
  "imdbId": "tt0045609",
  "title": "Cat-Women of the Moon",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CatWomenOfTheMoon",
      "title": "Cat Women Of The Moon",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 1147489691,
      "id": "CatWomenOfTheMoon"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cat-women.of.the.-moon.-1953.",
      "title": "Cat Women of the Moon (1953)",
      "description": "Sonny Tufts, Victor Jory",
      "fileSize": 1673144395,
      "id": "cat-women.of.the.-moon.-1953."
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hPVDHUyRdus",
      "title": "Cat-Women of the Moon (1953) | Colorized Public Domain Sci-Fi Adventure Classic Restored in HD",
      "description": "Cat-Women of the Moon (1953) is a landmark American science fiction film from the golden age of 1950s space adventure cinema, directed by Arthur Hilton and produced by Al Zimbalist and Jack Rabin. This colorized and digitally restored public domain edition breathes new visual life into one of the earliest portrayals of lunar colonization and gender-dominated alien societies in cinema. Originally filmed in black and white and later released in polarized 3D, this film stands as a fascinating relic of postwar optimism, Cold War anxiety, and mid-century fascination with outer space.\n\nPlot Summary:\nThe story follows a crew of astronauts traveling to the Moon on the spaceship Moon Rocket Four, led by commander Laird Grainger (Sonny Tufts). Alongside him are pilot Kip Reiss (Victor Jory), navigator Doug Smith (Douglas Fowley), radio operator Walt Walters (Bill Phipps), and the mission’s lone female crew member, Helen Salinger (Marie Windsor), an accomplished scientist whose role becomes central to the unfolding mystery.\n\nUpon landing on the lunar surface, the crew discovers a hidden cavern containing breathable air and signs of intelligent life. What they find is a civilization of telepathic female inhabitants — the Cat-Women — survivors of a dying lunar society that seeks to escape extinction by taking over the Earth. Their queen, Alpha (Carol Brewster), manipulates Helen through mind control, hoping to use her to pilot their escape ship.\n\nAs tensions rise among the crew, the men’s distrust and the women’s silent plotting intertwine in a struggle between survival, control, and desire. The film’s climax unfolds as loyalty, fear, and human instincts collide in a desperate escape attempt from the catacomb-like moon city.\n\nCast and Crew:\n• Director: Arthur Hilton\n• Producers: Al Zimbalist and Jack Rabin\n• Screenplay: Roy Hamilton\n• Cinematography: William Whitley\n• Music: Elmer Bernstein\n• Editing: Herbert L. Strock\nStarring:\n• Sonny Tufts as Laird Grainger\n• Marie Windsor as Helen Salinger\n• Victor Jory as Kip Reiss\n• Douglas Fowley as Doug Smith\n• Bill Phipps as Walt Walters\n• Carol Brewster as Alpha\n• Susan Morrow as Lambda\n• Judi Meredith as Beta\n\nFilm Significance:\nCat-Women of the Moon is one of the earliest science fiction films to feature an all-female extraterrestrial society and was instrumental in shaping later sci-fi tropes involving gender and power dynamics. It also predated major 1950s classics like It Came from Outer Space and Queen of Outer Space, setting the tone for an era fascinated by cosmic frontiers and space-age imagination. Its blend of low-budget charm, early special effects, and gendered storytelling makes it a time capsule of both cinematic ambition and cultural stereotypes of the 1950s.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Cat-Women of the Moon remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1953 release captured the postwar fascination with science, feminism, and the unknown. While its original black-and-white version reflected the era’s technical limitations, this restored colorized edition revitalizes its lunar settings, costume details, and atmospheric effects — allowing viewers to appreciate the film’s adventurous spirit through modern clarity. For first-world audiences aged 55 and above, it offers both nostalgia and rediscovery of a lost sci-fi gem that inspired future filmmakers exploring the gendered side of science fiction.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood, including forgotten B-movies, sci-fi adventures, dramas, and cultural milestones. Our mission is to preserve and enhance cinematic history for audiences in the USA, Europe, and beyond — making classic film accessible for new generations while honoring the artistry of its creators.\n\n#CatWomenOfTheMoon #1950sSciFi #ColorizedClassic #PublicDomainMovie #ClassicScienceFiction #SpaceAdventure #MarieWindsor #SonnyTufts #ElmerBernstein #1953Movies #GoldenAgeHollywood #FilmRestoration #RetroSciFi #VintageCinema #CultClassic",
      "id": "hPVDHUyRdus",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": 3.9,
    "imdbVotes": 2078,
    "Genre": "Adventure, Sci-Fi",
    "Plot": "Five astronauts travel to the dark side of the moon on a scientific expedition. There they discover a cave which somehow retains a breathable atmosphere. They remove their space suits and venture on, soon finding a buried city where the last members of a 2 million year old civilization greet them with food and drink. Little do they know that these eight lovely leotard-clad women are planning to steal their ship.",
    "Director": "Arthur Hilton",
    "Writer": "Roy Hamilton, Jack Rabin, Al Zimbalist",
    "Actors": "Sonny Tufts, Victor Jory, Marie Windsor",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0044778",
      "title": "The Jungle",
      "year": 1952,
      "imdbRating": 4.7,
      "imdbVotes": 142,
      "language": "English, Tamil",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt32559869",
      "title": "Commando Cody: Sky Marshal of the Universe",
      "year": 1953,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0045553",
      "title": "Beyond the Moon",
      "year": 1954,
      "imdbRating": 4.5,
      "imdbVotes": 152,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045655",
      "title": "Crash of Moons",
      "year": 1954,
      "imdbRating": 3.2,
      "imdbVotes": 940,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047590",
      "title": "Tobor the Great",
      "year": 1954,
      "imdbRating": 5.2,
      "imdbVotes": 973,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046316",
      "title": "Silver Needle in the Sky",
      "year": 1954,
      "imdbRating": 4.6,
      "imdbVotes": 100,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt3776510",
      "title": "The Gypsy Moon",
      "year": 1954,
      "imdbRating": 4.2,
      "imdbVotes": 81,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0044167",
      "title": "Unknown World",
      "year": 1951,
      "imdbRating": 4.1,
      "imdbVotes": 1290,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043380",
      "title": "Captain Video: Master of the Stratosphere",
      "year": 1951,
      "imdbRating": 5.4,
      "imdbVotes": 149,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0048256",
      "title": "King Dinosaur",
      "year": 1955,
      "imdbRating": 2.2,
      "imdbVotes": 1686,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0247746",
      "title": "Supersonic Saucer",
      "year": 1956,
      "imdbRating": 5.5,
      "imdbVotes": 184,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049223",
      "title": "Forbidden Planet",
      "year": 1956,
      "imdbRating": 7.5,
      "imdbVotes": 55938,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.167Z"
}