{
  "imdbId": "tt0025762",
  "title": "Sensation Hunters",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sensation-hunters-1933",
      "id": "sensation-hunters-1933",
      "title": "Sensation Hunters (1933)",
      "description": "Dale Jordan is first accepted by the aristocratic first-cabin passengers on a south-bound Panama-Pacific liner until they discover she is a member of a troupe of cabaret girls led by Trixie Snell en route for the Bull Ring Cabaret in Panama City. Watch on RetroFlix:  https://retroflix.org/sensation-hunters-1933/",
      "fileSize": 443131182,
      "addedAt": "2026-01-07T00:10:50.364Z",
      "thumbnail": "https://archive.org/services/img/sensation-hunters-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 80
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sensation_hunters",
      "id": "sensation_hunters",
      "title": "Sensation Hunters",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4243327907,
      "addedAt": "2026-01-07T00:10:50.364Z",
      "thumbnail": "https://archive.org/services/img/sensation_hunters",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 33888
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ke_qXLY893s",
      "id": "ke_qXLY893s",
      "title": "Sensation Hunters (1933) PRE-CODE HOLLYWOOD",
      "description": "Stars: Arline Judge, Preston Foster, Marion Burns\nDirector: Charles Vidor\n\nThis brisk Pre-Code melodrama is peppered with rapid-fire slang and snappy musical numbers from the era. Look for a young Walter Brennan as a tongue-tied waiter in The Bull Ring Cafe.",
      "addedAt": "2025-12-26T23:57:43.011Z",
      "thumbnail": "https://i.ytimg.com/vi/ke_qXLY893s/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB9gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLBVa-q4DgNIQ3PSWG7VmEj5PTt-Bw",
      "duration": 4253,
      "language": "en",
      "year": 1933,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "73 min",
    "imdbRating": 5.7,
    "imdbVotes": 210,
    "Genre": "Drama",
    "Plot": "Dale Jordon is on her way to Panama with Trixie Snell and Her Hotcha Girls to be a cabaret singer at the Bull Ring Cafe. Traveling by ship, Dale meets and falls in love with Tom Baylor, who owns copper interests near Panama. Baylor is concerned about Dale and they quarrel after he asks her to promise not to start drinking. Baylor sends Dale a bracelet with a note saying that they should part. After three months, Dale, who is rooming with friend and fellow singer Jerry Royal, is tired and frustrated with her job. She attracts the attention of a wealthy flier, Jimmy Crosby, who wants a more permanent relationship, but Dale is still in love with Baylor and refuses. After a fight with Trixie, Dale asks Crosby to take her away and promises to marry him. Crosby agrees and Dale spends her savings on a hotel room and clothes. Baylor returns to Panama and, meeting Dale in the hotel lobby, assumes that she is Crosby's mistress. Dale, angered by his assumption, pretends it is true and Baylor leaves for San Francisco. Before they can leave for New York, Crosby makes a last test run. His wife has refused to give him a divorce to marry Dale, and, distraught, he commits suicide in a plane crash. Trixie refuses to give Dale her old job back and also fires Jerry when she tries to intercede. The girls go to work in a seedy saloon to earn enough money for passage home. They almost have enough when Jerry is stabbed in a bar fight. Dale spends all their money for Jerry's medical expenses but still desperately short, prepares to become a prostitute; instead, Baylor arrives, summoned by a telegram from Jerry, and he and Dale reconcile.",
    "Director": "Charles Vidor",
    "Writer": "Whitman Chambers, Albert DeMond, Paul Schofield",
    "Actors": "Arline Judge, Preston Foster, Marion Burns",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025064",
    "tt0019723",
    "tt0024139",
    "tt0038559",
    "tt0033802",
    "tt0032686",
    "tt0040552",
    "tt0023117",
    "tt0023202",
    "tt0025972",
    "tt0026267",
    "tt0026846"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.364Z"
}