{
  "imdbId": "tt0025335",
  "title": "Judge Priest",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JudgePriest1934",
      "title": "JudgePriest1934",
      "description": "Will Rogers is Judge William \"Billy\" Priest. The Judge's easygoing manner bothers many of the people of his small 19th -century hometown, hurting his chances for re-election. Mystic Nights Videos",
      "id": "JudgePriest1934"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Judge_Priest",
      "title": "Judge Priest",
      "description": "Judge Priest depicting life in Kentucky after the Civil War and Reconstruction Period. It still shows the stereotypes and prejudices which existed at that time in a somewhat humorous manner. Based on a story by the noted Kentucky humorist, Irvin S. Cobb, it presents life as one would have imagined it at that time period.",
      "id": "Judge_Priest"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/judge-priest-1934",
      "title": "Judge Priest",
      "description": "Judge Priest, a proud Confederate veteran, restores the justice in a small town in the Post-Bellum Kentucky using his common sense and his great sense of humanity. Watch on RetroFlix:  https://retroflix.org/judge-priest-1934/",
      "id": "judge-priest-1934"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h5Vb_qG-KhA",
      "title": "Judge Priest (1934) | Colorized Public Domain Classic with Will Rogers and Stepin Fetchit",
      "description": "Judge Priest (1934) is an American comedy-drama directed by John Ford and produced by Fox Film Corporation. This restored and colorized public domain classic brings fresh vibrancy to a film that blends humor, Southern charm, and social reflection during the early 20th century. With a legendary performance by Will Rogers, the film explores themes of justice, tolerance, and small-town life in Kentucky, offering audiences today a chance to rediscover one of John Ford’s early treasures in vivid color.\n\nPlot Summary:\nSet in 1890s Kentucky, Judge Billy Priest (Will Rogers) is a folksy and wise small-town judge known for his humor, humanity, and deep understanding of ordinary people. As a Civil War veteran, he embodies old Southern traditions, but he is also a man of fairness who values compassion and tolerance over rigid application of the law. The film follows Priest as he presides over court cases, interacts with townsfolk, and becomes entangled in the local political rivalries.\n\nConflict arises when Priest defends Jerome Priest (Tom Brown), a young man accused of cowardice and dishonor. Complicating matters is his romance with Ellie May Gillespie (Anita Louise), whose family background sparks social tensions in the town. Judge Priest must navigate prejudice, gossip, and the clash of old traditions with changing values. Alongside comic relief provided by his loyal friend Jeff Poindexter (Stepin Fetchit), the judge uses wit, patience, and moral courage to restore peace and justice to the community.\n\nThe film blends comedy with social commentary, showcasing Rogers’ natural charisma and Ford’s keen eye for Americana. Its final courtroom scene, in which Judge Priest rises to defend young Jerome’s honor, remains one of the most heartfelt moments of 1930s cinema.\n\nCast and Crew:\n• Director: John Ford\n• Producer: Sol M. Wurtzel\n• Screenplay: Dudley Nichols, Lamar Trotti\n• Based on: Writings of Irvin S. Cobb\n• Cinematography: George Schneiderman\n• Editing: Alfred DeGaetano\n\nStarring:\n• Will Rogers as Judge Billy Priest\n• Tom Brown as Jerome Priest\n• Anita Louise as Ellie May Gillespie\n• Henry B. Walthall as General Fairfield\n• Stepin Fetchit as Jeff Poindexter\n• Berton Churchill as Senator Horace Maydew\n• David Landau as Bob Gillis\n• Roger Imhof as Sgt. Jimmy Bagby\n• Frank Melton as Flem Talley\n• Hattie McDaniel as Aunt Dilsey\n\nFilm Significance:\nJudge Priest is notable as one of John Ford’s early sound-era works and a vehicle for Will Rogers’ immense popularity. While the film presents humor and charm, it also reflects the racial and cultural attitudes of its time, making it a valuable historical document of 1930s Hollywood. Stepin Fetchit’s role, though controversial today, is part of film history and highlights how African American actors navigated limited opportunities during that era. For modern viewers, the film offers both entertainment and an opportunity to reflect on America’s cultural evolution.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Judge Priest remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1934 release was in black and white, as was standard in the early sound era. While authentic to its time, many modern viewers bypass black-and-white films. By offering a colorized version, we create a bridge between historical preservation and modern entertainment habits. This edition allows contemporary audiences in the United States, Europe, and beyond to experience John Ford’s direction and Will Rogers’ timeless humor in a more engaging and visually accessible format.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, spanning forgotten comedies, dramas, Westerns, and cultural touchstones. Our work ensures these cinematic treasures remain discoverable, enjoyable, and preserved for audiences across the world.\n\n#JudgePriest #WillRogers #JohnFord #1930sComedyDrama #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #FilmRestoration #1934Movies #SouthernDrama #ClassicCinema",
      "id": "h5Vb_qG-KhA",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bjT6RJ7S_gg",
      "title": "Judge Priest (1934) WILL ROGERS",
      "description": "Stars: Will Rogers ,Hattie McDaniel, Stepin Fetchit\nDirector: John Ford\n\nJudge Priest, a proud Confederate veteran, uses common sense and considerable humanity to dispense justice in a small town in the Post-Bellum Kentucky.\n\nThis film is especially remarkable for its subversive playing-off of Rogers' wily-rascal persona against the sly Stepin Fetchit in profoundly egalitarian comic scenes.",
      "id": "bjT6RJ7S_gg",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Rsvi-AeIcF0",
      "title": "Judge Priest (1934) History, Drama | with Will Rogers | Directed by John Ford",
      "description": "Judge William \"Billy\" Priest, an amiable Civil War veteran living in small-town Kentucky. While the widowed Judge Priest, a proud former Confederate, dispenses justice in his court, he also finds time to help his nephew, Jerome (Tom Brown), and woo Ellie May Gillespie (Anita Louise), the girl of his dreams. He also memorably performs with the doting Aunt Dilsey (Hattie McDaniels), making for a rousing depiction of postwar Southern living.\n\nJudge Priest is a peculiar slice of 1930s cinema that awkwardly marries its antique charm, with storytelling, and an overt nostalgia for a South that never truly existed—a mythical realm where neighborly kindness, quaint humor, and racial harmony supposedly flourished under the Confederate flag.\n\nColorized version: https://youtu.be/KFN3sNQy4ZQ\n\nThis film is available with English & Spanish audio, and subtitled in many language options\n\nDirector: John Ford\nWriters: Irvin S. Cobb, Dudley Nichols \nStars: Will Rogers, Tom Brown, Anita Louise & Hattie McDaniel\nGenres: Classics, Comedy, Drama, Romance\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "id": "Rsvi-AeIcF0",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": "6.2",
    "imdbVotes": "2,705",
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Judge William \"Billy\" Priest lives in a very patriotic (Confederate) southern town. Priest plays a laid-back, widowed judge who helps uphold the law in his toughest court case yet. In the meantime, he plays matchmaker for his young nephew.",
    "Director": "John Ford",
    "Writer": "Irvin S. Cobb, Dudley Nichols, Lamar Trotti",
    "Actors": "Will Rogers, Tom Brown, Anita Louise",
    "Language": "English",
    "Country": "United States",
    "Awards": "2 wins total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0023955",
      "title": "Doctor Bull",
      "year": 1933,
      "imdbRating": "6.4",
      "imdbVotes": "721",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024610",
      "title": "State Fair",
      "year": 1933,
      "imdbRating": "6.7",
      "imdbVotes": "1,151",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027214",
      "title": "The Whole Town's Talking",
      "year": 1935,
      "imdbRating": "7.3",
      "imdbVotes": "3,405",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025463",
      "title": "Manhattan Love Song",
      "year": 1934,
      "imdbRating": "6.1",
      "imdbVotes": "79",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025152",
      "title": "Fugitive Road",
      "year": 1934,
      "imdbRating": "5.9",
      "imdbVotes": "68",
      "language": "English, German, Italian",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0024421",
      "title": "Our Betters",
      "year": 1933,
      "imdbRating": "6.1",
      "imdbVotes": "850",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024436",
      "title": "Perfect Understanding",
      "year": 1933,
      "imdbRating": "5.6",
      "imdbVotes": "772",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026276",
      "title": "The Devil Is a Woman",
      "year": 1935,
      "imdbRating": "6.9",
      "imdbVotes": "4,152",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025306",
      "title": "In the Money",
      "year": 1933,
      "imdbRating": "4.9",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0021508",
      "title": "Up the River",
      "year": 1930,
      "imdbRating": "5.9",
      "imdbVotes": "1,386",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027311",
      "title": "As You Like It",
      "year": 1936,
      "imdbRating": "5.8",
      "imdbVotes": "882",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027286",
      "title": "The Amazing Adventure",
      "year": 1936,
      "imdbRating": "6.3",
      "imdbVotes": "2,215",
      "language": "English, Italian",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:32:36.766Z"
}