{
  "movieId": "tt0004022",
  "title": "Julius Caesar",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MyMovie_20180808",
      "id": "MyMovie_20180808",
      "title": "\"Julius Caesar\" (1914)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation         \"Julius Caesar\" with original title \"Cajus Julius Caesar (Caius Julius Caesar)\" is an epic historical drama. This is a biopic about the life and the deeds of the great Roman general and statesman. The film has a dramatic story line, rich sets and great battle scenes.     The film was created in Italy by the renowned director Enrico Guazzoni. Before WWI European cinema was the most advanced in the world and \"Julius Caesar\" is an example of a very mature film from the early years of movie making. European film-makers were the first masters of epic historical blockbusters before those skills were acquired in the USA.     Directed by                    Enrico Guazzoni Produced by                  Cines Film Co., Rome Based on                        the play by William Shakespeare Starring                         Amleto Novelli, Irene Mattalia, Antonio Nazzari, Bruto Castellani, Ignazio Lupi, Gianna Terribili-Gonzales, Augusto Mastripietri, Lia Orlandini Release date                   October 1914 Running time                 101 minutes Country                          Italy Language                        Silent film, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 117689663,
      "addedAt": "2026-01-07T00:06:38.753Z",
      "thumbnail": "https://archive.org/services/img/MyMovie_20180808",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 5646
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-julius-caesar",
      "id": "silent-julius-caesar",
      "title": "Julius Caesar",
      "fileSize": 1046262498,
      "addedAt": "2026-01-07T00:11:07.406Z",
      "thumbnail": "https://archive.org/services/img/silent-julius-caesar",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 596
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "112 min",
    "imdbRating": 6.2,
    "imdbVotes": 63,
    "Genre": "Drama, History",
    "Plot": "Before reaching his twentieth birthday, Caesar meets and falls madly in love with pretty Cornelia, daughter of Lucius Cinna. They are soon married despite the advice of their friends, who well know the bitter animosity existing between Sulla, dictator of Rome, and Lucius Cinna. The immediate result of this hasty marriage is an annulment and the banishment from Rome of Caesar. He leaves, vowing that the eternal city shall again hear of him. This does not occur until twenty years later, when he returns at news of Sulla's death and plunges briskly into the campaign for the consulship. In this he is aided by Calpurnia, daughter of the wealthy Piso. Caesar and Calpurnia are married and Caesar is elected to the consulship in the face of strong opposition by Cato, the younger, who fears the growing popularity of the still youthful statesman. To further fortify himself against the attacks of Cato, Caesar forms a political alliance with Pompey. which later grows into the first triumvirate consisting of Caesar, Pompey and Crassus. Caesar then gives his daughter Julia, by his first wife Cornelia, in marriage to Pompey and turns his restless ambition to greater fields. News that he will set out with an expeditionary force into Western Europe brings a strong protest from the Gauls. One day a beautiful Druidess visits Caesar and attempts to end his life, thwarted only by the ever-watchful, loving eye of Calpurnia. Not in the least daunted, Caesar pushes his campaign into Gaul with characteristic vigor, sweeps to destruction the formidable tribes headed by Vercingetorix in a series of the most brilliant battles recorded in history. and returns triumphant to Rome. Meanwhile. Pompey grows jealous of the conqueror's ever increasing power and stirs up the senate against him. citing the Roman law that no man may become proconsul and retain military command. Marc Antony warns Caesar, at Ravenna, of what he may expect in Rome while Marcus Brutus, nephew of Cato, visits Caesar with the senate's dictum. And Caesar, placing the matter squarely before his soldiers and receiving their answer, \"Without Caesar there is no Rome,\" orders his troops across the Rubicon. The senate declares him a traitor, but the populace hails him with acclaim and ceremony. Then the struggle for the mastery of the world begins. Caesar robs the Temple of Saturn to secure money for his troops and pursues Pompey to Pharsalus. where a desperate battle takes place, resulting in the annihilation of Pompey's army and the flight of its leader into Egypt. Back to Home goes victorious Caesar to fight no more and to be made Dictator for life. In 44 B.C., Julius Caesar, now fifty-six years of age, settles down to the administration of justice with a temperance and wisdom mellowed by age and experience. But his old enemy, Cato, intent upon the Dictator's destruction, hatches a conspiracy in which he and Brutus are the ringleaders. When veiled rumors of this reach Caesar he refuses to affront the dignity of the senate with armed guards and one day permits the opening, long watched for by the conspirators. Brutus touches him upon the shoulder and the next second a knife flashes in the air. Caesar reels, the target of a dozen blows, \"And thou, too, Brutus. Then fall Caesar.\" Pandemonium reigns. The city is aflame with riot and murder. Marc Antony, concluding his oration in the market place, smiles, \"Mischief, thou are afoot; take thou what course thou wilt.\"",
    "Director": "Enrico Guazzoni",
    "Writer": "Raffaele Giovagnoli, William Shakespeare",
    "Actors": "Amleto Novelli, Bruto Castellani, Irene Mattalia",
    "Language": "None",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002445",
    "tt0171301",
    "tt0013388",
    "tt0003740",
    "tt1223220",
    "tt0004150",
    "tt0005719",
    "tt0162496",
    "tt0005460",
    "tt0207954",
    "tt0393807",
    "tt0005149"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.406Z"
}