{
  "movieId": "tt0001088",
  "title": "The Way of Man",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheWayOfMan1909",
      "id": "TheWayOfMan1909",
      "title": "\"The Way Of Man\" (1909) starring Arthur V. Johnson and Florence Lawrence",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Way of Man\" is a short drama directed by D.W. Griffith.  The film is included in our program to illustrate the work of three of our stars: actress Florence Lawrence, actor Arthur V. Johnson and cinematographer Billy Bitzer. A man leaves his girlfriend to make a fortune. When he returns he finds that her beauty is not what it was. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Florence Lawrence, Arthur V. Johnson, Mary Pickford Distributed by                   Biograph Company Release date                      June 28, 1909 Country                             United States Running time                    12 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 203139660,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/TheWayOfMan1909",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 12659
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-way-of-man",
      "id": "silent-the-way-of-man",
      "title": "The Way of Man",
      "fileSize": 162718562,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-the-way-of-man",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 343
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5,
    "imdbVotes": 78,
    "Genre": "Short, Drama",
    "Plot": "Tom Horne deeply loved pretty little Mabel Jarrett, and that his love was returned goes without saying. Tom's ebullient ambition is intensified by his great love for the girl, so he decides to go out west to fight for fame and fortune to be more worthy of her. After some time in the land of promise he succeeds in attaining the end for which he had striven and writes of his intention to return and claim her for his own. Meanwhile, Mabel's cousin Winnie has visited her and is to spend the summer months. At the receipt of Tom's letter, Mabel is in the seventh heaven of delight, when cruel fate plunges her into the depths of despair, for a horrible accident occurs. During the evening, while Mabel is in the act of lighting the lamp, it explodes, frightfully burning her face and head. It is conclusive that the poor girl will be disfigured for life. What a blow it is to her almost on the eve of Tom's return! They all try to cheer her, although fully realizing her sad plight. Winnie in particular does her best to allay her anticipating fears. However, Tom arrives and is dreadfully shocked at Mabel's appearance. This wounds Mabel, but he makes an effort to dissemble and make her believe that the awful scar will make no difference; will not lessen his affection for her, or dissipate his desire to make her his wife. But, ah, mere words are empty, and poor Mabel can see a tinge of repugnance in his attitude, and discerns a decided attachment between her cousin and Tom. Winnie realizes this also, and tries to leave the place to be out of the way. Mabel discovers this sacrificial move on the part of Winnie and prevents it by making the sacrifice herself. Leaving a note bidding all farewell, and hoping Tom and Winnie will be married, she goes from the house and makes her way to the coast. Placing her cloak and hat on the high rocky cliff, she hides, so they at once assume she has jumped into the sea. When they have left for the house, all mourning the brave girl as dead, she then goes and enlists her services at an orphan asylum to take care of the poor, homeless foundlings. Later Tom and Winnie are happily married, both holding a tender, reverent remembrance for the brave self-sacrificing girl whom they imagine buried in the dark waters of the remorseless, restless sea.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Arthur V. Johnson, Florence Lawrence, Mary Pickford",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000828",
    "tt0001016",
    "tt0000800",
    "tt0001032",
    "tt0000852",
    "tt0001050",
    "tt0000854",
    "tt0001083",
    "tt0000942",
    "tt0000972",
    "tt0000986",
    "tt0000880"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}