{
  "imdbId": "tt0043998",
  "title": "The Scarf",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1951-the-scarf-the-dungeon-evidencia-tragica-ewald-andre-dupont-vose",
      "id": "1951-the-scarf-the-dungeon-evidencia-tragica-ewald-andre-dupont-vose",
      "title": "1951 - The Scarf - The Dungeon - Evidencia trágica - Ewald André Dupont - VOSE",
      "description": "For Academic - Educational Use Only",
      "fileSize": 395163253,
      "addedAt": "2026-01-07T00:06:06.562Z",
      "thumbnail": "https://archive.org/services/img/1951-the-scarf-the-dungeon-evidencia-tragica-ewald-andre-dupont-vose",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 708
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/scf88769",
      "id": "scf88769",
      "title": "The Scarf",
      "description": "Title: The Scarf Summary: A man believe to have murdered a woman, escapes from the insane asylum to find if he was the one to actually kill her using the scarf she was wearing. Directed by: Ewald André Dupont Actors: Directed by Ewald André Dupont. With John Ireland, Mercedes McCambridge, James Barton Production Company: Gloria Productions Inc. Release Date: 6 April 1951 (USA) Aspect Ratio: 1.37 : 1 John Barrington escapes from an asylum for the criminally-insane and finds refuge on the ranch of turkey-raiser Ezra Thompson. Barrington, who has suffered from amnesia, finds his memory returning slightly and he sets out on his mission of learning the truth about whether or not he really murdered his sweetheart and is actually insane. He goes to Los Angeles to visit his oldest-and-best friend, psychiatrist David Dunbar, who was a witness to Barrington's crime. Dunbar repeats his story to Barrington, convinces Barrington that he did commit the crime, and then betrays him to the police. However, Thompson, Connie Carter and others are not totally convinced of Barrington's guilt.",
      "fileSize": 657175087,
      "addedAt": "2026-01-07T00:10:40.953Z",
      "thumbnail": "https://archive.org/services/img/scf88769",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 1720
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thescarf1953",
      "id": "thescarf1953",
      "title": "The Scarf (1951) John Ireland, Mercedes McCambridge - Film Noir Full Movie",
      "description": "The Scarf is a 1951 American film noir directed by Ewald André Dupont and starring John Ireland, Mercedes McCambridge, James Barton, and Emlyn Williams. Wikipedia: https://en.wikipedia.org/wiki/The_Scarf_(film) Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 763341346,
      "addedAt": "2026-01-07T00:12:44.281Z",
      "thumbnail": "https://archive.org/services/img/thescarf1953",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 9140
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "93 min",
    "imdbRating": 6.7,
    "imdbVotes": 671,
    "Genre": "Drama, Film-Noir, Thriller",
    "Plot": "John Barrington escapes from an asylum for the criminally insane and finds refuge on the ranch of turkey-raiser Ezra Thompson. Barrington, who has suffered from amnesia, finds his memory returning slightly and he sets out on his mission of learning the truth about whether or not he really murdered his sweetheart and is actually insane. He goes to Los Angeles to visit his oldest and best friend, psychiatrist David Dunbar, who was a witness to Barrington's crime. Dunbar repeats his story to Barrington, convinces Barrington that he did commit the crime, and then betrays him to the police. However, Thompson, Connie Carter and others are not totally convinced of Barrington's guilt.",
    "Director": "Ewald André Dupont",
    "Writer": "Ewald André Dupont, Isadore Goldsmith, E.A. Rolfe",
    "Actors": "John Ireland, Mercedes McCambridge, James Barton",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043938",
    "tt0043560",
    "tt0043340",
    "tt0045309",
    "tt0041791",
    "tt0042046",
    "tt0043320",
    "tt0047205",
    "tt0041125",
    "tt0041113",
    "tt0046368",
    "tt0044364"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.281Z"
}