{
  "movieId": "tt0032690",
  "title": "The Last Alarm",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/last_alarm",
      "id": "last_alarm",
      "title": "Last Alarm",
      "description": "Captain Hadley (J. Farrell MacDonald, who also appeared as the City Editor in \"Danger Ahead\") reaches the age limit for firefighter and is retired. While he is bored out of his mind at home, an arsonist (George Pembroke), who evidently is called Wendell, despite the fact that noone ever calls him by name, starts to burn the city down, building by building. After his friend Burt (Joel Friedkin) dies fighting a fire, Hadley unofficially joins up with the arson squad to track down the arsonist; but as Hadley zeroes in on Wendell, Wendell zeroes in on Hadley... [Synopsis by uniQ .] You can find more information regarding this film on its IMDb page .",
      "fileSize": 4326685261,
      "addedAt": "2026-01-07T00:09:38.888Z",
      "thumbnail": "https://archive.org/services/img/last_alarm",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 97648
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jFM6lQFnZkc",
      "id": "jFM6lQFnZkc",
      "title": "The Last Alarm (1940) [Crime] [Drama]",
      "description": "The Last Alarm is a 1940 American Monogram Picture film directed by William West.\n\nCaptain Jim Hadley, Fire Chief, has his retirement dinner after 40 years in the service. Next day, time hangs very heavy on his hands so that he even chats to a brush salesman (who has a perfect Elmer Fudd voice.) Bored he later visits his old fire station; Fire Company No.7 and talks to the men there, who are called out on a fire. The Great Eastern Insurance Company where Frank Rogers (who is interested in Hadley's daughter Jane) works. There has been a number of fires lately and a firebug (arsonist) is suspected. This thought is echoed at the Arson Bureau where Lieutenant King, chased up by the Mayor, tells Henderson and Roberts he wants results. They know it is an arsonist who uses time bombs and petrol. The arsonist turns out to be the keeper of an antiques shop, which Joan visits.\n\nJim is making plans for the future with Burt Stafford who is due to retire soon. Burt is called out on a fire with the others and is very badly injured there. He dies in hospital, with Jim standing beside him. The antiques man has called at the Hadley home to bring a salt and pepper set he had to do minor work on, which Joan had bought. She sees the gleam in his eyes when she lights a match. Jim joins the arson investigation at the bureau, having had some experience when he was in the fire brigade. Spectroscopic analysis of wood found at the scene of the last big fire reveals that part of the burnt time bomb box Jim found was maple wood, so he, Henderson and Roberts scour the city for the maker of the boxes and who they sold them to.\n\nAt another big fire, Jim comes across a statue of Vulcan (Roman god of fire) which the arsonist dropped, it being his inspiration. The arsonist gets it from Jim's unlocked car where he put it. Mention of this statue later and the fact that Frank and Joan saw it in the antique shop window provide a strong lead so they get a search warrant. They do not find any bomb making equipment but Jim finds wood shavings which later analysis reveals to be the same wood as that used for the time bomb box. Jim and Frank go after the arsonist who has lost his bureau tail. The arsonist goes to the basement of the Hadley house where he plants a time bomb. He goes upstairs and confronts Mrs Hadley and Joan and as Jim and Frank realise he may be back at their house, having been seen in the vicinity, the bomb goes off and the basement catches fire. The arsonist tells the women Jim should not have interfered in his work. The men bust in the door and while Frank escorts the women outside, Jim goes after the arsonist, who now babbling about being the god of fire, falls down the basement steps into the burning basement and dies. Some time later there is another dinner in honour of Jim who has got a new job. Honorary Fire Chief of the city.\n\nThe film contained film from a number of large authentic fires, a fire station, and firemen rushing to the fires and fighting the fires. No acknowledgment was given to the fire service. The unnamed city was probably Los Angeles.\n\n---\n\nDirected by William West, produced by Ted Richmond (associate producer) and T.R. Williams (producer), written by Al Martin, starring J. Farrell MacDonald as Jim Hadley, Polly Ann Young as Joan Hadley, Warren Hull as Frank Rogers, George, Pembroke as Wendell, Mary Gordon as Mrs Hadley, Joel Friedkin as Burt Stafford, Bruce MacFarlane as Jack Henderson, Eddie Hart as Dick Roberts, Willard Hall as Briggs, Charles Anthony Hughes Lieutenant King, Charles R. Phipps as Stevens, Eddie Kane as Fire Chief, James Coughlin as Cummings, Ted Richmond, T.R. Williams, Lee Zahler, Harry Neumann, Russell F. Schoengarth, Chris Beute, Glenn Cook and Karl Zint.\n\n---\n\nSource: \"The Last Alarm\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 December 2011. Web. 19 September 2012. http://en.wikipedia.org/wiki/The_Last_Alarm.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:45.858Z",
      "thumbnail": "https://i.ytimg.com/vi/jFM6lQFnZkc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBICB8wC0PQhXUnLltb0uiyPKqdig",
      "duration": 3206,
      "language": "en",
      "year": 1940,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kTja8jhW7eo",
      "id": "kTja8jhW7eo",
      "title": "The Last Alarm (1940) CRIME THRILLER",
      "description": "Stars: J. Farrell MacDonald, Polly Ann Young, Warren Hull\nDirector: William West\nProduction Company: Sherwill Productions, Inc.\n\nA veteran firefighter is forced to retire at age 65 by the Fire Department. However, when one of his friends dies in a blaze set by a serial arsonist, the now-retired fireman teams up with his daughter and her fiancé, who is an investigator for an insurance company, to hunt down and capture the arsonist.",
      "addedAt": "2025-12-26T23:50:54.575Z",
      "thumbnail": "https://i.ytimg.com/vi/kTja8jhW7eo/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB7gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLBKDOB0SWgL6DQpOx9JPvNUQGsaPg",
      "duration": 3205,
      "language": "en",
      "year": 1940,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fqe2zemSsvs",
      "id": "fqe2zemSsvs",
      "title": "The Last Alarm (1940) Action, Adventure, Crime Full Length Movie",
      "description": "A veteran fireman heads up an arson squad searching for a dangerous pyromaniac who is intent on setting the city ablaze. \n\nDirector: William West\nWriter: Al Martin \nStars: J. Farrell MacDonald, Warren Hull, Polly Ann Young \nGenres: Action | Adventure | Crime | Drama  \n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:47:53.769Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/fqe2zemSsvs/maxresdefault.webp?v=6228e822",
      "duration": 3204,
      "language": "en",
      "year": 1940,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 5.6,
    "imdbVotes": 226,
    "Genre": "Action, Adventure, Crime",
    "Plot": "The Fire Department forces a veteran firefighter to retire at age 65, but when one of his friends dies in a blaze set by a serial arsonist, the now-retired firefighter teams up with his daughter and her fiancé, an investigator for an insurance company, to hunt down and capture the arsonist.",
    "Director": "William Beaudine",
    "Writer": "Al Martin",
    "Actors": "J. Farrell MacDonald, Warren Hull, Polly Ann Young",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032559",
    "tt0035057",
    "tt0032790",
    "tt0033082",
    "tt0033429",
    "tt0032832",
    "tt0032557",
    "tt0033426",
    "tt0031207",
    "tt0033547",
    "tt0033903",
    "tt0034161"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}