{
  "movieId": "tt0029151",
  "title": "The Little Match Girl",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/little-match-girl-1937",
      "id": "little-match-girl-1937",
      "title": "Little Match Girl (1937)",
      "description": "A small girl makes her living selling matches on the streets of New York. It's winter, and the hustling crowds at best ignore her, and some are outright rude. She takes shelter and, to try to stave off the cold a bit, lights a match. It gets blown out; this happens again, then on the third try, she falls into a dream. In this dream, cherubs attend her, she gets a new doll, then a new dress. The cherubs put her on a throne. Then a storm comes, and she goes toward a candle. That candle goes out, and we see that back in the real world, so did her match and her life. An angel comes along and takes her soul. Watch on RetroFlix:  https://retroflix.org/the-little-match-girl-1937/",
      "fileSize": 358867326,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/little-match-girl-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 311
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 6.9,
    "imdbVotes": 410,
    "Genre": "Animation, Short, Drama",
    "Plot": "A small girl makes her living selling matches on the streets of New York. It's winter, and the hustling crowds at best ignore her, and some are outright rude. She takes shelter and, to try to stave off the cold a bit, lights a match. It gets blown out; this happens again, then on the third try, she falls into a dream. In this dream, cherubs attend her, she gets a new doll, then a new dress. The cherubs put her on a throne. Then a storm comes, and she goes toward a candle. That candle goes out, and we see that back in the real world, so did her match and her life. An angel comes along and takes her soul.",
    "Director": "Arthur Davis, Sid Marcus",
    "Writer": "Hans Christian Andersen, Arthur Davis, Cal Howard",
    "Actors": "Dorothy Compton, Beatrice Hagen, Gertrude Lawrence",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    "tt0148491",
    "tt0146411",
    "tt0147923",
    "tt0148326",
    "tt0151332",
    "tt0028671",
    "tt0029384",
    "tt0149096",
    "tt0030238",
    "tt0030818",
    "tt0151536",
    "tt0148447"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.891Z"
}