{
  "imdbId": "tt0049366",
  "title": "Invasion of the Body Snatchers",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/invasion-of-the-body-snatchers-1956_202511",
      "id": "invasion-of-the-body-snatchers-1956_202511",
      "title": "Invasion of the Body Snatchers (1956)",
      "description": "I nvasion of the Body Snatchers (1956) is a science fiction film that explores themes of paranoia and conformity. The plot unfolds in the fictional town of Santa Mira, California, where a small-town doctor, Dr. Miles Bennell , returns from a trip and notices that many of his patients are claiming that their loved ones are not who they seem to be. As Dr. Bennell investigates, he discovers that citizens are exhibiting strange behavior and feel alienated from their families. Some believe that their relatives are being replaced by emotionless duplicates. The source of this transformation is revealed to be alien pods, which duplicate people while they sleep. These pods replicate the appearance and memories of individuals but strip away their emotions.As more townsfolk are converted into pod people, Dr. Bennell teams up with his ex-girlfriend, Becky Driscoll , to uncover the mystery and stop the invasion.The tension escalates as they try to escape the town and find safety. In a suspenseful climax, Dr. Bennell discovers that the invasion is far more widespread than he initially realized. The film concludes with a haunting note, as Dr. Bennell becomes one of the last humans aware of the invasion, highlighting the themes of conformity and the loss of individuality. The film is not just a horror story; it serves as a critique of societal trends and the fear of losing one's identity, resonating with Cold War anxieties and the era's cultural context.",
      "fileSize": 1261483904,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/invasion-of-the-body-snatchers-1956_202511",
      "language": "eng",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 292
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 7.7,
    "imdbVotes": 58248,
    "Genre": "Drama, Horror, Sci-Fi",
    "Plot": "Dr. Miles Bennell returns to his small town practice to find several of his patients suffering the paranoid delusion that their friends or relatives are impostors. He is initially skeptical, especially when the alleged doppelgangers are able to answer detailed questions about their victim's lives, but he is eventually persuaded that something odd has happened and determines to find out what is causing this phenomenon.",
    "Director": "Don Siegel",
    "Writer": "Daniel Mainwaring, Jack Finney, Richard Collins",
    "Actors": "Kevin McCarthy, Dana Wynter, Larry Gates",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    "tt0049900",
    "tt0049248",
    "tt0050720",
    "tt0051020",
    "tt0051622",
    "tt0050155",
    "tt0047370",
    "tt0051866",
    "tt0047417",
    "tt0011130",
    "tt0025391",
    "tt0035640"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.187Z"
}