{
  "movieId": "tt0057851",
  "title": "Apache Rifles",
  "year": 1964,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NVwAuYqO5PY",
      "id": "NVwAuYqO5PY",
      "title": "Apache Rifles (1964) One Man Vowed to Stop the Bloodshed! Western Movie by William Witney",
      "description": "Caught in the Crossfire of Passions and Greed!\nCaptain Jeff Stanton is tasked with returning the rebellious Apaches to their reservation. After capturing the chief’s son, he negotiates a fragile truce, promising to keep settlers off Indian lands. However, greedy gold miners and townsfolk sabotage the peace, leading to betrayal and violence. As Stanton’s views soften due to a romance with a part-Apache missionary, a new ruthless commander takes over, threatening to ignite a devastating conflict.\n\nOriginal title: Apache Rifles (1964)  \nAlternative titles: Apache Uprising, Rifles apaches, Rifles Apaches, Tamburi ad ovest, La Fureur des Apaches, Aufstand in Arizona, Apaçi Tüfekleri, Strzelby Apaczów\n\n\nDirector: William Witney\nWriters: Charles Smith, Kenneth Gamet, Richard Schayer\nGenre: Western\nMain cast: \nAudie Murphy as Jeff Stanton\nLinda Lawson as Dawn Gillis\nMichael Dante as Red Hawk\nL.Q. Jones as Mike Greer\nKen Lynch as Hodges\nJoseph Vitale as Victorio\n\n\n00:00 Full movie \n01:16 Captain Stanton's cavalry pursues Victorio's fleeing Apaches across Arizona Territory\n19:04 Half-Comanche missionary Miss Gillis challenges Stanton's prejudices\n31:16 Miners discover gold on Apache land, igniting violent tensions\n42:21 Colonel Perry undermines Stanton's patrol strategy, leaving reservations vulnerable\n47:56 Thompson's mysterious death sparks bloody conflict between miners and Apaches\n1:21:26 Victorio falls in battle as Red Hawk assumes leadership and brokers peace with a conflicted Stanton\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:01.928Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/NVwAuYqO5PY/maxresdefault.webp?v=6732d4a9",
      "duration": 5512,
      "language": "en",
      "year": 1964,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "92 min",
    "imdbRating": 6.4,
    "imdbVotes": 3395,
    "Genre": "Western",
    "Plot": "In the Arizona Territory in 1879, Captain Jeff Stanton takes command of a cavalry unit tasked with returning the Apaches to their reservation. The Mescaleros Apaches, led by chief Victorio, have left the reservation and openly attacked farmers,gold miners and settlers who trespassed on their lands. During a skirmish, Captain Stanton captures Red Hawk, the son of the chief, and uses him to bargain for a truce.Stanton promises to chief Victorio to see that gold miners and settlers are kept off Indian lands.However, some greedy townsfolk and disfranchised gold miners plot to break the uneasy truce.They murder the Indian agent and blame the Apaches.They complain to Washington D.C. about Captain Stanton's negotiated truce.Stanton is replaced by Colonel Perry who intends to use a heavy hand in subduing the Apaches.The consequence of this strategy change proves disastrous.",
    "Director": "William Witney",
    "Writer": "Charles Smith, Kenneth Gamet, Richard Schayer",
    "Actors": "Audie Murphy, Michael Dante, Linda Lawson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039157",
    "tt0044506",
    "tt0040333",
    "tt0041347",
    "tt0038593",
    "tt0038611",
    "tt0040644",
    "tt0039678",
    "tt0039861",
    "tt0029692",
    "tt0039180",
    "tt0046140"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:34:27.020Z"
}