{
  "imdbId": "tt0016195",
  "title": "Paint and Powder",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-paint-and-powder",
      "id": "silent-paint-and-powder",
      "title": "Paint and Powder",
      "fileSize": 1118162217,
      "addedAt": "2026-01-07T00:11:07.410Z",
      "thumbnail": "https://archive.org/services/img/silent-paint-and-powder",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 1499
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "70 min",
    "imdbRating": 8.3,
    "imdbVotes": 31,
    "Genre": "Drama",
    "Plot": "Elaine Hammerstein, part of the great theatrical family of producers and lyricists was a leading star on Broadway and -- in this period -- a leading actress in the films. Here in this backstage musical melodrama, she's a spunky New York Irish girl who makes her way up to star in a Broadway musical, but of course, she loves fellow New York Irish Teddy von Eltz. It's a full-dress melodrama co-written by Mrs. Fanny Hatton -- and, despite a few nice touches by director -- later MGM producer -- Hunt Stromberg, it doesn't work. It's hard to do musical numbers in silent pictures, although some people could manage -- Robert Z. Leonard could manage and von Stroheim's MERRY WIDOW works beautifully.However, the musical numbers, which should be set-pieces of beauty to contrast with the tawdriness of the rest of the melodrama, don't really come off. Miss Hammerstein looks best posing in the intermediate two-shots -- she is very charming but doesn't seem to know how to play to the camera, and the story line is fairly standard. Even the Demille-type party scene looks a little tired.While this is by no means a bad movie, it lacks anything to make it great. Worth a look. but missing it won't ruin your life.",
    "Director": "Hunt Stromberg",
    "Writer": "Harvey Gates, Fanny Hatton, Frederic Hatton",
    "Actors": "Elaine Hammerstein, Theodore von Eltz, Stuart Holmes",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015361",
    "tt0015648",
    "tt0015693",
    "tt0132960",
    "tt0015900",
    "tt0015842",
    "tt0016028",
    "tt0016377",
    "tt0016006",
    "tt0016107",
    "tt0016641",
    "tt0015634"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.410Z"
}