{
  "imdbId": "tt0036241",
  "title": "The Outlaw",
  "year": 1943,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y94EqnxKmYw",
      "id": "Y94EqnxKmYw",
      "title": "The Outlaw (1943), directed by Howard Hughes and starring Jane Russell",
      "addedAt": "2025-12-24T00:56:32.338Z",
      "thumbnail": "https://i.ytimg.com/vi/Y94EqnxKmYw/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA3Oi6zTzipYG3K7NB2YPjrzuVsGg",
      "duration": 6945,
      "language": "en",
      "year": 1943,
      "channelName": "Public Domain Movies - Classic Old Movies",
      "channelId": "UCT6gOjzXtqeb_oE-wZVHlFA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tGNCxaHzkXg",
      "id": "tGNCxaHzkXg",
      "title": "The Outlaw (1943) JANE RUSSELL",
      "description": "Movie Class by PizzaFLIX: Produced and directed by Howard Hughes, THE OUTLAW was completed in 1941 but banned due to its fixation on Jane Russell's breasts. With a reluctant edit of about 30 seconds, the film managed to get into theaters for a week in 1943 but was pulled for violations of the Hollywood Production Code. After America entered World War II, Hughes focused his attention on airplane manufacturing and all but abandoned films. Eventually, United Artists premiered the film on April 23, 1946, in San Francisco, and it became a box-office smash!\n\nStars: Jane Russell, Jack Buetel, Walter Huston, and Thomas Mitchell \nProducer/Director: Howard Hughes\nJane Russell's notorious big-screen debut! The voluptuous star plays the love interest to Billy the Kid in director Howard Hughes' scandalous and originally banned version of the legendary outlaw's tale.\n\nTRIVIA: Hughes felt that the camera did not do justice to Jane Russell's bust, so he had a new cantilevered underwire bra designed to allow for a more significant amount of her bosom to be exposed. Contrary to the myth and according to her 1988 autobiography, Russell said the ridiculous contraption was so uncomfortable that she never wore it during the filming of The Outlaw.",
      "addedAt": "2025-12-26T23:51:56.681Z",
      "thumbnail": "https://i.ytimg.com/vi/tGNCxaHzkXg/maxresdefault.jpg",
      "duration": 6942,
      "language": "en",
      "year": 1943,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "116 min",
    "imdbRating": 5.4,
    "imdbVotes": 5139,
    "Genre": "Action, Adventure, Drama",
    "Plot": "Newly appointed sheriff Pat Garrett is pleased when his old friend Doc Holliday arrives in Lincoln, New Mexico on the stage. Doc is trailing his stolen horse, and it is discovered in the possession of Billy the Kid. In a surprising turnaround, Billy and Doc become friends. This causes the friendship between Doc and Pat to cool. The odd relationship between Doc and Billy grows stranger when Doc hides Billy at his girl, Rio's, place after Billy is shot. She falls for Billy, although he treats her very badly. Interaction between these four is played out against an Indian attack before a final showdown reduces the group's number.",
    "Director": "Howard Hughes, Howard Hawks",
    "Writer": "Jules Furthman, Howard Hawks, Ben Hecht",
    "Actors": "Jack Buetel, Thomas Mitchell, Jane Russell",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0036046",
    "tt0036262",
    "tt0036400",
    "tt0034428",
    "tt0036164",
    "tt0034572",
    "tt0034948",
    "tt0034577",
    "tt0036878",
    "tt0035372",
    "tt0035532",
    "tt0037777"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:40:33.739Z"
}