{
  "imdbId": "tt0033323",
  "title": "All-American Co-Ed",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/All-AericanCoEd",
      "id": "All-AericanCoEd",
      "title": "All-American Co-Ed",
      "description": "All-girl school Mar Brynn tries to get more pupils and publicity by making fun of the Quincton college. For revenge, the boys there sent Bob Sheppard (Johnny Downs) to Mar Brynn, dressed as a girl, to give them a slight scandal. But he falls in love with Virginia (Frances Langford), the girl who is putting on a show there. Now Bob has the problem of getting revenge for Quinceton and not loosing his girl, especially when Quinceton hears about his relationship and decides to sent him support.",
      "fileSize": 1492085203,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/All-AericanCoEd",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 9924
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DDcsfppyB4s",
      "id": "DDcsfppyB4s",
      "title": "All-American Co-Ed (1941) | Colorized Public Domain College Comedy Musical with Frances Langford",
      "description": "All-American Co-Ed (1941) is a lighthearted musical comedy directed by LeRoy Prinz, starring Frances Langford, Johnny Downs, and Marjorie Woodworth. Restored and colorized for today’s audiences, this public domain gem blends romance, humor, and college hijinks with lively musical numbers. Originally produced during the early 1940s, it reflects the era’s fascination with campus comedies and patriotic themes while offering pure entertainment. By reintroducing this classic in vivid color and enhanced quality, modern viewers in the United States, Europe, and worldwide can rediscover a cheerful film once overlooked.\n\nPlot Summary:\nClairmount College for Women is in trouble—its enrollment numbers are low, and Dean Roger Crandall seeks a way to generate attention. His niece, Virginia, writes to a popular men’s college newspaper, mocking their rival all-male fraternity for producing effeminate students. Offended, fraternity president Bob Sheppard devises a bold prank: he disguises himself as “Bobbie DeWolfe,” an effervescent young woman, and enrolls at Clairmount to infiltrate the school. His mission is to prove the point and stir up laughs, but complications arise when he genuinely falls in love with Virginia. As Bob tries to maintain his disguise, he also participates in the school’s musical revue, creating a series of comic situations filled with mistaken identities, song, and dance. Eventually, the truth is revealed, but not before Bob redeems himself by helping the college succeed.\n\nCast and Crew:\n• Director: LeRoy Prinz\n• Producer: Hal Roach\n• Screenplay: Cortland Fitzsimmons, Hal Roach Jr.\n• Cinematography: Jack MacKenzie\n• Editing: William F. Claxton\n• Music: Edward Ward\n\nStarring:\n• Frances Langford as Virginia\n• Johnny Downs as Bob Sheppard / Bobbie DeWolfe\n• Marjorie Woodworth as Professor Marilyn Morgan\n• Noah Beery Jr. as Eddie\n• Harry Langdon as Professor Lambert\n• Esther Dale as Dean Roger Crandall\n• Alan Hale Jr. (early appearance, uncredited)\n\nFilm Details:\n• Release Year: 1941\n• Runtime: 74 minutes\n• Country: United States\n• Language: English\n• Studio: Hal Roach Studios\n• Genre: Comedy, Musical\n\nFilm Significance:\nAll-American Co-Ed combines screwball comedy with musical numbers, showcasing the bubbly energy of early 1940s American cinema. Frances Langford, known as a popular radio and film singer of the era, headlines the cast with her vocal talents, while Johnny Downs brings charm and comedic timing. The film also gave early appearances to actors who would later achieve fame. Its college setting, disguises, and mistaken-identity gags made it a favorite in wartime America, offering audiences escapism and laughter in uncertain times.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like All-American Co-Ed remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1941 version was in black and white, common for comedies of its time. While charming in its original format, many modern audiences overlook older films due to their visual style. This restored, colorized edition brings the lively musical performances, romantic misunderstandings, and slapstick gags to life in a fresh way. By enhancing the visual appeal, we ensure that new audiences can enjoy the energy, humor, and nostalgia of this college comedy musical.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema—musicals, comedies, dramas, and forgotten B-movies. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#AllAmericanCoEd #FrancesLangford #1940sMusical #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #CollegeComedy #FilmRestoration #JohnnyDowns #ClassicCinem",
      "addedAt": "2025-12-24T00:47:27.484Z",
      "thumbnail": "https://i.ytimg.com/vi/DDcsfppyB4s/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZiBmKGYwDw==&rs=AOn4CLBF1OiiRUS3Q-3OdfgQu3zBZ8zUJA",
      "duration": 2860,
      "language": "en",
      "year": 1941,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AmericanCoEd",
      "id": "AmericanCoEd",
      "title": "All-American Co-Ed",
      "description": "Title: All-American Co-Ed Summary: All-girl school Mar Brynn tries to get more pupils and publicity by making fun of the Quincton college. For revenge, the boys there sent Bob Sheppard to Mar Brynn, dressed as a girl, to ... Directed by: LeRoy Prinz Actors: Frances Langford, Johnny Downs, Marjorie Woodworth Production Company: Hal Roach Studios Release Date: 31 October 1941 (USA) Aspect Ratio: 1.37 : 1 Color: Black and White All-girl school Mar Brynn tries to get more pupils and publicity by making fun of the Quincton college. For revenge, the boys there sent Bob Sheppard to Mar Brynn, dressed as a girl, to give them a slight scandal. But he falls in love with Virginia, the girl who is putting on a show there. Now Bob has the problem of getting revenge for Quinceton and not loosing his girl, especially when Quinceton hears about his relationship and decides to sent him support...",
      "fileSize": 441861607,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AmericanCoEd",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 2714
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c66sLemoYLo",
      "id": "c66sLemoYLo",
      "title": "All-American Co-Ed (1941) FRANCES LANGFORD",
      "description": "Stars: Frances Langford, Johnny Downs, Marjorie Woodworth \nDirector: LeRoy Prinz\n\nAll-girl school Mar Brynn tries to get more pupils and publicity by making fun of the Quincton college. For revenge, the boys there sent Bob Sheppard to Mar Brynn, dressed as a girl, to give them a slight scandal. Complications arise when he falls in love with Virginia.",
      "addedAt": "2025-12-26T23:48:59.811Z",
      "thumbnail": "https://i.ytimg.com/vi/c66sLemoYLo/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLANlwfoLX1u7J9WJs1R1xZQMPYsKQ",
      "duration": 2915,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4gCEn0ywtYI",
      "id": "4gCEn0ywtYI",
      "title": "All-American Co-Ed (1941) College pranks, and the gayest musical love story!",
      "description": "After a women's college insults the Zeta boys' college, fraternity brothers enter prankster Bob Sheppard (Johnny Downs) into a scholarship lottery. He goes undercover as \"Bobbie DeWolfe\" to infiltrate the all-girls' college, where he crosses paths with the sharp-witted Bunny (Marjorie Woodworth) and the charming Virginia (Frances Langford). Though the Zeta boys are celebrated for their comedy drag revue, staying undercover as a woman at an all-girls' school wasn't part of the rehearsal!\n\nOriginal title: All-American Co-Ed\nAlternative title: All-American Girl, Campus Rhythm\n\nColorized version: https://youtu.be/ORSpA3yMWHw\n\n\nDirector: LeRoy Prinz\nWriters: Hal Roach Jr., Cortland Fitzsimmons, Kenneth Higgins\nActors: Frances Langford, Johnny Downs, Marjorie Woodworth & Alan Hale Jr.\n\nGenres: Comedy, Musical, Rom-Com\nRelease date: October 31, 1941\nFilming location: California, USA\n\nOfficial taglines: \nHEY!...IT'S HERE...THE SEASON'S GAYEST MUSICAL!\nZeta boys don't succeed, they inherit!\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:31:55.785Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/4gCEn0ywtYI/maxresdefault.webp?v=67beba8f",
      "duration": 2915,
      "language": "en",
      "year": 1941,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "49 min",
    "imdbRating": 4.9,
    "imdbVotes": 408,
    "Genre": "Comedy, Musical",
    "Plot": "All-girl school Mar Brynn tries to get more pupils and publicity by making fun of the Quincton college. For revenge, the boys there sent Bob Sheppard to Mar Brynn, dressed as a girl, to give them a slight scandal. But he falls in love with Virginia, the girl who is putting on a show there. Now Bob has the problem of getting revenge for Quinceton and not loosing his girl, especially when Quinceton hears about his relationship and decides to sent him support...",
    "Director": "LeRoy Prinz",
    "Writer": "Cortland Fitzsimmons, Kenneth Higgins, LeRoy Prinz",
    "Actors": "Frances Langford, Johnny Downs, Marjorie Woodworth",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 2 Oscars. 2 nominations total"
  },
  "relatedMovies": [
    "tt0034730",
    "tt0033632",
    "tt0033878",
    "tt0034265",
    "tt0123022",
    "tt0033704",
    "tt0034055",
    "tt0178995",
    "tt0034416",
    "tt0037399",
    "tt0031077",
    "tt0446928"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}