{
  "imdbId": "tt0043924",
  "title": "A Place in the Sun",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-place-in-the-sun-1951_202509",
      "id": "a-place-in-the-sun-1951_202509",
      "title": "A Place In The Sun (1951) Montgomery Clift · Elizabeth Taylor",
      "description": "Drama about a climber (Montgomery Clift) between two women. .",
      "fileSize": 3932291152,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-place-in-the-sun-1951_202509",
      "language": "eng",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 263
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "122 min",
    "imdbRating": 7.7,
    "imdbVotes": 25414,
    "Genre": "Drama, Romance",
    "Plot": "A chance meeting with his uncle leads to George Eastman (Montgomery Clift) being caught in the middle of two worlds, neither side in which he truly belongs. The son of poor missionaries, his father who has passed away, George met his wealthy paternal uncle Charles Eastman (Herbert Heyes) while George was working as a bellhop in his uncle's hotel in Chicago, Illinois. Wanting a better life for himself, George takes his uncle up on his offer for a placement somewhere in one of the Eastman factories, Charles' want in this offer being for any Eastman to take his proper place in the world. Under the directive of his cousin Earl (Keefe Brasselle), George is placed on the factory assembly line, largely neglected by the Eastmans as a whole. Regardless, George still does see this position as a stepping stone to something better, for which he is willing to work hard to achieve. George, lonely in his new surroundings, breaks the company rule of no fraternizing with fellow employees when he starts to date fellow Eastman assembly line worker Alice Tripp (Shelley Winters). Several months later, Charles, remembering about his nephew, promotes George both professionally and personally. Although uncomfortable in society gatherings, George eventually is befriended by one person in this new world, the beautiful society maiden Angela Vickers (Dame Elizabeth Taylor), who George fell in love with at first sight even before he arrived in town. Angela too falls in love with George, which does not sit well with her parents if only because they know nothing of him. George is caught between his want for prosperity and being with Angela, the woman he truly loves, and his obligations to needy Alice, who learns of his society friends and Angela, who ends up getting pregnant by him, and who uses whatever means in her limited powers to pressure him to do right by her in marrying her.",
    "Director": "George Stevens",
    "Writer": "Theodore Dreiser, Patrick Kearney, Michael Wilson",
    "Actors": "Montgomery Clift, Elizabeth Taylor, Shelley Winters",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 6 Oscars. 15 wins & 10 nominations total"
  },
  "relatedMovies": [
    "tt0034012",
    "tt0043526",
    "tt0045793",
    "tt0043409",
    "tt0043830",
    "tt0043651",
    "tt0043652",
    "tt0193798",
    "tt0043313",
    "tt0201504",
    "tt0178749",
    "tt0043532"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}