{
  "imdbId": "tt0044119",
  "title": "That's My Boy",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thats-my-boy-1951",
      "id": "thats-my-boy-1951",
      "title": "That's My Boy (1951)",
      "description": "Jack Jackson, the greatest football player in Ridgefield College history, is disappointed that his only son Junior is an uncoordinated, allergy-ridden bookworm. He uses his athletic reputation and standing as #1 alumni contributor to pressure the coach to take Junior onto the team. In addition, he pays the tuition of Junior's financially needy classmate Bill Baker, a potential all-American, with the understanding that he will room with Junior and mentor him athletically and socially. Junior's initial efforts as quarterback prove disastrous and further complications arise when the room mates both fall in love with the same co-ed. Watch on RetroFlix:  https://retroflix.org/thats-my-boy-1951/",
      "fileSize": 2212441304,
      "addedAt": "2026-01-07T00:11:46.531Z",
      "thumbnail": "https://archive.org/services/img/thats-my-boy-1951",
      "language": "eng",
      "year": 1951,
      "collection": "feature_films",
      "downloads": 140
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "104 min",
    "imdbRating": 6.1,
    "imdbVotes": 1105,
    "Genre": "Comedy, Music, Sport",
    "Plot": "Jarring Jack Jackson, the greatest football player in Ridgefield College history, is disappointed that his only son Junior is an uncoordinated, allergy-ridden bookworm. He uses his athletic reputation and standing as #1 alumni contributor to pressure the coach to take Junior on the team. In addition, he pays the tuition of Junior's financially needy classmate Bill Baker, a potential all-American, with the understanding that he will room with Junior and mentor him athletically and socially. Junior's initial efforts as quarterback prove disastrous, and further complications arise when the roommates both fall in love with the same co-ed. Plot complications become critical as the climactic homecoming game approaches.",
    "Director": "Hal Walker",
    "Writer": "Cy Howard",
    "Actors": "Dean Martin, Jerry Lewis, Ruth Hussey",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    "tt0042209",
    "tt0045589",
    "tt0045094",
    "tt0044222",
    "tt0043123",
    "tt0185288",
    "tt0044774",
    "tt0045769",
    "tt0038119",
    "tt0040508",
    "tt0040803",
    "tt0040919"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}