{
  "movieId": "tt0026422",
  "title": "Gold Diggers of '49",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gold-diggers-of-49-1935_202409",
      "id": "gold-diggers-of-49-1935_202409",
      "title": "Gold Diggers of '49 (1935)",
      "description": "The gold rush. Beans finds gold in the mountains and rushes into town with the news. Soon, everyone has rushed out to the mountains, but because Porky takes Beans in his car (!), they get there first. Porky finds a gold nugget, then keeps taking it from his pocket. Beans finds a treasure chest that contains a book, “How to Find Gold.” A bad guy spots a sack near Porky’s equipment and lassos it; Porky tells Beans that if he retrieves the sack, he can have Porky’s daughter. Beans gives chase in Porky’s car; there’s a shootout. The car runs out of gas, so Beans refills it with moonshine and it takes off like a shot. He snares the bad guy, the sack, and Porky and races back to town. Porky gives Beans his daughter’s hand and reveals the contents of the sack.",
      "fileSize": 936850582,
      "addedAt": "2026-01-07T00:08:32.018Z",
      "thumbnail": "https://archive.org/services/img/gold-diggers-of-49-1935_202409",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 294
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "8 min",
    "imdbRating": 6.2,
    "imdbVotes": 508,
    "Genre": "Family, Animation, Short",
    "Plot": "The gold rush. Beans finds gold in the mountains and rushes into town with the news. Soon, everyone (except Porky's daughter Little Kitty, who Beans fancies) has rushed out to the mountains, but because Porky takes Beans in his car (!), they get there first. Porky finds a gold nugget, then keeps taking it from his pocket. Beans finds a treasure chest that contains a book, \"How to Find Gold.\" A bad guy spots a sack near Porky's equipment and lassos it; Porky tells Beans that if he retrieves the sack, he can have Porky's daughter. Beans gives chase in Porky's car; there's a shootout. The car runs out of gas, so Beans refills it with moonshine and it takes off like a shot. He snares the bad guy, the sack, and Porky and races back to town. Porky gives Beans his daughter's hand and reveals the contents of the sack.",
    "Director": "Tex Avery",
    "Writer": "Tex Avery, Cal Howard",
    "Actors": "Billy Bletcher, Tommy Bond, The Californians",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027968",
    "tt0028109",
    "tt0029040",
    "tt0029426",
    "tt0029708",
    "tt0027371",
    "tt0028467",
    "tt0027779",
    "tt0029400",
    "tt0029422",
    "tt0029427",
    "tt0026481"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.018Z"
}