{
  "imdbId": "tt0032283",
  "title": "British Intelligence",
  "year": 1939,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OMGvZ2BNPR4",
      "id": "OMGvZ2BNPR4",
      "title": "British Intelligence (1940) [Thriller] [Romance] [War]",
      "description": "During World War I, Franz Strendler, a master German spy has cost the British dearly. In desperation, they send for their best agent, currently undercover in Germany. Pilot Frank Bennett (Bruce Lester) is sent to pick him up, but the Germans are forewarned and Bennett is shot down. Luckily, he survives and is rescued by friendly soldiers. While recovering in a hospital, Bennett is tended by a pretty nurse, Helene Von Lorbeer (Margaret Lindsay). He tells her he loves her, but she informs him she is leaving, and they will not see each other again. However, after Bennett falls asleep, she kisses him on the cheek.\n\nVon Lorbeer turns out to be a spy herself. She is recalled to Germany to receive a high honor sent personally by the Kaiser and to undertake a new mission. Posing as a refugee named Frances Hautry, she infiltrates the London household of Arthur Bennett (Holmes Herbert), a cabinet minister, and, coincidentally, Frank's father. She takes her orders from Valdar (Boris Karloff), the butler. However, unbeknownst to her, he is a British double agent. Valdar later secretly reports to Colonel Yeats (Leonard Mudie), the head of British Intelligence.\n\nWhen Bennett's secretary, also a German spy, taps out a secret message in code on her typewriter, Yeats is present and recognizes it. Since only Hautry is also in the office at the time, he sets a trap for her. A captured spy named Kurz seemingly escapes from the British and flees to Hautry's bedroom. She hides him in her closet, but then betrays him when Yeats and his men show up. Afterwards, she tells Valdar that she knew \"Kurz\" was an imposter.\n\nFrank Bennett unexpectedly shows up, his squadron and others having been recalled to London for some reason. He is surprised to find his former nurse there and under a different name. Hautry is forced to reveal that she is loyal to the British. However, Valdar overhears their conversation.\n\nThat night, the British cabinet meets in Bennett's home. It is the moment Valdar has been waiting for. He forces Hautry at gunpoint down in the cellar, where he has set a bomb to blow the house up under cover of a Zeppelin bombing raid. Hautry tells Valdar that she had no choice but to make up a story to allay Frank's suspicions. Convinced when she shows him the award she was given, Valdar finally reveals that he is Strendler.\n\nFortunately, Valdar has been under surveillance. Yeats and his men rush to the cellar door. When Valdar escapes through the coal shute, Hautry unlocks the door and informs Yeats about the bomb. Valdar rushes to his hideout to transmit the stolen British plans for the spring offensive, pursued by the British, but, ironically, a Zeppelin bombs the location and kills him and his confederates before he can send his information.\n\n----\n\nDirected by Terry O. Morse, produced by Bryan Foy,  written by Anthony Paul Kelly (play), Lee Katz (screenplay), Boris Karloff as Valdar, aka Franz Strendler, starring Margaret Lindsay as Helene Von Lorbeer aka Frances Hautry, Bruce Lester as Frank Bennett, Leonard Mudie as Colonel James Yeats, Holmes Herbert as Arthur Bennett and Austin Fairman as George Bennett.\n\n---\n\nSource: \"British Intelligence (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 19 November 2016. Web. 01 December 2016. https://en.wikipedia.org/wiki/British_Intelligence_(film) .\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:40:59.661Z",
      "thumbnail": "https://i.ytimg.com/vi/OMGvZ2BNPR4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAWnSQJf2fcgKxAGEd5ycDacKfGMA",
      "duration": 3624,
      "language": "en",
      "year": 1940,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BritishIntelligence1940",
      "id": "BritishIntelligence1940",
      "title": "British Intelligence",
      "description": "In 1917 London, elusive German spy Frantz Strendler regularly accesses crucial British military information and relays it to the German government, with disastrous results for the British on the front lines. British intelligence subsequently scrambles to uncover the master spy, who is hard at work to expand his own reach. The film features Boris Karloff and Margaret Lindsay. This print (obtained from the Public Domain Torrents site) is brighter, less grainy, and has a higher resolution (720x544 vs 640x480) than the one already available on the archive. External links: IMDB page American Film Institute entry Wikipedia entry Under the hood: VIDEO: DiVX 5 720x544 24bpp 23.976 fps 1476.1 kbps AUDIO: MP3 48000 Hz, 2 ch, s16le, 128.0 kbit Original registration: BRITISH INTELLIGENCE. Warner Bros. Pictures, Inc., c1940. Based on a play by Anthony Paul Kelly. Credits: Director, Terry Morse; screenplay, Lee Katz. © Warner Bros. Pictures, Inc.; 1Jan40; LP9355. Renewal registration: none",
      "fileSize": 1341967839,
      "addedAt": "2026-01-07T00:06:14.040Z",
      "thumbnail": "https://archive.org/services/img/BritishIntelligence1940",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 58254
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/british-intelligence-1939",
      "id": "british-intelligence-1939",
      "title": "British Intelligence (1939)",
      "description": "During WWI pretty German master spy Helene von Lorbeer is sent undercover to London to live with the family of a high-placed British official where she is to rendezvous with the butler Valdar, also a spy, and help him transmit secret war plans back to Germany. Watch on RetroFlix:  https://retroflix.org/british-intelligence-1939/",
      "fileSize": 377377274,
      "addedAt": "2026-01-07T00:07:45.164Z",
      "thumbnail": "https://archive.org/services/img/british-intelligence-1939",
      "language": "eng",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 91
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/british_intelligence",
      "id": "british_intelligence",
      "title": "British Intelligence",
      "description": "During WWI pretty German master spy Helene von Lorbeer is sent undercover to London to live with the family of a high-placed British official where she is to rendezvous with the butler Valdar, also a spy, and help him transmit secret war plans back to Germany.",
      "fileSize": 3104502250,
      "addedAt": "2026-01-07T00:07:45.164Z",
      "thumbnail": "https://archive.org/services/img/british_intelligence",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 150532
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NTKvH2Z5Rgw",
      "id": "NTKvH2Z5Rgw",
      "title": "British Intelligence (1940) BORIS KARLOFF",
      "description": "Stars: Boris Karloff, Margaret Lindsay, Bruce Lester\nDirector: Terry O. Morse\n\nAlthough the home of cabinet minister Arthur Bennett is a hotbed of spies, moles, and double agents, no one knows the true identity of notorious German spymaster Strendler.",
      "addedAt": "2025-12-26T23:57:02.735Z",
      "thumbnail": "https://i.ytimg.com/vi/NTKvH2Z5Rgw/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB-gSAAuADigIMCAAQARhgIGAoYDAP&rs=AOn4CLBe5PPcp-POfDU5uEM7fpm9YxHGUA",
      "duration": 3622,
      "language": "en",
      "year": 1940,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LURgEHMHSNY",
      "id": "LURgEHMHSNY",
      "title": "British Intelligence (1940) Boris Karloff | Full Lenght Thriller, Romance, Spy Movie",
      "description": "During WWI pretty German master spy Helene von Lorbeer is sent undercover to London to live with the family of a high-placed British official where she is to rendezvous with the butler Valdar, also a spy, and help him transmit secret war plans back to Germany.\n\nAlso Known As: Secret Enemy \nDirector: Terry O. Morse \nWriters: Lee Katz, Anthony Paul Kelly \nStars: Boris Karloff, Margaret Lindsay, Bruce Lester \nGenres: Classics, Romance, Thriller, War \n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:51:25.540Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/LURgEHMHSNY/maxresdefault.webp?v=61af7413",
      "duration": 3624,
      "language": "en",
      "year": 1940,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 6.1,
    "imdbVotes": 1283,
    "Genre": "Romance, Thriller, War",
    "Plot": "During WWI pretty German master spy Helene von Lorbeer is sent undercover to London to live with the family of a high-placed British official where she is to rendezvous with the butler Valdar, also a spy, and help him transmit secret war plans back to Germany.",
    "Director": "Terry O. Morse",
    "Writer": "Lee Katz, Anthony Paul Kelly",
    "Actors": "Boris Karloff, Margaret Lindsay, Bruce Lester",
    "Language": "English, French, German",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032842",
    "tt0233667",
    "tt0034000",
    "tt0034092",
    "tt0033876",
    "tt0035462",
    "tt0038449",
    "tt0034854",
    "tt0035452",
    "tt0034647",
    "tt0035220",
    "tt0035249"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.164Z"
}