{
  "movieId": "tt0019312",
  "title": "The Red Dance",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-red-dance_1928",
      "id": "the-red-dance_1928",
      "title": "The Red Dance",
      "fileSize": 7003445789,
      "addedAt": "2026-01-07T00:12:22.157Z",
      "thumbnail": "https://archive.org/services/img/the-red-dance_1928",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 615
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 6.3,
    "imdbVotes": 171,
    "Genre": "Drama, Romance",
    "Plot": "Note: Contains Spoilers The story, set in Russia at the time of the Bolshevik Revolution, focuses on the relationship between three characters: Tasia (Dolores del Rio), a peasant girl; Grand Duke Eugene (Charles Farrell); and Ivan Petroff (Ivan Linow).Tasia has revolutionary sentiments which are strengthened by seeing the suffering of her father imprisoned by the Czarist authorities. She attracts the attention of Ivan Petroff, but evades an arranged marriage with him, to the relief of both (Ivan, hung over from prenuptial celebrations, misses the ceremony).While revolutionary agents stir up class hatred among the populace, Tasia meets Grand Duke Eugene, a nobleman who genuinely wishes to address the problems of the people. They fall in love, aware of the great social gulf dividing them (Eugene is betrothed to a noblewoman).The revolution begins (the \"Red Dance\" is described in an intertitle as the name for a bloody and irresponsible movement to grab power by revolutionaries not equipped to wield power), and the three main characters are separated. Tasia is courted by the revolution to assassinate a nobleman: having just witnessed the death of her father after his imprisonment by the Czarist authorities, she accepts the mission without knowing the identity of the victim. Her target is Grand Duke Eugene, and the day chosen is his wedding day. Her attempt fails, however, and she is sent into hiding.The story moves ahead a few years. Ivan has become a general in the revolutionary army, and Tasia is a dancer in a nightclub. Ivan and Tasia meet at the nightclub for the first time since their separation; he continues to love her, but also learns that Tasia loves Eugene.The revolutionary forces agree in a meeting that Eugene must be killed: Ivan, mad with jealousy about Tasia's love for the Grand Duke, accepts the assignment in her hearing. Tasia leaves to warn Eugene: Ivan follows closely behind. At the inn where Eugene is staying, Tasia tries to prevent Ivan from arresting Eugene, but Ivan protests that he is trying to protect him. However, Eugene is led off to execution by Ivan, where a firing squad apparently shoots him. The execution is simulated, however, and Ivan has indeed protected Eugene. Ivan's final act of generosity is to usher Eugene and Tasia to a waiting plane, within which they escape Russia for western Europe.",
    "Director": "Raoul Walsh",
    "Writer": "Henry Leyford Gates, Eleanor Browne, Pierre Collings",
    "Actors": "Dolores Del Río, Charles Farrell, Ivan Linow",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0018118",
    "tt0023202",
    "tt0047860",
    "tt0018879",
    "tt0019305",
    "tt0018379",
    "tt0020122",
    "tt0018170",
    "tt0017540",
    "tt0018972",
    "tt0018836",
    "tt0019067"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.157Z"
}