{
  "movieId": "tt0020126",
  "title": "Madame X",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/madame-x_1929",
      "id": "madame-x_1929",
      "title": "Madame X",
      "fileSize": 5479574368,
      "addedAt": "2026-01-07T00:09:46.421Z",
      "thumbnail": "https://archive.org/services/img/madame-x_1929",
      "language": "English",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 1170
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/madame-x_1929_202506",
      "id": "madame-x_1929_202506",
      "title": "Madame X (1929)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. This tragedy about an alcoholic woman on trial and the son she gave away was nominated for two Academy Awards and was released to rave reviews. The main draw for the film was the heartbreaking performance given by Ruth Chatterton, as well as sleek direction from Lionel Barrymore. ",
      "fileSize": 5411092759,
      "addedAt": "2026-01-07T00:09:46.421Z",
      "thumbnail": "https://archive.org/services/img/madame-x_1929_202506",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 109
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S9x1-sFLvT0",
      "id": "S9x1-sFLvT0",
      "title": "Madame X (1929) RUTH CHATTERTON🍕 OSCAR NOMINEE",
      "description": "It's Friday @PizzaFLIX \nStars: Ruth Chatterton, Lewis Stone, Raymond Hackett, and Sidney Toler\nDirector: Lionel Barrymore\nWriter: Alexandre Bisson (based on a play by)\n🍕OSCAR NOMINEES BEST ACTRESS & BEST DIRECTING🍕\nRuth Chatterton delivers an Oscar-nominated performance as a woman cast out by her husband, forced into a life of tragedy and scandal. Years later, she stands trial for murder—defended by a young attorney who unknowingly happens to be her own son. A gripping tale of sacrifice, maternal love, and redemption, Madame X remains one of the most unforgettable films of Pre-Code Hollywood.\n\nNominated for Best Actress (Ruth Chatterton) and Best Director (Lionel Barrymore), this emotionally charged drama showcases the brilliance of MGM’s Golden Age, delivering a powerhouse performance that still resonates today.\n\nWatch this classic on PizzaFLIX, your ultimate destination for rare and classic Hollywood films from the silent era, Pre-Code Hollywood, and Golden Age cinema. Don’t forget to like, comment, and subscribe for more legendary films!\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#MadameX #PreCodeHollywood #ClassicMovies #LionelBarrymore #RuthChatterton #OldHollywood #MGM #OscarNominated #ClassicCinema #PizzaFLIX",
      "addedAt": "2025-12-24T01:04:45.319Z",
      "thumbnail": "https://i.ytimg.com/vi/S9x1-sFLvT0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCsWGXhzVoHymI4-xvw_8Q-C6ZdzA",
      "duration": 5767,
      "language": "en",
      "year": 1929,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "95 min",
    "imdbRating": 5.6,
    "imdbVotes": 541,
    "Genre": "Drama",
    "Plot": "Young Raymond Floriot, following in his father Louis Floriot's professional footsteps, he now France's attorney general, has just passed the bar exam. Raymond's first case, appointed to him by the courts, is a murder case. His pitiful and poor Jane Doe client, who refers to herself only as Madame X, admits to killing the scoundrel of a man named Laroque, but won't disclose why or in turn defend herself in court. Raymond knows nothing of her past, which includes once being a woman of class, married to man of prestige. But that marriage ended because he treated her without love, which resulted in her leaving him for another man, who in turn passed away shortly thereafter. Her first marriage produced a son, who her husband refused to let her see. Her son never knew she was alive, he being told by his father that she died. The consequence of his action left Madame X on a downward path where she never found love. Now, in turn, she hopes her silence will protect the one that she really loves, he who doesn't even know about her selfless sacrifice.",
    "Director": "Lionel Barrymore",
    "Writer": "Alexandre Bisson, Willard Mack",
    "Actors": "Lewis Stone, Ruth Chatterton, Raymond Hackett",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 2 Oscars. 2 nominations total"
  },
  "relatedMovies": [
    "tt0019758",
    "tt0020516",
    "tt0020488",
    "tt0020589",
    "tt0020534",
    "tt0019591",
    "tt0020686",
    "tt0020030",
    "tt0019644",
    "tt0019765",
    "tt0019933",
    "tt0019957"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.421Z"
}