{
  "movieId": "tt0034577",
  "title": "Captain Midnight",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7LNtBtRNmkU",
      "id": "7LNtBtRNmkU",
      "title": "Captain Midnight (1942) 15-CHAPTER CLIFFHANGER",
      "description": "PizzaFLIX Marathon Edition! Complete 15-Chapter Cliffhanger!\nStarring: Dave O'Brien, Dorothy Short, James Craven\nDirected by: James W. Horne\n\nIn this exciting Cliffhanger, Captain Midnight is called upon to stop a mysterious villain who is after a top-secret device that will enable his bombers to launch a furious reign of terror.\n\n🍕CHAPTERS🍕\n0:00       PizzaFLIX Intro\n1:05       CHAPTER 1: Mysterious Pilot\n31:28     CHAPTER 2: The Stolen Range Finder\n49:59     CHAPTER 3: The Captured Plane\n1:08:48  CHAPTER 4: Mistaken Identity\n1:26:20  CHAPTER 5: Ambushed Ambulance\n1:44:11  CHAPTER 6: Weird Waters\n2:00:10  CHAPTER 7: Menacing Fates\n2:15:45  CHAPTER 8: Shells of Evil\n2:31:44  CHAPTER 9: The Drop to Doom\n2:48:30  CHAPTER 10: The Hidden Bomb\n3:06:06  CHAPTER 11: Sky Terror\n3:23:05  CHAPTER 12: Burning Bomber\n3:39:50  CHAPTER 13: Death in the Cockpit\n3:56:05  CHAPTER 14: Scourge of Revenge\n4:13:50  CHAPTER 15: The Fatal Hour\n4:31:10 Please Subscribe!",
      "addedAt": "2025-12-24T01:08:37.453Z",
      "thumbnail": "https://i.ytimg.com/vi/7LNtBtRNmkU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBCYP573dMCs03giE7PDVSkoTAHSQ",
      "duration": 16289,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/captain-midnight-1942",
      "id": "captain-midnight-1942",
      "title": "Captain Midnight 1942 colorized cliffhanger serial (Dave O'Brien)",
      "description": "Captain Midnight (Dave O'Brien), a daring masked aviator who fights gangsters and the enemies of America, is asked for help by Major Steel (Joe Girard) of the Secret Service when aerial bombing attacks are made on West Coast munitions plants. The mastermind behind the attacks, Ivan Shark (James Craven), is after a new range finder and kidnaps its inventor (Bryant Washburn).  Midnight promises the man's daughter (Dorothy Short) that he will rescue her father and bring Shark to justice. Dave O'Brien as Captain Albright / Captain Midnight Dorothy Short as Joyce Edwards James Craven as Ivan Shark Sam Edwards as Chuck Ramsey Guy Wilkerson as Ichabod 'Icky' Mudd Bryant Washburn as John Edwards Luana Walters as Fury Shark Joe Girard as Major Steel Ray Teal as Borgman George Pembroke as Dr. James Jordan 15 chapters I colorized this using AI software that doesn't always get the colors right, but I think it looks fairly natural. Hopefully a more professional job will be done someday.",
      "fileSize": 4189161977,
      "addedAt": "2026-01-07T00:07:45.166Z",
      "thumbnail": "https://archive.org/services/img/captain-midnight-1942",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 4936
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "270 min",
    "imdbRating": 6.6,
    "imdbVotes": 158,
    "Genre": "Action, Adventure, Drama",
    "Plot": "Secret Service Major Steel (Joseph W. Girard), is one of the few men in America aware of the fact that Captain Albright (Dave O'Brien) is also Captain Midnight, daring masked aviator dedicated to fighting gangsters and enemies of America. When murderous bombing attacks are made on West Coast munitions plants, Steel sends for Albright and asks him to track down the mysterious Ivan Shark (James Craven), the foreign agent mastermind behind the attacks. Shark has learned about an ingenious range finder, invented by John Edwards (Bryant Washburn, and makes plans to obtain a model of the invention. Edwards instructs his daughter, Joyce (Dorothy Short), to bring the model to Albright for safekeeping in his mountain laboratory. Shark takes Edwards prisoner by Albright assures Joyce that her father will be saved and an end put to Shark's reign of terror. Dressing as Captain Midnight and enlisting the aid of his friends, Chuck (Sam Edwards) and Ichabod Mudd (Guy Wilkerson), Captain Midnight delivers on his promises fourteen chapters later.",
    "Director": "James W. Horne",
    "Writer": "Basil Dickey, George H. Plympton, Jack Stanley",
    "Actors": "Dave O'Brien, Dorothy Short, James Craven",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033139",
    "tt0032557",
    "tt0034428",
    "tt0036164",
    "tt0034572",
    "tt0034948",
    "tt0035372",
    "tt0035532",
    "tt0032112",
    "tt0034405",
    "tt0036046",
    "tt0036241"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:09:57.692Z"
}