{
  "movieId": "tt0028767",
  "title": "Dark Journey",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DarkJourney",
      "id": "DarkJourney",
      "title": "Dark Journey",
      "description": "During World War I, a German spy and a British spy (Conrad Veidt and Vivien Leigh) meet and fall in love. Both are stationed in neutral Stockholm and serve as conduits for intelligence for their respective governments.",
      "fileSize": 1906088793,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/DarkJourney",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 25663
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dark-journey-1937",
      "id": "dark-journey-1937",
      "title": "Dark Journey (1937)",
      "description": "Madeline Goddard, is a British double agent who meets and falls in love with a German spy Baron Karl Von Marwitz during World War I. This tale of espionage blends high adventure and romance making perfect order from wartime chaos and growing in faith from despair. Watch on RetroFlix:  https://retroflix.org/dark-journey-1937/",
      "fileSize": 1595543022,
      "addedAt": "2026-01-07T00:07:51.630Z",
      "thumbnail": "https://archive.org/services/img/dark-journey-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 172
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s9RYZkd4CO0",
      "id": "s9RYZkd4CO0",
      "title": "Dark Journey (1937) [Thriller]",
      "description": "\"Dark Journey\" is a 1937 British spy film directed by Victor Saville set in the First World War. Its plot concerns two secret agents on opposite sides, played by Conrad Veidt and Vivien Leigh, who fall in love.\n\n---\n\nDirected by Victor Saville, produced by Victor Saville and Alexander Korda, written by Lajos Biró (play and screenplay) and Arthur Wimperis, starring Conrad Veidt and Vivien Leigh.\n\n---\n\nSource: \"Dark Journey (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 29 December 2011. Web. 20 July 2012. http://en.wikipedia.org/wiki/Dark_Journey_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:42:07.952Z",
      "thumbnail": "https://i.ytimg.com/vi/s9RYZkd4CO0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCjq7mSIEXlRNmO2omkUa5tajoOLQ",
      "duration": 4539,
      "language": "en",
      "year": 1937,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DarkJourney1937",
      "id": "DarkJourney1937",
      "title": "Dark Journey (1937)",
      "description": "In WWI Stockholm, a British and German soldier meet and fall in love. PD In UK At GATT Date. Not Eligible For GATT U.S. Copyright not renewed Mystic Nights Videos",
      "fileSize": 1870969024,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/DarkJourney1937",
      "collection": "feature_films",
      "downloads": 81011
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dark-journey-colorized-movie-720p-hd",
      "id": "dark-journey-colorized-movie-720p-hd",
      "title": "Dark Journey (restored, colorized) (1937, thriller, imdb score: 6.3)",
      "description": "Dark Journey is a 1937 British spy film directed by Victor Saville and starring Conrad Veidt and Vivien Leigh. Written by Lajos Bíró and Arthur Wimperis, the film is about two secret agents on opposite sides during World War I who meet and fall in love in neutral Stockholm. It was shot at Denham Studios, with sets designed by the art director Andrej Andrejew assisted by Ferdinand Bellan. The film's costumes were by René Hubert.",
      "fileSize": 1076531051,
      "addedAt": "2026-01-07T00:07:51.630Z",
      "thumbnail": "https://archive.org/services/img/dark-journey-colorized-movie-720p-hd",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 356
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "77 min",
    "imdbRating": 6.2,
    "imdbVotes": 1492,
    "Genre": "Adventure, Crime, Romance",
    "Plot": "Madeline Goddard is a smart young woman who owns a fashionable dress shop in neutral Sweden during World War One. Though she is grateful to avoid the fighting, the courageous and stunningly pretty Madeline feels she should be doing more for her native France. She volunteers to work as an intelligence agent, smuggling maps and other documents within the fashionable garments she ships to wealthy customers in London. Madeline's activities are so successful that British intelligence soon comes to rely on her as their main pipeline for information. At about this time, a British official in Sweden asks her to cultivate the friendship of Baron Karl Von Marwitz, a tall, distinguished-looking German officer who is in charge of counter-espionage activities at the German embassy. Unknown to Madeline, the baron has been sent to Sweden for the express purpose of discovering and eliminating the top British spy who has been smuggling out German war plans. When Madeline and Karl meet, each recognizes the other as a deadly foe. But a smoldering attraction seems to grow each time they see each other. Madeline is dazed by her conflicting feelings and attempts to run away; however Von Marwitz is able to board her ship on the high seas and capture her as a spy. Soon afterwards, his own ship is torpedoed by a British destroyer sent to rescue Madeline. The mortally wounded Baron Von Marwitz dies in her arms, confessing his love. Madeline is hailed as a hero but turns to look out to sea, shedding tears over her gallant German lover.",
    "Director": "Victor Saville",
    "Writer": "Lajos Biró, Arthur Wimperis",
    "Actors": "Conrad Veidt, Vivien Leigh, Joan Gardner",
    "Language": "English, German, French",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029712",
    "tt0028872",
    "tt0030774",
    "tt0028637",
    "tt0028667",
    "tt0028668",
    "tt0021764",
    "tt0028836",
    "tt0029130",
    "tt0029280",
    "tt0029335",
    "tt0029728"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:14:30.389Z"
}