{
  "imdbId": "tt0035051",
  "title": "So's Your Aunt Emma!",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MYTeRiEKSEY",
      "title": "So's Your Aunt Emma! (1942) [Comedy] [Crime]",
      "description": "\"So's Your Aunt Emma!\" is a 1942 American film directed by Jean Yarbrough. The film is also known as \"Meet the Mob\". \n\n---\n\nDirected by Jean Yarbrough, Produced by Lindsley Parsons (producer) and Barney A. Sarecky (associate producer), written by George Bricker (writer), Edmond Kelso (writer) and Harry Hervey (story \"Aunt Emma Paints the Town\"), starring Zasu Pitts as Aunt Emma Bates, Roger Pryor as Terry Connors (Globe-Register Reporter), Warren Hymer as Joe Gormley (Hammond Goon), Douglas Fowley as Gus Hammond, Gwen Kenyon as Maris (Terry's Girl), Elizabeth Russell as Zelda Lafontaine, Tristram Coffin as Flower Henderson (Club Savoy Owner), Malcolm Bud McTaggart as Mickey O'Banion, Stanley Blystone as Det. Lt. Miller, Dick Elliott as Evans (Globe- Register Editor), Eleanor Counts as Gracie and Jack Mulhall as Reporter Burns.\n\n---\n\nSource: \"So's Your Aunt Emma\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 June 2012. Web. 5 August 2012. http://en.wikipedia.org/wiki/So%27s_Your_Aunt_Emma.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "MYTeRiEKSEY",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a8-9JrKj8hA",
      "title": "So’s Your Aunt Emma (1942) | Colorized Public Domain Comedy Crime Classic with Zasu Pitts",
      "description": "So’s Your Aunt Emma (1942) is an American comedy crime film directed by Jean Yarbrough and produced by Producers Releasing Corporation (PRC). Starring the beloved character actress Zasu Pitts alongside Roger Pryor and William Newell, this lighthearted mix of humor, mistaken identity, and gangland intrigue perfectly captures the charm of low-budget yet highly entertaining 1940s Hollywood B-movies. Restored and colorized by Colorized Public Domain, this edition brings new vibrancy to a forgotten gem, making it appealing to today’s audiences in the USA, Europe, and beyond.\n\nPlot Summary:\nThe story follows Emma Bates (Zasu Pitts), a sweet and unassuming small-town spinster who takes a trip to the city to visit her nephew. By sheer coincidence, she becomes entangled in a web of crime, gambling, and gangsters. Through a series of misunderstandings, Emma is mistaken for a notorious mobster’s aunt, giving her unexpected influence over the criminal underworld.\n\nAs Emma innocently navigates the dangerous world of racketeers and crooked fight promoters, her gentle demeanor and quirky charm cause chaos for the gangsters who try to manipulate her. At the same time, she finds herself protecting an honest young boxer from exploitation. With quick wit and accidental bravery, Emma becomes the unlikely hero of the story.\n\nThe film is a delightful combination of comedy and crime melodrama, with Zasu Pitts’ trademark nervous mannerisms and comedic timing driving the charm. Though made as a B-picture, its playful script and endearing characters make it stand out among PRC’s catalog of economical but lively productions.\n\nCast and Crew:\n• Director: Jean Yarbrough\n• Producer: Lindsley Parsons\n• Screenplay: F. Hugh Herbert\n• Cinematography: Mack Stengler\n• Editing: Jack Ogilvie\n\nStarring:\n• Zasu Pitts as Emma Bates\n• Roger Pryor as Terry Connors\n• William Newell as Terry’s manager\n• Marian Marsh as Terry’s sweetheart\n• Tris Coffin as a gangster leader\n• Douglas Fowley as henchman\n\nFilm Significance:\nSo’s Your Aunt Emma represents the kind of comedy-crime hybrids that flourished in Hollywood’s B-movie market of the 1940s. Produced on a modest budget by PRC, a studio best known for quickly made genre films, it nevertheless demonstrates the enduring popularity of Zasu Pitts, who had been a recognizable screen personality since the silent era. Her ability to bring warmth and humor to even the simplest of roles makes this film a charming reminder of Hollywood’s Golden Age character-driven comedies.\n\nThe film also showcases how studios like PRC tapped into America’s fascination with boxing and crime stories, while still ensuring a wholesome, comedic resolution. For audiences today, it provides a humorous glimpse into 1940s entertainment values, when innocence and lighthearted satire were blended with tough-guy tropes.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like So’s Your Aunt Emma remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1942 release was black and white, typical of its studio’s limited resources. While charming in its original form, black-and-white films are often skipped by modern audiences unfamiliar with Golden Age Hollywood. By colorizing So’s Your Aunt Emma, we breathe new life into its comedic world, highlighting character expressions, costumes, and the vibrancy of its city setting. This restoration allows audiences to experience the humor and charm of Zasu Pitts in a way that feels more immediate and relatable today.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood, preserving comedies, dramas, adventures, and crime films from the 1930s through the 1950s for global audiences.\n\n#SosYourAuntEmma #ZasuPitts #1940sComedy #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #ClassicComedy #JeanYarbrough #PRCStudios #FilmRestoration",
      "id": "a8-9JrKj8hA",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sos-your-aunt-emma-1942",
      "title": "So's Your Aunt Emma! (1942)",
      "description": "A dizzy old spinster gets involved in the boxing racket and gangland murders. Watch on RetroFlix:  https://retroflix.org/sos-your-aunt-emma-1942/",
      "id": "sos-your-aunt-emma-1942"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sos_your_aunt_emma",
      "title": "So's Your Aunt Emma",
      "description": "Also known as \"Meet the Mob\". You can find more information regarding this film on its IMDb page .",
      "id": "sos_your_aunt_emma"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sos_your_aunt_emma_1942",
      "title": "So's Your Aunt Emma",
      "description": "A meek middle-aged spinster, get mistaken for the head of the Ma Parker gang.",
      "id": "sos_your_aunt_emma_1942"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=inen-dYSCWc",
      "title": "So's Your Aunt Emma! (1942) CRIME-COMEDY",
      "description": "Stars: Zasu Pitts, Roger Pryor, Warren Hymer \n Director: Jean Yarbrough\n\n A dizzy old spinster gets involved in the boxing racket and gangland murders as is falsely accused of being notorious murderer \"Ma Barker.\"",
      "id": "inen-dYSCWc",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gsFBavCaYFg",
      "title": "So's Your Aunt Emma! (1942) Action, Comedy, Crime Full Length Movie",
      "description": "ZaSu Steps Out And The Underworld Steps In!  A dizzy old spinster gets involved in the boxing racket and gangland murders as is falsely accused of being notorious murderer \"Ma Parker\".\n\nDirector: Jean Yarbrough\nWriters: George Bricker , Edmond Kelso \nStars: Zasu Pitts, Roger Pryor, Warren Hymer \nGenres: Classics, Action, Comedy, Crime  \n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "gsFBavCaYFg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": "5.8",
    "imdbVotes": "258",
    "Genre": "Action, Comedy, Crime",
    "Plot": "Aunt Emma Bates (Zasu Pitts), a spinster, visits the \"Big Town\" to see a boxing match participated in by Mickey O'Banion (Malcolm 'Bud' McTaggart), son of Emma's old fiancé who was himself a boxing champion. At the arena Emma sits next to Terry (Roger Pryor), a reporter who is trying to track down Rex Crenshaw (Irving Mitchell), lawyer for gangster \"Flower\" Henderson (Tristram Coffin), who has been kidnapped by rival gang-leader Gus Hammond (Douglas Fowley), and manager of Mickey. After the fight Emma is mistaken for a notorious gun-woman named Ma Parker, and suspected by Hammond's henchmen of working in the interests of Henderson. Mickey is shot during an altercation at Henderson's nightclub and is later kidnapped from the hospital by his manager's men and taken to an East Side outlaw. Emma, in an effort to free Mickey, and with the aid of Maris (Gwen Kenyon), Terry's fiancée, decides to pose as Ma Parker.",
    "Director": "Jean Yarbrough",
    "Writer": "George Bricker, Edmond Kelso, Harry Hervey",
    "Actors": "Zasu Pitts, Roger Pryor, Warren Hymer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0034754",
      "title": "Freckles Comes Home",
      "year": 1942,
      "imdbRating": "4.9",
      "imdbVotes": "203",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035028",
      "title": "Man from Headquarters",
      "year": 1942,
      "imdbRating": "5.8",
      "imdbVotes": "102",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033646",
      "title": "The Gang's All Here",
      "year": 1941,
      "imdbRating": "5.4",
      "imdbVotes": "228",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033510",
      "title": "Dangerous Lady",
      "year": 1941,
      "imdbRating": "5.4",
      "imdbVotes": "129",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034221",
      "title": "South of Panama",
      "year": 1941,
      "imdbRating": "4.8",
      "imdbVotes": "85",
      "language": "English, Spanish",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0032246",
      "title": "Behind the News",
      "year": 1940,
      "imdbRating": "5.4",
      "imdbVotes": "99",
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036690",
      "title": "Call of the South Seas",
      "year": 1944,
      "imdbRating": "5.1",
      "imdbVotes": "54",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036953",
      "title": "In Society",
      "year": 1944,
      "imdbRating": "6.6",
      "imdbVotes": "2,156",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028359",
      "title": "13 Hours by Air",
      "year": 1936,
      "imdbRating": "6.2",
      "imdbVotes": "197",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034621",
      "title": "Criminal Investigator",
      "year": 1942,
      "imdbRating": "5.2",
      "imdbVotes": "58",
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031245",
      "title": "Double Deal",
      "year": 1939,
      "imdbRating": "5.8",
      "imdbVotes": "78",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031330",
      "title": "Forged Passport",
      "year": 1939,
      "imdbRating": "5.5",
      "imdbVotes": "23",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:58:43.594Z"
}