{
  "imdbId": "tt0024962",
  "title": "The Rise of Catherine the Great",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Rise_of_Catherine_the_Great",
      "title": "The Rise Of Catherine The Great",
      "description": "Also Known As: Catherine the Great Vienna-born Elisabeth Bergner, in her first English-language film, is radiant as the obscure German princess who would become the most powerful woman in Russian history. Hers is an excellent performance in a difficult role, where it would have been easy to be upstaged by the other, flashier, characters. As Grand Duke Peter - later Czar Peter III - Douglas Fairbanks Jr. behaves like a homicidal Hamlet, all moodiness & flares of deadly temper. He makes an interesting effort to create a charmer out of a pathetic man who was obviously a maniac.",
      "id": "The_Rise_of_Catherine_the_Great"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MRfrbww6C2E",
      "title": "The Rise of Catherine the Great (1934) [Biography]",
      "description": "\"Catherine the Great\" (also titled \"The Rise of Catherine the Great\") is a 1934 British historical film based on the play The Czarina by Lajos Biró and Melchior Lengyel, about the rise to power of Catherine the Great. It was directed by Paul Czinner, and stars Elisabeth Bergner as Catherine, Douglas Fairbanks Jr. as Grand Duke Peter, Dorothy Hale as Countess Olga, and Flora Robson as Empress Elizabeth.\n\nThis historical drama recounts the events that led to the accession of Catherine the Great, Empress of all the Russias. The film opens with the arrival of Princess Sophie Auguste Frederika -- whose name would be changed to 'Catherine' -- from her father's court of Anhalt-Zerbst (in modern Germany) to the court of the Empress Elizabeth. \"Little Catherine\" is to marry the Grand Duke Peter, nephew and heir apparent of the unmarried and childless Empress Elizabeth. Peter already displays signs of mental instability and a sharply misogynist streak. He rejects Catherine on their wedding night, reacting to something innocently said by his French valet, claiming that she used feminine tricks to win him over. In time though, Peter accepts her and they have a happy marriage for a while. Meanwhile, Catherine gains important experience of government from working as principal aide to the empress.\n\nThe empress dies and Peter becomes tsar, but his mental illness is starting to get the better of him, along with sheer boredom in the job. Catherine still loves him despite beginning a very public love affair with one of her best friends -- until one night when Peter goes one step too far in publicly humiliating his wife. She ceases to love him, which enables her to be clear-headed in supporting a planned coup d'état. The following morning, he is arrested and Catherine is made Empress of All the Russias. The elevation is marred by Peter's murder that very morning, contrary to Catherine's command. Grigory Orlov explains that everything has a price, and the crown has the highest price of all. The film ends, with Catherine in tears on her throne, while the cheers of the crowds are heard outside.\n\n---\n\nDirected by Paul Czinner, produced by Alexander Korda and Ludovico Toeplitz, written by Marjorie Deans and Arthur Wimperis, narrated by Alexander Kerensky, starring Elisabeth Bergner, Douglas Fairbanks Jr. and Flora Robson.\n\n---\n\nSource: \"The Rise of Catherine the Great\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 June 2012. Web. 17 July 2012. http://en.wikipedia.org/wiki/The_Rise_of_Catherine_the_Great.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "MRfrbww6C2E",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "95 min",
    "imdbRating": "6.3",
    "imdbVotes": "747",
    "Genre": "Biography, Drama, History",
    "Plot": "In 1745, a German Princess, renamed Catherine (Elisabeth Bergner), arrives to marry Grand Duke Peter of Russia (Douglas Fairbanks, Jr.), whom she initially likes. But his suspicious, unstable nature gradually estranges them, and Peter finds solace with pretty courtiers. Catherine invents her own (fictitious) lovers, temporarily improving matters. Alas, accession to the throne brings out the worst in Peter, and loyal Catherine is urged to assume power.",
    "Director": "Paul Czinner, Alexander Korda",
    "Writer": "Lajos Biró, Arthur Wimperis, Melchior Lengyel",
    "Actors": "Douglas Fairbanks Jr., Elisabeth Bergner, Flora Robson",
    "Language": "English, French",
    "Country": "United Kingdom",
    "Awards": "2 wins & 1 nomination"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0024966",
      "title": "Chapaev",
      "year": 1934,
      "imdbRating": "7.0",
      "imdbVotes": "1,461",
      "language": "Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025272",
      "title": "The House of Rothschild",
      "year": 1934,
      "imdbRating": "6.5",
      "imdbVotes": "1,343",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024473",
      "title": "The Private Life of Henry VIII",
      "year": 1933,
      "imdbRating": "7.0",
      "imdbVotes": "5,137",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023888",
      "title": "Der Choral von Leuthen",
      "year": 1933,
      "imdbRating": "7.3",
      "imdbVotes": "75",
      "language": "Hungarian, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028141",
      "title": "The Prisoner of Shark Island",
      "year": 1936,
      "imdbRating": "7.2",
      "imdbVotes": "2,666",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1441953",
      "title": "Testament of Youth",
      "year": 2014,
      "imdbRating": "7.2",
      "imdbVotes": "31,170",
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Moviedome"
    },
    {
      "imdbId": "tt0045473",
      "title": "Admiral Ushakov",
      "year": 1953,
      "imdbRating": "7.3",
      "imdbVotes": "224",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0060107",
      "title": "Andrei Rublev",
      "year": 1966,
      "imdbRating": "8.0",
      "imdbVotes": "58,379",
      "language": "Russian, Italian, Tatar",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0086891",
      "title": "Anatomy of an Illness",
      "year": 1984,
      "imdbRating": "6.4",
      "imdbVotes": "116",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0266425",
      "title": "Conspiracy",
      "year": 2001,
      "imdbRating": "7.6",
      "imdbVotes": "28,545",
      "language": "English, German, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033451",
      "title": "Carl Peters",
      "year": 1941,
      "imdbRating": "5.7",
      "imdbVotes": "64",
      "language": "German, English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt9071322",
      "title": "Dark Waters",
      "year": 2019,
      "imdbRating": "7.6",
      "imdbVotes": "118,173",
      "language": "English, Korean",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T07:18:47.003Z"
}