{
  "imdbId": "tt0028865",
  "title": "The Feud of the Trail",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=53Swmygxrl0",
      "title": "Feud of the Trail (1937) TOM TYLER",
      "description": "Movie Class by PizzaFLIX: Tom Tyler (1903–1954) is best known for starring in B-Westerns from the silent and sound eras and for his lead role in the 1941 serial THE ADVENTURES OF CAPTAIN MARVEL. \n\nDirector: Robert F. Hill (as Bob Hill)\nStars: Tom Tyler, Harley Wood, Milburn Morant\n\nA man who's a dead ringer for the leader of an outlaw gang kills the gang leader, then takes his place to try to bring the gang to justice.",
      "id": "53Swmygxrl0",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "56 min",
    "imdbRating": 5.8,
    "imdbVotes": 69,
    "Genre": "Western",
    "Plot": "The basic plot is the standard lawman-hero-poses-as-dead-lookalike-outlaw in order to help dead-outlaw's father and sister from losing their ranch to neighboring outlaws, but lots of weird things (even more than usual in a Sam Katzman production)happen along the way, beginning with the cast order as shown on the film; the 4th and 5th billed Jim Corey (misspelled as Correy) and Dick Alexander (known by and billed as such more times than he was as Richard)play a couple of brothers as part of a family gang obviously inspired by Ma Barker and her sons, and only have a couple of lines of dialogue in the whole film, while Roger Williams (as Lance, the only Holcomb brother with a given name) is billed below his two non-talking brothers. Lafe McKee, a major character who talks all the time, goes uncredited, as does director Bob Hill (the name he used on more films than he did Robert F. Hill), who plays the Protective Association Chief, but Hill, while appearing in many of the films he directed seldom took an actors credit. Most of the Victory Pictures produced by Sam Katzman starring Tom Tyler were marked by the unusually small amount of performers seen on screen,and were usually filmed with only two interiors (which set decorator Fred Preble would disguise from film to film by hanging the same set of checkered drapes in different places) and featured a lot of riding around outdoors, and no town scenes. Sam knew if there were no town scenes, he didn't have to pay a dollar or two for people walking across the street or hanging out in the saloon or rent any extra horses to tie to the hitching posts. For reasons unknown, since it had nothing to do with the plot and advanced it not one whit, Jerry McLain (Milburn Morante), who plays the lawman sidekick to Tom Wade (Tom Tyler)and McLain is actually the one who shoots Jack Granger (also played by Tyler), rides to a town and sings (dubbed)\"The Old Chisholm Trail\" for a bartender, a piano player and a dozen or so barflies, all of which must have cost Sam at least fifty extra dollars. Morante and Tyler also sing the song (neither one dubbed and should have been)on the trail, and later on Harley Wood (billed as Harlene)plays it on the piano at the ranch and sings nicely, while Tyler sings along in a losing effort. Same song three and a half times in a Victory production is about three and a half more than the norm. The half comes when Morante, after jawing with the bartender, tells the piano player to play it again (Katzman had the piano player on a day rate and probably wanted to get his money's worth) and Morante's dubbed voice takes over again. Plus, the brother-sister relationship when Sheila thinks Tom is her brother is more than a little cozy to begin with, and heats up some when she learns that Tom is not her brother, even though he is his exact double. Somewhere, somebody forgot to shoot the scene where John Granger (Lafe McKee) explains that Sheila is not really Jack's sister, but had been adopted by Pa Granger when her parents were wiped out by \"injuns\" or something. Most likely blew that part of the budget, intended for that scene, on the unneeded barroom scene.",
    "Director": "Robert F. Hill",
    "Writer": "Basil Dickey",
    "Actors": "Tom Tyler, Harley Wood, Milburn Morante",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0028712",
      "title": "Cheyenne Rides Again",
      "year": 1937,
      "imdbRating": 5.8,
      "imdbVotes": 76,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027874",
      "title": "Law and Lead",
      "year": 1936,
      "imdbRating": 4.8,
      "imdbVotes": 59,
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028101",
      "title": "The Phantom of the Range",
      "year": 1936,
      "imdbRating": 6.5,
      "imdbVotes": 77,
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028188",
      "title": "Rip Roarin' Buckaroo",
      "year": 1936,
      "imdbRating": 5.5,
      "imdbVotes": 99,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027789",
      "title": "Idaho Kid",
      "year": 1936,
      "imdbRating": 6.2,
      "imdbVotes": 75,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028491",
      "title": "West of Nevada",
      "year": 1936,
      "imdbRating": 5.7,
      "imdbVotes": 56,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030972",
      "title": "Whirlwind Horseman",
      "year": 1938,
      "imdbRating": 6.1,
      "imdbVotes": 82,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027167",
      "title": "The Vanishing Riders",
      "year": 1935,
      "imdbRating": 4.4,
      "imdbVotes": 64,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026260",
      "title": "Danger Trails",
      "year": 1935,
      "imdbRating": 5.7,
      "imdbVotes": 22,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027006",
      "title": "Six Gun Justice",
      "year": 1935,
      "imdbRating": 4.6,
      "imdbVotes": 13,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0031772",
      "title": "Overland Mail",
      "year": 1939,
      "imdbRating": 6.2,
      "imdbVotes": 31,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0026253",
      "title": "The Cyclone Ranger",
      "year": 1935,
      "imdbRating": 5.6,
      "imdbVotes": 42,
      "language": "Spanish, English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:29:05.921Z"
}