{
  "imdbId": "tt0023985",
  "title": "The Emperor Jones",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheEmpererJones",
      "title": "TheEmpererJones",
      "description": "The Emperor Jones is a 1920 play by American dramatist, Eugene O'Neill which tells the tale of Brutus Jones (Paul Robeson), an African-American man who kills a man, goes to prison, escapes to a Caribbean island, and sets himself up as emperor.",
      "id": "TheEmpererJones"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7wqoX4CAI3o",
      "title": "The Emperor Jones (1933) | Colorized Public Domain Classic Drama with Paul Robeson and Dudley Digges",
      "description": "The Emperor Jones (1933) is a groundbreaking American drama directed by Dudley Murphy and based on the Pulitzer Prize-winning play by Eugene O’Neill. This restored and colorized edition revitalizes one of cinema’s most historically significant works, featuring Paul Robeson in his first starring film role. Originally released during the Pre-Code era, the movie blends psychological drama, political allegory, and social critique. Today, this colorized version brings new life to a film that was once hailed for its daring storytelling and powerful performances.\n\nPlot Summary:\nThe story follows Brutus Jones (Paul Robeson), a Pullman porter whose life changes dramatically after he kills a man during a dice game. Sent to prison with a life sentence, Jones escapes by killing a guard and fleeing to the West Indies. On a remote island, he manipulates tribal superstition and greed to crown himself emperor, exploiting the local people and establishing a reign of corruption and tyranny.\n\nAs his empire grows, Jones grows increasingly arrogant and ruthless, demanding wealth and obedience from his subjects. But when the oppressed rise up against him, his downfall begins. Haunted by guilt, visions, and paranoia, Jones flees into the jungle, pursued by both the natives and his own tortured conscience. The film culminates in a gripping, tragic finale that mirrors the destructive consequences of unchecked power and greed.\n\nCast and Crew:\n• Director: Dudley Murphy\n• Producer: John Krimsky, Gifford Cochran\n• Screenplay: Dudley Murphy, DuBose Heyward, based on the play by Eugene O’Neill\n• Cinematography: Ernest Haller\n• Editing: Otis Garrett\n• Distributor: United Artists\n\nStarring:\n• Paul Robeson as Brutus Jones\n• Dudley Digges as Smithers\n• Frank H. Wilson as Jeff\n• Fredi Washington as Undine\n• Ruby Elzy as Dolly\n• Moms Mabley as Slave (uncredited)\n\nFilm Significance:\nThe Emperor Jones is historically important for several reasons. It was one of the earliest mainstream films to feature an African-American actor, Paul Robeson, in a leading role, showcasing his commanding stage presence and vocal talent. The story, adapted from Eugene O’Neill’s play, brought a serious, psychological, and socially critical narrative to the screen during the early 1930s, a time when Hollywood often relegated Black actors to stereotypical roles. While controversial in its portrayal of race and colonial dynamics, the film remains a milestone in American cinema and cultural history. Its Pre-Code frankness and willingness to tackle taboo subjects distinguish it from later, more sanitized productions.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Emperor Jones remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1933 release was in stark black-and-white, suited to its raw and expressionistic story. While historically authentic, modern audiences often skip past monochrome films. By offering a colorized version, we allow viewers to experience Paul Robeson’s magnetic performance with renewed visual depth, enhancing engagement without altering the story’s integrity. This edition bridges cultural preservation with modern accessibility, making a landmark piece of cinema more approachable for audiences in the United States, Europe, and worldwide.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheEmperorJones #PaulRobeson #PublicDomainMovie #ColorizedClassic #ClassicDrama #EugeneONeill #1930sCinema #FilmRestoration #PreCodeHollywood #CulturalMilestone",
      "id": "7wqoX4CAI3o",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-emperor-jones",
      "title": "The Emperor Jones",
      "description": "Unscrupulously ambitious Brutus Jones escapes from jail after killing a guard and through bluff and bravado finds himself the emperor of a Caribbean island.  Of all Paul Robeson's eleven starring film performances, by far his most iconic was his breakthrough in the big-screen adaptation of Eugene O'Neill's The Emperor Jones (1933). He was already a legend for his stage incarnation of Brutus Jones, a Pullman porter who powers his way to the rule of a Caribbean island, but with this, his first sound-era film role, his regal image was married to his booming voice for eternity. With The Emperor Jones, Robeson became the first African-American leading man in mainstream movies and, he said, gained a deeper understanding of cinema's potential to change racial misconceptions. Previously censored, The Emperor Jones is presented here in its most complete form.",
      "id": "the-emperor-jones"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-emperor-jones-1933",
      "title": "The Emperor Jones (1933)",
      "description": "Unscrupulously ambitious, Brutus Jones escapes from jail after killing a guard and, through bluff and bravado, finds himself the emperor of a Caribbean island. Watch on RetroFlix:  https://retroflix.org/the-emperor-jones-1933/",
      "id": "the-emperor-jones-1933"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iu730xtn_nM",
      "title": "The Emperor Jones (1933) PAUL ROBESON",
      "description": "Stars: Paul Robeson, Dudley Digges, Frank H. Wilson\nDirector: Dudley Murphy\nWriter: Eugene O'Neill (play)\n\n Unscrupulously ambitious Brutus Jones escapes from jail after killing a guard and through bluff and bravado finds himself the emperor of a Caribbean island.",
      "id": "iu730xtn_nM",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": "6.4",
    "imdbVotes": "1,293",
    "Genre": "Drama, Music",
    "Plot": "At a Baptist prayer meeting, the preacher leads a prayer for Brutus Jones, who is leaving to become a railway porter. Jones joins the congregation in a spiritual. Once on the train, Jeff, a porter, shows Jones the ropes. Jones secretly takes up with Jeff's girl, Undine. He makes some money in a deal with a rich businessman on the train. Jones proves to be a cunning manipulator and a good liar. In a crap game, Jones stabs Jeff over a pair of loaded dice. Now doing hard labour, Jones kills a white prison guard and escapes. Shovelling coal on a ship in the Caribbean, Jones swims to an island. He is brought before the island's ruler, where Smithers, a crooked white trader, buys his freedom. Jones schemes his way into a partnership in Smithers' business, then finally control of the entire island through a touch of witchcraft, or so it seems. Brutus declares himself to be The Emperor Jones... Smithers reports on the unrest that Jones' rule is causing. One morning, the palace is empty of servants. As rebel drums beat, Jones flees into the forest where he is haunted by visions from his past...",
    "Director": "Dudley Murphy, William C. de Mille",
    "Writer": "Eugene O'Neill, DuBose Heyward",
    "Actors": "Paul Robeson, Dudley Digges, Frank H. Wilson",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026966",
      "title": "Sanders of the River",
      "year": 1935,
      "imdbRating": "5.4",
      "imdbVotes": "732",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024416",
      "title": "One Year Later",
      "year": 1933,
      "imdbRating": "6.6",
      "imdbVotes": "88",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028282",
      "title": "Song of Freedom",
      "year": 1936,
      "imdbRating": "6.4",
      "imdbVotes": "438",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022789",
      "title": "Crooner",
      "year": 1932,
      "imdbRating": "5.9",
      "imdbVotes": "186",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026367",
      "title": "Flirtation",
      "year": 1934,
      "imdbRating": "5.3",
      "imdbVotes": "70",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025303",
      "title": "In Old Santa Fe",
      "year": 1934,
      "imdbRating": "5.7",
      "imdbVotes": "199",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023128",
      "title": "Lena Rivers",
      "year": 1932,
      "imdbRating": "5.6",
      "imdbVotes": "91",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025513",
      "title": "Money Means Nothing",
      "year": 1934,
      "imdbRating": "5.5",
      "imdbVotes": "118",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022988",
      "title": "Hell-Fire Austin",
      "year": 1932,
      "imdbRating": "6.3",
      "imdbVotes": "101",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025678",
      "title": "Alexandra",
      "year": 1934,
      "imdbRating": "6.6",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023587",
      "title": "Those We Love",
      "year": 1932,
      "imdbRating": "5.8",
      "imdbVotes": "129",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026131",
      "title": "Born to Gamble",
      "year": 1935,
      "imdbRating": "4.9",
      "imdbVotes": "61",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:40:49.830Z"
}