{
  "movieId": "tt0084044",
  "title": "Hajji Washington",
  "year": 1983,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HajjiWashington1982",
      "id": "HajjiWashington1982",
      "title": "Hajji Washington (1982)",
      "description": "Synopsis Hajji Hossein-Gholi Noori (Haji Baba) goes to Washington D.C. as the first Iranian (Persian) ambassador to the United States of America. After he opens the embassy, he is unable to invite statesmen to visit him. Haji fires the embassy staff due to the inability of the Persian government to meet the embassy's needs. One night he is visited by President Grover Cleveland. -- IMDb ******** Cast: Ezzatolah Entezami .... Hajji Hossein-Gholi Noori Richard Harrison Dino Mario Mehri Vadadian Esmael Mohammadi Entezami was at the height of his career in the 1980s. His good name and prestige in the year prior to the Islamic Revolution have made him one of the most respected actors presently and he is accepted as such both by the general public and the elite. While many filmmakers and actors who were active before the Revolution were not allowed to continue their work because they had made \"Immoral films,\" Entezami enjoys the respect and admiration of the authorities. He gave one of the best performances of his career in this period in Hajji Washington (1982) directed by Ali Hatami, considered the best work of this director yet. One of the most striking sequences is the one to which William McKinley is shown in the Iranian Embassy. He was the President of the United States when Hajji arrived in Washington, and some months later was succeeded by the next President. But since Hajji neither reads the newspapers nor meets with anyone, he is not aware of the change and singlehandedly entertains his guest lavishly. Hajji writes a report about his meeting with \"The President\" to the Shah only to find out by the end of the evening that the man who has come to visit him in a cart and in a cowboy's outfit, is now a simple farmer. The former president had come to the Iranian Embassy to find out how pistachios are grown, Hajji having presented him with some pistachios when presenting his credentials. A number of other films of this period with Entezami in them, were made by Ali Hatami as well, the man who does research solely on the history of the last century and its Iranian personalities and more importantly, tries to create the real Iranian cinema and its language. Hatami has never been more successful than in Hajji Washington. (Houshang Golmakani)",
      "fileSize": 31370099,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/HajjiWashington1982",
      "collection": "feature_films",
      "downloads": 1625
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "98 min",
    "imdbRating": 7.1,
    "imdbVotes": 785,
    "Genre": "Biography, Comedy, Drama",
    "Plot": "Hajji Hossein-Gholi Noori (Haji Baba) goes to Washington D.C. as the first Iranian (Persian) ambassador to the United States of America. After he opens the embassy, he is unable to invite statesmen to visit him. Haji fires the embassy staff due to the inability of the Persian government to meet the embassy's needs. One night he is visited by President Grover Cleveland.",
    "Director": "Ali Hatami",
    "Writer": "Ali Hatami",
    "Actors": "Ezzatolah Entezami, Richard Harrison, Russel Case",
    "Language": "Persian",
    "Country": "Iran",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0071085",
    "tt0038390",
    "tt0011267",
    "tt0062994",
    "tt0048312",
    "tt5442674",
    "tt0044735",
    "tt0084873",
    "tt0289352",
    "tt0085244",
    "tt0086242",
    "tt0086891"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}