{
  "imdbId": "tt0061811",
  "title": "In the Heat of the Night",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/in.the.heat.of.the.night.1967",
      "id": "in.the.heat.of.the.night.1967",
      "title": "In the Heat of the Night (1967)",
      "description": "\"In the Heat of the Night\" is a groundbreaking American mystery drama that tackles themes of racism and social injustice. Set in the racially charged American South during the 1960s, the film centers on the murder of a wealthy businessman, Philip Colbert. Virgil Tibbs , played by Sidney Poitier , is a Black police officer from Philadelphia who becomes involved in the investigation when he is mistakenly arrested for the crime. Chief Bill Gillespie , portrayed by Rod Steiger , is the local white sheriff who initially harbors prejudices against Tibbs but soon realizes that he needs Tibbs's help to solve the case.As the investigation unfolds, tensions rise between the racially divided town and the two officers. Tibbs's intelligence and professionalism contrast sharply with the locals' deep-seated racism, forcing characters and viewers alike to confront their biases. Throughout the film, the relationship between Tibbs and Gillespie evolves from one of mutual suspicion to one of respect and collaboration as they work together to solve the murder mystery. The film culminates in a shocking revelation about the true murderer, while also highlighting the pervasive issues of racism and inequality present in society. Ultimately, Tibbs's unwavering dignity challenges the status quo, leaving a lasting impression on all characters involved. The film is renowned for its powerful performances and its social commentary, making it an enduring classic in American cinema.",
      "fileSize": 1492744277,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/in.the.heat.of.the.night.1967",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 528
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "110 min",
    "imdbRating": 7.9,
    "imdbVotes": 87737,
    "Genre": "Drama, Mystery, Thriller",
    "Plot": "Detective Virgil Tibbs is caught up in the racial tension of the US South when he is arrested after the murder of a prominent businessman. Tibbs was simply waiting for his next train at the station in Sparta, Mississippi and the confusion is soon resolved but when local police chief Gillespie learns that Tibbs is the Philadelphia PD's number one homicide expert, he reluctantly asks for his assistance. The murdered man, Mr. Colbert, had come to Sparta from the North to build a new factory and his wife and business associates immediately point the finger at Endicott, the most powerful man in the county and the one who had the most to lose if a major new employer comes to the area. Tibbs' life is clearly in danger but he perseveres in a highly charged and racially explosive environment until the killer is found.",
    "Director": "Norman Jewison",
    "Writer": "Stirling Silliphant, John Ball",
    "Actors": "Sidney Poitier, Rod Steiger, Warren Oates",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 5 Oscars. 23 wins & 16 nominations total"
  },
  "relatedMovies": [
    "tt0088683",
    "tt0060355",
    "tt0067455",
    "tt0057495",
    "tt0058962",
    "tt9214844",
    "tt0037179",
    "tt0053318",
    "tt0478832",
    "tt0045931",
    "tt0073418",
    "tt6207878"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.187Z"
}