{
  "imdbId": "tt0028988",
  "title": "Heidi",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/heidi-1937_202507",
      "id": "heidi-1937_202507",
      "title": "Heidi (1937)",
      "description": "Spirited orphan Heidi melts the heart of her reclusive grandfather in the Swiss Alps—until she’s taken away to be a companion for a wealthy, disabled girl in Frankfurt. Longing for home, Heidi inspires healing and hope, even as deceit and danger threaten her. A heartfelt tale of innocence, courage, and the unbreakable bond between a child and her grandfather. Watch on RetroFlix:  https://retroflix.org/heidi-1937/",
      "fileSize": 820645064,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/heidi-1937_202507",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 149
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "88 min",
    "imdbRating": 7.2,
    "imdbVotes": 5105,
    "Genre": "Drama, Family, Musical",
    "Plot": "Eight-year-old Heidi is orphaned and her selfish maternal Aunt Dete takes her to the mountains to live with Adolph Kramer, her grumpy, old, outcast, survivalist paternal grandfather. Heidi brings her grandfather back into mountain society through her angelic ways, sheer love, and adorable personality. When Aunt Dete steals Heidi away to be the companion of a rich man's invalid daughter, the grandfather is enraged and sets out to get her back. Back in Frankfurt, loved and adored by everyone she touches except the villainous housekeeper, Fraulein Rottenmeier, she thrives but is inwardly very sad and lonely. No matter what anyone tells her, Heidi, with faith, hope, and the stubbornness she inherited from her grandfather, knows that some day she will be reunited with the him and the beloved people of the mountain's little village.",
    "Director": "Allan Dwan",
    "Writer": "Johanna Spyri, Walter Ferris, Julien Josephson",
    "Actors": "Shirley Temple, Jean Hersholt, Arthur Treacher",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027882",
    "tt0027769",
    "tt0031580",
    "tt0026124",
    "tt0031346",
    "tt0016029",
    "tt0028827",
    "tt0028629",
    "tt0028906",
    "tt0197707",
    "tt0198012",
    "tt0029271"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}