{
  "imdbId": "tt0003828",
  "title": "The Decoy",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-decoy",
      "id": "silent-the-decoy",
      "title": "The Decoy",
      "fileSize": 301398180,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-decoy",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 212
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": 5.9,
    "imdbVotes": 35,
    "Genre": "Short, Crime, Romance",
    "Plot": "John Henderson and his wife are noted \"card sharps\" who prey upon traveling men, who believe that they are adepts at poker and other games of chance. Mrs. Henderson has a distant relative who lives in a small country town, a widow with one daughter, Muriel. The girl is pretty and longs for the city so her mother, believing the Hendersons to be the respectable people they profess themselves, sends her daughter to the city on a visit, in their care. The girl's beauty makes a deep impression upon the unscrupulous pair, and to Muriel's surprise and delight she is soon provided with beautiful clothes. The Henderson's plan to use Muriel's beauty to lure victims to the card table. Men of means gladly call at the Henderson's suite at the hotel, and always depart heavy losers in the game of chance. A millionaire finally becomes suspicious and consults the police, so the Hendersons flee the city, but the girl is kept in ignorance of the life they are leading. Boyd, a young businessman, meets the Hendersons at a summer resort and falls in love with Muriel and into the clutches of her dishonest relatives. Love comes to Muriel at the moment she discovers that the relatives for whom she cherished so much regard are merely unscrupulous gamblers. She threatens to expose them but hesitates to do so when they convince her that it will be impossible to prove her innocence. Finally, however, she braves their anger, and denounces them as a detective is about to place them all under arrest. The Hendersons are led away to punishment, while Muriel weds the man of her choice.",
    "Director": "Carl Gregory",
    "Writer": "Philip Lonergan",
    "Actors": "Charles Horan, Marie Rainford, Virginia Waite",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005586",
    "tt0002497",
    "tt0495939",
    "tt0003805",
    "tt0444797",
    "tt0002784",
    "tt0002795",
    "tt0303270",
    "tt0464747",
    "tt0234694",
    "tt0228815",
    "tt0002381"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}