{
  "movieId": "tt0000640",
  "title": "An Awful Moment",
  "year": 1908,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AnAwfulMoment1908",
      "id": "AnAwfulMoment1908",
      "title": "\"An Awful Moment\" (1908) director D. W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"An Awful Moment\" is a short crime drama directed by D.W. Griffith featuring Florence Lawrence, a star of Silent Hall of Fame. After a judge (Harry Solter) does his job and sentences a man, a gypsy woman (Marion Leonard) erupts in vehement protests and has to be taken forcefully out of the courtroom. Later the gypsy follows the judge to his home and plots a vicious revenge on his wife (Florence Lawrence). Directed by                       D.W. Griffith Cinematography by         Arthur Marvin Starring                             Marion Leonard, Harry Solter, Florence Lawrence, Gladys Egan Distributed by                   Biograph Company Release date                      December 18, 1908 Country                             United States Running time                    8 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 9608440,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AnAwfulMoment1908",
      "year": 1908,
      "collection": "feature_films",
      "downloads": 4953
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "12 min",
    "imdbRating": 4.4,
    "imdbVotes": 146,
    "Genre": "Drama, Short",
    "Plot": "As a judge passes sentence on a man, a gypsy woman in the audience vehemently protests, and she has to be physically removed from the courtroom. Soon afterwards, the judge returns home, and enjoys some time with his wife and child. But all the while, the gypsy woman is watching him closely, and is plotting a cruel revenge.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "George Gebhardt, Marion Leonard, Harry Solter",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000728",
    "tt0000831",
    "tt0000946",
    "tt0000752",
    "tt0001032",
    "tt0001072",
    "tt0000797",
    "tt0000871",
    "tt0000942",
    "tt0000945",
    "tt0000986",
    "tt0001016"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}