{
  "imdbId": "tt0035570",
  "title": "X Marks the Spot",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dJYzzwfY-pc",
      "id": "dJYzzwfY-pc",
      "title": "X Marks the Spot (1942) | Colorized Public Domain Noir Mystery with Damian O’Flynn and Helen Parrish",
      "description": "X Marks the Spot (1942) is an American mystery crime drama directed by George Sherman and released during World War II. This restored and colorized edition revives a classic public domain thriller that combines murder, corruption, and wartime intrigue into a sharp-paced story. Audiences in the United States, Europe, and worldwide can rediscover this gripping tale of crime and redemption in vivid color, making it more accessible to modern viewers while preserving its original 1940s tension.\n\nPlot Summary:\nThe story follows Eddie Delaney (Damian O’Flynn), a young man torn between duty to his country and his role as a police officer. Eddie’s father, Lieutenant William J. Delaney (Tom Kennedy), is a respected veteran cop whose reputation for honesty casts a long shadow. Tragedy strikes when the elder Delaney is killed while investigating racketeers who profit from illegal activities during wartime shortages. This crime not only devastates Eddie but also ignites his determination to bring his father’s killers to justice.\n\nEddie joins the military but soon finds his life intertwined with the world of organized crime and corruption back home. A wartime leave gives him the chance to take up his father’s fight against the racketeers. Along the way, he crosses paths with Linda Ward (Helen Parrish), a loyal reporter determined to expose the truth, and Annie (Anne Gwynne), whose connections to the underworld complicate Eddie’s mission. Together they navigate a dangerous web of lies, betrayal, and power.\n\nThe film’s climax centers on Eddie’s confrontation with the men responsible for his father’s death. In the process, he uncovers the full extent of wartime profiteering and the corrupt systems protecting criminals. His pursuit of justice becomes not only a personal vendetta but also a symbolic stand against lawlessness in a time of global uncertainty.\n\nCast and Crew:\n• Director: George Sherman\n• Producer: George Sherman\n• Screenplay: John Archer and Don Ryan\n• Cinematography: Reggie Lanning\n• Editing: Ernest J. Nims\n\nStarring:\n• Damian O’Flynn as Eddie Delaney\n• Helen Parrish as Linda Ward\n• William Farnum as Police Captain\n• Anne Gwynne as Annie\n• Tom Kennedy as Lt. William J. Delaney\n• Dick Purcell as John J. Underwood\n• Don Douglas as District Attorney Kendall\n• Edward Gargan as Detective Ryan\n\nFilm Significance:\nX Marks the Spot reflects the era’s themes of sacrifice, honor, and moral conflict against the backdrop of World War II. Unlike larger studio productions, it exemplifies Republic Pictures’ approach to fast-paced, lower-budget features designed for quick distribution but still packed with gripping narratives. The film blends the stylistic shadows of film noir with the patriotic undertones of wartime cinema, making it both an entertaining crime drama and a cultural time capsule of 1940s America.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like X Marks the Spot remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1942 release was presented in black and white, reflecting both the noir style and the cost constraints of Republic Pictures at the time. While authentic to its era, black-and-white films often struggle to connect with contemporary audiences. By presenting a carefully colorized edition, this version bridges history and modern viewing habits, preserving authenticity while creating visual appeal for today’s audiences in the USA, Europe, and beyond.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe specialize in restoring and colorizing Golden Age films, from lost mysteries to culturally significant dramas. Our goal is to keep these works alive and discoverable for modern audiences, ensuring their preservation while making them enjoyable for generations to come.\n\n#XMarksTheSpot #1940sMystery #FilmNoirClassic #PublicDomainMovie #ColorizedClassic #HelenParrish #DamianOFlynn #AnneGwynne #RepublicPictures #GoldenAgeHollywood #ClassicCrimeDrama #FilmRestoration #1942Movies #WWIICinema",
      "addedAt": "2025-12-24T00:47:12.729Z",
      "thumbnail": "https://i.ytimg.com/vi/dJYzzwfY-pc/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBhKFYwDw==&rs=AOn4CLAKFMMBF1sPJdgzHDq14wI_8OlZIQ",
      "duration": 3149,
      "language": "en",
      "year": 1942,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/x-marks-the-spot-1942_202307",
      "id": "x-marks-the-spot-1942_202307",
      "title": "X Marks the Spot (1942)",
      "description": "A private detective, soon to enlist in the army, is drawn into one final case when his police officer father is killed in the line of duty.  Soon his prime suspect is murdered as well, and he finds himself framed for the crime.  As more witnesses get murdered, he finds himself on the run from both the police and former Prohibition violators who seem to have found a new racket. Watch on RetroFlix:  https://retroflix.org/x-marks-the-spot-1942/",
      "fileSize": 101420323,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/x-marks-the-spot-1942_202307",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 148
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/x_marks_the_spot",
      "id": "x_marks_the_spot",
      "title": "X Marks the Spot",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 2691641154,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/x_marks_the_spot",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 58800
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/x_marks_the_spot_1942",
      "id": "x_marks_the_spot_1942",
      "title": "X Marks The Spot",
      "fileSize": 1091306557,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/x_marks_the_spot_1942",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 86969
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zgZvPrPxIdM",
      "id": "zgZvPrPxIdM",
      "title": "X Marks the Spot (1942) DETECTIVE",
      "description": "Stars: Damian O'Flynn, Helen Parrish, Dick Purcell\n Director: George Sherman\n\n It's 1942 and rubber is a valuable commodity. Private detective Eddie Delaney swings into action when his father, a police sergeant, is gunned down by rubber racketeers!",
      "addedAt": "2025-12-26T23:54:49.102Z",
      "thumbnail": "https://i.ytimg.com/vi/zgZvPrPxIdM/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhiIGIoYjAP&rs=AOn4CLD3TIMKgoArOqQYuLMGSL3VMyGvjw",
      "duration": 3159,
      "language": "en",
      "year": 1942,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "55 min",
    "imdbRating": 5.2,
    "imdbVotes": 296,
    "Genre": "Action, Crime, Mystery",
    "Plot": "It's 1942, rubber is a valuable commodity during WW2. Eddie Delaney is a second lieutenant in the army, but also a private detective. Eddy swings into action, when his father, police-sergeant Timothy J. Delaney, is gunned down by rubber racketeers. With the help of his brave friend and radio disc jockey Linda Ward and police-lieutenant William 'Bill' Decker, Eddy goes after the racketeers. Eddie, Linda and Bill have during their search to deal with various criminals, like Marty Clark and the unscrupulous businessman and owner of the nightclub 'The Spot', John J. Underwood.",
    "Director": "George Sherman",
    "Writer": "Stuart Palmer, Richard Murphy, Mauri Grashin",
    "Actors": "Dick Purcell, Helen Parrish, Neil Hamilton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0036189",
    "tt0032763",
    "tt0038058",
    "tt0033510",
    "tt0033595",
    "tt0034988",
    "tt0035863",
    "tt0036188",
    "tt0034637",
    "tt0034754",
    "tt0035057",
    "tt0023478"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}