{
  "imdbId": "tt0021597",
  "title": "Alias the Bad Man",
  "year": 1931,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EChOa79YTEY",
      "id": "EChOa79YTEY",
      "title": "Alias the Bad Man (1931) KEN MAYNARD",
      "description": "Stars: Ken Maynard, Tarzan, Virginia Brown Faire\nDirector: Phil Rosen\n\n A ranger joins the outlaw gang whose boss he believes is a murderer.",
      "addedAt": "2025-12-26T23:51:44.908Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/EChOa79YTEY/maxresdefault.webp",
      "duration": 3780,
      "language": "en",
      "year": 1931,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "66 min",
    "imdbRating": 6,
    "imdbVotes": 104,
    "Genre": "Western",
    "Plot": "Texas Ranger Ken Neville receives a letter from his father, rancher Clem Neville stating that a neighboring rancher, Silas Warner is stealing his cattle and also accusing Neville of being a rustler. Ken leaves to help his father, while a fellow Ranger, a stutterer named Ned \"Repeater\" Simpson follows him. Meanwhile, the elder Neville now suspects that local saloon owner Rance Collins is really the man behind the rustlings and, after telling Warner's daughter Mary that he is going out to see her father, takes a telegram confirming his suspicions about Collins and his past to Warner. Collins learns from Mary, who doesn't know the details, about Neville's planned visit, and he and henchman Rawhide follow him. Collins, listening through an open window, learns that the two ranchers know he is behind their feud and troubles, shoots them both and arranges the bodies to look as if they had killed each other in a quarrel. Ken, concealing his identity from Mary, learns from her that she had told Collins that Neville was riding out to the Warner ranch.As he is leaving the Warner ranch, he meets foreman \"Black Mike\" Richards, and then sees him in town that night in the saloon talking to Collins. Later, Ken approaches Collins and tells him he knows of his past rustling reputation in Toponah and that he himself is the notorious \"Red River\" Ganz and they ought to go into partnership. \"Repeater\", following a plan he and Ken devised comes into the saloon, identifies himself as a Texas Ranger and is shot by Ken in a faked shootout.The impressed Collins takes Ken on and sends him to the Warner ranch to work with henchman \"Black Mike.\" But Mary learns accidentally that Ken is Neville's son and she, ever-trusting, tells Collins. This does not enhance Ken's chances of getting the goods on Collins.",
    "Director": "Phil Rosen",
    "Writer": "Earle Snell, Ford Beebe",
    "Actors": "Ken Maynard, Tarzan, Virginia Brown Faire",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021694",
    "tt0023344",
    "tt0022514",
    "tt0023692",
    "tt0023186",
    "tt0022848",
    "tt0022673",
    "tt0024444",
    "tt0023967",
    "tt0032959",
    "tt0037599",
    "tt0025303"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:40:11.042Z"
}