{
  "movieId": "tt0051569",
  "title": "Lake of the Dead",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lake.-of.-the.-dead.-1958",
      "id": "lake.-of.-the.-dead.-1958",
      "title": "Lake of the Dead (1958)",
      "description": "\"Lake of the Dead\" (Norwegian title: \"De dødes tjern\") is a 1958 Norwegian mystery horror film directed by Kåre Bergstrøm. The film follows six friends who travel to a remote cabin in the Østerdal forests of Norway. They are there to visit Bjørn Werner, but upon arrival, they discover he is missing, and his dog is found dead near a nearby lake. The group soon becomes entangled in local legends about a tragic past involving a murder-suicide linked to the lake, which suggests that anyone who stays in the cabin may be drawn to drown themselves in the water. ",
      "fileSize": 3290533917,
      "addedAt": "2026-01-07T00:09:38.887Z",
      "thumbnail": "https://archive.org/services/img/lake.-of.-the.-dead.-1958",
      "language": "nor / English subtitles",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 365
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "76 min",
    "imdbRating": 6.8,
    "imdbVotes": 2701,
    "Genre": "Horror, Thriller, Mystery",
    "Plot": "20-23 August 1958: Crime Author Bernhard and his wife Sonja, psychoanalyst Kai, magazine editor Gabriel, lawyer Harald and his fiancée Liljan are six Oslo people who will visit Bjørn, Liljan's brother in his cabin deep in the Østerdal forests. But, when the guests arrive, Bjørn is missing and his dog is found dead at a pond nearby. It's not long before they begin to ponder the old legend that is associated with the place: a man is said to have killed his sister and her lover and then drowned himself in the lake. It is said that everyone who stays in the house-the murder's cabin-would be possessed by a strange attraction: They would be forced to drown themselves in the pond. The company decides to solve the mystery, but soon it appears that they are exposed to the mysterious, fascinating powers that are tied to the lake.",
    "Director": "Kåre Bergstrøm",
    "Writer": "Kåre Bergstrøm, André Bjerke",
    "Actors": "Erling Lindahl, Bjørg Engh, Henny Moan",
    "Language": "Norwegian",
    "Country": "Norway",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0052602",
    "tt0053719",
    "tt0055470",
    "tt0024625",
    "tt0073582",
    "tt0185371",
    "tt2364774",
    "tt0034985",
    "tt0024382",
    "tt0052228",
    "tt0052169",
    "tt1861279"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.887Z"
}