{
  "imdbId": "tt0080310",
  "title": "Breaker Morant",
  "year": 1980,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/breaker-morant-.-1980",
      "id": "breaker-morant-.-1980",
      "title": "Breaker Morant (1980)",
      "description": "Breaker Morant (1980) is a historical drama film directed by Bruce Beresford, based on the true story of three Australian soldiers during the Second Anglo-Boer War. The film centers on Lieutenant Harry Morant , Lieutenant Peter Handcock , and Lieutenant George Witton , who find themselves facing court-martial for the murder of Boer prisoners of war. As the story unfolds, it examines the harsh realities of war and the moral complexities involved in military orders, particularly the tensions between duty and ethics. The film is set in South Africa during the Boer War, where Australian Light Horse soldiers are engaged in brutal guerrilla warfare against the Boer forces.Following the killing of Boer prisoners, Morant and his fellow officers are arrested and tried. The military court's investigation reveals the contentious environment of war, where orders from superiors often conflict with personal ethics.Throughout the trial, various characters, including commanding officers and a defense attorney, present evidence. Morant and Handcock's defense hinges on the argument that they were merely following orders. The film explores themes of colonialism, the responsibilities of soldiers, and the moral ambiguity of war. It questions the integrity of military justice and critiques the broader implications of imperial power.The narrative builds to a tense climax as the soldiers confront their fate, illustrating the tragic consequences of a conflict that often places moral dilemmas over accountability.",
      "fileSize": 2781905290,
      "addedAt": "2026-01-07T00:07:38.720Z",
      "thumbnail": "https://archive.org/services/img/breaker-morant-.-1980",
      "language": "eng",
      "year": 1980,
      "collection": "feature_films",
      "downloads": 203
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "107 min",
    "imdbRating": 7.8,
    "imdbVotes": 15180,
    "Genre": "Drama, History, War",
    "Plot": "During the Boer War, three Australian lieutenants are on trial for shooting Boer prisoners. Though they acted under orders, they are being used as scapegoats by the General Staff, who hopes to distance themselves from the irregular practices of the war. The trial does not progress as smoothly as expected by the General Staff, as the defence puts up a strong fight in the courtroom.",
    "Director": "Bruce Beresford",
    "Writer": "Jonathan Hardy, David Stevens, Bruce Beresford",
    "Actors": "Edward Woodward, Jack Thompson, John Waters",
    "Language": "English, Afrikaans",
    "Country": "Australia",
    "Awards": "Nominated for 1 Oscar. 13 wins & 8 nominations total"
  },
  "relatedMovies": [
    "tt0080979",
    "tt0101465",
    "tt0075784",
    "tt0086251",
    "tt0074400",
    "tt0092978",
    "tt0057811",
    "tt0044400",
    "tt0227607",
    "tt0159476",
    "tt0014672",
    "tt0043590"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1980s",
      "name": "1980s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.720Z"
}