{
  "movieId": "tt0025712",
  "title": "The Return of Chandu",
  "year": 1934,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dMqFpjSBl0Y",
      "id": "dMqFpjSBl0Y",
      "title": "Return of Chandu (1934) BELA LUGOSI🍕12-CHAPTER CLIFFHANGER",
      "description": "Exclusive PizzaFLIX Marathon Edition! Complete 12-chapter Cliffhanger\nStarring: Bela Lugosi, Maria Alba, Josef Swickard\nDirected by: Ray Taylor\n\nThe character Chandu the Magician was originally created for an afternoon radio series. It was first adapted into a 1932 feature film starring Edmund Lowe with Bela Lugosi in his typical arch-villain role. In a rare heroic turn, Lugosi returns in this sequel to head the cast as the famed hypnotist and master of White Magic. His love interest, played by the exotic Maria Alba, is the sole surviving Princess of Egypt. But she is relentlessly pursued by a secret cult of evil sorcerers who believe their high priestess will be resurrected if a woman of royal Egyptian blood is sacrificed in her honor!\n\n🍕CHAPTERS🍕\n0:00        PizzaFLIX Introduction\n2:13        CHAPTER 1: The Chosen Victim\n18:58      CHAPTER 2: The House in the Hills\n38:04      CHAPTER 3:  On the High Seas\n53:37      CHAPTER 4: The Evil Eye\n1:11:53   CHAPTER 5: The Invisible Circle\n1:26:21   CHAPTER 6: Chandu's False Step\n1:41:23   CHAPTER 7: Mysterious Magic\n1:57:08   CHAPTER 8: The Edge of the Pit\n2:11:14   CHAPTER 9: The Terror Invisible\n2:26:55   CHAPTER 10: The Crushing Rock\n2:45:37   CHAPTER 11: The Uplifted Knife\n3:00:59   CHAPTER 12: The Knife Descends\n3:17:57   Please Subscribe!",
      "addedAt": "2025-12-26T23:43:03.192Z",
      "thumbnail": "https://i.ytimg.com/vi/dMqFpjSBl0Y/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLDRfSTyCcbhpEkRaknrwwtVpu5bdg",
      "duration": 11891,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=m_kdOj7tolI",
      "id": "m_kdOj7tolI",
      "title": "The Return of Chandu (1934) Bela Lugosi | Adventure, Horror | Full Movie",
      "description": "The cult of Ubasti, headquartered on the isle of Lemuria, believes that Princess Nadji of Egypt is a reincarnation of their long-dead goddess, Ossana, and intend to sacrifice her so that Ossana may be resurrected.\n\nDirector: Ray Taylor\nWriters: Barry Barringer \nStars: Bela Lugosi, Maria Alba, Clara Kimball Young \nGenres: Adventure, Fantasy, Horror, Psychotronic \n\n00:00 Full Movie\n01:38 🔮 A princess arrives in America and is warned of a danger in her home.\n06:33 ✨ Uncle Frank's friends are causing suspicion and concern, leading to a revelation about the Sect of Ubasti and their plans to bring back their priestess through human sacrifice.\n14:58 😱 A mysterious and dangerous organization called the Sect of Ubasti is targeting Princess Nadji, and Chandu and his friends must protect her.\n27:32 😱 Uncle Frank and the group face danger as they encounter black magic and hypnotism.\n49:50 🔒 The princess is in danger and needs to be saved from the temple of Lemuria.\n\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:48:34.919Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/m_kdOj7tolI/maxresdefault.webp?v=652352fd",
      "duration": 3595,
      "language": "en",
      "year": 1934,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "208 min",
    "imdbRating": 5.5,
    "imdbVotes": 456,
    "Genre": "Adventure, Family, Fantasy",
    "Plot": "The Black Magic cult of Ubasti, based on the isle of Lemuria, believes that Nadji, a princess of Egypt, is a reincarnation of their long-dead goddess, Ossana, and intend to sacrifice Nadji so that Ossana may be resurrected. Nadji has taken refuge at the California home of Frank Chandler, an American raised in the east and possessed of White Magical powers, who calls himself \"Chandu\". Vindhyan, high priest of the cult's California outpost, learns of this and ultimately succeeds in placing her in a trance which Chandu cannot easily break, propelling him to move her to safety, choosing the port of Suva in the South Seas. There, aided by his sister Dorothy, nephew Bob and niece Betty, Chandu is able to revive her and deal with Vindhyan, only to have the evil Voice of Ubasti, highest of the high priests, spirit her to Lemuria through the magic Circle of Ola. Chandu, Dorothy, Bob and Betty set out in pursuit but end up shipwrecked on Lemuria itself, with his family also now held for sacrifice while Chandu is plunged into the endless maze of caverns beneath the evil Temple of Ubasti, shrouded from his own powers by the full forces of Black Magic...",
    "Director": "Ray Taylor",
    "Writer": "Harry A. Earnshaw, Vera M. Oldham, R.R. Morgan",
    "Actors": "Bela Lugosi, Maria Alba, Clara Kimball Young",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026195",
    "tt0025656",
    "tt0023753",
    "tt0026435",
    "tt0024445",
    "tt0025644",
    "tt0050084",
    "tt0004873",
    "tt0089961",
    "tt0004099",
    "tt0004457",
    "tt0015400"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:54:11.963Z"
}