{
  "imdbId": "tt0039366",
  "title": "The Fabulous Joe",
  "year": 1947,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hZTod1BrWak",
      "id": "hZTod1BrWak",
      "title": "The Fabulous Joe (1947) HAL ROACH COMEDY",
      "description": "Exclusive PizzaFLIX Movie Class Edition!\nStarring: Walter Abel, Barbara Bates, Sheldon Leonard\nDirection: Harve Foster\nA Henpecked husband's life is turned upside down after inheriting a talking dog. \nCHAPTERS\n0:00 Movie Class Introduction\n2:36 Feature Film\n1:01:38  Please Subscribe",
      "addedAt": "2025-12-26T23:42:45.357Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/hZTod1BrWak/maxresdefault.webp",
      "duration": 3718,
      "language": "en",
      "year": 1947,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "59 min",
    "imdbRating": 6,
    "imdbVotes": 160,
    "Genre": "Action, Comedy, Fantasy",
    "Plot": "Milo Terkel has a social-climbing wife, Emily, who is preoccupied with being involved with the rest-stops-for-birds-flying-south project of Mrs. Cornelius Belmont; a spend-thrift daughter, Debbie, preoccupied with her engagement to Cornelius Belmont III; and an over-the-hill, aging ex-jock of a brother-in-law, George Baxter, who free-loads off of and lives with the Terkel family. Enter Lawyer Henry Cadawaller who informs Milo he has inherited a dog, Joe, which the late owner guarantees will change Milo's life. It does, as Joe can talk (but does so only to Milo), and Joe is full of advice, mostly with dire consequences for Milo. Joe's first pearl of wisdom advises Milo to get tough at home, he does, and wife and daughter and even the hard-to-offend George depart.Milo goes to a bar and Joe soon has him involved with Gorgeous Gilmore, girl friend of Louie who is one tough cookie indeed and prone (actually programmed) to get physical. Joe makes Gorgeous fall into a park lake across the street from Milo's apartment, she thinks Milo did it, he (ever the gentleman) takes her to his now-empty apartment to get her dress dried, and Joe tosses, in a manner of speaking, the dress out of the window. The slip-clad Gorgeous can't leave until Milo gets her a new dress, but then the family returns, the Belmonts pay a visit, Louie drops by and the question is now whether Gorgeous can stay out of sight.",
    "Director": "Harve Foster",
    "Writer": "Hal Roach Jr., Jack Jevne, Arnold Belgard",
    "Actors": "Walter Abel, Margot Grahame, Marie Wilson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039133",
    "tt0039198",
    "tt0038590",
    "tt0039231",
    "tt0039339",
    "tt0286112",
    "tt0488962",
    "tt0843873",
    "tt5481984",
    "tt0039580",
    "tt0039337",
    "tt0200006"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:28:26.515Z"
}