{
  "imdbId": "tt0023078",
  "title": "Jolly Fish",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jolly-fish-1932",
      "id": "jolly-fish-1932",
      "title": "Jolly Fish (1932)",
      "description": "Tom and Jerry go fishing, where they encounter an affectionate but annoying fish who won't leave them alone. They hear a piano-playing octopus (with twelve arms!) and have a run-in with a sword fish who cuts their boat in half. Other hijinks ensue, and the two eventually catch a tiny fish, which is in turn swallowed by a larger fish, and this process continues until they've caught a veritable whale. They row ashore triumphant, but when one of them puts their reel (still holding the fish) over their shoulder, the larger fish slip off, unbeknownst to them, leaving them with the runt they started with. Watch on RetroFlix:  https://retroflix.org/jolly-fish-1932/",
      "fileSize": 40016557,
      "addedAt": "2026-01-07T00:09:15.997Z",
      "thumbnail": "https://archive.org/services/img/jolly-fish-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 39
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.5,
    "imdbVotes": 88,
    "Genre": "Family, Animation, Short",
    "Plot": "Tom and Jerry go fishing, where they encounter an affectionate but annoying fish who won't leave them alone. They hear a piano-playing octopus (with twelve arms!) and have a run-in with a sword fish who cuts their boat in half. Other hijinks ensue, and the two eventually catch a tiny fish, which is in turn swallowed by a larger fish, and this process continues until they've caught a veritable whale. They row ashore triumphant, but when one of them puts their reel (still holding the fish) over their shoulder, the larger fish slip off, unbeknownst to them, leaving them with the runt they started with.",
    "Director": "John Foster, Vernon Stallings",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0152550",
    "tt0152123",
    "tt0152780",
    "tt0153306",
    "tt0153942",
    "tt0151146",
    "tt0151935",
    "tt0152162",
    "tt0153325",
    "tt0022653",
    "tt0161707",
    "tt0151950"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.997Z"
}