{
  "imdbId": "tt0041523",
  "title": "Jigsaw",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Jigsaw720p1949",
      "title": "Jigsaw",
      "description": "Title: Jigsaw Summary: New York Assistant District Attorney Howard Malloy investigates a series of murders and uncovers an extremist group. Directed by: Fletcher Markle Actors: Franchot Tone, Jean Wallace, Myron McCormick Production Company: Tower Pictures Inc. Release Date: 11 March 1949 (USA) Aspect Ratio: 1.37 : 1 When the owner of a printing shop is found dead, the District Attorney assumes that it was a suicide. But the Assistant D.A., Howard Malloy, suspects that there is a connection with an extremist political group called the 'Crusaders'. When a journalist whose articles had attacked the Crusaders is also killed, Malloy is convinced. With help from the widow of a prominent judge, he conducts an investigation. As he does so, he meets a peculiar political boss and also an attractive night club singer, each of whom could become either a source of help or a source of danger.",
      "fileSize": 776116247,
      "id": "Jigsaw720p1949"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Jigsaw_",
      "title": "Jigsaw",
      "description": "The plot is about a shadowy group called the Crusaders, which has been organizing itself into a power center. Its poster shows a handsome Aryan lad against the waving American flag. Their slogan, \"Join The Crusaders -- Fight for America!\". The implication is clear...the Crusaders will be against anyone who doesn't look, sound or believe the way that Aryan poster boy does. When a columnist is killed while looking into the Crusaders, Howard Malloy finds himself appointed a special prosecutor. He also finds himself in a noxious mess that combines crime, nativism and the reactionary beliefs of some of the privileged few. You can play the amusing Hollywood game of Spot the Star Cameo. In unbilled bits that last a second or two are such luminaries as Burgess Meredith, John Garfield, Marsha Hunt, Everett Sloane, Henry Fonda and Marlene Dietrich.",
      "fileSize": 1668883540,
      "id": "Jigsaw_"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jigsaw-1949",
      "title": "Jigsaw (1949)",
      "description": "New York Assistant District Attorney Howard Malloy is working hard on investigation about a series of murders related to an extremist group. Watch on RetroFlix:  https://retroflix.org/jigsaw-1949/",
      "fileSize": 446894728,
      "id": "jigsaw-1949"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5jZolxW3eqU",
      "title": "Jigsaw (1949) [Film Noir] [Crime] [Drama]",
      "description": "\"Jigsaw\" is a Film Noir directed by Fletcher Markle, and starring Franchot Tone, Jean Wallace and Marc Lawrence. The feature was produced by Edward J. Danziger and Harry Lee Danziger from a screenplay by Vincent McConnor and Fletcher Markle from a story by John Roeburt. Of note is that the film has cameo appearances by Marlene Dietrich, Henry Fonda, John Garfield, Burgess Meredith, Marsha Hunt, Doe Avedon, Everett Sloane, newspaper columnist Leonard Lyons, and the director Fletcher Markle.\n\nThe title refers to a jigsaw puzzle and the story begins with the murder of a print shop owner that is quickly labeled a suicide. But newspaper columnist Charlie Riggs is convinced that it was a murder related to a white neo-fascist organization called the Crusaders and imparts this suspicion to Assistant District Attorney Howard Malloy. He also publishes this opinion in his column. Then Riggs himself is murdered, inducing Malloy to launch an investigation into the Crusaders. Because the group appears to be getting backing from organized crime, Malloy looks there, soon receiving unasked-for help from a crime boss called Angel, who recommends him for the position of special prosecutor.\n\nLater, with further help from a prominent judge's widow, Malloy is appointed. This is supposed to put him in the pocket of those behind the murders. But Malloy proceeds to investigate the artist who created the Crusaders recruiting poster. Seeing in the artist's studio a painting of an attractive night club singer, Malloy then proceeds to investigate her. This leads to a series of revelations regarding all of these characters and ends with more people dead and wounded in a fiery exchange at the end.\n\n---\n\nDirected by Fletcher Markle, produced by Edward J. Danziger and Harry Lee Danziger, screenplay by Fletcher Markle and Vincent McConnor,story by John Roeburt, starring Franchot Tone as Howard Malloy, Jean Wallace as Barbara Whitfield, Myron McCormick as Charles Riggs, Marc Lawrence as Angelo Agostini, Winifred Lenihan as Mrs. Hartley, Doe Avedon as Caroline Riggs, Hedley Rainnie as Sigmund Kosterich, Walter Vaughan as District Attorney Walker, George Breen as Knuckles, Robert Gist as Tommy Quigley, Hester Sondergaard as Mrs. Borg, Luella Gear as Pet Shop Owner, Alexander Campbell as Pemberton, Robert Noe as Waldron, Alexander Lockwood as Nichols, Ken Smith as Wylie\nAlan MacAteer as Museum Guard, Manuel Aparicio as Warehouse Guard and Brainerd Duffield as Butler.\n\n---\n\nSource: \"Jigsaw (1949 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 12 July 2013. Web. 21 July 2013. http://en.wikipedia.org/wiki/Jigsaw_(1949_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "5jZolxW3eqU",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5MKyEDZ9lNw",
      "title": "Jigsaw (1949) | Colorized Public Domain Classic Crime Noir Mystery with Franchot Tone",
      "description": "Jigsaw (1949) is a crime drama and film noir directed by Fletcher Markle, starring Franchot Tone, Jean Wallace, and Myron McCormick. Produced in the late 1940s, this suspenseful public domain classic delivers intrigue, political undertones, and a chilling murder mystery that reflects postwar anxieties in American society. Now restored and colorized, this film noir gem is revived for modern audiences across the United States, Europe, and worldwide, making it more accessible and visually engaging while preserving its historical authenticity.\n\nPlot Summary:\nThe story opens when New York Assistant District Attorney Howard Malloy (Franchot Tone) becomes entangled in the shocking murder of a newspaper columnist. The columnist had been investigating an extremist organization with disturbing political connections, and his death draws Malloy into a web of lies, corruption, and hidden agendas. As Malloy pursues the case, he uncovers ties between wealthy elites, radical groups, and underworld operatives who are determined to silence anyone threatening their network.\n\nThe investigation leads him to Barbara Whitfield (Jean Wallace), a beautiful and enigmatic figure whose loyalties remain uncertain. Malloy must balance his personal emotions with his professional duty as he navigates betrayal, violence, and cover-ups. Alongside his friend Charles Riggs (Myron McCormick), Malloy pieces together the “jigsaw” of clues, exposing the dangerous reach of fascist-leaning organizations in postwar America. The tension builds to a dramatic climax, where courage, justice, and truth stand against secrecy and corruption.\n\nCast and Crew:\n• Director: Fletcher Markle\n• Producer: Edward A. Golden\n• Screenplay: Fletcher Markle (adaptation), Arthur Arent (original story)\n• Music: Herschel Burke Gilbert\n• Cinematography: J. Roy Hunt\n• Editing: Owen Marks\n\nStarring:\n• Franchot Tone as Howard Malloy\n• Jean Wallace as Barbara Whitfield\n• Myron McCormick as Charles Riggs\n• Marc Lawrence as Angel\n• Winifred Lenihan as Mrs. Whitfield\n• Henry L. Stephenson as Ralph Gilmore\n• Members of the New York elite and political figures make appearances, adding authenticity to the film’s atmosphere.\n\nFilm Significance:\n“Jigsaw” is notable as a socially conscious noir that daringly portrayed extremist organizations and their hidden influence during the late 1940s, a time when political paranoia and fears of fascism and communism shaped American culture. While not a major studio release, its gritty narrative, moody cinematography, and suspense-driven pacing make it a strong example of independent film noir. The movie also gained attention for its cameos by influential personalities of the era, blending fiction with a veneer of real-world relevance.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Jigsaw remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1949 release was black and white, fitting the noir tradition but often overlooked by modern viewers who are accustomed to high-definition color. By offering this colorized edition, we make the suspense and atmosphere of Jigsaw more appealing to contemporary audiences while maintaining the authenticity of its noir roots. This balance allows classic film enthusiasts and new viewers alike to experience the story with fresh impact.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Jigsaw1949 #FranchotTone #FilmNoir #PublicDomainMovie #ColorizedClassic #ClassicCinema #CrimeDrama #GoldenAgeHollywood #RestoredMovies #1940sFilm",
      "id": "5MKyEDZ9lNw",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QxLkaqz2vhA",
      "title": "Jigsaw (1949) FRANCHOT TONE",
      "description": "Stars: Franchot Tone, Jean Wallace,Myron McCormick\nDirector: Fletcher Markle\n\nNew York Assistant District Attorney Howard Malloy investigates a series of murders and uncovers an extremist group.",
      "id": "QxLkaqz2vhA",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1949-jigsaw-fletcher-markle-ve",
      "title": "1949 - Jigsaw - Fletcher Markle - VE",
      "description": "For Academic - Educational Use Only https://derechonoir.wordpress.com/",
      "fileSize": 653495648,
      "id": "1949-jigsaw-fletcher-markle-ve"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1949-jigsaw-fletcher-markle-vo",
      "title": "1949 - Jigsaw - Fletcher Markle - VO",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "fileSize": 485313968,
      "id": "1949-jigsaw-fletcher-markle-vo"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "72 min",
    "imdbRating": 5.6,
    "imdbVotes": 962,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "When the owner of a printing shop is found dead, the District Attorney assumes that it was a suicide. But the Assistant D.A., Howard Malloy, suspects that there is a connection with an extremist political group called the 'Crusaders'. When a journalist whose articles had attacked the Crusaders is also killed, Malloy is convinced. With help from the widow of a prominent judge, he conducts an investigation. As he does so, he meets a peculiar political boss and also an attractive night club singer, each of whom could become either a source of help or a source of danger.",
    "Director": "Fletcher Markle",
    "Writer": "Fletcher Markle, Vincent McConnor, John Roeburt",
    "Actors": "Franchot Tone, Jean Wallace, Myron McCormick",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0043782",
      "title": "The Man with a Cloak",
      "year": 1951,
      "imdbRating": 6.6,
      "imdbVotes": 1377,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041503",
      "title": "Impact",
      "year": 1949,
      "imdbRating": 7,
      "imdbVotes": 5035,
      "language": "English, Cantonese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041268",
      "title": "Criss Cross",
      "year": 1949,
      "imdbRating": 7.4,
      "imdbVotes": 10070,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041555",
      "title": "Knock on Any Door",
      "year": 1949,
      "imdbRating": 6.6,
      "imdbVotes": 4414,
      "language": "English, Italian, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041761",
      "title": "Port of New York",
      "year": 1949,
      "imdbRating": 6,
      "imdbVotes": 1105,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041269",
      "title": "The Crooked Way",
      "year": 1949,
      "imdbRating": 6.6,
      "imdbVotes": 1671,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041786",
      "title": "The Reckless Moment",
      "year": 1949,
      "imdbRating": 7.1,
      "imdbVotes": 6042,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042006",
      "title": "The Undercover Man",
      "year": 1949,
      "imdbRating": 6.6,
      "imdbVotes": 1454,
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041958",
      "title": "Thieves' Highway",
      "year": 1949,
      "imdbRating": 7.5,
      "imdbVotes": 7130,
      "language": "English, Italian, Greek",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041967",
      "title": "Tokyo Joe",
      "year": 1949,
      "imdbRating": 6.3,
      "imdbVotes": 2918,
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041968",
      "title": "Too Late for Tears",
      "year": 1949,
      "imdbRating": 7.3,
      "imdbVotes": 6166,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041243",
      "title": "Chicago Deadline",
      "year": 1949,
      "imdbRating": 6.4,
      "imdbVotes": 375,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T17:42:39.119Z"
}