{
  "movieId": "tt0063171",
  "title": "The Snow Woman",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-snow.-woman.-1968",
      "id": "the.-snow.-woman.-1968",
      "title": "The Snow Woman (1968)",
      "description": "\"The Snow Woman\" ( Kaidan Yukijorō ) is a 1968 Japanese fantasy horror film directed by Tokuzō Tanaka . It was produced by Daiei Film and is an adaptation of the Yuki-onna short story from Lafcadio Hearn's 1904 collection, Kwaidan: Stories and Studies of Strange Things . The film runs for 80 minutes and combines elements of fantasy, romance, and horror to portray the legend of Yuki-onna, the snow woman. The film's story begins in feudal Japan , where two sculptors seek a special tree for carving a statue of Kannon , the Buddhist goddess. As a blizzard hits, they take refuge in an abandoned hut, where the legendary Yuki-onna appears. She freezes the elder master yet spares the younger apprentice, Yosaku , on the condition that he never speaks of their encounter. As the story unfolds, Yosaku lives with the old master's widow, and soon meets a young woman named Yuki , who stays with them during heavy rain. Yuki, who possesses magical abilities, helps cure the widow's illness, leading to a series of events that bring her closer to Yosaku. Themes of loyalty, love, and the supernatural permeate the film as Yuki grapples with her identity and the consequences of her powers. Eventually, her past catches up with her, culminating in a confrontation where Yosaku learns she is the Snow Woman. Despite the dangers, their bond grows, leading to a dramatic and poignant conclusion.",
      "fileSize": 1337242119,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-snow.-woman.-1968",
      "language": "jpn",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 484
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 7.2,
    "imdbVotes": 688,
    "Genre": "Horror, Romance",
    "Plot": "The lives of a master sculptor and his young apprentice are changed forever when they meet an evil witch during a snow storm.",
    "Director": "Tokuzô Tanaka",
    "Writer": "Lafcadio Hearn, Fuji Yahiro",
    "Actors": "Shiho Fujimura, Akira Ishihama, Machiko Hasegawa",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035009",
    "tt0048938",
    "tt0061529",
    "tt0060270",
    "tt0055230",
    "tt0021828",
    "tt0132184",
    "tt0063350",
    "tt0022454",
    "tt0060265",
    "tt0014142",
    "tt0061520"
  ],
  "collections": [
    {
      "id": "horror",
      "name": "Horror"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}