{
  "imdbId": "tt0043390",
  "title": "Cause for Alarm!",
  "year": 1951,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1951-cause-for-alarm-motivo-de-alarma-tay-garnett-vose",
      "title": "1951 Cause For Alarm Motivo De Alarma Tay Garnett Vose",
      "id": "1951-cause-for-alarm-motivo-de-alarma-tay-garnett-vose"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cause-for-alarm-1951_202307",
      "title": "Cause For Alarm 1951 202307",
      "description": "A bedridden and gravely ill man believes his wife and doctor are conspiring to kill him, and outlines his suspicions in a letter. Watch on RetroFlix:  https://retroflix.org/cause-for-alarm-1951/",
      "id": "cause-for-alarm-1951_202307"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cause-for-alarm-full-movie-good-quality-1951",
      "title": "Cause For Alarm Full Movie Good Quality",
      "description": "As the delusional George Jones (Barry Sullivan) struggles to recover from a crippling heart attack, he begins to believe his wife, Ellen (Loretta Young), and friend, Dr. Grahame (Bruce Cowling), are planning to kill him in order to be together. George decides to write the authorities about his wife' s supposed murder plot. But when he really does die, of health complications, the innocent Ellen realizes that she must stop the letter before she's accused of killing her husband.",
      "id": "cause-for-alarm-full-movie-good-quality-1951"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cause_for_alarm",
      "title": "Cause For Alarm",
      "id": "cause_for_alarm"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cause_for_alarm_1951",
      "title": "Cause For Alarm",
      "id": "cause_for_alarm_1951"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=t_bNDDM5ABQ",
      "title": "Cause for Alarm! (1951) [Film Noir] [Drama]",
      "description": "A flashback shows how Ellen met George in a naval hospital during World War II while she was dating his friend, Lieutenant Ranney Grahame (Bruce Cowling), a young military doctor whose busy schedule left little time for her. George was a pilot and Ellen swiftly fell in love with him, although the flashback strongly hints he had some capacity for arrogance and selfishness. Nevertheless, they soon married and after the war wound up in a leafy suburban Los Angeles neighbourhood. Unhappily, George is now confined to his bed with heart problems, there is a heat wave and Ellen is spending most her time caring for him. George's doctor is their old friend Ranney, with whom George thinks his wife is having an affair. In response, Ranney suggests George may need psychological help. After Ellen tells her bedridden husband she dreams of having children, he becomes angry. Meanwhile George has written a letter to the district attorney in which he claims his wife and best friend are killing him with overdoses of medicine for his heart.\n\nA little neighbour boy dressed as a movie cowboy and warding cap pistols (Bradley Mora) befriends the childless Ellen, who gives him cookies. He hands her a toy (fake) television set and asks Ellen to give it to George, which she does whilst serving her husband lunch in bed. He tells her an unsettling story about how as a child he had beaten a neighbour boy with a rake until he drew blood. Thinking the thick letter has something to do with insurance, Ellen gives it to the postman (Irving Bacon), who sees George in the upstairs bedroom window. When Ellen rushes up to find out why he has gotten out of bed, George lets her know what the letter says and who it is addressed to. George pulls a gun and is about to kill her when he drops dead on the bed. In her narration she describes George's death as \"one of those awful dreams.\" Ellen panics over the letter and as noted by a reviewer over 50 years later, throughout the film's second half seems \"much more concerned with absolving herself from the blame of his death than missing her spouse.\" Running from the house and shown the way by two teenagers in the film's brief reference to Los Angeles' mid-twentieth century jalopy culture, she chases down the overly talkative postman to whom she gave the letter but he won't give it back to her without talking to George first, since he wrote it. However, the postman says she can ask the supervisor at the downtown post office, who has more authority. Ellen is frantic when she gets back to the house, only to find George's Aunt Clara (Margalo Gillmore) climbing the stairs to see him and stops her barely in time. After the two talk for a while, Clara again heads up the stairs but Ellen stops her once more, saying George told her earlier not to let his aunt see him. Clara leaves in a huff, telling her George was \"rude, mean and selfish since he's been six... he's worse if anything.\"\n\nEllen goes back up to the bedroom to change her clothes and sees the gun still in George's hand, narrating, \"Somehow I knew I shouldn't leave it there.\" As she wrenches the pistol from his hand, it fires. Readying herself to leave the house, a polite but somewhat aggressive notary (Don Haggerty) rings the doorbell, telling her he has an appointment with George to go over some legal documents. She steadfastly says George is too sick to see anyone. Ellen desperately drives downtown to the post office to see the supervisor, who is friendly and gives her a form for George to sign but then, nettled by Ellen's unhinged and uncooperative behaviour, tells her he is going to allow the letter to be delivered. Defeated, she returns to the house and as she gets to the front door, a kindly neighbour woman (Georgia Backus) offers to help Ellen, since she has seemed so upset all day...\n\n---\n\nDirected by Tay Garnett, produced by Tom Lewis, written by Larry Marcus, screenplay by Mel Dinelli and Tom Lewis, starring Loretta Young as Ellen Jones, Barry Sullivan as George Z. Jones, Bruce Cowling as Dr. Ranney Grahame, Margalo Gillmore as aunt Clara Edwards, Bradley Mora as Hoppy (Billy), Irving Bacon as Joe Carston (the postman), Georgia Backus as Mrs. Warren (the neighbor), Don Haggerty as Mr. Russell (the notary), Art Baker as the post office superintendent and Richard Anderson as the wounded sailor at a naval hospital.\n\n---\n\nSource: \"Cause for Alarm!\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 6 March 2012. Web. 11 March 2012. http://en.wikipedia.org/wiki/Cause_for_Alarm!\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "t_bNDDM5ABQ",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rSEEOH9e-Jg",
      "title": "Cause for Alarm! (1951) | Colorized Public Domain Noir Thriller | Loretta Young and Barry Sullivan",
      "description": "Cause for Alarm! (1951) is an American film noir thriller directed by Tay Garnett and released by Metro-Goldwyn-Mayer. This restored and colorized public domain classic brings new intensity to a psychological suspense story that unfolds in broad daylight, proving that paranoia and fear are just as effective under the sun as in the shadows. Starring Academy Award-winning actress Loretta Young alongside Barry Sullivan and Bruce Cowling, the film combines domestic melodrama with noir tension, offering a chilling look at mistrust, miscommunication, and the fragility of marriage in postwar America. By reviving this overlooked gem in color, modern audiences in the USA, Europe, and worldwide can rediscover a forgotten thriller from Hollywood’s Golden Age.\n\nPlot Summary:\nThe story follows Ellen Brown (Loretta Young), a devoted housewife living in suburban California with her husband George Z. Jones (Barry Sullivan), a former Army officer recovering from a serious heart condition. While Ellen tries to maintain a sense of normalcy, George grows increasingly suspicious and paranoid, convinced that Ellen is conspiring against him with their neighbor and family doctor, Dr. Grahame (Bruce Cowling).\n\nIn a moment of distrust, George writes a letter accusing Ellen and Dr. Grahame of plotting his death. Shortly afterward, George suffers a fatal heart attack. Before Ellen can react, she realizes the letter has already been sent through the mail system. What follows is a desperate race against time as Ellen struggles to retrieve the letter before it reaches the district attorney. Her frantic efforts are complicated by unhelpful strangers, bureaucratic delays, and her own rising sense of panic.\n\nUnlike typical noir films that unfold in smoky nightclubs and shadowy alleys, Cause for Alarm! heightens its suspense in the daylight of middle-class suburbia. The setting underscores the theme that paranoia and mistrust can corrode even the most seemingly peaceful environments.\n\nCast and Crew:\n• Director: Tay Garnett\n• Screenplay: Mel Dinelli and Tom Lewis, based on the story by Larry Marcus\n• Produced by: Nicholas Nayfack\n• Cinematography: Joseph Ruttenberg\n• Editing: George Boemler\n\nStarring:\n• Loretta Young as Ellen Jones\n• Barry Sullivan as George Z. Jones\n• Bruce Cowling as Dr. Grahame\n• Margalo Gillmore as Mrs. Edwards\n• Irving Bacon as Postman\n• Art Baker as Mr. Carston\n\nFilm Significance:\nCause for Alarm! stands out as a psychological noir that brings paranoia into the bright light of suburbia, subverting the expectations of its genre. Loretta Young delivers one of her strongest performances, portraying a woman caught in a nightmare of suspicion and miscommunication. The film is also significant for its portrayal of postwar anxieties, where veterans’ health issues, fragile marriages, and mistrust of authority figures reflected broader cultural tensions in early 1950s America. Though not a major box office success upon release, the film has since earned recognition among noir enthusiasts for its unusual setting, relentless pacing, and Loretta Young’s compelling performance.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Cause for Alarm! remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1951 release was in black and white, typical for mid-century suspense dramas. While visually authentic to its era, younger audiences often dismiss films in black and white as dated. By offering a colorized edition, we keep the story’s tension intact while making it more visually engaging for today’s viewers. This restored version ensures that the suspense, pacing, and emotional stakes of the film are preserved while appealing to a modern global audience.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#CauseForAlarm #LorettaYoung #BarrySullivan #FilmNoir #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #1950sThriller #FilmRestoration #PsychologicalDrama",
      "id": "rSEEOH9e-Jg",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yNanUBPrSW0",
      "title": "Cause for Alarm! (1951) LORETTA YOUNG",
      "description": "Stars: Loretta Young, Barry Sullivan, Bruce Cowling\nDirector: Tay Garnett\n\nA neurotic husband believes his luscious wife is having a steamy affair with the family physician and plots to frame her for his own murder!",
      "id": "yNanUBPrSW0",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4o061MKZ9m8",
      "title": "Cause for Alarm! (1951) Crime, Drama, Film-Noir",
      "description": "An invalid husband wrongly believes his wife and doctor are conspiring to kill him and outlines that suspicion in a letter, which causes a serious concern when he ends up dying anyway.\n\nDirector: Tay Garnett\nWriters: Mel Dinelli, Tom Lewis \nStars: Loretta Young, Barry Sullivan, Bruce Cowling\nGenres: Classics, Crime, Drama, Film-Noir, Thriller\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "4o061MKZ9m8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "74 min",
    "imdbRating": "6.4",
    "imdbVotes": "2,709",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Invalid George Jones is both physically and mentally ill. He mistakenly believes his wife Ellen and his doctor are having an affair and also planning to kill him. He writes a letter to the district attorney detailing their alleged murder plot. After he has Ellen give the letter to their postman, he reveals its contents to her and then threatens her with a gun. The excitement proves to much and George suffers a fatal collapse. Now Ellen must find a way to retrieve the incriminating letter.",
    "Director": "Tay Garnett",
    "Writer": "Mel Dinelli, Tom Lewis, Lawrence B. Marcus",
    "Actors": "Loretta Young, Barry Sullivan, Bruce Cowling",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0045932",
      "title": "Jeopardy",
      "year": 1953,
      "imdbRating": "6.7",
      "imdbVotes": "2,431",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044364",
      "title": "Another Man's Poison",
      "year": 1951,
      "imdbRating": "6.8",
      "imdbVotes": "3,699",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043435",
      "title": "Cry Danger",
      "year": 1951,
      "imdbRating": "7.3",
      "imdbVotes": "3,004",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043465",
      "title": "Detective Story",
      "year": 1951,
      "imdbRating": "7.5",
      "imdbVotes": "9,898",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043625",
      "title": "He Ran All the Way",
      "year": 1951,
      "imdbRating": "7.0",
      "imdbVotes": "3,252",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043646",
      "title": "Hollywood Story",
      "year": 1951,
      "imdbRating": "6.7",
      "imdbVotes": "1,060",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043660",
      "title": "The House on Telegraph Hill",
      "year": 1951,
      "imdbRating": "6.9",
      "imdbVotes": "4,025",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043320",
      "title": "The Basketball Fix",
      "year": 1951,
      "imdbRating": "5.4",
      "imdbVotes": "210",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043523",
      "title": "The Fat Man",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "586",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043655",
      "title": "The Hoodlum",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "1,236",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043066",
      "title": "Three Steps North",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "186",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044155",
      "title": "Two Dollar Bettor",
      "year": 1951,
      "imdbRating": "6.2",
      "imdbVotes": "225",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:54:20.351Z"
}