{
  "imdbId": "tt0034162",
  "title": "The Sea Wolf",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-sea-wolf-1941",
      "id": "the-sea-wolf-1941",
      "title": "The Sea Wolf (1941) Edward G. Robinson · Ida Lupino",
      "description": "A film adaptation of Jack London's adventurous novel about the misdeeds of the infamous Captain Wolf Larsen, who rescues shipwrecked sailors and then imprisons them on his cargo ship.   Well-acted, gripping, and technically masterfully directed.",
      "fileSize": 3968782825,
      "addedAt": "2026-01-07T00:12:22.158Z",
      "thumbnail": "https://archive.org/services/img/the-sea-wolf-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 317
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-sea-wolf-1941_202511",
      "id": "the-sea-wolf-1941_202511",
      "title": "The Sea Wolf (1941)",
      "description": "\"The Sea Wolf\" is a film adaptation of Jack London's novel of the same name. The story follows Wolf Larsen , a brutal captain of a seal-hunting ship named the Ghost , and his interactions with a group of individuals he takes aboard. The film begins with Humphrey van Weyden , who is shipwrecked and picked up by the Ghost . Once on board, he finds himself under the tyrannical rule of Captain Larsen, whose harsh leadership style and brutal philosophy of survival create a tense atmosphere. As Humphrey tries to understand and navigate his perilous situation, he clashes with Larsen's views on strength and morality.Molly and Dr. Mitchell also become instruments of conflict and resistance against Larsen's authoritarian rule. As they endure the challenges posed by Larsen’s leadership, they must come together, developing a sense of loyalty and camaraderie.The climax revolves around survival, the struggle for power, and the moral dilemmas faced by the characters. In the end, Humphrey and his companions seek to overthrow Larsen and escape the oppressive life aboard the ship.",
      "fileSize": 868485436,
      "addedAt": "2026-01-07T00:12:22.158Z",
      "thumbnail": "https://archive.org/services/img/the-sea-wolf-1941_202511",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 262
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "100 min",
    "imdbRating": 7.5,
    "imdbVotes": 4568,
    "Genre": "Adventure, Drama",
    "Plot": "1900. Each coming into the situation under different circumstances, George Leach, Ruth Brewster, both who are trying to evade capture by the authorities, and writer Humphrey Van Weyden, from a refined background, somewhat reluctantly are on their first of the latest sailing of the Ghost, a sealing schooner, out of its home port of San Francisco. The Ghost is skippered with an iron fist by \"Wolf\" Larsen, who will not tolerate any question of his authority, and whose cruelty has turned his crew into a hardened lot. In that cruelty, he will often turn his adversaries against each other to his own end of that total control. While all three would like to get off, George and Ruth someplace other than San Francisco, they are being held somewhat captive by Wolf both in not interacting with any other ships and not making land until its ultimate return to San Francisco. Humphrey can see and discovers that Wolf is a mass of contradictions as the Ghost's true nature, which has to do with Wolf's similarly seafaring brother, remains hidden from most. Meanwhile, George does whatever he can to get off board safely with Ruth, especially as they have fallen in love partly in their fugitive status, and even if it requires trying to organize a mutiny under the condition of not knowing who to trust. Through the machinations of each trying to achieve their goal, Wolf may display to who it matters the most his working under the ultimate creed of preferring to \"reign in hell than serve in heaven\".",
    "Director": "Michael Curtiz",
    "Writer": "Robert Rossen, Jack London",
    "Actors": "Edward G. Robinson, Ida Lupino, John Garfield",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 2 nominations total"
  },
  "relatedMovies": [
    "tt0033021",
    "tt0031953",
    "tt0034027",
    "tt0034056",
    "tt0034188",
    "tt0034405",
    "tt0033930",
    "tt0034337",
    "tt0035317",
    "tt0034428",
    "tt0034538",
    "tt0033297"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.158Z"
}