{
  "movieId": "tt0014469",
  "title": "The Silent Command",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-movie_20200626",
      "id": "my-movie_20200626",
      "title": "\"The Silent Command\" (1923) featuring Martha Mansfield, Bela Lugosi",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This film illustrates the contributions of  Martha Mansfield, a star of Silent Hall of Fame. \"The Silent Command\" (1923) is spy thriller taking place during the construction of the Panama Canal. Martha Mansfield played an excellent role in this film as the vamp, charged with seducing the navy officer.  She was a true rising star, only to die in a freak fire accident three months later. This is Martha Mansfield's last surviving role. Directed by                     J. Gordon Edwards Produced by                   Fox Film Corporation Written by                      Anthony Paul Kelly, Rufus King Starring                          Edmund Lowe, Martha Mansfield, Bela Lugosi, Carl Harbaugh, Betty Jewel, Byron Douglas, Warren Cook Cinematography            George W. Lane, Bennie Miggins Distributed by                Fox Film Corporation Release date                    August 19, 1923 Running time                 80 minutes Country                           United States Language                         Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 1580476425,
      "addedAt": "2026-01-07T00:09:54.333Z",
      "thumbnail": "https://archive.org/services/img/my-movie_20200626",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 12849
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6,
    "imdbVotes": 100,
    "Genre": "Drama",
    "Plot": "Benedict Hisston is a foreign agent, part of a conspiracy to destroy the Panama Canal and the US Navy's Atlantic Fleet. He attempts to acquire information about mine placement in the Canal Zone from Captain Richard Decatur but fails. That information is essential to the conspiracy's success and so he then hires vamp Peg Williams to obtain the intelligence through seduction. Decatur is not fooled and obeys the \"silent command\" of the Chief of Naval Intelligence to play along with the spies without revealing his purpose to friends or family. He is court-martialed, stripped of rank, and dismissed from the Navy after he strikes an admiral. His association with Williams estranges him from his wife but earns him the trust of Hisston and the other spies. When the conspirators are ready to enact their plan, he travels to Panama with them. He thwarts their attempt at sabotage, saving the canal and the fleet. He is then reinstated into the Navy, reunited with his wife, and honored by the nation for his heroism",
    "Director": "J. Gordon Edwards",
    "Writer": "Anthony Paul Kelly, Rufus King",
    "Actors": "Edmund Lowe, Bela Lugosi, Carl Harbaugh",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0007801",
    "tt0013841",
    "tt0014112",
    "tt0014440",
    "tt0014606",
    "tt0014249",
    "tt0161953",
    "tt0014463",
    "tt0014014",
    "tt0014142",
    "tt0014604",
    "tt0013917"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.333Z"
}