{
  "imdbId": "tt0013458",
  "title": "One Exciting Night",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MyMovie_201901",
      "title": "\"One Exciting Night\" (1922) director D. W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"One Exciting Night\" is a crime drama. Mystery reigns in a haunted house, where an innocent man is accused of murder. Directed by               D. W. Griffith Produced by             D. W. Griffith Scenario by                D.W. Griffith Starring                     Carol Dempster, Henry Hull, Porter Strong, Morgan Wallace, Charles Croker-King, Margaret Dale, Frank Sheridan, Irma Harrison Cinematography        Irving B. Ruby, Hendrik Sartov Distributed by           United Artists Release date               October 2, 1922 Running time             2 hour, 24 minutes Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "MyMovie_201901"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/excitingnight4k",
      "title": "One Exciting Night (1922) [Colorized, 4K, 60FPS]",
      "description": "One Exciting Night is a 1922 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com    Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io    A.I. Upscaling to 4K:  https://ffmpeg.org    GPU: Google Colab.  This movie is in public domain category and it is Copyright free.",
      "id": "excitingnight4k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FTxuvUAXNso",
      "title": "One Exciting Night (1922) | Colorized Public Domain Silent Mystery Thriller by D.W. Griffith",
      "description": "One Exciting Night (1922) is a silent mystery-thriller directed and produced by D.W. Griffith, one of early Hollywood’s most influential filmmakers. This restored and colorized public domain edition revives Griffith’s haunted-house suspense tale, which combines murder, comedy, and supernatural atmosphere. With its mix of intrigue, stormy set-pieces, and dramatic staging, the film reflects Griffith’s experimentation during the post–World War I silent era.\n\nPlot Summary:\nThe story begins with Agnes Harrington (Carol Dempster), who discovers after her wealthy uncle’s death that she is the rightful heir to a large fortune. However, her inheritance is contested by distant relatives, leading to rising tensions over money and family loyalty. As the heirs gather in a large country mansion on a stormy night, strange events unfold — including mysterious figures lurking in the shadows, unexpected murders, and hints of supernatural forces at play.\n\nRomance intertwines with suspense when Agnes finds herself drawn to John Fairfax (Henry Hull), a young man caught in the chaos of greed and suspicion. As the storm outside intensifies, the group is trapped in the house, where betrayal, fear, and violent confrontations mount. Griffith stages a dramatic climax with lightning, torrential rain, and heightened tension, pushing silent-era special effects to new levels of spectacle.\n\nCast and Crew:\n• Director: D.W. Griffith\n• Producer: D.W. Griffith\n• Story: D.W. Griffith\n• Cinematography: G.W. Bitzer (Griffith’s longtime collaborator)\n\nStarring:\n• Carol Dempster as Agnes Harrington\n• Henry Hull as John Fairfax\n• Porter Strong as Simeon Marlowe\n• Margaret Dale as Aunt Hetty\n• Morgan Wallace as Jasper Marlowe\n• Frank Sheridan as Judge Harrington\n• Charles Emmett Mack as Harry Harrington\n• Charles Hill Mailes as Detective\n\nFilm Significance:\nOne Exciting Night represents Griffith’s attempt to capitalize on the popularity of haunted-house mysteries of the early 1920s. While not considered his greatest work, the film is important historically as one of Griffith’s later productions, showing his ability to adapt to popular trends while still applying his mastery of suspense and large-scale effects.\n\nThe film is also notable for Carol Dempster’s leading role, as she was Griffith’s protégé and frequent star during this period. Its use of weather effects, dark shadows, and gothic mansion staging reflects a cinematic style that foreshadowed later Hollywood thrillers and horror films. Though critics at the time gave it mixed reviews, it remains a fascinating example of Griffith’s late silent career and an engaging piece of cinematic history.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like One Exciting Night remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1922 release was silent and black and white, presented with intertitles and atmospheric staging. While historically authentic, silent black-and-white thrillers often go unnoticed by modern audiences. By colorizing and restoring the film, we highlight its suspenseful atmosphere and dramatic storm effects, making it visually striking for today’s viewers while keeping its historic integrity intact.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including silent thrillers, lost gems, and influential works by major directors. Our work ensures these treasures remain preserved and accessible for audiences in the USA, Europe, and worldwide.\n\n#OneExcitingNight #DWGriffith #SilentFilm #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentThriller #FilmRestoration #ClassicMystery #GoldenAgeHollywood",
      "id": "FTxuvUAXNso",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-one-exciting-night",
      "title": "One Exciting Night",
      "id": "silent-one-exciting-night"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "128 min",
    "imdbRating": "5.3",
    "imdbVotes": "198",
    "Genre": "Comedy, Horror, Mystery",
    "Plot": "A young orphan girl, courted by an unpleasant older wealthy man who has a hold over her adoptive mother, falls in love with a young stranger at a party. Odd noises begin to be heard as a group of bootleggers clandestinely try to get away with their hidden loot. One of them is killed and the young man is suspected of being the killer.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Carol Dempster, Henry Hull, Porter Strong",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0012122",
      "title": "Dream Street",
      "year": 1921,
      "imdbRating": "5.5",
      "imdbVotes": "205",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016308",
      "title": "Sally of the Sawdust",
      "year": 1925,
      "imdbRating": "6.6",
      "imdbVotes": "598",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016123",
      "title": "The Monster",
      "year": 1925,
      "imdbRating": "6.2",
      "imdbVotes": "1,334",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026819",
      "title": "One Frightened Night",
      "year": 1935,
      "imdbRating": "6.0",
      "imdbVotes": "479",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037151",
      "title": "One Body Too Many",
      "year": 1944,
      "imdbRating": "5.4",
      "imdbVotes": "1,582",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025169",
      "title": "The Ghost Walks",
      "year": 1934,
      "imdbRating": "5.6",
      "imdbVotes": "663",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031143",
      "title": "The Cat and the Canary",
      "year": 1939,
      "imdbRating": "7.1",
      "imdbVotes": "3,911",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0057156",
      "title": "The Horror of It All",
      "year": 1964,
      "imdbRating": "4.8",
      "imdbVotes": "442",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017739",
      "title": "The Cat and the Canary",
      "year": 1927,
      "imdbRating": "7.1",
      "imdbVotes": "3,473",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0056285",
      "title": "No Place Like Homicide!",
      "year": 1961,
      "imdbRating": "6.3",
      "imdbVotes": "1,029",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013223",
      "title": "The Headless Horseman",
      "year": 1922,
      "imdbRating": "5.0",
      "imdbVotes": "320",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034850",
      "title": "The Hidden Hand",
      "year": 1942,
      "imdbRating": "6.1",
      "imdbVotes": "686",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:07.410Z"
}