{
  "movieId": "tt0025024",
  "title": "The Curtain Falls",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheCurtainFalls1934-10-02",
      "id": "TheCurtainFalls1934-10-02",
      "title": "The Curtain Falls",
      "description": "* Released: 1934-10-02 * Drama (Eng. US) * Chesterfield Motion Pictures Corp. * Made and released by Poverty Row Motion Picture Studio * Filmed at RKO Studios in Hollywood using RCA High Fidelity Sound System * PRODUCER: George R. Batcheller * DIRECTOR: Charles Lamont * WRITER: Karl Brown (Story & Screenplay) * CINEMATOGRAPHY: Milford Arthur Andersen * STARRING: Henrietta Crosman; Holmes Herbert; Natalie Moorhead; Dorothy Lee; John Darrow; John Darrow; William Bakewell; Jameson Thomas; Dorothy Revier; Eddie Kane; Aggie Herring; Tom Ricketts; Bryant Washburn * SYNOPSIS: Story of elderly actress (Sarah Crabtree - obvious amalgamation of the names of Victorian era stage stars Sarah Bernhardt and Lotta Crabtree). On brink of retirement, she travels to the estate of an older (more successful) friend she resembles, leading the family to believe she is their wealthy aunt. * SOURCE: 1) MrFilmschatten (I so much appreciate and thank you for yet again finding us a truly sparkling gem!) 2) IMDb * I own zero rights to this film reel and have uploaded it purely for Educational purposes. The disappearance of this film reel from society would be a loss to both present and future generations. Thank you for watching the movie and for telling your friends of this rare prize. Doreen (def gp ddh)",
      "fileSize": 475372522,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheCurtainFalls1934-10-02",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 2907
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "68 min",
    "imdbRating": 6,
    "imdbVotes": 43,
    "Genre": "Drama",
    "Plot": "Sarah Crabtree was once a star of the stage, but has fallen on hard times; the city has condemned and torn down her apartment building and she has nowhere to go. She writes to her wealthy, famous friend Lady Henrietta Scorsby to help, only to be notified that Henrietta--well known for her proclivity for travel to exotic locales--is missing in Africa's Gobi Desert. Devastated by the news, Sarah--who has a chronic heart condition--decides to end her days by impersonating the carefree, fun-loving Henrietta at the Long Island estate of Henrietta's nephew John, who has only seen her once, many years previously. She soon finds out that her friend's family is beset by a variety of problems, and she sets out to solve these problems before she dies. But it turns out that they might not be so easily solvable.",
    "Director": "Charles Lamont",
    "Writer": "Karl Brown",
    "Actors": "Henrietta Crosman, Dorothy Lee, William Bakewell",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027026",
    "tt0027863",
    "tt0027230",
    "tt0027121",
    "tt0026213",
    "tt0026412",
    "tt0027316",
    "tt0027406",
    "tt0027896",
    "tt0028186",
    "tt0027501",
    "tt0027348"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.273Z"
}