{
  "movieId": "tt0005992",
  "title": "The Ruse",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-ruse",
      "id": "silent-the-ruse",
      "title": "The Ruse",
      "fileSize": 427181205,
      "addedAt": "2026-01-07T00:11:24.923Z",
      "thumbnail": "https://archive.org/services/img/silent-the-ruse",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 325
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "28 min",
    "imdbRating": 6.2,
    "imdbVotes": 34,
    "Genre": "Western, Short",
    "Plot": "\"Bat\" Peters, reformed gun fighter, receives a letter from a Chicago firm to whom he has written in reference to selling his mine, stating that they think they will have no trouble in disposing of his property if he will come to Chicago, bringing samples of the ore. Peters arrives in Chicago and goes at once to the office of the firm where he interviews John Folsom, president of the company. He meets there May Dawson, Folsom's stenographer, and rents a room in May's home. Folsom and his confederates plan to put up a job on Peters and fleece him out of his mine. May, returning to the office one evening for her handbag, which she has forgotten, overhears the plan, but she is discovered by Folsom, who forcibly places her in an attic chamber under the care of an old hag. Peters completes his deal with Folsom, and that night he is shown the \"sights\" by one of Folsom's confederates. After visiting a dance hall, they ask him to sit in a game of poker and take him to the same house in which May is a prisoner. There they try to put up a crooked game, but Peters is too wise for them and, drawing his guns, tells them that they can't shove any six-card draw on him. Covering the gang with his gun, he backs out of the room and locks the door on the astonished gangsters. He rushes up the stairs to the attic landing, putting up a good fight. He suddenly hears May scream and recognizes her voice. He sets a barrel of straw on fire and yells \"Fire,\" which brings Folsom from May's room. Peters steps into the room and locks the door. It is battered in by the gangsters. The police, hearing the racket, come on and arrest the gangsters. Peters knocks Folsom out and all excepting Peters and May are taken away in the patrol wagon. Peters takes May home to her mother.",
    "Director": "William H. Clifford, William S. Hart",
    "Writer": "J.G. Hawks, Thomas H. Ince, A.R. Johnson",
    "Actors": "William S. Hart, Clara Williams, John Davidson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0192120",
    "tt0003943",
    "tt0004209",
    "tt0006780",
    "tt0006801",
    "tt0006913",
    "tt0006399",
    "tt1072650",
    "tt0003662",
    "tt0003578",
    "tt0233246",
    "tt0329121"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.923Z"
}