{
  "imdbId": "tt0037515",
  "title": "And Then There Were None",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/and-then-there-were-none-1945_202309",
      "id": "and-then-there-were-none-1945_202309",
      "title": "And Then There Were None (1945)",
      "description": "Ten strangers are summoned to a remote island and while they are waiting for the mysterious host to appear, a recording levels serious accusations at each of the guests. Soon they start being murdered, one by one. As the survivors try to keep their wits, they reach a disturbing conclusion: one of them must be the killer. Watch on RetroFlix:  https://retroflix.org/and-then-there-were-none-1945/",
      "fileSize": 1764323714,
      "addedAt": "2026-01-07T00:07:24.999Z",
      "thumbnail": "https://archive.org/services/img/and-then-there-were-none-1945_202309",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 2300
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/and.-then.-there.-were.-none.-1945",
      "id": "and.-then.-there.-were.-none.-1945",
      "title": "And Then There Were None (1945)",
      "description": "And Then There Were None is a 1945 film adaptation of Agatha Christie's 1939 mystery novel of the same name, directed by René Clair. In the film, ten strangers are invited to a remote island by a mysterious host, Mr. and Mrs. Owen, who do not appear. As they settle in, they are accused of past murders and begin to be killed off one by one, leading the survivors to realize that the killer is among them.",
      "fileSize": 1922791671,
      "addedAt": "2026-01-07T00:07:24.999Z",
      "thumbnail": "https://archive.org/services/img/and.-then.-there.-were.-none.-1945",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 382
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/attwn994545112",
      "id": "attwn994545112",
      "title": "And Then There Were None",
      "description": "Title: And Then There Were None Summary: Seven guests, a newly hired personal secretary and two staff are gathered on an isolated island by an absent host and someone begins killing them off one by one. They work together to determine who is the killer? Directed by: René Clair Actors: Directed by René Clair. With Barry Fitzgerald, Walter Huston, Louis Hayward Production Company: Rene Clair Productions Release Date: 31 October 1945 (USA) Aspect Ratio: 1.37 : 1 Seven guests, a newly hired personal secretary and two staff are gathered for a weekend on an isolated island by the hosts the Owens who are delayed. At dinner a record is played and the host's message alleges that all the people present are guilty of murder and suddenly the first of them is dead, then the next - It seems that one of them is the murderer but the leading person is always the person who is murdered next and at last only two people are left.",
      "fileSize": 1312791448,
      "addedAt": "2026-01-07T00:07:31.712Z",
      "thumbnail": "https://archive.org/services/img/attwn994545112",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 73184
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1t6kSQ562OQ",
      "id": "1t6kSQ562OQ",
      "title": "And Then There Were None (1945) AGATHA CHRISTIE",
      "description": "Movie Class by PizzaFLIX: Agatha Christie is the best-selling novelist of all time, with her books selling over 2 billion copies! Christie’s \"And Then There Were None“ has been adapted to film over a dozen times, but our 1945 version is widely considered the iconic one to watch.\n\nStars: Barry Fitzgerald, Walter Huston, Roland Young, and many more!\nDirector: Rene Clair\nIn Agatha Christie's classic mystery, ten people are invited to an isolated island. While they wait for their mysterious host to appear, the guests begin to be murdered. Could one of them be the killer? This version is an adaptation from Christie's successful stage play, not of her novel, Ten Little Indians, and the most glaring difference is what happens in the last few minutes.\nTRIVIA: Richard Haydn, who plays the Butler, also did the voice of the Caterpillar in Disney's \"Alice in Wonderland.\"",
      "addedAt": "2025-12-26T23:45:08.817Z",
      "thumbnail": "https://i.ytimg.com/vi/1t6kSQ562OQ/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBnAWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLARd7cJY0KuhlWX2w7WzxtLb8rc0A",
      "duration": 5820,
      "language": "en",
      "year": 1945,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "97 min",
    "imdbRating": 7.3,
    "imdbVotes": 18010,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "Seven guests, a newly hired personal secretary and two staff are gathered for a weekend on an isolated island by the hosts, the Owens, who are delayed. At dinner, a record is played and the host's message alleges that all of the people present are guilty of murder, and suddenly the first of them is dead, then the next. It seems that one of them is the murderer, but the leading person is always the person who is murdered next and at last, only two people are left.",
    "Director": "René Clair",
    "Writer": "Agatha Christie, Dudley Nichols",
    "Actors": "Barry Fitzgerald, Walter Huston, Louis Hayward",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0038494",
    "tt0036855",
    "tt0038452",
    "tt0037007",
    "tt0034251",
    "tt0039452",
    "tt0035694",
    "tt0035448",
    "tt0201074",
    "tt0040687",
    "tt0040799",
    "tt0038492"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.712Z"
}