{
  "imdbId": "tt0029462",
  "title": "Range Defenders",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RangeDefenders",
      "id": "RangeDefenders",
      "title": "Range Defenders",
      "description": "Range Defenders is a Three Mesquiteers Western that teams up Robert Livingston, Ray Corrigan and Max Terhune. When George Brooke (Thomas Carr) is framed for murder by town boss John Harvey (Harry Woods), it's up to his brother Stony (Robert Livingston) and his buddies to clear his name and bring Harvey and his henchmen to justice.",
      "fileSize": 1419873018,
      "addedAt": "2026-01-07T00:06:51.866Z",
      "thumbnail": "https://archive.org/services/img/RangeDefenders",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 23351
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=e_lB5JrLnHA",
      "id": "e_lB5JrLnHA",
      "title": "Range Defenders (1937) THE THREE MESQUITEERS",
      "description": "Stars: Robert Livingston, Ray Corrigan, Max Terhune \nDirector: Mack V. Wright\n\nStony's brother George has been accused of murder and the Mesquiteers have returned to prove his innocence. But they find that Harvey rules the town along with his stooge Sheriff Gray and that George won't get a fair trial.",
      "addedAt": "2025-12-26T23:51:55.860Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/e_lB5JrLnHA/maxresdefault.webp",
      "duration": 3058,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "56 min",
    "imdbRating": 5.7,
    "imdbVotes": 100,
    "Genre": "Drama, Western",
    "Plot": "George Brooke (Thomas Carr billed as Tommy Carr), the kid brother of Stony Brooke (Robert Livingston billed as Bob Livingston), has been framed on a murder charge and seeks help from the Three Mesquiteers...Stony, Tucson Smith (Ray Corrigan) and Lullaby Jospin (Max Terhune.) They hide him and head for town where they learn of a cattlemen-versus-sheepmen range war over grazing rights. John Harvey (Harry Woods), head of the Ashton Enterprises and suitor of Sylvia Ashton (Eleanor Stewart), is trying to put the cattle out of business as he and his gang controls the sheriff, \"Honest Dan\" Gray (Earle Hodgins) and runs the town. They learn that the Brooke family estate is being auctioned off to settle a dispute against George, who is also accused of murdering Sylvia's father. They prove the land is in Stony's name and stop the sale. Tucson, in an effort to clean up the town, runs for sheriff. While Tucson and Lullaby are out trying to roundup the cattlemen to vote in the election, Stony is caught trying to break George out of jail. Harvey and his legion of henchmen try to blow up the jail, but Tucson returns in time to stop them. Tucson wins the election, and Harvey is exposed as the actual killer of Sylvia's father, clearing the way for a romance between Stony and Sylvia.",
    "Director": "Mack V. Wright",
    "Writer": "Joseph F. Poland, William Colt MacDonald",
    "Actors": "Robert Livingston, Ray Corrigan, Max Terhune",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029486",
    "tt0029004",
    "tt0028732",
    "tt0028194",
    "tt0028510",
    "tt0027670",
    "tt0029962",
    "tt0029692",
    "tt0028971",
    "tt0033251",
    "tt0033181",
    "tt0032971"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.866Z"
}