{
  "movieId": "tt0062281",
  "title": "Smashing Time",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SmashingTime6754",
      "id": "SmashingTime6754",
      "title": "Smashing Time",
      "description": "Title: Smashing Time Summary: Two young women arrive in London to make it big in show business, and become corrupted by money and fame in the process. Directed by: Desmond Davis Actors: Rita Tushingham, Lynn Redgrave, Michael York Production Company: Partisan Productions Release Date: 26 February 1968 (Denmark) Aspect Ratio: 1.85 : 1 Two young women from England's northern counties; the plain Brenda and the flamboyant Yvonne, arrive in London to find fame and fortune. Misdirected and separated, they strike out on their own with Yvonne becoming a model and Brenda a waitress. After Brenda sabotages Yvonne's date whom takes advantage of her, they lose their jobs and soon the roles are reversed with Brenda succeeding as a model and Yvonne becoming a waitress. With both of them competing with the other, they soon learn that they have to team up to take on their adversaries in order to succeed.",
      "fileSize": 795709907,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/SmashingTime6754",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 3675
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "96 min",
    "imdbRating": 5.9,
    "imdbVotes": 629,
    "Genre": "Comedy, Musical",
    "Plot": "Two young women from Northern England, plain Brenda and flamboyant Yvonne, arrive in London to find fame and fortune. Misdirected and separated, they strike out on their own with Yvonne becoming a model and Brenda a waitress. After Brenda sabotages Yvonne's date--who then takes advantage of her--they lose their jobs, and soon the roles are reversed: Brenda succeeds as a model and Yvonne becomes a waitress. Competing with each other, they soon learn that they must team up to take on their adversaries in order to succeed.",
    "Director": "Desmond Davis",
    "Writer": "George Melly",
    "Actors": "Rita Tushingham, Lynn Redgrave, Michael York",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0061456",
    "tt0061631",
    "tt0062003",
    "tt0062532",
    "tt0062362",
    "tt0182029",
    "tt0060378",
    "tt0190426",
    "tt0183535",
    "tt0281819",
    "tt0178269",
    "tt0325200"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.869Z"
}