{
  "movieId": "tt0039582",
  "title": "Lost Honeymoon",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LostHoneymoon",
      "id": "LostHoneymoon",
      "title": "Lost Honeymoon",
      "description": "When an Englishwoman dies, leaving behind two children, her devoted friend (Ann Richards) decides to take the children to find the woman's husband (Franchot Tone), an American serviceman who had returned to the USA. But the father, now a successful architect, claims not to remember ever having gotten married or having any children.",
      "fileSize": 1796217666,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LostHoneymoon",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 77413
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lost-honeymoon-1947-classic-film-noir-comedy",
      "id": "lost-honeymoon-1947-classic-film-noir-comedy",
      "title": "Lost Honeymoon (1947 Classic, Film Noir, Comedy)",
      "description": "TAGLINES : It's Wild and Wacky...and Romantically Gay! (print ad - Lubbock Evening Journal, Palace Theatre, Lubbock, Texas Oct.7, 1947) STORYLINE :  When an Englishwoman dies, leaving behind two children, her devoted friend decides to take the children to find the woman's husband, an American serviceman who had returned to the USA. But the father, now a successful architect, claims not to remember ever having gotten married or having any children. _IMDb by Snow Leopard IMDb User Review : Worth Watching due to actors' performances (Aug. 3, 2019 by dickyadams): From a social point of view, the setup of this is quite interesting as it lightheartedly shows the post war problem of kids left behind by their forces dads returning to the USA. Some criticise it for being a ridiculous setup but the lead character is actually just trying to get a better life by taking advantage of the situation. How many people were desperate to escape ruined Britain at that time? Passport to Pimlico dealt with exactly the same problem but in a much superior way. This film's setup is a bit silly but then lots are. This is an average comedy in the end but it's played well by the actors and isn't a waste of time at all. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws. DEF gp ddh **",
      "fileSize": 229571636,
      "addedAt": "2026-01-07T00:09:38.893Z",
      "thumbnail": "https://archive.org/services/img/lost-honeymoon-1947-classic-film-noir-comedy",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 3316
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nc1JDznsK18",
      "id": "nc1JDznsK18",
      "title": "Lost Honeymoon (1947) FRANCHOT TONE🍕 FRANCES RAFFERTY",
      "description": "It's Friday @PizzaFLIX \nStars: Franchot Tone, Frances Rafferty, Tom Conway, Ann Richards\nDirector: Leigh Jason\n🍕POST-WAR ROMANTIC COMEDY🍕\nFranchot Tone is a dashing American architect on the brink of marrying a glamorous socialite—until a bombshell revelation threatens to blow up his engagement!  This post-war romantic comedy sparkles with standout performances from Aussie actress Ann Richards, the suave Tom Conway (older brother of George Sanders), and former YANK pin-up doll Frances Rafferty.\n\nDirected by Leigh Jason, Lost Honeymoon (1947) is a must-watch for fans of golden-age romantic comedies, featuring sparkling performances and classic post-war humor. Whether you love Franchot Tone movies, forgotten Hollywood gems, or heartwarming classic romance films, this delightful film is perfect for fans of old Hollywood, 1940s rom-coms, and screwball comedies.\n\nWatch now and rediscover a lost classic of 1940s cinema! Don’t forget to LIKE, COMMENT, and SUBSCRIBE for more classic movies and hidden gems!\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#FranchotTone #ClassicMovies #RomanticComedy #1940sFilms #TomConway #AnnRichards #FrancesRafferty #FullMovie #OldHollywood #ClassicCinema #PizzaFLIX",
      "addedAt": "2025-12-24T01:04:54.824Z",
      "thumbnail": "https://i.ytimg.com/vi/nc1JDznsK18/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAfvLgGJWs9mGEe_4QDtEb_GrUsXA",
      "duration": 4208,
      "language": "en",
      "year": 1947,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "71 min",
    "imdbRating": 5.5,
    "imdbVotes": 190,
    "Genre": "Comedy",
    "Plot": "After an Englishwoman dies, leaving behind two children, her devoted friend decides to take the children to find the woman's husband, an American serviceman who had returned to the USA. But the father, now a successful architect, claims not to remember ever having gotten married or having any children.",
    "Director": "Leigh Jason",
    "Writer": "Joseph Fields",
    "Actors": "Franchot Tone, Ann Richards, Tom Conway",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1918923",
    "tt0135175",
    "tt0040565",
    "tt0039645",
    "tt0039133",
    "tt0039219",
    "tt0039266",
    "tt0039370",
    "tt0039521",
    "tt0039522",
    "tt0039530",
    "tt0039566"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.893Z"
}