{
  "movieId": "tt0013486",
  "title": "Pay Day",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pay-day-1922-directed-by-charlie-chaplin",
      "id": "pay-day-1922-directed-by-charlie-chaplin",
      "title": "Pay Day (1922) Directed By Charlie Chaplin",
      "description": "Pay Day (1922) Theatrical release poster Directed by Charlie Chaplin Written by Charlie Chaplin Starring Charlie Chaplin Edna Purviance Mack Swain Syd Chaplin Cinematography Roland Totheroh Production company Charles Chaplin Productions Distributed by First National Pictures Release date April 2, 1922 Running time 28 min. Country United States Language Silent (English intertitles) Pay Day (1922) is an American short film made by First National Pictures. Charlie Chaplin wrote, directed, and starred in the film. It is Chaplin's final two-reel short film. Plot Chaplin plays a laborer on a house construction site. When he gets paid, his wife wants all the money, but he manages to keep enough of it to go out drinking. He returns home just in time to pretend he has just woken up to go to work. Cast Charlie Chaplin as Laborer Phyllis Allen as Laborer's Wife Mack Swain as Foreman Edna Purviance as Foreman's Daughter Syd Chaplin as Mustachioed Workman / Laborer's Friend / Lunch Cart Owner John Rand as Workman Loyal Underwood as Bearded Workman Henry Bergman as Fat Workman Al Ernest Garcia as Tall Workman Reception According to Chaplin biographer Jeffrey Vance, \" Pay Day , is a delightful, polished work that was Chaplin’s last two-reel comedy.\" He notes that Monta Bell, a future director and producer, was engaged as a general assistant and helped Chaplin develop the film's scenario on paper prior to production. This made it possible for Chaplin to make Pay Day in 31 production days (a sharp contrast to the five months required to complete his previous two-reel comedy, The Idle Class ). [ 1 ] References Vance, Jeffrey (2003), Chaplin: Genius of the Cinema New York : Harry N. Abrams, p. 125. ISBN 0-8109-4532-0",
      "fileSize": 151646370,
      "addedAt": "2026-01-07T00:10:12.697Z",
      "thumbnail": "https://archive.org/services/img/pay-day-1922-directed-by-charlie-chaplin",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 228
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "21 min",
    "imdbRating": 7.4,
    "imdbVotes": 4961,
    "Genre": "Comedy, Short",
    "Plot": "Charlie is an expert bricklayer. He has lots of fun and work and enjoys himself greatly while at the saloon. As he leaves work his wife takes the pay he has hidden in his hat. But he steals her purse so he can go out for the evening. He has a terrible time getting home on a very rainy night. When he does so he finds his wife waiting for him with a rolling pin.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Phyllis Allen, Mack Swain",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0004011",
    "tt0012304",
    "tt0005812",
    "tt0004546",
    "tt0004108",
    "tt0004102",
    "tt0003760",
    "tt0004007",
    "tt0004100",
    "tt0004499",
    "tt0010747",
    "tt0410477"
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.697Z"
}