{
  "imdbId": "tt0053611",
  "title": "Attack of the Giant Leeches",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AttackOfTheGiantLeeches",
      "title": "Attack of the Giant Leeches",
      "description": "After a local drunk shoots a monster in the swamp, people start disappearing... Find out more about this movie on it's IMDB page.",
      "id": "AttackOfTheGiantLeeches"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/attack-of-the-giant-leeches-1959",
      "title": "Attack Of The Giant Leeches",
      "description": "A backwoods game warden and a local doctor discover that giant leeches are responsible for disappearances and deaths in a local swamp, but the local police don't believe them. Watch on RetroFlix:  https://retroflix.org/attack-of-the-giant-leeches-1959/",
      "id": "attack-of-the-giant-leeches-1959"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/attack-of-the-giant-leeches-1959-horror-sci",
      "title": "Attack Of The Giant Leeches 1959 Horror Sci",
      "description": "A slimy chiller about a giant leech-infested swamp, where the leeches begin to prey on human flesh. A backwoods game warden and a local doctor discover that giant leeches are responsible for disappearances and deaths in a local swamp, but the local police don't believe them.",
      "id": "attack-of-the-giant-leeches-1959-horror-sci"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cco_attackofthegiantleeches",
      "title": "Cco Attackofthegiantleeches",
      "description": "Read about this movie on it's IMDb page Watch classic movies on line free at www.classiccinemaonline.com",
      "id": "cco_attackofthegiantleeches"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/leeches-4-k",
      "title": "Leeches 4 K",
      "id": "leeches-4-k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qnjUBKfz-yk",
      "title": "Attack Of The Giant Leeches (1959) [Science Fiction] [Horror]",
      "description": "\"Attack of the Giant Leeches\" is a low-budget 1959 Science Fiction film from American International Pictures. It was directed by Bernard L. Kowalski, produced by Gene Corman, and the screenplay was written by Leo Gordon. The film is in black and white, and runs for 62 minutes. It was one of a spate of monster movies produced during the 1950s in response to cold war fears; in the film a character speculates that the no-no leeches have been mutated to terrible giant size by atomic radiation from nearby Cape Canaveral.\nThis film was also called Attack of the Blood Leeches, Demons of the Swamp, The Demons of the Swamp, and War of the Giant Leeches.\n\nIn the Florida Everglades, a pair of larger-than-human, intelligent leeches are living in an underwater cave. They begin dragging local people down to their cave where they hold them prisoner and slowly drain them of blood. One of the first people to be so taken is the local vixen, Liz Walker, played by Yvette Vickers. After a couple of gratuitous displays of flesh (Yvette appeared as the centerfold in the July 1959 issue of Playboy), and some running around on her husband (Bruno VeSota), Liz finds herself a prisoner of the leeches along with her current paramour. Game warden Steve Benton (Ken Clark) sets out to investigate their disappearance. Aided by his girlfriend Nan Grayson (Jan Sheppard) and her father, Doc Grayson, he discovers the cavern. The monsters are finally destroyed when Steve, Doc, and some state troopers blow up the cavern with dynamite.\n\n---\n\nDirected by Bernard L. Kowalski, produced by Gene Corman and Roger Corman, written by  Leo Gordon, starring Ken Clark, Yvette Vickers and Jan Shepard.\n\n---\n\nSource: \"Attack of the Giant Leeches\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 12 June 2012. Web.16 July 2012. http://en.wikipedia.org/wiki/Attack_of_the_giant_leeches.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "qnjUBKfz-yk",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8fpK0nragfM",
      "title": "Attack of the Giant Leeches (1959) | Colorized Public Domain Sci-Fi Horror Classic Creature Feature",
      "description": "Attack of the Giant Leeches (1959) is an American science fiction horror film directed by Bernard L. Kowalski and produced by Gene Corman. Originally released in black and white during the golden era of 1950s drive-in cinema, this cult favorite has been restored and colorized to bring fresh life to its suspenseful swamp setting and terrifying creature effects. By reviving this film in full color, Colorized Public Domain ensures that modern audiences in the United States, Europe, and worldwide can experience one of the most iconic B-movies of its time in a visually engaging way.\n\nPlot Summary:\nSet in the eerie backwaters of the Florida Everglades, the story unfolds after mysterious disappearances plague the local swamp community. When bodies begin to vanish without explanation, locals whisper of a sinister presence lurking beneath the murky waters. Game warden Steve Benton (Ken Clark) takes on the investigation, determined to uncover the truth despite skepticism from townsfolk and corrupt local powers.\n\nThe culprit is revealed to be monstrous, bloodthirsty leeches mutated to enormous size — a grotesque byproduct of radiation and Cold War-era anxieties. As the creatures attack, victims are dragged into underwater caverns where they are slowly drained of blood. The tension escalates as Benton, with the help of Nan Greyson (Jan Shepard), must find a way to stop the abominations before the entire community falls prey to their parasitic hunger. The climactic battle in the swamp pits human ingenuity and courage against primal terror, leaving a lasting impression on the era’s creature-feature legacy.\n\nCast and Crew:\n• Director: Bernard L. Kowalski\n• Producer: Gene Corman\n• Screenplay: Leo Gordon\n• Cinematography: John M. Nickolaus Jr.\n• Editing: Carlo Lodato\n\nStarring:\n• Ken Clark as Steve Benton\n• Yvette Vickers as Liz Walker\n• Jan Shepard as Nan Greyson\n• Michael Emmet as Cal Moulton\n• Tyler McVey as Doc Greyson\n• Bruno VeSota as Dave Walker\n\nFilm Significance:\n“Attack of the Giant Leeches” is a quintessential 1950s sci-fi horror B-movie, reflecting postwar America’s obsession with radiation, environmental mutation, and hidden dangers lurking in everyday life. Produced by Gene Corman — brother of famed cult filmmaker Roger Corman — the film exemplifies low-budget but effective creature features that thrived in drive-in theaters across the United States. Despite its modest production, the movie became a staple in the public domain, ensuring its survival as a nostalgic touchstone for monster movie enthusiasts. Its status as a creature-feature classic makes it an important artifact of Cold War-era popular culture.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Attack of the Giant Leeches remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1959 release was in black and white, consistent with low-budget horror and sci-fi productions of the era. While authentic, this format often deters modern viewers accustomed to color presentation. By carefully colorizing the film, we make its swamp setting, creature design, and suspense sequences more immersive for today’s audiences. This edition bridges the gap between preserving cinematic history and engaging contemporary viewers, especially those in the USA and Europe who grew up with color horror classics.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#AttackOfTheGiantLeeches #1950sHorror #PublicDomainMovie #ColorizedClassic #SciFiHorror #CreatureFeature #ClassicCinema #FilmRestoration #BMovieClassic #1959Movie",
      "id": "8fpK0nragfM",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zztrGJHJRlI",
      "title": "Giant Leeches: The Terrifying Truth Exposed",
      "description": "https://publicdomainmovies.info/ Dive into the chilling world of \"Attack of the Giant Leeches,\" a 1959 classic that taps into Cold War-era anxieties with a sci-fi twist. Directed by Bernard L. Kowalski and produced by Gene Corman, this public domain gem is a must-watch for aficionados of classic movies and old films. Set against the backdrop of atomic age fears, the film explores a small-town mystery where colossal leeches emerge from the depths, suspected to be mutated by nearby Cape Canaveral's atomic radiation. As the townsfolk grapple with terror and disbelief, the narrative unfolds with suspenseful intrigue. Discover the historical significance of this black-and-white thriller and its place among 1950s monster movies. Subscribe to our newsletter for more insights on public domain movies and stay updated with the latest classic film features.\n\nCHAPTERS:\n00:00 - The Creature Learns\n27:19 - The Creature is Found\n29:10 - Reward for Finding the Bodies\n30:10 - Steve Refuses Explosives\n31:10 - Sam Peters Goes Missing\n37:40 - Steve Agrees to Use Explosives\n43:50 - Bodies Found in Underwater Cavern\n46:25 - Autopsy Results Revealed\n48:40 - Exploring the Ocean Floor\n50:50 - The Second Dive\n54:30 - The Creature is Revealed",
      "id": "zztrGJHJRlI",
      "channelName": "Public Domain Movies - Classic Old Movies",
      "channelId": "UCT6gOjzXtqeb_oE-wZVHlFA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AttackOfTheGiantLeeches1959",
      "title": "Attack of the Giant Leeches (1959)",
      "description": "Attack of the Giant Leeches is a low-budget horror movie from 1959. The story is set in the Florida everglades where the local storekeeper, Dave Walker, is married to a young sex-bomb named Liz, who just keeps on walking all over him. But poor old Dave is just a sucker for a pretty face and he just keeps on letting Liz do it. There are lots of suckers in this film though and most of them are attached to the giant leeches that have set up home in the swamp. You can find out more about Attack of the Giant Leeches at A Passion For Horror .",
      "id": "AttackOfTheGiantLeeches1959"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AttackOfTheGiantLeeches_201508",
      "title": "Attack Of The Giant Leeches",
      "description": "This film has fallen into the Public Domain.",
      "id": "AttackOfTheGiantLeeches_201508"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QnxKOY8Zt6s",
      "title": "Attack Of The Giant Leeches (1959) ROGER CORMAN",
      "description": "Movie Class by PizzaFLIX: Legendary cult filmmaker Roger Corman has directed\nover 50 films and produced nearly 400 more. In the process he helped launch the careers\nof Jack Nicholson, Robert De Niro, Charles Bronson, Sylvester Stallone, Francis Ford Coppola, Martin Scorsese, Ron Howard, Robert Towne, Peter Bogdanovich, and James Cameron!\n\nStars: Ken Clark, Yvette Vickers, Jan Shepard\nProducer: Roger Corman\n\nA backwoods game warden and a local doctor discover that giant leeches are responsible for disappearances and deaths in a local swamp, but the local police don't believe them.",
      "id": "QnxKOY8Zt6s",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xUwgHSFvMrY",
      "title": "Attack of the Giant Leeches (1959) Swamp Terror: Bloodthirsty Mutants on the Loose!  4K",
      "description": "In the Florida Everglades, giant intelligent leeches secretly kill locals, draining their blood in an underwater cave. Game warden Steve Benton investigates, ultimately destroying the creatures with dynamite.\n\nAlternative title: The Giant Leeches  (1959)\n\nFilm review by Tom Weaver https://youtu.be/m5lx16EoWgk\nColorized version: https://youtu.be/aOoaBM3U3mI\n\n\nDirector: Bernard L. Kowalski\nWriters: Leo Gordon, Gene Corman\nActors:  Ken Clark, Yvette Vickers, Jan Shepard \nGenres: Cult Film, Horror, Sci-Fi, Fantasy\n\nRelease date: October 1959 (USA)\nFilming location: Los Angeles, California, USA\nBudget: $70,000\n\nAvailable with original audio AND audio commentary 👉 Go to settings ⚙️ to change your audio options\n\n\n@CultCinemaClassics",
      "id": "xUwgHSFvMrY",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": "3.7",
    "imdbVotes": "5,018",
    "Genre": "Horror, Sci-Fi",
    "Plot": "In a community near a swamp, a local dweller sees a couple of giant monsters but nobody believes him. Later, the cuckold Dave Walker finds his slut wife Liz Walker cheating on him with his friend Cal Moulton. He chases the couple through the swamp, and forces them to jump into the water. The leeches take them and shocked Dave is arrested and accused of murder. Two other locals decide to look for the bodies of Liz and Cal to get the prize of US $50.00 per body, and also vanish in the swamp. Finally, game warden Steve Benton organizes a patrol to investigate the caves under the swamp, finding the lethal giant leeches.",
    "Director": "Bernard L. Kowalski",
    "Writer": "Leo Gordon",
    "Actors": "Ken Clark, Yvette Vickers, Jan Shepard",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0051993",
      "title": "Night of the Blood Beast",
      "year": 1958,
      "imdbRating": "3.6",
      "imdbVotes": "2,568",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053337",
      "title": "Teenagers from Outer Space",
      "year": 1959,
      "imdbRating": "3.9",
      "imdbVotes": "3,938",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052667",
      "title": "Caltiki, the Immortal Monster",
      "year": 1959,
      "imdbRating": "5.9",
      "imdbVotes": "1,743",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051064",
      "title": "Teenage Zombies",
      "year": 1959,
      "imdbRating": "2.9",
      "imdbVotes": "1,287",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052846",
      "title": "The Giant Gila Monster",
      "year": 1959,
      "imdbRating": "3.7",
      "imdbVotes": "4,520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051947",
      "title": "The Monster of Piedras Blancas",
      "year": 1959,
      "imdbRating": "5.3",
      "imdbVotes": "1,262",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054462",
      "title": "The Wasp Woman",
      "year": 1959,
      "imdbRating": "4.8",
      "imdbVotes": "5,840",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052969",
      "title": "The Killer Shrews",
      "year": 1959,
      "imdbRating": "4.1",
      "imdbVotes": "5,845",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053363",
      "title": "The Tingler",
      "year": 1959,
      "imdbRating": "6.6",
      "imdbVotes": "9,795",
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053095",
      "title": "The Head",
      "year": 1959,
      "imdbRating": "5.3",
      "imdbVotes": "838",
      "language": "German",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0054285",
      "title": "Atom Age Vampire",
      "year": 1960,
      "imdbRating": "3.9",
      "imdbVotes": "1,759",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050393",
      "title": "Fiend Without a Face",
      "year": 1958,
      "imdbRating": "6.1",
      "imdbVotes": "4,972",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [
    "blocked"
  ],
  "qualityNotes": "YouTube video blocked/unavailable",
  "lastUpdated": "2025-12-29T02:30:25.238Z"
}