{
  "imdbId": "tt0033317",
  "title": "Adventures of Captain Marvel",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/2_20240410_202404",
      "id": "2_20240410_202404",
      "title": "Adventures of Captain Marvel - Complete Serial: 12 Episodes (restored, colorized) (1941, Republic sci-fi serial)",
      "description": "Adventures of Captain Marvel is a 1941 American 12-chapter black-and-white movie serial from Republic Pictures , produced by Hiram S. Brown, Jr., directed by John English and William Witney , that stars Tom Tyler in the title role of Captain Marvel and Frank Coghlan, Jr. as his alter ego, Billy Batson. The serial was adapted from the popular Captain Marvel comic book character, then appearing in the Fawcett Comics publications Whiz Comics and Captain Marvel Adventures . The character is now owned by DC Comics and is known as Shazam. Adventures of Captain Marvel was the 21st of 66 film serials produced by Republic and their first comic book character adaptation (not counting comic strips ). The serial featured the Fawcett Comics superhero, placed within an original screen story. It is considered the first comic book superhero movie. Captain Marvel fights a masked criminal mastermind called the Scorpion, who is determined to gain control of an ancient weapon. It is made in the form of a large metallic scorpion with adjustable legs, tail, and removable lenses that must be properly aligned in order to activate its powerful ray.",
      "fileSize": 2026622911,
      "addedAt": "2026-01-07T00:06:06.565Z",
      "thumbnail": "https://archive.org/services/img/2_20240410_202404",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 805
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "216 min",
    "imdbRating": 7.2,
    "imdbVotes": 1572,
    "Genre": "Action, Adventure, Family",
    "Plot": "On a scientific expedition to Siam young Billy Batson is given the ability to change himself into the super-powered Captain Marvel by the wizard Shazam, who tells him his powers will last only as long as the Golden Scorpion idol is threatened. Finding the idol, the scientists realize it could be the most powerful weapon in the world and remove the lenses that energize it, distributing them among themselves so that no one would be able to use the idol by himself. Back in the US, Billy Batson, as Captain Marvel, wages a battle against an evil, hooded figure, the Scorpion, who hopes to accumulate all five lenses, thereby gaining control of the super-powerful weapon.",
    "Director": "John English, William Witney",
    "Writer": "Ronald Davidson, Norman S. Hall, Arch Heath",
    "Actors": "Tom Tyler, Frank Coghlan Jr., William 'Billy' Benedict",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0033776",
    "tt0032832",
    "tt0031207",
    "tt0032164",
    "tt0034928",
    "tt0032475",
    "tt0029818",
    "tt0033535",
    "tt0030832",
    "tt0030138",
    "tt0029081",
    "tt0036262"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.565Z"
}