{
  "imdbId": "tt0044762",
  "title": "Jack and the Beanstalk",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JackAndTheBeanstalk_483",
      "title": "Jack and the Beanstalk",
      "description": "This is the Edwin S Porter film version of the old story which was produced for the Edison production company in 1902",
      "id": "JackAndTheBeanstalk_483"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PublicDomainJackandtheBeanstalk",
      "title": "Jack and the Beanstalk",
      "description": "Abbot and Costello musical, based on the fairytale You can read more about this movie on it's IMDB page",
      "id": "PublicDomainJackandtheBeanstalk"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cco_jackandthebeanstalk",
      "title": "Jack and the Beanstalk",
      "description": "Abbott and Costello's musical version of the classic fairytale. More information can be found on this IMDB page .",
      "id": "cco_jackandthebeanstalk"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jack-and-the-beanstalk-1952",
      "title": "Jack and the Beanstalk (1952)",
      "description": "A young boy trades the family cow for magic beans. Ascending the beanstalk with the butcher who sold him the beans, he faces the giant terrorizing his village. Watch on RetroFlix:  https://retroflix.org/jack-and-the-beanstalk-1952/",
      "id": "jack-and-the-beanstalk-1952"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jack_and_the_beanstalk_ipod",
      "title": "Jack and the Beanstalk",
      "description": "Abbott and Costello's version of Jack and Beanstalk",
      "id": "jack_and_the_beanstalk_ipod"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jackandthebeanstalk1952_202001",
      "title": "Jack and the Beanstalk (1952)",
      "description": "Abbott & Costello's version of the famous fairy tale , about a young boy who trades the family cow for magic beans.",
      "id": "jackandthebeanstalk1952_202001"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GqoNVON_ono",
      "title": "Jack and the Beanstalk | FULL MOVIE | 2010 | Fantasy, Fairytale",
      "description": "Jack goes up the beanstalk to rescue a little girl who has been transformed into a harp.\n\nStarring Colin Ford, Chloe Grace Moretz, Christopher Lloyd, Gilbert Gottfried, William Brent, Wallace Shawn, Samantha Hanratty, James Earl Jones, Chevy Chase\nDirected by Gary J. Tunnicliffe\n2010\n\nMORE Popcornflix MOVIES, FREE on YouTube!\r\n\r\n Action: https://bit.ly/2XC8pvv\r\n Romance: https://bit.ly/2NVnIQ2\r\n Horror: https://bit.ly/2LeNNaK\r\n Crime: https://bit.ly/2NK201z\r\n Drama: https://bit.ly/2G6Uasy\r\n Comedy:  https://bit.ly/2LPCNQD\r\n Western: https://bit.ly/2S7FRc4\r\n Popcornflix Channel page: https://bit.ly/2Saak9p\r\n\r\nWatch more free movies and TV series at Popcornflix.com, or on the Popcornflix app available on Roku, Amazon FireTV, iOS, Android, Chromecast, and AppleTV.\r\n\r\n#Popcornflix, Full length free movies and TV series.\r\nLike us on Facebook: https://www.facebook.com/Popcornflix\r\nFollow us on Twitter: https://twitter.com/Popcornflixnews\r\nPopcornflix is owned/operated by Screen Media Ventures",
      "id": "GqoNVON_ono",
      "channelName": "Popcornflix",
      "channelId": "UCVFYikepF-avelvuIaQ_lHA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=d68bz9hm820",
      "title": "Jack and the Beanstalk (1952) ABBOTT & COSTELLO🍕NEW HD RESTORATION",
      "description": "🍕NEW HD RESTORATION🍕\nPizzaFLIX Presents CLASSIC MOVIE MONDAY\nDirector: Jean Yarbrough\nStars: Bud Abbott, Lou Costello, Buddy Baer, Shaye Cogan\n\nThe classic fairytale is reimagined with songs and laughs by comedy legends ABBOTT & COSTELLO.\n\n🍕TRIVIA: Jack and the Beanstalk emulates The Wizard of Oz (1939) by presenting its opening and closing sequences in sepia tone. Although not in Technicolor, the middle fantasy portion is produced in shimmering SuperCinecolor🍕\n \nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "id": "d68bz9hm820",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JackAndTheBeanstalk1902SilentFilm",
      "title": "Jack and the Beanstalk (1902 silent film)",
      "description": "From Edison films catalog: A grand spectacular performance in nine scenes and one tableau, illustrating the most popular fairy story ever written.... From this very simple and popular fairy tale we have produced a most pleasing, interesting and mirth producing play in motion pictures, introducing therein many surprising new tricks and dissolving effects. The subject was carefully studied, and every scene posed with a view to following as closely as possible the accepted version of JACK AND THE BEANSTALK. We have, for the purpose of producing comedy (which in reality is the life of any animated picture play), in some instances departed slightly from the story, in that we have burlesqued a few of the features; as, for instance, where the butcher trades the hatful of beans with Jack for his mother's cow, we have introduced a burlesque animal made up of two men covered over with the head, horns and hide of a cow. This animal goes through many ludicrous antics, such as kicking, jig dancing, sitting down with legs crossed, etc., and finally, after strenuous efforts on the part of the butcher, suffers herself to be led away. Scene 1 -- Trading the Cow. Jack's mother, being very poor, has dispatched him to the market to sell her only cow that they may not starve. The good fairy meets the village butcher at the bridge and informs him that Jack will pass that way with a cow which he can doubtless purchase for a hatful of beans, Jack being a very careless and foolish lad. The fairy vanishes, and Jack appears upon the scene leading the cow. The bargain is struck, and Jack runs away to show his mother what he considers a very gratifying price for their beautiful animal. Scene 2 -- Jack Returns with the Beans. Shows Jack's return to his mother's cottage, bringing the beans in his hat, and showing them to her in great glee, his mother's disappointment and scolding, which ends in Jack being sent supperless to bed, and the mother throwing the beans in the garden in great anger. Scene 3 -- Growing of the Beanstalk. A night scene in the garden, with beautiful moonlight and cloud effects. The good fairy appears, and waving her magic wand, commands the beanstalk to grow; and, lo and behold, from the hatful of beans that has been so ruthlessly thrown into the garden, a beanstalk of great size is seen to grow in a few moments, and to climb up the cliff above the clouds. Scene 4 -- Jack's Dream. Showing the interior of Jack's bedroom, with the moonlight streaming through the window. The good fairy appears and stands beside Jack's cot directing his dream. Jack dreams of the growing beanstalk and the award that awaits him who dares to climb it. Next he sees a vision of the Horn of Plenty, bags of the giant's gold and the talking harp, which dances before him in a weird manner. One by one these articles appear and disappear in the picture, coming as if from the dim distance, and as quickly and silently fading away. The climax of this scene is reached when the hen which lays the golden eggs walks into Jack's chamber. An egg is left on the floor, which suddenly grows to an enormous size, breaks in two, and there appears in its centre Jack's little fairy, who is afterward to make him happy for life. Scene 5 -- Climbing the Beanstalk. Jack awakens in the early morning, and looking out from his window, finds the enormous beanstalk which has grown above the clouds. Remembering his dream of the night before, he believes he can climb it with ease; but also remembering his mother's scolding for trading the cow for the beans, he is prompted to be cautious, and concludes to consult his mother. She protests vigorously against his climbing the beanstalk, but Jack sending her into the house on a pretext, starts up the beanstalk without her knowledge. The mother returns and is frantic when she finds Jack has gone up beyond her reach. She scolds and commands him to return, but the dauntless boy only laughs and continues to climb. His playmates, who are calling for Jack on their way to school, witness Jack's start on his perilous journey, and joining hands, they dance about the beanstalk in great numbers, cheering and waving their hats at the brave boy. [end of part 1] Scene 6 -- Jack Above the Clouds. Here we dissolve the view and show Jack two- thirds up the beanstalk, far above the clouds, with his mother's cottage and the hilltops a great distance below him. He is still tirelessly climbing his ladder of bean vines, and pauses as he reaches a dizzy height to wave his hat to his playmates and mother. Scene 7 -- Arrival at the Top of the Beanstalk. Jack arrives at the top of the beanstalk in what appears to be a fairyland. He is very tired and sleepy and lays down in a bed of moss to rest. He soon falls asleep, and his good fairy again appears and tells Jack the story of the giant, who, many years ago, killed and robbed his father (who was a knight residing in a castle), and drove his mother from their home. She then causes a vision of the giant's castle to appear before Jack, and commands him to go to the giant's house where great fortunes await him. Jack's enthusiasm is fired by the story of his father's wrongs, and he immediately sets out to obey the commands of the fairy. Scene 8 --The Giant's Kitchen. Shows Jack's arrival at the giant's house, and being admitted to the kitchen by the giant's wife. The giant suddenly enters, and in great fear lest he kill and eat the little boy, the good wife hides Jack in a large kettle. The giant comes in and roughly demands his supper, then his harp, bags of gold and the hen which lays the golden eggs. He finally falls asleep from the playing of the harp. Jack creeps from his hiding place in the kettle and steals the hen and as many of the bags of gold as he can carry away. Just as he leaves the kitchen door the giant awakens, and, seizing his great cudgel, chases our little hero, who is now thoroughly frightened. [end of part 2] Scene 9 -- Jack Descending the Beanstalk and Death of the Giant. The chase to the beanstalk has been very close, but Jack reaches it a little ahead of the giant. He throws the bags of gold down into his mother's garden and quickly scrambles down with the precious hen hanging over his shoulder. Reaching the ground first, he hastily commands his mother to bring him the ax, and vigorously chops at the beanstalk until it falls in a heap, bringing the giant to the ground with a mighty crash, breaking his neck and instantly killing him. Here the good fairy again appears and informs Jack that he has acted like a brave knight's son and that he deserves to have his inheritance restored to him. She waves her magic wand, and, lo! Jack's costume is changed from that of a peasant boy to a young knight, and his mother is likewise transformed from a peasant woman to a lady. Closing Tableau. A most beautiful scene, showing Jack and his mother seated in the fairy's boat, which is drawn by three beautiful swans, proceeding on their way to the castle which is to be their future home. The good fairy is seen to be flying through the air, guiding Jack and his mother on their way. In introducing this novel tableau, giving as it were an entirely new version to the ending of the story, we believe we are adding a feature which will be most pleasing to every child who witnesses the performance.... Note -- In this beautiful production, in changing from one scene to the other, transformations are made by beautiful dissolving and fading effects. There are no sudden jumps whatever, and the entire effect is at once pleasing, gratifying and comprehensive, and the audience finds itself following with ease the thread of this most wonderful of all fairy tales.... Sold in complete length only.",
      "id": "JackAndTheBeanstalk1902SilentFilm"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/JackAndTheBeanstalk1902_514",
      "title": "Jack and the Beanstalk 1902",
      "description": "This one is a really old film. I remember that my grandfather had a copy of it, but it was lost years ago. He had some very sharp words about this \"God\" Edison.",
      "id": "JackAndTheBeanstalk1902_514"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "78 min",
    "imdbRating": "5.8",
    "imdbVotes": "3,741",
    "Genre": "Comedy, Family, Fantasy",
    "Plot": "Abbott &amp; Costello's version of the famous fairy tale, about a young boy who trades the family cow for magic beans.",
    "Director": "Jean Yarbrough",
    "Writer": "Nathaniel Curtis, Pat Costello",
    "Actors": "Bud Abbott, Lou Costello, Buddy Baer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0040068",
      "title": "Abbott and Costello Meet Frankenstein",
      "year": 1948,
      "imdbRating": "7.3",
      "imdbVotes": "20,804",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043255",
      "title": "Bud Abbott and Lou Costello Meet the Invisible Man",
      "year": 1951,
      "imdbRating": "6.6",
      "imdbVotes": "6,470",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043562",
      "title": "Francis Goes to the Races",
      "year": 1951,
      "imdbRating": "6.4",
      "imdbVotes": "580",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046995",
      "title": "Francis Joins the WACS",
      "year": 1954,
      "imdbRating": "6.2",
      "imdbVotes": "502",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037771",
      "title": "Here Come the Co-eds",
      "year": 1945,
      "imdbRating": "6.6",
      "imdbVotes": "1,509",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049229",
      "title": "Francis in the Haunted House",
      "year": 1956,
      "imdbRating": "5.6",
      "imdbVotes": "445",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0036696",
      "title": "The Canterville Ghost",
      "year": 1944,
      "imdbRating": "6.9",
      "imdbVotes": "3,442",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0044414",
      "title": "The Curious Adventures of Mr. Wonderbird",
      "year": 1952,
      "imdbRating": "7.2",
      "imdbVotes": "286",
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029201",
      "title": "The Man Who Could Work Miracles",
      "year": 1936,
      "imdbRating": "6.9",
      "imdbVotes": "1,563",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045094",
      "title": "Road to Bali",
      "year": 1952,
      "imdbRating": "6.4",
      "imdbVotes": "5,358",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044355",
      "title": "Androcles and the Lion",
      "year": 1952,
      "imdbRating": "6.0",
      "imdbVotes": "1,095",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024852",
      "title": "March of the Wooden Soldiers",
      "year": 1934,
      "imdbRating": "7.1",
      "imdbVotes": "7,666",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T18:10:21.646Z"
}