{
  "movieId": "tt0071858",
  "title": "Moscow, My Love",
  "year": 1974,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vPKtS7FsXLk",
      "id": "vPKtS7FsXLk",
      "title": "Moscow, My Love (1974, dir. Alexander Mitta) – A Forgotten Soviet-Japanese Romance 💖",
      "description": "🎬 Moscow, My Love (1974) – A Heartbreaking Soviet-Japanese Romance | Full Film \n\n🌟 Why You MUST Watch This Forgotten Masterpiece:  \n\nExperience a rare and emotional blend of Soviet and Japanese storytelling in Moscow, My Love (1974), directed by Alexander Mitta. This visually stunning film tells the poignant story of Yuriko, a gifted young Japanese ballerina invited to study at the prestigious Bolshoi Theatre in Moscow. As she masters her craft, she discovers not only professional success but also true love—only for fate to intervene in the most tragic way.  \n\n💔 A Story of Love, Art, and Tragedy:\nYuriko’s journey is one of passion and perseverance. She thrives in the demanding world of ballet, wins the admiration of her peers, and falls deeply in love. But her happiness is shattered when she is diagnosed with leukemia—a cruel legacy of the Hiroshima bombing, where her mother was exposed to radiation. The film masterfully intertwines personal drama with historical trauma, creating a deeply moving narrative that stays with you long after the credits roll.  \n\n🎥 Why This Film Is Special:\n- Unique Cultural Fusion: A rare Soviet-Japanese co-production, blending delicate emotional storytelling with striking cinematography.  \n- Powerful Performances: Komaki Kurihara delivers a breathtaking performance as Yuriko, capturing both her artistic brilliance and heartbreaking vulnerability.  \n- Historical Depth: A subtle yet profound reflection on the lingering scars of war, making it more than just a romance—it’s a humanitarian statement.  \n- Timeless Themes: Love, sacrifice, and the fleeting nature of life—universal emotions that resonate across generations.  \n\n🔥 Don’t Miss This Hidden Gem!  \nIf you love classic cinema, ballet, or deeply emotional dramas, Moscow, My Love is a must-watch. It’s a film that balances beauty and sorrow, leaving viewers with a lasting impression. Will Yuriko’s love and artistry conquer fate? Press play and find out!  \n\n📌 Like, comment, and subscribe for more rare cinematic treasures!\n\nGenres: melodrama\nRelease date: 1974\nDirectors: Mitta Alexander\nScreenwriters: Mitta Alexander, Kasikura Tashiyuki, Radzinsky Edward\nComposers: Tchaikovsky Boris\nOperators: Nakhabtsev, Vladimir\nProduction designers: Kladiyenko, Yuri\n\n00:00:00 start\n00:00:08 begin",
      "addedAt": "2025-12-23T03:43:48.920Z",
      "thumbnail": "https://i.ytimg.com/vi/vPKtS7FsXLk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBof65tiNE66vxsBwpPKdz1WTjMCA",
      "duration": 5375,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 6.6,
    "imdbVotes": 148,
    "Genre": "Drama, Romance",
    "Plot": "A young Japanese ballet dancer comes to Moscow to study at the Bolshoy Theater, works hard, gets a titular role in Gisele and falls in love with the local sculptor. Then she gets a news that will change evrything...",
    "Director": "Aleksandr Mitta, Kenji Yoshida",
    "Writer": "Tasiuki Kasikura, Aleksandr Mitta, Edvard Radzinsky",
    "Actors": "Komaki Kurihara, Oleg Vidov, Makoto Satô",
    "Language": "Russian, Japanese",
    "Country": "Soviet Union, Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0071481",
    "tt0072417",
    "tt0071566",
    "tt0329368",
    "tt0071842",
    "tt0071141",
    "tt0070107",
    "tt0072613",
    "tt0071093",
    "tt0075119",
    "tt0074102",
    "tt7249538"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:27:22.755Z"
}