{
  "movieId": "tt0005246",
  "title": "Enoch Arden",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/EnochArden_94",
      "id": "EnochArden_94",
      "title": "Enoch Arden",
      "description": "Enoch Arden was made by D W Griffith in 1911. It is a 2 reeler based on a poem by Alfred Lord Tennyson. According to Wikipedia there was another production of this one made in 1915 which Griffith wrote and in which he played Philip Ray. Anyone have that one?",
      "fileSize": 771963047,
      "addedAt": "2026-01-07T00:06:19.370Z",
      "thumbnail": "https://archive.org/services/img/EnochArden_94",
      "collection": "feature_films",
      "downloads": 7144
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-enoch-arden",
      "id": "silent-enoch-arden",
      "title": "Enoch Arden",
      "fileSize": 476400937,
      "addedAt": "2026-01-07T00:10:59.117Z",
      "thumbnail": "https://archive.org/services/img/silent-enoch-arden",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 303
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "40 min",
    "imdbRating": 6.3,
    "imdbVotes": 127,
    "Genre": "Short, Drama",
    "Plot": "A hundred years ago in a little seaside village, lived and played three children, Philip Ray, Annie Lee and Enoch Arden, the latter an orphan. They grew up together and both boys fell in love with Annie Lee. She chose Enoch Arden. Philip, however, remained their friend. Years passed. The son and daughter of Enoch Arden and Annie Lee grew to be seven years of age. One day Enoch was hurt and found it to advantage to sail on a long voyage, the only work he could find to support his family. For ten years Annie and the children waited for his return. Philip cared for her and her children, sent the latter to school and urged Annie to marry him. since Arden apparently was dead and would never come back. She finally consented and they were married. On an island far away, Enoch Arden was alive, having been wrecked and was finally, after some years, picked up by a passing boat and sent home. Arriving there he discovers how good Philip had been to his children and how finally he had married Annie and took care of her. Without disclosing himself to either of them, he goes away, first telling his story to an old woman of the village. At the close of the day he dies on the seashore.",
    "Director": "Christy Cabanne",
    "Writer": "D.W. Griffith, Alfred Lord Tennyson",
    "Actors": "Alfred Paget, Lillian Gish, Wallace Reid",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005719",
    "tt0004235",
    "tt0003170",
    "tt0003436",
    "tt0003803",
    "tt0005414",
    "tt0231300",
    "tt0482779",
    "tt0005622",
    "tt1262050",
    "tt0228815",
    "tt0005047"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.117Z"
}