{
  "imdbId": "tt0037761",
  "title": "Hangover Square",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1945-hangover-square-concierto-macabro-john-brahm-vose",
      "id": "1945-hangover-square-concierto-macabro-john-brahm-vose",
      "title": "1945 - Hangover Square - Concierto macabro - John Brahm",
      "description": "For Academic / Educational Use Only.",
      "fileSize": 1590712926,
      "addedAt": "2026-01-07T00:06:03.998Z",
      "thumbnail": "https://archive.org/services/img/1945-hangover-square-concierto-macabro-john-brahm-vose",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 1585
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hangover-square-1945",
      "id": "hangover-square-1945",
      "title": "Hangover Square (1945) Laird Cregar, Linda Darnell, George Sanders",
      "description": "Hangover Square is a 1945 FILM NOlR directed by John Brahm, based on the 1941 novel Hangover Square by Patrick Hamilton. The film stars Laird Cregar, Linda Darnell and George Sanders.    The screenplay was written by Barré Lyndon who made a number of changes to the novel, including the change of George Harvey Bone into a classical composer-pianist and filming the story as an early 20th-century period piece. Cinematography is by Joseph LaShelle .   The movie was released in New York City on February 7, 1945, two months after its star, Laird Cregar, suffered a fatal heart attack.   You can find out more about this movie from Wikipedia and read an article from FILM NOlR of the Week .",
      "fileSize": 2476376976,
      "addedAt": "2026-01-07T00:08:39.344Z",
      "thumbnail": "https://archive.org/services/img/hangover-square-1945",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 3673
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": 7.4,
    "imdbVotes": 4226,
    "Genre": "Crime, Drama, Horror",
    "Plot": "George Harvey Bone is a composer in early 20th century London, who is under stress because he is writing a piano concerto. Due to this stress, he gets black outs when ever he hears dissonances. When he finds himself after the black out in a different quarter of the town, he returns home, to read in the paper that somebody in that quarter was murdered. Asking help from a doctor at Scotland Yard he is assured that he has nothing to do with it, but he is advised to cut back in his work and get some relaxation like other, ordinary people. At a cheap musical he meets Netta, a singer, who inspires him for a new motive for his concerto. But Netta discovers that this motive could also be used as a song for her. The song gets sold, and she hangs around George to get more songs out of him. George believes that Netta is in love with him, and gets in an argument with his girlfriend Barbara, the daughter of Lord Henry, who wants the concerto for one of his soirées. George has another black out, and after recovering he hears that Barbara was almost strangled to death. He starts working again on the concerto. On London's special holiday he learns that Netta, who offered him quite a lot for a new song, is going to marry theatrical producer Carstair, and he causes some violins to fall in his room, and this sound drives him to another black out...",
    "Director": "John Brahm",
    "Writer": "Barré Lyndon, Patrick Hamilton, Marian Spitzer",
    "Actors": "Laird Cregar, Linda Darnell, George Sanders",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037024",
    "tt0039217",
    "tt0038259",
    "tt0037441",
    "tt0037325",
    "tt0037168",
    "tt0035753",
    "tt0047872",
    "tt0031863",
    "tt0047200",
    "tt0033760",
    "tt0035740"
  ],
  "collections": [
    {
      "id": "horror",
      "name": "Horror"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.344Z"
}