{
  "movieId": "tt0048811",
  "title": "Women's Prison",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/womens-prison-1955",
      "id": "womens-prison-1955",
      "title": "Women's Prison (1955) Ida Lupino, Jan Sterling, Cleo Moore, Audrey Totter, Phyllis Thaxter, Howard Duff",
      "description": "Women's Prison is a 1955 American FILM NOlR (ish) crime film directed by Lewis Seiler and starring Ida Lupino, Jan Sterling, Cleo Moore, Audrey Totter, Phyllis Thaxter and Howard Duff.   You can find out more about this movie from Wikipedia .  ",
      "fileSize": 723387356,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/womens-prison-1955",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 7809
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": 6.5,
    "imdbVotes": 1187,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "During the 1950s, two women inmates are sent to a maximum security state prison. One of the two women is a repeat offender who knows many of the inmates and guards at the prison. She almost feels like returning home to her prison family. The other woman is a decent person, a first-time offender who's no criminal.She unintentionally killed a child in a car accident. She's very young, married, and is terrified of being in prison. Her mental state is very fragile. The women's prison is adjacent to the men's prison. The two prisons are separated by a high wall but there are secret ways of crossing from one prison into the other. Warden Brock is in charge of the men's prison while Amelia van Zandt is the heartless brutal director of the women's prison. The guards are severe and not very friendly, since, they too, fear the wrath of their female warden van Zandt. The only ray of hope and decency in this earthly inferno is the prison doctor, Dr. Crane. However, the good doctor has little power or say in the daily running of the prison.He tries as much as possible to protect his patients, the most vulnerable of all inmates. In this human hell, the two new arrivals, housewife Helene Jensen and forger Brenda Martin, must survive. Prison newbie Helene Jensen decides to stick close to veteran jail-bird Brenda Martin in order to learn the ropes of prison life but this might just not be enough to ensure Helene's survival.",
    "Director": "Lewis Seiler",
    "Writer": "Crane Wilbur, Jack DeWitt",
    "Actors": "Ida Lupino, Jan Sterling, Cleo Moore",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0049587",
    "tt0048064",
    "tt0047880",
    "tt0031259",
    "tt0047370",
    "tt0046743",
    "tt0047102",
    "tt0047317",
    "tt0050512",
    "tt0047878",
    "tt0047934",
    "tt0047958"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}