{
  "imdbId": "tt0023909",
  "title": "Corruption",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/corruption",
      "title": "Corruption",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 3755793439,
      "id": "corruption"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mLq0Y7yFf2Q",
      "title": "Corruption (1933) | Colorized Public Domain Crime Drama with Preston Foster and Evalyn Knapp",
      "description": "Corruption (1933) is an American pre-Code crime drama directed by Charles E. Roberts and released by Columbia Pictures. This restored and colorized public domain classic offers a hard-hitting look at political corruption, organized crime, and the moral compromises of those who seek justice. With a gripping performance from Preston Foster, the film captures the grittiness of Depression-era America while exploring themes of integrity, ambition, and betrayal. By reviving this little-known gem in vivid color, Colorized Public Domain ensures that modern audiences in the United States, Europe, and beyond can rediscover an authentic slice of 1930s cinema.\n\nPlot Summary:\nThe story follows Tim Butler (Preston Foster), a principled lawyer who unexpectedly rises to the office of mayor after exposing corruption in his city. Initially celebrated as a reformer and a man of the people, Tim’s moral resolve is tested when he becomes entangled with political bosses and criminal underworld figures who seek to exploit his office.\n\nComplications intensify with the presence of Helen (Evalyn Knapp), a woman who both admires his convictions and fears the personal cost of his crusade against corruption. As Tim pushes forward with his reformist agenda, he is betrayed by those closest to him and framed in a scandal designed to destroy his credibility. The film culminates in a tense showdown between truth and power, as Tim must choose between compromise and sacrifice in order to reclaim both his honor and his city’s future.\n\nCast and Crew:\n• Director: Charles E. Roberts\n• Producer: Columbia Pictures\n• Cinematography: John Stumar\n• Editing: Otto Meyer\n\nStarring:\n• Preston Foster as Tim Butler\n• Evalyn Knapp as Helen\n• Charles Delaney as Buddy\n• Warner Richmond as Regan\n• Tully Marshall as Old Politician\n• Natalie Moorhead as Claire\n• Mischa Auer as Henchman\n\nFilm Significance:\nCorruption is emblematic of the pre-Code Hollywood era, when filmmakers explored controversial themes such as crime, politics, and moral ambiguity with fewer restrictions than would later be imposed under the Hays Code. The film’s narrative of political ambition colliding with systemic vice resonates with audiences both as entertainment and as a reflection of America’s anxieties during the Great Depression. Preston Foster’s performance anchors the film, while Evalyn Knapp, a familiar face in early 1930s cinema, adds depth to the human stakes of the story.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Corruption remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1933 release was in black and white, as was standard in early sound-era Hollywood. While historically authentic, many modern viewers skip over monochrome films. By colorizing and restoring Corruption, we connect the fast-paced energy of 1930s crime dramas to today’s audiences in the United States and Europe, making the story’s themes of justice and betrayal more visually dynamic and accessible.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including forgotten pre-Code dramas, mysteries, comedies, and culturally significant stories. Our mission is to keep these treasures discoverable, engaging, and preserved for viewers worldwide.\n\n#Corruption1933 #PrestonFoster #EvalynKnapp #PublicDomainMovie #ColorizedClassic #PreCodeHollywood #CrimeDrama #GoldenAgeHollywood #FilmRestoration #1933Movies #ClassicCinema",
      "id": "mLq0Y7yFf2Q",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IvB5dg_GMxE",
      "title": "Corruption (1933) PRE-CODE HOLLYWOOD",
      "description": "Stars: Evalyn Knapp, Preston Foster, Charles Delaney \n Director/Writer: Charles E. Roberts\n\n A young lawyer is elected mayor of the city and promises to rid it of the corruption it's famous for. The problem is that most of the corruption he's vowed to eliminate is caused by the crooked political machine that helped elect him.",
      "id": "IvB5dg_GMxE",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "67 min",
    "imdbRating": 5.7,
    "imdbVotes": 179,
    "Genre": "Action, Adventure, Crime",
    "Plot": "A crusading young politician is running for mayor on a program of cleaning up the graft-ridden politics of a big city. However, all of his opponent are mysteriously being shot to death, which does him no good, and the coroner can't even find the bullets in the bodies of the dead men.",
    "Director": "Charles E. Roberts",
    "Writer": "Charles E. Roberts",
    "Actors": "Evalyn Knapp, Preston Foster, Charles Delaney",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0024119",
      "title": "High Gear",
      "year": 1933,
      "imdbRating": 5.3,
      "imdbVotes": 121,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0214714",
      "title": "Get That Girl",
      "year": 1932,
      "imdbRating": 4.7,
      "imdbVotes": 128,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025309",
      "title": "Inside Information",
      "year": 1934,
      "imdbRating": 5.4,
      "imdbVotes": 70,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026772",
      "title": "The New Adventures of Tarzan",
      "year": 1935,
      "imdbRating": 5.3,
      "imdbVotes": 450,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021792",
      "title": "Defenders of the Law",
      "year": 1931,
      "imdbRating": 4.8,
      "imdbVotes": 47,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026756",
      "title": "The Mystery Man",
      "year": 1935,
      "imdbRating": 5.5,
      "imdbVotes": 264,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027201",
      "title": "What Price Crime",
      "year": 1935,
      "imdbRating": 5.3,
      "imdbVotes": 130,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026724",
      "title": "Mister Dynamite",
      "year": 1935,
      "imdbRating": 5.8,
      "imdbVotes": 82,
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0183796",
      "title": "Social Error",
      "year": 1935,
      "imdbRating": 4.3,
      "imdbVotes": 52,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0025644",
      "title": "Perils of Pauline",
      "year": 1933,
      "imdbRating": 6.2,
      "imdbVotes": 152,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0028241",
      "title": "Shadow of Chinatown",
      "year": 1936,
      "imdbRating": 4.5,
      "imdbVotes": 303,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027420",
      "title": "Captain Calamity",
      "year": 1936,
      "imdbRating": 4.3,
      "imdbVotes": 164,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.625Z"
}