{
  "movieId": "tt0047897",
  "title": "Breakaway",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/breakaway-1956-",
      "id": "breakaway-1956-",
      "title": "Breakaway (1956)",
      "description": "Tom Conway, Michael Balfour, Honor Blackman",
      "fileSize": 1145137919,
      "addedAt": "2026-01-07T00:07:38.720Z",
      "thumbnail": "https://archive.org/services/img/breakaway-1956-",
      "collection": "feature_films",
      "downloads": 775
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "72 min",
    "imdbRating": 5.7,
    "imdbVotes": 168,
    "Genre": "Crime, Drama",
    "Plot": "In West Berlin, a German scientist named Professor Dohlman has been working on a formula which may reduce metal fatigue. He is, however, dying and gives the formula to Johnny Matlock (Brian Worth) with the instruction that it should be passed on to the young man's brother Michael Matlock (John Horsley). Johnny is in a relationship with Michael's secretary Diane (Paddy Webster) and meets her at the airport on his return to England. Also entering the country is the suave, unflappable private detective Tom 'Duke' Martin (Tom Conway) who is welcomed by his friend, the former petty criminal Barney Wilson (Michael Balfour). Soon, Matlock and the girl are kidnapped with only Diane's abandoned handbag remaining. 'Duke' investigates and learns that Diane was due to meet someone the following evening at a nightclub. He makes the appointment himself and meets the glamorous Paula (Honor Blackman), who turns out to be Diane's sister. Determined to return Diane's possessions personally, 'Duke' discovers that everyone else wants to steal them. It seems that the formula is contained somewhere in the bag and he must find it before the bad guys kill Diane.",
    "Director": "Henry Cass",
    "Writer": "Norman Hudis, Paddy Manning O'Brine",
    "Actors": "Tom Conway, Michael Balfour, Honor Blackman",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0049433",
    "tt0049813",
    "tt0049340",
    "tt0049406",
    "tt0049904",
    "tt0049955",
    "tt0049854",
    "tt0049769",
    "tt0049636",
    "tt0050087",
    "tt0050271",
    "tt0389054"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.720Z"
}