{
  "movieId": "tt0041362",
  "title": "Fighting Man of the Plains",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1949FightingManofthePlains",
      "id": "1949FightingManofthePlains",
      "title": "Fighting Man of the Plains",
      "description": "Title: Fighting Man of the Plains Summary: Former bandit Jim Dancer becomes marshal of a Kansas town and cleans up the criminal element - with the help of his old pal, Jesse James. Directed by: Edwin L. Marin Edwin L. Marin Actors: Production Company: Nat Holt Productions Release Date: 16 November 1949 (USA) Aspect Ratio: 1.37 : 1 Color: Black and White In August, 1863, Jim Dancer, searching for the killer of his brother, rides with Quantrell's raiders against Lawrence, Kansas. Yancey, one of the guerrillas most responsible for the band's bad name and reputation, accosts Evelyn Slocom. Yancey tell Dancer that Evelyn's father is the man who killed Dancer's brother, and Dancer takes revenge by killing him. But the man he is searching for is really the dead ma;s brother, Bert Slocum. When the Civil War ends in 1865, Dancer becomes a fugitive, hunted by Slocum and George Cummings, a detective for the Pleasanton Agency. Cummings finally catches Dancer, and it is only then that Dancer learns he killed the wrong man. While crossing the river on a makeshift ferry, Cummings is accidentally killed. When they are found, Dancer introduces himself as Cummings, saying the dead man was Jim Dancer. As Cummings, Dancer becomes a track-worker at Lanyard, Kansas. While the town is celebrating the arrival of the first cattle-drive herd from Texas, one ...",
      "fileSize": 673371568,
      "addedAt": "2026-01-07T00:06:06.561Z",
      "thumbnail": "https://archive.org/services/img/1949FightingManofthePlains",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 2234
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "94 min",
    "imdbRating": 6.4,
    "imdbVotes": 539,
    "Genre": "Western",
    "Plot": "In August, 1863, Jim Dancer, searching for the killer of his brother, rides with Quantrell's raiders against Lawrence, Kansas. Yancey, one of the guerrillas most responsible for the band's bad name and reputation, accosts Evelyn Slocom. Yancey tell Dancer that Evelyn's father is the man who killed Dancer's brother, and Dancer takes revenge by killing him. But the man he is searching for is really the dead ma;s brother, Bert Slocum. When the Civil War ends in 1865, Dancer becomes a fugitive, hunted by Slocum and George Cummings, a detective for the Pleasanton Agency. Cummings finally catches Dancer, and it is only then that Dancer learns he killed the wrong man. While crossing the river on a makeshift ferry, Cummings is accidentally killed. When they are found, Dancer introduces himself as Cummings, saying the dead man was Jim Dancer. As Cummings, Dancer becomes a track-worker at Lanyard, Kansas. While the town is celebrating the arrival of the first cattle-drive herd from Texas, one of the cowboys menaces Evelyn Slocum, and Dancer stops him in a gun duel. The townsmen named Dancer Town Marshal in place of the cowardly Marshal. Persuaded by Dave Oldham and Florence Peel, both of whom know his true identity, Dancer accepts the job. But Bert Slocum is still after him, and the town's crooked justice-of-the-peace and district attorney aren't overly fond of the new Marshal and his law-and-order ways.",
    "Director": "Edwin L. Marin",
    "Writer": "Frank Gruber",
    "Actors": "Randolph Scott, Bill Williams, Victor Jory",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041223",
    "tt0038284",
    "tt0039266",
    "tt0041308",
    "tt0042033",
    "tt0042782",
    "tt0042313",
    "tt0040719",
    "tt0039441",
    "tt0039496",
    "tt0041221",
    "tt0041809"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:06.561Z"
}