{
  "movieId": "tt0071402",
  "title": "Death Wish",
  "year": 1974,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/death-wish-1974_202511",
      "id": "death-wish-1974_202511",
      "title": "Death Wish (1974)",
      "description": "Death Wish is a 1974 American vigilante action film directed by Michael Winner, starring Charles Bronson as Paul Kersey, an architect and urbanite who becomes a vigilante following the brutal murder of his wife and assault of his daughter by a gang. The film is notable for its exploration of themes such as justice, vengeance, and the social backdrop of crime in New York City during the 1970s. The story begins with Paul Kersey leading a peaceful life until a violent crime shatters it, prompting him to take justice into his own hands. He begins to hunt down criminals to avenge his family's suffering, leading to a moral dilemma regarding vigilantism and the law.",
      "fileSize": 905378693,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/death-wish-1974_202511",
      "language": "eng",
      "year": 1974,
      "collection": "feature_films",
      "downloads": 769
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "93 min",
    "imdbRating": 6.9,
    "imdbVotes": 45235,
    "Genre": "Action, Crime, Drama",
    "Plot": "Open-minded architect Paul Kersey returns to New York City from vacationing with his wife, feeling on top of the world. At the office, his cynical coworker gives him the welcome-back with a warning on the rising crime rate. But Paul, a bleeding-heart liberal, thinks of crime as being caused by poverty. However his coworker's ranting proves to be more than true when Paul's wife is killed and his daughter is raped in his own apartment. The police have no reliable leads and his overly sensitive son-in-law only exacerbates Paul's feeling of hopelessness. He is now facing the reality that the police can't be everywhere at once. Out of sympathy his boss gives him an assignment in sunny Arizona where Paul gets a taste of the Old West ideals. He returns to New York with a compromised view on muggers...",
    "Director": "Michael Winner",
    "Writer": "Brian Garfield, Wendell Mayes, Gerald Wilson",
    "Actors": "Charles Bronson, Hope Lange, Vincent Gardenia",
    "Language": "English, Italian, German, French",
    "Country": "United States, United Kingdom, Italy",
    "Awards": "1 win & 2 nominations"
  },
  "relatedMovies": [
    "tt0075263",
    "tt0073755",
    "tt0070930",
    "tt0158714",
    "tt0143428",
    "tt0073396",
    "tt0066970",
    "tt0074634",
    "tt0069446",
    "tt0074836",
    "tt0068997",
    "tt0073774"
  ],
  "collections": [
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.606Z"
}