{
  "imdbId": "tt0036888",
  "title": "Guns of the Law",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/GunsOfTheLaw44",
      "id": "GunsOfTheLaw44",
      "title": "Guns of the Law",
      "description": "Title: Guns of the Law Summary: The 11th in the series of 14 \"Texas Rangers\" westerns from P.R.C. that starred Dave O'Brien and Jim Newill, before Newill was replaced by Tex Ritter in the concluding eight films of a very ... Directed by: Elmer Clifton Actors: Production Company: Alexander-Stern Productions Release Date: 31 March 1944 (USA) Aspect Ratio: 1.37 : 1 The 11th in the series of 14 \"Texas Rangers\" westerns from P.R.C. that starred Dave O'Brien and Jim Newill, before Newill was replaced by Tex Ritter in the concluding eight films of a very bad 22-films series: Lillian Wilkins and her old Civil War Veteran Uncle Jed Wilkins own a ranch through which a pipeline will be laid. They are unaware of this but Dan Tyndall, Joe Hyslop and Tom Binns are aware of the possibilities for a quick profit and set out to prove through crooked-surveyor Sam Brisco that the land has been improperly surveyed and not rightfully the possession of the Wilkins. They go to family friend and attorney Kendall Lowther for advice and this is not a good move as Lowther is actually the brains behind the scheme to beat them out of their property. But Texas Rangers Tex Wyatt and Jim Steele show up to take a hand on the side of the Wilkins. That also means that Panhandle Perkins, accompanied by Lee Zahler's horrific comedy scoring, will also show up. Wilkerson's comedy ...",
      "fileSize": 484382015,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/GunsOfTheLaw44",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 1887
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/guns_of_the_law",
      "id": "guns_of_the_law",
      "title": "Guns of the Law",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4440110292,
      "addedAt": "2026-01-07T00:08:39.343Z",
      "thumbnail": "https://archive.org/services/img/guns_of_the_law",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 24037
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S4HpFgwrPxg",
      "id": "S4HpFgwrPxg",
      "title": "Guns of the Law (1944) DAVE O'BRIEN",
      "description": "Stars: Dave O'Brien, James Newill, Guy Wilkerson\nDirector: Elmer Clifton\n\nDave O'Brien and Jim Newill star as Texas Rangers helping out the Wilkins, ranch owners fighting to keep their ranch from villains!",
      "addedAt": "2025-12-26T23:46:59.131Z",
      "thumbnail": "https://i.ytimg.com/vi/S4HpFgwrPxg/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBjAWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLD_GYPWOuzi1xruneIDcg2fyCuvxQ",
      "duration": 3153,
      "language": "en",
      "year": 1944,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "56 min",
    "imdbRating": 5.6,
    "imdbVotes": 81,
    "Genre": "Western",
    "Plot": "Lillian Wilkins and her old Civil War Veteran Uncle Jed Wilkins own a ranch through which a pipeline will be laid. They are unaware of this but Dan Tyndall, Joe Hyslop and Tom Binns are aware of the possibilities for a quick profit and set out to prove through crooked-surveyor Sam Brisco that the land has been improperly surveyed and not rightfully the possession of the Wilkins. They go to family friend and attorney Kendall Lowther for advice and this is not a good move as Lowther is actually the brains behind the scheme to beat them out of their property. But Texas Rangers Tex Wyatt and Jim Steele show up to take a hand on the side of the Wilkins.",
    "Director": "Elmer Clifton",
    "Writer": "Elmer Clifton",
    "Actors": "Dave O'Brien, James Newill, Guy Wilkerson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037304",
    "tt0037176",
    "tt0036664",
    "tt0036847",
    "tt0036750",
    "tt0037460",
    "tt0037901",
    "tt0036669",
    "tt0031190",
    "tt0037673",
    "tt0026952",
    "tt0028508"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.343Z"
}