{
  "movieId": "tt0002956",
  "title": "Hide and Seek",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HideAndSeek1913",
      "id": "HideAndSeek1913",
      "title": "HIDE AND SEEK (1913)",
      "description": "HIDE AND SEEK Keystone-Mutual 1/2 reel, rel. Apr. 3, 1913 dir. George Nichols cast: Mabel Normand, Ford Sterling, Betty Schade, Helen Holmes, Edgar Kennedy, Nick Cogley, Paul Jacobs",
      "fileSize": 183032708,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HideAndSeek1913",
      "collection": "feature_films",
      "downloads": 1184
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HideAndSeek_201507",
      "id": "HideAndSeek_201507",
      "title": "\"Hide And Seek\" (1913) director Mack Sennett",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Hide and Seek\" is a short comedy.  The film is included in our program to illustrate the contributions of our star Helen Holmes. This is the second earliest surviving film with Helen Holmes that we have. She became the audacious star of \"The Hazards of Helen\" a year and a half later, acting as the heroine of numerous railroad adventures. Directed by                Mack Sennett Produced by              Keystone Film Company Starring                     Nick Cogley, Mabel Normand, Ford Sterling, Helen Holmes Cinematography        unknown Distributed by           Mutual Film Corporation Release date               April 3, 1913 Running time             6 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 75583323,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HideAndSeek_201507",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 1805
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-hide-and-seek",
      "id": "silent-hide-and-seek",
      "title": "Hide and Seek",
      "fileSize": 122913432,
      "addedAt": "2026-01-07T00:10:59.119Z",
      "thumbnail": "https://archive.org/services/img/silent-hide-and-seek",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 234
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5,
    "imdbVotes": 75,
    "Genre": "Short, Comedy",
    "Plot": "The young wife visits her father's office and plays hide and seek with her little girl. The baby hides in the big vaults and the mother pretends she does not know where the child is. The mother is called by her father and goes to the other room for a few minutes and the little girl toddles out to the street. The clerk closes the vault and turns on the time lock. The mother returning to the room imagines the baby is in the vault and becomes frantic. She turns in a fire alarm and the engines respond. The police are called, and they rush to the office in a fast automobile. While these things are going on flashes are shown of the baby, who has made friends with a bulldog, and is leading it about. Finally she meets some other tots, and the kidlets have a good time together. Her mother and grandfather are frantic, and a safe expert is hurriedly sent for. It is decided to dynamite the vault door, and it is blown out. All rush into the vault, and are relieved to find the child is not there. In the midst of the excitement the father, who has found his little girl, walks into the office with the baby in his arms.",
    "Director": "Mack Sennett",
    "Writer": "N/A",
    "Actors": "Mabel Normand, Ford Sterling, Nick Cogley",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0003177",
    "tt0003417",
    "tt0002663",
    "tt0002755",
    "tt0003238",
    "tt0002919",
    "tt0002569",
    "tt0003104",
    "tt0003106",
    "tt0002133",
    "tt0002501",
    "tt0002280"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}