{
  "movieId": "tt0025391",
  "title": "Life Returns",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LifeReturns",
      "id": "LifeReturns",
      "title": "Life Returns",
      "description": "A doctor (Onslow Stevens) who has spent his career working on ways to revive the dead sees his chance to prove his theory by performing his procedures on a recently deceased dog.",
      "fileSize": 1366981682,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LifeReturns",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 15425
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5PDuGtfdZT0",
      "id": "5PDuGtfdZT0",
      "title": "Life Returns (1935) HORROR",
      "description": "Stars: Onslow Stevens, George P. Breakston, Lois Wilson \nDirectors: Eugene Frenke, James P. Hogan\n\n A doctor who has spent his career working on ways to revive the dead, sees his chance to prove his theory by performing procedures on a recently deceased dog.",
      "addedAt": "2025-12-26T23:54:36.590Z",
      "thumbnail": "https://i.ytimg.com/vi/5PDuGtfdZT0/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCpJTBK840Qx6A-iopbOHfgKNJhYA",
      "duration": 3553,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "63 min",
    "imdbRating": 3.9,
    "imdbVotes": 258,
    "Genre": "Drama, Horror, Sci-Fi",
    "Plot": "Idealistic doctoral graduates Bob (Dr. Robert E. Cornish), Louise and John plan their futures in pursuit of a formula to restore life to the dead. Bob and Louise wish to remain independent and pursue medical research free of corporate ties. John tries in vain to convince them that by joining him to work at Arnold Research Laboratories they could achieve more research in a year than they could in five as an independent research team. John leaves his friends for corporate pharmacology only to find the pace of his research is not progressing fast enough nor seems practical enough to suit Mr. Arnold. The final blow comes when he is told to turn his attention to creating a treated pig bristle brush to restore hair and prop up his bosses investments in pig processing. Disillusioned Dr. John Kendrick faces public ridicule as he promotes his theory to his peers and falls into a deep depression that costs him his private medical practice. Five years later the sudden passing of his wife, drives in into a paralytic depression and loses custody of his only son, Danny. Danny runs away with his dog scooter in tow to avoid being a ward of the state and hoping to return to life with his father. Danny is befriended by an east-side gang and allowed to stay in their club house with Scooter serving as watch dog. The gang tries to help Danny get his dad a job but the best they can come up with is as an elevator operator in a research lab. When his dad turns the job down, Danny takes it as a sign that his father is unwilling to get back to a state of normalcy and regain custody. Meanwhile Louise and Bob continue their research on life after death when they learn of John's fate from his former boss at Arnold Research. Louise visits John to share the success of Dr. Bob Cornish's own research. John takes this as ridicule and drives her off with self-righteous indignation. Danny's dog scooter is captured by the dog catcher and the gang tries to spring all the dogs to cover a rescue attempt. Danny and Scooter are caught but Danny gets away only to find one of his friends has broken a leg while running from the pound. Afraid to go home to his father, the injured boy is taken to the clubhouse and Danny enlists his father to help. Dr. John is too far gone and refuses to treat the boy, leaving the gang to think Danny has lie about his father being a great doctor. Danny begins to doubt his father himself when he learns that Scooter is being gassed by the dog catcher in retaliation for the rescue attempt. Danny again implores his dad to help revive Scooter to no avail. Danny runs away again vowing he no longer wishes to see his father. Upon reflection of how he has let down himself and Danny, Dr. John collects Scooters body and enlists the help of Dr. Bob Cornish and his team to revive him. The gang brings in their dogs as blood donors to create the resuscitation fluid. The gang then find Danny on the verge of jumping out a window in despair. What follows is purported to be an actual reanimation sequence performed by the real Dr. Robert Cornish and his team*. The result restores the faith of Dr. John in science and Danny in his father. *The story opens with a signed affidavit as follows: TO WHOM IT MAY CONCERN: The actual experiment of bringing the dead back to life, which is part of the motion picture \"Life Returns\" was performed by myself and staff on May 22, 1934 at 11:45 P.M. in Berkeley, California. This part of the picture was originally taken to retain a permanent scientific record of our experiment. Everything shown is absolutely real. The animal was unquestionably and actually dead, and was brought back to life. May I offer my thanks to my assistants, Mario Margutti, William Black, Ralph Celmer and Roderic Kneder, who are shown carrying out their respective parts. Respectfully submitted, Dr. Robert E. Cornish",
    "Director": "Eugene Frenke, James P. Hogan",
    "Writer": "Eugene Frenke, James P. Hogan, Arthur T. Horman",
    "Actors": "Onslow Stevens, Lois Wilson, Valerie Hobson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027521",
    "tt0021884",
    "tt0011130",
    "tt0035640",
    "tt0050720",
    "tt0051020",
    "tt0049900",
    "tt0235245",
    "tt0025064",
    "tt0099582",
    "tt0049366",
    "tt0058700"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.750Z"
}