{
  "imdbId": "tt0069498",
  "title": "While the Cat's Away...",
  "year": 1972,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/while-the-cats-away...-1972",
      "title": "While The Cat's Away... 1972",
      "description": "Mrs Jones (Kathryn Ford in her only credit at IMDb) is a very busy woman who can stop traffic. In fact in the opening scene we see traffic backed up as she parallel parks her red VW bug.  She does go on to have sex with her hair dresser, the milkman and the postman while doing household chores much to the dismay of her nosy next door neighbor.  Marlene Willoughby makes an appearance as the manicurist. Chuck Vincent again with his usual solid filmmaking. ",
      "id": "while-the-cats-away...-1972"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "78 min",
    "imdbRating": "4.7",
    "imdbVotes": "24",
    "Genre": "Comedy",
    "Plot": "I find it interesting that so-called adult movies often seem aimed at people too young to legally view them. Take \"While the Cat's Away,\" a soft-core sex comedy directed by the late porn auteur Chuck Vincent. It's for adults only, but it's made to appeal to 12-year-old boys. No, make that 11.The editor of Exposé magazine assigns Lurch (J.M. Everett), his star reporter — his ONLY reporter, actually — to get the inside scoop on the sex life of a \"typical American housewife.\" He selects Mrs. Jones out of a phone book and she provides enough material to merit a Kinsey Report all her own. The span of a single day, Mrs. Jones (Kathryn Ford) has no fewer than nine sexual encounters, and this excludes her attempts give her husband a very good morning and some intimate encounters with his breakfast (fans of \"sploshing\" should enjoy her egg cracking method). After dropping her husband off at the train station she gets busy with her errands, and with her dentist, her hairdresser, her mechanic, her mailman, her priest?. Mr. Jones, meanwhile, is not the stick-in-the-mud he first appears to be. When he complains to his wife that sex in the morning would just leave him feeling drained, he really means he's saving his strength for his extramarital activities (his partners aren't as numerous – a mere four – but their demands take up his entire work day). And yet, with so much to report, Lurch gets neither the story nor laid.The problem with sex comedies is they usually fail at being funny and erotic, settling for just being stupid instead. \"While the Cat's Away\" is no exception. The movie does have some genuinely amusing moments, like Mrs. Jones' attempts to take advantage of her husband's morning \"condition\" or an old lady at a hair salon complaining incessantly about how the world is going to hell, seemingly oblivious to the girl-on-girl action happening in the neighboring chair, but most of the humor in \"While the Cat's Away\" plays like a Vaudeville sketch. Really, to be made in 1972 the movie apes the comedic styles of the 1930s. Besides driving her red VW Bug like a Klown Kollege drop out, Mrs. Jones pointedly asks various merchants if she can put their bill \"on my account\" (wink, wink) and she meets double entendres – like a postman remarking that \"I really stuffed your mailbox\" – with a hearty, \"And how!\" On top of lame jokes is an irritating score, with lots of ragtime piano and songs like \"Office Work can be so Much Fun,\" a ditty that's as creative as its title.Despite all its bad jokes, hammy acting and annoying music, \"While the Cat's Away\" is better made than similar movies I could name (and I will: \"Deep Jaws,\" \"Cinderella 2000,\" \"The Dicktator,\" \"Linda Lovelace for President\"). Kathryn Ford is pretty in a wholesome, natural way that you just don't see any more, though her partners leave something to be desired (only four of the guys she rolls around with could be considered attractive, and the Sapphic hairdresser looks like Warhol drag star Holly Woodlawn). At least Calvert DeForest (a.k.a. Larry \"Bud\" Melman), who makes a brief appearance as one of the staffers of Exposé magazine, is not among her many bed mates. Chuck Vincent was one of the more gifted directors of adult movies, but this early effort fails to tickle the funny bone, or any other bone.",
    "Director": "Chuck Vincent",
    "Writer": "Hank Russo, Chuck Vincent",
    "Actors": "Kathryn Ford, Richard Major, J.M. Everett",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0067818",
      "title": "Tacos al carbón",
      "year": 1972,
      "imdbRating": "6.3",
      "imdbVotes": "83",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0071085",
      "title": "43: The Richard Petty Story",
      "year": 1972,
      "imdbRating": "6.4",
      "imdbVotes": "126",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0068370",
      "title": "Children Shouldn't Play with Dead Things",
      "year": 1972,
      "imdbRating": "5.3",
      "imdbVotes": "5,302",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0068539",
      "title": "It Can Be Done Amigo",
      "year": 1972,
      "imdbRating": "5.7",
      "imdbVotes": "1,837",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0069095",
      "title": "All the Way Boys",
      "year": 1972,
      "imdbRating": "6.6",
      "imdbVotes": "8,043",
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0228063",
      "title": "Bikinis y rock",
      "year": 1972,
      "imdbRating": "4.4",
      "imdbVotes": "16",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0191090",
      "title": "Disputas en la cama",
      "year": 1972,
      "imdbRating": "6.1",
      "imdbVotes": "11",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0191997",
      "title": "Estoy hecho un demonio",
      "year": 1972,
      "imdbRating": "4.2",
      "imdbVotes": "11",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0068670",
      "title": "Había una vez un circo",
      "year": 1972,
      "imdbRating": "4.8",
      "imdbVotes": "83",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0069223",
      "title": "La sartén por el mango",
      "year": 1972,
      "imdbRating": "6.0",
      "imdbVotes": "48",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0178907",
      "title": "La sonrisa de mamá",
      "year": 1972,
      "imdbRating": "5.5",
      "imdbVotes": "51",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0066871",
      "title": "Burke & Hare",
      "year": 1972,
      "imdbRating": "5.3",
      "imdbVotes": "581",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}