{
  "imdbId": "tt0070723",
  "title": "Soylent Green",
  "year": 1973,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/soylent-green-1973_202511",
      "id": "soylent-green-1973_202511",
      "title": "Soylent Green (1973)",
      "description": "Soylent Green is a 1973 American dystopian thriller film directed by Richard Fleischer, and starring Charlton Heston, Leigh Taylor-Young, and Edward G. Robinson in his final film role. S et in a dystopian future where overpopulation and environmental collapse have led to severe food shortages, NYPD detective Robert Thorn investigates the murder of a Soylent Corporation executive. As he uncovers the truth about the corporation's food product, Soylent Green, he discovers it is made from human remains, leading to a shocking revelation about society's dark reality.",
      "fileSize": 846468399,
      "addedAt": "2026-01-07T00:11:35.626Z",
      "thumbnail": "https://archive.org/services/img/soylent-green-1973_202511",
      "language": "eng",
      "year": 1973,
      "collection": "feature_films",
      "downloads": 360
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "97 min",
    "imdbRating": 7,
    "imdbVotes": 73901,
    "Genre": "Crime, Mystery, Sci-Fi",
    "Plot": "In 2022, Earth is overpopulated and totally polluted; the natural resources have been exhausted and the nourishment of the population is provided by Soylent Industries, a company that makes a food consisting of plankton from the oceans. In New York City, when Soylent's member of the board William R. Simonson is murdered apparently by a burglar at the Chelsea Towers West where he lives, efficient Detective Thorn is assigned to investigate the case with his partner Solomon \"Sol\" Roth. Thorn comes to the fancy apartment and meets Simonson's bodyguard Tab Fielding and the \"furniture\" (woman that is rented together with the flat) Shirl and the detective concludes that the executive was not victim of burglary but executed. Further, he finds that the Governor Santini and other powerful men want to disrupt and end Thorn's investigation. But Thorn continues his work and discovers a bizarre and disturbing secret of the ingredient used to manufacture Soylent Green.",
    "Director": "Richard Fleischer",
    "Writer": "Stanley R. Greenberg, Harry Harrison",
    "Actors": "Charlton Heston, Edward G. Robinson, Leigh Taylor-Young",
    "Language": "English, Spanish, Hebrew",
    "Country": "United States",
    "Awards": "3 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0068997",
    "tt0047594",
    "tt0070578",
    "tt0069002",
    "tt0059678",
    "tt0068174",
    "tt0071877",
    "tt0067670",
    "tt0068625",
    "tt0069439",
    "tt0071426",
    "tt0068615"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.626Z"
}