{
  "movieId": "tt0046799",
  "title": "Boot Polish",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BootPolish1954",
      "id": "BootPolish1954",
      "title": "Boot Polish (1954)",
      "description": "Synopsis Originally titled Ab Dilli Dur Nahin, Boot Polish was produced (but not directed) by prolific Indian filmmaker Raj Kapoor. The main adult character, played by Kapoor, is a carefree vagabond who befriends a pair of enterprising orphans (Baby Naaz and Rattan Kumar). Unwanted by society in general and by their family in particular, the kids stay alive by running a shoe-shining business. When Kapoor is arrested, the children dedicate themselves to being reunited with their boon companion. Bearing unavoidable traces of Vittorio De Sicaâs Shoeshine, Boot Polish was reasonably well-received when distributed in the U.S. âallmovie guide Cast: Kumari Naaz, Rattan Kumar, David Abraham, Chand Burke, Raj Kapoor, Prithviraj Kapoor, Bhupendra Kapoor",
      "fileSize": 43207129,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BootPolish1954",
      "collection": "feature_films",
      "downloads": 5079
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 7.9,
    "imdbVotes": 879,
    "Genre": "Comedy, Drama, Family",
    "Plot": "Toddlers Belu and Bhola share an uncertain future when their mom dies in the plague, and their dad is imprisoned. They are then left in the uncaring care of Kamla, their aunt, who moonlights as a prostitute. She is cruel,abusive and forces them to take to a life of begging on the local trains, on beaches and crowded areas in Bombay. This is how the toddlers grow up, they want to lead a respectable life, and with the help of bootlegger John, they get a shoe-shine kit and start shining shoes on busy sidewalks and railway platforms. Their circumstances face more uncertainty when Kamla finds out about their new-found profession, beats them up and throws them out of the house. They temporarily seek shelter with John, but when he is arrested, they have to fend for themselves. Things become bad to worse when Bombay enters the monsoon season, when people do not get their shoes shined; then the duo are separated - with Belu ending up with a rich family, and when she asks about Bhola, she is told that he is dead. The question remains is Bhola really dead, if not, what has been his fate?",
    "Director": "Prakash Arora",
    "Writer": "Bhanu Pratap",
    "Actors": "Kumari Naaz, Ratan Kumar, David Abraham",
    "Language": "Hindi",
    "Country": "India",
    "Awards": "4 wins & 1 nomination"
  },
  "relatedMovies": [
    "tt0031580",
    "tt0045620",
    "tt0121973",
    "tt0011588",
    "tt0054195",
    "tt0046733",
    "tt0018742",
    "tt0008443",
    "tt1083448",
    "tt0235953",
    "tt0046995",
    "tt0053134"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}