{
  "imdbId": "tt0002122",
  "title": "The Cry of the Children",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-cry-of-the-children",
      "title": "The Cry of the Children",
      "id": "silent-the-cry-of-the-children"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "29 min",
    "imdbRating": "6.2",
    "imdbVotes": "326",
    "Genre": "Short, Drama",
    "Plot": "Part 1: Little Alice, more fortunate than some of the others, was not always a child slave. She was the youngest of three children, and the pet. Wages were small, but her parents and her brother and sister found it possible to feed an extra mouth, although the margin between income and expenses was pitifully scanty. So little Alice, for a time, was a happy child, and not a tiny old woman, as were the other little girls in the manufacturing town. The wife of the owner of the mill was a selfish, dissatisfied society woman. Driving out in her auto one day, she saw little Alice, and immediately was struck with the youth and beauty of the pretty child. A creature of impulse, she decided she wanted Alice for her own, and summoning the parents told them of the good fortune in store for them. Much to the rich woman's surprise, they did not see it as she did. They did not want to give the child up, and said so. The mother, however, thought of the advantages that Alice would have if she accepted the offer. With true self-sacrificing mother love, she told Alice that she could go to the home where riches awaited her, but that decision rested entirely with her. The child looked from the \"pretty lady\" to the homely, poorly dressed woman, and the man and the two tattered children awaited her decision with breathless interest. Her choice was made, and she threw herself into her mother's arms. The \"pretty lady\" watched the happy, shabby group through her lorgnette. Then she entered her auto and was driven back to her beautiful home, where love and self-sacrifice did not abide. Part 2: Little Alice was an odd figure in the grimy town she called home, because, unlike the other children, she did not work in the mill. Her father, mother, brother and sister worked there many weary hours a day, and made many sacrifices so that \"Baby Alice\" might remain a child, and did not become an old woman before she was in her teens. The wife of the rich mill owner had seen Alice, been struck by her appearance, and offered to adopt her, but although the parents were willing to give her up, for her own good, she delighted their hearts by declining to do so. Later, trouble came to the family and to many others in the town. Wages in the mill were reduced, and the workers struck. It was a strike of desperation. The workers had no money, no helping hand was extended to them, and what the mill owner had predicted to them came to pass. They were starved out, and crept back to their old places at his terms, and were worse off than they had been before. The strike made a great change in the future of little Alice. Her mother was frail, and the period of semi-starvation through which she had passed, weakened her more. She tried to go back to work, but was unable to do so. So little Alice insisted on being a wage-earner, and her parents could not forbid it. In her new environment, little Alice speedily lost her freshness and beauty. So day by day the child faded away, becoming old and haggard before her time. The mother of Alice was also growing weaker, and the child knew that only money and rest could restore her. So her thoughts turned to the \"pretty lady\" who wanted to adopt her, and she decided, for her mother's sake, to accept the offer. But the \"pretty lady\" scornfully turned her away, telling Alice that she was old and ugly now, and that no one would want her. Also she had a pet, a poodle dog, that held the chief place in her affections. Little Alice returned to the factory, and lived out her brief life there. She was stricken while at work, and died there. The other children did not grieve, they envied her, but the \"pretty lady\" who met the mourners returning from the funeral, shuddered, and was serious and thoughtful for once in her life.",
    "Director": "George Nichols",
    "Writer": "Elizabeth Barrett Browning",
    "Actors": "Marie Eline, Ethel Wright, James Cruze",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0002143",
      "title": "Dr. Jekyll and Mr. Hyde",
      "year": 1912,
      "imdbRating": "6.0",
      "imdbVotes": "893",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0367144",
      "title": "The Tiniest of Stars",
      "year": 1913,
      "imdbRating": "6.0",
      "imdbVotes": "25",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002504",
      "title": "The Star of Bethlehem",
      "year": 1912,
      "imdbRating": "4.9",
      "imdbVotes": "60",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002784",
      "title": "Cymbeline",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "50",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001545",
      "title": "Cinderella",
      "year": 1911,
      "imdbRating": "6.1",
      "imdbVotes": "149",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002851",
      "title": "Fatty Joins the Force",
      "year": 1913,
      "imdbRating": "5.4",
      "imdbVotes": "437",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0464694",
      "title": "Tannhäuser",
      "year": 1913,
      "imdbRating": "5.2",
      "imdbVotes": "44",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0463594",
      "title": "The Marble Heart",
      "year": 1913,
      "imdbRating": "4.7",
      "imdbVotes": "40",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003961",
      "title": "A Film Johnnie",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "1,796",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004091",
      "title": "His Favorite Pastime",
      "year": 1914,
      "imdbRating": "5.0",
      "imdbVotes": "1,253",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003969",
      "title": "A Flirt's Mistake",
      "year": 1914,
      "imdbRating": "5.2",
      "imdbVotes": "255",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0344506",
      "title": "The Two Roses",
      "year": 1910,
      "imdbRating": "5.4",
      "imdbVotes": "48",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}