{
  "movieId": "tt0071093",
  "title": "Abigail Lesley Is Back in Town",
  "year": 1975,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-c9RETPodfk",
      "id": "-c9RETPodfk",
      "title": "Zorro is Back (1975) Alain Delon, Stanley Baker | Action, Western | Full Movie",
      "description": "Zorro is Back ! It's All for fun and fun for all !\nIn the New World, a new Spanish governor finds the province of Nueva Aragón under the iron fist of the corrupt Colonel Huerta and vows to bring justice under the guise of a masked avenger.\n\nDirector: Duccio Tessari\nWriter: Giorgio Arlorio\nStars: Alain Delon, Stanley Baker, Ottavia Piccolo\nGenres: Action, Adventure, Comedy, Romance, Western\n\n0:00 A town debates whether to hire their own marshal or rely on the legal system to handle a gang of outlaws.\n16:45 A marshal named Warlock arrives in a town to establish order, but faces resistance from some of the townspeople.\n27:04 In the town of Warlock, tensions rise as the citizens deal with troublemakers and road agents.\n45:49 A man seeks revenge on the man who killed his brother in the Wild West town of Warlock.\n55:04 John Gannon becomes the new Deputy of Warlock and vows to bring law and order to the town.\n58:59 A deputy sheriff in a town called Warlock prepares to confront a group of men who are causing trouble.\n1:11:40 A marshal named Clay is called out by three Cowboys and ends up killing them in self-defense.\n1:18:46 A group of regulators plans to come to the town of Warlock to challenge the marshal and his deputies.\n1:31:30 A deputy in the town of Warlock is caught in a conflict between two rival gangs and must decide whether to seek help or face the danger alone.\n1:39:51 A showdown between Clay Morgan and Tom Morgan in the town of Warlock.\n1:57:12 A man named Morgan talks about towns, shooting bat shooters, and finding a key.\n\n @CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:40:49.833Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/-c9RETPodfk/maxresdefault.webp?v=66c9912a",
      "duration": 7148,
      "language": "en",
      "year": 1975,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "100 min",
    "imdbRating": 5.7,
    "imdbVotes": 494,
    "Genre": "Drama, Romance",
    "Plot": "Abigail Lesley's return brings back painful memories for several inhabitants of a small, quiet fishing village hit by economic troubles. Abigail left town years ago after she and Gordon Howe were accidentally caught having sex by his wife Priscilla. Abigail is sexually liberated, predatory, and knows what she wants. And what she wants is revenge...sort of. She slowly gets in touch with former acquaintances, including Priscilla, and seduces them one by one. What starts off as manipulative revenge slowly turns into a season of sexual liberation and emotional healing. caught by accident by his wife Priscilla, while having sex. Abigail is a sexually liberated and predatory woman, who knows what she wants and what she wants is revenge, sort of. She slowly gets in touch with the people she used to know there, including Priscilla, and proceeds to seduce them one by one. What starts off as manipulative revenge, slowly turns into a session of sexual liberation and emotional healing. Succumbing to Abigail's charms, cautious Priscilla, her sex-loving friends Lila and Tracey, ashamed local incestuous fisherman and Priscilla's on and off lover Chester, his meek sister Alice Anne and indirectly even Priscilla's aunt Drucilla, all become part of Abigail's seductive game. However, things take a more serious turn at the end.",
    "Director": "Joseph W. Sarno",
    "Writer": "Joseph W. Sarno",
    "Actors": "Mary Mendum, Jennifer Jordan, Eric Edwards",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0072613",
    "tt0075119",
    "tt0071481",
    "tt0072417",
    "tt0071566",
    "tt0074102",
    "tt0329368",
    "tt7249538",
    "tt0071842",
    "tt0308503",
    "tt0071141",
    "tt0070107"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:40:23.891Z"
}