{
  "imdbId": "tt0059581",
  "title": "Pearls of the Deep",
  "year": 1965,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pearls-of-the-deep",
      "id": "pearls-of-the-deep",
      "title": "Pearls Of The Deep",
      "description": "A manifesto of sorts for the Czech New Wave, this five-part anthology shows off the breadth of expression and the versatility of the movement’s directors. Based on stories by the legendary writer Bohumil Hrabal, the shorts range from the surreally chilling to the caustically observant to the casually romantic, but all have a cutting, wily view of the world.",
      "fileSize": 8811493142,
      "addedAt": "2026-01-07T00:10:12.697Z",
      "thumbnail": "https://archive.org/services/img/pearls-of-the-deep",
      "language": "cze",
      "year": 1966,
      "collection": "feature_films",
      "downloads": 3110
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "107 min",
    "imdbRating": 6.5,
    "imdbVotes": 825,
    "Genre": "Comedy, Drama",
    "Plot": "Set against the backdrop of a repressed Czechoslovakia, five non-related vignettes are presented, each showcasing the need and want for human connection. In \"Mr. Baltazar's Death\", a middle aged couple who are experts at mechanics, travel to a motorcycle race where they congregate with the masses on the section of the course where historically there has been the most action of the destructive kind. In \"Imposters\", two elderly hospital patients talk about their past professional glories as a journalist and light opera star respectively. Each man wants to hear about the other more than tell his own story for good reason. In \"The House of Joy\", two national insurance agents believe they have an easy sale when they visit an elderly goat farmer/amateur painter, who uses whatever surface as his canvass, and paints his life and his dreams. But the sale will not be as easy as the men first believe it will be. In \"The Restaurant the World\", a wedding reception is taking place in one part of a busy self-serve diner. The reception guests are oblivious to the sadness of real life taking place all around their small current vacuum of a world, with the bride determined to make the most of *her* night. And in \"Romance\", a working class lad, out on the town on his own, is mesmerized by a young Romani girl.",
    "Director": "Vera Chytilová, Jaromil Jires, Jirí Menzel",
    "Writer": "Bohumil Hrabal, Jirí Menzel, Jan Nemec",
    "Actors": "Pavla Marsálková, Ferdinand Kruta, Emil Iserle",
    "Language": "Czech, Romany, English",
    "Country": "Czechoslovakia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0320675",
    "tt0178850",
    "tt0063371",
    "tt0309401",
    "tt0060802",
    "tt0060586",
    "tt0060560",
    "tt0058756",
    "tt0059927",
    "tt0060584",
    "tt0060304",
    "tt0061407"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.697Z"
}