{
  "imdbId": "tt0054806",
  "title": "The Devil's Agent",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/devils-agent-1962",
      "id": "devils-agent-1962",
      "title": "The Devil's Agent (1962)",
      "description": "The Devil's Agent Peter van Eyck, Macdonald Carey, Marianne Koch, Christopher Lee 1962",
      "fileSize": 1174485615,
      "addedAt": "2026-01-07T00:08:07.354Z",
      "thumbnail": "https://archive.org/services/img/devils-agent-1962",
      "collection": "feature_films",
      "downloads": 1753
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "77 min",
    "imdbRating": 6.3,
    "imdbVotes": 108,
    "Genre": "Drama, Mystery",
    "Plot": "In 1950, the Cold War is in full swing. Like Berlin, Vienna too is divided in four sectors: the American Sector, the British Sector, the French Sector and the Soviet Sector. Travel between these sectors is still possible at this time. In the sector controlled by the Western Allies, Austrian wine merchant George Droste raises his teenage son. During the war he worked for the German Army Intelligence (Abwehr) on the Eastern Front. Nowadays he occasionally and accidentally bumps into former demobilized comrades and childhood friends. After a few such encounters, Droste unwittingly and unwillingly gets involved into the spy game pitting Western Intelligence agencies against the Soviet ones. After he unwittingly becomes a courier of secret documents between the Western Sector and the Soviet Sector, Droste unwillingly becomes an agent for the Western Intelligence agencies. He also pretends to work for the Soviets in order to cross into Communist Hungary and carry on a secret mission at the behest of Western Intelligence. After a successful mission in Hungary, from where he barely escapes with his life and falls in-love with a Hungarian defector, Droste is dispatched to Hamburg, Germany for another secret mission involving a former German Abwehr General. But Droste gets tired of the spy game and wants to continue his quiet life next to his son and his newly found Hungarian lover. Unfortunately for him, neither the Western Intelligence nor the Soviet Intelligence is willing to dispense with his good services. To make matters worse, the ex-Abwehr General from Hamburg feels betrayed by Droste, concerning a confidential mission involving the Abwehr's Eastern Front hidden archives, and sends killers after him.",
    "Director": "John Paddy Carstairs",
    "Writer": "Robert Westerby, Hans Habe, John Paddy Carstairs",
    "Actors": "Peter van Eyck, Macdonald Carey, Marianne Koch",
    "Language": "English",
    "Country": "Ireland, United Kingdom, West Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040799",
    "tt0058084",
    "tt0178333",
    "tt0054710",
    "tt0054731",
    "tt0150524",
    "tt0057565",
    "tt0056216",
    "tt0057401",
    "tt0055304",
    "tt0057495",
    "tt0057426"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.354Z"
}