{
  "imdbId": "tt0045230",
  "title": "The Thief",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-thief-1952",
      "title": "The Thief (1952) Directed By Russell Rouse, Starring Ray Milland",
      "description": "The Thief is a 1952 American FILM NOlR crime film directed by Russell Rouse and starring Ray Milland. The film is noted for having no spoken dialogue; the only verbal communication present in the film is represented through close up shots of two telegrams.   The great cinematography was done by Sam Leavit and it earned him a Golden Globe nomination. The soundtrack was scored by Herschel Burke Gilbert, which earned him an Oscar nomination.   You can find out more about this movie from Wikipedia . There is also a good review of the movie from the movie blog Reviews from the Bottom of the Barrel .   ",
      "fileSize": 746253039,
      "id": "the-thief-1952"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "86 min",
    "imdbRating": 6.7,
    "imdbVotes": 1231,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "SYNOPSIS Nuclear physicist and spy Dr. Allan Fields responds to a phone signal by meeting his contact, Mr. Bleek, on the street. Bleek drops a note written on a cigarette wrapper, which Allan surreptitiously picks up and brings back to his apartment to read. The next morning, he goes to work at his office, the U.S. Atomic Energy Commission, and reluctantly photographs secret documents. After putting the film in a pill case, he leaves the case in the stacks of the Library of Congress, where Bleek retrieves it. The pill case then makes its way across the city, passed from one agent to another until it is ultimately flown to Cairo. Days later, Allan drinks heavily and tries to ignore Bleek's phone signals. Bleek follows him to his office, where Allan cannot concentrate. Finally, Bleek tracks Allan down outside his apartment and drops another note, which Allan reads and then burns. In the morning, he breaks into the office of fellow physicist Dr. Hans Linstrum and photographs papers from the safe. When Linstrum arrives unexpectedly, Allan hides behind a chair and narrowly avoids being caught. Once again, he deposits the film at the Library of Congress, where a patron almost finds it before Bleek reaches it. Satisfied that Bleek has the film, Allan returns home, despondent, and smashes a plaque which honors his contribution to the field of physics in America. Meanwhile, the pill case is passed to an agent who is then hit by a car, allowing a policeman to retrieve the film. Soon, the FBI starts an investigation, and when Allan is notified of this by Bleek, he hurriedly drops his camera into a nearby river. Linstrum is questioned in his office the next day, after which the FBI makes a short list of suspects from the Atomic Energy Commission, which includes Allan. Not realizing he is being followed by agent Harris, Allan nonetheless searches his apartment desperately for listening devices. When he attempts to meet Bleek at the Library of Congress, Bleek sees Harris behind Allan and avoids them both, but later sends Allan a coded telegram advising him to visit a car parked in a nearby lot. While the FBI is concluding that the telegram sender's name and address are fictitious, Allan sees Harris and sneaks out the back fire escape to the car. In the glove compartment, he retrieves a key and a note which instructs him to travel that night from Washington to a locker in New York City's Grand Central Station. He opens the locker to find a briefcase and the address of a brownstone apartment. There, he finds his appointed room and opens the briefcase to discover fake identification cards and a new set of clothes. Days pass while he awaits his next signal and avoids the beautiful, seductive woman across the hall. Soon, he goes stir crazy in his small room, erupting in a frenzy which propels him out the door and through the streets, running until he is exhausted. In the meantime, the FBI agents discover the car in the parking lot and dust it for fingerprints. Finally, Allan hears the phone signal from Bleek. As instructed, he visits the Empire State Building to receive his next clue from Miss Philips, a spy who carries three books bound in string. They meet and she passes him a book, which contains an advertisement listing a 3:30 AM ship departure to Cairo. Harris, who has tracked Allan to the building, almost loses his subject but, finally seeing him reading the ad, gives chase. Allan runs up dozens of flights, reaching the 102nd floor in a state of exhaustion. He hides in the engineering room, but just as he believes he has escaped, Harris climbs up a ladder and grabs Allan's leg. Allan kicks the agent off and Harris falls to this death. Horrified, Allan races out of the building to his room, where he breaks down, crying hysterically. That night, he is plagued by nightmares of Bleek, Harris and endlessly ringing phones. At the appointed time, he puts on his new clothes and approaches the ship to Cairo, but once he reaches the wharf, he cannot board the ship. He rips up the identification cards, and throws them away, then sadly walks to the FBI building to confess to his crimes.",
    "Director": "Russell Rouse",
    "Writer": "Clarence Greene, Russell Rouse",
    "Actors": "Ray Milland, Martin Gabel, Harry Bronson",
    "Language": "None",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 win & 7 nominations total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0048421",
      "title": "New York Confidential",
      "year": 1955,
      "imdbRating": 7.1,
      "imdbVotes": 1106,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0050526",
      "title": "House of Numbers",
      "year": 1957,
      "imdbRating": 6.4,
      "imdbVotes": 612,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047676",
      "title": "Wicked Woman",
      "year": 1953,
      "imdbRating": 6.7,
      "imdbVotes": 1048,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043397",
      "title": "Chained for Life",
      "year": 1952,
      "imdbRating": 4.3,
      "imdbVotes": 512,
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044357",
      "title": "Angel Face",
      "year": 1952,
      "imdbRating": 7.2,
      "imdbVotes": 9721,
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044789",
      "title": "Kansas City Confidential",
      "year": 1952,
      "imdbRating": 7.3,
      "imdbVotes": 8652,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045124",
      "title": "Scandal Sheet",
      "year": 1952,
      "imdbRating": 7.4,
      "imdbVotes": 3681,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045161",
      "title": "The Sniper",
      "year": 1952,
      "imdbRating": 7.1,
      "imdbVotes": 3994,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045267",
      "title": "The Turning Point",
      "year": 1952,
      "imdbRating": 6.8,
      "imdbVotes": 1862,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044417",
      "title": "Beware, My Lovely",
      "year": 1952,
      "imdbRating": 6.6,
      "imdbVotes": 2410,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044552",
      "title": "Diplomatic Courier",
      "year": 1952,
      "imdbRating": 6.8,
      "imdbVotes": 1459,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044847",
      "title": "Loan Shark",
      "year": 1952,
      "imdbRating": 6.4,
      "imdbVotes": 792,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.204Z"
}