{
  "imdbId": "tt0031179",
  "title": "Convict's Code",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/convicts-code-1939",
      "title": "Convicts Code",
      "description": "On parole after three years in prison, a football player (Robert Kent) encounters the man (Sidney Blackmer) who framed him. Watch on RetroFlix:  https://retroflix.org/convicts-code-1939/",
      "id": "convicts-code-1939"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/convicts_code",
      "title": "Convicts Code",
      "description": "An ex-con is employed by the man who framed him for bank robbery. You can find more information regarding this film on its IMDb page .",
      "id": "convicts_code"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_5Qv0C9Ly3E",
      "title": "Convict's Code (1939) [Drama] [Crime]",
      "description": "Convict's Code is a 1939 American film directed by Lambert Hillyer. The movie (also known as \"Paroled to Exile\") is about a man, who's framed and sent to prison for a crime he didn't commit. When he is let out on limited parole, he sets out to clear his honor and find the real criminals.\n\n---\n\nDirected by Lambert Hillyer, produced by E.B. Derr and Frank Melford, written by John W. Krafft, starring Robert Kent as Dave Tyler, Anne Nagel as Julie Warren, Sidney Blackmer as Gregory Warren, Victor Kilian as Bennett, Norman Willis as Russell, Maude Eburne as Mrs. Magruder, Ben Alexander as Jeff Palmer, Pat Flaherty as Sniffy, Carleton Young as Pete Jennings, Howard C. Hickman as Warden, Joan Barclay as Elaine and Harry Strang as Tom Lynch.\n\n---\n\nSource: \"Convict's Code\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 6 October 2012. Web. 29 May 2013. http://en.wikipedia.org/wiki/Convict%27s_Code.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "_5Qv0C9Ly3E",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2YELtiuDX7E",
      "title": "Convict’s Code (1939) | Colorized Public Domain Crime Drama Classic with Robert Kent & Anne Nage",
      "description": "Convict’s Code (1939) is an American crime drama directed by Lambert Hillyer, a prolific filmmaker known for his work in early Hollywood spanning silent films, B-movies, and Westerns. Produced and distributed by Monogram Pictures, one of the famed “Poverty Row” studios of the era, this fast-paced and gritty picture explores crime, justice, loyalty, and redemption. Now fully restored and colorized by Colorized Public Domain, this film takes on new life for today’s audiences in the United States, Europe, and beyond, offering a vivid reintroduction to a little-known gem from Hollywood’s Golden Age.\n\nPlot Summary:\nRobert Kent stars as Dave Tyler, a promising college football star whose life is derailed when he is wrongly convicted of embezzlement. Sent to prison for a crime he did not commit, Tyler loses not only his freedom but also his reputation, his athletic career, and the trust of those closest to him. Upon his release, he faces the daunting challenge of rebuilding his life in a society that distrusts former convicts.\n\nDetermined to clear his name, Tyler takes a job at a construction company run by the sympathetic Warren Richards (Sidney Blackmer). There, he meets Richards’ daughter, Jerry Richards (Anne Nagel), who slowly grows to believe in his innocence. But as Tyler attempts to live an honest life, his past continues to haunt him. Ruthless gangsters, corrupt business associates, and lingering suspicions threaten to drag him back into trouble.\n\nWith the aid of Jerry’s faith and his own determination, Tyler uncovers the real culprits behind the crime that destroyed his life. His journey becomes not just a fight for personal redemption but also a powerful statement about truth, resilience, and justice in an unforgiving world.\n\nCast and Crew:\n• Director: Lambert Hillyer\n• Writer: Charles Williams (screenplay), based on a story by Norton S. Parker\n• Cinematography: Arthur Martinelli\n• Production: Monogram Pictures\n\nStarring:\n• Robert Kent as Dave Tyler\n• Anne Nagel as Jerry Richards\n• Sidney Blackmer as Warren Richards\n• Victor Kilian as Jenkins\n• Wade Boteler as Coach “Pop” Hanson\n• Pat Flaherty as Joe Kelly\n• Dewey Robinson as Mike\n\nFilm Significance:\nConvict’s Code (1939) captures the raw energy of B-movie crime dramas at the tail end of the 1930s. While produced on a modest budget, the film reflects the social anxieties of its time — issues of corruption, second chances, and the stigma faced by ex-convicts in Depression-era America. Its themes of wrongful conviction and the struggle for redemption echo throughout classic Hollywood cinema, making it a notable entry in the crime-drama genre.\n\nAnne Nagel, known for her appearances in films like Black Friday (1940) and several serials, brings depth to her role as the loyal and compassionate Jerry Richards. Robert Kent delivers a strong leading performance as the embattled hero, balancing toughness with vulnerability. Sidney Blackmer, later famed for his role in Rosemary’s Baby (1968), lends gravitas to the story. Director Lambert Hillyer, whose career spanned nearly 50 years, gives the film a tight pace and efficient storytelling style that were hallmarks of Monogram Pictures productions.\n\nEnhanced Public Domain Explanation:\nConvict’s Code is in the public domain, allowing it to be freely shared, preserved, and studied without copyright restriction. Colorized Public Domain revitalizes this rare gem through digital restoration, enhanced sound, and careful colorization. By doing so, we introduce new audiences to a film that might otherwise remain forgotten in dusty archives. Our mission is to preserve film history while making it vibrant and accessible to viewers across the USA, Europe, and worldwide.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white, Convict’s Code was a product of Monogram’s B-movie crime cycle. While its original monochrome version carries historical authenticity, colorization breathes new energy into the visuals — from the gritty prison sequences to the hopeful moments of redemption, the bustling city streets, and the emotional close-ups of its actors. This enhanced edition highlights details that enrich the storytelling, ensuring modern audiences can connect with the film on a deeper level.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nColorized Public Domain specializes in restoring and colorizing timeless films across genres — from crime dramas to comedies, thrillers, Westerns, and Golden Age Hollywood rarities. Our uploads are designed to preserve film history while appealing to modern tastes, ensuring these cultural treasures remain accessible for generations.\n\n#ConvictsCode #RobertKent #AnneNagel #SidneyBlackmer #PublicDomainMovie #ColorizedClassic #CrimeDrama #FilmRestoration #MonogramPictures #1930sMovies #GoldenAgeHollywood",
      "id": "2YELtiuDX7E",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jJ6waAtyqH8",
      "title": "Convict's Code (1939) ROBERT KENT 🍕ANNE NAGEL 🍕NEW HD RESTORATION",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Robert Kent, Anne Nagel, Sidney Blackmer\nDirector: Lambert Hillyer\n🍕 NEW HD RESTORATION🍕\nThis hard-hitting 1939 crime drama from Monogram Pictures, directed by Lambert Hillyer, dives deep into a world of corruption, false accusations, and one man’s fight to reclaim his life. Starring Robert Kent as a wrongfully convicted ex-athlete, the story follows his release from prison and his determined search to expose the real criminal who set him up.\n\nAnne Nagel co-stars as the loyal and resourceful woman who stands by his side, offering both emotional support and fearless determination. With supporting performances by Sidney Blackmer and Victor Kilian, the film dives deep into themes of justice, betrayal, and redemption. Known for its taut storytelling and low-budget efficiency, the film showcases the no-nonsense style of Monogram Pictures—a studio famed for delivering compelling crime stories during Hollywood’s Poverty Row era.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🎭 Subscribe for more Oscar-winning films, vintage musicals, and Pre-Code Hollywood gems!\n\nWith direction by seasoned filmmaker Lambert Hillyer, known for blending action and suspense, this film remains a prime example of 1930s B-movie noir—brisk, bold, and pulsing with pulp tension. A must-see for fans of vintage crime cinema and underdog tales with a punch.\n\n#ConvictsCode #RobertKent #AnneNagel #LambertHillyer #MonogramPictures #1939Movies #ClassicCrimeFilm #SidneyBlackmer #GoldenAgeHollywood #PovertyRowCinema #VintageCrimeDrama #PizzaFLIX #BMovieClassic",
      "id": "jJ6waAtyqH8",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PPe0a-F5w-A",
      "title": "Convict's Code (1939) Crime, Drama, Film-Noir",
      "description": "A man is framed and sent to prison for a crime he didn't commit. When he is let out on limited parole, he sets out to clear his name and find the real criminals.\n\nDirector: Lambert Hillyer\nWriter: John W. Krafft)\nStars: Robert Kent, Anne Nagel, Sidney Blackmer",
      "id": "PPe0a-F5w-A",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "62 min",
    "imdbRating": "5.4",
    "imdbVotes": "299",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "A man is framed and sent to prison for a crime he didn't commit. When he is let out on limited parole, he sets out to clear his name and find the real criminals.",
    "Director": "Lambert Hillyer",
    "Writer": "John W. Krafft",
    "Actors": "Robert Kent, Anne Nagel, Sidney Blackmer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0030168",
      "title": "Gang Bullets",
      "year": 1938,
      "imdbRating": "5.6",
      "imdbVotes": "231",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032022",
      "title": "They Made Me a Criminal",
      "year": 1939,
      "imdbRating": "6.8",
      "imdbVotes": "2,630",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031232",
      "title": "Disbarred",
      "year": 1939,
      "imdbRating": "6.0",
      "imdbVotes": "49",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031465",
      "title": "I Stole a Million",
      "year": 1939,
      "imdbRating": "6.4",
      "imdbVotes": "120",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031259",
      "title": "Dust Be My Destiny",
      "year": 1939,
      "imdbRating": "6.8",
      "imdbVotes": "1,008",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032508",
      "title": "Gang War",
      "year": 1940,
      "imdbRating": "5.0",
      "imdbVotes": "149",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032257",
      "title": "Black Diamonds",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "33",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032258",
      "title": "Black Friday",
      "year": 1940,
      "imdbRating": "6.3",
      "imdbVotes": "3,077",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030266",
      "title": "Illegal Traffic",
      "year": 1938,
      "imdbRating": "6.1",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030279",
      "title": "Island in the Sky",
      "year": 1938,
      "imdbRating": "6.1",
      "imdbVotes": "183",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032651",
      "title": "Johnny Apollo",
      "year": 1940,
      "imdbRating": "6.9",
      "imdbVotes": "1,566",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030057",
      "title": "The Devil's Party",
      "year": 1938,
      "imdbRating": "5.7",
      "imdbVotes": "308",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:58:31.533Z"
}