{
  "imdbId": "tt0004189",
  "title": "Kid Auto Races at Venice",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kid-auto-races-at-venice-1914",
      "title": "Kid Auto Races At Venice",
      "description": "Kid Auto Races at Venice (also known as The Pest) is a 1914 American film starring Charles Chaplin. It is the first film in which his \"Little Tramp\" character makes an appearance before the public. The first film to be produced that featured the character was actually Mabel's Strange Predicament; it was shot a few days before Kid Auto Races but released two days after it; this film, meanwhile, was released only five days after the first film in which Chaplin appeared, Making a Living. Kid Auto Races was inducted into the National Film Registry by the Library of Congress on December 14, 2020. Watch on RetroFlix.org:  https://retroflix.org/kid-auto-races-at-venice-1914/",
      "id": "kid-auto-races-at-venice-1914"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kid-auto-races-at-venice-1914-directed-by-henry-lehrman",
      "title": "Kid Auto Races At Venice 1914 Directed By Henry Lehrman",
      "description": "Kid Auto Races at Venice (1914) Directeor: Henry Lehrman Kid Auto Races at Venice (also known as The Pest) is a 1914 American film starring Charles Chaplin. It is the first film in which his \"Little Tramp\" character makes an appearance before the public. The first film to be produced that featured the character was actually Mabel's Strange Predicament; it was shot a few days before Kid Auto Races but released two days after it; this film, meanwhile, was released only five days after the first film in which Chaplin appeared, Making a Living. Kid Auto Races was inducted into the National Film Registry by the Library of Congress on December 14, 2020 Plot: Made by Keystone Studios and directed by Henry Lehrman, the movie portrays Chaplin as a spectator at a \"pushcar\" race in Venice, Los Angeles. The film was shot during the Junior Vanderbilt Cup, an actual race with Chaplin and Lehrman improvising gags in front of real-life spectators. The film is presented at first like a genuine newsreel, with Chaplin's attention-seeking spectator getting in the way of the camera, causing great frustration to the cameraman. Lehrman begins by roughly pushing an obnoxiously persistent Chaplin away, but eventually he starts knocking Chaplin to the ground. Unusually, the camera breaks the fourth wall to show a second camera filming (as though it were the first) in order to better explain the joke. At this stage, Chaplin gets in the way only of the visible camera on screen, not the actual filming camera. In this way, the filming camera takes on a spectator's viewpoint, and Kid Auto Races becomes one of the first public films to show a movie camera and cameraman in operation. Reviews: In the year that the film was released, a reviewer from the silent movie periodical Bioscope wrote, \"Some sensational happenings are witnessed during the contests between the baby cars, while the funny man persistently obstructs the eager cameramen in their operations.\" A reviewer from the silent movie periodical The Cinema noted, \"Kid Auto Races struck us as about the funniest film we have ever seen. When we subsequently saw Chaplin in more ambitious efforts, our opinion that the Keystone Company had made the capture of their career was strengthened. Chaplin is a born screen comedian; he does things we have never seen done on the screen before.\" Junior Vanderbilt Cup: By 1914, the Vanderbilt Cup had become an important automobile racing event in the United States, and the 1914 event was to be held in Santa Monica, California. The city decided to sponsor a junior version of the event, with several classes, zero-cylinder pushcars, one-cylinder engines, two-cylinder engines, and with age limits for the drivers. Some classes had no engines and used a ramp to accelerate the cars in a manner similar to soap box derby races. Other classes used small engines. Chaplin's movie includes one scene shot at the bottom of the ramp used for the engineless races. There is no evidence that Junior Vanderbilt Cups were held either before or after the 1914 event. Actual silver cups were awarded. -From Wikipedia",
      "id": "kid-auto-races-at-venice-1914-directed-by-henry-lehrman"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-kid-auto-races-at-venice",
      "title": "Kid Auto Races at Venice",
      "id": "silent-kid-auto-races-at-venice"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "11 min",
    "imdbRating": "5.7",
    "imdbVotes": "3,506",
    "Genre": "Short, Comedy",
    "Plot": "Charlie, dressed as a tramp for the first time, goes to a baby-cart race in Venice, California. He causes a great deal of trouble and confusion, both on off the track (getting in the way of the cameraman) and on (interfering with the race). He succeeds in irritating both the participants and the public.",
    "Director": "Henry Lehrman",
    "Writer": "Henry Lehrman, Charles Chaplin",
    "Actors": "Charles Chaplin, Henry Lehrman, Gordon Griffith",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0003679",
      "title": "Between Showers",
      "year": 1914,
      "imdbRating": "5.4",
      "imdbVotes": "1,857",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004288",
      "title": "Making a Living",
      "year": 1914,
      "imdbRating": "5.5",
      "imdbVotes": "2,352",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002659",
      "title": "Bangville Police",
      "year": 1913,
      "imdbRating": "5.3",
      "imdbVotes": "825",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003758",
      "title": "Caught in a Cabaret",
      "year": 1914,
      "imdbRating": "5.7",
      "imdbVotes": "1,537",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003805",
      "title": "Cruel, Cruel Love",
      "year": 1914,
      "imdbRating": "5.3",
      "imdbVotes": "1,477",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004736",
      "title": "Twenty Minutes of Love",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "1,471",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003733",
      "title": "A Busy Day",
      "year": 1914,
      "imdbRating": "4.7",
      "imdbVotes": "1,288",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003934",
      "title": "The Fatal Mallet",
      "year": 1914,
      "imdbRating": "5.4",
      "imdbVotes": "1,115",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004194",
      "title": "The Knockout",
      "year": 1914,
      "imdbRating": "5.7",
      "imdbVotes": "1,529",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004280",
      "title": "Mabel's Busy Day",
      "year": 1914,
      "imdbRating": "5.4",
      "imdbVotes": "1,081",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003923",
      "title": "The Face on the Barroom Floor",
      "year": 1914,
      "imdbRating": "5.2",
      "imdbVotes": "1,215",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004311",
      "title": "The Masquerader",
      "year": 1914,
      "imdbRating": "5.9",
      "imdbVotes": "1,564",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:20:32.102Z"
}