{
  "movieId": "tt0023319",
  "title": "A Parisian Romance",
  "year": 1932,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QdovoRbslM4",
      "id": "QdovoRbslM4",
      "title": "A Parisian Romance (1932) PRE-CODE HOLLYWOOD",
      "description": "Stars: Lew Cody, Gilbert Roland, Marion Shilling\nDirector: Chester M. Franklin\n\nIn this naughty Pre-Code Comedy, an aging playboy clashes with a young artist over the concept of love and the heart of his beautiful fiancé.",
      "addedAt": "2025-12-26T23:43:57.341Z",
      "thumbnail": "https://i.ytimg.com/vi/QdovoRbslM4/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLAL3oGBgWUns3CPBy_GAvmW0azhRA",
      "duration": 4524,
      "language": "en",
      "year": 1932,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "77 min",
    "imdbRating": 5.6,
    "imdbVotes": 63,
    "Genre": "Drama, Romance",
    "Plot": "When starving artist Victor's car breaks down on a dusty road outside of Paris, his fiancée Claudette accepts a ride from the middle-aged wealthy Baron, a notorious womanizer. Victor is furious, but innocent Claudette is charmed by the Baron's generosity. Claudette attends one of the Baron's parties, where young women form liaisons with wealthy older gentlemen. Aware of the Baron's reputation, Victor bursts in on the party intent on rescuing Claudette and strikes the Baron. Claudette leaves with Victor, but later returns to apologize for his behavior. In the meantime, the Baron has fallen in love with Claudette. He attempts to seduce her but feels protective of her virtue and sends her away. To please Claudette, the Baron buys Victor's paintings, but uses the name Jones. Victor eventually discovers the ruse and knocks the Baron unconscious. While Victor is in prison for assault, Claudette nurses the Baron back to health and renounces her love for Victor. The Baron refuses to press charges against Victor because Claudette has accepted his marriage proposal. Victor follows Claudette to her new country home, a wedding present from the Baron, and they rekindle their love. The Baron overhears them, and asks Claudette to release him from his vow of marriage, thereby sacrificing his own happiness for hers. In the end, the Baron selects a key to the room of one of his many paramours and announces that he is \"back in circulation.\"",
    "Director": "Chester M. Franklin",
    "Writer": "F. Hugh Herbert, Octave Feuillet",
    "Actors": "Lew Cody, Marion Shilling, Gilbert Roland",
    "Language": "French, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023512",
    "tt0023742",
    "tt0024059",
    "tt0022879",
    "tt0023537",
    "tt0022628",
    "tt0022662",
    "tt0022689",
    "tt0022989",
    "tt0023025",
    "tt0023030",
    "tt0023128"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:29:46.790Z"
}