{
  "imdbId": "tt0023694",
  "title": "White Zombie",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/VictorHalperinsWhiteZombie1932",
      "title": "White Zombie",
      "description": "\"With These Zombie Eyes he rendered her powerless - With This Zombie Grip he made her perform his every desire!\" This is a slightly clearer print that the ones already available on the Internet Archive. Copyright Status: PUBLIC DOMAIN Registered for copyright in 1932 WHITE ZOMBIE. Presented by Amusement Securities Corporation. 1932. 8 reels. Credits: Producer, Edward Halperin; director, Victor Halperin; story and dialogue,Garnett Weston. © United Artists Corp.; 1Aug32; LP3357. NO RENEWALS FOUND",
      "fileSize": 923368007,
      "id": "VictorHalperinsWhiteZombie1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WhiteZombie",
      "title": "White Zombie",
      "description": "From IMDb : A young man turns to a witch doctor to lure the woman he loves away from her fiance, but instead turns her into a zombie slave. Hopefully you will find the sound quality better on this one.",
      "fileSize": 2801006359,
      "id": "WhiteZombie"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WhiteZombie1932",
      "title": "White Zombie (1932)",
      "description": "White Zombie is often described as being the first ever zombie movie. It is about a young couple who go to visit an acquaintance who lives in Haiti. Unfortunately the the girl is so attractive that she turns the head of a local Voodoo master, played by Bela Lugosi, who wants her for himself, so he turns her into a zombie. You can learn more about White Zombie at A Passion for Horror .",
      "fileSize": 1294343767,
      "id": "WhiteZombie1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WhiteZombie720p1932",
      "title": "White Zombie",
      "description": "Title: White Zombie Summary: A young man turns to a witch doctor to lure the woman he loves away from her fiancé, but instead turns her into a zombie slave. Directed by: Victor Halperin Actors: Bela Lugosi, Madge Bellamy, Joseph Cawthorn Production Company: Victor & Edward Halperin Productions Release Date: 4 August 1932 (USA) Aspect Ratio: 1.37 : 1 Young couple Madeleine and Neil are coaxed by acquaintance Monsieur Beaumont to get married on his Haitian plantation. Beaumont's motives are purely selfish as he makes every attempt to convince the beautiful young girl to run away with him. For help Beaumont turns to the devious Legendre, a man who runs his mill by mind controlling people he has turned into zombies. After Beaumont uses Legendre's zombie potion on Madeleine, he is dissatisfied with her emotionless being and wants her to be changed back. Legendre has no intention of doing this and he drugs Beaumont as well to add to his zombie collection. Meanwhile, grieving 'widower' Neil is convinced by a local priest that Madeleine may still be alive and he seeks her out.",
      "fileSize": 889402757,
      "id": "WhiteZombie720p1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WhiteZombie_201509",
      "title": "White Zombie",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 923409936,
      "id": "WhiteZombie_201509"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/White_Zombie_1932",
      "title": "White Zombie",
      "description": "No more uploads I was very satisfied with FTP uploading at archive.org. I was able to see exactly how much of the upload had been completed. I was able to see the rate at which the upload was progressing. And, perhaps most important of all, I was able to resume an interrupted upload. In other words, if I had uploaded 90% of a file when the connection was lost, all I had to do was reconnect and upload the remaining 10%. The programmers at archive.org have eliminated the best way of uploading, uploading via FTP. They have decided to force everyone to use an inferior, cruder method. The programmers at archive.org want you to be completely dependent upon and at the mercy of Adobe Corporation; in other words, they want you to use the Flash uploader. When using the Flash uploader, there is a progress indicator that gives only a very rough idea of how much of the file has been uploaded. There is nothing to indicate the rate at which the upload is progressing. There is no way to resume an interrupted upload. The Flash uploader is much more primitive than uploading by FTP. When attempting to use the non-flash uploader, this message appears: \"Unfortunately we do not have upload progress feedback while files transfer during this (non-flash) method.\" And, of course, there is no way to resume an interrupted upload. Unbelievably crude. But the incompetent programmers at archive.org will probably tell you that the non-FTP methods of uploading are \"way kewl\" and have lots of nifty blinking lights. When the programmers at archive.org removed the best way of uploading, they didn't make it easier to upload. They made it harder. They probably resented that the best way made their ways seem so clunky by comparison. And they felt that they needed to make it appear that they were earning their paychecks by making some sort of an \"improvement\". It seems that they have no interest in making things easier for contributors to archive.org and that they are only interested in making things easier for themselves. I have uploaded over 200 videos (feature films and television shows) to archive.org. Since the programmers at archive.org have used their time to sabotage FTP uploading, I will be unable to upload any more videos. Smaller than the other available downloads, but still high quality.",
      "fileSize": 1508001068,
      "id": "White_Zombie_1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/White_Zombie_ACM",
      "title": "White Zombie",
      "description": "A young man turns to a witch doctor to lure the woman he loves away from her fiance, but instead turns her into a zombie slave.",
      "fileSize": 1324547133,
      "id": "White_Zombie_ACM"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vd88ogGoBmk",
      "title": "White Zombie (1932) [Horror]",
      "description": "\"White Zombie\" is a 1932 American independent Pre-Code horror film directed and produced by brothers Victor Halperin and Edward Halperin, respectively. The screenplay by Garnett Weston tells the story of a young woman's transformation into a zombie at the hands of an evil voodoo master. Béla Lugosi stars as the antagonist, Murder Legendre, with Madge Bellamy appearing as his victim. Other cast members included Robert W. Frazer, John Harron and Joseph Cawthorn.\n\nLarge portions of the White Zombie were shot on the Universal Studios lot, borrowing many props and scenery from other horror films of the era. White Zombie opened in New York to negative reception, with reviewers criticizing the film's over-the-top story and weak acting performances. While the film made a substantial financial profit as an independent feature, it proved to be less popular at the box office than other horror films of the time.\n\nWhite Zombie is considered the first feature length zombie film. A sequel to the film, titled Revolt of the Zombies, opened in 1936. Modern reception to White Zombie has been more positive than its initial release. Some critics have praised the atmosphere of the film, comparing it to the 1940s horror film productions of Val Lewton, while others still have an unfavorable opinion on the quality of the acting.\n\n---\n\nDirected by Victor Halperin, produced by Edward Halperin, written by Garnett Weston, starring Béla Lugosi, Madge Bellamy, Joseph Cawthorn, John Harron and Robert Frazer.\n\n---\n\nSource: \"White Zombie (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 July 2012. Web. 14 July 2012. http://en.wikipedia.org/wiki/White_Zombie_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "vd88ogGoBmk",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/white-zombie-1932-colorized",
      "title": "White Zombie (1932) Colorized",
      "description": "White Zombie (1932) Colorized",
      "fileSize": 633306009,
      "id": "white-zombie-1932-colorized"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/white-zombie-1932_202506",
      "title": "White Zombie (1932)",
      "description": "In Haiti, a wealthy landowner convinces a sorcerer to lure the American woman he has fallen for away from her fiance, only to have the madman decide to keep the woman for himself, as a zombie. Watch on RetroFlix:  https://retroflix.org/white-zombie-1932/",
      "fileSize": 409921828,
      "id": "white-zombie-1932_202506"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/white-zombie_1932",
      "title": "White Zombie",
      "description": "https://web.archive.org/web/20230318091343/https://en.wikipedia.org/wiki/White_Zombie_%28film%29",
      "fileSize": 4536150724,
      "id": "white-zombie_1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/white.zombie.1932",
      "title": "White Zombie (1932)",
      "description": "\"White Zombie\" is a 1932 horror film directed by Victor Halperin, often regarded as the first feature-length zombie movie. It is a horror film set in Haiti, focusing on a young woman named Madeleine who is transformed into a zombie by an evil voodoo master named \"Murder\" Legendre, played by Bela Lugosi. The story follows her fiancé, Neil Parker, as he seeks to rescue her from this fate. The film explores themes of love, betrayal, and the supernatural.",
      "fileSize": 3715276506,
      "id": "white.zombie.1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/white_zombie",
      "title": "White Zombie",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4066208221,
      "id": "white_zombie"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ccyf43Ug_CA",
      "title": "White Zombie (1932) BELA LUGOSI",
      "description": "Stars: Bela Lugosi, Madge Bellamy, Joseph Cawthorn\nDirector: Victor Halperin\n\nIn this Pre-Code Horror masterpiece, a young man seeks the help of a witch doctor to lure the woman he loves away from her fiancee, but the doctor turns her into a zombie slave.",
      "id": "ccyf43Ug_CA",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NV3B2z0HkKA",
      "title": "White Zombie (1932) Bela Lugosi | Classic Horror Movie Full Length",
      "description": "A young man turns to a witch doctor to lure the woman he loves away from her fiancé, but instead turns her into a zombie slave. \n\nDirector: Victor Halperin \nWriters: Garnett Weston, Garnett Weston \nStars: Bela Lugosi, Madge Bellamy, Joseph Cawthorn\nGenre:  Classics, Cult Film, Crime, Horror, Sci-Fi \nBudget: $50,000\n\nJoin the CCC crew before the zombie apocalypse  :\nhttps://www.facebook.com/CultCinemaClassics\nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclasics",
      "id": "NV3B2z0HkKA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "69 min",
    "imdbRating": 6.2,
    "imdbVotes": 11929,
    "Genre": "Horror",
    "Plot": "Young couple Madeleine and Neil are coaxed by acquaintance Monsieur Beaumont to get married on his Haitian plantation. Beaumont's motives are purely selfish as he makes every attempt to convince the beautiful young girl to run away with him. For help Beaumont turns to the devious Legendre, a man who runs his mill by mind controlling people he has turned into zombies. After Beaumont uses Legendre's zombie potion on Madeleine, he is dissatisfied with her emotionless being and wants her to be changed back. Legendre has no intention of doing this and he drugs Beaumont as well to add to his zombie collection. Meanwhile, grieving 'widower' Neil is convinced by a local priest that Madeleine may still be alive and he seeks her out.",
    "Director": "Victor Halperin",
    "Writer": "Garnett Weston, William B. Seabrook",
    "Actors": "Bela Lugosi, Madge Bellamy, Joseph Cawthorn",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0024631",
      "title": "Supernatural",
      "year": 1933,
      "imdbRating": 6.2,
      "imdbVotes": 1023,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028174",
      "title": "Revolt of the Zombies",
      "year": 1936,
      "imdbRating": 3.4,
      "imdbVotes": 1925,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032047",
      "title": "Torture Ship",
      "year": 1939,
      "imdbRating": 3.5,
      "imdbVotes": 477,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024188",
      "title": "Island of Lost Souls",
      "year": 1932,
      "imdbRating": 7.4,
      "imdbVotes": 11432,
      "language": "English, Cantonese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023249",
      "title": "Murders in the Rue Morgue",
      "year": 1932,
      "imdbRating": 6.3,
      "imdbVotes": 5472,
      "language": "English, Danish, German, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024382",
      "title": "Night of Terror",
      "year": 1933,
      "imdbRating": 5.5,
      "imdbVotes": 814,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021814",
      "title": "Dracula",
      "year": 1931,
      "imdbRating": 7.3,
      "imdbVotes": 62918,
      "language": "English, Hungarian, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024894",
      "title": "The Black Cat",
      "year": 1934,
      "imdbRating": 6.9,
      "imdbVotes": 13937,
      "language": "English, Latin, Hungarian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021239",
      "title": "Party Girl",
      "year": 1930,
      "imdbRating": 5.1,
      "imdbVotes": 320,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023247",
      "title": "Murder at Dawn",
      "year": 1932,
      "imdbRating": 4.3,
      "imdbVotes": 181,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023238",
      "title": "The Most Dangerous Game",
      "year": 1932,
      "imdbRating": 7.1,
      "imdbVotes": 14392,
      "language": "English, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023236",
      "title": "The Monster Walks",
      "year": 1932,
      "imdbRating": 4.1,
      "imdbVotes": 1126,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}