{
  "imdbId": "tt0026118",
  "title": "Bird Scouts",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bird-scouts-1935",
      "id": "bird-scouts-1935",
      "title": "Bird Scouts (1935)",
      "description": "Bird Scouts is a Rainbow Parade cartoon directed by Burt Gillett, Tom Palmer. Watch on RetroFlix:  https://retroflix.org/bird-scouts-1935/",
      "fileSize": 60438205,
      "addedAt": "2026-01-07T00:07:38.717Z",
      "thumbnail": "https://archive.org/services/img/bird-scouts-1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 56
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.1,
    "imdbVotes": 31,
    "Genre": "Animation, Short, Family",
    "Plot": "Van Beuren cartoons are extremely variable, especially in the number of gags and whether the absurdist humour shines through enough (sometimes it does, other times it doesn't), but are strangely interesting. Although they are often poorly animated with barely existent stories and less than compelling lead characters, they are also often outstandingly scored, there can be some fun support characters and some are well-timed and amusing.'Bird Scouts' is not one of the worst of the \"Rainbow Parade\" cartoons by all means, and Van Beuren certainly have far worse overall in their oeuvre. It is a pretty mediocre cartoon however, with all the same strengths and faults of the \"Rainbow Parade\" series apparent. As indicated, it's far from unwatchable and has things to redeem it, but not much to it.Saw it really as somebody who is trying to see as many Van Beuren cartoons as possible, so that is pretty much the main reason to see it.There are strengths certainly. Quite liked the animation, which has come on a lot since (human) Tom and Jerry and Cubby the Bear. Despite the character drawing lacking refinement and some garishness which does give off a primitive feel, the colours appeal generally to the eye while the backgrounds are elaborate and meticulous. Even better is the music score, it is so beautifully and cleverly orchestrated, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Some neat synchronisation here and there and some sweetness and charm. At least the characters didn't irritate me too.Unfortunately, there is a good deal wrong. The content is pretty thin, not much to it, and not only are there not enough gags as such but any absurdist humour or surrealism present in some of Van Beuren's earlier work is completely absent. The cartoon is too saccharine and very cutesy in characterisation, some of the sugar excessive.While not irritating, the characters are bland and not with a whole lot of personality. The story is non-existent with little in terms of events and conflict to be engaged by, and the pace never really comes to life.Overall, mediocre but an okay one-time watch. 4/10 Bethany Cox",
    "Director": "Burt Gillett, Tom Palmer",
    "Writer": "Alex Lovy",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0152309",
    "tt0026726",
    "tt0151610",
    "tt0151609",
    "tt0026851",
    "tt0151910",
    "tt0152130",
    "tt0152560",
    "tt0150996",
    "tt0151608",
    "tt0151909",
    "tt0027123"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.717Z"
}