{
  "imdbId": "tt0055892",
  "title": "David and Lisa",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dal435345435456",
      "id": "dal435345435456",
      "title": "David and Lisa",
      "description": "Title: David and Lisa Summary: The emotional story of a young man in a mental institution for teens who begins to understand his psychosis in the environment of others with mental and emotional problems. He finds ... Directed by: Frank Perry Actors: Keir Dullea, Janet Margolin, Howard Da Silva Production Company: Lisa and David Company Release Date: 9 September 1963 (Sweden) Aspect Ratio: 1.78 : 1 The emotional story of a young man in a mental institution for teens who begins to understand his psychosis in the environment of others with mental and emotional problems. He finds intimacy with Lisa, a young woman suffering from dissociative identity disorder.",
      "fileSize": 812403095,
      "addedAt": "2026-01-07T00:07:51.627Z",
      "thumbnail": "https://archive.org/services/img/dal435345435456",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 1556
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/david-and-lisa-1962-colorized",
      "id": "david-and-lisa-1962-colorized",
      "title": "David And Lisa (1962) Colorized",
      "description": "\"David and Lisa\" from 1962, directed by Frank Perry and produced by his wife Eleanor Perry, who also adapted the screenplay from Theodore Isaac Rubin’s novel Jordi, is a hauntingly intimate, low-budget but quite effective psychological drama that explores adolescent mental illness with rare sensitivity and restraint. The film follows David Clemens (Keir Dullea), a highly intelligent but emotionally repressed young man tormented by an obsessive fear of human touch and death, who is sent to a private psychiatric school where he meets Lisa Brandt (Janet Margolin), a fellow patient with a split personality, one shy and childlike, the other poetic and free. Their tentative friendship and mutual understanding become a form of emotional therapy that transcends conventional treatment, offering moments of painful beauty and hope. A landmark of early 1960's independent cinema, the film earned critical acclaim, multiple Oscar nominations, and helped open American films to more nuanced depictions of mental health and human vulnerability. Dullea and Margolin give remarkably subtle but splendid performances, their obvious chemistry conveying complex emotions with quiet authenticity, while Howard Da Silva brings authoritative presence as Dr. Swinford, grounding the story in the realism of the institution. Perry’s restrained direction (Oscar nominated for best director), and Eleanor Perry’s insightful screenplay allow the characters’ inner worlds to resonate fully. Made on a modest budget of around $153,000, the production used real psychiatric facilities to enhance its realism, and it launched Keir Dullea’s career, setting the stage for his iconic role in 2001: A Space Odyssey a few years later. Its enduring power lies in the tender humanity, the compassionate portrayal of young minds in turmoil, and the quiet, unforgettable performances that make it a work worth revisiting. Even decades later, it remains a moving and thought-provoking study of love, healing, and the complexity of the human heart, and mind.",
      "fileSize": 3294037239,
      "addedAt": "2026-01-07T00:07:59.603Z",
      "thumbnail": "https://archive.org/services/img/david-and-lisa-1962-colorized",
      "collection": "feature_films",
      "downloads": 1208
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hCa3yTo8hPY",
      "id": "hCa3yTo8hPY",
      "title": "David and Lisa (1962) starring Keir Dullea | A Story from Inside the Psych Ward",
      "description": "A reclusive, obsessive-compulsive, touch-averse teenager forms a deep, transformative bond with a young woman struggling with dissociative tendencies while they navigate life in a psychiatric facility.\n\nDavid and Lisa is a 1962 American drama film directed by Frank Perry. It is based on the novellas; \"Jordi/Lisa and David\" by Theodore Isaac Rubin.\n\nMain actors:\nKeir Dullea - David Clemens\nJanet Margolin - Lisa Brand\nHoward Da Silva - Dr. Swinford\nNeva Patterson - Mrs. Clemens (David’s mother)\nRichard McMurray - Mr. Clemens (David’s father)\nClifton James - John\nNancy Nutter - Maureen\nMathew Anden - Simon\n\nBlack & White version: https://youtu.be/ouBOPU7E2A0\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:32:36.897Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/hCa3yTo8hPY/maxresdefault.webp?v=678f6178",
      "duration": 5473,
      "language": "en",
      "year": 1962,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "95 min",
    "imdbRating": 7.2,
    "imdbVotes": 3439,
    "Genre": "Drama",
    "Plot": "The emotional story of a young man in a mental institution for teens who begins to understand his psychosis in the environment of others with mental and emotional problems. He finds intimacy with Lisa, a young woman suffering from dissociative identity disorder.",
    "Director": "Frank Perry",
    "Writer": "Eleanor Perry, Theodore Isaac Rubin",
    "Actors": "Keir Dullea, Janet Margolin, Howard Da Silva",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 2 Oscars. 6 wins & 7 nominations total"
  },
  "relatedMovies": [
    "tt0067003",
    "tt0199145",
    "tt0054803",
    "tt0057105",
    "tt0055974",
    "tt0055019",
    "tt0182253",
    "tt0055478",
    "tt0056696",
    "tt0054807",
    "tt0056211",
    "tt0183884"
  ],
  "collections": [
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.603Z"
}