{
  "imdbId": "tt0009316",
  "title": "Look Pleasant, Please",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/look-pleasant-please-1918-directed-by-alfred-j.-goulding",
      "title": "Look Pleasant Please 1918 Directed By Alfred J. Goulding",
      "description": "Look Pleasant, Please Directed by Alfred J. Goulding Written by H.M. Walker Produced by Hal Roach Starring Harold Lloyd Cinematography Walter Lundin Production company Rolin Films Distributed by Pathé Exchange Release date March 10, 1918 Running time 1 reel Country United States Language Silent (English intertitles ) Look Pleasant, Please is a 1918 American short comedy film featuring Harold Lloyd . A print of the film is held by the Museum of Modern Art . [ 1 ] Plot Bebe is one of a group of females who go to a photographer's studio to have their pictures taken. The amorous photographer has \"frolicky fingers\". When he gets too friendly with Bebe, she telephones her husband who vows to come to the studio to murder the photographer. Shortly afterward, Harold, a dishonest greengrocer, is pursued by a group of policemen. During his flight from them, he happens to enter the photographer's studio. Initially the photographer mistakes Harold for Bebe's irate husband. When he realizes that Harold is harmless, the photographer tells Harold he can have the run of the studio—in the hopes that Bebe's husband will think that Harold is the photographer. Harold attempts to photograph an old woman, a group of three drunkards and a pretty chorus girl before the jealous husband arrives. A large scuffle ensues. Eventually the husband is arrested and Harold and Bebe are photographed together. Cast Harold Lloyd Snub Pollard Bebe Daniels William Blaisdell Sammy Brooks Lige Conley (credited as Lige Cromley) Billy Fay William Gillespie Lew Harvey Gus Leonard James Parrott Dorothea Wolbert Reception Like many American films of the time, Look Pleasant, Please was subject to cuts by city and state film censorship boards . For example, the Chicago Board of Censors cut the man lying on the floor looking at the young woman's legs and sticking a man with a hairpin and the vulgar actions following. [ 2 ] References 1 Progressive Silent Film List: Look Pleasant, Please at silentera.com 2 \"Official Cut-Outs by the Chicago Board of Censors\" . Exhibitors Herald . 6 (16). New York City: Exhibitors Herald Company: 31. April 13, 1918. From Wikipedia, the free encyclopedia",
      "id": "look-pleasant-please-1918-directed-by-alfred-j.-goulding"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbRating": "6.4",
    "imdbVotes": "240",
    "Genre": "Comedy, Short",
    "Plot": "Two business owners are facing problems. A Lothario of a photographer has been threatened over the telephone by a jealous husband for hitting on his wife, one of his photography clients. An unscrupulous greengrocer is being pursued by the police for his exorbitant prices. The two business owners, unaware of the other's problem, meet by chance, the photographer who offers the management of his business to the greengrocer in hopes that the jealous husband will mistake his new manager as the one who hit on his wife. The greengrocer uses his unique artistic sensibility on the clients who wander through the photography studio. But when the jealous husband with his wife in tow arrive, the confusion that arises, only exacerbated by the addition of a window cleaner, leads to a happily ever after for the two that emerge in tact from the confusion.",
    "Director": "Alfred J. Goulding",
    "Writer": "H.M. Walker",
    "Actors": "Harold Lloyd, 'Snub' Pollard, Bebe Daniels",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0009099",
      "title": "A Gasoline Wedding",
      "year": 1918,
      "imdbRating": "6.4",
      "imdbVotes": "246",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009071",
      "title": "Fireman Save My Child",
      "year": 1918,
      "imdbRating": "5.5",
      "imdbVotes": "97",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009082",
      "title": "Follow the Crowd",
      "year": 1918,
      "imdbRating": "5.9",
      "imdbVotes": "50",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009171",
      "title": "Hey There",
      "year": 1918,
      "imdbRating": "6.2",
      "imdbVotes": "182",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009678",
      "title": "Take a Chance",
      "year": 1918,
      "imdbRating": "6.5",
      "imdbVotes": "615",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009631",
      "title": "Somewhere in Turkey",
      "year": 1918,
      "imdbRating": "4.2",
      "imdbVotes": "57",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009732",
      "title": "Two-Gun Gussie",
      "year": 1918,
      "imdbRating": "5.6",
      "imdbVotes": "320",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007709",
      "title": "Bliss",
      "year": 1917,
      "imdbRating": "5.4",
      "imdbVotes": "162",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007764",
      "title": "By the Sad Sea Waves",
      "year": 1917,
      "imdbRating": "6.1",
      "imdbVotes": "395",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010023",
      "title": "Count Your Change",
      "year": 1919,
      "imdbRating": "5.4",
      "imdbVotes": "68",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007686",
      "title": "Bashful",
      "year": 1917,
      "imdbRating": "6.5",
      "imdbVotes": "285",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010516",
      "title": "Off the Trolley",
      "year": 1919,
      "imdbRating": "6.5",
      "imdbVotes": "76",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T06:59:12.576Z"
}