{
  "imdbId": "tt0001407",
  "title": "Sunshine Sue",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/preview-Sunshine-Sue-1910",
      "id": "preview-Sunshine-Sue-1910",
      "title": "\"Sunshine Sue\" (1910) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Sunshine Sue\" is a short drama directed by D.W. Griffith.  The film is included in our program to illustrate the work of two of our stars: actor Robert Harron and cinematographer Billy Bitzer. A country girl follows a city suitor, but is left alone and must fend for herself. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Marion Sunshine, W. Chrystie Miller, Edward Dillon, Charles West, Robert Harron Distributed by                   Biograph Company Release date                      Novermber 17, 1910 Country                             United States Running time                    12 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 14608767,
      "addedAt": "2026-01-07T00:10:21.539Z",
      "thumbnail": "https://archive.org/services/img/preview-Sunshine-Sue-1910",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 1143
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.9,
    "imdbVotes": 21,
    "Genre": "Drama, Short",
    "Plot": "Sue is the sunshine of the old home; ever smiling, singing and lifting the burden from the shoulders of her parents in their declining years. She is beloved by Tom, an honest country lad, who is at a loss to know how to evince it, she too carefree to understand. He was content to sit for hours and listen to her sing and play the old songs on the parlor organ. Fate seemed to be taking good care of affairs, until one day a summer boarder pays the homestead a visit. Good looking, easy of manner and the owner of an automobile, Sue feels quite elated when he pays her some attention. She readily consents to taking a ride with him, which meets the approval of her parents, who look upon the young man as highly reputable. Ah! Here is the time-honored trick of fate; the playing with fire, so often the beginning of the end. Some miles away from the village, the auto becomes conveniently disabled, and as it is assumed it will be some time before it is righted, the young man suggests that they go to the roadhouse nearby for rest and refreshments. So well entertained is she that the time flies swiftly and when she suggests returning home she is made to believe that it is too late to return home that night. Stunned at first by this intelligence, she awakens to the full realization of the situation and excluding the young man from the room, she passes the night alone in dreadful anxiety, for she imagines the disquietude her dear old folks are suffering. And rightly, too, for at dawn we see her poor old father with faithful Tom, after an all-night vigil at the front gate sorrowfully dragging himself up to the cottage door. The young man returns to Sue in the morning and persuades her to go with him to the city, promising to marry her upon arrival. To this she consents and he installs her in a furnished room while he ostensibly goes to make arrangements for their marriage. While he is away she writes this news to her father. But, alas, the poor girl is later made to appreciate the cruel truth of the situation when the young man pretends his father objects to his marrying just at present. He, of course, reasons that she has gone too far to turn back, in fact, she fully realizes her awful predicament, for she knows how the world will regard her apparent indiscretion, so ashamed to return home, she seeks employment. In this direction she meets with the indignities often afforded the innocent by those human vultures who call themselves men. Her experience is enough to convince her of the falseness of the world she would enter, so back home she goes the same day to be received with open arms by her dear old daddy, whose searching gaze she has met with a smile.",
    "Director": "D.W. Griffith",
    "Writer": "Wilfred Lucas",
    "Actors": "Marion Sunshine, W. Chrystie Miller, Clara T. Bracy",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001733",
    "tt0001326",
    "tt0001315",
    "tt0001340",
    "tt0001388",
    "tt0001284",
    "tt0001227",
    "tt0001351",
    "tt0001510",
    "tt0000800",
    "tt0001973",
    "tt0002381"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.539Z"
}