{
  "movieId": "tt0028125",
  "title": "Porky's Moving Day",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/porkys-moving-day-1936",
      "id": "porkys-moving-day-1936",
      "title": "Porky's Moving Day (1936)",
      "description": "A woman's house, on the side of the cliff, is about to fall into the sea, due to waves washing away the cliff. In a panic, she call's Porky's moving company. Porky's assistant, a former boxer, starts swinging when he hears a bell until hit on the head, when he stops and says, \"Okay, boss.\" Porky's van is pulled by an ostrich. They get to the house and have various adventures while moving the furniture, mostly because the entire house keeps tilting back and forth on the shaky ground. Finally, a big wave washes most of the house's contents into the van. This is a Computer Colorized version from 1992.",
      "fileSize": 786704896,
      "addedAt": "2026-01-07T00:10:21.538Z",
      "thumbnail": "https://archive.org/services/img/porkys-moving-day-1936",
      "language": "eng",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 232
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.7,
    "imdbVotes": 129,
    "Genre": "Animation, Family, Short",
    "Plot": "A woman's house, on the side of the cliff, is about to fall into the sea, due to waves washing away the cliff. In a panic, she call's Porky's moving company. Porky's assistant, a former boxer, starts swinging when he hears a bell until hit on the head, when he stops and says, \"Okay, boss.\" Porky's van is pulled by an ostrich. They get to the house and have various adventures while moving the furniture, mostly because the entire house keeps tilting back and forth on the shaky ground. Finally, a big wave washes most of the house's contents into the van.",
    "Director": "Jack King",
    "Writer": "Melvin Millar",
    "Actors": "Elvia Allman, Joe Dougherty, Joe Twerp",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027622",
    "tt0028126",
    "tt0028245",
    "tt0026481",
    "tt0026182",
    "tt0024928",
    "tt0027381",
    "tt0028492",
    "tt0029432",
    "tt0028100",
    "tt0027280",
    "tt0027891"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.538Z"
}