{
  "movieId": "tt0030033",
  "title": "The Daffy Doc",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-daffy-doc-1938",
      "id": "the-daffy-doc-1938",
      "title": "The Daffy Doc (1938)",
      "description": "Doctor Quack is doing an operation, and Daffy is his assistant. Things start out sedately enough, with Daffy asking for quiet in various ways. Then the operation starts, and after handing over instruments at an ever-increasing pace, Daffy loses it and is ejected. He gets his head stuck in an iron lung, and feels the effects for a while. Daffy goes in search of a patient of his own, and Porky happens to walk by in time to fall victim to Daffy's mallet. Daffy hits himself on the head and has a consultation with the second and third image of himself. They agree to operate; Daffy chases Porky, and they both get stuck in the iron lung.",
      "fileSize": 836790556,
      "addedAt": "2026-01-07T00:11:57.683Z",
      "thumbnail": "https://archive.org/services/img/the-daffy-doc-1938",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 327
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 6.9,
    "imdbVotes": 606,
    "Genre": "Family, Animation, Short",
    "Plot": "Doctor Quack is doing an operation, and Daffy is his assistant. Things start out sedately enough, with Daffy asking for quiet in various ways. Then the operation starts, and after handing over instruments at a ever-increasing pace, Daffy loses it and is ejected. He gets his head stuck in an iron lung, and feels the effects for a while. Daffy goes in search of a patient of his own, and Porky happens to walk by in time to fall victim to Daffy's mallet. Daffy hits himself on the head and has a consultation with the second and third image of himself. They agree to operate; Daffy chases Porky, and they both get stuck in the iron lung.",
    "Director": "Robert Clampett",
    "Writer": "Ernest Gee",
    "Actors": "Mel Blanc, Robert C. Bruce, Sara Berner",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033589",
    "tt0029428",
    "tt0031814",
    "tt0029502",
    "tt0032895",
    "tt0032941",
    "tt0032331",
    "tt0030607",
    "tt0030609",
    "tt0030610",
    "tt0030612",
    "tt0034049"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.683Z"
}