{
  "imdbId": "tt0009764",
  "title": "The Villain",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-villain",
      "id": "silent-the-villain",
      "title": "The Villain",
      "fileSize": 530832733,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-villain",
      "language": "English",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 757
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "21 min",
    "imdbRating": 6,
    "imdbVotes": 30,
    "Genre": "Short, Comedy",
    "Plot": "Billy, a confidence man, arrives in Squashville, a lumber town. He sees Babe, the daughter of the village doctor, disporting herself on the banks of the river. Learning that her father is the richest man in the village, Billy begins to beguile the shy, simple miss with tales of life in the big city. The innocent miss falls into his snare and gives her tender heart to the black rascal. Billy, scenting spoils that far exceeds his expectations, summons Florence, his confederate, and two crooks to come to his assistance. Budd, the village boob and life-long suitor for Babe's love, is the one stumbling block in Billy's path to the successful culmination of his plans. The doctor, returning home after a professional visit, discovers Billy about to make off with all the money in the office safe. Learning from Babe that the villain has beguiled her into opening the safe, the doctor orders Billy out of the house and administers a well-deserved spanking to his too trusting daughter. Upon the arrival of Florence and the crooks, Billy orders his woman confederate to win the love of Budd and to keep him out of the way of the villain. Florence enraptures the country boy and succeeds in keeping him at a safe distance, leaving the villain, Billy, to work in safety. Taking the place of a man who has been shot in a gambling fight, Billy succeeds in gaining an entrance into the doctor's home and persuading Babe to elope with him. The doctor, discovering the plot, rushes to the church just in time to stop the marriage and drags Babe back to the house. Infuriated at the continued failure of his evil plans, Billy resorts to violence and has his two henchmen waylay the doctor, and carry him to the sawmill. Here Budd discovers conspirators placing the doctor upon a log, and threatening to saw him into halves unless he consents to the marriage of Billy and Babe. Horrified at the sight, Budd rushes off to notify Babe and to secure aid of the local police force. Babe arrives on the scene just in time to save her father from the cruel saw and the police arriving shortly after arrest Billy and incarcerate him in the local jail. Florence and the two crooks, who managed to avoid arrest, proceed to steal the jail. Placing the jail on a commandeered wagon, the crooks drive off with the police force in pursuit. Inside the jail Billy is urging his pals to greater efforts when a wheel of the wagon breaks off, and the jail and its sole tenant is hurled into the water. Florence's devotion to her lord comes to the surface and, diving into the water, she reaches the jail, and the two drift far out of the confines of the little village, while Babe, realizing the worth of the love of her rustic sweetheart, Budd, finds contentment and peace in his arms.Moving Picture World, July 14, 1917",
    "Director": "Arvid E. Gillstrom",
    "Writer": "N/A",
    "Actors": "Oliver Hardy, Billy West, Florence McLaughlin",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006796",
    "tt0009558",
    "tt0009659",
    "tt0251116",
    "tt0236553",
    "tt0007802",
    "tt0007761",
    "tt0007819",
    "tt0008133",
    "tt0007613",
    "tt0007832",
    "tt0007880"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}