{
  "movieId": "tt0035788",
  "title": "Death Valley Rangers",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DeathValleyRangers",
      "id": "DeathValleyRangers",
      "title": "Death Valley Rangers",
      "description": "“Personable stars, pedestrian story” “Three western stars and one fun little movie” “What a hoot” (IMDB reviews quotes). Its cast of matinee westerns stars (Ken Maynard, Hoot Gibson and Bob Steele) make this ordinary Monogram oater more interesting than it would be otherwise. Most of the fun is during the last seven minutes. Filmed at Ray Corrigan Ranch, Simi Valley, CA. IMDB rating 6.4. Produced and directed by Robert Tansey Released in 1943. Complete print. TRIVIA: First telecast 2/5/48 on NYC’s WCBS channel 2.",
      "fileSize": 601592529,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/DeathValleyRangers",
      "collection": "feature_films",
      "downloads": 4226
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "59 min",
    "imdbRating": 5.6,
    "imdbVotes": 167,
    "Genre": "Drama, Western",
    "Plot": "Ken Maynard, Hoot Gibson and Bob Steele, the Trail Blazers, have been summoned to Death Valley to apprehend the gang robbing the stagecoaches of gold shipments. Arriving in town they learn from the Marshal that Jim Kirk, the town;s most-respected citizen has opened is is operating profitably a new gold mine, and learn that none of the stolen gold has ever been recovered. Bob spies an escaped convict and makes him introduce Bob as an outlaw so Bob can join the gang and learn who the leader is. Complications arise when his first assignment is to kill Maynard and Gibson.",
    "Director": "Robert Emmett Tansey",
    "Writer": "Elizabeth Beecher, Robert Emmett Tansey, Frances Kavanaugh",
    "Actors": "Ken Maynard, Hoot Gibson, Bob Steele",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035973",
    "tt0035464",
    "tt0035544",
    "tt0035425",
    "tt0034108",
    "tt0036101",
    "tt0039988",
    "tt0038254",
    "tt0034468",
    "tt0033393",
    "tt0033394",
    "tt0035701"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.368Z"
}