{
  "imdbId": "tt0054017",
  "title": "Last Woman on Earth",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/last-woman-on-earth-1960_202402",
      "title": "Last Woman on Earth (1960)",
      "description": "Harold Gern, a shady businessman from New York, is spending a holiday in Puerto Rico with his attractive wife Evelyn. They are joined by Martin Joyce, Harold's lawyer, who has come to discuss the latest indictment. Harold invites him along on a boat trip during which all three try out some newly bought scuba diving equipment. When they resurface, they find out that the world has changed forever. Watch on RetroFlix:  https://retroflix.org/last-woman-on-earth-1960/",
      "id": "last-woman-on-earth-1960_202402"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/last_woman_on_earth",
      "title": "Last Woman on Earth",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "last_woman_on_earth"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GS68mYb4I10",
      "title": "Last Woman on Earth (1960) [Science Fiction] [Horror]",
      "description": "\"Last Woman on Earth\" is an American science-fiction film produced and directed by Roger Corman. It tells the story of three survivors of a mysterious apocalypse which appears to have wiped out all human life on earth. The screenplay is by Robert Towne, who also appears in the film billed as \"Edward Wain\".\n\nHarold Gern (Antony Carbone), a successful businessman from New York who has been in a lot of legal trouble recently, is spending a holiday in Puerto Rico with his attractive wife Evelyn (Betsy Jones-Moreland), whom he married \"between trials\". They are joined by Martin Joyce (Edward Wain), Gern's friend and lawyer, who has come to discuss legal matters. Not in the mood to talk business, Gern invites him along on a boat trip during which all three try out some newly bought scuba diving equipment. When they resurface they realize to their astonishment that they are unable to breathe without using their oxygen tanks. They climb back into their boat and find Manuel, their servant, dead on board asphyxiated. Unable to start the engine, they row ashore. With 40 minutes worth of oxygen left they enter the jungle, where, due to the plants giving off oxygen, they can soon breathe normally again (and light a cigarette to calm their nerves).\n\nGradually it dawns upon the three that they might be the only survivors in the area, maybe in the world. They briefly speculate on what has happened (\"an act of God ... or bigger and better bombs\") but try to \"keep that kind of talk to a minimum\" and mainly concern themselves with becoming self-sufficient, for example by moving to a villa near the beach. The two men teach themselves how to fish as only animals that live in the water have survived but when they see insects again they realize that they must have survived inside their eggs. Accordingly, they feel that in the long run they will have to move North to a colder climate to avoid an insect problem and also problems with food preservation and to increase their chances of meeting other survivors.\n\nVery soon the Gerns and Martin Joyce can no longer cope with the triangular situation. Although they still keep up appearances Evelyn is still wearing jewelry, and Harold Gern, a tie for their seafood dinners Martin points out to Gern that neither the latter's marriage certificate nor his money mean anything any more. Evelyn feels attracted to the lawyer, who eventually tells her husband what he really thinks of him (\"The way you made your money stank. And furthermore, Harold, you stink.\"). After a short fistfight Martin pretends to be leaving the couple but at the last moment Evelyn hops into the car, and the two lovers drive off. Harold hotwires the other car and follows them. At the harbour another fight between the two men ensues during which Martin is fatally injured. The two survivors are left wondering where they will go or what they will do now.\n\n---\n\nDirected by Roger Corman,  produced by Roger Corman and Charles Hannawalt, written by Robert Towne, starring Betsy Jones-Moreland, Antony Carbone and Robert Towne (billed as Edward Wain).\n\n---\n\nSource: \"Last Woman on Earth\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 August 2012. Web. 31 August 2012. http://en.wikipedia.org/wiki/Last_Woman_on_Earth.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "GS68mYb4I10",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G-QQV4kqeDI",
      "title": "Last Woman on Earth (1960) ROGER CORMAN",
      "description": "Movie Class by PizzaFLIX: Legendary cult filmmaker Roger Corman has directed\nover 50 films and produced nearly 400 more. In the process he helped launch the careers\nof Jack Nicholson, Robert De Niro, Charles Bronson, Sylvester Stallone, Francis Ford Coppola, Martin Scorsese, Ron Howard, Robert Towne, Peter Bogdanovich, and James Cameron!\n\nStars: Betsy Jones-Moreland, Antony Carbone, Robert Towne\nDirector: Roger Corman\nScreenplay: Robert Towne \n\nWhile vacationing in Puerto Rico, a woman, her husband and their lawyer friend gradually conclude that an unexplained, temporary interruption of oxygen has killed everyone on the island... maybe even the world! \n\nTRIVIA: Written by Robert Towne, best known for Chinatown, Shampoo, and The Last Detail.",
      "id": "G-QQV4kqeDI",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw",
      "regionRestriction": {
        "blocked": [
          "AS",
          "CA",
          "GU",
          "MH",
          "MP",
          "PR",
          "PW",
          "UM",
          "US",
          "VI"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=weiCgE160s4",
      "title": "Last Woman on Earth (1960) Roger Corman | Drama, Horror, Mystery | Full Length Movie",
      "description": "They fought for the Ultimate Prize!\nEv, along with her husband, Harold, and their lawyer friend Martin, are scuba diving while on vacation in Puerto Rico. When they resurface, they conclude that an unexplained, temporary interruption of oxygen has killed everyone on the island... maybe even the world! \n\nDirector: Roger Corman\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYLD4ZQC1D1o3WC_ePvnOng\nWriter: Robert Towne \nStars: Betsy Jones-Moreland, Antony Carbone, Robert Towne\nGenres: Classics, Cult Film, Drama, Horror, Mystery, Romance, Sci-Fi\n\n @CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "weiCgE160s4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "71 min",
    "imdbRating": "4.8",
    "imdbVotes": "2,220",
    "Genre": "Drama, Horror, Mystery",
    "Plot": "Ev, along with her husband, Harold, and their lawyer friend Martin, are scuba diving while on vacation in Puerto Rico. When they resurface, they gradually conclude that an unexplained, temporary interruption of oxygen has killed everyone on the island... maybe even the world!",
    "Director": "Roger Corman",
    "Writer": "Robert Towne",
    "Actors": "Betsy Jones-Moreland, Antony Carbone, Robert Towne",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0055304",
      "title": "The Pit and the Pendulum",
      "year": 1961,
      "imdbRating": "7.0",
      "imdbVotes": "17,260",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054768",
      "title": "Creature from the Haunted Sea",
      "year": 1961,
      "imdbRating": "3.4",
      "imdbVotes": "3,416",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053925",
      "title": "House of Usher",
      "year": 1960,
      "imdbRating": "6.9",
      "imdbVotes": "16,233",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0056606",
      "title": "Tower of London",
      "year": 1962,
      "imdbRating": "6.3",
      "imdbVotes": "2,748",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054116",
      "title": "Never Take Candy from A Stranger",
      "year": 1960,
      "imdbRating": "7.4",
      "imdbVotes": "2,110",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054215",
      "title": "Psycho",
      "year": 1960,
      "imdbRating": "8.5",
      "imdbVotes": "765,542",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052655",
      "title": "A Bucket of Blood",
      "year": 1959,
      "imdbRating": "6.7",
      "imdbVotes": "8,366",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0058333",
      "title": "The Masque of the Red Death",
      "year": 1964,
      "imdbRating": "6.9",
      "imdbVotes": "17,022",
      "language": "English, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0059821",
      "title": "The Tomb of Ligeia",
      "year": 1964,
      "imdbRating": "6.4",
      "imdbVotes": "7,190",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054033",
      "title": "The Little Shop of Horrors",
      "year": 1960,
      "imdbRating": "6.2",
      "imdbVotes": "20,527",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0057401",
      "title": "Paranoiac",
      "year": 1963,
      "imdbRating": "6.7",
      "imdbVotes": "3,483",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054462",
      "title": "The Wasp Woman",
      "year": 1959,
      "imdbRating": "4.8",
      "imdbVotes": "5,840",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}