{
  "movieId": "tt0054116",
  "title": "Never Take Candy from A Stranger",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/never-take-candy-from-a-stranger",
      "id": "never-take-candy-from-a-stranger",
      "title": "Never Take Candy From A Stranger",
      "description": "Peter Carter meets official resistance when he finds that his 9-year-old daughter has been the victim of the pedophile patriarch of the town's most powerful family.",
      "fileSize": 6633563680,
      "addedAt": "2026-01-07T00:10:02.897Z",
      "thumbnail": "https://archive.org/services/img/never-take-candy-from-a-stranger",
      "language": "eng",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 3664
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "81 min",
    "imdbRating": 7.4,
    "imdbVotes": 2110,
    "Genre": "Drama, Horror, Mystery",
    "Plot": "Jean Carter, 9-year-old daughter of the town's newly-appointed school principal Peter Carter and his wife Sally, is playing in the woods with her 11-year-old friend Lucille when Jean discovers she has lost her purse containing her \"candy\" money. Lucille tells her she knows where they can get sweets for nothing, and leads her to an imposing mansion, from which the owner, Clarence Olderberry, Sr., a tall, gaunt man of 70 has been watching the girls from a window. That night Jean, unable to sleep, tells her parents that Olderberry made her and Lucille dance before him nude in exchange for some candy. Carter files a complaint, but the local police chief, Captain Hammond, is skeptical of Jean's story and warns Carter that the Olderberry family put the town on the map and have far more standing in the community than the newcomer Carters. Oldenberry, Jr. tells Carter that if he follows up on the complaint he may be certain that Olderberry's lawyers will show Jean no mercy. In the ensuing trial, the defense lawyers confuse Jean, make her an uncreditable witness, and Olderberry is acquitted, after the enraged Carter attacks him physically in court. While her parents are packing to leave town, Jean and Lucille are playing in the woods again and Olderberry approaches them and they flee in blind panic. When they reach a desolate lake they find an old rowboat and try to escape in it, but the mooring rope is still attached the shore, and Olderberry is using it to pull the boat and the girls to him.",
    "Director": "Cyril Frankel",
    "Writer": "John Hunter, Roger Garis",
    "Actors": "Gwen Watford, Patrick Allen, Felix Aylmer",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0054017",
    "tt0055304",
    "tt0057401",
    "tt3778010",
    "tt1881060",
    "tt0032406",
    "tt0026230",
    "tt0037711",
    "tt0038975",
    "tt0054084",
    "tt0067341",
    "tt0026759"
  ],
  "collections": [
    {
      "id": "horror",
      "name": "Horror"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.897Z"
}