{
  "imdbId": "tt0012532",
  "title": "Orphans of the Storm",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OrphansOfTheStorm_201312",
      "title": "\"Orphans of the Storm\" (1921) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Orphans of the Storm\" is a historical drama. This film illustrates the work of cinematographer Billy Bitzer, a star of Silent Hall of Fame. Directed by               D. W. Griffith Produced by             D. W. Griffith Scenario by               D.W. Griffith           Based on                    The Two Orphans by Adolphe-Philippe D’Ennery and Eugène Cormon Starring                     Lillian Gish, Dorothy Gish Cinematography        Billy Bitzer Editing by                  James Smith and Rose Smith Distributed by           United Artists Release date               December 28, 1921 Running time             150 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 1931838204,
      "id": "OrphansOfTheStorm_201312"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OrphansoftheStorm",
      "title": "Orphans of the Storm",
      "description": "Henriette and Louise, a foundling, are raised together as sisters. When Louise goes blind, Henriette swears to take care of her forever. They go to Paris to see if Louise's blindness can be cured, but are separated when an aristocrat lusts after Henriette and abducts her. Only Chevalier de Vaudrey is kind to her, and they fall in love. The French Revolution replaces the corrupt Aristocracy with the equally corrupt Robespierre. De Vaudrey, who has always been good to peasants, is condemned to death for being an aristocrat,",
      "fileSize": 1845204675,
      "id": "OrphansoftheStorm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PXfCxsHscbc",
      "title": "Orphans of the Storm (1921) | Colorized Public Domain Epic | D.W. Griffith | Lillian & Dorothy Gish",
      "description": "Orphans of the Storm (1921) is an American silent historical drama directed by pioneering filmmaker D.W. Griffith and starring the iconic Gish sisters, Lillian and Dorothy. This restored and colorized edition of a landmark public domain film breathes new life into a powerful story of love, sacrifice, and survival set against the backdrop of the French Revolution. Originally released during the peak of the silent film era, this ambitious epic combined sweeping spectacle with intimate human drama, influencing cinema for decades to come.\n\nPlot Summary:\nThe story follows two sisters, Henriette (Lillian Gish) and Louise (Dorothy Gish), who live in rural France during the late 18th century. Louise is blind, and Henriette devotes herself to her care, embodying loyalty and devotion in a harsh world. Their lives are upended when they travel to Paris in search of a cure for Louise’s blindness. Fate cruelly intervenes when the sisters are separated amidst the turmoil of the French Revolution.\n\nHenriette is kidnapped by the villainous aristocrat Marquis de Praille (Morgan Wallace) and thrown into a series of tragic ordeals. Meanwhile, Louise is left vulnerable in the chaotic streets of Paris, lost and destitute. Their individual struggles unfold as France itself descends into revolutionary violence, where mobs, guillotines, and political upheaval sweep through the nation.\n\nHenriette’s fate becomes intertwined with that of Danton (Monte Blue), a revolutionary leader who represents both justice and the hope of a new society. The film climaxes with tense scenes of imprisonment, near-executions, and last-minute rescues that showcase Griffith’s mastery of suspense and large-scale crowd sequences. Ultimately, the sisters’ reunion serves as both a personal and symbolic victory — affirming themes of resilience, compassion, and survival in the face of tyranny.\n\nCast and Crew:\n• Director: D.W. Griffith\n• Producer: D.W. Griffith\n• Screenplay: D.W. Griffith, based on works by Adolphe d’Ennery and Eugène Cormon\n• Cinematography: Billy Bitzer\nStarring:\n• Lillian Gish as Henriette Girard\n• Dorothy Gish as Louise Girard\n• Joseph Schildkraut as Chevalier de Vaudrey\n• Monte Blue as Georges Danton\n• Morgan Wallace as Marquis de Praille\n• Frank Puglia as Jacques Forget-Not\n• Sidney Herbert as Robespierre\n\nFilm Significance:\nOrphans of the Storm was one of D.W. Griffith’s last major epics following The Birth of a Nation (1915) and Intolerance (1916). It combined the emotional intimacy of the Gish sisters’ performances with large-scale historical spectacle, setting a standard for how silent cinema could convey both grandeur and human emotion. Lillian and Dorothy Gish’s portrayals are regarded as some of their finest, cementing their status as icons of silent film.\n\nThe movie is also notable for its political undertones. While set in 18th-century France, Griffith’s film reflected the fears of social upheaval and revolution in the early 20th century, echoing anxieties about Bolshevism and class conflict. This gives the film additional layers of cultural and historical relevance.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Orphans of the Storm remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1921 release was in black and white, consistent with the limitations of the silent era. While historically authentic, black-and-white silent films can feel distant to modern viewers. By colorizing this landmark silent epic, we make it more approachable for today’s audiences, especially those in the United States and Europe who may never have experienced silent cinema before. This edition allows viewers to appreciate Griffith’s monumental visuals while enjoying a presentation adapted for contemporary viewing habits.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to monumental historical epics. Our work ensures that these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#OrphansOfTheStorm #DWGriffith #LillianGish #DorothyGish #SilentFilm #PublicDomainMovie #ColorizedClassic #SilentCinema #1920sFilm #FilmRestoration #FrenchRevolutionMovie",
      "id": "PXfCxsHscbc",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/orphanofthestorm4k",
      "title": "Orphans of the Storm (1921) [Colorized, 4K, 60FPS]",
      "description": "Orphans of the Storm is a 1921 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 12897529221,
      "id": "orphanofthestorm4k"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ORPHANSOFTHESTORM1921D.W.GriffithLillianGishDorothyGish",
      "title": "ORPHANS OF THE STORM ( 1921) D. W. Griffith, Lillian Gish, Dorothy Gish",
      "description": "ORPHANS OF THE STORM (1921) Starring: Lillian Gish, Dorothy Gish, Joseph Schildkraut, Lucille La  Verne, Creighton Hale, Sheldon Lewis, Monte Blue, Sidney Herbert, Frank  Puglia Directed by D. W. Griffith D.W. Griffith Productions William Thomas Sherman, wts@gunjones.com, http://www.mn-hp.com",
      "fileSize": 1090757461,
      "id": "ORPHANSOFTHESTORM1921D.W.GriffithLillianGishDorothyGish"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "150 min",
    "imdbRating": 7.3,
    "imdbVotes": 5577,
    "Genre": "Drama, History, Romance",
    "Plot": "Henriette and Louise, a foundling, are raised together as sisters. When Louise goes blind, Henriette swears to take care of her forever. They go to Paris to see if Louise's blindness can be cured, but are separated when an aristocrat lusts after Henriette and abducts her. Only Chevalier de Vaudrey is kind to her, and they fall in love. The French Revolution replaces the corrupt Aristocracy with the equally corrupt Robespierre. De Vaudrey, who has always been good to peasants, is condemned to death for being an aristocrat, and Henriette for harboring him. Will revolutionary hero Danton, the only voice for mercy in the new regime, be able to save them from the guillotine?",
    "Director": "D.W. Griffith",
    "Writer": "Adolphe d'Ennery, Eugène Cormon, D.W. Griffith",
    "Actors": "Lillian Gish, Dorothy Gish, Joseph Schildkraut",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0011841",
      "title": "Way Down East",
      "year": 1920,
      "imdbRating": 7.3,
      "imdbVotes": 6016,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009559",
      "title": "A Romance of Happy Valley",
      "year": 1919,
      "imdbRating": 6.3,
      "imdbVotes": 441,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009968",
      "title": "Broken Blossoms",
      "year": 1919,
      "imdbRating": 7.2,
      "imdbVotes": 11297,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010806",
      "title": "True Heart Susie",
      "year": 1919,
      "imdbRating": 6.9,
      "imdbVotes": 2034,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012122",
      "title": "Dream Street",
      "year": 1921,
      "imdbRating": 5.5,
      "imdbVotes": 205,
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014604",
      "title": "The White Rose",
      "year": 1923,
      "imdbRating": 6.2,
      "imdbVotes": 228,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006864",
      "title": "Intolerance",
      "year": 1916,
      "imdbRating": 7.7,
      "imdbVotes": 17618,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014672",
      "title": "America",
      "year": 1924,
      "imdbRating": 6.3,
      "imdbVotes": 459,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009150",
      "title": "Hearts of the World",
      "year": 1918,
      "imdbRating": 6.6,
      "imdbVotes": 1094,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015018",
      "title": "Isn't Life Wonderful",
      "year": 1924,
      "imdbRating": 6.8,
      "imdbVotes": 410,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010193",
      "title": "The Greatest Question",
      "year": 1919,
      "imdbRating": 6,
      "imdbVotes": 745,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001032",
      "title": "The Sealed Room",
      "year": 1909,
      "imdbRating": 6,
      "imdbVotes": 985,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:20:48.619Z"
}