{
  "movieId": "tt0020018",
  "title": "In Old Arizona",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/in.-old.-arizona.-1928.1080p.-blu-ray.x-264.-aac-yts.-mx",
      "id": "in.-old.-arizona.-1928.1080p.-blu-ray.x-264.-aac-yts.-mx",
      "title": "In Old Arizona (1928)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. Nominated for five Academy Awards, with lead actor Warner Baxter winning the Best Actor award, In Old Arizona was one of the earliest films to be fully voiced. It was also the first Western talkie picture as well as the first to record outdoors, as the recording equipment was quite bulky and cumbersome. Modern reviews are lukewarm, but it still may be worth viewing to see the early pioneering techniques used in the production. ",
      "fileSize": 1775301349,
      "addedAt": "2026-01-07T00:08:54.187Z",
      "thumbnail": "https://archive.org/services/img/in.-old.-arizona.-1928.1080p.-blu-ray.x-264.-aac-yts.-mx",
      "language": "eng",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 91
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jkLSrqBWO4Y",
      "id": "jkLSrqBWO4Y",
      "title": "In Old Arizona (1928) WARNER BAXTER",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nTHE FIRST ALL-TALKING WESTERN!\nStars: Warner Baxter, Dorothy Burgess, Edmund Lowe\nDirectors: Raoul Walsh, Irving Cummings\n\nA charming, happy-go-lucky bandit plays cat-and-mouse with a sheriff while he romances a local beauty. An Oscar-winning performance by Warner Baxter as The Cisco Kid!\n\nTRAGIC TRIVIA: While on location in Utah, Director Raoul Walsh lost his right eye after it was cut by a fragment of glass when a high-jumping jackrabbit crashed through the windshield of a car in which he was riding. \n\nTRIVIA: The Cisco Kid is a fictional character created by O. Henry for his short story \"The Caballero's Way,\" first published in 1907. Four actors portrayed this Western hero during the sound era in 25 films, beginning in 1928 with Warner Baxter, followed by Cesar Romero, Duncan Renaldo, and Gilbert Roland.",
      "addedAt": "2025-12-24T01:07:31.702Z",
      "thumbnail": "https://i.ytimg.com/vi/jkLSrqBWO4Y/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA3za2AqFwp3z6kFfpkqsUf2TLM0A",
      "duration": 5849,
      "language": "en",
      "year": 1928,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "95 min",
    "imdbRating": 5.5,
    "imdbVotes": 1415,
    "Genre": "Drama, Western",
    "Plot": "Army Sergeant Mickey Dunn sets out in pursuit of the Cisco Kid, a notorious if kind-hearted and charismatic bandit of the Old West. The Kid spends much of his loot on Tonia, the woman he loves, not realizing that she is being unfaithful to him in his absence. Soon, with her oblivious paramour off plying his trade, Tonia falls in with Dunn, drawn by the allure of a substantial reward for the Kid's capture -- dead or alive. Together, they concoct a plan to ambush and do away with the Cisco Kid once and for all.",
    "Director": "Irving Cummings, Raoul Walsh",
    "Writer": "O. Henry, Tom Barry, Paul Gerard Smith",
    "Actors": "Edmund Lowe, Warner Baxter, Dorothy Burgess",
    "Language": "English, Spanish, Italian",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 4 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt0020320",
    "tt0017463",
    "tt0021358",
    "tt0020646",
    "tt0021202",
    "tt0021176",
    "tt0019305",
    "tt0022243",
    "tt0022293",
    "tt0015627",
    "tt0016288",
    "tt0016235"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.187Z"
}