{
  "movieId": "tt0002473",
  "title": "The Sands of Dee",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheSandsOfDee",
      "id": "PreviewTheSandsOfDee",
      "title": "\"The Sands Of Dee\" (1912) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Sands of Dee\" is a short drama, included in our program to illustrate the work of two of our stars: actor Robert Harron and cinematographer Billy Bitzer. Mae Marsh and Robert Harron have a romance, but she unexpectedly falls for a city artist's charms. However, when she sees him with another woman Mae Marsh returns home only to be turned away by her father.  Directed by               D. W. Griffith Produced by             Biograph Company Scenario by               based on the poem by Charles Kingsley Starring                     Mae Marsh, Robert Harron, Edwin August, Charles Hill Mailes Cinematography        Billy Bitzer Distributed by           The General Film Company, Incorporated Release date               July 22, 1912 Running time             11 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 27356972,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheSandsOfDee",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 1099
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 6.5,
    "imdbVotes": 93,
    "Genre": "Romance, Short",
    "Plot": "A young girl who lives by the sea with her parents, is the object of one fellows affection. One day she meets a wily artist painting on the beach, he seduces the young girl and gives her a ring, with the promise of marriage. When the young admiring fellow comes to propose, she proudly announces her engagement to the artist. Shocked he leaves and her parents demand meeting her husband to be. She goes to bring him home, and finds he already has a sophisticated fiancée. Distraught she hurries home, and when her father realizes what she has done, he orders her out of the house. As she wanders despondent along the sea, the young fellow who has found out about her betrayal,immediately goes to see her. Finding she has been disowned by her father, he goes looking for her and sees her body floating in the sea. He now carries her lifeless body back onto the shore, to her heartbroken parents.",
    "Director": "D.W. Griffith",
    "Writer": "Charles Kingsley",
    "Actors": "Mae Marsh, Robert Harron, Charles Hill Mailes",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002497",
    "tt0002282",
    "tt0002302",
    "tt0002357",
    "tt0002197",
    "tt0002512",
    "tt0002342",
    "tt0002795",
    "tt0001598",
    "tt0001978",
    "tt0001840",
    "tt0001740"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}