{
  "imdbId": "tt0001978",
  "title": "When a Man Loves",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewWhenAManLoves",
      "title": "\"When A Man Loves\" (1911) director D. W. Griffith with Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"When a Man Loves\" is a short drama directed by D.W. Griffith.  The film is included in our program to illustrate the work of Robert Harron and Billy Bitzer, stars of Silent Hall of Fame. A country girl's suitor is rejected by her father in favor of a much older man, his old buddy. Robert Harron has a small part as the preacher's assistant.   Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Dell Henderson, Mary Pickford, Charles West, George Nichols, Robert Harron Distributed by                   General Film Company Release date                      January 5, 1911 Country                             United States Running time                    13 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 14998718,
      "id": "PreviewWhenAManLoves"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 6,
    "imdbVotes": 33,
    "Genre": "Drama, Short, Romance",
    "Plot": "Mr. Bach, now a wealthy man, visits the scenes of his boyhood days in his auto and meets farmer Brown, his boyhood friend. Brown is the father of a very pretty daughter named Tessie. Bach becomes deeply smitten with the artless little country lass, and secretly hopes to win her. Tessie, however, has a host of admirers in the little village, the favored one being John Watson. John is a bit superior to the other fellows of the neighborhood. He reads novels and has a good line of persuasive talk with which to embellish his suit for Tessie's heart, and he is successful, to the violent perturbation of the other swains. Now Tessie is of course pleased with the notice bestowed on her by the rich bachelor, but her heart is true to John. A few days later Mr. Bach, lovelorn, revisits the homestead. His presence stirs John up to deeds of determination. In this frame of mind he seeks Tessie and plans to elope that very night. He will be beneath her window with a ladder. Mr. Bach, to remain at the homestead, uses the subterfuge that his auto has become disabled and would like to spend the night with his old friend Brown. Brown is delighted for he has discerned the attention Tessie has exerted. To accommodate Mr. Bach, Tessie is put out of her own room by her father and the room given to Mr. Bach. Oh! Horror! This spoils the plans for the elopement. Curse the luck! Poor Tessie is locked in the adjoining room out of reach of John. John arrives beneath the window, and calls \"Sweetheart, I am waiting,\" repeating it a number of times. He cannot understand why he does not get an answer, so throws several pebbles through the window. At length, growing impatient, he places the ladder and climbs into the window, encountering the astounded Mr. Bach, who, mistaking him for one of those sinister intruders, a burglar, is about to throw him out, when he explains the situation. This is very odious news to Bach, but as \"all the world loves a lover,\" his heart softens and he consents to aid the couple in their flight. In other words, he leads the wedding march by piling them into his auto and speeding to the nearest minister's abode. Brown soon learns of his daughter's escape from the room in which he locked her, and fearing the very thing that is happening, starts out in pursuit in a buggy, arriving at the minister's just too late to forbid the bands, but in time to give his parental blessing to Mr. and Mrs. John Watson.",
    "Director": "D.W. Griffith",
    "Writer": "George Terwilliger",
    "Actors": "Dell Henderson, Mary Pickford, Charles West",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001371",
      "title": "Ramona",
      "year": 1910,
      "imdbRating": 5.8,
      "imdbVotes": 449,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001740",
      "title": "The Lonedale Operator",
      "year": 1911,
      "imdbRating": 6.5,
      "imdbVotes": 1322,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002176",
      "title": "The Female of the Species",
      "year": 1912,
      "imdbRating": 5.8,
      "imdbVotes": 337,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001459",
      "title": "Winning Back His Love",
      "year": 1910,
      "imdbRating": 5.5,
      "imdbVotes": 65,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002512",
      "title": "The Sunbeam",
      "year": 1912,
      "imdbRating": 6.2,
      "imdbVotes": 412,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002357",
      "title": "The Mender of Nets",
      "year": 1912,
      "imdbRating": 6.1,
      "imdbVotes": 224,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": 6.1,
      "imdbVotes": 625,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001753",
      "title": "Love in the Hills",
      "year": 1911,
      "imdbRating": 6,
      "imdbVotes": 18,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001499",
      "title": "The Battle",
      "year": 1911,
      "imdbRating": 5.7,
      "imdbVotes": 368,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001741",
      "title": "The Long Road",
      "year": 1911,
      "imdbRating": 4.4,
      "imdbVotes": 23,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001680",
      "title": "His Trust: The Faithful Devotion and Self-Sacrifice of an Old Negro Servant",
      "year": 1911,
      "imdbRating": 5.1,
      "imdbVotes": 661,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001769",
      "title": "The Making of a Man",
      "year": 1911,
      "imdbRating": 5.4,
      "imdbVotes": 82,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}