{
  "movieId": "tt0027120",
  "title": "Tombstone Terror",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=d6ErV2m3sjw",
      "id": "d6ErV2m3sjw",
      "title": "Tombstone Terror (1935) BOB STEELE",
      "description": "Stars: Bob Steele, Kay McCoy, George 'Gabby' Hayes\nDirector: Robert N. Bradbury\n\nAn innocent man is mistaken for his outlaw twin brother and sets out to prove his true identity.\n\nTRIVIA: Bob Steele, born Robert A. Bradbury, had a twin brother in real life, and this film is directed by his real-life father Robert N. Bradbury.",
      "addedAt": "2025-12-26T23:42:23.136Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/d6ErV2m3sjw/maxresdefault.webp",
      "duration": 3313,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 6.1,
    "imdbVotes": 56,
    "Genre": "Western",
    "Plot": "Jimmy Dixon, pursued by a band of Mexicans, changes clothes with a tramp, who takes off on his horse. Four miles later, Jimmy walks onto the Double-O Ranch, from which he had been thrown off four years before by his dad, who had blamed Jimmy for something that his twin brother Duke had done. Duke, home from college, took over the ranch when Mr. Dixon became ill, and has run it into the ground. When Duke goes to the bank to repay a debt to Jimmy, he rides onto Phoenix with all of the ranch money. Jimmy, forced to pose as his brother, runs into Duke's fiancée, Jean Adams and a Phoenix girl friend, then has to fight Swede over a dancer. Jimmy learns that gambler Regan and Duke plan to steal the Double-O herd along with the cattle they're already rustled from neighboring ranches. Duke tips Regan about Jimmy, who is nearly killed. Remorseful, Duke joins Jimmy in the showdown against the rustlers and dies protecting his father.",
    "Director": "Robert N. Bradbury",
    "Writer": "Perry Murdock",
    "Actors": "Bob Steele, Kay McCoy, George 'Gabby' Hayes",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027015",
    "tt0024047",
    "tt0024045",
    "tt0026052",
    "tt0026114",
    "tt0026785",
    "tt0026908",
    "tt0026929",
    "tt0028324",
    "tt0027128",
    "tt0024902",
    "tt0027393"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:28:01.859Z"
}