{
  "imdbId": "tt0000414",
  "title": "Uncle Josh at the Moving Picture Show",
  "year": 1902,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-uncle-josh-at-the-moving-picture-show",
      "id": "silent-uncle-josh-at-the-moving-picture-show",
      "title": "Uncle Josh at the Moving Picture Show",
      "fileSize": 13647827,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-uncle-josh-at-the-moving-picture-show",
      "year": 1902,
      "collection": "feature_films",
      "downloads": 373
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/uncle-josh-at-the-moving-picture-show-1902-directed-by-edwin-s.-porter",
      "id": "uncle-josh-at-the-moving-picture-show-1902-directed-by-edwin-s.-porter",
      "title": "Uncle Josh At The Moving Picture Show (1902) Directed By Edwin S. Porter",
      "description": "Uncle Josh at the Moving Picture Show (1902) Director: Edwin S. Porter Uncle Josh at the Moving Picture Show is a 1902 American short silent comedy film directed by Edwin S. Porter, featuring a naive spectator trying to interact with films projected onto a screen. It is an almost identical remake of a British 1901 film directed by Robert W. Paul, The Countryman and the Cinematograph. Paul's film was the first to feature a film shown within a film. Analysis: There are a number of differences between this film and the British original. Firstly, it is the third of a series of films directed by Edwin S. Porter featuring the character of Uncle Josh, played by Charles Manley. The others were, in 1900, Uncle Josh's Nightmare and Uncle Josh in a Spooky Hotel. Uncle Josh Weathersby was a character, created onstage by Cal Stewart, who lived in a mythical New England farming town called \"Punkin Center\". Edison had recorded several cylinders of Cal Stewart's very successful speeches and songs before producing these films. The staging of Porter's version is a bit different from the 1901 version, with a slightly wider frame showing a stage with a box to the left and larger than life characters on the screen while they are lifesize in the 1901 version. Porter's version, to the difference of the 1901 film, includes a title and three intertitles for the three films within the film. The general title The Edison Projecting Kinetoscope is a kind of advertisement for this innovation recently introduced by Edison to replace the Kinetoscope parlors, following the success of the Lumière brothers' cinematograph. The second film within the film is a clear reference to the Lumière brothers' 1895 film, L'Arrivée d'un train en gare de La Ciotat (known in the United States as The Arrival of a Train at La Ciotat Station, Arrival of a Train at La Ciotat or The Arrival of the Mail Train, and in the United Kingdom as Train Pulling into a Station) and the panic reaction it allegedly caused in the audience. Porter used double exposure to add the films after having filmed the spectator next to a black background. This also made it possible to use the same actor as spectator and actor in the third film where he wants to confront his doppelgänger. At the end, stop-motion is used to replace the black background by a white sheet which is torn by the spectator. This film and the British film which inspired it have been regarded as a celebrated document of the learning process of the public regarding cinema; according to Miriam Hansen, \"The proper relations among viewers, projector and the screen, the peculiar dimensions of cinematic space, were part of a cultural practice that had to be learned\" -From Wikipedia",
      "fileSize": 15407240,
      "addedAt": "2026-01-07T00:12:55.131Z",
      "thumbnail": "https://archive.org/services/img/uncle-josh-at-the-moving-picture-show-1902-directed-by-edwin-s.-porter",
      "year": 1902,
      "collection": "feature_films",
      "downloads": 113
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "2 min",
    "imdbRating": 5.3,
    "imdbVotes": 775,
    "Genre": "Comedy, Short",
    "Plot": "A side-splitter. Uncle Josh occupies a box at a vaudeville theatre, where a moving picture show is going on. First a dancer appears on the screen. Uncle Josh jumps to the stage and endeavors to make lover to her, but she flits away, and immediately there appears upon the screen the picture of an express train running at sixty miles an hour. Uncle Josh becomes panic-stricken, and fearing to be struck by the train, makes a dash for his box. He is no sooner seated than a country couple appear upon the screen, at a well. Before they pump the pail full of water they indulge in a love-making scene. Uncle Josh thinks he recognizes his own daughter, jumps upon the stage, removes his coat and prepares to chastise the lover, and grabbing the moving picture screen he hauls it down, and to his great surprise finds a kinetoscope operator in the rear. The operator is made furious by Uncle Josh interrupting his show, and grappling with him they roll over and over upon the stage in an exciting encounter.",
    "Director": "Edwin S. Porter",
    "Writer": "N/A",
    "Actors": "Charles Manley",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000340",
    "tt0000341",
    "tt0245125",
    "tt0000346",
    "tt0231868",
    "tt0231639",
    "tt0477387",
    "tt0232932",
    "tt0348794",
    "tt0273542",
    "tt0231549",
    "tt0231758"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.131Z"
}