{
  "imdbId": "tt0008443",
  "title": "The Poor Little Rich Girl",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThePoorLittleRichGirl",
      "id": "ThePoorLittleRichGirl",
      "title": "The Poor Little Rich Girl",
      "description": "The Poor Little Rich Girl is a 1917 film produced by Artcraft Productions and distributed by their parent company Paramount Pictures. The film tells the story of a rich girl whose parents ignore her and whose servants push her around, until tragedy brings them to realize the error of their ways. It stars Mary Pickford, Madlaine Traverse, Charles Wellesley, Gladys Fairbanks and Frank McGlynn Sr. The movie was adapted by Frances Marion from the play by Eleanor Gates. It was directed by Maurice Tourneur. In 1991, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in the National Film Registry. (From: Wikipedia: http://en.wikipedia.org/wiki/The_Poor_Little_Rich_Girl)",
      "fileSize": 1256947818,
      "addedAt": "2026-01-07T00:07:05.035Z",
      "thumbnail": "https://archive.org/services/img/ThePoorLittleRichGirl",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 73522
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x1gvTLVw1K0",
      "id": "x1gvTLVw1K0",
      "title": "The Poor Little Rich Girl (1917) | Colorized Public Domain Silent Drama Classic with Mary Pickford",
      "description": "The Poor Little Rich Girl (1917) is a silent drama directed by Maurice Tourneur and starring the legendary Mary Pickford, who was already America’s most beloved actress and one of the biggest stars of the silent era. Produced by Adolph Zukor for Paramount Pictures and adapted from the 1913 stage play by Eleanor Gates, the film runs approximately 62 minutes and remains one of Pickford’s signature roles. This restored and colorized edition brings a century-old classic to life, making it emotionally powerful and visually engaging for today’s audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe story centers on Gwendolyn (Mary Pickford), a young girl born into wealth and privilege but starved of affection and genuine care. Surrounded by servants, tutors, and parents too consumed with their own social ambitions, Gwendolyn lives a lonely and isolated life in her luxurious home. Her innocence and longing for love stand in stark contrast to the coldness of her environment.\n\nOne day, while playing outside, Gwendolyn becomes ill after catching a chill. Her sickness leads to a feverish state that blurs the line between reality and fantasy. In her delirium, she embarks on dreamlike journeys where she confronts symbolic figures that represent the values, vices, and virtues of her world. Through these dream sequences, the film weaves moral lessons about love, wealth, and the meaning of true happiness.\n\nThe climax builds around whether Gwendolyn will recover, and whether her parents will realize that affection, kindness, and compassion are more valuable than material riches. Mary Pickford’s heartfelt performance, mixing childlike innocence with emotional depth, makes the film both moving and timeless.\n\nCast and Crew:\n• Director: Maurice Tourneur\n• Producer: Adolph Zukor\n• Based on: The Poor Little Rich Girl (1913 play by Eleanor Gates)\n• Cinematography: John van den Broek\n\nStarring:\n• Mary Pickford as Gwendolyn\n• Madlaine Traverse as Jane (Gwendolyn’s mother)\n• Charles Wellesley as Richard (Gwendolyn’s father)\n• Frank McGlynn Sr. as The Doctor\n• Maxfield Stanley as Mr. Kane\n• Emile Lamont as The Plumber\n\nFilm Significance:\nThe Poor Little Rich Girl is one of Mary Pickford’s most celebrated films, establishing her as “America’s Sweetheart” and solidifying her reputation for portraying youthful characters with authenticity and charm, even as an adult actress. Her ability to embody a child’s spirit made her performances both poignant and widely appealing to audiences of all ages.\n\nThe film is also an early example of cinema exploring themes of class, wealth, and emotional neglect within privileged households. Its dream sequences introduced creative visual storytelling techniques that pushed silent film beyond straightforward realism into the realm of allegory and fantasy.\n\nMaurice Tourneur’s direction and atmospheric imagery elevated the film into more than just a sentimental story; it became a work of art that balanced social critique with emotional resonance. The movie’s cultural impact was so strong that it was later remade in 1936 with Shirley Temple, further cementing the story’s place in American film history.\n\nEnhanced Public Domain Explanation:\nThe Poor Little Rich Girl (1917) is now in the public domain, which allows it to be freely preserved, restored, and shared worldwide. At Colorized Public Domain, we carefully restore the visual quality and add respectful colorization to these silent-era treasures. By bringing soft tones and subtle hues to Pickford’s world, we highlight the emotional contrasts between Gwendolyn’s cold, opulent surroundings and her warm inner spirit. This colorized edition invites new generations to experience the film’s timeless themes in a fresh and immersive way.\n\nWhy Watch This Colorized Edition:\nThe original black-and-white version of The Poor Little Rich Girl relied on light, shadow, and expression to carry its emotional weight. While still powerful, many modern viewers overlook silent films due to their monochrome presentation. The colorized version enhances the dreamlike imagery, the lavish interiors, and Pickford’s expressive performance, allowing audiences to feel the story more vividly. This edition bridges the gap between historic preservation and modern cinematic appeal, ensuring that the lessons of love, compassion, and humanity remain just as relevant today.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more restored and colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nAt Colorized Public Domain, we bring back to life silent dramas, comedies, and early Hollywood masterpieces. Our mission is to preserve the artistry of pioneers like Mary Pickford and Maurice Tourneur while making their work accessible and engaging for audiences in the USA, Europe, and across the globe.\n\n#ThePoorLittleRichGirl1917 #MaryPickford #SilentDrama #PublicDomainMovie #ColorizedClassic #SilentFilmHistory #GoldenAgeHollywood #MauriceTourneur",
      "addedAt": "2025-12-24T00:47:43.444Z",
      "thumbnail": "https://i.ytimg.com/vi/x1gvTLVw1K0/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYQiBhKGUwDw==&rs=AOn4CLBtIWHdOHwRhdiFJq6iqQt3ssb6HQ",
      "duration": 3817,
      "language": "en",
      "year": 1917,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cjBkhez_FKg",
      "id": "cjBkhez_FKg",
      "title": "Poor Little Rich Girl (1917) Mary Pickford - Comedy, Drama, Family Silent Film",
      "description": "The wealthy but selfish parents of a lonely young girl begin to rethink what is important to them after a servant's irresponsibility results in a crisis.\n\nDirector: Maurice Tourneur\nWriters: Eleanor Gates, Frances Marion\nStars: Mary Pickford, Madlaine Traverse, Charles Wellesley\nGenres:  Classics, Silent, Comedy, Drama, Family \n\nFind the rest of the cult on social media :\nFacebook : https://www.facebook.com/CultCinemaClassics\nInsta : https://www.instagram.com/cultcinemaclassics -\nhttps://www.twitch.tv/cultcinema",
      "addedAt": "2025-12-27T00:51:37.223Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/cjBkhez_FKg/maxresdefault.webp?v=626834f2",
      "duration": 3827,
      "language": "en",
      "year": 1917,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "78 min",
    "imdbRating": 6.7,
    "imdbVotes": 1573,
    "Genre": "Comedy, Drama, Family",
    "Plot": "Gwen's family is rich, but her parents ignore her and most of the servants push her around, so she is lonely and unhappy. Her father is concerned only with making money, and her mother cares only about her social position. But one day a servant's irresponsibility creates a crisis that causes everyone to rethink what is important to them.",
    "Director": "Maurice Tourneur",
    "Writer": "Eleanor Gates, Frances Marion",
    "Actors": "Mary Pickford, Madlaine Traverse, Charles Wellesley",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0011588",
    "tt0004825",
    "tt0008519",
    "tt0008499",
    "tt0008011",
    "tt0008764",
    "tt0009326",
    "tt0008891",
    "tt0012349",
    "tt0010040",
    "tt0010844",
    "tt0004872"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.035Z"
}