{
  "imdbId": "tt0030501",
  "title": "The Night Hawk",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night-hawk-1938",
      "id": "night-hawk-1938",
      "title": "The Night Hawk (1938)",
      "description": "The Night Hawk Robert Livingston, June Travis, Robert Armstrong 1938 Republic Pictures",
      "fileSize": 669729432,
      "addedAt": "2026-01-07T00:10:02.897Z",
      "thumbnail": "https://archive.org/services/img/night-hawk-1938",
      "collection": "feature_films",
      "downloads": 867
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night-hawk-republic",
      "id": "night-hawk-republic",
      "title": "The Night Hawk",
      "description": "Title: The Night Hawk Summary: Gangster Charlie McCormick despairs as his young brother Bobby lays near death and vows to break the quarantine of the ocean liner Pacific Queen in order to retrieve the iron lung Bobby ... Directed by: Sidney Salkow Actors: Robert Livingston, June Travis, Robert Armstrong Production Company: Republic Pictures (I) Release Date: 1 October 1938 (USA) Aspect Ratio: 1.37 : 1 Gangster Charlie McCormick despairs as his young brother Bobby lays near death and vows to break the quarantine of the ocean liner Pacific Queen in order to retrieve the iron lung Bobby needs. Meanwhile, newspaper editor Lonigan searches for reporter Slim Torrence, because Slim is friends with Tom Niles, the customs officer on the verge of cracking a whiskey smuggling case. Lonigan is about to send another reporter to cover the story when Della Parrish, the publisher's daughter, assures him that she can locate Slim. With the help of Slim's young photographer, Willie Sing, Della finds Slim in a waterfront dive, and Willie and Slim sneak aboard the Pacific Queen to find Niles. Niles hints that McCormick is the head of the smuggling ring and promises Slim an exclusive when he breaks the story the next day. Slim and Willie then try to leave, but are held up by the quarantine. They hide in Bobby's iron lung, which McCormick's men Lefty and Spider get past the quarantine. On shore, the iron...",
      "fileSize": 3424639629,
      "addedAt": "2026-01-07T00:10:02.897Z",
      "thumbnail": "https://archive.org/services/img/night-hawk-republic",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 1135
    }
  ],
  "metadata": {
    "Rated": "16",
    "Runtime": "63 min",
    "imdbRating": 5.9,
    "imdbVotes": 21,
    "Genre": "Crime, Drama",
    "Plot": "Gangster Charlie McCormick despairs as his young brother Bobby lays near death and vows to break the quarantine of the ocean liner Pacific Queen in order to retrieve the iron lung Bobby needs. Meanwhile, newspaper editor Lonigan searches for reporter Slim Torrence, because Slim is friends with Tom Niles, the customs officer on the verge of cracking a whiskey smuggling case. Lonigan is about to send another reporter to cover the story when Della Parrish, the publisher's daughter, assures him that she can locate Slim. With the help of Slim's young photographer, Willie Sing, Della finds Slim in a waterfront dive, and Willie and Slim sneak aboard the Pacific Queen to find Niles. Niles hints that McCormick is the head of the smuggling ring and promises Slim an exclusive when he breaks the story the next day. Slim and Willie then try to leave, but are held up by the quarantine. They hide in Bobby's iron lung, which McCormick's men Lefty and Spider get past the quarantine. On shore, the iron lung is hijacked and held for ransom by gangster Otto Miller. Although McCormick agrees to pay the $50,000 ransom, Slim and Willie steal the iron lung from Miller's gang and take it to the hospital. There, Slim finds out that Niles was murdered aboard the ocean liner, and he suspects McCormick. The next day, Slim and Willie return to the ship, where they find the knife used in the murder. Slim is attacked by the killer, one of McCormick's men named John Colley, who was posing as a ship's steward. Slim traces Colley to McCormick's nightclub, where he overhears McCormick plan on killing Colley and framing Miller for it. Slim goes to Miller's hideout, and after warning him of the scheme, takes him to Della's house. Della, angry over being stood up by Slim once again, has invited McCormick for dinner. She is unaware of McCormick's true nature and is horrified when the two gangsters have a gun battle, during which Miller is killed. McCormick is freed after pleading self-defense, but tells his gang to abandon the latest shipment of smuggled whiskey as he is under surveillance. Lefty and Spider are dissatisfied with the idea and scheme with boat captain McTeague to double-cross McCormick by transporting the whiskey directly into a warehouse themselves, by means of a pump. Slim and Willie find out about the double-cross and go to the warehouse, where Slim is captured after sending Willie to get the police. Slim is taken aboard the ship, while Lefty goes to McCormick's house. When Bobby overhears Lefty planning to murder Slim, and he calls McCormick's club. McCormick tells Bobby that nothing can be done, but after Bobby reminds his brother that Slim saved his life, McCormick rushes to the ship. McCormick rescues Slim as he is about to be steamed to death in the hold, but he is fatally wounded by Lefty. The police arrive and the gang is apprehended, and later, Willie helps Slim and Della plan their honeymoon.",
    "Director": "Sidney Salkow",
    "Writer": "Earl Felton",
    "Actors": "Robert Livingston, June Travis, Robert Armstrong",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030122",
    "tt0028719",
    "tt0035740",
    "tt0029112",
    "tt0032159",
    "tt0028589",
    "tt0259235",
    "tt0030037",
    "tt0030049",
    "tt0030168",
    "tt0030169",
    "tt0030323"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.897Z"
}