{
  "imdbId": "tt0001050",
  "title": "A Strange Meeting",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AStrangeMeeting",
      "title": "\"A Strange Meeting\" (1909) director D. W. Griffith starring Arthur V. Johnson",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"A Strange Meeting\" is a short drama, included in our program to illustrate the work of Arthur Johnson and Billy Bitzer, stars of Silent Hall of Fame.   A woman who takes part in robbing a preacher faces her demons. Will she repent and make amends?   Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Arthur Johnson, Stephanie Longfellow, Henry B. Walthall Distributed by                   Biograph Company Release date                      August 2, 1909 Country                             United States Running time                    12 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "AStrangeMeeting"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-strange-meeting",
      "title": "A Strange Meeting",
      "id": "silent-a-strange-meeting"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": "4.9",
    "imdbVotes": "90",
    "Genre": "Short, Drama",
    "Plot": "In a Bowery dance-hall we find Mary Rollins associated with those poor souls who walk in the Valley of the Shadow of Death. One of their number is a youth whose mother appears and tries to get him away from the place, but appeals are in vain and she goes to the little mission, where she finds Rev. John Stanton, the pastor, who is the good shepherd willing to seek the lost one. Stanton's entrance in the dance hall occasions vile derision from the mob, and, indeed, they would have assaulted him, had he not cowed them by an exhibition of his forced aggressiveness. Here he meets Mary, through whose glance he sees a pure soul which is being forced into the quagmire of crime by conditions. Before leaving with the boy, Stanton hands around cards on which is printed Psalm 23. These lines impress her so deeply that she is drawn to the little mission to hear the words of encouragement preached by the kindly spirited Mr. Stanton. How strongly do the words of holy writ, \"Let them be ashamed who transgress without cause,\" appeal to her when she arrives at her home to find herself compelled to join her father and brother in a burglary; The injunction \"Thou shalt not steal\" never seemed so terrible as now. However, she must bow to the inevitable and go. By singular coincidence the place selected are the apartments of Rev. Mr. Stanton. Mary and her brother are in the room when surprised by the minister, who was at first Inclined to hand them over to the police, but that something good in her sad face made him desist, and be allows them to go. Mary had secured the minister's watch and chain, with which she retraces her steps and returns. Mr. Stanton takes this opportunity to plead with her to give up her present life and go the better way, and although she breathes the prayer, \"Show me Thy ways, O Lord; teach me Thy paths,\" she feels how weak she is, but the good man encourages her by telling her of the omnipotence of God's grace, so she fights on, and we finally find her in the little chapel, her arms stretched forth and face upturned with the promise, \"I will dwell in the house of the Lord forever,\" thus ending one of the most beautiful picture subjects ever produced.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith, Stanner E.V. Taylor",
    "Actors": "Stephanie Longfellow, Arthur V. Johnson, Henry B. Walthall",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001032",
      "title": "The Sealed Room",
      "year": 1909,
      "imdbRating": "6.0",
      "imdbVotes": "985",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001262",
      "title": "In Life's Cycle",
      "year": 1910,
      "imdbRating": "5.2",
      "imdbVotes": "32",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000852",
      "title": "A Drunkard's Reformation",
      "year": 1909,
      "imdbRating": "5.7",
      "imdbVotes": "261",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001072",
      "title": "A Trap for Santa Claus",
      "year": 1909,
      "imdbRating": "5.6",
      "imdbVotes": "409",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000828",
      "title": "Confidence",
      "year": 1909,
      "imdbRating": "5.3",
      "imdbVotes": "114",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000854",
      "title": "Edgar Allan Poe",
      "year": 1909,
      "imdbRating": "5.9",
      "imdbVotes": "573",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000986",
      "title": "Nursing a Viper",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "120",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001016",
      "title": "Resurrection",
      "year": 1909,
      "imdbRating": "5.1",
      "imdbVotes": "152",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000800",
      "title": "The Awakening",
      "year": 1909,
      "imdbRating": "5.3",
      "imdbVotes": "115",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001088",
      "title": "The Way of Man",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "78",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001431",
      "title": "The Unchanging Sea",
      "year": 1910,
      "imdbRating": "6.3",
      "imdbVotes": "916",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001207",
      "title": "Faithful",
      "year": 1910,
      "imdbRating": "5.7",
      "imdbVotes": "137",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}