{
  "movieId": "tt0045029",
  "title": "Phone Call from a Stranger",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/phone-call-from-a-stranger-1952",
      "id": "phone-call-from-a-stranger-1952",
      "title": "Phone Call From A Stranger (1952) Bette Davis, Shelley Winters, Gary Merrill",
      "description": "Phone Call from a Stranger is a 1952 American FILM NOlR drama directed by Jean Negulesco, who was nominated for the Golden Lion at the Venice Film Festival. The screenplay by Nunnally Johnson and I.A.R. Wylie, which received the award for Best Scenario at the same festival.   The film stars Shelley Winters, Bette Davis, Gary Merrill and Michael Rennie.   ",
      "fileSize": 930019213,
      "addedAt": "2026-01-07T00:10:12.700Z",
      "thumbnail": "https://archive.org/services/img/phone-call-from-a-stranger-1952",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 3072
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/phone-call-from-a-stranger-1952_202306",
      "id": "phone-call-from-a-stranger-1952_202306",
      "title": "Phone Call from a Stranger (1952)",
      "description": "Four strangers board a plane and become fast friends, but a catastrophic crash leaves only one survivor. He then sets off on a journey to discover who these people were, but ultimately discovers the devastating truth about himself. Watch on RetroFlix.org: https://retroflix.org/phone-call-from-a-stranger-1952/",
      "fileSize": 707618503,
      "addedAt": "2026-01-07T00:10:12.700Z",
      "thumbnail": "https://archive.org/services/img/phone-call-from-a-stranger-1952_202306",
      "language": "eng",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 586
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "105 min",
    "imdbRating": 7,
    "imdbVotes": 3125,
    "Genre": "Drama, Film-Noir",
    "Plot": "On a flight from Chicago to Los Angeles, lawyer David Trask befriends three of his fellow passengers while one technical issue after another lead to unscheduled stops and delays. The other three are physician Dr. Robert Fortness, a struggling actress with the stage name Binky Gay, and loud-mouthed salesman Eddie Hoke, who is both quick with a joke and quick to show off a photograph of his beautiful wife, Marie. Two of them confess to David having painful reckonings waiting for them in Los Angeles. Dr. Fortness, an alcoholic, is returning to own up to his responsibility for a car accident in which his friend and two others were killed, and his guilt over letting his wife Claire lie for him, which destroyed their marriage and alienated his son. Binky, who has tried and failed to realize success on the New York stage for the past year, is returning to her husband, Mike Carr, hoping to keep his affection despite his overbearing mother, former vaudeville star Sally Carr, who still basks in her former but no longer shining glory, and who resents Binky as competition on and off stage. David feels compelled to help their families come to terms with their losses, especially in the case of Dr. Fortness, who hired David as his attorney. Each case is different. The doctor's wife and son need to face the truth. Binky's mother-in-law thinks she knows everything and won't let David get a word in edgewise, so he fools her into thinking that Binky had been successful in New York, only discussing the truth with her husband. Meeting Eddie's widow, David finds that she has more comfort to give him than he has for her. Marie's reminiscence about her marriage to Eddie causes David to reflect on his own marriage, leading him to make a decision.",
    "Director": "Jean Negulesco",
    "Writer": "Nunnally Johnson, I.A.R. Wylie",
    "Actors": "Bette Davis, Shelley Winters, Gary Merrill",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0044364",
    "tt0040740",
    "tt0043625",
    "tt0045566",
    "tt0042005",
    "tt0043132",
    "tt0047679",
    "tt0043041",
    "tt0047102",
    "tt0043397",
    "tt0044357",
    "tt0044557"
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.700Z"
}