{
  "movieId": "tt0084649",
  "title": "The Secret of NIMH",
  "year": 1982,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-secret-of-nimh-1982_202511",
      "id": "the-secret-of-nimh-1982_202511",
      "title": "The Secret of NIMH (1982)",
      "description": "\"The Secret of NIMH\" follows the story of Mrs. Brisby , a widowed field mouse who struggles to protect her family from the dangers of their home environment, particularly as her son, Timmy , falls ill with pneumonia. With their home being threatened by the plowing of a nearby farm, Mrs. Brisby seeks help from the Great Owl , who advises her to consult the ** rats from the National Institute of Mental Health (NIMH). As Mrs. Brisby ventures into the dark world of the rats, she learns that they have gained extraordinary intelligence due to scientific experimentation conducted on them at NIMH. The leader of the rats, Nicodemus , informs her about their plan to relocate and their past experiences with human cruelty.The main conflict arises when Mrs. Brisby discovers that the farmers want to destroy her home. In a quest to save her family, she must enlist the help of the rats, particularly Justin , a brave and compassionate rat who develops feelings for her. They need to outsmart the farmer’s machinery while dealing with the villainous rat, Jenner , who has his own sinister plans for the group. The film weaves themes of bravery, sacrifice, and friendship, highlighting Mrs. Brisby's determination to protect her children at any cost. Ultimately, with the help of the rats, she manages to save her home and family. The conclusion leaves a sense of hope and community as the rats successfully move to a safer location. \"The Secret of NIMH\" is known for its darker themes and rich animation, emphasizing the struggles of small creatures in a large, hostile world.",
      "fileSize": 1460501480,
      "addedAt": "2026-01-07T00:12:22.159Z",
      "thumbnail": "https://archive.org/services/img/the-secret-of-nimh-1982_202511",
      "language": "eng",
      "year": 1982,
      "collection": "feature_films",
      "downloads": 444
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "82 min",
    "imdbRating": 7.5,
    "imdbVotes": 48409,
    "Genre": "Animation, Adventure, Drama",
    "Plot": "To save her ill son, a field mouse must seek the aid of a colony of rats, with whom she has a deeper link than she suspected.",
    "Director": "Don Bluth",
    "Writer": "Robert C. O'Brien, Don Bluth, John Pomeroy",
    "Actors": "Elizabeth Hartman, Derek Jacobi, Dom DeLuise",
    "Language": "English",
    "Country": "United States",
    "Awards": "2 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt1705952",
    "tt0080531",
    "tt0082484",
    "tt0086497",
    "tt0082968",
    "tt0087910",
    "tt0084674",
    "tt6916348",
    "tt0077900",
    "tt0205750",
    "tt0091328",
    "tt0031397"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.159Z"
}