{
  "imdbId": "tt0025619",
  "title": "Palooka",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Palooka",
      "id": "Palooka",
      "title": "Palooka",
      "description": "Palooka is a 1934 comedy film based on the comic strip by Ham Fisher. Joe Palooka (Stuart Erwin) is a naive young man whose father Pete (Robert Armstrong) was a champion boxer, but his lifestyle caused Joe's mother Mayme (Marjorie Rambeau) to leave him and to take young Joe to the country to raise him. But when a shady boxing manager (Jimmy Durante) discovers Joe's natural boxing talent, Joe decides to follow him to the big city, where he becomes a champion and begins to follow his father's path of debauchery, much of it including the glamorous cabaret singer Nina Madero (Lupe Velez). The film also stars William Cagney, the younger brother of actor James Cagney.",
      "fileSize": 2013611847,
      "addedAt": "2026-01-07T00:06:45.466Z",
      "thumbnail": "https://archive.org/services/img/Palooka",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 28160
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iNoG7NDOyc4",
      "id": "iNoG7NDOyc4",
      "title": "Palooka (1934) [Comedy]",
      "description": "Palooka is a 1934 comedy film directed by Benjamin Stoloff starring Jimmy Durante. It is based on the comic strip by Ham Fisher. The movie was adapted by Jack Jevne, Arthur Kober, Gertrude Purcell, Murray Roth and Ben Ryan from the comic strip. It was directed by Benjamin Stoloff. The film is also known as \"The Great Schnozzle\" in the United Kingdom. \n\nJoe Palooka (Stuart Erwin) is a naive young man whose father Pete (Robert Armstrong) was a champion boxer, but his lifestyle caused Joe's mother Mayme (Marjorie Rambeau) to leave him and to take young Joe to the country to raise him. But when a shady boxing manager (Jimmy Durante) discovers Joe's natural boxing talent, Joe decides to follow him to the big city, where he becomes a champion and begins to follow his father's path of debauchery, much of it including the glamorous cabaret singer Nina Madero (Lupe Vélez). The film also stars William Cagney, the younger brother of actor James Cagney.\n\n---\n\nDirected by Benjamin Stoloff, produced by Edward Small, written by Ham Fisher (comic strip), Jack Jevne (screenplay), Arthur Kober (screenplay), Gertrude Purcell (screenplay), Murray Roth (additional dialogue) and Ben Ryan (additional dialogue), starring Jimmy Durante as Knobby Walsh (Junior), Lupe Vélez as Nina Madero, Stuart Erwin as Joe Palooka, Marjorie Rambeau as Mayme Palooka and Robert Armstrong as Pete 'Goodtime' Palooka.\n\n---\n\nSource: \"Palooka (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 July 2012. Web. 22 July 2012. http://en.wikipedia.org/wiki/Palooka_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:42:04.939Z",
      "thumbnail": "https://i.ytimg.com/vi/iNoG7NDOyc4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAZMnqcyeCseSrE4jNgBD_S6bplCg",
      "duration": 5147,
      "language": "en",
      "year": 1934,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/palooka-1934",
      "id": "palooka-1934",
      "title": "Palooka (1934)",
      "description": "Joe Palooka is a naive young man whose father Pete was a champion boxer, but his lifestyle caused Joe's mother Mayme to leave him and to take young Joe to the country to raise him. Watch on RetroFlix:  https://retroflix.org/palooka-1934/",
      "fileSize": 539692301,
      "addedAt": "2026-01-07T00:10:12.694Z",
      "thumbnail": "https://archive.org/services/img/palooka-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 114
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9P5vULDRyjo",
      "id": "9P5vULDRyjo",
      "title": "Palooka (1934) JIMMY DURANTE",
      "description": "Stars: Jimmy Durante, Lupe Velez, Stuart Erwin, Thelma Todd\n Director: Benjamin Stoloff\n\n A boxing promoter discovers young hunk Palooka and trains him to fight the reigning champ, but a drunken sot, Al McSwatt.",
      "addedAt": "2025-12-26T23:49:32.563Z",
      "thumbnail": "https://i.ytimg.com/vi/9P5vULDRyjo/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB7gOAAoADigIMCAAQARhlIGUoZTAP&rs=AOn4CLAEu3WJ6Pd0r-0CnohLEhh_SA9Sgw",
      "duration": 5146,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_-1_Kc-sslM",
      "id": "_-1_Kc-sslM",
      "title": "Palooka (1934) Comedy, Music Full Length Movie",
      "description": "Knobby discovers young hunk Palooka and trains him to fight the reigning champ, also drunken sot, Al McSwatt.\n\nDirector: Benjamin Stoloff\nWriters: Ham Fisher,, Jack Jevne \nStars: Jimmy Durante, Lupe Velez, Stuart Erwin \nGenres: Classics, Comedy, Sport, Musical  \n\n@CCC \nhttps://www.facebook.com/CultCinemaClassics\nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:51:00.632Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/_-1_Kc-sslM/maxresdefault.webp?v=61642b3f",
      "duration": 5149,
      "language": "en",
      "year": 1934,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "86 min",
    "imdbRating": 6,
    "imdbVotes": 404,
    "Genre": "Comedy, Family, Music",
    "Plot": "Mayme walks out on her husband, Pete Palooka, after he wins the middleweight championship and shows his proclivity for life in the fast lane. She raises son Joe on a farm, by herself. When slippery fight manager Knobby Walsh happens to discover Joe's surprising punching power, he signs him. With current champion Al McSwatt needing an easy opponent, Walsh gets Joe the fight. Palooka steals the championship( and girlfriend Nina Madero) from McSwatt when McSwatt shows up for the fight drunk. Now it's Joe's turn to live in the fast lane, winning fights(that are set ups by Walsh) and drinking hard with vamp Nina. However, when McSwatt and his manager trick Joe into a rematch, it's time to test his real boxing talent.",
    "Director": "Benjamin Stoloff",
    "Writer": "Ham Fisher, Jack Jevne, Gertrude Purcell",
    "Actors": "Jimmy Durante, Lupe Velez, Stuart Erwin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025905",
    "tt0024808",
    "tt0025513",
    "tt0025786",
    "tt0026019",
    "tt0024850",
    "tt0135175",
    "tt0031261",
    "tt0025385",
    "tt0025468",
    "tt0024852",
    "tt0025678"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.694Z"
}