{
  "imdbId": "tt0006409",
  "title": "Beatrice Fairfax",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-beatrice-fairfax",
      "title": "Beatrice Fairfax",
      "id": "silent-beatrice-fairfax"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BeatriceFairfax1916",
      "title": "\"Beatrice Fairfax\" Ep. 10 (1916) featuring Olive Thomas",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"Beatrice Fairfax\" is a crime series, from which a single episode is included in our program to illustrate the work and contributions of our star Olive Thomas.  \"Beatrice Fairfax\" consists of 15 self-contained stories.  The main character (Grace Darling) is a crime-fighting lady in a newspaper advice column, who solves her readers' problems. This is episode 10, entitled \"Play Ball!\".  A certain gambler wishes to make a big gain in a baseball bet by eliminating the star player of the team favored to win. Olive Thomas plays Rita Malone, the girlfriend of the baseball player.  This was her first movie role ever, so we can see the very beginning of her illustrious career, which was cut short by her untimely death in 1920 at the age of 25. Directed by               Theodore W. Wharton and Leopold D. Wharton Produced by             Wharton, Incorporated Scenario by               Basil Dickey       Starring                     Harry Fox, Grace Darling, Olive Thomas, Nigel Barrie, Bruce McRae Cinematography        Levi Bacon Distributed by           International Film Service Release date               October 9, 1916 Running time             24 minutes Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "BeatriceFairfax1916"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "300 min",
    "imdbRating": "7.9",
    "imdbVotes": "75",
    "Genre": "Action, Adventure",
    "Plot": "Episode 7: \"A Name for the Baby\" Beatrice Fairfax receives a pitiful note from Madge Minturn: \"I must have a name for my baby. His father, a well-known lawyer, is to be married to-morrow.\" Beatrice shows the note to Jimmy Barton who wonders if the man could possibly be James Conley, society man and lawyer, who is to wed Margaret Payne. He goes to the Conley law office on the excuse of securing a political interview, and casually mentions Madge Minturn. His suspicions are immediately confirmed, for Conley becomes confused at the name. Beatrice then goes to Madge and hears her story. Conley's father, fearing exposure, advises his son to settle with Madge with money. Conley starts to see Madge and meets her in the woods with the baby. She scorns his offer of money. As he leaves, he sees a tramp lurking in the vicinity, he enters into an agreement with the man to kidnap the woman and baby, and to compel Madge to marry him. Madge places the baby on the grass, and leaves it for a moment to get a drink of water. The tramp secures possession of it and takes it to an abandoned hut. Madge follows. She gains entrance and the tramp overpowers and binds her. The tramp hides the baby in a barn, and then tells Madge that he will kill the infant unless she consents to wed him. Madge struggles to gain her freedom but it is useless. Meantime Beatrice has gone to the home of Margaret and informs her of Conley's duplicity. Margaret consents to aid Madge. Beatrice and Jimmy start for Madge's home. They are told she has been missing several hours. They trace her to the woods, and arrive at the deserted cabin while Madge is vainly trying to escape. A battle between Jimmy and the tramp follows. The tramp is overpowered, Madge is freed, and the baby recovered. The next scene shows the interior of the Payne home the following day, with everything ready for the wedding of Conley and Margaret. The bride enters on the arm of Margaret's father. The ceremony is performed and Conley raises his bride's veil to kiss her. He is amazed to find that the woman he has wed is Madge, Margaret having arranged the details for the substitution. Conley indignantly declares that the ceremony is illegal, as his license calls upon him to marry Margaret. But Beatrice and Jimmy, who are there as guests of Margaret, forestalled such a complication by having Madge procure another license containing her own name. Beatrice has the baby with her. When Conley sees it and realizes how beautiful Madge is in her wedding dress, he agrees to accept her as his wife.",
    "Director": "Leopold Wharton, Theodore Wharton",
    "Writer": "Basil Dickey, Beatrice Fairfax",
    "Actors": "Harry Fox, Grace Darling, Allan Murnane",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0006333",
      "title": "20,000 Leagues Under the Sea",
      "year": 1916,
      "imdbRating": "6.1",
      "imdbVotes": "2,172",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007260",
      "title": "The Return of Draw Egan",
      "year": 1916,
      "imdbRating": "6.2",
      "imdbVotes": "194",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006206",
      "title": "Les Vampires",
      "year": 1915,
      "imdbRating": "7.3",
      "imdbVotes": "5,474",
      "language": "None, French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009682",
      "title": "Tarzan of the Apes",
      "year": 1918,
      "imdbRating": "5.8",
      "imdbVotes": "951",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010446",
      "title": "The Master Mystery",
      "year": 1918,
      "imdbRating": "6.0",
      "imdbVotes": "159",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004465",
      "title": "The Perils of Pauline",
      "year": 1914,
      "imdbRating": "6.4",
      "imdbVotes": "1,106",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010708",
      "title": "Smashing Barriers",
      "year": 1919,
      "imdbRating": "5.7",
      "imdbVotes": "32",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011387",
      "title": "The Last of the Mohicans",
      "year": 1920,
      "imdbRating": "6.7",
      "imdbVotes": "1,472",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011753",
      "title": "Terror Island",
      "year": 1920,
      "imdbRating": "5.4",
      "imdbVotes": "248",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011717",
      "title": "The Son of Tarzan",
      "year": 1920,
      "imdbRating": "5.3",
      "imdbVotes": "148",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034928",
      "title": "The Jungle Book",
      "year": 1942,
      "imdbRating": "6.7",
      "imdbVotes": "4,869",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026772",
      "title": "The New Adventures of Tarzan",
      "year": 1935,
      "imdbRating": "5.3",
      "imdbVotes": "450",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T17:55:57.299Z"
}