{
  "movieId": "tt0063142",
  "title": "Isle of the Snake People",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SnakePeople",
      "id": "SnakePeople",
      "title": "Snake People",
      "description": "The inhabitants of a small, remote island have been practicing voodoo rites and worshipping an evil priest named Damballah for years, but the local law officials generally turn a blind eye to this death cult's bizarre activities. Captain Labesch arrives from the mainland, determined to crack down on the island's lawlessness and clean up the ineffectual, hard-drinking police force. - IMDB Description",
      "fileSize": 2154201651,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/SnakePeople",
      "year": 1971,
      "collection": "feature_films",
      "downloads": 52917
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SnakePeople_201511",
      "id": "SnakePeople_201511",
      "title": "Snake People",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 1705640063,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/SnakePeople_201511",
      "collection": "feature_films",
      "downloads": 37317
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hLxWRURBI4U",
      "id": "hLxWRURBI4U",
      "title": "Snake People (1971) BORIS KARLOFF",
      "description": "Stars: Boris Karloff, Julissa and Carlos East\nDirectors: Juan Ibáñez, Jack Hill\n\nEvil scientist runs a veritable army of LSD crazed zombies. The inhabitants of a small, remote island have been practicing voodoo rites and worshipping an evil priest named Damballah for years, but the local law officials generally turn a blind eye to this death cult's bizarre activities.",
      "addedAt": "2025-12-26T23:57:41.000Z",
      "thumbnail": "https://i.ytimg.com/vi/hLxWRURBI4U/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB9ASAAuADigIMCAAQARhyIFcoNzAP&rs=AOn4CLBafq8NhrQjDlzdVHRCzvqaE7ZNPQ",
      "duration": 5445,
      "language": "en",
      "year": 1971,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "90 min",
    "imdbRating": 3.4,
    "imdbVotes": 1082,
    "Genre": "Horror, Mystery",
    "Plot": "The inhabitants of a small, remote island have been practicing voodoo rites and worshipping an evil priest named Damballah for years, but the local law officials generally turn a blind eye to this death cult's bizarre activities. Captain Labesch arrives from the mainland determined to crack down on the island's lawlessness and clean up the ineffectual, hard-drinking police force. He appeals for assistance from wealthy plantation tycoon Carl Van Molder, who owns nearly half of the island and wields a great deal of influence over the population. Van Molder has made the study of parapsychology his life's work and believes in the secret powers of the mind; he warns Labesch not to interfere with this forgotten island's ancient ways. Also visiting is Van Molder's niece Annabella, a temperance crusader who wants her uncle to help fund the International Anti-Saloon League. She falls in love with handsome police lieutenant Andrew Wilhelm, despite his fondness for rum. Meanwhile, beautiful native girls are being transformed into zombies, and sinister snake dancer Kalea leads them to attack and devour any meddling policemen who get too close to their unholy rituals. When Annabella is kidnapped and prepared to be the cult's latest human sacrifice, Labesch and Wilhelm must infiltrate their ranks to save her, and they finally learn the secret identity of the all-powerful Damballah.",
    "Director": "Juan Ibáñez, Jack Hill",
    "Writer": "Jack Hill, Juan Ibáñez, Luis Enrique Vergara",
    "Actors": "Boris Karloff, Julissa, Carlos East",
    "Language": "Spanish, English",
    "Country": "Mexico, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0067341",
    "tt0067594",
    "tt0067656",
    "tt0072937",
    "tt0068615",
    "tt0070698",
    "tt0069341",
    "tt0069510",
    "tt0065143",
    "tt0068625",
    "tt0067490",
    "tt0068394"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.869Z"
}