{
  "imdbId": "tt0026940",
  "title": "The Roaring West",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Q_e4cbm62Vc",
      "id": "Q_e4cbm62Vc",
      "title": "The Roaring West (1935) BUCK JONES🍕15-CHAPTER CLIFFHANGER",
      "description": "PizzaFLIX Marathon Edition! Complete 15-chapter Cliffhanger!\nStarring: Buck Jones, Muriel Evans, Frank McGlynn Sr., and Silver\nDirector: Ray Taylor\n\nAfter a cowpoke (Buck Jones) and his pals file a claim on some gold-rich land, they are plagued by a crooked ranch foreman who repeatedly tries to steal valuable property rights.\n\n🍕CHAPTERS🍕\n0:00       PizzaFLIX Intro\n01:05     CHAPTER 1:  The Land Rush\n21:31     CHAPTER 2:  Torrent of Terror\n42:14     CHAPTER 3:  Flaming Peril\n1:01:50  CHAPTER 4:  Stampede of Death\n1:22:09  CHAPTER 5:   Danger in the Dark\n1:40:02  CHAPTER 6:  Death Rides the Plains\n1:59:35  CHAPTER 7:  Hurled to the Depths\n2:15:40  CHAPTER 8:  Ravaging Flames\n2:33:06  CHAPTER 9:  Death Holds the Reins\n2:51:08  CHAPTER 10: The Fatal Blast\n3:11:21  CHAPTER 11: The Baited Trap\n3:28:46  CHAPTER 12: The Mystery Shot\n3:48:10  CHAPTER 13: Flaming Torrents\n4:08:13  CHAPTER 14:  Thundering Fury!\n4:24:37  CHAPTER 15:  The Conquering Cowpokes\n4:44:29  Please Subscribe!",
      "addedAt": "2025-12-24T01:07:21.268Z",
      "thumbnail": "https://i.ytimg.com/vi/Q_e4cbm62Vc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLACanVMfW5hhsM4Jl7AHv6zyHuLag",
      "duration": 17087,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "310 min",
    "imdbRating": 6,
    "imdbVotes": 50,
    "Genre": "Western",
    "Plot": "\"The Roaring West\" was Universal's 27th sound-era serial (between \"The Call of the Savage\" and \"Tailspin Tommy in the Great Air Mystery\") and the second of the five serials Buck Jones made at Universal, with his sixth serial \"White Eagle-1941\" coming from Columbia. The Whitman Publishing Company of Racine, Wisconsin also put out two different Big Little Books, \"Buck Jones in 'The Roaring West'-number 1174 and \"Buck Jones in 'The Fighting Rangers' --- number 1188 --- based on this serial with over 100 production stills from the serial in each book. Possibly,but not likely, someday the sources that insist on putting the Pat O'Brien from Warners into the cast of Universal serials will either actually see this (and other Universal serials) and learn that the actor in those was one Pat J. O'Brien, who was nearly always billed just as Pat O'Brien. If they don't care to bother with watching the films, there is the possibility that some kind soul will scan and send them some stills of both Pat O'Briens. The opening chapter of this serial --- \"The Land Rush\" --- finds cowpunchers Montana Larkin and Jinglebob Morgan riding into new territory to join an impending land rush. They carry a mail-order catalog hiding a map giving the location of valuable mineral deposits in the land-rush territory. They stop at the ranch of Jim Parker where Montana saves Parker's daughter Mary from a wild horse. The gabby Jinglebob plays poker with ranch foreman Gil Gillespie and reveals the secret of the map. Gil has his henchman, Hank, steal the map, copy it and return it without being seen. Montana, Jinglebob, Parker, Mary, Gillespie and Ann Hardy, a Parker niece, and some stock-footage land-rushers gather the next day for the land rush, where Montana learns that Gillespie has a copy of the map. Montana is riding hard to beat Gillespie to the mineral deposits but Mary falls from her horse and Montana picks her up on the run but the usually-reliable Silver falls over an unseen embankment, and Montana and Mary are underneath as the other horses and wagons plunge after them. That ends chapter one, but things get worse in chapter two as they find that Gillespie has beaten them to the site and has already staked nine claims. But Gillespie, the cad, is willing to share the claims with old man Parker if he will turn Mary over to Gillespie as his bride. 13 more chapters of such high-handed villainy occur before Montana gets total control of the situation.",
    "Director": "Ray Taylor",
    "Writer": "George H. Plympton, Nate Gatzert, Basil Dickey",
    "Actors": "Buck Jones, Silver, Muriel Evans",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025114",
    "tt0028372",
    "tt0029289",
    "tt0030849",
    "tt0030655",
    "tt0039559",
    "tt0039993",
    "tt0179209",
    "tt0034083",
    "tt0026195",
    "tt0026435",
    "tt0025706"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:37:58.767Z"
}