{
  "imdbId": "tt0037549",
  "title": "The Body Snatcher",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-body.-snatcher.-1945",
      "id": "the.-body.-snatcher.-1945",
      "title": "The Body Snatcher (1945)",
      "description": "The Body Snatcher is a 1945 American horror film directed by Robert Wise, based on the 1884 short story of the same name by Robert Louis Stevenson and  stars Boris Karloff as John Gray. It  follows Dr. MacFarlane and his assistant Fettes in 19th-century Edinburgh as they rely on a grave robber named John Gray to supply cadavers for medical studies. As they become entangled in Gray's dark dealings, they face moral dilemmas and the consequences of their actions when they discover that some of the bodies may have been murdered.",
      "fileSize": 1333653477,
      "addedAt": "2026-01-07T00:12:33.207Z",
      "thumbnail": "https://archive.org/services/img/the.-body.-snatcher.-1945",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 226
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "78 min",
    "imdbRating": 7.3,
    "imdbVotes": 11039,
    "Genre": "Horror, Thriller",
    "Plot": "In Edinburgh in 1831, Dr. Wolfe MacFarlane runs a medical school where Donald Fettes is a student. Fettes is interested in helping a young girl who has lost the use of her legs. He is certain that MacFarlane's surgical skills could be put to great use but he is reluctant to do so. The good Dr. MacFarlane has a secret that soon becomes all too obvious to young Fettes, who has only recently been promoted as his assistant: he has been paying a local cabbie, John Gray, to supply him with dead bodies for anatomical research. Gray constantly harasses MacFarlane and clearly has a hold over him dating to a famous trial many years before where Gray refused to identify the man for whom he was robbing graves. Fettes isn't aware of any of this but soon realizes exactly how Gray obtains the bodies they use in their anatomy classes.",
    "Director": "Robert Wise",
    "Writer": "Robert Louis Stevenson, Philip MacDonald, Val Lewton",
    "Actors": "Boris Karloff, Bela Lugosi, Henry Daniell",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 nominations total"
  },
  "relatedMovies": [
    "tt0038343",
    "tt0034521",
    "tt0036653",
    "tt0038974",
    "tt0036999",
    "tt0036307",
    "tt0036104",
    "tt0036349",
    "tt0036125",
    "tt0037303",
    "tt0024382",
    "tt0057569"
  ],
  "collections": [
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.207Z"
}