{
  "imdbId": "tt0030049",
  "title": "Delinquent Parents",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DelinquentParents",
      "id": "DelinquentParents",
      "title": "Delinquent Parents",
      "description": "An adopted girl struggles between good and evil as her real mother and father discover who she is.",
      "fileSize": 1024239042,
      "addedAt": "2026-01-07T00:06:19.369Z",
      "thumbnail": "https://archive.org/services/img/DelinquentParents",
      "collection": "feature_films",
      "downloads": 2316
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gSZvTmo-C3o",
      "id": "gSZvTmo-C3o",
      "title": "Delinquent Parents (1938)  EXPLOITATION",
      "description": "Stars: Doris Weston, Maurice Murphy, Helen MacKellar\nDirector: Nick Grinde\n\nA Picture You Will Never Forget... Modern Youth In Revolt! A woman is forced to keep her marriage and past indiscretions a secret from those she loves.",
      "addedAt": "2025-12-26T23:56:50.644Z",
      "thumbnail": "https://i.ytimg.com/vi/gSZvTmo-C3o/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBzgWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLC99wlipX-sgUX1XgqiduA4D_VPaQ",
      "duration": 3549,
      "language": "en",
      "year": 1938,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 5,
    "imdbVotes": 70,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "Edythe Ellis, a middle-class , small town girl is secretly married to Charles Wharton, handsome but the weak-willed son of the town mayor, on the eve of his enlistment in World War One. Before he can get away the Armistace is signed, but Charles is reluctant to make their marriage known, not willing to arouse the wrath of his snobbish parents. A speak-easy rendezvous, a few spirited prohibition-era drinks and the inevitable car crash sends Edythe to the hospital where her impending motherhood is discovered. His parents refuse to let Charles see Edythe, after learning she was not seriously hurt. Edythe's mother supports her daughter during her ordeal, but when the child, a girl, is born she insists that it be sent to an orphanage.Edythe, broken hearted, is made to consent to the arrangement. The child, Carol, is adopted by the Caldwells, a kindly couple who have no children of their own, and is brought up to believe she is their own. Carol celebrates her eighteenth birthday in blissful ignorance her identity. At the party she meets her cousin Betty, a typical cigarette smoking, gin-imbibing modern young lady who goes places and knows things. Lots of things and lost of places. Betty knows all about Carol's clouded parentage but has promised never to reveal it. The two girls become close companions, although Carol disapproves of Betty's conduct. Using Carol as a \"front\", Betty arranges clandestine meetings with her boyfriend, Bruce Jefferson, whose father is the publisher of of the town's newspaper. Bruce is a problem boy, whose most recent escapade has left him in toils of the law, as a result of being nabbed in a nightclub raid at which Betty was present but somehow got away. When Bruce meets Carol he falls in love with her at first sight, something which displeases cousin Betty no little bit. Things happen and before long a juvenile court is involved and is presided over by Edythe, Carol's real mother.",
    "Director": "Nick Grinde",
    "Writer": "Nicholas T. Barrows, Robert St. Claire",
    "Actors": "Doris Weston, Maurice Murphy, Helen MacKellar",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030122",
    "tt0031534",
    "tt0028907",
    "tt0031678",
    "tt0030341",
    "tt0031338",
    "tt0029811",
    "tt0031497",
    "tt0031865",
    "tt0028231",
    "tt0032404",
    "tt0028511"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.369Z"
}