{
  "imdbId": "tt0042897",
  "title": "Rocketship X-M",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rocketship.-x-m.-1950",
      "id": "rocketship.-x-m.-1950",
      "title": "Rocketship X-M (1950)",
      "description": "\"Rocketship X-M\" is a 1950 black-and-white science fiction film directed by Kurt Neumann, telling the story of a crew on a mission to the Moon who accidentally land on Mars and discover remnants of a destroyed Martian civilization. The story centers on a group of astronauts who are aboard a rocketship named X-M . As the crew prepares for their journey, they face various challenges and personal tensions. Upon taking off, the crew encounters a severe problem: a meteor shower damages their ship, pushing them off course towards Mars instead of their intended destination. With limited resources and time, they must work together to navigate this crisis. Once they reach Mars, they discover a desolate world, initially believing it to be uninhabited. However, their explorations lead to an encounter with Martian inhabitants, revealing the potential consequences of human presence and intervention on alien soil.",
      "fileSize": 1362837560,
      "addedAt": "2026-01-07T00:10:30.755Z",
      "thumbnail": "https://archive.org/services/img/rocketship.-x-m.-1950",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 214
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": 4.9,
    "imdbVotes": 2662,
    "Genre": "Family, Sci-Fi",
    "Plot": "Astronauts (Lloyd Bridges, Osa Massen, John Emery, Noah Beery, Jr., and Hugh O'Brien) blast off to explore the moon. Because of craft malfunction and some fuel calculations, they end up landing on Mars. On Mars, evidence of a once powerful civilization is found. The scientists determine that an atomic war destroyed most of the Martians (who surprisingly look like humans). Those that survived reverted to a caveman-like existence.",
    "Director": "Kurt Neumann",
    "Writer": "Orville H. Hampton, Kurt Neumann, Dalton Trumbo",
    "Actors": "Lloyd Bridges, Osa Massen, John Emery",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0041514",
    "tt0045064",
    "tt0027882",
    "tt0051622",
    "tt0046192",
    "tt0045553",
    "tt0045655",
    "tt0047590",
    "tt0046316",
    "tt3776510",
    "tt0045091",
    "tt0247746"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.755Z"
}