{
  "imdbId": "tt0048535",
  "title": "Rage at Dawn",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RageAtDawn_618",
      "title": "RageAtDawn 618",
      "description": "Randolph Scott, a special agent from Chicago is sent out west to bring in the notorious Reno brothers",
      "id": "RageAtDawn_618"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Rage_at_Dawn_movie",
      "title": "Rage At Dawn Movie",
      "description": "An account of the Reno brothers of Indiana, who were the first train robbers in America. Based on a story by Frank Gruber. The video quality of this version is better than that of the previous upload.",
      "id": "Rage_at_Dawn_movie"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RageatDawn",
      "title": "RageatDawn",
      "description": "Terrorizing 1866 Indiana, the Reno brothers gang (The first train robbers in American history) uses the town of Seymour as a safe haven, paying off three crooked town officials. Sent in to clean up the gang is Peterson Detective Agency operative James Barlow (Randolph Scott), who poses as an outlaw to gain the confidence of the officials and the thick-headed brothers.",
      "id": "RageatDawn"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6cGrGSoR-Tg",
      "title": "Rage at Dawn (1955) [Western]",
      "description": "\"Rage at Dawn\" is a 1955 Technicolor Western film directed by Tim Whelan, and starring Randolph Scott, Forrest Tucker, Mala Powers, and J. Carrol Naish. It purports to tell the true story of the Reno Brothers, an outlaw gang which terrorized the American Midwest, particularly Southern Indiana, in the period immediately following the American Civil War.\n\nIn this film's version of the story, four of the Reno Brothers are corrupt robbers and killers while a fifth, Clint (Denver Pyle) is a respected Indiana farmer. A sister, Laura (Mala Powers), who has inherited the family home, serves as a housekeeper and cook to the brothers. Some of them served in the Civil War, which has given them a hardened attitude toward violence. One brother is killed when they go after a bank in a nearby town, leading them to draw the conclusion that someone that they know is an informant, as the men of the town appeared to have been waiting for them. They soon learn that it was Murphy, a local bartender, whom they then murder by knocking him out, and tying him up in his barn, which they then set ablaze. The bartender was in fact an agent employed by the Peterson (in real life, Pinkerton) Detective Agency sent to investigate and provide information about the Reno Brothers' crimes.\n\nHis replacement is Scott's character, James Barlow, a former secret agent for the Confederacy, who determines to join the gang by posing as a train robber, a ploy which is aided by his being allowed to pull off a staged train robbery (with the full cooperation of the train crew) in the area. (He also begins courting the sister.) Grudgingly accepted by the brothers (led by Tucker's character, Frank Reno), he soon learns that they have corrupted local officials, including a judge (played by veteran character actor Edgar Buchanan), allowing them to operate in that part of the state with near-impunity. The brothers plan a train robbery with Barlow, but this proves to be a setup in which they are captured following a shootout and taken to an area jail outside the jurisdiction of the corrupted officials. (In the shootout, Barlow's fellow Peterson agent, Monk Claxton, is killed.) Townspeople are incited to mob violence and break into the jail and lynch the brothers before they can be brought to trial despite Barlow's best efforts to stop this. (Apparently the sister accepts his efforts as genuine; in the film's final scene she is still with Barlow.)\n\n----\n\nDirected by Tim Whelan, produced by Nat Holt, screenplay by Horace McCoy, story by Frank Gruber, starring Randolph Scott as James Barlow, Forrest Tucker as Frank Reno, Mala Powers as Laura Reno, J. Carrol Naish as Simeon 'Sim' Reno, Edgar Buchanan as Judge, Myron Healey as John Reno, Howard Petrie as Lattimore - Prosecuting Attorney, Ray Teal as Sheriff of Seymour, William Forrest as William Peterson, Denver Pyle as Clint Reno, Trevor Bardette as Fisher and Kenneth Tobey as Monk Claxton.\n\n---\n\nSource: \"Rage at Dawn\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 23 July 2016. Web. 27 November 2016. https://en.wikipedia.org/wiki/Rage_at_Dawn .\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "id": "6cGrGSoR-Tg",
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rage-at-dawn-1955",
      "title": "Rage At Dawn (1955)",
      "description": "In this film's version of the story, four of the Reno Brothers are corrupt robbers and killers while a fifth, Clint is a respected Indiana farmer. A sister, Laura, who has inherited the family home, serves the outlaw brothers as a housekeeper and cook. One brother is killed when they go after a bank, the men of the town appear to have been waiting for them… Watch on RetroFlix:  https://retroflix.org/rage-at-dawn-1955/",
      "id": "rage-at-dawn-1955"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rage-at-dawn-1955-DVD-mkv",
      "title": "Rage At Dawn (1955) DVD MKV",
      "description": "DVD remux of the 1955 Nat Holt Productions film \"Rage at Dawn.\" IMDb TMDB Wikipedia Rage at Dawn is a 1955 American Technicolor Western film directed by Tim Whelan, and starring Randolph Scott, Forrest Tucker, Mala Powers, and J. Carrol Naish. It purports to tell the true story of the Reno Brothers, an outlaw gang which terrorized the American Midwest, particularly Southern Indiana, in the period immediately following the American Civil War. A more successful version of the Reno brothers' story was released the following year as Love Me Tender, starring Elvis Presley as Clint Reno.",
      "id": "rage-at-dawn-1955-DVD-mkv"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rage-at-dawn-4-k",
      "title": "Rage at dawn (1955) [Colorized, 4k, 60fps]",
      "description": "Rage at dawn is a 1955 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "rage-at-dawn-4-k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RbTBCHJV3iA",
      "title": "Rage at Dawn (1955) RANDOLPH SCOTT",
      "description": "PizzaFLIX FREE FULL MOVIES\nStars: Randolph Scott, Forrest Tucker, Mala Powers\nDirector: Tim Whelan\n\nA special agent from Chicago down south to bring in the notorious Reno brothers gang who are terrorizing Indiana.",
      "id": "RbTBCHJV3iA",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2mcfUKihKtA",
      "title": "Rage at Dawn (1955) RANDOLPH SCOTT",
      "description": "Stars: Randolph Scott, Forrest Tucker, Mala Powers\nDirector: Tim Whelan\n\nA special agent from Chicago is sent out west to bring in the notorious Reno brothers.",
      "id": "2mcfUKihKtA",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "87 min",
    "imdbRating": "5.9",
    "imdbVotes": "1,480",
    "Genre": "Western",
    "Plot": "Terrorizing 1866 Indiana, the Reno brothers gang uses the town of Seymour as a safe haven, paying off three crooked town officials. Sent in to clean up the gang is Peterson Detective Agency operative James Barlow, who poses as an outlaw to gain the confidence of the officials and the thick-headed brothers. Complicating matters are Barlow's feelings for the Reno sister, Laura, who reluctantly keeps house for the boys out of family loyalty. Events heat up and rage surfaces as Barlow sets up the gang in a dawn train robbery.",
    "Director": "Tim Whelan",
    "Writer": "Horace McCoy, Frank Gruber",
    "Actors": "Randolph Scott, Forrest Tucker, Mala Powers",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0048734",
      "title": "Top Gun",
      "year": 1955,
      "imdbRating": "6.2",
      "imdbVotes": "743",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042782",
      "title": "The Nevadan",
      "year": 1950,
      "imdbRating": "6.3",
      "imdbVotes": "1,311",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048336",
      "title": "A Man Alone",
      "year": 1955,
      "imdbRating": "6.4",
      "imdbVotes": "1,227",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048023",
      "title": "Duel on the Mississippi",
      "year": 1955,
      "imdbRating": "5.7",
      "imdbVotes": "233",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049403",
      "title": "Kentucky Rifle",
      "year": 1955,
      "imdbRating": "4.3",
      "imdbVotes": "316",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048339",
      "title": "Man with the Gun",
      "year": 1955,
      "imdbRating": "6.7",
      "imdbVotes": "2,352",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048311",
      "title": "The Lonesome Trail",
      "year": 1955,
      "imdbRating": "5.2",
      "imdbVotes": "79",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0048612",
      "title": "Shotgun",
      "year": 1955,
      "imdbRating": "6.0",
      "imdbVotes": "619",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0048666",
      "title": "Stranger on Horseback",
      "year": 1955,
      "imdbRating": "6.6",
      "imdbVotes": "884",
      "language": "English, Spanish",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0048634",
      "title": "Smoke Signal",
      "year": 1955,
      "imdbRating": "6.2",
      "imdbVotes": "556",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048204",
      "title": "The Indian Fighter",
      "year": 1955,
      "imdbRating": "6.3",
      "imdbVotes": "2,973",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048248",
      "title": "The Kentuckian",
      "year": 1955,
      "imdbRating": "6.2",
      "imdbVotes": "3,206",
      "language": "English, French",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:02:55.578Z"
}