{
  "imdbId": "tt0004091",
  "title": "His Favorite Pastime",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his-favorite-pastime-1914-directed-by-george-nichols",
      "id": "his-favorite-pastime-1914-directed-by-george-nichols",
      "title": "His Favorite Pastime (1914) Directed By George Nichols",
      "description": "His Favourite Pastime Film still Directed by George Nichols Written by Craig Hutchinson Produced by Mack Sennett Starring Charlie Chaplin Roscoe 'Fatty' Arbuckle Peggy Pearce Cinematography Frank D. Williams Distributed by Keystone Studios Release date March 16, 1914 Running time 16 minutes Country United States Language Silent (English intertitles ) His Favorite Pastime is a 1914 American comedy film starring Charlie Chaplin . Synopsis Charlie gets drunk in the bar. He steps outside, meets a pretty woman, tries to flirt with her, only to retreat after the woman's father returns. Returning to the bar, Charlie drinks some more and engages in rogue behaviors with others. He finally leaves the bar, sees the woman leaving, follows the woman home, and proceeds to make a nuisance of himself, eventually getting kicked out of the house. Reviews Although Chaplin had only been making comedies for Mack Sennett's Keystone Studio for less than two months when this film was released in March 1914, a reviewer from Moving Picture World recognized Chaplin's merry-making talents. He wrote, \"The comedian, whose favorite pastime is drinking cocktails, is clever. In fact, [he is] the best one Mack Sennett has ever sprung on the public. He is a new one and deserves mention.\" Motion Picture News was also full of praise for His Favorite Pastime . Its reviewer wrote, \"If there is an audience any where that does not roar when they see this comedy, they cannot be in full possession of their wits. It is absolutely the funniest thing the Keystone Company has ever put out, and this is not written by a press agent. Mr. Chaplin has introduced a number of funny actions that are original to the American stage.\" Cast Charlie Chaplin - Drunken masher Roscoe 'Fatty' Arbuckle - Shabby drunk Peggy Pearce - Beautiful lady From Wikipedia, the free encyclopedia",
      "fileSize": 56075805,
      "addedAt": "2026-01-07T00:08:39.346Z",
      "thumbnail": "https://archive.org/services/img/his-favorite-pastime-1914-directed-by-george-nichols",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 106
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-his-favorite-pastime",
      "id": "silent-his-favorite-pastime",
      "title": "His Favorite Pastime",
      "fileSize": 202386488,
      "addedAt": "2026-01-07T00:10:59.119Z",
      "thumbnail": "https://archive.org/services/img/silent-his-favorite-pastime",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 366
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": 5,
    "imdbVotes": 1253,
    "Genre": "Short, Comedy",
    "Plot": "Charlie gets into a fight at his regular bar and finally crawls out under the door. He then boards a streetcar and follows a beautiful lady in a taxi. He breaks into her home. Her husband comes finds him trying to seduce his wife.",
    "Director": "George Nichols",
    "Writer": "Charles Chaplin, Craig Hutchinson",
    "Actors": "Charles Chaplin, Roscoe 'Fatty' Arbuckle, Peggy Pearce",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0003961",
    "tt0003969",
    "tt0004637",
    "tt0002851",
    "tt0004288",
    "tt0004194",
    "tt0004311",
    "tt0004546",
    "tt0004670",
    "tt0003679",
    "tt0003758",
    "tt0003805"
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}