{
  "imdbId": "tt0056218",
  "title": "The Manchurian Candidate",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-manchurian-candidate",
      "id": "the-manchurian-candidate",
      "title": "The Manchurian Candidate",
      "description": "The name John Frankenheimer became forever synonymous with heart-in-the-throat filmmaking when this quintessential sixties political thriller was released. Set in the early fifties, this razor-sharp adaptation of the novel by Richard Condon concerns the decorated U.S. Army sergeant Raymond Shaw (Laurence Harvey), who as a prisoner during the Korean War is brainwashed into becoming a sleeper assassin in a Communist conspiracy, and a fellow POW (Frank Sinatra) who slowly uncovers the sinister plot. In an unforgettable performance, Angela Lansbury plays Raymond’s villainous mother, the controlling wife of a witch-hunting anti-Communist senator with his eyes on the White House. The rare film that takes aim at the frenzy of the McCarthy era while also being suffused with its Cold War paranoia,  The Manchurian Candidate  remains potent, shocking American moviemaking.",
      "fileSize": 10439267548,
      "addedAt": "2026-01-07T00:12:10.592Z",
      "thumbnail": "https://archive.org/services/img/the-manchurian-candidate",
      "language": "eng",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 44411
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-manchurian-candidate.-1962",
      "id": "the-manchurian-candidate.-1962",
      "title": "The Manchurian Candidate (1962)",
      "description": "The Manchurian Candidate (1962) is a political thriller directed by John Frankenheimer, based on Richard Condon's novel of the same name. The film revolves around the themes of brainwashing, political conspiracy, and Cold War tensions. The story begins during the Korean War, where a platoon of U.S. soldiers is ambushed. Among them is Sgt. Raymond Shaw , played by Laurence Harvey, who ends up being captured by the North Koreans. During his captivity, he is subjected to brainwashing and is indoctrinated with a dangerous mission. Upon returning to the United States, Shaw is hailed as a war hero. However, his fellow soldier, Major Bennett Marco (Frank Sinatra), begins to have disturbing nightmares about their time as prisoners. As he investigates, Marco discovers that Shaw has been programmed to become an assassin, with orders to kill a prominent political figure as part of a communist plot.  The film builds tension as Marco races against time to uncover the conspiracy and save Shaw from his manipulated fate. The finale culminates in a shocking climax that addresses themes of loyalty, manipulation, and the loss of free will.",
      "fileSize": 930841950,
      "addedAt": "2026-01-07T00:12:10.592Z",
      "thumbnail": "https://archive.org/services/img/the-manchurian-candidate.-1962",
      "language": "eng",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 221
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "126 min",
    "imdbRating": 7.9,
    "imdbVotes": 83273,
    "Genre": "Drama, Thriller",
    "Plot": "Major Bennett Marco (Frank Sinatra) is an intelligence officer in the U.S. Army. He served valiantly as a Captain in the Korean war and his Sergeant, Raymond Shaw (Laurence Harvey), even received the Medal of Honor. Marco has a major problem however: he has a recurring nightmare, one where two members of his squad were killed by Shaw. He's put on indefinite sick leave and visits Shaw in New York City. Shaw, for his part. has established himself well, despite the misgivings of his domineering mother, Mrs. Eleanor Shaw Iselin (Dame Angela Lansbury). She is a red-baiter, accusing anyone who disagrees with her right-wing reactionary views of being a Communist. Raymond hates her, not only for how she's treated him, but equally because of his stepfather, the ineffectual U.S. Senator John Iselin (James Gregory), who is intent on seeking higher office. When Marco learns that others in his Korean War unit have had nightmares similar to his own, he realizes that something happened to all of them in Korea, and that Raymond Shaw is the focal point.",
    "Director": "John Frankenheimer",
    "Writer": "Richard Condon, George Axelrod, John Frankenheimer",
    "Actors": "Frank Sinatra, Laurence Harvey, Janet Leigh",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "Nominated for 2 Oscars. 6 wins & 9 nominations total"
  },
  "relatedMovies": [
    "tt0058576",
    "tt0055738",
    "tt0055798",
    "tt0055633",
    "tt0059825",
    "tt0055478",
    "tt0055824",
    "tt0193083",
    "tt0056443",
    "tt0055484",
    "tt0054627",
    "tt0057207"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}