{
  "movieId": "tt0003740",
  "title": "Cabiria",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Cabiria",
      "id": "Cabiria",
      "title": "Cabiria",
      "description": "Silent (No soundtrack) From the Wikipedia entry for \"Cabiria\": Cabiria is a 1914 silent movie from the early years of Italy's movie industry, directed by Giovanni Pastrone (1883-1959). The movie is set in ancient Sicily and Carthage during the period of the Second Punic War (218-202 BC). It follows a melodramatic main plot about an abducted little girl, Cabiria, and features an eruption of Mt. Etna, heinous religious rituals in Carthage, the alpine trek of Hannibal, Archimedes' defeat of the Roman fleet at the Siege of Syracuse and Scipio in North Africa. Apart from being a classic on its own terms, the film is also notable for being the first film in which the long-running film character Maciste makes his debut. According to Martin Scorsese, in this work Pastrone invented the epic movie and deserves credit for many of the innovations often credited to D.W. Griffith and Cecil B. DeMille. Among those were the first use of the moving camera, thus freeing the narrative film from \"static gaze\". Original text can be found at http://en.wikipedia.org/wiki/Cabiria License terms may be found at http://creativecommons.org/licenses/by-sa/3.0/ -This is the 123 minute restored print version.",
      "fileSize": 2339362244,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/Cabiria",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 27478
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-cabiria",
      "id": "silent-cabiria",
      "title": "Cabiria",
      "fileSize": 1092891978,
      "addedAt": "2026-01-07T00:10:59.115Z",
      "thumbnail": "https://archive.org/services/img/silent-cabiria",
      "language": "Italian",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 1562
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "148 min",
    "imdbRating": 7.1,
    "imdbVotes": 4056,
    "Genre": "Adventure, Drama, History",
    "Plot": "Three centuries before Christus. Young Cabiria is kidnapped by some pirates during one eruption of the Etna. She is sold as a slave in Carthage, and as she is just going to be sacrificed to god Moloch, Cabiria is rescued by both Fulvio Axilla, a Roman noble, and his giant slave Maciste. Maciste is captured just after having confided Cabiria to Sophinisbe's safe keeping, while Fulvio Axilla manages to escape from Carthage. Ten years went away with Punic wars before he is able to come back to Carthage...",
    "Director": "Giovanni Pastrone",
    "Writer": "Gabriele D'Annunzio, Titus Livius, Giovanni Pastrone",
    "Actors": "Italia Almirante-Manzini, Lidia Quaranta, Bartolomeo Pagano",
    "Language": "Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008150",
    "tt0173869",
    "tt0007459",
    "tt0020030",
    "tt0017667",
    "tt0055867",
    "tt0060218",
    "tt0051398",
    "tt0070250",
    "tt0250464",
    "tt0057225",
    "tt2071465"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}