{
  "movieId": "tt0024631",
  "title": "Supernatural",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/supernatural_202108",
      "id": "supernatural_202108",
      "title": "Supernatural",
      "description": "Brand New 2K Master! In a departure from her usual comedy roles, screen legend Carole Lombard (Nothing Sacred, Hands Across the Table) co-stars with western icon Randolph Scott (Western Union, Ride the High Country) in this chilling tale of a woman possessed by a murderer’s dark soul. Roma (Lombard), whose twin brother has recently been murdered, becomes easy prey for a corrupt medium who arranges a séance to conjure up the lost twin’s supposedly troubled soul. Meanwhile, a murderess accused of strangling her lover awaits her fate in the electric chair. Before she dies, she agrees to donate her body to a scientist for his unique life-after-death research. Eerily, the doctor’s first experiment on the now-dead woman occurs at precisely the same time as the séance. In an evil twist of fate, Roma becomes possessed by the murderess’ wicked spirit. In a race against time, the doctor and Roma’s fiancé (Scott) struggle to undo the horrible curse in this compelling, inventive and influential ghost story directed by Victor Halperin (White Zombie) Randolph Scott",
      "fileSize": 5260658972,
      "addedAt": "2026-01-07T00:11:35.633Z",
      "thumbnail": "https://archive.org/services/img/supernatural_202108",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 11136
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "65 min",
    "imdbRating": 6.2,
    "imdbVotes": 1023,
    "Genre": "Horror, Mystery, Thriller",
    "Plot": "In New York city, Ruth Rogan is convicted of killing 3 of her lovers and sentenced to be executed. Meanwhile, lovely Roma Courtenay becomes a millionaire heiress when her brother dies. A spiritualist approaches Roma with an urgent message from her dead brother. He runs a rigged seance that doesn't convince Roma's boyfriend Grant but has Roma confused. Then unexpectedly, the executed Ruth Rogan's spirit takes control of Roma's body. Roma runs off with the fake spiritualist under Ruth Rogan's control. Grant desperately tries to track Roma down and return her soul.",
    "Director": "Victor Halperin",
    "Writer": "Garnett Weston, Harvey F. Thew, Brian Marlow",
    "Actors": "Carole Lombard, Randolph Scott, Alan Dinehart",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0024625",
    "tt0024382",
    "tt0024368",
    "tt0023694",
    "tt0020534",
    "tt0073582",
    "tt0185371",
    "tt0053719",
    "tt2364774",
    "tt0034985",
    "tt0052602",
    "tt0024727"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.633Z"
}