{
  "imdbId": "tt0073139",
  "title": "I Wonder Who's Killing Her Now?",
  "year": 1975,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/i-wonder-whos-killing-her-now-1975_202401",
      "id": "i-wonder-whos-killing-her-now-1975_202401",
      "title": "I Wonder Who's Killing Her Now? (1975)",
      "description": "Oliver is in trouble. He's been caught embezzling money from his father's company, and unless he can pay back the $250,000 he took (which he can't), he will be fired from his job, arrested and probably sent to jail. Meanwhile, his rich wife has not only refused to bail him out of this mess, she's planning to divorce him. Desperate, Oliver thinks up a way out. He takes out an insurance policy on his wife with him as the beneficiary, then hires a hit man to kill her. The only problem is that because the doctor who performed the examination is an incompetent fraud, the insurance policy is invalid. Desperate to call off the hit, Oliver tracks down the hit man, only to find that he's subcontracted the killing to another hit man. Tracking down that killer reveals that he, too, has hired it out to a third person, and so on, and so on. Just how many people are trying to kill Oliver's wife? Watch on RetroFlix:  https://retroflix.org/i-wonder-whos-killing-her-now-1975/",
      "fileSize": 971692750,
      "addedAt": "2026-01-07T00:08:46.615Z",
      "thumbnail": "https://archive.org/services/img/i-wonder-whos-killing-her-now-1975_202401",
      "language": "eng",
      "year": 1975,
      "collection": "feature_films",
      "downloads": 342
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "87 min",
    "imdbRating": 3.5,
    "imdbVotes": 229,
    "Genre": "Comedy, Crime",
    "Plot": "Oliver is in trouble. He's been caught embezzling money from his father's company, and unless he can pay back the $250,000 he took (which he can't), he will be fired from his job, arrested and probably sent to jail. Meanwhile, his rich wife has not only refused to bail him out of this mess, she's planning to divorce him. Desperate, Oliver thinks up a way out. He takes out an insurance policy on his wife with him as the beneficiary, then hires a hit man to kill her. The only problem is that because the doctor who performed the examination is an incompetent fraud, the insurance policy is invalid. Desperate to call off the hit, Oliver tracks down the hit man, only to find that he's subcontracted the killing to another hit man. Tracking down that killer reveals that he, too, has hired it out to a third person, and so on, and so on. Just how many people are trying to kill Oliver's wife?",
    "Director": "Steven Hilliard Stern",
    "Writer": "Mickey Rose, Jerry Cutler",
    "Actors": "Bob Dishy, Joanna Barnes, Bill Dana",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0070439",
    "tt0075260",
    "tt0071216",
    "tt0075956",
    "tt0076665",
    "tt0072626",
    "tt0066871",
    "tt0077321",
    "tt0068519",
    "tt0066856",
    "tt0079480",
    "tt0196832"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.615Z"
}