{
  "imdbId": "tt0002303",
  "title": "The Lesser Evil",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-lesser-evil",
      "id": "silent-the-lesser-evil",
      "title": "The Lesser Evil",
      "fileSize": 180463444,
      "addedAt": "2026-01-07T00:11:15.977Z",
      "thumbnail": "https://archive.org/services/img/silent-the-lesser-evil",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 1295
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "17 min",
    "imdbRating": 5.6,
    "imdbVotes": 204,
    "Genre": "Short, Drama",
    "Plot": "As per appointment, the girl goes to meet her sweetheart outside an old shack. This spot is selected as being the most sequestered. Unknown to anyone, this shack is used by a gang of smugglers for the reception of contraband goods for shipment. This gang is just preparing to take away a cargo when the girl arrives. Not finding her sweetheart there, and hearing voices, she imagines he is inside the shack, and enters. The gang becomes panic-stricken at the entrance of an outsider. It is not long before they realize the importance of the situation, and as she has discovered their secret, they dare not leave her behind. Carrying her aboard their ship they sail away, just as the girl's sweetheart, who was late on account of the stopping of his watch, arrives at the place of meeting, and helplessly witnesses their departure. The young man rushing off, gets the Harbor Officers to attempt a rescue. In the meantime, the girl is in great peril on the ship, as the captain, who has locked her in his cabin, defends her from the onslaught of his drunken, mutinous crew. Finally, his ammunition being reduced to one cartridge, she begs that it be turned upon her, choosing death rather than falling into their hands. Good fortune, however, ordains that the rescue party shall deliver her from her peril.",
    "Director": "D.W. Griffith",
    "Writer": "George Hennessy",
    "Actors": "Blanche Sweet, Edwin August, Mae Marsh",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002162",
    "tt0002054",
    "tt0002342",
    "tt0002408",
    "tt0002212",
    "tt0002478",
    "tt0002415",
    "tt0002550",
    "tt0002190",
    "tt0002795",
    "tt0001753",
    "tt0001499"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.977Z"
}