{
  "imdbId": "tt0027727",
  "title": "Hearts in Bondage",
  "year": 1936,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wTB2sdHuSoc",
      "id": "wTB2sdHuSoc",
      "title": "Hearts in Bondage (1936) [Drama] [War]",
      "description": "This 1936 film is in black and white and is a drama based on events in the American Civil War and starts with citizens choosing loyalty to the Confederate States of America or to the Union in the first days of the crisis. Early scenes show the burning of the USS Merrimack by its Union crew to prevent it from falling into Confederate hands. However, the Merrimack, which had been burnt down to the waterline, was later rebuilt by the Confederacy, as an ironclad, and was renamed the CSS Virginia.\n\nThe film shows that, during the war, the Union built its own ironclad, the USS Monitor. When the Virginia emerged on its sortie in the Battle of Hampton Roads it inflicted major damage on the Union fleet in the harbor. Subsequent scenes show the arrival of the Monitor and its battle with the Virginia.\n\nScenes of the battle are dramatic and appear to have been done with actual sailing ships, not models.\n\n---\n\nDirected by Lew Ayres, produced by Nat Levine (producer) and Herman Schlom (executive producer), written by Written by Karl Brown (writer), Olive Cooper (writer), Wallace MacDonald (story) and Bernard Schubert (writer), starring James Dunn as Lieutenant Kenneth Reynolds, Mae Clarke as Constance Jordan, David Manners as Raymond Jordan, Charlotte Henry as Julie Buchanan, Henry B. Walthall as Captain Buchanan, Fritz Leiber, Sr. as Captain John Ericsson, George Irving as Commodore Jordan, Irving Pichel as Secretary of War Sumner Gideon Welles, J.M. Kerrigan as Paddy Callahan, Frank McGlynn Sr. as Abraham Lincoln, Ben Alexander as Eggleston, Oscar Apfel as Captain Gilman, Clay Clement as Lieutenant Worden, Edward Gargan as 'Mac' McPherson, Russell Hicks as Senator Pillsbury, George \"Gabby\" Hayes as Ezra, Douglas Wood as Commodore David G. Farragut, Bodil Rosing as Mrs. Adams, Erville Alderson as Jefferson Davis, John Hyams as Bushnell\nEtta McDaniel as Mammy, Warner Richmond as Bucko and Lloyd Ingraham as Timekeeper.\n\n---\n\nSource: \"Hearts in Bondage\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 28 March 2016. Web. 17 December 2016. https://en.wikipedia.org/wiki/Hearts_in_Bondage\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:40:58.154Z",
      "thumbnail": "https://i.ytimg.com/vi/wTB2sdHuSoc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBCJbrE6ZsqvpAMne4Ocmlu8r6TGg",
      "duration": 3159,
      "language": "en",
      "year": 1936,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hearts_in_bondage",
      "id": "hearts_in_bondage",
      "title": "Hearts In Bondage",
      "description": "Lieutenant Kenneth Reynolds, a Naval officer, falls in love with Constance Jordan. Ken's friends with Raymond Jordan, also in the Navy; he's in love with Julie Buchanan. Captain Buchanan, however, sides with the Confederacy when his home state Virginia secedes, while Constance and Ken stay loyal to the U.S. When ordered to burn the Merrimack with the rest of Gosport Navy Yard as the Confederate militia advance, Ken instead sinks it. He's courtmartialed and thrown out of the Navy. Ken then goes to work for his uncle, John Ericsson, to work on the Monitor. After getting into, and (thanks to some strategic mint juleps) out of, a contract debacle, the Monitor is approved and with some difficulty, launched. Ken then fights and wins a place aboard the Monitor despite his dishonourable discharge. Now he has to fight the Merrimack and a horrible twist of fate, while trying to reconcile Constance and getting some help from a _highly_ unlikely source. [Synopsis by uniQ .] You can find more information regarding this film on its IMDb page .",
      "fileSize": 3303161150,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/hearts_in_bondage",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 115555
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fHEEfM8ryA4",
      "id": "fHEEfM8ryA4",
      "title": "Hearts in Bondage (1936) CIVIL WAR DRAMA",
      "description": "Stars: James Dunn, Mae Clarke, David Manners \n Director: Lew Ayres\n\n Best friends Kenneth Reynolds and Raymond Jordan are U.S. Navy officers, and Kenneth is engaged to Raymond's sister. But the eruption of the Civil War divides them, as Raymond stands by his native Virginia while Kenneth remains on duty as a Northern officer. Kenneth's uncle, John Ericsson, designs a new kind of ship, an ironclad he calls the Monitor. Eventually the war pits Kenneth, on board the Monitor, against his friend Raymond, serving aboard the South's own ironclad, the Merrimac (as it is called here). A naval battle ensues, one that will go down in history.",
      "addedAt": "2025-12-26T23:50:41.511Z",
      "thumbnail": "https://i.ytimg.com/vi/fHEEfM8ryA4/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLBHYgdjayRCO94p82XWQwq88b8WDA",
      "duration": 3158,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3Gv-g_QwfJw",
      "id": "3Gv-g_QwfJw",
      "title": "Hearts in Bondage (1936) Drama, History, Romance Full Length Movie",
      "description": "Inspired romance - Bright gallantry - High courage - Against the blood-stained background of a war-torn nation!  Best friends Kenneth Reynolds and Raymond Jordan are U.S. Navy officers, and Kenneth is engaged to Raymond's sister. But the eruption of the Civil War divides them. \n \nDirector: Lew Ayres\nWriters: Bernard Schubert, Olive Cooper\nStars: James Dunn, Mae Clarke, David Manners \nGenres: Classics, Drama, History, Romance, War\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:51:01.821Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/3Gv-g_QwfJw/maxresdefault.webp?v=6295e1e8",
      "duration": 3161,
      "language": "en",
      "year": 1936,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 5.6,
    "imdbVotes": 245,
    "Genre": "Drama, History, Romance",
    "Plot": "Best friends Kenneth Reynolds and Raymond Jordan are U.S. Navy officers, and Kenneth is engaged to Raymond's sister. But the eruption of the Civil War divides them, as Raymond stands by his native Virginia while Kenneth remains on duty as a Northern officer. Kenneth's uncle, John Ericsson, designs a new kind of ship, an ironclad he calls the Monitor. Eventually the war pits Kenneth, on board the Monitor, against his friend Raymond, serving aboard the South's own ironclad, the Merrimac (as it is called here). A naval battle ensues, one that will go down in history.",
    "Director": "Lew Ayres",
    "Writer": "Bernard Schubert, Olive Cooper, Karl Brown",
    "Actors": "James Dunn, Mae Clarke, David Manners",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030675",
    "tt0025746",
    "tt0135746",
    "tt0027311",
    "tt0027286",
    "tt0028010",
    "tt0027316",
    "tt0027366",
    "tt0028224",
    "tt0035294",
    "tt0027568",
    "tt0028216"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}