{
  "imdbId": "tt0046414",
  "title": "Beat the Devil",
  "year": 1953,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EWkajXClyds",
      "id": "EWkajXClyds",
      "title": "Beat The Devil (1953) [Action] [Adventure] [Comedy]",
      "description": "Beat the Devil is a 1953 British film directed by John Huston, starring Humphrey Bogart, Jennifer Jones and Gina Lollobrigida, and featuring Robert Morley, Peter Lorre and Bernard Lee. Huston and Truman Capote wrote the screenplay, loosely based upon a novel of the same name by British journalist Claud Cockburn, writing under the pseudonym James Helvick. Houston made the film as a parody of a genre of film. Although often described as a parody of The Maltese Falcon, which Huston directed and in which Bogart and Lorre appeared, this is not the case. \n\nThe script, written on a day-to-day basis as the film was shot, concerns the adventures of a motley crew of swindlers and ne'er-do-wells trying to claim land rich in uranium deposits in Kenya as they wait in a small Italian port to travel aboard a tramp steamer en route to Mombasa.\n\n---\n\nPlot: Billy Dannreuther (Humphrey Bogart) is a formerly-wealthy American who has fallen on hard times. He is reluctantly working with four crooks: Peterson (Robert Morley), ex-Nazi Julius O'Hara (Peter Lorre), Major Jack Ross (Ivor Barnard) and Ravello, who are trying to acquire uranium-rich land in British East Africa. Billy suspects that Major Ross murdered a British Colonial officer, who threatened to expose their plan. While waiting in Italy for passage to Africa, Billy and his wife Maria (Gina Lollobrigida) meet a British couple: Harry (Edward Underdown) and Gwendolen Chelm (Jennifer Jones), who plan to travel on the same ship. Harry is a very proper and traditional Englishman, while Gwendolen is flighty and fanciful and a compulsive liar. Billy and Gwendolen have an affair, while Maria flirts with Harry. Peterson becomes suspicious that the Chelms may be attempting to acquire the uranium themselves. His suspicions are unfounded, but they seem to him to be confirmed by Gwendolen, who lies about her husband and exaggerates his importance.\n\nBilly and Peterson are in a car accident and wrongly reported to have been killed. In order to replace Peterson's lost capital, Ravello approaches Harry Chelm and explains their scheme. Just then, to everyone's surprise, Billy and Peterson return to the hotel alive and unharmed. The purser announces that the ship is at last ready to sail. On board, Harry reveals that he knows about Peterson's scheme and intends to inform the authorities. Peterson orders Major Ross to kill Harry, but Billy thwarts the murder attempt. Harry's outraged accusations alienate the ship's drunken captain, who locks Harry in the brig, where he is uncomfortable, but safe from Major Ross.\n\nThe ship's engine malfunctions and the ship sinks. When Billy goes to free Harry he finds that Harry has escaped and left the ship, intending to swim ashore. The passengers abandon the sinking ship in a lifeboat and land on an African beach, where they are arrested by Arab soldiers. They are interrogated by Ahmed, an Arab official who suspects that they may be spies or revolutionaries. Billy befriends Ahmed by talking with him about Rita Hayworth, upon whom Ahmed has a crush. Billy persuades him to send the party back to Italy. When they land, they are met and questioned by a Scotland Yard detective (Bernard Lee), who is investigating the murder of the Colonial officer. Gwendolen reveals Peterson's scheme, and his involvement in the murder, and his attempt to murder Harry, to the detective, who promptly arrests Peterson, O'Hara, Major Ross and Ravello. As the four crooks are led away in handcuffs, Gwendolen receives a telegram from British East Africa saying that Harry has acquired the land Peterson and the others meant to steal, and is now extremely rich and willing to forgive Gwendolen, Billy and Maria. Billy laughs happily, saying \"This is the end, the end!\".\n\n---\n\nDirected and produced by John Huston, screenplay by John Huston and Truman Capote, based on the novel Beat the Devil (1951) by Claud Cockburn (as James Helvick), starring Humphrey Bogart as Billy Dannreuther, Jennifer Jones as Mrs. Gwendolen Chelm, Gina Lollobrigida as Maria Dannreuther, Robert Morley as Peterson, Peter Lorre as Julius O'Hara, Edward Underdown as Harry Chelm, Ivor Barnard as Maj. Jack Ross, Marco Tulli as Ravello, Bernard Lee as Insp. Jack Clayton, Mario Perrone as Purser on SS Nyanga, Giulio Donnini as Administrator, Saro Urzì as Captain of SS Nyanga, Aldo Silvani as Charles, restaurant owner and Juan de Landa as Hispano-Suiza Driver\n\n---\n\nSource: \"Beat the Devil (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc..  27 November 2016. Web. 29 December 2016. https://en.wikipedia.org/wiki/Beat_the_Devil_(film)\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:40:57.651Z",
      "thumbnail": "https://i.ytimg.com/vi/EWkajXClyds/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBV3Gp6wc6jLRYri25skYhtEzseHw",
      "duration": 5354,
      "language": "en",
      "year": 1953,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "AR",
          "AS",
          "AW",
          "BD",
          "BO",
          "BQ",
          "BR",
          "BS",
          "BT",
          "CA",
          "CL",
          "CO",
          "CR",
          "CU",
          "CW",
          "DO",
          "EC",
          "FM",
          "FR",
          "GB",
          "GF",
          "GL",
          "GP",
          "GT",
          "GU",
          "HN",
          "HT",
          "IN",
          "JM",
          "KN",
          "LK",
          "MF",
          "MH",
          "MP",
          "MQ",
          "MS",
          "MV",
          "MX",
          "NI",
          "NP",
          "PA",
          "PE",
          "PK",
          "PR",
          "PW",
          "PY",
          "SR",
          "SV",
          "SX",
          "UM",
          "US",
          "UY",
          "VE",
          "VI"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BeatTheDevil1953",
      "id": "BeatTheDevil1953",
      "title": "Beat the Devil (1953)",
      "description": "A group of crooks are headed to Africa in search of land with Uranium. Mystic Nights Videos",
      "fileSize": 2294291930,
      "addedAt": "2026-01-07T00:06:14.038Z",
      "thumbnail": "https://archive.org/services/img/BeatTheDevil1953",
      "collection": "feature_films",
      "downloads": 265499
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beat-the-devil-1953_202401",
      "id": "beat-the-devil-1953_202401",
      "title": "Beat the Devil (1953)",
      "description": "A group of con artists stake their claim on a bogus uranium mine. Watch on RetroFlix: ",
      "fileSize": 2047133594,
      "addedAt": "2026-01-07T00:07:31.714Z",
      "thumbnail": "https://archive.org/services/img/beat-the-devil-1953_202401",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 321
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beat-the-devil-1953_20250321",
      "id": "beat-the-devil-1953_20250321",
      "title": "Beat the Devil (1953)",
      "description": "A group of con artists stake their claim on a bogus uranium mine. Watch on RetroFlix:  https://retroflix.org/beat-the-devil-1953/",
      "fileSize": 561669576,
      "addedAt": "2026-01-07T00:07:31.714Z",
      "thumbnail": "https://archive.org/services/img/beat-the-devil-1953_20250321",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 132
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beat-the-devil",
      "id": "beat-the-devil",
      "title": "Beat The Devil - Trailer",
      "description": "Trailer for Beat the Devil",
      "fileSize": 64188607,
      "addedAt": "2026-01-07T00:07:31.714Z",
      "thumbnail": "https://archive.org/services/img/beat-the-devil",
      "collection": "feature_films",
      "downloads": 6384
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beat-the-devil-1953-action-adventure-comedy-full-length-film",
      "id": "beat-the-devil-1953-action-adventure-comedy-full-length-film",
      "title": "Beat The Devil ( 1953) Action,  Adventure,  Comedy",
      "description": "In this John Huston film -- which features an unusual mix of adventure, comedy and crime elements -- Billy (Humphrey Bogart) and Maria Dannreuther (Gina Lollobrigida) are among a number of travelers stranded in Italy en route to Africa. While the Dannreuthers seem like an average couple, they have t he same goal as Mrs. Gwendolen Chelm (Jennifer Jones) and some of their other shifty companions -- to lay claim to property that is supposedly rich with uranium.",
      "fileSize": 2047129931,
      "addedAt": "2026-01-07T00:07:31.714Z",
      "thumbnail": "https://archive.org/services/img/beat-the-devil-1953-action-adventure-comedy-full-length-film",
      "collection": "feature_films",
      "downloads": 9130
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beat-the-devil-1953_202303",
      "id": "beat-the-devil-1953_202303",
      "title": "Classic Drama Movies English Subtitles",
      "description": "English subtitles for classic drama movies.",
      "fileSize": 2844279,
      "addedAt": "2026-01-07T00:07:31.714Z",
      "thumbnail": "https://archive.org/services/img/beat-the-devil-1953_202303",
      "collection": "feature_films",
      "downloads": 12556
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beat-the-devil_202407",
      "id": "beat-the-devil_202407",
      "title": "BEAT THE DEVIL (Bogart)",
      "description": "Bogie and, the ever so lovely, Gina Lolobrigida are caught up with a band of ninny rogues who mean to corner the uranium market in Africa from out under the nose of the British government.",
      "fileSize": 77013465,
      "addedAt": "2026-01-07T00:07:31.714Z",
      "thumbnail": "https://archive.org/services/img/beat-the-devil_202407",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 176
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "89 min",
    "imdbRating": 6.4,
    "imdbVotes": 10677,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "A quartet of international crooks (Peterson, O'Hara, Ross and Ravello) are stranded in Italy whilst their steamer is being repaired. With them are the an English couple, the Dannreuthers. The 6 are headed for Africa, presumably to sell vacuum cleaners but all is not as it seems. They are joined by others who apparently have similar designs.",
    "Director": "John Huston",
    "Writer": "Claud Cockburn, Truman Capote, John Huston",
    "Actors": "Humphrey Bogart, Jennifer Jones, Gina Lollobrigida",
    "Language": "Arabic, English, Italian",
    "Country": "United Kingdom, Italy",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0046210",
    "tt0046348",
    "tt0045125",
    "tt0044517",
    "tt0047795",
    "tt0041971",
    "tt0041098",
    "tt0023243",
    "tt0066565",
    "tt0039133",
    "tt0023808",
    "tt0031124"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:02:56.144Z"
}