{
  "movieId": "tt0004693",
  "title": "Those Love Pangs",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-those-love-pangs",
      "id": "silent-those-love-pangs",
      "title": "Those Love Pangs",
      "fileSize": 199010903,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-those-love-pangs",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 542
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/those-love-pangs-1914",
      "id": "those-love-pangs-1914",
      "title": "Those Love Pangs (1914)",
      "description": "Those Love Pangs, also known as The Rival Mashers, is a 1914 American silent comedy film. It was produced by Keystone Studios and starred Charlie Chaplin and Chester Conklin. Watch on RetroFlix.org:   https://retroflix.org/those-love-pangs-1914/",
      "fileSize": 53143658,
      "addedAt": "2026-01-07T00:12:44.283Z",
      "thumbnail": "https://archive.org/services/img/those-love-pangs-1914",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 142
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/those-love-pangs-1914-directed-by-charlie-chaplin",
      "id": "those-love-pangs-1914-directed-by-charlie-chaplin",
      "title": "Those Love Pangs (1914) Directed By Charlie Chaplin",
      "description": "Those Love Pangs Theatrical release poster Directed by Charlie Chaplin Produced by Mack Sennett Starring Charlie Chaplin Chester Conklin Cecile Arnold Vivian Edwards Cinematography Frank D. Williams Production company Keystone Studios Distributed by Mutual Film Release date October 10, 1914 Running time 16 minutes Country United States Languages Silent film English (Original titles) Those Love Pangs , also known as The Rival Mashers , is a 1914 American silent comedy film. It was produced by Keystone Studios and starred Charlie Chaplin and Chester Conklin . Plot The Tramp fights for the attention of the landlady with the Rival (played by Chester Conklin ). The Rival makes his attempt first. While he is talking to the Landlady (played by Helen Carruthers ), the Tramp pokes him with a fork from behind a curtain. The Rival gets upset and the landlady becomes annoyed. The Tramp goes on to talk to her. As the Tramp sweet talks the Landlady, the Rival does the same thing the Tramp did to him. The Landlady gets upset and walks away from the Tramp. Upset, the Tramp takes the Rival outside. [ 1 ] They eventually go their separate ways when the Tramp stays outside a bar and the Rival keeps walking toward a park. Before the Tramp goes into the bar, he is distracted by an attractive girl ( Vivian Edwards ) who walks past and glances at him. The Tramp follows her until her tall boyfriend appears. He runs away immediately. [ 1 ] Once at the park the Tramp finds the Rival being kissed by a girl ( Cecile Arnold ). The girl the Tramp had encountered before ends up at the park as well with her boyfriend. The Tramp becomes jealous of the other two men. He follows the two girls to a theater and sits between them. He finally has the attention of both girls and dozes off. The boyfriend and the Rival come into the theater to find the Tramp with their respective girlfriends, who run away immediately upon seeing their respective boyfriends. When the Tramp finally opens his eyes and realizes what is happening, he falls out of his chair, sending the whole audience into chaos. The film ends with the Tramp getting thrown into the screen. [ 1 ] Cast Charlie Chaplin - The Tramp Chester Conklin - Rival Cecile Arnold - Blonde girl Vivian Edwards - Brunette girl Helen Carruthers - Landlady The cast of the film Theme Harry A. Grace published the article Charlie Chaplin's Films and American Culture Patterns in the Journal of Aesthetics and Art Criticism in which he analyzes Chaplin's films. He categorizes each of Chaplin's films under a category that corresponds to an era of the United States . [ 2 ] According to Grace, seventy-nine percent of the themes in Chaplin's films are about relationships between the sexes. Those Love Pangs was placed under this category. [ 2 ] There is some kind of a battle between the two sexes. Chaplin’s character fights for girls with the other gentlemen in the film. [ 3 ] Reviews A reviewer from Motion Picture World wrote, \"Charles Chaplin and Chester Conklin disport themselves in further love affairs in this number.\" A reviewer from Bioscope wrote \"The volatile Charlie succeeds in making himself agreeable to two ladies at a picture show, but his rivals succeed as usual in reducing him to a state of mental and physical collapse.\" References 1 \"Charlie Chaplin's \"The Rival Mashers\" aka Those Love Pangs\" . Internet Archive. 15 October 2017 . Retrieved 15 October 2017 . 2 Grace, Harry A. (1 January 1952). \"Charlie Chaplin's Films and American Culture Patterns\". The Journal of Aesthetics and Art Criticism . 10 (4): 353–363. doi : 10.2307/426065 . JSTOR   426065 . 3 \"The IBM tramp by Stephen Papson\" . Ejumpcut.org . Retrieved 15 October 2017 . From Wikipedia, the free encyclopedia",
      "fileSize": 110437490,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/those-love-pangs-1914-directed-by-charlie-chaplin",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 111
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": 5.4,
    "imdbVotes": 1197,
    "Genre": "Comedy, Short",
    "Plot": "Charlie and a rival vie for the favors of their landlady. In the park they each fall for different girls, though Charlie's has a male friend already. Charlie considers suicide, is talked out of it by a policeman, and later throws his girl's friend into the lake. Frightened, the girls go off to a movie. Charlie shows up there and flirts with them. Later both rivals substitute themselves for the girls and attack the unwitting Charlie. In an audience-wide fight, Charlie is tossed through the screen.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Chester Conklin, Cecile Arnold",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0003923",
    "tt0004311",
    "tt0003863",
    "tt0004546",
    "tt0004108",
    "tt0004011",
    "tt0004102",
    "tt0004101",
    "tt0003760",
    "tt0004007",
    "tt0004100",
    "tt0004210"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.284Z"
}