{
  "imdbId": "tt0007031",
  "title": "Manhattan Madness",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-movie_20210821",
      "title": "My Movie 20210821",
      "id": "my-movie_20210821"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "50 min",
    "imdbRating": "6.0",
    "imdbVotes": "102",
    "Genre": "Action, Comedy, Romance",
    "Plot": "Steve O'Dare, a rich young man who has lived for some years on his Nevada ranch, returns to New York for a visit. He goes to the University Club, of which he is a member. There follows a week of New York gaiety with his club companions, but Steve fails to get thrills out of the pleasures of the Great White Way. He tells the boys there isn't a thrill in Manhattan. This announcement is made while he is lunching at a country club. Through an open doorway he sees at a table in the garden outside a middle-aged couple of distinguished appearance and a beautiful girl. Upon inquiring of his companions who the people at the table in the garden are he is told that they are the Count and Countess Marinoff and their ward. One of the men at the table offers to bet him $5,000 that if he will stay in New York a week he will get the thrill of his life. Steve takes the bet. Remembering that he has sold stock to Count Marinoff he wonders whether it might not be possible for him to meet the ward. The problem is solved when the Count calls Steve up and asks him to come to his home. Steve goes and meets the ward, who mystifies Steve by making mysterious signs to him. The Count informs Steve that the girl is crazy. A note is passed to Steve by the girl's maid which tells him that the girl is in great peril and wants him to help her. The Count, being called away, the maid directs Steve to go up to the second floor. Ascending the stairs he drops through a trap door on the landing and is bound and gagged by the Count's butler, but the maid releases him, and he telephones to the boys at the club and asks some of them to come out to the Count's house. The boys come, and a battle follows between the Count and his servants on one side, Steve and the clubmen on the other. Steve battles up through the house to the roof with one of the Count's henchmen, who has carried the ward off in his arms early in the conflict. After finally knocking the villain cold Steve searches for the girl but cannot find her. All the men who have been fighting, both his friends and the Count have mysteriously disappeared. As he is at his wits end he sees the face of the butler peeping through a sliding panel in the wall. The panel quickly closes and Steve kicks his way through it and finds himself in a banquet hall where the whole company of his friends and supposed foes are dining together, the persecuted ward beaming at him from the end of the table. It is then explained to Steve by his friend with whom he made the bet that he had been given the promised thrill, the members of the party, except the clubmen, being members of the theatrical profession, especially engaged for the doings. Just then there arrives four of Steve's cowboys, for whom he telephoned at the same time that he telephoned the club. With their aid Steve quickly turns the tables on the jokers. While cowboys cover the party with their guns Steve, announcing that he, like Lochinvar, came out of the west, grabs the girl and rides away with her. She is not an unwilling captive and as hour later the weary party still held under the guns get a wireless from Steve that he is quite willing to pay his bet; he has had the thrill of his life, for he is married and sailing away on his wedding tour.",
    "Director": "Allan Dwan",
    "Writer": "Charles T. Dazey, Frank Mitchell Dazey, E.V. Durling",
    "Actors": "Douglas Fairbanks, Jewel Carmen, John Richmond",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0009142",
      "title": "He Comes Up Smiling",
      "year": 1918,
      "imdbRating": "6.2",
      "imdbVotes": "65",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006751",
      "title": "The Habit of Happiness",
      "year": 1916,
      "imdbRating": "5.8",
      "imdbVotes": "72",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006736",
      "title": "The Good Bad-Man",
      "year": 1916,
      "imdbRating": "6.7",
      "imdbVotes": "270",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010879",
      "title": "When the Clouds Roll by",
      "year": 1919,
      "imdbRating": "6.9",
      "imdbVotes": "1,005",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008309",
      "title": "A Modern Musketeer",
      "year": 1917,
      "imdbRating": "6.6",
      "imdbVotes": "342",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012513",
      "title": "The Nut",
      "year": 1921,
      "imdbRating": "6.5",
      "imdbVotes": "307",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041841",
      "title": "Sands of Iwo Jima",
      "year": 1949,
      "imdbRating": "7.0",
      "imdbVotes": "11,865",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007047",
      "title": "The Matrimaniac",
      "year": 1916,
      "imdbRating": "6.4",
      "imdbVotes": "631",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040474",
      "title": "The Inside Story",
      "year": 1948,
      "imdbRating": "6.6",
      "imdbVotes": "318",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007873",
      "title": "Down to Earth",
      "year": 1917,
      "imdbRating": "6.3",
      "imdbVotes": "82",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008775",
      "title": "Wild and Woolly",
      "year": 1917,
      "imdbRating": "6.4",
      "imdbVotes": "675",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012701",
      "title": "A Small Town Idol",
      "year": 1921,
      "imdbRating": "6.3",
      "imdbVotes": "77",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T07:10:04.052Z"
}