{
  "movieId": "tt0001789",
  "title": "The Miser's Heart",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMisersHeart",
      "id": "TheMisersHeart",
      "title": "The Miser's Heart",
      "description": "A 1911 short directed by D,W. Griffith. A simple story, typical of Griffith with Donald Crisp as one of the cops and Blanch Sweet as the neighbor. Billy Bitzer was cameraman. Notice the AB on the side of the stairs. This was what the American Biograph company used to protect their copyright on their films. You might also note that the burglars are wearing jackets and ties.",
      "fileSize": 376470960,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheMisersHeart",
      "collection": "feature_films",
      "downloads": 1341
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMisersHeart_201404",
      "id": "TheMisersHeart_201404",
      "title": "\"The Miser's Heart\" (1911) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   The Miser's Heart (1911) is a short crime drama directed by D. W. Griffith. This film illustrates the work of actor Robert Harron and cinematographer Billy Bitzer, stars of Silent Hall of Fame. Directed by                          D.W. Griffith Produced by                        Biograph Company Cinematography                Billy Bitzer Starring                               Adolph Lestina, Lionel Barrymore, Ynez Seabury, Robert Harron Distributed by                     The General Film Company Release date                         November 20, 1911 Running time                      16 min. Country                               United States Language                             Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 316713019,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheMisersHeart_201404",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 2095
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-misers-heart",
      "id": "silent-the-misers-heart",
      "title": "The Miser's Heart",
      "fileSize": 442435475,
      "addedAt": "2026-01-07T00:11:15.978Z",
      "thumbnail": "https://archive.org/services/img/silent-the-misers-heart",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 275
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "18 min",
    "imdbRating": 6.3,
    "imdbVotes": 309,
    "Genre": "Short, Crime, Drama",
    "Plot": "An old miser living in an east side tenement, forms quite an attachment for a little child in the same house. The old miser is reputed to keep a large amount of money in a safe in his room, and a couple of crooks decide to take a chance to get it. They enter his room by way of the fire-escape, and tying him to a chair, try to force him to tell the combination of his safe. The little child happens in the room, and to further compel him, they suspend the child out of the window on a rope, threatening to let her drop if he does not give the combination. A tramp sees the child hanging from the window and hastens to the police station for aid. On his way he passes a baker boy from whom he stole a bag of rolls, and the boy, following, has him locked up without giving him a chance to explain the object of his errand. The captain, however, consents to hear the tramp out, and sends a quartet of incredulous policemen, who receive a shock when they find the truth of the tramp's story. The child is saved and the crooks taken into custody.",
    "Director": "D.W. Griffith",
    "Writer": "George Hennessy",
    "Actors": "Adolph Lestina, Ynez Seabury, Wilfred Lucas",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001987",
    "tt0001949",
    "tt0002381",
    "tt0002415",
    "tt0000832",
    "tt0000942",
    "tt0000831",
    "tt0001593",
    "tt0001615",
    "tt0001753",
    "tt0001701",
    "tt0001913"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.978Z"
}