{
  "movieId": "tt0003075",
  "title": "The Little Tease",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewTheLittleTease",
      "id": "PreviewTheLittleTease",
      "title": "\"The Little Tease\" (1913) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Little Tease\" is a short drama, included in our program to illustrate the work of Robert Harron and Billy Bitzer, stars of Silent Hall of Fame.   Directed by               D. W. Griffith Produced by             Biograph Company Scenario by               D. W. Griffith         Starring                     Mae Marsh, Robert Harron, Henry Walthall, W. Chrystie Miller Cinematography        Billy Bitzer Distributed by           The General Film Company, Incorporated Release date               April 12, 1913 Running time             15 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 23267012,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewTheLittleTease",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 1252
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "25 min",
    "imdbRating": 5.7,
    "imdbVotes": 44,
    "Genre": "Short, Drama",
    "Plot": "The supposition was that she was born a tease, for from her first teeth to the time she was almost grown, she vented her witcheries on her unsuspecting parents and the wild things of her mountain home. But that was before the man from the valley lost his way and later found it back again, bearing away the little tease to the valley. While she suffered the qualms of broken faith, her father passed through a like struggle, for he felt the precepts of the \"beloved book\" had failed him. He closed the door of his cabin upon the world and the light from his window, lighting the wayfarer over the mountain path, disappeared. The struggle over, it came hack in its place in time to beckon the little tease as she left the valley behind.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Mae Marsh, W. Chrystie Miller, Kate Bruce",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002342",
    "tt0002400",
    "tt0003497",
    "tt0003170",
    "tt0003436",
    "tt0002968",
    "tt0002391",
    "tt0002303",
    "tt0002512",
    "tt0001510",
    "tt0001733",
    "tt0001973"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}