{
  "movieId": "tt0040647",
  "title": "No Orchids for Miss Blandish",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1948-no-orchids-for-miss-blandish-dados-de-blacke-st.-john-legh-clowes-vose",
      "id": "1948-no-orchids-for-miss-blandish-dados-de-blacke-st.-john-legh-clowes-vose",
      "title": "1948 - No Orchids for Miss Blandish - Dados de Blacke - St. John Legh Clowes - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "fileSize": 490450026,
      "addedAt": "2026-01-07T00:06:03.999Z",
      "thumbnail": "https://archive.org/services/img/1948-no-orchids-for-miss-blandish-dados-de-blacke-st.-john-legh-clowes-vose",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 2289
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "92 min",
    "imdbRating": 6,
    "imdbVotes": 782,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "John Blandish is worth $100 million. His heiress daughter is soon to be wed to Foster Harvey, who believes she's a cold, unfeeling woman, despite loving her. Her cold emotional state is in large part due to leading a restricted life. A low level thug named Johnny overhears their secret wedding night plans, and peddles the idea of robbing her of the $100,000 worth of diamond jewelry with which she will be adorned to two groups of his gangster acquaintances, who are in competition with each other. The robbery doesn't go quite according to plan, with Miss Blandish ultimately being kidnapped and held under the eye of Slim Grisson, the heir apparent as head of the violent Grisson gang, currently run by Ma Grisson. Kidnapping holds higher risk but possible greater reward as everyone figures they can get at least $1 million for her. Ma has no plans of letting her go, killing her after getting the money. But a surprise move by Slim, who has a secret past with Miss Blandish, turns the tables on the kidnapping and in turn Miss Blandish's emotional state. She ends up falling in love with him, and he with her. They know they can't live in either of their worlds, but even if they can escape together, will there be a future for them together always being on the run from both sides as well as the Grisson's competitors?",
    "Director": "St. John Legh Clowes",
    "Writer": "James Hadley Chase, St. John Legh Clowes",
    "Actors": "Jack La Rue, Hugh McDermott, Linden Travers",
    "Language": "English, French",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040779",
    "tt0039220",
    "tt0041187",
    "tt0040237",
    "tt0040257",
    "tt0040366",
    "tt0040444",
    "tt0040512",
    "tt0040160",
    "tt0040947",
    "tt0040723",
    "tt0040636"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:03.999Z"
}