{
  "imdbId": "tt0054315",
  "title": "Ski Troop Attack",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SkiTroopAttack",
      "title": "Ski Troop Attack",
      "description": "In a snowy German forest an American patrol has to cross behind enemy lines by skis in order to blow up an important railroad bridge. The task is made harder by conflicts between the platoon's veteran sergeant (Frank Wolff) and its inexperienced lieutenant (Michael Forest) and by constant attacks by pursuing German troops.",
      "id": "SkiTroopAttack"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zglOM_8P3gM",
      "title": "Ski Troop Attack (1960) | Colorized Public Domain War Movie Directed by Roger Corman",
      "description": "Ski Troop Attack (1960) is an American war film directed by Roger Corman, one of the most prolific independent filmmakers of the 20th century. Produced on a tight budget and filmed in the snowy mountains of South Dakota, this World War II adventure tells the story of a small squad of U.S. ski commandos tasked with disrupting German operations behind enemy lines. Shot back-to-back with The Beast from Haunted Cave (1959) to maximize efficiency, Ski Troop Attack is a prime example of Corman’s ingenuity in low-budget filmmaking.\n\nThis restored and colorized edition brings new life to a wartime action film that combines guerrilla tactics, interpersonal conflict, and suspenseful survival against both enemy soldiers and harsh winter conditions. With its snowbound setting and emphasis on resourcefulness, the film stands out from typical battlefield war dramas of its era.\n\nPlot Summary:\nDuring World War II, a small American ski patrol led by the stern but pragmatic Lieutenant (Michael Forest) is assigned a dangerous mission in enemy territory. Their objective is to sabotage a key bridge and disrupt German troop movements. The squad includes the hotheaded Sergeant (Frank Wolff), whose clashes with the Lieutenant create internal tensions, alongside soldiers played by Richard Sinatra and Wally Campo.\n\nAs the patrol treks through snow-covered wilderness, they encounter German forces and engage in skirmishes that test their resolve. The harsh winter setting becomes as much an enemy as the Axis soldiers, with avalanches, freezing conditions, and isolation intensifying the danger. Despite the squad’s limited supplies and internal disagreements, their determination drives them to complete their mission.\n\nThe climax centers on the sabotage of the enemy-held bridge — a sequence that showcases both the ingenuity of Corman’s direction and the resilience of the soldiers. The men ultimately succeed, though not without losses, underlining the sacrifices of small, unsung units in the broader theater of war.\n\nCast and Crew:\n• Director: Roger Corman\n• Screenplay: Charles B. Griffith\n• Cinematography: Andrew M. Costikyan\n• Editing: Ronald Sinclair\nStarring:\n• Michael Forest as The Lieutenant\n• Frank Wolff as The Sergeant\n• Richard Sinatra as The Private\n• Wally Campo as The Corporal\n• Shelia Carol as German Fraulein\n\nFilm Significance:\nSki Troop Attack is notable for being made with the same cast and crew — and even on the same South Dakota locations — as Corman’s horror-crime hybrid The Beast from Haunted Cave. By reusing resources, Corman demonstrated his trademark ability to stretch small budgets into multiple productions. While modest in scale, the film reflects the independent spirit of 1960s genre cinema and foreshadows the later popularity of small-unit war stories in both film and television.\n\nThe movie also highlights the work of Michael Forest and Frank Wolff, both of whom would go on to long careers in film and television. For Corman fans, it serves as a fascinating entry in his extensive filmography, representing his early experiments outside the horror and science fiction genres.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Ski Troop Attack remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1960 release was filmed in black and white, which added grit but limited its visual impact. By offering a colorized edition, we emphasize the striking winter landscapes, military uniforms, and battle sequences with greater intensity. This approach bridges the gap between historical authenticity and modern audience preferences, making the film more accessible and visually engaging.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including war dramas, Westerns, mysteries, and classic adventures. Our mission is to preserve and revitalize public domain treasures for audiences in the USA, Europe, and worldwide.\n\n#SkiTroopAttack #RogerCorman #1960sWarMovies #PublicDomainMovie #ColorizedClassic #WWIIFilm #ClassicCinema #FilmRestoration #MichaelForest #FrankWolff",
      "id": "zglOM_8P3gM",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LOBd8LVK1zs",
      "title": "Ski Troop Attack (1960) ROGER CORMAN",
      "description": "It's Friday@PizzaFLIX ♥ New High-Definition Scan ♥\nProduced & Directed by: Roger Corman\nStars: Michael Forest, Frank Wolff, Wally Campo\n\nIn this snowbound WWII flick, an American patrol is sent on a deadly mission behind enemy lines to blow up a strategic railroad bridge held by German forces. Their task is complicated by conflicts between the platoon's veteran sergeant and its inexperienced lieutenant.\n\nMovie Class by PizzaFLIX: Legendary cult filmmaker Roger Corman has directed\nover 50 films and produced nearly 400 more. He helped launch the careers\nof Jack Nicholson, Robert De Niro, Charles Bronson, Sylvester Stallone, Monte Hellman, Francis Ford Coppola, Martin Scorsese, Ron Howard, Robert Towne, Peter Bogdanovich, and James Cameron!",
      "id": "LOBd8LVK1zs",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ski-troop-attack-1960",
      "title": "Ski Troop Attack",
      "description": "An American patrol has to cross behind enemy lines by skis in order to blow up an important railroad bridge. The task is made harder by conflicts between the platoon's veteran sergeant and its inexperienced lieutenant and by constant attacks by pursuing German troops.",
      "id": "ski-troop-attack-1960"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "63 min",
    "imdbRating": "4.1",
    "imdbVotes": "653",
    "Genre": "Action, War",
    "Plot": "An American patrol has to cross behind enemy lines by skis in order to blow up an important railroad bridge. The task is made harder by conflicts between the platoon's veteran sergeant and its inexperienced lieutenant and by constant attacks by pursuing German troops.",
    "Director": "Roger Corman",
    "Writer": "Charles B. Griffith",
    "Actors": "Michael Forest, Frank Wolff, Wally Campo",
    "Language": "English, German",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0051887",
      "title": "Machine-Gun Kelly",
      "year": 1958,
      "imdbRating": "6.1",
      "imdbVotes": "2,101",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0056085",
      "title": "How the West Was Won",
      "year": 1962,
      "imdbRating": "7.1",
      "imdbVotes": "24,722",
      "language": "English, Arapaho",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052151",
      "title": "Run Silent Run Deep",
      "year": 1958,
      "imdbRating": "7.3",
      "imdbVotes": "13,494",
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052415",
      "title": "The Young Lions",
      "year": 1958,
      "imdbRating": "7.1",
      "imdbVotes": "9,047",
      "language": "English, French, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052294",
      "title": "Thundering Jets",
      "year": 1958,
      "imdbRating": "6.5",
      "imdbVotes": "81",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054033",
      "title": "The Little Shop of Horrors",
      "year": 1960,
      "imdbRating": "6.2",
      "imdbVotes": "20,527",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053925",
      "title": "House of Usher",
      "year": 1960,
      "imdbRating": "6.9",
      "imdbVotes": "16,233",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054017",
      "title": "Last Woman on Earth",
      "year": 1960,
      "imdbRating": "4.8",
      "imdbVotes": "2,220",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050252",
      "title": "China Gate",
      "year": 1957,
      "imdbRating": "6.2",
      "imdbVotes": "967",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050470",
      "title": "The Guns of Fort Petticoat",
      "year": 1957,
      "imdbRating": "6.3",
      "imdbVotes": "1,673",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050699",
      "title": "Men in War",
      "year": 1957,
      "imdbRating": "7.1",
      "imdbVotes": "3,162",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0052655",
      "title": "A Bucket of Blood",
      "year": 1959,
      "imdbRating": "6.7",
      "imdbVotes": "8,366",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:24.928Z"
}