{
  "imdbId": "tt0014611",
  "title": "Why Worry?",
  "year": 1923,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sIzqWbffrxw",
      "title": "Why Worry? (1923) | Colorized Public Domain Silent Comedy Classic with Harold Lloyd",
      "description": "Why Worry? (1923) is an American silent comedy film directed by Fred C. Newmeyer and Sam Taylor, starring Harold Lloyd, Jobyna Ralston, and John Aasen. Produced by the Harold Lloyd Corporation and distributed by Pathé Exchange, this 63-minute feature was one of Lloyd’s most popular comedies of the 1920s and remains a beloved example of silent-era humor, physical stunts, and clever satire. With Harold Lloyd at the peak of his career, the film showcases his trademark blend of charm, resilience, and inventive comedy that continues to captivate audiences worldwide. This restored and colorized edition brings fresh life to the silent classic, making it more immersive and visually appealing for viewers in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story follows Harold Van Pelham (Harold Lloyd), a wealthy hypochondriac convinced he suffers from countless imaginary illnesses. Seeking relaxation, Harold travels with his nurse to the fictional South American island of Paradiso. Instead of peace and quiet, he arrives during a revolution.\n\nAmid political chaos, Harold befriends the beautiful nurse (Jobyna Ralston) and a gentle giant named Colosso (John Aasen), whose immense size makes him both a comedic ally and a heroic figure. Despite his hypochondria and lack of physical courage, Harold is swept up in the island’s turmoil. Through accidents, misunderstandings, and bold stunts, Harold ends up mistaken for a leader in the conflict.\n\nThe climax builds to a hilariously thrilling showdown where Harold, with the help of Colosso, overcomes his fears, proves his worth, and finds romance with the nurse. The film’s humor stems from Harold’s transformation from a self-absorbed hypochondriac into an unlikely hero, a theme that resonated with audiences of the 1920s.\n\nCast and Crew:\n• Directors: Fred C. Newmeyer, Sam Taylor\n• Producers: Harold Lloyd Corporation\n• Writers: Sam Taylor, Tim Whelan, Ted Wilde\n• Cinematography: Walter Lundin\n\nStarring:\n• Harold Lloyd as Harold Van Pelham\n• Jobyna Ralston as Nurse\n• John Aasen as Colosso\n• Wallace Howe as The Valet\n• Leo White as The Revolutionary\n\nFilm Significance:\nWhy Worry? is a quintessential Harold Lloyd film, combining fast-paced gags, visual inventiveness, and a satirical look at wealth and privilege. Lloyd’s ability to embody the “everyman” while placing him in absurd, larger-than-life situations was key to his worldwide popularity.\n\nThe film also introduced John Aasen, one of the tallest actors of his time, whose presence as Colosso provided both comedic exaggeration and a unique visual counterpart to Lloyd’s smaller stature. Their unlikely partnership became one of the film’s highlights, with Colosso acting as both comic relief and a symbol of friendship and loyalty.\n\nIn the broader scope of silent film history, Why Worry? stands out for its satire of hypochondria and foreign intervention, delivered through slapstick and sight gags. Lloyd’s work, alongside Chaplin and Keaton, helped define the silent comedy era, and this film remains an essential part of his legacy.\n\nEnhanced Public Domain Explanation:\nWhy Worry? (1923) is part of the public domain, allowing it to be preserved, restored, and shared freely. At Colorized Public Domain, we enhance such classics with digital restoration and colorization, reviving the film’s tropical island setting, comedic sequences, and dynamic performances. By adding color to Lloyd’s adventurous misadventures, Colosso’s towering presence, and the revolution’s chaotic backdrop, this edition deepens the viewing experience while maintaining historical authenticity.\n\nWhy Watch This Colorized Edition:\nOriginally presented in black and white, Why Worry? relied on Lloyd’s physicality, set design, and comedic timing to engage audiences. The colorized edition enhances its charm, drawing attention to the tropical island landscapes, comedic costumes, and visual contrasts between Harold and Colosso. It transforms a classic silent film into a vivid experience for modern audiences while keeping its timeless humor intact.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more restored and colorized classics: Colorized Public Domain brings back the magic of Golden Age Hollywood and the silent era for modern viewers. We specialize in preserving and enhancing public domain treasures across comedy, romance, adventure, and more, connecting audiences in the USA, Europe, and worldwide to cinema history.\n\n#WhyWorry1923 #HaroldLloyd #SilentComedy #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #JobynaRalston #JohnAasen #SilentFilmHistory #FilmRestoration #1920sMovies #CultClassicCinema",
      "id": "sIzqWbffrxw",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-why-worry",
      "title": "Why Worry?",
      "id": "silent-why-worry"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "63 min",
    "imdbRating": "7.3",
    "imdbVotes": "2,102",
    "Genre": "Adventure, Comedy, Family",
    "Plot": "Harold Van Pelham (Lloyd) is a hypochondriac, rich businessman who sails to the tropics for his 'health.' Instead of the peace and seclusion he is seeking, he finds himself in the middle of a revolution. He is imprisoned where he befriends the friendly giant, Colosso (Aasen), and they engineer an escape. Together, they quell the revolution.",
    "Director": "Fred C. Newmeyer, Sam Taylor",
    "Writer": "Sam Taylor, Ted Wilde, Tim Whelan",
    "Actors": "Harold Lloyd, Jobyna Ralston, John Aasen",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0015841",
      "title": "The Freshman",
      "year": 1925,
      "imdbRating": "7.5",
      "imdbVotes": "6,373",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0015002",
      "title": "Hot Water",
      "year": 1924,
      "imdbRating": "7.1",
      "imdbVotes": "1,531",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014945",
      "title": "Girl Shy",
      "year": 1924,
      "imdbRating": "7.7",
      "imdbVotes": "3,618",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014429",
      "title": "Safety Last!",
      "year": 1923,
      "imdbRating": "8.1",
      "imdbVotes": "23,503",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013075",
      "title": "Dr. Jack",
      "year": 1922,
      "imdbRating": "7.1",
      "imdbVotes": "1,707",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013201",
      "title": "Grandma's Boy",
      "year": 1922,
      "imdbRating": "7.0",
      "imdbVotes": "1,999",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018051",
      "title": "The Kid Brother",
      "year": 1927,
      "imdbRating": "7.6",
      "imdbVotes": "4,920",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012642",
      "title": "A Sailor-Made Man",
      "year": 1921,
      "imdbRating": "6.8",
      "imdbVotes": "1,285",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1320261",
      "title": "Gulliver's Travels",
      "year": 2010,
      "imdbRating": "4.9",
      "imdbVotes": "76,502",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0058548",
      "title": "Santa Claus Conquers the Martians",
      "year": 1964,
      "imdbRating": "2.7",
      "imdbVotes": "12,783",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0477347",
      "title": "Night at the Museum",
      "year": 2006,
      "imdbRating": "6.5",
      "imdbVotes": "401,598",
      "language": "English, Italian, Hebrew",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044355",
      "title": "Androcles and the Lion",
      "year": 1952,
      "imdbRating": "6.0",
      "imdbVotes": "1,095",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:24.927Z"
}