{
  "movieId": "tt0010258",
  "title": "His Royal Slyness",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his-royal-slyness-1920-directed-by-alfred-j.-goulding-hal-roach",
      "id": "his-royal-slyness-1920-directed-by-alfred-j.-goulding-hal-roach",
      "title": "HIs Royal Slyness (1920) Directed By Alfred J. Goulding, Hal Roach",
      "description": "His Royal Slyness Lobby card Directed by Hal Roach Written by H.M. Walker Produced by Hal Roach Starring Harold Lloyd Mildred Davis Snub Pollard Production company Rolin Films Distributed by Pathé Exchange Release date February 8, 1920 Running time 27 minutes Country United States Languages Silent English intertitles His Royal Slyness is a 1920 American short comedy film featuring Harold Lloyd . It marked the final collaboration with frequent co-star Snub Pollard , who moved on to star in his own series of films following this release. This film was remade in 1927 as Long Fliv the King which featured Oliver Hardy . Plot The Prince of Razzamatazz is in America being educated. He receives a telegram telling him to travel to the Kingdom of Thermosa to vie with a drunken rival, the Prince of Roquefort, to marry \"the fairest bud of the kingdom\": Princess Florelle. The Prince of Razzamatazz is unhappy about this development because he would prefer to marry his girlfriend, Verona Vermuth. When she sees that an \"American boy\", a book agent, bears a striking resemblance to the prince, she convinces the American boy to take the prince's place. His tutor and bodyguard accepts a large bribe to go along with the plan. Immediately after the American boy leaves, the prince informs his girlfriend that since he can no longer be a prince, he is cut off from all royal funds. She quickly turns on him and throws him out of her home. Upon arriving in Thermosa, the American boy has to escape a violent anti-monarchist mob. Once he gets to the palace, he has second thoughts about replacing the prince, but he changes his mind when he sees several pretty ladies-in-waiting and Princess Florelle. Florelle eventually chooses the American boy over the Prince of Roquefort. Shortly afterward, the real Prince of Razzamatazz arrives and exposes the American boy as a fraud. The boy is thrown out onto the street just as the agitated anti-monarchist mob is attacking the royal palace. The American boy accidentally fires a cannon into the palace—winning himself the new job as the country's president, while the monarchy topples. As president, he intervenes to rescue Florelle and her parents from the mob, using his presidential powers. Cast Harold Lloyd as The American Boy Mildred Davis as Princess Florelle of Thermosa Harry \"Snub\" Pollard as Prince of Roquefort Gus Leonard as King Louis XIVIIX of Thermosa / Bolshevik orator Noah Young as Count Nichola Throwe, Bodyguard Gaylord Lloyd as Prince of Razzamatazz (uncredited) Marie Mosquini as Verona Vermuth (uncredited) Hazel Powell as Verona's maid (uncredited) Helen Gilmore as Queen of Thermosa (uncredited) William Gillespie as Courtier / Revolutionary (uncredited) Sammy Brooks (uncredited) Estelle Harrison as Court Assistant (uncredited) Wallace Howe as Courtier/Revolutionary (uncredited) Robert Emmett O'Connor (uncredited) Charles Stevenson as Book Refuser/Courtier (uncredited)",
      "fileSize": 2974365404,
      "addedAt": "2026-01-07T00:08:39.346Z",
      "thumbnail": "https://archive.org/services/img/his-royal-slyness-1920-directed-by-alfred-j.-goulding-hal-roach",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 112
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-his-royal-slyness",
      "id": "silent-his-royal-slyness",
      "title": "His Royal Slyness",
      "fileSize": 1741081213,
      "addedAt": "2026-01-07T00:10:59.119Z",
      "thumbnail": "https://archive.org/services/img/silent-his-royal-slyness",
      "language": "English",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 514
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "27 min",
    "imdbRating": 6.2,
    "imdbVotes": 819,
    "Genre": "Comedy, Short",
    "Plot": "An American book salesman (Lloyd) is persuaded to go to the kingdom of Thermosa to impersonate the Prince. He is greeted by a peasants' revolt before the real prince shows up to claim his throne and princess. The revolution succeeds and the American is elected president of the new republic.",
    "Director": "Hal Roach",
    "Writer": "H.M. Walker",
    "Actors": "Harold Lloyd, Mildred Davis, 'Snub' Pollard",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0011293",
    "tt0011144",
    "tt0011223",
    "tt0010311",
    "tt0010656",
    "tt0009887",
    "tt0008860",
    "tt0009932",
    "tt0009973",
    "tt0009986",
    "tt0010006",
    "tt0010382"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}