{
  "imdbId": "tt0039694",
  "title": "The Paradine Case",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1947-paradine-case-agonia-de-amor-alfred-hitchcock-leg",
      "title": "1947 - Paradine Case - Agonía de amor - Alfred Hitchcock - Leg",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "id": "1947-paradine-case-agonia-de-amor-alfred-hitchcock-leg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/paradinecase",
      "title": "The Paradine Case",
      "description": "Title: The Paradine Case Summary: A happily married London barrister falls in love with the accused poisoner he is defending. Directed by: Alfred Hitchcock Actors: Gregory Peck, Ann Todd, Charles Laughton Production Company: Selznick International Pictures Release Date: 26 August 1949 (Sweden) Aspect Ratio: 1.37 : 1 Highly successful London barrister Anthony Keane takes on the case of Italian Maddalena Paradine who is accused of poisoning her blind military hero husband. Keane comes increasingly under her spell, threatening both his marriage and his career.",
      "id": "paradinecase"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-paradine-case-1947",
      "title": "The Paradine Case (1947)",
      "description": "Attorney Anthony Keane agrees to represent Londonite Mrs. Paradine, who has been fingered in her husband's murder. From the start, the married lawyer is drawn to the enigmatic beauty, and he begins to cast about for a way to exonerate his client. Keane puts the Paradine household servant on the stand, suggesting he is the killer. But Keane soon loses his way in the courtroom, and his half-baked plan sets off a stunning chain of events. Watch on RetroFlix:  https://retroflix.org/the-paradine-case-1947/",
      "id": "the-paradine-case-1947"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-paradine-case-1947-drama",
      "title": "The Paradine Case (1947 Film Noir, Drama)",
      "description": "PLOT: A happily married London barrister falls in love with the accused poisoner he is defending. TRIVIA : 01) When Alfred Hitchcock delivered the completed movie to the studio, after a Hitchcock record of ninety-two days of filming, it ran almost three hours. This rough cut was initially trimmed to two hours and twelve minutes, which was the version screened for the Academy of Arts & Sciences. In this version, Ethel Barrymore can be seen as the half-crazed wife of Lord Horfield, which explains the Oscar nomination for her performance (there was apparently a brilliant museum scene where Lady Horfield requests Anthony Keane to save Mrs. Paradine, and another scene where Lady Horfield tries to hide her coughing from her husband). Producer David O. Selznick subsequently cut the film to two hours and five minutes, and then to its present length of one hour and fifty-four minutes, in which Barrymore's screen time totals about three minutes. In 1980, a flood reputedly destroyed the original, uncut version, making the restoration of the cut scenes unlikely, although it has been reported that some of these cut scenes reside at the George Eastman House in Rochester, New York. 02) Alfred Hitchcock's last movie under contract with David O. Selznick. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "id": "the-paradine-case-1947-drama"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "125 min",
    "imdbRating": "6.5",
    "imdbVotes": "12,601",
    "Genre": "Crime, Drama, Romance",
    "Plot": "Following a short investigation, the London Police charge Maddalena Paradine with the poisoning murder of her older, blind husband, retired Colonel Richard Paradine, who was dependent on her and others to manage in his life due to his physical disability. She is up front about being a woman with a past, she only becoming wealthy and thus glamorous because of the marriage. Her personal solicitor Sir Simon Flaquer refers the case to his colleague Tony Keane. In spending time with Mrs. Paradise in prison, Tony is immediately attracted to her, that attraction which morphs into obsession. As such, Tony does whatever he can to clear her of the charges, either in mounting a defense of suicide, assisted or not, or that someone else killed him, the most likely candidate being the Colonel's trusted valet, Andre Latour, with who Tony initially believes Mrs. Paradise was having an affair. In the process, Tony may be blinded to the evidence as it presents itself. Who can see what is going on is Tony's wife Gay Keane, who not only believes their marriage has been a perfect one up to this point, but that he truly does believe his obsession with Mrs. Paradine being love, which Gay herself does not believe it to be. Gay can only stand by and hope for a specific verdict in the case so that Tony can return to her wholeheartedly without the specter of Mrs. Paradine hanging over their marriage.",
    "Director": "Alfred Hitchcock",
    "Writer": "Robert Hichens, Alma Reville, David O. Selznick",
    "Actors": "Gregory Peck, Ann Todd, Charles Laughton",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0031505",
      "title": "Jamaica Inn",
      "year": 1939,
      "imdbRating": "6.3",
      "imdbVotes": "11,887",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040481",
      "title": "It Always Rains on Sunday",
      "year": 1947,
      "imdbRating": "7.1",
      "imdbVotes": "2,505",
      "language": "English, Yiddish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038342",
      "title": "Bedelia",
      "year": 1946,
      "imdbRating": "6.6",
      "imdbVotes": "397",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040768",
      "title": "Secret Service Investigator",
      "year": 1948,
      "imdbRating": "5.9",
      "imdbVotes": "50",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041663",
      "title": "Mr. Soft Touch",
      "year": 1949,
      "imdbRating": "6.6",
      "imdbVotes": "1,374",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041911",
      "title": "The Spider and the Fly",
      "year": 1949,
      "imdbRating": "6.7",
      "imdbVotes": "412",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038109",
      "title": "Spellbound",
      "year": 1945,
      "imdbRating": "7.5",
      "imdbVotes": "53,812",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028231",
      "title": "Secret Agent",
      "year": 1936,
      "imdbRating": "6.4",
      "imdbVotes": "9,469",
      "language": "English, French, German, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029811",
      "title": "Young and Innocent",
      "year": 1937,
      "imdbRating": "6.8",
      "imdbVotes": "11,597",
      "language": "English, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019702",
      "title": "Blackmail",
      "year": 1929,
      "imdbRating": "6.9",
      "imdbVotes": "12,379",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0058329",
      "title": "Marnie",
      "year": 1964,
      "imdbRating": "7.1",
      "imdbVotes": "56,508",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025452",
      "title": "The Man Who Knew Too Much",
      "year": 1934,
      "imdbRating": "6.7",
      "imdbVotes": "22,708",
      "language": "English, German, Italian, French",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}