{
  "movieId": "tt0019421",
  "title": "Steamboat Bill, Jr.",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SteamboatBillJr",
      "id": "SteamboatBillJr",
      "title": "Steamboat Bill, Jr.",
      "description": "Steamboat Bill, Jr. is the story of a naive, college-educated dandy who must prove himself to his working-class father, a hot-headed riverboat captain, while courting the daughter of his father's rival, who threatens to put Steamboat Bill, Sr. and his paddle-wheeler out of business.",
      "fileSize": 3651788987,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/SteamboatBillJr",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 82952
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SteamboatBillJr.720p1928",
      "id": "SteamboatBillJr.720p1928",
      "title": "Steamboat Bill, Jr.",
      "description": "Title: Steamboat Bill, Jr. Summary: The effete son of a cantankerous riverboat captain comes to join his father's crew. Directed by: Charles Reisner, Buster Keaton Actors: Production Company: Buster Keaton Productions Release Date: 20 May 1928 (USA) Aspect Ratio: 1.33 : 1 Following through on a promise to his mother, William Canning Jr. goes to River Junction to meet his father who has not seen him since he was a child. The younger Canning isn't quite what the elder was expecting but the old man has bigger problems. He's being put out of business by J.J. King, who not only owns the local hotel and bank, but has recently introduced a new paddle wheel steamer that puts Cannings older boat, the Stonewall Jackson, to shame. Bill Jr. and Kitty King take a liking to each other much to the dismay of both of their fathers. When a fierce storm hits River Junction, Bill Jr. is forced to save Kitty, her father and his father.",
      "fileSize": 678216318,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/SteamboatBillJr.720p1928",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 1347
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SteamboatBillJr_201411",
      "id": "SteamboatBillJr_201411",
      "title": "\"Steamboat Bill, Jr.\" (1928) starring Buster Keaton",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Steamboat Bill, Jr.\" is a classic Buster Keaton comedy.  It was the last film produced independently by Buster Keaton, who was forced to become a part of MGM, a move that destroyed his creativity and ended his amazing string of short and feature comedy masterpieces that he created for almost a whole decade.    The film contains probably the single most dangerous stunt of the Silent Era and of the history of film-making.  The entire facade of a 2-story house falls on top of Buster Keaton, who survives thanks to standing exactly in the way of an open window.  This was all real without camera tricks and he could have been killed if his position was off by a few inches.  Buster Keaton had many problems at the time: his marriage was collapsing and he knew that after this film he would lose his independence, all of which may have played a part in his decision to attempt this stunt.  It is said that film crew members left the scene fearing a possible disaster.  Fortunately all ended well and we have another Buster Keaton masterpiece. \"Steamboat Bill, Jr.\" is ranked number 24 in the list of The Top 100 Silent Era Films of the influential website Silent Era.  In 2016 the film was selected for preservation in the National Film Registry as being deemed \"culturally, historically, or aesthetically significant.\" The film has an outstanding 7.9 rating in IMDB. Directed by               Charles F. Reisner, Buster Keaton Produced by             Joseph Schenck, Buster Keaton Scenario by                Carl Harbaugh           Based on                    a screen story by Carl Harbaugh Starring                     Buster Keaton, Ernest Torrence, Marion Byron, Tom McGuire, Tom Lewis Cinematography        Dev Jennings and Bert Haines Distributed by           United Artists Release date               May 12, 1928 Running time             67 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 873714435,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/SteamboatBillJr_201411",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 7636
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mW1wrKe2xm4",
      "id": "mW1wrKe2xm4",
      "title": "Steamboat Bill Jr (1928) | Colorized Public Domain Buster Keaton Classic Silent Comedy Restored",
      "description": "Steamboat Bill Jr (1928) is one of the greatest silent comedy films ever made, directed by Charles Reisner and starring the legendary Buster Keaton. This colorized and restored edition brings fresh life to Keaton’s timeless slapstick masterpiece, introducing his genius to modern audiences in the United States, Europe, and worldwide. With its daring stunts, heartfelt story, and unmatched visual comedy, this film remains a cornerstone of cinema history and a perfect showcase of Keaton’s creative brilliance.\n\nPlot Summary:\nSet along the Mississippi River, the story follows William Canfield Jr (Buster Keaton), the sensitive and bookish son of gruff steamboat captain William Canfield Sr (Ernest Torrence). When Bill Jr arrives to meet his father, it quickly becomes clear that he does not fit the rugged image his father had hoped for. Matters complicate when Bill Jr falls in love with Kitty King (Marion Byron), the daughter of Canfield’s rival, J J King (Tom McGuire). The family feud over steamboat competition intensifies, but Keaton’s character must prove his courage when a raging storm hits the town.\n\nThe film’s most famous sequence features Keaton performing one of cinema’s most iconic stunts: standing still as the façade of a collapsing house falls around him, only surviving because he is perfectly aligned with the open window frame. This breathtaking stunt, performed without camera tricks, symbolizes Keaton’s fearless approach to physical comedy and his unrivaled precision as a performer.\n\nCast and Crew:\n• Director: Charles Reisner\n• Producer: Joseph M Schenck\n• Story by: Carl Harbaugh\n• Cinematography: Bert Haines, Dev Jennings\n• Editing: Bert Haines\nStarring:\n• Buster Keaton as William Canfield Jr\n• Ernest Torrence as William Canfield Sr\n• Marion Byron as Kitty King\n• Tom McGuire as J J King\n• Tom Lewis as Tom Carter\n• James T Mack as Minister\n\nFilm Significance:\nSteamboat Bill Jr was Buster Keaton’s last independently produced feature before joining MGM, marking the end of his creative freedom era. Though not a major box office hit upon release, it has since been recognized as one of Keaton’s finest achievements, celebrated for its groundbreaking stunt work and emotional depth. Today, critics rank it among the greatest comedies of all time, influencing generations of filmmakers and comedians.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Steamboat Bill Jr remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1928 release was entirely black and white, typical of the silent film era. While historically important, many modern audiences overlook silent black-and-white films. By offering a colorized and restored edition, we bridge the gap between historical preservation and contemporary entertainment, making Keaton’s daring stunts and heartfelt comedy more accessible to a new generation.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including forgotten B-movies, early Hollywood dramas, and iconic comedies. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#SteamboatBillJr #BusterKeaton #SilentFilm #PublicDomainMovie #ColorizedClassic #SilentComedy #ClassicCinema #FilmRestoration #1920sMovies #PhysicalComedy",
      "addedAt": "2025-12-24T00:49:20.016Z",
      "thumbnail": "https://i.ytimg.com/vi/mW1wrKe2xm4/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYUyBkKGUwDw==&rs=AOn4CLBlczJ_ET-579fwoZ5Ej7cVaF8WmA",
      "duration": 4207,
      "language": "en",
      "year": 1928,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/steamboat-bill-jr.-1928_202505",
      "id": "steamboat-bill-jr.-1928_202505",
      "title": "Steamboat Bill, Jr. (1928)",
      "description": "The just-out-of-college, effete son of a no-nonsense steamboat captain comes to visit his father whom he's not seen since he was a child. Watch on RetroFlix:  https://retroflix.org/steamboat-bill-jr-1928/",
      "fileSize": 432132630,
      "addedAt": "2026-01-07T00:11:35.628Z",
      "thumbnail": "https://archive.org/services/img/steamboat-bill-jr.-1928_202505",
      "language": "eng",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 108
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/steamboat-bill-jr.-reisner-1928-high-quality-1080p-h-2r-np-17ccf-u",
      "id": "steamboat-bill-jr.-reisner-1928-high-quality-1080p-h-2r-np-17ccf-u",
      "title": "Steamboat Bill Jr. (1928) HD with Score",
      "description": "The just out of college effete son of a no-nonsense steamboat captain comes to visit his father whom he's not seen since he was little.",
      "fileSize": 3573883212,
      "addedAt": "2026-01-07T00:11:35.628Z",
      "thumbnail": "https://archive.org/services/img/steamboat-bill-jr.-reisner-1928-high-quality-1080p-h-2r-np-17ccf-u",
      "collection": "feature_films",
      "downloads": 3609
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/steamboat-bill-jr_1928",
      "id": "steamboat-bill-jr_1928",
      "title": "Steamboat Bill, Jr.",
      "fileSize": 10264801264,
      "addedAt": "2026-01-07T00:11:35.629Z",
      "thumbnail": "https://archive.org/services/img/steamboat-bill-jr_1928",
      "language": "English",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 481
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/steamboat_bill_ipod",
      "id": "steamboat_bill_ipod",
      "title": "Steamboat Bill Jr.",
      "description": "Steamboat Bill, Jr. is the story of a naive, college-educated dandy who must prove himself to his working-class father, a hot-headed riverboat captain, while courting the daughter of his father's rival, who threatens to put Steamboat Bill, Sr. and his paddle-wheeler out of business. Originally uploaded by: www.k-otic.com",
      "fileSize": 1578419498,
      "addedAt": "2026-01-07T00:11:35.629Z",
      "thumbnail": "https://archive.org/services/img/steamboat_bill_ipod",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 120910
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eu0MxIWwIjc",
      "id": "eu0MxIWwIjc",
      "title": "Steamboat Bill, Jr. (1928) Buster Keaton, Marion Byron | Silent, Action | Full Movie, Subtitles",
      "description": "Fun! - Fast and Furious - runs riot on the Mississippi.\nThe just out of college, the pretentious son of a no-nonsense steamboat captain comes to visit his father whom he’s not seen since he was little.\n\nOriginal title: Steamboat Bill, Jr. (1928)\nColorized version: https://youtu.be/H4s8EGY7cmg\nDirectors: Charles Reisner, Buster Keaton\nWriter: Carl Harbaugh\nStars: Buster Keaton, Marion Byron, Ernest Torrence, Tom McGuire, \nGenres: Action, Comedy, Drama, Family, Romance\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:41:58.958Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/eu0MxIWwIjc/maxresdefault.webp?v=648a4886",
      "duration": 4224,
      "language": "en",
      "year": 1928,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "70 min",
    "imdbRating": 7.8,
    "imdbVotes": 16421,
    "Genre": "Action, Comedy, Drama",
    "Plot": "Following through on a promise to his mother, William Canning Jr. goes to River Junction to meet his father who has not seen him since he was a child. The younger Canning isn't quite what the elder was expecting but the old man has bigger problems. He's being put out of business by J.J. King, who not only owns the local hotel and bank, but has recently introduced a new paddle wheel steamer that puts Cannings older boat, the Stonewall Jackson, to shame. Bill Jr. and Kitty King take a liking to each other much to the dismay of both of their fathers. When a fierce storm hits River Junction, Bill Jr. is forced to save Kitty, her father and his father.",
    "Director": "Charles Reisner, Buster Keaton",
    "Writer": "Carl Harbaugh, Buster Keaton",
    "Actors": "Buster Keaton, Tom McGuire, Ernest Torrence",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    "tt0020234",
    "tt0020135",
    "tt0018742",
    "tt0016013",
    "tt0016051",
    "tt0017765",
    "tt0017925",
    "tt0021198",
    "tt0347938",
    "tt0029939",
    "tt0026593",
    "tt0033058"
  ],
  "collections": [
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.629Z"
}