{
  "imdbId": "tt0060265",
  "title": "The Chinese Room",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheChineseRoom",
      "id": "TheChineseRoom",
      "title": "The Chinese Room",
      "description": "The Chinese Room is an award-winning 2009 independent feature. It was shot on location in Washington, DC with an all-local cast and crew. It is a self-financed thriller inspired by the famous thought experiment by John Searle. Synopsis: John is a \"real live John Doe,\" on the run when he finds the perfect job: quiet work, cash under the table, no questions asked. But in this office, the manager Bouchard enforces his list of freakish rules with charisma and cruelty, and forces John to betray his colleagues, filing reports on their lives. The more John learns to fear the office, the more he becomes a part of it. But - what is The Chinese Room?",
      "fileSize": 1807867791,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheChineseRoom",
      "language": "English",
      "collection": "feature_films",
      "downloads": 57734
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 5,
    "imdbVotes": 32,
    "Genre": "Drama, Horror, Mystery",
    "Plot": "Welcome to a place where the men and women are young and beautiful, and they are fabulously wealthy, living in mansions overlooking the ocean! Indeed, even the servants are gorgeous! Where is this magical place? Well, from the characters' names we would assume a Spanish-speaking country. (It was actually filmed in Acapulco.) But most of the actors are Americans, and everyone speaks perfect English, including the servants. Any place with palm trees and an ocean view should work...The overall acting and editing are very good. There are also several dream/nightmare sequences, which create an eerie psychedelic feeling. Well done! Of course, we now come to the \"story\", and this is where things fall apart. I have seen this movie twice; it is complicated. Here is the gist: Nicolás Vidal (played by Carlos Rivas) is the owner of the powerful Cervantes Bank. In spite of great success, he is a troubled man: An employee at the bank, Juan Cervantes (played by Jorge Rado), by dint of his surname, should be the rightful owner of the bank. But Nicolás' father swindled the bank away from Juan's father years ago, and both sons know it. Curiously, Juan is not bothered at all; he is perfectly happy to be just a regular employee at the bank. Nicolás, in contrast, has regular nightmares, as he carries the guilt of his father's actions. Nicolás has been receiving threatening letters from someone promising his imminent death. Maybe it's not his fault he cannot sleep! In a second thread, Nicolás' young maid Consuelo (played by Gloria Leticia Ortiz) is madly in love with him. At the very beginning of the movie, she in fact tries to kill herself. As a \"maid\", she doesn't do much housework. She prefers to spend time pursuing Nicolás.In a third thread, there is Dr. Manuel Saluby (played by Guillermo Murray), who visited the maid after her failed suicide attempt. He follows up with more house calls to flirt with Nicolás' wife Muriel (played by Elizabeth Campbell).You may be wondering what any of these story lines have to do with a Chinese Room! Well, it turns out that Juan Cervantes has a made-up \"Chinese Room\" in his house. Here he can sip green tea, burn incense, and write Chinese calligraphy. Visitors are welcome to \"meditate\", especially with the help of psychedelic mushrooms.As we try to figure out what is going on, or what the point of the Chinese Room is, Consuelo is suddenly dead. Was it suicide, or was she murdered? And is the killer the same person who wrote the threatening letters to Nicolás? If you want to find out, I recommend you watch this without any incense or mushrooms!",
    "Director": "Albert Zugsmith",
    "Writer": "Vivian Connell, Albert Zugsmith",
    "Actors": "Guillermo Murray, Elizabeth Campbell, Carlos Rivas",
    "Language": "English",
    "Country": "Mexico",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0063715",
    "tt0065143",
    "tt0061557",
    "tt0067341",
    "tt0067594",
    "tt0069341",
    "tt3778010",
    "tt1881060",
    "tt0032406",
    "tt0026230",
    "tt0037711",
    "tt0038975"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.273Z"
}