{
  "movieId": "tt0030322",
  "title": "King of Alcatraz",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/king-of-alcatraz-1938",
      "id": "king-of-alcatraz-1938",
      "title": "King Of Alcatraz (1938)",
      "description": "Gail Patrick, Lloyd Nolan, J. Carroll Naish, Robert Preston, Antony Quinn, Richard Denning Directed by Robert Florey",
      "fileSize": 947523764,
      "addedAt": "2026-01-07T00:09:24.700Z",
      "thumbnail": "https://archive.org/services/img/king-of-alcatraz-1938",
      "collection": "feature_films",
      "downloads": 1410
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "68 min",
    "imdbRating": 6.6,
    "imdbVotes": 109,
    "Genre": "Adventure, Crime, Drama",
    "Plot": "Ray Grayson (Lloyd Nolan) and Bob MacArthur (Robert Preston) , rival radio operators on twin steamers, are in constant fights about women, liquor an anything else they can think of. As punishment for a fight, the owner of the line assigns them both to the same ship.Once on board, the two men meet Dale Borden (Gail Patrick), the ship's nurse, on whom Ray had once had a crush, and who falls for her all over again. The passenger list of the ship, fourteen people in all, consists of tough-looking men, but at the last minute an old woman hobbles on board, escorted by a hard-looking blonde nurse. A week out at sea, the old lady proves to be the disguised Steve Murkil (J. Crroll Naish), notorious public enemy, , and the other passengers are his henchmen. They take possession at pistol point. Ray is dumped down the hatch as Bob is shot through the shoulder. Hours later, Ray puts together a crude radio sending set and sends out an S.O.S. Overheard by Murkill's henchmen, Ray is shot and gravely wounded. Dale is ready to operate but is not sufficiently experience, and Bob, realizing that they are in love, strikes a bargain with Murkill. He will send out whatever messages Murkill wants, if the gangster allows him to fix the radio and reach a ship on which there is a doctor who can reply by radio. Murkill agrees. Under the doctor's stet-by-step instructions, Dale performs the delicate operation and pulls Ray through. Suddenly, there is a burst of gunfire. The loyal crew has overpowered the gangsters. Meanwhile, Bob, having completed his job on the radio, wearily slumps down, and when Dale gets to him, he is dead. In port, Dale and Ray are sitting together at the hospital when Captain Glennman (Harry Carey) arrives. He gives Ray a watch which he had received for heroism many years ago, with a note passing the trophy along to Ray...and Bob.",
    "Director": "Robert Florey",
    "Writer": "Irving Reis",
    "Actors": "Gail Patrick, Lloyd Nolan, Harry Carey",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0030039",
    "tt0031232",
    "tt0028770",
    "tt0030037",
    "tt0030473",
    "tt0030763",
    "tt0033582",
    "tt0031505",
    "tt0031680",
    "tt0128844",
    "tt0034959",
    "tt0028136"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.700Z"
}