{
  "imdbId": "tt0057465",
  "title": "The Sadist",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The.Sadist.1961",
      "id": "The.Sadist.1961",
      "title": "The Sadist",
      "description": "From IMDb : Three people driving into Los Angeles for a Dodgers game have car trouble and pull off into an old wrecking yard where they are held at bay by a bloodthirsty psycho and his crazy girlfriend. Stars: Arch Hall Jr., Richard Alden, Marilyn Manning, Don Russell, and Helen Hovey The 1.1GB MPEG4 file was derived from the 3.4GB MPEG2 file found on this page .",
      "fileSize": 2140235095,
      "addedAt": "2026-01-07T00:06:58.272Z",
      "thumbnail": "https://archive.org/services/img/The.Sadist.1961",
      "language": "English",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 13615
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Sadist",
      "id": "The_Sadist",
      "title": "The Sadist",
      "description": "This is believed to be the first feature film based on real life serial killers Charles Starkweather and Caril Fugate. Mainstream Hollywood would not produce films inspired by the pair until a decade after this one. A number of films were inspired by the duo (some very loosely) and included such major examples as Terrence Malick's Badlands (1973) and Oliver Stone's Natural Born Killers (1994)",
      "fileSize": 5058434054,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Sadist",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 156774
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hecaE89__-8",
      "id": "hecaE89__-8",
      "title": "The Sadist (1963) [Thriller] [Horror]",
      "description": "The Sadist (also known as Profile of Terror and Sweet Baby Charlie) is an black-and-white exploitation film. The film is loosely based on the killings of Charles Starkweather, upon which the films \"Badlands\" and \"Natural Born Killers\" were also based. \n\nThree high school teachers, Ed, Doris, and Carl, are driving through rural Southern California on their way to a Dodgers game in Los Angeles. The group's Chevrolet Belair has some trouble and they are forced to pull off to a gas station/junkyard on the side of the road. After examining the vehicle Ed concludes that the fuel pump will need to be replaced. Doris and Carl search the junkyard looking for the owner, but they cannot find him.\n\nIn the residence Carl finds a warm meal with a table set for four, but oddly enough nobody is in the house. The three realize this is very peculiar and start to seriously worry about their situation. At this point Charlie Tibbs, a rather large man wielding a Colt .45, and his girlfriend Judy show up. Charlie and Judy have spent the past several days heading west from Arizona, leaving a trail of corpses behind them. Law enforcement is on the hunt for them, but Charlie has managed to stay a step ahead by changing vehicles frequently and then killing the people who offer their help.\n\nCharlie demands that Ed finish repairing the car and informs him that he and Judy will be stealing the Belair and taking off when Ed is done. Charlie threatens that if the three don't cooperate \"it'll be the end of them.\" During the next several hours Charlie and his girlfriend torment Ed, Doris, and Carl.\n\n---\n\nDirected by James Landis, produced by L. Steven Snyder, written by James Landis, starring Arch Hall, Jr., Richard Alden, Marilyn Manning, Don Russell and Helen Hovey.\n\n---\n\nSource: \"The Sadist (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 28 July 2013. Web. 16 August 2013. http://en.wikipedia.org/wiki/The_Sadist_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:09.701Z",
      "thumbnail": "https://i.ytimg.com/vi/hecaE89__-8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAFkZuH6ZSMAjXIUkI9uc0eT41I1g",
      "duration": 5730,
      "language": "en",
      "year": 1963,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=omvexIP_GN4",
      "id": "omvexIP_GN4",
      "title": "The Sadist (1963) ARCH HALL JR.",
      "description": "Stars: Arch Hall Jr., Marilyn Manning, Richard Alden\nWriter/Director: James Landis\nCinematography by: Vilmos Zsigmond\n\nThree people driving to Los Angeles have car trouble and pull off into an old wrecking yard where they are held at gunpoint by a bloodthirsty psycho and his wacko girlfriend.\n\nMovie Class by PizzaFLIX: Arch Hall Jr. is an American actor and musician who appeared in six indie films during the 1960s all produced by Nicholas Merriwether, the pseudonym of his father Arch Hall Sr.",
      "addedAt": "2025-12-26T23:44:32.258Z",
      "thumbnail": "https://i.ytimg.com/vi/omvexIP_GN4/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLDl9Kfc8yOpM8nDR5oqk6Py5_XnQA",
      "duration": 5493,
      "language": "en",
      "year": 1963,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "92 min",
    "imdbRating": 6.6,
    "imdbVotes": 3155,
    "Genre": "Horror, Thriller",
    "Plot": "Three teachers are on their way to a Dodgers game in Los Angeles but are forced to pull off to a gas station on the side of the road after their car gives them trouble. When they don't find the owner of the gas station, the three are startled by seeing a young man Charlie, holding a gun along with his girlfriend Judy. The couple have spent the past several days evading arrest and leaving a trail of corpses behind them. The couple terrorizes the teachers in broad daylight without any mercy.",
    "Director": "James Landis",
    "Writer": "James Landis",
    "Actors": "Arch Hall Jr., Helen Hovey, Richard Alden",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0057569",
    "tt0056983",
    "tt0056056",
    "tt0055478",
    "tt0056611",
    "tt0058283",
    "tt0058430",
    "tt0058620",
    "tt0055966",
    "tt0059821",
    "tt0055470",
    "tt0054691"
  ],
  "collections": [
    {
      "id": "thriller",
      "name": "Thriller"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}