{
  "movieId": "tt0026276",
  "title": "The Devil Is a Woman",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-devil-is-a-woman",
      "id": "the-devil-is-a-woman",
      "title": "The Devil is a Woman",
      "description": "Josef von Sternberg and Marlene Dietrich went out with a bang in their final film together,  The Devil Is a Woman,  a surreal tale of erotic passion and danger set amid the tumult of carnival in turn-of-the-twentieth-century Spain. Through a series of flashbacks, Captain Costelar (Lionel Atwill) recounts to the young Antonio Galvan (Cesar Romero) the story of his harrowing affair with the notorious seductress Concha Perez (Dietrich), warning his listener to gird himself against her charms. Despite his counsel, Galvan falls under Concha’s spell, leading to a violent denouement. Ever the ornate visual stylist, von Sternberg evokes Spanish culture with a touch of the luridly fantastic, further elevated by Travis Banton’s opulent costume design and award-winning cinematography by von Sternberg himself.",
      "fileSize": 6544596845,
      "addedAt": "2026-01-07T00:11:57.684Z",
      "thumbnail": "https://archive.org/services/img/the-devil-is-a-woman",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 17579
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "79 min",
    "imdbRating": 6.9,
    "imdbVotes": 4152,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Film told in flashbacks of an older man's obsession for a woman who can belong to no-one but can frustrate everyone. The backdrop is SternbergÍs surreal and fantastic Carnaval in Spain. In a café the older man details his encounters with the heart breaker that his younger friend has only just met at the parade. Forewarned, the young man swears he will avoid the fate of his friend, but rushes all the same to his evening rendezvous. A dreamlike story of frustrated, lost romance, spoken in the past tense, never really resolved.",
    "Director": "Josef von Sternberg",
    "Writer": "John Dos Passos, Pierre Louÿs, David Hertz",
    "Actors": "Marlene Dietrich, Lionel Atwill, Edward Everett Horton",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0025746",
    "tt0021800",
    "tt0028575",
    "tt0021156",
    "tt0020697",
    "tt0027311",
    "tt0027286",
    "tt0028010",
    "tt0025335",
    "tt0025463",
    "tt0027331",
    "tt0027996"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.684Z"
}