{
  "movieId": "tt0050095",
  "title": "The Abominable Snowman",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-abominable.-snowman.-1957",
      "id": "the.-abominable.-snowman.-1957",
      "title": "The Abominable Snowman (1957)",
      "description": "\"The Abominable Snowman\" is a British horror film directed by Val Guest , released on August 26, 1957 , in the UK and later in November in the U.S. This film is a unique part of Hammer Film Productions' early catalog and is based on the BBC television play \"The Creature\" by Nigel Kneale . The film follows Dr. John Rollason (played by Peter Cushing ), a botanist who, despite initial hesitation, joins an expedition led by the ambitious Tom Friend (played by Forrest Tucker ) to search for the legendary Yeti in the Himalayas. Accompanied by a team that includes a trapper and a photographer, Rollason's journey explores themes of obsession and the moral implications of their quest for the mythical creature.",
      "fileSize": 1472689815,
      "addedAt": "2026-01-07T00:12:33.207Z",
      "thumbnail": "https://archive.org/services/img/the.-abominable.-snowman.-1957",
      "language": "eng",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 290
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/abominable-snowman-1957-colorized",
      "id": "abominable-snowman-1957-colorized",
      "title": "The Abominable Snowman 1957 colorized (Peter Cushing)",
      "description": "An English botanist (Peter Cushing) studying rare herbs at a remote lamasery in the Himalayas joins an expedition to find the legendary Yeti, against the wishes of his wife (Maureen Connell), only to discover that the intent of its gruff American leader (Forrest Tucker) is to capture or kill one and bring it back for commercial display. Written by Nigel Kneale Directed by Val Guest I colorized this using AI software that doesn't always get the colors right, but I think it looks fairly natural. Hopefully a more professional job will be done someday.",
      "fileSize": 2493458561,
      "addedAt": "2026-01-07T00:07:18.439Z",
      "thumbnail": "https://archive.org/services/img/abominable-snowman-1957-colorized",
      "language": "eng",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 17362
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": 6.4,
    "imdbVotes": 5162,
    "Genre": "Adventure, Horror",
    "Plot": "At a remote lamasery in the Himalayas, scientist John Rollason studies rare mountain herbs with the help of his wife Helen, and associate Peter, while awaiting the arrival of an American named Tom Friend. Over Helen's objections and warnings by the High Lama, he sets out with Friend on an expedition to find the elusive Yeti, accompanied by another American named Shelley and a young Scotsman, McNee, who claims to have seen the thing. Footprints are found in the snows and McNee seems queerly affected the closer they get to their quarry's likely habitat but the biggest shock to Rollason is discovering Friend is a showman who only intends to exploit their find, with Shelley his game hunter/marksman. The conflict between science and commercialism only increases when an enormous anthropoid is shot, and the horror only increases as the party realizes the other Yeti intend to retrieve their fallen comrade and have powers to do so which seem extra-human.",
    "Director": "Val Guest",
    "Writer": "Nigel Kneale, Val Guest",
    "Actors": "Forrest Tucker, Peter Cushing, Maureen Connell",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0050873",
    "tt0049646",
    "tt0050649",
    "tt0049516",
    "tt0051507",
    "tt0049115",
    "tt0052667",
    "tt0048256",
    "tt0068713",
    "tt0047470",
    "tt0051020",
    "tt0050894"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:46:54.943Z"
}