{
  "imdbId": "tt0040543",
  "title": "Loaded Pistols",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/loaded_pistols",
      "id": "loaded_pistols",
      "title": "Loaded Pistols",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4937790049,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/loaded_pistols",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 25974
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "78 min",
    "imdbRating": 5.8,
    "imdbVotes": 160,
    "Genre": "Drama, Music, Western",
    "Plot": "The only Gene Autry film where the leading lady, Barbara Britton, is equally billed above the title as the co-star, thereby knocking his horse Champion out of the honors, if one chooses to overlook the 1941 novelty from 20th Century-Fox that had Jane Withers and Gene Autry above the title in that order. This Autry entry has Larry Evans, whose gun had been used to kill rancher Ed Norton in a poker game, escaping a lynching party headed by ranchers Dave Randall and Bill Otis. Norton's friend Gene Autry, investigating on his own, discovers that Larry's gun had been put in the poker pot with the chips, after Larry had lost all of his money, and anyone could have used it when the lights went out. He finds Larry and his sister Mary Evans in a hideaway, and sends Mary back to town and hides Larry in the cabin of miner Jim Hedge. Finding out that Randall and Don Mason have tried to buy the Evans ranch, Gene decides to take a look at it. Hedge shows up and says he can't figure out what could be on the ranch that would be worth committing murder for. The needle on Hedge's compass begins to spin madly but before Gene can question the miner, Sheriff Cramer arrives and arrests Larry. Gene persuades Cramer to gather all the players in the murder-game together to re-enact the crime, with Gene taking Norton's chair and with Larry's gun on the table. Gene tells the assembled players he knows who killed Norton and why, and the lights go out and a shot is fired at Gene. The latter, who didn't ride into town on a turnip truck, has filled Larry's gun with blanks and covered the handle with graphite.",
    "Director": "John English",
    "Writer": "Dwight Cummins, Dorothy Yost",
    "Actors": "Gene Autry, Barbara Britton, Chill Wills",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038212",
    "tt0037245",
    "tt0028582",
    "tt0041177",
    "tt0040333",
    "tt0041347",
    "tt0040644",
    "tt0179209",
    "tt0040399",
    "tt0040385",
    "tt0039157",
    "tt0039861"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.891Z"
}