{
  "movieId": "tt0059529",
  "title": "Triumph Over Violence",
  "year": 1965,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MLR3g6E2pZA",
      "id": "MLR3g6E2pZA",
      "title": "Triumph Over Violence",
      "description": "One of the most important documentary films about fascism by Soviet director Mikhail Romm. Based entirely on newsreel shooting by cinematographers and photographers from Germany, the Soviet Union, the United States, Italy, Britain, and other countries, the film is based on authentic documents from numerous historical archives. The entire film is accompanied by the voiceover of film director Mikhail Romm. With anger and pain, with deep sadness, and at times with a murderous irony, he comments on events, reflects on dictatorships and dictators, on the crowd that submits to them and deifies them, speaking confidentially to the viewer. With his outstanding film, Mikhail Romm truly revolutionized documentary filmmaking. \n\nYear of production: 1965\n\nDirected by: Mikhail Romm\nWritten by: Mikhail Romm, Maya Turovskaya, Yuri Khanyutin\nDirector of photography: Herman Lavrov\nMusic: Alemdar Karamanov\nNarrator Mikhail Romm\n\nThe film was digitally restored by Mosfilm Cinema Concern\nFind out more: https://cg.mosfilm.ru/en\nSubscribe to our YouTube channel, and be sure to click the bell so that you won’t miss the best Soviet movies! \n\n#Hitler #neo_fascism #history #FullMoviesWithEngSubs",
      "addedAt": "2025-12-23T03:45:52.558Z",
      "thumbnail": "https://i.ytimg.com/vi/MLR3g6E2pZA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBpCjuq02k8q3r4Fyo4YwmaYQ2naA",
      "duration": 8140,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "82 min",
    "imdbRating": 8.1,
    "imdbVotes": 2137,
    "Genre": "Documentary, History, War",
    "Plot": "The film uses captured trophy chronicles from the film archives of the Ministry of Propaganda of Nazi Germany (Third Reich) and Hitler's personal photo archive, as well as numerous amateur photographs discovered by the SS men. Romm, a direct follower of Eisenstein, Vertov, Pudovkin, in this film masterfully uses expressive means of editing, musical design, journalistic speech to characterize the Nazi regime. It is due to the counterpoint of chronicles, voiceover and music that the film has such a strong emotional impact on the viewer.",
    "Director": "Mikhail Romm",
    "Writer": "Yuri Khanyutin, Mikhail Romm, Maya Turovskaya",
    "Actors": "Mikhail Romm, Martin Bormann, Willy Brandt",
    "Language": "Russian",
    "Country": "Soviet Union",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0276783",
    "tt0185405",
    "tt0036152",
    "tt0247569",
    "tt0182766",
    "tt1332128",
    "tt0173769",
    "tt0008807",
    "tt0071604",
    "tt0036301",
    "tt0036629",
    "tt0058947"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-23T04:02:49.325Z"
}