{
  "imdbId": "tt0026759",
  "title": "Phantom Ship",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PhantomShipBelaLugosiAppleTV",
      "title": "Phantom Ship",
      "description": "1935 directed by Denison Clift for The Guaranteed Pictures Corporation, starring Bela Lugosi, Arthur Margetston, Shirley Grey, Edmund Willard, Dennis Hoey, Clifford McLaglen, Ben Welden, Bruce Gordon, George Mozart, Gunnar Moir and Johnnie Schofield.   The Marie Celeste sets sail with a crew of old scalawags and a young bride aboard.   And one of them is a murderer...picture and audio improved.",
      "id": "PhantomShipBelaLugosiAppleTV"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1G3p6dBh5no",
      "title": "Phantom Ship (1935) [Horror] [Mystery]",
      "description": "\"Phantom Ship\", also known as \"The Mystery of the Marie Celeste\" is one of the early films from Hammer Film Productions and was directed by Denison Clift. The leading actor is Béla Lugosi. The story is based on the history of the ship Mary Celeste. The ship was found floating near Portugal in 1872 without a crew. The film is an attempt at a rather unspectacular explanation of the events around the well-known spirit ship, without supernatural occurrences.\n\nCaptain Briggs (Arthur Margetson) and Captain Morehead (Clifford McLaglen) are best friends. Capt. Morehead is in love with Sarah (Shirley Grey). He brings Briggs to New York to meet her. Briggs himself falls in love with her. Sarah also falls in love with Briggs. Both men propose to her the same day. Sarah chooses Briggs. Sarah and Briggs open their marriage plans to Morehead and he gets furious with jealousy. He's also mad with Briggs for going behind his back. But Briggs tells him that he will marry Sarah even if that means the end of their friendship. As the couple plans to sail, the husband - Briggs is short on crew. He asks Morehead to forgive him and help. Morehead agrees and sends a man, Volkerk Grot (Herbert Cameron), not to help, but to do something to the ship. Briggs also recruits some other men, including Anton Lorenzen (Béla Lugosi) who is a sailor who has suffered a lot and is about to break down.\n\nAs the sail begins, the crew realizes that there is a murderer among them who is killing them off one by one. Meanwhile a crewmember tries to rape Sarah, but Lorenzen saves her by killing the man. But then he cries because he can't stand the pain of killing a man.\nSoon, everybody has died or disappeared except 1st mate Bilson, Lorenzen and a third crewmember, Ponta Katz (Gunner Moir). They decide that one of them is a killer and they will soon find out. Katz realizes that Lorenzen could not kill, he was too soft, so he runs after Bilson. Bilson shoots Katz and then celebrates with Lorenzen on becoming the new Captain of Ship, making plans for future.\n\nLorenzen gets mad and tells Bilson that it is he who was shanghaied 6 years before, on the same ship. And he was doing all this to get revenge. Then he shoots Bilson and throws him into the sea. Just after killing Bilson, Lorenzen is hit on the head by the boom. He runs everywhere on ship in hope of finding Bilson, and in his madness he jumps off the ship.\nThe ship drifts with the wind until it is spotted by another ship. The ship is totally abandoned - except for a black cat! A final scene shows Morehead handing money to his man Grot, commenting \"I am thinking of Briggs and her, dead!\"\n\n---\n\nDirected by Denison Clift, produced by Henry Passmore, written by Denison Clift (story) and Charles Larkworthy (scenario), starring Béla Lugosi as Anton Lorenzen, Shirley Grey as Sarah Briggs, Arthur Margetson as Capt. Benjamin Briggs, Edmund Willard as Toby Bilson, Dennis Hoey as Tom Goodschard, George Mozart as Tommy Duggan, Johnnie Schofield as Peter Tooley, Gunner Moir as Ponta Katz, Ben Welden as 'Sailor' Hoffman, Clifford McLaglen as Capt. Jim Morehead, Tom Bastable as Olly Deveau, Matt Ramage as Andy Gilling, Terence De Marney as Charlie Kaye, Edgar Pierce as Arian Harbens, Herbert Cameron as Volkerk Grot, Wilfred Essex as Horatio Sprague, James Carew as James Winchester, Monti DeLyle as Portunato, Alec Fraser as Commander Mahon, Mary B and Mitchell as the ship Marie Celeste.\n\n---\n\nSource: \"Terror by Night\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 5 July 2012. Web. 14 September 2012. http://en.wikipedia.org/wiki/The_Mystery_of_the_Marie_Celeste.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "1G3p6dBh5no",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EcE08ZYkIQU",
      "title": "Phantom Ship (1935) BELA LUGOSI",
      "description": "Stars: Bela Lugosi, Shirley Grey, Arthur Margetson\nDirector: Denison Clift\n\nDuring a horrific storm at sea, the crew realizes that there is a murderer among them who is killing them off one by one.(a.k.a. The Mystery of the Mary Celeste)",
      "id": "EcE08ZYkIQU",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JI8VkWGkJV8",
      "title": "Phantom Ship (1935) Bela Lugosi, Shirley Grey | A voyage cursed by Mutiny, Mayhem, and Mystery",
      "description": "The mystery of the 'Mary Celeste' will forever remain an enigma to the world. During a horrific storm at sea, tensions erupt as crew members vanish under mysterious circumstances, leaving chaos and fear to consume those who remain.\r\n\r\nOriginal Title: The Mystery of the Mary Celeste (AKA) Phantom Ship\r\n\r\nDirector: Denison Clift\r\n\r\nMain Cast:\r\nBéla Lugosi - Anton Lorenzen / A. Gottlieb\r\nShirley Grey - Sarah Briggs\r\nArthur Margetson - Captain Benjamin Briggs\r\nEdmund Willard - Toby Bilson\r\nClifford McLaglen - Captain Jim Morehead\r\n\r\nGenres: Drama, Mystery, Horror\r\nRelease Date: November 14, 1935\r\nFilming Location: Filmed aboard the Schooner \"Mary B. Mitchell\"\r\n\r\nB&W version: https://youtu.be/S_9CHaODoqM\r\n\r\n\r\n@CultCinemaClassics",
      "id": "JI8VkWGkJV8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": "5.4",
    "imdbVotes": "1,092",
    "Genre": "Drama, Horror, Mystery",
    "Plot": "During a horrific storm at sea, the crew realizes that there is a murderer among them who is killing them off one by one.",
    "Director": "Denison Clift",
    "Writer": "Denison Clift, Charles Larkworthy",
    "Actors": "Bela Lugosi, Shirley Grey, Arthur Margetson",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026230",
      "title": "Condemned to Live",
      "year": 1935,
      "imdbRating": "4.8",
      "imdbVotes": "569",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025064",
      "title": "Double Door",
      "year": 1934,
      "imdbRating": "6.8",
      "imdbVotes": "381",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025062",
      "title": "Two Monks",
      "year": 1934,
      "imdbRating": "7.0",
      "imdbVotes": "674",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024727",
      "title": "The Vampire Bat",
      "year": 1933,
      "imdbRating": "5.7",
      "imdbVotes": "3,180",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023583",
      "title": "The Thirteenth Guest",
      "year": 1932,
      "imdbRating": "5.7",
      "imdbVotes": "937",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024904",
      "title": "Bombay Mail",
      "year": 1934,
      "imdbRating": "7.1",
      "imdbVotes": "110",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024382",
      "title": "Night of Terror",
      "year": 1933,
      "imdbRating": "5.5",
      "imdbVotes": "814",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024649",
      "title": "Terror Aboard",
      "year": 1933,
      "imdbRating": "6.6",
      "imdbVotes": "157",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt3778010",
      "title": "Dead Awake",
      "year": 2016,
      "imdbRating": "4.6",
      "imdbVotes": "3,652",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt1881060",
      "title": "Static",
      "year": 2012,
      "imdbRating": "5.3",
      "imdbVotes": "3,645",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0032406",
      "title": "Chamber of Horrors",
      "year": 1940,
      "imdbRating": "5.5",
      "imdbVotes": "731",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037711",
      "title": "Fog Island",
      "year": 1945,
      "imdbRating": "5.3",
      "imdbVotes": "1,065",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:45.466Z"
}