{
  "imdbId": "tt0034270",
  "title": "The Texas Marshal",
  "year": 1941,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bCBHaJ8e9mE",
      "id": "bCBHaJ8e9mE",
      "title": "Texas Marshal (1941) TIM McCOY🍕 COWBOY WESTERN",
      "description": "Stars: Tim McCoy, Kay Leslie, Art Davis, Dave O'Brien\nDirector: Sam Newfield\n\nIn this 1941 classic cowboy western, Tim McCoy rides tall as the Texas Marshal, determined to restore justice on the frontier. When a shadowy leader of the so-called \"Patriot's League\" begins secretly murdering local ranchers and snatching up their estates, suspicions arise. The villain’s motive? The land hides a fortune in tin ore! It’s up to the no-nonsense Marshal and his loyal singing sidekick to uncover the truth, outsmart the schemers, and bring peace back to the range. \n\nPacked with rugged action, mystery, and the kind of frontier justice that only Tim McCoy can deliver, Texas Marshal is a must-watch for fans of classic cowboy movies, 1940s westerns, and old-school Hollywood heroics. Featuring all the hallmarks of the Golden Age of western cinema—crooked land deals, gun-slinging showdowns, and unexpected allies—this vintage gem will thrill lovers of black-and-white western films and classic adventure.\n\nSo saddle up, grab your hat, and enjoy another timeless ride through the Old West, courtesy of PizzaFLIX!\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "addedAt": "2025-12-24T01:05:07.416Z",
      "thumbnail": "https://i.ytimg.com/vi/bCBHaJ8e9mE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCKGGVKKM7vwuIhGv9LQ4fdPCShEA",
      "duration": 3260,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "59 min",
    "imdbRating": 7,
    "imdbVotes": 33,
    "Genre": "Western",
    "Plot": "Around the town of Cactus Creek a rancher has been killed and others are missing and Marshal Tim Rand has been called in. Ernest Moore has found tin ore and now holds many of the rancher's deeds. Comparing bullets leads Tim to Moore's henchman and then opening Moore's safe he finds the ore samples and the deeds. But his plan to bring in Moore and his men using Art Davis' short wave radio is thwarted when Art is captured.",
    "Director": "Sam Newfield",
    "Writer": "William Lively",
    "Actors": "Tim McCoy, Art Davis, Kay Leslie",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033141",
    "tt0032989",
    "tt0032563",
    "tt0032497",
    "tt0035208",
    "tt0033104",
    "tt0031164",
    "tt0031306",
    "tt0032055",
    "tt0032014",
    "tt0031769",
    "tt0033393"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:35:09.475Z"
}