{
  "imdbId": "tt0043142",
  "title": "Woman on the Run",
  "year": 1950,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5use9exrj4Q",
      "title": "Woman on the Run (1950) [Film Noir] [Crime]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | The movie \"Woman on the Run\" is a 1950 film noir crime film directed by Norman Foster starring Ann Sheridan and Dennis O'Keefe. The film was based on the April 1948 short story Man on the Run by Sylvia Tate and filmed on location in San Francisco, California.\n\nPlot: As the film opens, a man, Frank Johnson (Ross Elliott), is walking his dog in the city at night. He witnesses a man in a car talking about a crime. The man then gets shot. But whoever shot that man then sees Frank and shoots at him. The shot misses, however, because it is mistakenly aimed at Frank's shadow. The killer then flees in the car.\n\nWhen the police arrive it is explained that the shooting victim was going to testify in a court case against a gangster. Since Frank saw the shooter, the cops now want Frank to testify. They plan to take him into protective custody. But Frank, while the police inspector (Robert Keith) has momentarily turned away, gives police the slip, leaving his dog (named Rembrandt because his owner is a painter) behind. The police think he is running to escape possible retaliation from the mob. So they contact Frank's wife, Eleanor (Ann Sheridan) to solicit her help in finding him. But she suspects he is actually running away from their unsuccessful marriage.\n\nLater learning that her husband has a heart condition, Eleanor gets the needed medicine and goes looking for him, aided by a newspaperman, Danny Leggett (Dennis O'Keefe) who says he is looking for an exclusive story. The two conduct their own investigation, giving only limited aid to the police. But the police remain determined, since they need a trial witness. Eleanor is aided in her search by Frank's efforts to contact her. In a letter left with a mutual contact he gives her cryptic instructions on how they can secretly meet. The instructions require that she remember a significant event from their life together. But she has trouble doing so.\n\nAs the search continues it is gradually revealed to the audience that Danny the newspaperman is really the killer. He is simply using Eleanor to find Frank. Once Eleanor figures out the cryptic reference, she and Danny go to a beachside amusement park at night and there manage to locate him. Wanting time alone with Frank, ostensibly to get his newspaper story and pay Frank $1,000 for it, Danny puts Eleanor on the roller coaster. As she rides she suddenly realizes what Danny has really been up to. But she is trapped until the ride ends in what becomes the frantic climax of the film.\n\nAs Eleanor finally gets off the roller coaster, Danny is on the verge of killing Frank. The two fight and shots ring out. Eleanor breathlessly arrives on the scene to discover that the police inspector has just shot the killer. She rushes to her husband and the two embrace.\n\n---\n\nDirected by Norman Foster, produced by Howard Welsch, screenplay by Alan Campbell, Norman Foster and Ross Hunter (dialogue), based on the short-story \"Man on the Run\" by Sylvia Tate, starring Ann Sheridan as Eleanor Johnson, Dennis O'Keefe as Daniel Leggett, Robert Keith as Inspector Martin Ferris, John Qualen Mr. Maibus, Frank Jenks as Detective Shaw, Ross Elliott as Frank Johnson, Jane Liddell as Messnger Girl, Joan Shawlee as Blonde (as Joan Fulton), J. Farrell MacDonald as Sea Captain, Steven Geray as Dr. Arthur Hohler\nVictor Sen Yung as Sam, Reiko Sato as Suzie (as Rako Sato), Syd Saylor as Sullivan and Tom Dillon as Joe Gordon (as Thomas P. Dillon)\n---\n\nSource: \"Woman on the Run\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc..  18 February 2017. Web. 24 April 2017. https://en.wikipedia.org/wiki/Woman_on_the_Run\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "5use9exrj4Q",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1950-woman-on-the-run-la-fugitiva-norman-foster-vo",
      "title": "1950 - Woman on the Run - La fugitiva - Norman Foster - VO",
      "description": "For Academic - Educational Use Only",
      "id": "1950-woman-on-the-run-la-fugitiva-norman-foster-vo"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1950-woman-on-the-run-la-fugitiva-norman-foster-vose",
      "title": "1950 - Woman on the Run - La fugitiva - Norman Foster - VESE",
      "description": "For Academic - Educational Use Only",
      "id": "1950-woman-on-the-run-la-fugitiva-norman-foster-vose"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Woman_on_the_Run",
      "title": "Woman on the Run",
      "description": "In San Francisco, a woman tries to track down her husband, who is hiding from a killer and from the police. The IMDB entry is here .",
      "id": "Woman_on_the_Run"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WomanontheRun1950",
      "title": "Woman on the Run",
      "description": "Title: Woman on the Run Summary: Frank Johnson flees police after becoming an eyewitness to murder. He is pursued around scenic San Francisco by his wife, a reporter, the police, and... the real murderer. Directed by: Norman Foster Actors: Production Company: Fidelity Pictures Corporation Release Date: 4 February 1951 (Japan) Aspect Ratio: 1.37 : 1 Frank Johnson (Ross Elliott), sole witness to a gangland murder, goes into hiding and is trailed by Police Inspector Ferris (Robert Keith), on the theory that Frank is trying to escape from possible retaliation. Frank's wife, Eleanor (Ann Sheridan), suspects he is actually running away from their unsuccessful marriage. Aided by a newspaperman, Danny Leggett (Dennis O'Keefe), Eleanor sets out to locate her husband. The killer is also looking for him, and keeps close tabs on Eleanor.",
      "id": "WomanontheRun1950"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WomenOnTheRun578",
      "title": "Woman on the Run",
      "description": "Title: Woman on the Run Summary: Frank Johnson flees police after becoming an eyewitness to murder. He is pursued around scenic San Francisco by his wife, a reporter, the police, and... the real murderer. Directed by: Norman Foster Actors: Production Company: Fidelity Pictures Corporation Release Date: 4 February 1951 (Japan) Aspect Ratio: 1.37 : 1 Frank Johnson (Ross Elliott), sole witness to a gangland murder, goes into hiding and is trailed by Police Inspector Ferris (Robert Keith), on the theory that Frank is trying to escape from possible retaliation. Frank's wife, Eleanor (Ann Sheridan), suspects he is actually running away from their unsuccessful marriage. Aided by a newspaperman, Danny Leggett (Dennis O'Keefe), Eleanor sets out to locate her husband. The killer is also looking for him, and keeps close tabs on Eleanor.",
      "id": "WomenOnTheRun578"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PTQmacpuKdo",
      "title": "Woman on the Run (1950) | Colorized Public Domain Film Noir Classic | Ann Sheridan & Dennis O’Keefe",
      "description": "Woman on the Run (1950) is a gripping American film noir directed by Norman Foster and starring Ann Sheridan and Dennis O’Keefe. This colorized and restored edition of the public domain classic immerses modern audiences in the tense, shadowy world of 1950s crime thrillers—complete with hard-boiled dialogue, moral ambiguity, and postwar realism that defined the noir era. By presenting this once black-and-white gem in color and high resolution, Colorized Public Domain brings new life to a lost masterpiece beloved by classic film enthusiasts across the United States and Europe.\n\nPlot Summary:\nSet in the fog-drenched streets of San Francisco, Woman on the Run follows Eleanor Johnson (Ann Sheridan), a cynical yet determined wife whose husband, Frank Johnson (Ross Elliott), goes missing after witnessing a mob-related murder. When police suspect that Frank’s testimony could break open a major criminal case, they pressure Eleanor to help locate him. Initially indifferent, Eleanor begins her own search—motivated by fear, curiosity, and a rekindling of affection.\n\nHer investigation draws her into a suspenseful chase through the city’s underbelly, from waterfront dives to amusement parks, as she’s trailed by both the police and a mysterious reporter, Danny Leggett (Dennis O’Keefe). As Eleanor pieces together clues, she discovers not only the truth behind her husband’s disappearance but also the buried emotional connection she thought was long dead. The climax, set against the backdrop of a nighttime roller coaster ride, delivers one of the most memorable finales in noir history—both tragic and redemptive.\n\nCast and Crew:\n• Director: Norman Foster\n• Producer: Howard Welsch\n• Screenplay: Alan Campbell, Norman Foster, Ross Hunter (uncredited contributions)\n• Cinematography: Hal Mohr\n• Editing: Allan Crosland Jr.\n• Music: Arthur Lange\n• Production Company: Fidelity Pictures\n• Distributor: Universal Pictures\nStarring:\n• Ann Sheridan as Eleanor Johnson\n• Dennis O’Keefe as Danny Leggett\n• Ross Elliott as Frank Johnson\n• Robert Keith as Inspector Martin Ferris\n• Frank Jenks as Detective Homer Shaw\n• John Qualen as Mr. Johnson (no relation)\n• Steven Geray as Dr. Hohler\n• Joan Shawlee as Blonde in Bar\n\nFilm Significance:\nWoman on the Run stands as a quintessential postwar noir film, blending urban realism with emotional depth. Ann Sheridan, who also co-produced the film, delivers one of her finest performances—portraying a world-weary woman transformed by danger and rediscovered love. The film’s use of real San Francisco locations—rare for its time—adds a documentary-style authenticity that modern viewers find striking.\n\nCritics have since praised its pacing, dialogue, and atmospheric cinematography, which earned Hal Mohr recognition among noir historians. Lost for decades after the original negatives were believed destroyed, Woman on the Run was rediscovered and restored in the 2010s, reaffirming its place among the most underrated noir thrillers of the classic Hollywood era.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Woman on the Run remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1950 release of Woman on the Run was shot in black and white—a stylistic choice consistent with the noir tradition. While purists value this aesthetic, many modern audiences skip older films due to visual distance. This colorized version bridges that gap, enhancing atmosphere while maintaining artistic integrity. The moody San Francisco streets, shadowed interiors, and tense close-ups gain renewed visual power in color—making it ideal for today’s high-definition screens and television viewing, especially for audiences aged 55–64 who appreciate classic storytelling in modern presentation.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from Hollywood’s Golden Age, spanning crime thrillers, dramas, and timeless comedies. Our mission is to preserve and modernize cinema’s forgotten treasures—making them discoverable and enjoyable for audiences across the USA, Europe, and beyond.\n\n#WomanOnTheRun #AnnSheridan #DennisOKeefe #FilmNoir #1950sThriller #PublicDomainMovie #ColorizedClassic #ClassicCinema #GoldenAgeHollywood #CrimeDrama #SanFranciscoNoir",
      "id": "PTQmacpuKdo",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/woman-on-the-run-1950_202312",
      "title": "Woman on the Run (1950)",
      "description": "Frank Johnson, a sole witness to a gangland murder, goes into hiding and is trailed by Police Inspector Ferris, on the theory that Frank is trying to escape from possible retaliation. Frank's wife, Eleanor, suspects he is actually running away from their unsuccessful marriage. Aided by a newspaperman, Danny Leggett, Eleanor sets out to locate her husband. The killer is also looking for him, and keeps close tabs on Eleanor. Watch on RetroFlix:  https://retroflix.org/woman-on-the-run-1950/",
      "id": "woman-on-the-run-1950_202312"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/womanontherun1950_202001",
      "title": "Woman On The Run ( 1950)",
      "description": "Frank Johnson flees police after becoming an eyewitness to murder. He is pursued around scenic San Francisco by his wife, a reporter, the police, and... the real murderer.",
      "id": "womanontherun1950_202001"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Lf-_3IxV_Rw",
      "title": "Woman on the Run (1950) ANN SHERIDAN",
      "description": "Stars: Ann Sheridan, Dennis O'Keefe, Robert Keith\nDirector: Norman Foster\n\nWhen the lone witness to a gangland slaying goes on the run, it's up to a tenacious inspector to find him before the killer does! A nosy newsman (and the fugitive's distraught wife join the hunt ... but all is not what it seems in this stylish corpse-and-cops thriller.",
      "id": "Lf-_3IxV_Rw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": "7.2",
    "imdbVotes": "4,980",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Frank Johnson (Ross Elliott), sole witness to a gangland murder, goes into hiding and is trailed by Police Inspector Ferris (Robert Keith), on the theory that Frank is trying to escape from possible retaliation. Frank's wife, Eleanor (Ann Sheridan), suspects he is actually running away from their unsuccessful marriage. Aided by a newspaperman, Danny Leggett (Dennis O'Keefe), Eleanor sets out to locate her husband. The killer is also looking for him, and keeps close tabs on Eleanor.",
    "Director": "Norman Foster",
    "Writer": "Alan Campbell, Norman Foster, Sylvia Tate",
    "Actors": "Ann Sheridan, Dennis O'Keefe, Robert Keith",
    "Language": "English, Cantonese",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0040512",
      "title": "Kiss the Blood Off My Hands",
      "year": 1948,
      "imdbRating": "6.8",
      "imdbVotes": "2,308",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040947",
      "title": "Walk a Crooked Mile",
      "year": 1948,
      "imdbRating": "6.3",
      "imdbVotes": "1,188",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040723",
      "title": "Raw Deal",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "5,802",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042869",
      "title": "Quicksand",
      "year": 1950,
      "imdbRating": "6.6",
      "imdbVotes": "2,655",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042274",
      "title": "Borderline",
      "year": 1950,
      "imdbRating": "6.0",
      "imdbVotes": "1,568",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042394",
      "title": "Destination Murder",
      "year": 1950,
      "imdbRating": "6.1",
      "imdbVotes": "1,033",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043292",
      "title": "Appointment with Danger",
      "year": 1950,
      "imdbRating": "6.5",
      "imdbVotes": "1,534",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042379",
      "title": "Dark City",
      "year": 1950,
      "imdbRating": "6.7",
      "imdbVotes": "2,781",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042428",
      "title": "Edge of Doom",
      "year": 1950,
      "imdbRating": "6.4",
      "imdbVotes": "946",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042579",
      "title": "House by the River",
      "year": 1950,
      "imdbRating": "7.0",
      "imdbVotes": "4,361",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042792",
      "title": "No Way Out",
      "year": 1950,
      "imdbRating": "7.4",
      "imdbVotes": "6,522",
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042809",
      "title": "One Way Street",
      "year": 1950,
      "imdbRating": "6.5",
      "imdbVotes": "953",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}