{
  "movieId": "tt0040221",
  "title": "Caught",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/caught-1954",
      "id": "caught-1954",
      "title": "Caught (1949) Featuring James Mason, Barbara Bel Geddes, Robert Ryan",
      "description": "Caught is a 1949 American FILM NOlR directed by Max Ophüls, and starring James Mason, Barbara Bel Geddes and Robert Ryan. Caught was based on a novel by Libbie Block.   This Wikipedia article provides more information about this movie.",
      "fileSize": 799193470,
      "addedAt": "2026-01-07T00:07:45.167Z",
      "thumbnail": "https://archive.org/services/img/caught-1954",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 3691
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "88 min",
    "imdbRating": 7,
    "imdbVotes": 4672,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "It was Leonora Eames' childhood dream come true. She had married Smith Ohlrig, a man worth millions. But her innocent dream became a nightmare once she realizes the truth about her husband - he is power mad and insane! Since he will not grant her a divorce, she leaves her life of luxury on Long Island and goes to work as a receptionist in an impoverished doctor's office in NYC's lower east side. After Smith deceives her into a temporary reconciliation, Leonora becomes pregnant. By the time she realizes she is expecting, she and one of the doctors, Larry Quinada (James Mason), have fallen in love. But she is again lured backed to her wealthy husband to give her child financial security. Her sadistic husband is hell-bent on keeping her and her child prisoner. What will happen to Leonora?",
    "Director": "Max Ophüls",
    "Writer": "Arthur Laurents, Libbie Block",
    "Actors": "James Mason, Barbara Bel Geddes, Robert Ryan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041786",
    "tt0041495",
    "tt0042809",
    "tt0042832",
    "tt0039677",
    "tt0039286",
    "tt0041503",
    "tt0041268",
    "tt0041555",
    "tt0041761",
    "tt0041269",
    "tt0042006"
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.167Z"
}