{
  "movieId": "tt0098546",
  "title": "UHF",
  "year": 1989,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/uhf.-1989",
      "id": "uhf.-1989",
      "title": "UHF (1989)",
      "description": "\"UHF\" is a comedy film directed by Jay Levey and stars \"Weird Al\" Yankovic as George Newman, a daydreamer who has a passion for making films but struggles to find steady employment. The plot centers on George's journey as he inherits a failing UHF television station, Channel 62, from his Uncle, who is unable to manage it due to gambling debts.",
      "fileSize": 1450444486,
      "addedAt": "2026-01-07T00:12:55.131Z",
      "thumbnail": "https://archive.org/services/img/uhf.-1989",
      "language": "eng",
      "year": 1989,
      "collection": "feature_films",
      "downloads": 269
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "97 min",
    "imdbRating": 6.9,
    "imdbVotes": 33340,
    "Genre": "Comedy, Sci-Fi",
    "Plot": "George Newman is a daydreamer whose hyperactive imagination keeps him from holding a steady job. His uncle decides George would be the perfect man to manage Channel 62, a television station which is losing money and viewers fast. When George replaces the station's reruns with bizarre programs such as \"Stanley Spadowski's Clubhouse\", \"Wheel of Fish\" and \"Raul's Wild Kingdom\", ratings begin to soar again. Mean-spirited and cynical mogul R.J. Fletcher becomes furious that the UHF station is getting better ratings than his network's programming. Because of gambling debts, the uncle is forced to consider selling the station to Fletcher, who would only too happily shut it down (he cannot legally own two stations in the same town). George and his friends organize a 48-hour telethon to raise the money by selling investment stock from Channel 62 to save the town's new favorite station.",
    "Director": "Jay Levey",
    "Writer": "'Weird Al' Yankovic, Jay Levey, Charles Holloway",
    "Actors": "'Weird Al' Yankovic, Victoria Jackson, Kevin McCarthy",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0097423",
    "tt0095687",
    "tt0133246",
    "tt0097176",
    "tt0092610",
    "tt0093529",
    "tt0058037",
    "tt0472566",
    "tt0096926",
    "tt0072730",
    "tt0046729",
    "tt0044406"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.131Z"
}