{
  "imdbId": "tt0052188",
  "title": "She Gods of Shark Reef",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZzAdT74UXZU",
      "title": "She Gods of Shark Reef (1958) | Colorized Public Domain Adventure Directed by Roger Corman",
      "description": "She Gods of Shark Reef (1958) is an American adventure film directed by Roger Corman, one of Hollywood’s most prolific and resourceful filmmakers. Originally released as a low-budget black-and-white feature, it has since become a cult favorite among classic exploitation cinema enthusiasts. This restored and colorized edition breathes new life into the film, highlighting Corman’s early experimentation with exotic locales, minimal budgets, and fast-paced storytelling. By reviving this rare public domain gem in color, modern audiences in the United States, Europe, and worldwide can rediscover its pulp charm while appreciating the creativity of mid-century independent filmmaking.\n\nPlot Summary:\nThe story begins when two brothers, Chris (Don Durant) and Lee (Bill Cord), flee the law after a botched crime. Their escape leads them across the Pacific, where their boat wrecks near a remote island ruled by a mysterious matriarchal society of women. The island is rich in pearls but plagued by danger, as its women are bound by strict traditions and guarded by the threat of shark-infested waters.\n\nChris, the more reckless brother, dreams of fortune and sees the island’s resources as his opportunity for wealth. Lee, however, falls for Mahia (Lisa Montell), one of the island women, and finds himself torn between love, loyalty, and survival. As tensions rise between the brothers and the community, betrayal, greed, and cultural clashes drive the narrative toward a perilous climax involving both human conflict and nature’s ever-present dangers.\n\nCast and Crew:\n• Director: Roger Corman\n• Producer: Alex Gordon\n• Screenplay: Robert Hill\n• Cinematography: Floyd Crosby\n• Music: Ronald Stein\n\nStarring:\n• Bill Cord as Lee\n• Don Durant as Chris\n• Lisa Montell as Mahia\n• Jeanne Gerson as Queen Pua\n• Carol Lindsay as Tula\n\nFilm Significance:\n“She Gods of Shark Reef” is a striking example of Roger Corman’s efficiency and ingenuity as a filmmaker. Shot in Hawaii, the film showcases his hallmark approach: quick production schedules, small budgets, and exotic backdrops that maximize spectacle despite limited resources. Released in 1958, during the height of American fascination with South Pacific settings, it reflects the era’s interest in island adventures, forbidden romance, and survival against the elements. While critics often dismissed the film at the time, its pulpy style and B-movie charm have given it a lasting cult appeal. For Corman fans, it represents an important piece of his early career before his more famous contributions to horror, science fiction, and counterculture cinema.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like She Gods of Shark Reef remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1958 release was filmed in black and white, partly due to its low budget and fast-paced production. While authentic to its time, the lack of color diminished the visual impact of its tropical setting. By offering a colorized edition, we bring Hawaii’s lush landscapes, the vivid costumes of the island women, and the stark beauty of the sea to life. This enhances the atmosphere, heightens the drama, and makes the film more accessible to contemporary audiences who expect cinematic vibrancy. It is both a preservation and a transformation — a chance to see a forgotten B-movie in a new, more captivating light.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#SheGodsOfSharkReef #RogerCorman #1950sCinema #PublicDomainMovie #ColorizedClassic #AdventureFilm #CultCinema #FilmRestoration #GoldenAgeHollywood #ExploitationCinema #1958Movies #SouthPacificAdventure",
      "id": "ZzAdT74UXZU",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/she-gods-of-shark-reef-1958_202505",
      "title": "She Gods of Shark Reef (1958)",
      "description": "Two brothers, one wanted for murder, are shipwrecked on an island inhabited by nubile young women who have amassed a valuable cache of pearls. Watch on RetroFlix:  https://retroflix.org/she-gods-of-shark-reef-1958/",
      "id": "she-gods-of-shark-reef-1958_202505"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/she_gods_of_shark_reef",
      "title": "She Gods of Shark Reef",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "she_gods_of_shark_reef"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R5L8EbvU_S8",
      "title": "She Gods Of Shark Reef (1958) ROGER CORMAN",
      "description": "Director: Roger Corman\nStars: Bill Cord, Don Durant, Lisa Montell\n\nTwo brothers are shipwrecked on an island inhabited by young women who have amassed a valuable cache of pearls.\n\nMovie Class by PizzaFLIX: Legendary cult filmmaker Roger Corman has directed\nover 50 films and produced nearly 400 more. In the process, he helped launch the careers\nof Jack Nicholson, Robert De Niro, Charles Bronson, Sylvester Stallone, Francis Ford Coppola, Martin Scorsese, Ron Howard, Robert Towne, Peter Bogdanovich, and James Cameron!",
      "id": "R5L8EbvU_S8",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=epLpO7NWL40",
      "title": "She Gods of Shark Reef (1958) Beauty, and Deadly Sacrifices! Directed by Roger Corman",
      "description": "Beautiful maidens in a Lush Tropical Paradise ruled by a Hideous Stone God!  Two brothers, one wanted for murder, are shipwrecked on an island inhabited by young women who have amassed a valuable cache of pearls. What the men don't know is that the women are also part of a shark cult that sacrifices young virgins to the sharks in the surrounding ocean in order to appease the shark gods.\n\nOriginal title: She Gods of Shark Reef (1958) \n\nDirector: Roger Corman\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYLD4ZQC1D1o3WC_ePvnOng\n\nWriters: Robert Hill, Victor Stoloff \n\nCast: \nBill Cord as Chris Johnston\nDon Durant as Lee Johnston, \nLisa Montell as Mahia, \nGenres: Cult, Adventure\nBudget: $50,000 (estimated)\n\n\n00:00 Full Movie (with subtitles)\n05:34 Siblings stranded on an island seek refuge but face challenges from a storm and locals.\n14:20 Mysterious island, superstitions, and a dangerous reef lead to a series of unfortunate events.\n24:11 A group of people on an island face taboo, curses, and the wrath of the gods, leading to dangerous rituals.\n34:22 A tale of betrayal and survival on a remote island with a young woman caught in the middle.\n47:55 Two siblings face danger while hiding on a reef, trying to escape the police and secure stolen pearls.\n\n \n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "epLpO7NWL40",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "63 min",
    "imdbRating": "2.8",
    "imdbVotes": "1,148",
    "Genre": "Adventure",
    "Plot": "Two men escaping the police by ship are blown off course by a typhoon and shipwrecked on an uncharted island populated by women who make a living diving for pearls. What the men don't know is that the women are also part of a shark cult that sacrifices young virgins to the sharks in the surrounding ocean in order to appease the shark gods.",
    "Director": "Roger Corman",
    "Writer": "Robert Hill, Victor Stoloff",
    "Actors": "Bill Cord, Don Durant, Lisa Montell",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0048682",
      "title": "Swamp Women",
      "year": 1956,
      "imdbRating": "3.4",
      "imdbVotes": "2,106",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051887",
      "title": "Machine-Gun Kelly",
      "year": 1958,
      "imdbRating": "6.1",
      "imdbVotes": "2,101",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052379",
      "title": "War of the Satellites",
      "year": 1958,
      "imdbRating": "5.1",
      "imdbVotes": "1,247",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052655",
      "title": "A Bucket of Blood",
      "year": 1959,
      "imdbRating": "6.7",
      "imdbVotes": "8,366",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054462",
      "title": "The Wasp Woman",
      "year": 1959,
      "imdbRating": "4.8",
      "imdbVotes": "5,840",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050778",
      "title": "Not of This Earth",
      "year": 1957,
      "imdbRating": "6.1",
      "imdbVotes": "2,340",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050906",
      "title": "Rock All Night",
      "year": 1957,
      "imdbRating": "5.7",
      "imdbVotes": "472",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050998",
      "title": "Sorority Girl",
      "year": 1957,
      "imdbRating": "5.4",
      "imdbVotes": "458",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051062",
      "title": "Teenage Doll",
      "year": 1957,
      "imdbRating": "5.6",
      "imdbVotes": "324",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049370",
      "title": "It Conquered the World",
      "year": 1956,
      "imdbRating": "4.9",
      "imdbVotes": "2,754",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054033",
      "title": "The Little Shop of Horrors",
      "year": 1960,
      "imdbRating": "6.2",
      "imdbVotes": "20,527",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054315",
      "title": "Ski Troop Attack",
      "year": 1960,
      "imdbRating": "4.1",
      "imdbVotes": "653",
      "language": "English, German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:50.366Z"
}