{
  "imdbId": "tt0036653",
  "title": "Bluebeard",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Bluebeard",
      "title": "Bluebeard",
      "description": "Young female models are being strangled inexplicably. Will law enforcement be able to stop the crime wave before more women become victims? You can find more information regarding this film on its IMDb page . John Carradine .... Gaston Morrell Jean Parker .... Lucille Nils Asther .... Inspector Lefevre Ludwig Stössel .... Jean Lamarte (as Ludwig Stossel) George Pembroke .... Inspector Renard Teala Loring .... Francine Sonia Sorel .... Renee Henry Kolker .... Deschamps",
      "fileSize": 3191440180,
      "id": "Bluebeard"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QCj2a2sjkZI",
      "title": "Bluebeard (1944) | Colorized Public Domain Film Noir Horror with John Carradine",
      "description": "Bluebeard (1944) is an American horror film directed by Edgar G. Ulmer, a filmmaker celebrated for his atmospheric low-budget classics. This gothic thriller stars John Carradine in one of his most memorable roles, playing a tormented Parisian painter who harbors a deadly secret. Inspired by the legend of Bluebeard and blending crime, horror, and film noir, the movie is a fascinating combination of gothic atmosphere and psychological drama. Ulmer’s directorial style, Carradine’s chilling performance, and the haunting Parisian setting make this film one of the most unique public domain horror-noir entries from the 1940s. In this restored and colorized edition, the film’s shadows and gothic designs come alive with fresh intensity, giving modern audiences a strikingly immersive experience.\n\nPlot Summary:\nThe film follows Gaston Morel (John Carradine), a talented but troubled Parisian artist who creates stunning puppet shows while hiding a murderous compulsion. By day, he is a respected puppeteer and painter admired for his portraits of women. By night, he becomes a predator, strangling the very women he paints in a cycle of obsession and guilt. His crimes earn him the nickname “Bluebeard,” after the French folktale of a nobleman who murdered his wives.\n\nMorel’s life begins to unravel when he falls for Lucille Lutien (Jean Parker), a costume designer who becomes dangerously close to uncovering his secret. As police investigations close in and suspicions mount, the psychological tension builds toward a suspenseful climax. The story is as much about guilt, compulsion, and self-destruction as it is about murder, offering a noir-infused take on the classic Bluebeard legend.\n\nCast and Crew:\n• Director: Edgar G. Ulmer\n• Screenplay: Arnold Lipp, based loosely on the legend of Bluebeard\n• Cinematography: Eugen Schüfftan\n• Editing: Jack Ogilvie\n• Producer: Leon Fromkess\n\nStarring:\n• John Carradine as Gaston Morel\n• Jean Parker as Lucille Lutien\n• Nils Asther as Jean Lamarte\n• Ludwig Stössel as Jean Colette\n• Teala Loring as Renee Colette\n• Sonia Sorel as Lucille’s sister\n\nFilm Significance:\nBluebeard (1944) stands out as a fusion of gothic horror and film noir during a time when American studios often separated those genres. Director Edgar G. Ulmer, famous for The Black Cat (1934) and Detour (1945), once again showcased his ability to create chilling atmospheres on limited budgets. The Parisian setting, complete with cobblestone streets, misty nights, and shadowy interiors, adds authenticity to the eerie story.\n\nThe film is also remembered for John Carradine’s performance as Gaston Morel, arguably one of his finest roles. Carradine brought gravitas and pathos to the character, making him both terrifying and tragically human. The blending of horror with psychological realism made the movie distinctive, especially in the 1940s when Hollywood was shifting toward noir aesthetics.\n\nThough released by Producers Releasing Corporation, a smaller studio, Bluebeard found success and became one of Ulmer’s most well-known works. Its public domain status has allowed it to remain accessible for decades, and it continues to be revisited by fans of noir, horror, and cult cinema.\n\nEnhanced Public Domain Explanation:\nNow in the public domain, Bluebeard is preserved as an important artifact of mid-20th century horror and noir cinema. Its copyright-free status allows modern distributors, educators, and creators to share and restore it. At Colorized Public Domain, we have enhanced and colorized this gothic thriller, enriching its atmospheric sets, Parisian backdrops, and Carradine’s haunting performance. This process revitalizes the eerie shadows and noir textures that defined Ulmer’s direction, while making the film more engaging for today’s audiences.\n\nWhy Watch This Colorized Edition:\nThe original black-and-white version is haunting, but this colorized restoration brings new life to Paris’s foggy streets and Morel’s artistic world. The dimly lit puppet theater, the dramatic interiors, and the costumed Parisian crowds are all enhanced, creating a fresh layer of immersion. This edition not only preserves Ulmer’s artistry but also introduces classic horror-noir to modern audiences who may find silent shadows less engaging.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films weekly, spanning horror, drama, mystery, westerns, sci-fi, and more. Our goal is to revive forgotten cinema treasures and make them accessible to new generations across the United States, Europe, and worldwide.\n\n#Bluebeard1944 #JohnCarradine #FilmNoirHorror #PublicDomainMovie #ColorizedClassic #EdgarGUlmer #1940sCinema #ClassicThriller #PuppetShowHorror #GothicNoir #CultCinema #ClassicFilmRestoration #ParisianMystery",
      "id": "QCj2a2sjkZI",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AZuwS-Chf_4",
      "title": "Bluebeard (1944) EDGAR G. ULMER ♠ JOHN CARRADINE",
      "description": "Exclusive PizzaFLIX Movie Class Edition!\nDirector: Edgar G. Ulmer\nStars: John Carradine, Jean Parker, Nils Asther\nCinematography: Eugen Schüfftan\nThe gas-lit streets of Paris are gripped with fear! A madman, strangling young female models, is dubbed \"Bluebeard\" after the old French legend. Set to be Ulmer’s next project at Universal after \"The Black Cat,\" ten years would pass before this tortured love story could be told!  With John Carradine as the tormented painter and puppeteer, in what he described as the greatest performance of his six-decade career! Cinematography Eugen Schüfftan won an Oscar in 1961 for THE HUSTLER starring Paul Newman.\nCHAPTERS\n0:00 Movie Class Introduction\n4:40 Feature Film\n10:03 The Puppet Show\n1:16:05  Please Subscribe",
      "id": "AZuwS-Chf_4",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yyV2UtHoDWs",
      "title": "Bluebeard (1944) John Carradine | Crime, Horror, Thriller",
      "description": "In Paris, a mysterious puppet showman & artist hires young women as portrait models, and after he finishes their portraits, he strangles them.\n\nDirector: Edgar G. Ulmer\nWriters: Arnold Lipp, Werner H. Furst \nStars: John Carradine, Jean Parker, Nils Asther\nGenres: Classics,  low budget film, Edgar Ulmer, Crime, Horror, Thriller \n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "yyV2UtHoDWs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 5.9,
    "imdbVotes": 2188,
    "Genre": "Crime, Horror, Thriller",
    "Plot": "A killer of young women, dubbed Bluebeard, is loose in Paris. Lucille and her friends meet Gaston Morrell, a puppeteer. He invites them to a show the next night; they go. Afterwards, he walks with Lucille; she offers to make costumes for his next show, he accepts, and feelings develop that may lead to love. She suspects he has a tragic past. Meanwhile, his leaving the show with Lucille prompts the jealousy of Renee, Gaston's sometime lover. Lucille's younger sister, Francine, comes back to Paris - her boyfriend is Inspector Lefebre, who's hunting for Bluebeard. Some clues point toward Lamart, a greedy art dealer. Who is in danger, and can Gaston be trusted?",
    "Director": "Edgar G. Ulmer",
    "Writer": "Arnold Lipp, Werner H. Furst, Pierre Gendron",
    "Actors": "John Carradine, Jean Parker, Nils Asther",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0053593",
      "title": "The Amazing Transparent Man",
      "year": 1960,
      "imdbRating": 4.1,
      "imdbVotes": 2798,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037441",
      "title": "Voodoo Man",
      "year": 1944,
      "imdbRating": 5.2,
      "imdbVotes": 1282,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024894",
      "title": "The Black Cat",
      "year": 1934,
      "imdbRating": 6.9,
      "imdbVotes": 13937,
      "language": "English, Latin, Hungarian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037638",
      "title": "Detour",
      "year": 1945,
      "imdbRating": 7.3,
      "imdbVotes": 20553,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038126",
      "title": "Strange Illusion",
      "year": 1945,
      "imdbRating": 6.2,
      "imdbVotes": 1189,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035944",
      "title": "Girls in Chains",
      "year": 1943,
      "imdbRating": 4.5,
      "imdbVotes": 265,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0036307",
      "title": "Revenge of the Zombies",
      "year": 1943,
      "imdbRating": 4.7,
      "imdbVotes": 849,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052609",
      "title": "Beast from Haunted Cave",
      "year": 1959,
      "imdbRating": 4.3,
      "imdbVotes": 2290,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0088828",
      "title": "Bloody Wednesday",
      "year": 1987,
      "imdbRating": 3.9,
      "imdbVotes": 559,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037024",
      "title": "The Lodger",
      "year": 1944,
      "imdbRating": 7,
      "imdbVotes": 4227,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2103217",
      "title": "Maniac",
      "year": 2012,
      "imdbRating": 6.1,
      "imdbVotes": 41696,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036613",
      "title": "Arsenic and Old Lace",
      "year": 1944,
      "imdbRating": 7.9,
      "imdbVotes": 77355,
      "language": "English, German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}