{
  "movieId": "tt0038449",
  "title": "Dangerous Money",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dangerous-money-1946-dvd-mkv",
      "id": "dangerous-money-1946-dvd-mkv",
      "title": "Dangerous Money (1946) DVD MKV",
      "description": "DVD remux of the 1946 Monogram Pictures film \"Dangerous Money.\" IMDb TMDB Wikipedia Dangerous Money, also known as Hot Money, is a 1946 American film directed by Terry O. Morse, featuring Sidney Toler as Charlie Chan. This is the second and last appearance of Willie Best as Chattanooga Brown, the cousin of Charlie Chan's usual chauffeur, Birmingham Brown (Mantan Moreland). (The film entered the public domain due to the omission of a valid copyright notice on its original prints.)",
      "fileSize": 3213197387,
      "addedAt": "2026-01-07T00:07:51.628Z",
      "thumbnail": "https://archive.org/services/img/dangerous-money-1946-dvd-mkv",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 590
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": 6.3,
    "imdbVotes": 1300,
    "Genre": "Crime, Mystery, Thriller",
    "Plot": "A treasury agent traveling aboard a ocean liner confides to fellow passenger Charlie Chan that he's on the trail of a counterfeiting ring operating from the South Pacific and has survived two recent attempts on his life. Chan helps him avoid a third but is helpless to prevent a knife thrown in his back in the ship's club room. Although the ship will be docking shortly in Samoa, Charlie is confident that he will unmask the killer before then. Among the suspects are an elitist reverend and his wife, a beautiful young woman traveling with forged papers, a shady loudmouth of a salesman, a larcenous ship's steward, and a professional knife-thrower.",
    "Director": "Terry O. Morse",
    "Writer": "Miriam Kissinger, Earl Derr Biggers",
    "Actors": "Sidney Toler, Gloria Warren, Victor Sen Yung",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0121574",
    "tt0038452",
    "tt0037711",
    "tt0034602",
    "tt0038494",
    "tt0038577",
    "tt0048919",
    "tt0048301",
    "tt0038640",
    "tt0039800",
    "tt0027136",
    "tt0052623"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.628Z"
}