{
  "imdbId": "tt0046478",
  "title": "Ugetsu",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Ugetsu",
      "id": "Ugetsu",
      "title": "Ugetsu",
      "description": "By the time he made  Ugetsu,  Kenji Mizoguchi was already an elder statesman of Japanese cinema, fiercely revered by Akira Kurosawa and other directors of a younger generation. And with this exquisite ghost story, a fatalistic wartime tragedy derived from stories by Akinari Ueda and Guy de Maupassant, he created a touchstone of his art, his long takes and sweeping camera guiding the viewer through a delirious narrative about two villagers whose pursuit of fame and fortune leads them far astray from their loyal wives. Moving between the terrestrial and the otherworldly,  Ugetsu  reveals essential truths about the ravages of war, the plight of women, and the pride of men. Ugetsu  was restored by The Film Foundation and Kadokawa Corporation at Cineric Laboratories in New York. Special thanks to Masahiro Miyajima and Martin Scorsese for their consultation on this restoration. Restoration funding provided by the Hollywood Foreign Press Association in association with The Film Foundation and Kadokawa Corporation.",
      "fileSize": 7960071291,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/Ugetsu",
      "language": "jpn",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 18955
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ugetsu.-1953",
      "id": "ugetsu.-1953",
      "title": "Ugetsu (1953)",
      "description": "Ugetsu is a 1953 Japanese period fantasy film directed by Kenji Mizoguchi starring Masayuki Mori and Machiko Kyō.  It is based on the stories \"The House in the Thicket\" and \"The Lust of the White Serpent\" from Ueda Akinari's 1776 book Ugetsu Monogatari, combining elements of the jidaigeki genre with a ghost story. Drawing from Ueda's tales, the film is set in Japan's civil war–torn Azuchi–Momoyama period. It  follows two brothers, Genjūrō and Tōbei, during Japan's civil war as they pursue their ambitions—Genjūrō as a potter and Tōbei as a would-be samurai. Their quests lead to tragic consequences for their families, highlighting themes of greed, ambition, and the haunting effects of war.",
      "fileSize": 2670850333,
      "addedAt": "2026-01-07T00:12:55.131Z",
      "thumbnail": "https://archive.org/services/img/ugetsu.-1953",
      "language": "jpn (English subtitles)",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 174
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "96 min",
    "imdbRating": 8.1,
    "imdbVotes": 27766,
    "Genre": "Drama, Fantasy, War",
    "Plot": "In the beginning of the springtime in the period of the Japanese Civil Wars of the Sixteenth Century in Lake Biwa in the Province of Omi, the family man farmer and craftsman Genjurô travels to Nagahama to sell his wares and makes a small fortune. His neighbor Tobei that is a fool man dreams on becoming a samurai, but he can not afford to buy the necessary outfit. The greedy Genjurô and Tobei work together manufacturing clay potteries, expecting to sell the pieces and enrich; however, their wives Miyage and Ohama are worried about the army of the cruel Shibata that is coming to their village and they warn their ambitious husbands. Their village is looted but the families flee and survive; Genjurô and Tobei decide to travel by boat with their wives and baby to sell the wares in a bigger town. When they meet another boat that was attacked by pirates, Genjurô decides to leave his wife and son on the bank of the river, promising to return in ten days. Genjurô, Tobei and Ohama raise a large amount but Tobei leaves his wife to buy the samurai outfit and seek fame and fortune. Meanwhile the female aristocratic Lady Wakasa and her servant ask Genjurô to bring her shopping to her fancy Kutsuki House. Sooner Genjurô and Tobei discover the price they have to pay for their ambition.",
    "Director": "Kenji Mizoguchi",
    "Writer": "Hisakazu Tsuji, Akinari Ueda, Matsutarô Kawaguchi",
    "Actors": "Machiko Kyô, Mitsuko Mito, Kinuyo Tanaka",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "Nominated for 1 Oscar. 6 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt0047445",
    "tt0045112",
    "tt0048933",
    "tt0046851",
    "tt0045844",
    "tt0046029",
    "tt0045487",
    "tt0045682",
    "tt0045793",
    "tt0040980",
    "tt0046359",
    "tt0045659"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.131Z"
}