{
  "movieId": "tt0004282",
  "title": "Mabel's Married Life",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MabelsMarriedLife1914",
      "id": "MabelsMarriedLife1914",
      "title": "MABEL'S MARRIED LIFE (1914)",
      "description": "MABEL'S MARRIED LIFE Keystone-Mutual 1015 ft., rel. June 20, 1914 (His Wife's Birthday) dir. Charlie Chaplin and Mabel Normand, auth. Charlie Chaplin cast: Charlie Chaplin, Mabel Normand, Mack Swain, Alice Howell, Hank Mann, Charles Murray, Harry McCoy, Wallace MacDonald, Al St. John, Alice Davenport finished: 6/6/1914",
      "fileSize": 1012506053,
      "addedAt": "2026-01-07T00:06:38.751Z",
      "thumbnail": "https://archive.org/services/img/MabelsMarriedLife1914",
      "collection": "feature_films",
      "downloads": 2580
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mabels-married-life-1914-directed-by-charlie-chaplin",
      "id": "mabels-married-life-1914-directed-by-charlie-chaplin",
      "title": "Mabel’s Married Life (1914) Directed By Charlie Chaplin",
      "description": "Mabel's Married Life Normand, Chaplin, and Mack Swain Directed by Charlie Chaplin Written by Charlie Chaplin Mabel Normand Produced by Mack Sennett Starring Charlie Chaplin Mabel Normand Cinematography Frank D. Williams Production company Keystone Studios Distributed by Mutual Film Release date June 20, 1914 Running time 17 minutes Country United States Languages Silent film English (Original titles) Mabel's Married Life (1914) is an American comedy silent film made by Keystone Studios starring and co-written by Charlie Chaplin and Mabel Normand , and directed by Chaplin. As was often the case during his first year in film, Chaplin's character is soon staggering drunk. The film was followed in 1915 by Mabel and Fatty's Married Life as a follow-up (but not quite a \"sequel\"). Plot A large man with a tennis racquet talks with his wife in a park. He leaves her and wanders off. Chaplin, in top hat and tails (but baggy pants), sits on a park bench with his wife, Mabel. While he has gone to a bar, conning his way out of paying for his drinks, the large man sits with Charlie's wife and starts flirting. Chaplin returns to find them laughing together. But despite kicking him and hitting him with his cane the man is undeterred in his wooing of his wife. Meanwhile, Charlie is met by the man's wife and they return together. The large man's wife confronts him first but then ends up confronting Mabel. She starts to throttle her then goes to strike her, but accidentally hits Charlie instead. The couple then leave. Charlie orders Mabel to go home while he returns to the bar where a man at the bar mocks him. Mabel stops at a sporting goods store where she orders a man-shaped punch-bag. She wants to learn how to fight. It is delivered while she is still in her pyjamas. She wraps herself in a leopard-skin rug to answer the door. She starts practising boxing moves on the dummy/punchbag. It is weighted so it swings back and knocks her over. Meanwhile, in the bar the large man reappears and is clearly a friend of the mocker and he further ridicules Charlie (who is by now drunk). When the man tousles Charlie's hair a fight starts. Charlie then returns home, holding a bunch of fresh onions, as though they were flowers, and trying to work out what the smell is. Repulsed by the smell, he throws them away, which fly through an open door and onto Mabel who is in bed. Charlie in his drunken state sees the dummy as the large man and prepares to fight. Charlie demands the dummy leaves. He pushes it, which swings back then rolls forward again striking Charlie. Charlie tries to placate it but ends up striking it again and getting knocked over. Mabel watches from the bedroom, amused by his actions. He strikes the dummy again and is thrown onto the bed, where he sees Mabel. Believing that she has cheated on him, Charlie throttles her and leads her to the dummy. She tries to placate him, while he keeps striking the dummy and getting knocked over by it. She eventually reveals to him that it is just a dummy. Meanwhile, neighbours get concerned at the noise and stand outside his apartment door. The film ends with Charlie and Mabel leaning in for a kiss. Reviews Motion Picture News gave it a favorable review, noting that \"All will be aching from laughter when it is over.\" [ 1 ] The Moving Picture World also gave the film a positive review, writing that \"Charles Chapman [sic] and Mabel Normand are at their best, and everyone knows what that means; better than most feature offerings from an exhibition viewpoint\". [ 2 ] A reviewer from Bioscope wrote, \"The mix-up between Mabel, Charles and the dummy is extremely funny, and in the restaurant Mr. Chaplin gives a very excellent study in inebriation. This is certainly one of the best of the Keystone comedies.\" [ citation needed ] Cast Charlie Chaplin – Mabel's Husband Mabel Normand – Mabel Mack Swain – Wellington Eva Nelson – Wellington's wife Hank Mann – Tough in bar Charles Murray – Man in bar Harry McCoy – Man in bar Wallace MacDonald – Delivery boy Al St. John – Delivery boy Grover Ligon – Bartender Alice Davenport – Concerned neighbour References 1 \"Interesting Film Reviews\" . Motion Picture News. July 18, 1914 . Retrieved June 5, 2020 . 2 \"Comments on the Films\" . The Moving Picture World. July 4, 1914 . Retrieved June 5, 2020 . From Wikipedia, the free encyclopedia",
      "fileSize": 112507576,
      "addedAt": "2026-01-07T00:09:46.421Z",
      "thumbnail": "https://archive.org/services/img/mabels-married-life-1914-directed-by-charlie-chaplin",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 168
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-mabels-married-life",
      "id": "silent-mabels-married-life",
      "title": "Mabel's Married Life",
      "fileSize": 243508989,
      "addedAt": "2026-01-07T00:11:07.409Z",
      "thumbnail": "https://archive.org/services/img/silent-mabels-married-life",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 338
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "17 min",
    "imdbRating": 5.6,
    "imdbVotes": 1466,
    "Genre": "Short, Comedy",
    "Plot": "Mabel goes home after being humiliated by a masher whom her wimpy husband won't fight. The husband goes off to a bar and gets drunk. She buys a boxing dummy hoping it will inspire her husband, but when he returns he gets in a fight with it, taking it to be the ladykiller.",
    "Director": "Mack Sennett",
    "Writer": "Charles Chaplin, Mabel Normand",
    "Actors": "Charles Chaplin, Mabel Normand, Mack Swain",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0003733",
    "tt0003934",
    "tt0004280",
    "tt0004064",
    "tt0004194",
    "tt0004670",
    "tt0003177",
    "tt0003417",
    "tt0002663",
    "tt0002755",
    "tt0002956",
    "tt0005674"
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.409Z"
}