{
  "movieId": "tt0024839",
  "title": "Art for Art's Sake",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/art-for-arts-sake-1934",
      "id": "art-for-arts-sake-1934",
      "title": "Art for Art's Sake (1934)",
      "description": "The Little King creates havoc when he goes on a tour of an art gallery. Watch on RetroFlix:  https://retroflix.org/art-for-arts-sake-1934/",
      "fileSize": 88175766,
      "addedAt": "2026-01-07T00:07:25.000Z",
      "thumbnail": "https://archive.org/services/img/art-for-arts-sake-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 40
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.3,
    "imdbVotes": 57,
    "Genre": "Animation, Short",
    "Plot": "Van Beuren cartoons are extremely variable, especially in the number of gags and whether the absurdist humour shines through enough (sometimes it does, other times it doesn't), but are strangely interesting. Although they are often poorly animated with barely existent stories and less than compelling lead characters, they are also often outstandingly scored, there can be some fun support characters and some are well-timed and amusing.'Art for Art's Sake' is the penultimate The Little King cartoon from Van Beuren, and to me it's among the better ones of the series and one of the more faithful The Little King cartoons to Soglow's humour and visual style. Even if the first two Van Beuren/Soglow cartoons with Sentinel Louey 'A.M To P.M' and 'A Dizzy Day' were more successful.It's flimsy in story, not unexpected in a The Little King cartoon, the material is standard and occasionally a little too sweet and pace-wise it's not one of the livelier The Little King cartoons, dragging occasionally.Actually though, there is a huge amount to like about 'Art for Art's Sake' and it vastly outweighs the flaws. It demonstrates why Van Beuren's cartoons adapted from Soglow's work are among the studio's better, more ambitious and more entertaining efforts. One expects Van Beuren cartoons to generally not be well animated. That's not the case with 'Art for Art's Sake', the studio's Soglow adaptations come to think of it were all among their better-looking cartoons and showed more detail and crispness. It may not quite be as imaginative visually and have the ambitious human character designs of 'The Fatal Note', which introduces The Little King, but for Van Beuren this animation is surprisingly good.Music as always with Van Beuren, very nearly always the best thing about their cartoons and sometimes the only good thing, is lively and beautifully and cleverly orchestrated. The gags are amusing, well-timed and charming, if not quite as subtle as in the first two Van Beuren/Soglow cartoons. The ending is cute and amusing and the second half of the cartoon is when the pace does pick up and the material gets even more interesting. The Little King is appealing as a lead even when at his least gentle, especially the poses and action when hiding behind the character he's teasing.In summary, pretty good. 7/10 Bethany Cox",
    "Director": "Vernon Stallings",
    "Writer": "Oscar E. Soglow",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0152236",
    "tt0150013",
    "tt0148037",
    "tt0148132",
    "tt0025728",
    "tt0148318",
    "tt0025328",
    "tt0151147",
    "tt0148470",
    "tt0152639",
    "tt0150523",
    "tt0151428"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:25.000Z"
}