{
  "imdbId": "tt0061847",
  "title": "Samurai Rebellion",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/samurai-rebellion",
      "id": "samurai-rebellion",
      "title": "Samurai Rebellion",
      "description": "Toshiro Mifune stars as Isaburo Sasahara, an aging swordsman living a quiet life until his clan lord orders that his son marry the lord's mistress, who has recently displeased the ruler. Reluctantly, father and son take in the woman, and, to the family’s surprise, the young couple fall in love. But the lord soon reverses his decision and demands the mistress’s return. Against all expectations, Isaburo and his son refuse, risking the destruction of their entire family. Director Masaki Kobayashi's  Samurai Rebellion  is the gripping story of a peaceful man who finally decides to take a stand against injustice.",
      "fileSize": 9979844126,
      "addedAt": "2026-01-07T00:10:40.952Z",
      "thumbnail": "https://archive.org/services/img/samurai-rebellion",
      "language": "jpn",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 25027
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "128 min",
    "imdbRating": 8.3,
    "imdbVotes": 15087,
    "Genre": "Drama",
    "Plot": "During peace in 1725, aging swordsman Isaburo is living a henpecked life when his clan lord requests that Isaburo's son marry the lord's mistress, with whom he's displeased, even though she's born him a son. Isaburo wants to refuse, but his son Yogoro accepts the woman, Ichi, and they fall deeply in love. Their love renews Isaburo, so when the clan lord's elder son dies and the lord sends for Ichi to return to his side as mother of his heir, Isaburo opposes his lord. Yogoro and Ichi, who now have a baby daughter, stand with him. The clan orders their suicide, then sends soldiers to kill them. Isaburo's only hope is to take his case to Edo to expose the clan's cruelty. Can he?",
    "Director": "Masaki Kobayashi",
    "Writer": "Shinobu Hashimoto, Yasuhiko Takiguchi",
    "Actors": "Toshirô Mifune, Yôko Tsukasa, Gô Katô",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "7 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0058279",
    "tt0135031",
    "tt0134771",
    "tt0134286",
    "tt0053114",
    "tt0056135",
    "tt0058888",
    "tt0200768",
    "tt0060584",
    "tt0171408",
    "tt0062453",
    "tt0061709"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.952Z"
}