{
  "imdbId": "tt0027034",
  "title": "Spring Tonic",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/spring-tonic-1935",
      "title": "Spring Tonic (1935)",
      "description": "Lew Ayres, Claire Trevor, Walter Woolf King, Jack Haley, ZaSu Pitts",
      "fileSize": 977774816,
      "id": "spring-tonic-1935"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 5.9,
    "imdbVotes": 76,
    "Genre": "Comedy",
    "Plot": "On the night before her wedding, Betty Ingals walks out of the rehearsal angry at her milquetoast fiance, Caleb Enix, because of his insistence on reasonableness and his lack of ardor. When he refuses to elope, Betty, with her clumsy, easily frightened maid Maggie in tow, sneaks into her car. Sykes, a snooping reporter, climbs onto their rumble seat as Betty heads upstate heedless of Maggie's warning that that part of the country is full of crazy people. As they near the Summit Lodge, Sykes is knocked into the bushes. Nearby, at the Melleh Bros. Wild Animal Circus, tiger trainer Lola rebukes her philandering husband Jose, who then opens the cage of Lola's tiger Mina so that Lola will be preoccupied while he pursues recreation. While searching for Mina, Lola comes across Giffen and Camebridge Nasher, two loony moonshiners, and promises to hire them as acrobats if they help find the tiger. Betty pays Matt, a partner of the Nashers in applejack production, ten dollars to stay in the lodge. When Jose serenades her under her window, Betty is excited to hear that he just wants to make love, rather than reason with her, like Caleb. After Maggie calls Caleb to tell him their location, Sykes arrives at the lodge. Betty denies her identity to him, but when Caleb arrives, Sykes takes notes as Betty explains that she is bored with him and cannot go through with the wedding. As Betty walks off arm in arm with Jose, Caleb, seeing Sykes about to phone in the story about their breakup, wraps the phone line around his neck. With Matt's help, Caleb drops Sykes into a cellar. When Lola arrives with her whip, Jose sneaks out. After Caleb receives advice from Matt that women prefer force to reason, he enters Betty's room, where Jose has returned. When Caleb asks if he intends to marry Betty, Jose leaves by the window, and after Betty closes the door on Caleb, she climbs out to Jose. To help Caleb, Matt kidnaps Maggie, thinking her to be Betty, and they drive off, but return when they discover that they really have Maggie. When Lola catches Jose embracing Betty, he tells Betty to wait in the loft of the barn and then runs from Lola. Caleb captures Jose for Lola, while Maggie falls into the cellar with Sykes. After Caleb ties up Jose, he instructs Caleb in courtship technique, explaining that he is in love with love, and tells him that Betty is waiting in the barn. As Caleb confronts Betty, the tiger comes into the barn. Although Caleb's first reaction is to run, he then grabs a whip and makes the tiger lie down and roll over. After the Nashers see this and tell Lola, she reclaims the tiger, whom she says she had tamed by never letting her forget that she is the master. With his whip, Caleb orders Betty down from the loft and kisses her passionately. Never having experienced such a kiss from him, Betty wants more. Lola returns to the circus with both the tiger and Jose encaged, as Caleb and Betty leave Maggie with Sykes.",
    "Director": "Clyde Bruckman",
    "Writer": "Frank Griffin, H.W. Hanemann, Ben Hecht",
    "Actors": "Lew Ayres, Claire Trevor, Walter Woolf King",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0022883",
      "title": "The Fatal Glass of Beer",
      "year": 1933,
      "imdbRating": 6.6,
      "imdbVotes": 1924,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017729",
      "title": "Call of the Cuckoo",
      "year": 1927,
      "imdbRating": 5.9,
      "imdbVotes": 674,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018294",
      "title": "Putting Pants on Philip",
      "year": 1927,
      "imdbRating": 6.5,
      "imdbVotes": 1155,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025015",
      "title": "Cross Country Cruise",
      "year": 1934,
      "imdbRating": 6.3,
      "imdbVotes": 100,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028083",
      "title": "Panic on the Air",
      "year": 1936,
      "imdbRating": 5.4,
      "imdbVotes": 121,
      "language": "Cantonese, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024610",
      "title": "State Fair",
      "year": 1933,
      "imdbRating": 6.7,
      "imdbVotes": 1151,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028748",
      "title": "The Crime Nobody Saw",
      "year": 1937,
      "imdbRating": 6.1,
      "imdbVotes": 85,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0204800",
      "title": "Alibi Bye Bye",
      "year": 1935,
      "imdbRating": 6.3,
      "imdbVotes": 59,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026085",
      "title": "Atlantic Adventure",
      "year": 1935,
      "imdbRating": 5.4,
      "imdbVotes": 167,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026132",
      "title": "Boys Will Be Boys",
      "year": 1935,
      "imdbRating": 6.5,
      "imdbVotes": 468,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026179",
      "title": "Car of Dreams",
      "year": 1935,
      "imdbRating": 5.7,
      "imdbVotes": 176,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0133358",
      "title": "Alles für die Firma",
      "year": 1935,
      "language": "German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.627Z"
}