{
  "movieId": "tt0066856",
  "title": "Born to Win",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BorntoWin",
      "id": "BorntoWin",
      "title": "Born to Win",
      "description": "J.J. (George Segal) is a former hairdresser turned heroin addict trying to satisfy his $100 per day habit and deal with the New York City drug culture. In order to get by, he turns narc and starts ratting on his friends.",
      "fileSize": 1955044824,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BorntoWin",
      "year": 1971,
      "collection": "feature_films",
      "downloads": 220254
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tUA7a21pQg8",
      "id": "tUA7a21pQg8",
      "title": "Born to Win (1971) George Segal, Karen Black, Robert De Niro | Crime, Drama | Movie, Subtitles",
      "description": "Their story is written on his arm. If they can get a grip on each other, maybe they can turn their lives around.\nA smart-mouthed junkie and loser known as J.J., spends his days looking for just \"one more fix\".\n\nOriginal title: Born to Win (1971)\n\nDirector: Ivan Passer\nWriters: David Scott Milton, Ivan Passer\nStars: George Segal, Paula Prentiss, Karen Black, & Robert De Niro \nGenres: Comedy, Crime, Drama\n\n\nAvailable with French, German, Italian & Spanish dubbed audio \n👉 select your preferred audio/subtitle language in settings  ⚙️ \n\n\n00:00 Full Movie\n0:04  A charming hairdresser gets caught up in a safe heist and meets a nervous woman who joins him on a car ride.\n10:32  A conversation between two people about a cheating spouse and their personal lives.\n26:02  JJ confronts Marlene to retrieve a package and encounters the police.\n31:28  A man named J is caught in a dangerous situation involving drugs and criminal activity.\n38:36  A conversation between two people discussing their relationship and a potential illegal activity.\n54:52  A conversation between two people about nursery rhymes, smooching, and their feelings for each other.\n1:04:46  A tense conversation between two individuals about a drug deal and the potential consequences.\n1:09:57  A group of drug dealers discusses their plans and experiences in the city.\n1:17:41  A man named Billy dies after being given a lethal injection meant for someone else, leading to a confrontation with the police.\n\n\n@CultCinemaClassics ​",
      "addedAt": "2025-12-27T00:42:20.487Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/tUA7a21pQg8/maxresdefault.webp?v=654d90ec",
      "duration": 5088,
      "language": "en",
      "year": 1971,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "88 min",
    "imdbRating": 5.8,
    "imdbVotes": 2197,
    "Genre": "Comedy, Crime, Drama",
    "Plot": "J.J., a former New York City hairdresser, commits petty crimes, often with his friend Billy Dynamite, to support his drug habit. He's not very good at it, with something often going wrong. One of J.J.'s more regular gigs is working as a mule for Vivian - who J.J. calls Geek Man to Vivian's chagrin - a pimp for who J.J.'s ex-wife, Veronica, also a junkie, now hustles also to support her habit. J.J.'s life has the potential to change the result of two encounters. One is with a pair of NYPD narcs who have him over a barrel concerning his drug use and what they want out of him to make a drug conviction go away. Two is with a young woman named Parm who he meets in the act of one of his crimes. J.J. and Parm enter into a relationship, the love and support within that makes J.J. want to come out on top for once in his life.",
    "Director": "Ivan Passer",
    "Writer": "David Scott Milton, Ivan Passer",
    "Actors": "George Segal, Paula Prentiss, Karen Black",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0068519",
    "tt0196832",
    "tt0070578",
    "tt0028346",
    "tt0032343",
    "tt0038418",
    "tt0033871",
    "tt0029199",
    "tt0024985",
    "tt0033805",
    "tt0214642",
    "tt0034898"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}