{
  "imdbId": "tt0029989",
  "title": "Child Bride",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ChildBride",
      "title": "Child Bride",
      "description": "Schoolteacher in a rural community campaigns to stop the practice of older men marrying young, underage girls.",
      "fileSize": 2390133583,
      "id": "ChildBride"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/child-bride-1938",
      "title": "Child Bride (1938)",
      "description": "Jennie is a twelve-year-old girl living with her parents in extremely rural mountain country. Her schoolteacher, Miss Carol, though a mountain girl herself, has gone off to be educated and returned in hopes of stopping the tradition of child marriage which permeates the culture. Jennie's father Ira is a good man who tries to protect Miss Carol from the men who threaten her if she doesn't call off her crusade. One of these men, Jake Bolby, has his eye on little Jennie and plots to make her his bride. Watch on RetroFlix:  https://retroflix.org/child-bride-1938/",
      "fileSize": 387917181,
      "id": "child-bride-1938"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ElX2_zOV2As",
      "title": "Child Bride (1938) | Colorized Public Domain Drama with Shirley Mills & Ozarks Controversy",
      "description": "Child Bride (1938) is a provocative American drama written and directed by Harry Revier and produced by Raymond L. Friedgen. Starring Shirley Mills, Angelo Rossitto, Warner Richmond, Diana Durrell and others, this film was promoted as an educational exposé about child marriage in remote Ozarks communities. Colorized and restored, this edition gives modern viewers in the United States, Europe, and beyond a clearer, more accessible look at a deeply controversial piece of early exploitation cinema.\n\nChild Bride, also known as Child Brides, Child Bride of the Ozarks and Dust to Dust (US reissue titles),[citation needed] is a 1938 American drama film written and directed by Harry Revier, and produced by Raymond L. Friedgen. It was promoted as educational in an attempt to draw attention to the lack of laws banning child marriage in many states.\n\nThe Ozarks, also known as the Ozark Mountains, Ozark Highlands or Ozark Plateau.\n\nPlot Summary:\nJennie Colton (Shirley Mills), a twelve-year-old living in a secluded mountain region, becomes the reluctant focal point of a dangerous tradition when the town’s older men believe it acceptable to marry underage girls. Miss Carol (Diana Durrell), a schoolteacher who grew up in the same hills but was educated elsewhere, returns home determined to abolish child marriage. She clashes with Jake Bolby (Warner Richmond), a predatory older man who eyes Jennie. Jennie’s father, Ira Colton (George Humphreys), tries to protect her as threats escalate. After Jennie’s father dies and under pressure from Bolby, her mother (Ma Colton, Dorothy Carrol) is coerced into allowing a marriage arrangement. A key sequence involving Jennie swimming nude (filmed when the actress was twelve) stirred scandal, and eventually Jennie is rescued when Angelo the dwarf (Angelo Rossitto) intervenes. The climax reveals the marriage was made illegal by recent laws, but not in time to prevent the emotional damage.\n\nCast and Crew:\n• Director & Writer: Harry Revier\n• Producer: Raymond L. Friedgen\n• Cinematography: Marcel Le Picard\n• Editing: Helene Turner\n• Music: Felix Mills\nStarring:\n• Shirley Mills as Jennie Colton\n• Diana Durrell as Miss Carol\n• Warner Richmond as Jake Bolby\n• Bob Bollinger as Freddie Nulty\n• Dorothy Carrol as Ma Colton\n• George Humphreys as Ira Colton\n• Angelo Rossitto as Angelo\n\nFilm Significance:\nChild Bride is notorious both for its social message and its exploitation tactics. It claimed to highlight the lack of laws banning child marriage, but it also used shock value—particularly the nude swimming scene with a pre-teen—to attract attention. The film was denied PCA (Hays Code) approval for its subject matter and nudity yet continued to circulate via independent/exploitation channels. It has endured as a film that many see as ethically problematic but historically relevant, especially for discussions around censorship, exploitation cinema, and societal change.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Child Bride remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1938 original is emotionally raw and visually stark. For modern first-world viewers, the colorized version improves visibility of expression, set design, and costumes, making details more evident especially on TV and larger screens. The transformation helps reduce the barrier black-and-white sometimes poses for new or casual audiences. While the content is controversial and demands viewer discretion, it also presents an opportunity for education, historical context, and critical reflection on changing societal norms. Colorization here is not just cosmetic—it serves to re-frame the film’s power for contemporary eyes.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#ChildBride #ShirleyMills #1938Drama #PublicDomainClassic #ColorizedClassic #OzarksDrama #FilmRestoration #ControversialCinema #ClassicAmericanFilm #EducationalExploitation",
      "id": "ElX2_zOV2As",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Aljg_DfzCDs",
      "title": "Child Bride (1938) EXPLOITATION",
      "description": "Stars: Shirley Mills, Bob Bollinger, Warner Richmond\n Director: Harry Revier\n\n Schoolteacher in a rural community campaigns to stop the practice of older men marrying young, underage girls. This film is partly based on the true story of a 9 year old girl, Eunice Winstead who married a 22 year old man in 1937 in Tennessee.",
      "id": "Aljg_DfzCDs",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "62 min",
    "imdbRating": 4.5,
    "imdbVotes": 1116,
    "Genre": "Drama",
    "Plot": "12-year-old Jennie lives with her parents in extremely rural mountain country. Her schoolteacher Miss Carol, a mountain girl herself, went off to get educated and has returned hoping to stop the tradition of child marriage which permeates the culture. Jennie's father Ira is a good man who tries to protect Miss Carol from the men who warn her to call off her crusade. One of those threatening men, Jake Bolby, has his eye on young Jennie and plots to make her his bride.",
    "Director": "Harry Revier",
    "Writer": "Harry Revier",
    "Actors": "Shirley Mills, Bob Bollinger, Warner Richmond",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0029850",
      "title": "Alexander Nevsky",
      "year": 1938,
      "imdbRating": 7.5,
      "imdbVotes": 12505,
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0177600",
      "title": "Callejón sin salida",
      "year": 1938,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029855",
      "title": "Algiers",
      "year": 1938,
      "imdbRating": 6.6,
      "imdbVotes": 3341,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028589",
      "title": "Assassin of Youth",
      "year": 1938,
      "imdbRating": 4.5,
      "imdbVotes": 472,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029939",
      "title": "Born to Be Wild",
      "year": 1938,
      "imdbRating": 5.7,
      "imdbVotes": 112,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0259235",
      "title": "The Case of the Frightened Lady",
      "year": 1938,
      "imdbRating": 6.2,
      "imdbVotes": 21,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030006",
      "title": "Come on, Rangers!",
      "year": 1938,
      "imdbRating": 6,
      "imdbVotes": 131,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0165696",
      "title": "Convicts at Large",
      "year": 1938,
      "imdbRating": 4.9,
      "imdbVotes": 74,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030037",
      "title": "Danger on the Air",
      "year": 1938,
      "imdbRating": 6.3,
      "imdbVotes": 221,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030049",
      "title": "Delinquent Parents",
      "year": 1938,
      "imdbRating": 5,
      "imdbVotes": 70,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030154",
      "title": "Frau Sixta",
      "year": 1938,
      "imdbRating": 7.5,
      "imdbVotes": 25,
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0135745",
      "title": "Ab Mitternacht",
      "year": 1938,
      "language": "German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.168Z"
}