{
  "imdbId": "tt0002523",
  "title": "Thirty Days at Hard Labor",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-thirty-days-at-hard-labor",
      "id": "silent-thirty-days-at-hard-labor",
      "title": "Thirty Days at Hard Labor",
      "fileSize": 376339227,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-thirty-days-at-hard-labor",
      "language": "English",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 394
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": 5.6,
    "imdbVotes": 100,
    "Genre": "Short, Comedy",
    "Plot": "Beatrice Langdon's father objects to her marrying Jack Deering on the grounds that he is a son of a wealthy man. He makes it plain to Jack that if he is to marry his daughter he must sign an agreement, which stipulates that he must put in thirty days at hard labor. Jack, unknown to Beatrice, signs the agreement, and his first position is laying pipes with a gang of laborers. Inside of three days he is so worn out that he is obliged to relinquish his position. His next jobs were at rock excavation and shoveling coal, but his weak physique is not strong enough for hard work, so he resigns. In the meantime Beatrice, who has heard nothing from Jack for a couple of days, is heartbroken, but too proud to write him for an explanation, so she indulges in a little flirtation with Reggie Bullion. While passing the Munich Restaurant, Jack notices a sign, \"Halberdier Wanted.\" He makes application for the job and is accepted. Upon the last night, Langdon, Reggie and Beatrice happen to visit the place. The awkwardness of the halberdier so annoys Beatrice that she insists upon him being discharged, but before this can be done the clock strikes twelve and Jack raises his visor. After due explanations everything is adjusted and the waiter becomes a guest.",
    "Director": "Oscar Apfel",
    "Writer": "O. Henry",
    "Actors": "Robert Brower, Mary Fuller, Harold M. Shaw",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002421",
    "tt0002532",
    "tt0002133",
    "tt0002501",
    "tt0215495",
    "tt0002280",
    "tt0210599",
    "tt0002232",
    "tt0002255",
    "tt0002290",
    "tt0002387",
    "tt0002398"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}