{
  "imdbId": "tt0006826",
  "title": "Hoodoo Ann",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HoodooAnn",
      "id": "HoodooAnn",
      "title": "\"Hoodoo Ann\" (1916) starring Mae Marsh and Robert Harron",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Hoodoo Ann\" is a comedy-drama, included in our program to illustrate the work of Robert Harron, a star of Silent Hall of Fame. Directed by               Lloyd Ingraham Produced by             The Fine Arts Film Company Scenario by               Granville Warwick (D.W. Griffith)           Based on                    a screen story by Granville Warwick (D.W. Griffith) Starring                     Mae Marsh, Robert Harron Distributed by           Triangle Film Corporation Release date               March 26, 1916 Running time             64 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 821795344,
      "addedAt": "2026-01-07T00:06:30.619Z",
      "thumbnail": "https://archive.org/services/img/HoodooAnn",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 2522
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-hoodoo-ann",
      "id": "silent-hoodoo-ann",
      "title": "Hoodoo Ann",
      "fileSize": 1030989884,
      "addedAt": "2026-01-07T00:10:59.119Z",
      "thumbnail": "https://archive.org/services/img/silent-hoodoo-ann",
      "language": "English",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 470
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "65 min",
    "imdbRating": 5.9,
    "imdbVotes": 903,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "In all her young life Hoodoo Ann has lived up to her nickname. Nothing has ever gone right for her and from the 13th of the month, when she is left at the Meadowdale orphanage, her troubles increase. Little Goldie, pet of Miss Prudence Scraggs, is allowed to play with a beautiful doll and an adorable kitten, but Ann spends her time scrubbing and scouring. One night the orphanage takes fire and is burned to the ground. Ann, with no malice in her heart, save Goldie from death in the flames. All the neighbors are at the blaze, and the Knapps with no children of their own, adopt Ann. The Vances, father and son, take an interest in her, and young Jimmie is soon dividing his time between his studies, he wants to be an artist, and Ann. They become great chums. Then Ann discovers Mr. Knapp's revolver and while fooling with it in the attic it is discharged. Next door live Sarah and Bill Higgins in a continually quarrelsome atmosphere. Sarah has just left the house vowing that she will never return when Ann rushes in to see what damage her shot has done. Bill is lying on the floor and she thinks she has killed him. Sarah returns and is arrested for the murder of Bill, who is now missing. The unjust accusation moves Ann to make a complete confession and she is about to be arrested when Bill appears. It develops that the bullet had maimed a stray cat. Jimmie and Ann nurse the animal and Ann is convinced that her future lies in being a model nurse and home maker. She soon becomes Sunshine Ann, a name which sticks long after she has become Mrs. Jimmie Vance.",
    "Director": "Lloyd Ingraham",
    "Writer": "D.W. Griffith",
    "Actors": "Mae Marsh, Robert Harron, William H. Brown",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006357",
    "tt0006505",
    "tt0010806",
    "tt0004825",
    "tt0011741",
    "tt0011652",
    "tt0032599",
    "tt0027311",
    "tt0033891",
    "tt0027286",
    "tt3101386",
    "tt0028010"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}