{
  "imdbId": "tt0017925",
  "title": "The General",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Buster_Keaton_The_General",
      "title": "Buster Keaton The General",
      "description": "Complete version (other version on archive.org is missing 1st 4 minutes) Union solders have stolen The General, a Confederate train manned by Johnnie Gray, who was unable to enlist in the Confederate army because he is needed as an engineer. The Union plans to use the train to supply its soldiers in a sneak attack against the Confederates. But now it's up to Gray and his love, Annabelle Lee, to reclaim The General, recross enemy lines, and warn the Confederates. The General based on a real incident during the American Civil War when a posse of northern soldiers hijacked a confederate train and a lone southern engineer found himself fighting the lot of them alone.",
      "id": "Buster_Keaton_The_General"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGeneral720p1926",
      "title": "TheGeneral720p1926",
      "description": "Title: The General Summary: When Union spies steal an engineer's beloved locomotive, he pursues it single-handedly and straight through enemy lines. Directed by: Clyde Bruckman, Buster Keaton Actors: Production Company: Buster Keaton Productions Release Date: 24 February 1927 (France) Aspect Ratio: 1.33 : 1 Johnnie loves his train (\"The General\") and Annabelle Lee. When the Civil War begins he is turned down for service because he's more valuable as an engineer. Annabelle thinks it's because he's a coward. Union spies capture The General with Annabelle on board. Johnnie must rescue both his loves.",
      "id": "TheGeneral720p1926"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGeneral_201312",
      "title": "TheGeneral 201312",
      "id": "TheGeneral_201312"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-general-1926_202505",
      "title": "The General (1926)",
      "description": "The General is a 1926 American silent comedy film released by United Artists. It was inspired by the Great Locomotive Chase, a true story of an event that occurred during the American Civil War.   Watch on RetroFlix:  https://retroflix.org/the-general-1926/",
      "id": "the-general-1926_202505"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-general-1926_202506",
      "title": "The General (1926)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. One of the most acclaimed silent films to this day, The General is known as Buster Keaton's finest film. Based on the memoirs of a union soldier, this film follows a engineer as he fights to save his train. With dangerous stunts, a cute romance, and a likeable lead, The General is now thought of as a masterpiece. This wasn't always the case, however. On release reviews were poor and the box office barely recouped its investment, leading to Buster Keaton losing independence as a filmmaker.",
      "id": "the-general-1926_202506"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-general-keaton-and-bruckman-1926-high-quality-1080p-t-o-p-swu-fc",
      "title": "The General (1926) HD with Score",
      "description": "During America’s Civil War, Union spies steal engineer Johnnie Gray's beloved locomotive, 'The General'—with Johnnie's lady love aboard an attached boxcar—and he single-handedly must do all in his power to both get The General back and to rescue Annabelle.",
      "id": "the-general-keaton-and-bruckman-1926-high-quality-1080p-t-o-p-swu-fc"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PPjwmp5qqm8",
      "title": "Buster Keaton | The General (1926) [Silent Movie] [Action] [Comedy]",
      "description": "The General is an American silent comedy film released by United Artists inspired by the Great Locomotive Chase, which happened in 1862. Buster Keaton starred in the film and co-directed it with Clyde Bruckman. It was adapted by Al Boasberg, Bruckman, Keaton, Charles Henry Smith (uncredited) and Paul Girard Smith (uncredited) from the memoir The Great Locomotive Chase by William Pittenger. The film, an adventure-epic classic made toward the end of the silent era, received both poor reviews by critics (it was considered tedious and disappointing) and weak box-office results (about a half million dollars domestically, and approximately one million worldwide) at its original release, but is now considered by critics as one of the greatest films ever made. \n\nWestern & Atlantic Railroad train engineer Johnnie Gray (Keaton) is in Marietta, Georgia to see one of the two loves of his life, his fiancee Annabelle Lee (Marion Mack)—the other being his locomotive, The General—when the American Civil War breaks out. He hurries to be first in line to sign up with the Confederate Army, but is rejected because he is too valuable in his present job; unfortunately, Johnny is not told this reason and is forcibly ejected from the office when he tries to enlist surreptitiously. On leaving, he runs into Annabelle's father and brother, who beckon to him to join them in line, but he sadly walks away, giving them the impression that he does not want to enlist. Annabelle coldly informs Johnnie that she will not speak to him again until he is in uniform.\n\nA year passes, and Annabelle receives word that her father has been wounded. She travels north on the General to see him but still wants nothing to do with Johnnie. When the train makes a stop, the passengers detrain for a quick meal. As planned, Union spies led by Captain Anderson (Glen Cavender) use the opportunity to steal the train. Annabelle becomes an inadvertent prisoner. Johnnie gives chase, first on foot, then by handcar and boneshaker bicycle, before reaching a station in Chattanooga. He alerts the army detachment there, which boards another train to give chase, with Johnnie manning the locomotive, the Texas. However, the flatcars are not hooked up to the engine, and the troops are left behind. By the time Johnnie realizes he is alone, it is too late to turn back. \n\nThe Union agents try a variety of methods to shake their dogged pursuer (convinced he is accompanied by Confederate soldiers), including disconnecting their trailing car and dropping railroad ties on the tracks. As the unusual duel continues northward, the Confederate Army of Tennessee is ordered to retreat and the Northern army advances in its wake. Johnnie finally notices he is surrounded by Union soldiers and the hijackers see that Johnnie is by himself. Johnnie stops his locomotive and runs into the forest to hide....\n\n---\n\nDirected by Clyde Bruckman and Buster Keaton, produced by Joseph Schenck and Buster Keaton, written by Al Boasberg, Clyde Bruckman, Buster Keaton, Charles Henry Smith and Paul Girard Smith, starring Buster Keaton as Johnnie Gray, Marion Mack as Annabelle Lee, Glen Cavender as Captain Anderson, Jim Farley as General Thatcher, Frederick Vroom as a Confederate General, Charles Henry Smith as Annabelle's Father (Charles Smith), Frank Barnes as Annabelle's Brother, Joe Keaton as an Union General, Mike Donlin as an Union General and Tom Nawn as an Union General.\n---\n\nSource: \"The General (1926 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 April 2013. Web. 23 June 2013. http://en.wikipedia.org/wiki/The_General_(1926_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "PPjwmp5qqm8",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "78 min",
    "imdbRating": "8.1",
    "imdbVotes": "104,099",
    "Genre": "Action, Adventure, Comedy",
    "Plot": "Johnnie loves his train (\"The General\") and Annabelle Lee. When the Civil War begins he is turned down for service because he's more valuable as an engineer. Annabelle thinks it's because he's a coward. Union spies capture The General with Annabelle on board. Johnnie must rescue both his loves.",
    "Director": "Clyde Bruckman, Buster Keaton",
    "Writer": "Buster Keaton, Clyde Bruckman, Al Boasberg",
    "Actors": "Buster Keaton, Marion Mack, Glen Cavender",
    "Language": "None",
    "Country": "United States",
    "Awards": "3 wins & 1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0015163",
      "title": "The Navigator",
      "year": 1924,
      "imdbRating": "7.5",
      "imdbVotes": "11,273",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015772",
      "title": "The Eagle",
      "year": 1925,
      "imdbRating": "6.6",
      "imdbVotes": "2,212",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018937",
      "title": "A Girl in Every Port",
      "year": 1928,
      "imdbRating": "6.5",
      "imdbVotes": "864",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019987",
      "title": "His First Command",
      "year": 1929,
      "imdbRating": "5.9",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013674",
      "title": "The Three Must-Get-Theres",
      "year": 1922,
      "imdbRating": "6.9",
      "imdbVotes": "645",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015324",
      "title": "Sherlock Jr.",
      "year": 1924,
      "imdbRating": "8.2",
      "imdbVotes": "64,220",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019421",
      "title": "Steamboat Bill, Jr.",
      "year": 1928,
      "imdbRating": "7.8",
      "imdbVotes": "16,421",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023243",
      "title": "Mr. Robinson Crusoe",
      "year": 1932,
      "imdbRating": "5.5",
      "imdbVotes": "520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041098",
      "title": "Africa Screams",
      "year": 1949,
      "imdbRating": "6.0",
      "imdbVotes": "4,134",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046414",
      "title": "Beat the Devil",
      "year": 1953,
      "imdbRating": "6.4",
      "imdbVotes": "10,677",
      "language": "Arabic, English, Italian",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0066565",
      "title": "White Sun of the Desert",
      "year": 1970,
      "imdbRating": "7.7",
      "imdbVotes": "8,323",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0039133",
      "title": "Adventure Island",
      "year": 1947,
      "imdbRating": "4.7",
      "imdbVotes": "219",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    }
  ],
  "is_curated": true,
  "verified": true,
  "qualityLabels": [],
  "lastUpdated": "2025-12-30T00:45:24.426Z"
}