{
  "movieId": "tt0001371",
  "title": "Ramona",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Ramona_201408",
      "id": "Ramona_201408",
      "title": "\"Ramona\" (1910) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Ramona\", A Story of the White Man’s Injustice to the Indian, is a short drama featuring Billy Bitzer, a star of Silent Hall of Fame. Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          Stanner E. V. Taylor from the novel Ramona by Helen Hunt Jackson Cinematography                Billy Bitzer Starring                               Mary Pickford, Henry B. Walthall, Kate Bruce, Francis Grandon Distributed by                     Biograph Company Release date                        May 23, 1910 Running time                      16 min. Country                               United States Language                             Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"      ",
      "fileSize": 394544808,
      "addedAt": "2026-01-07T00:06:51.866Z",
      "thumbnail": "https://archive.org/services/img/Ramona_201408",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 14884
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-ramona",
      "id": "silent-ramona",
      "title": "Ramona",
      "fileSize": 1209821824,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-ramona",
      "language": "English",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 609
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": 5.8,
    "imdbVotes": 449,
    "Genre": "Short, Drama, Romance",
    "Plot": "Ramona is a little orphan of the great Spanish household of Moreno. Alessandro, the Indian, arrives at the Camulos ranch with his sheep-shearers, showing his first meeting with Ramona. There is at once a feeling of interest noticeable between them which ripens into love. This Senora Moreno, her foster mother, endeavors to crush, with poor success, until she forces a separation by exiling Alessandro from the ranch. He goes back to his native village to find the white men devastating the place and scattering his people. The Senora, meanwhile, has told Ramona that she herself has Indian blood, which induces her to renounce her present world and go to Alessandro. They are married and he finds still a little shelter left from the wreckage. Here they live until the whites again appear and drive them off, claiming the land. From place to place they journey, only to be driven further until finally death comes to Alessandro just as aid comes in the person of Felipe, the Senora's son, who takes Ramona back to Camulos.",
    "Director": "D.W. Griffith",
    "Writer": "Helen Hunt Jackson, D.W. Griffith, Stanner E.V. Taylor",
    "Actors": "Mary Pickford, Henry B. Walthall, Francis J. Grandon",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001978",
    "tt0001740",
    "tt0001401",
    "tt0001458",
    "tt0001459",
    "tt0002795",
    "tt0002197",
    "tt0002512",
    "tt0001118",
    "tt0001262",
    "tt0001340",
    "tt0001452"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}