{
  "imdbId": "tt0056325",
  "title": "A Pair of Briefs",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/apob3453454355",
      "id": "apob3453454355",
      "title": "A Pair of Briefs",
      "description": "Title: A Pair of Briefs Summary: She's new in chambers, and he's a troublemaker. But what *is* the true status of the old lady's wartime marriage, and can the two young legal minds find the answer? Directed by: Ralph Thomas Actors: Michael Craig, Mary Peach, Brenda de Banzie Production Company: The Rank Organisation Release Date: 2 October 1962 (USA) Aspect Ratio: REMOVE_TAG A recently-qualified barrister is annoyed when he finds his firm is taking on the boss's niece. The two youngsters soon find themselves in court on opposite sides in a case on the restitution of conjugal rights where both plaintiff and defendant seem to have things to hide. The irascible and rather fearsome judge has little time for the goings-on, least of all the way the two young lawyers seem rather too keen to squabble with each other.",
      "fileSize": 791363306,
      "addedAt": "2026-01-07T00:07:25.000Z",
      "thumbnail": "https://archive.org/services/img/apob3453454355",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 1739
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "90 min",
    "imdbRating": 6,
    "imdbVotes": 235,
    "Genre": "Comedy",
    "Plot": "A recently-qualified barrister is annoyed when he finds his firm is taking on the boss' niece. The two youngsters soon find themselves in court on opposite sides in a case on the restitution of conjugal rights where the plaintiff and the defendant seem to have things to hide. The irascible and rather fearsome judge has little time for the goings-on, least of all, the way the two young lawyers seem rather too keen to squabble with each other.",
    "Director": "Ralph Thomas",
    "Writer": "Nicholas Phipps, Harold Brooke, Kay Bannerman",
    "Actors": "Michael Craig, Mary Peach, Brenda de Banzie",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0053354",
    "tt0052780",
    "tt0048001",
    "tt0039679",
    "tt0056696",
    "tt0055946",
    "tt0056026",
    "tt0056307",
    "tt0056692",
    "tt0056693",
    "tt0055831",
    "tt0198388"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:25.000Z"
}