{
  "movieId": "tt0046186",
  "title": "Phantom from Space",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Phantom_From_Space",
      "id": "Phantom_From_Space",
      "title": "Phantom From Space",
      "description": "From IMDb: An alien being lands in Santa Monica. Killing two people who attacked him due to the menacing appearance of his spacesuit, the creature takes it off while being pursued by government authorities, revealing himself to be invisible",
      "fileSize": 2994309394,
      "addedAt": "2026-01-07T00:06:45.466Z",
      "thumbnail": "https://archive.org/services/img/Phantom_From_Space",
      "language": "english",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 182872
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eAEIYb9BX5w",
      "id": "eAEIYb9BX5w",
      "title": "Phantom from Space (1953) | Colorized Public Domain Sci-Fi Mystery with Ted Cooper and Noreen Nash",
      "description": "Phantom from Space (1953) is an American independent science fiction film directed by W. Lee Wilder and produced during the Cold War’s early paranoia era. In this colorized and restored public domain edition, Colorized Public Domain reintroduces a forgotten 1950s gem that combines suspense, alien mystery, and postwar anxiety into a gripping narrative about fear of the unknown. By reviving the film in color and clarity, modern audiences across the United States and Europe can rediscover its eerie atmosphere and mid-century style through the lens of Cold War science fiction.\n\nPlot Summary:\nThe story begins when radar operators in Southern California detect an unidentified flying object entering the atmosphere. When the craft crashes near Santa Monica, strange events begin to unfold — radio communications fail, radar systems short-circuit, and several witnesses report seeing a humanoid figure moving silently in the night. Federal investigators, led by Major Andrews (Ted Cooper) and Dr. Wyatt (Harry Landers), are called to examine the mystery.\n\nSoon they discover that the being is not human but an extraterrestrial visitor wearing an advanced spacesuit that renders him invisible when removed. The alien, suffering from atmospheric incompatibility, struggles to survive on Earth while being hunted by panicked authorities. As scientists and military officers race to understand its nature, moral questions emerge: is the alien a threat, or a victim of misunderstanding and fear?\n\nThe film culminates in a haunting finale inside the Griffith Observatory, where the alien’s presence becomes visible only through special radiation detection. Its death, unseen and uncelebrated, echoes the film’s message — that humanity’s greatest enemy is often its own ignorance and fear.\n\nCast and Crew:\n• Director: W. Lee Wilder\n• Producer: Myles Wilder\n• Screenplay: William Raynor and Myles Wilder\n• Cinematography: William Clothier\n• Music: William Lava\nStarring:\n• Ted Cooper as Major Andrews\n• Noreen Nash as Barbara Randall\n• Harry Landers as Dr. Wyatt\n• Dick Sands as Lt. Peterson\n• Burt Wenland as Sgt. Morrison\n• Rudolph Anders as Dr. Wyatt’s Assistant\n\nFilm Significance:\nPhantom from Space stands out as one of the early independent science fiction features that bridged the atomic-age fears of the 1950s with philosophical questions about human behavior. Produced on a modest budget, it achieved a tense, claustrophobic atmosphere through practical lighting, real Los Angeles locations, and narration reminiscent of government training films.\n\nAlthough not as famous as major studio releases, the film captures the public’s Cold War anxiety — the fear of invasion, radiation, and scientific power beyond control. It also showcases W. Lee Wilder’s unique filmmaking style, often overshadowed by his brother Billy Wilder, one of Hollywood’s greatest directors. For enthusiasts of vintage sci-fi, this is a cultural relic that reflects how postwar America confronted progress, paranoia, and extraterrestrial imagination.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Phantom from Space remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. \n\nWhy Watch This Colorized Edition:\nThe original 1953 release was filmed in black and white, typical of low-budget science fiction of its era. While it effectively conveyed tension through shadows and contrast, many visual details were lost in monochrome. The colorized restoration reintroduces depth to the observatory sequences, enhances the visual energy of the alien’s appearance, and modernizes the texture of mid-century Los Angeles.\n\nDesigned for today’s audiences — particularly viewers aged 55–64 who enjoy Cold War-era nostalgia and classic television aesthetics — this edition brings renewed clarity and emotional resonance to a film that once played in drive-in theaters and late-night television. Watching it today highlights how science fiction once mirrored America’s deepest uncertainties about technology and otherness.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood — from noir mysteries to vintage science fiction. Our mission is to preserve and enhance public domain cinema, ensuring these stories continue to educate and entertain audiences across the United States, Europe, and worldwide.\n\n#PhantomFromSpace #1950sSciFi #PublicDomainMovie",
      "addedAt": "2025-12-24T00:49:30.358Z",
      "thumbnail": "https://i.ytimg.com/vi/eAEIYb9BX5w/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBaKE8wDw==&rs=AOn4CLANLzkryxiME4j1gcPpxy7JooYxhw",
      "duration": 4102,
      "language": "en",
      "year": 1953,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/phantom-from-space-1953",
      "id": "phantom-from-space-1953",
      "title": "Phantom from Space (1953)",
      "description": "After a UFO sighting, a mysterious phantom in a bizarre outfit starts attacking people in San Fernando Valley. Watch on RetroFlix:  https://retroflix.org/phantom-from-space-1953/",
      "fileSize": 1407824440,
      "addedAt": "2026-01-07T00:10:12.699Z",
      "thumbnail": "https://archive.org/services/img/phantom-from-space-1953",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 308
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/phantom.-from.-space.-1953",
      "id": "phantom.-from.-space.-1953",
      "title": "Phantom from Space (1953)",
      "description": "Phantom from Space (1953) is a science fiction film that revolves around a mysterious alien entity.  The story begins when a UFO crashes near a remote location in the Californian desert. The police investigate the crash site and discover an unconscious alien, who, upon waking, escapes, becoming invisible and camouflaged to blend in with its surroundings. As the alien wanders through the area, it creates havoc by attempting to communicate with humans but is unable to convey its peaceful intentions. Local authorities, scientists, and a group of characters, including a newspaper reporter and a police officer, work together to uncover the mystery. Tension heightens as they race against time to find the alien and understand its purpose on Earth, fearing that it might pose a threat. The narrative unfolds with suspenseful interactions, leading to a climax where the characters attempt to save the alien from being hunted down while also exploring themes of misunderstanding and fear of the unknown.",
      "fileSize": 1341848592,
      "addedAt": "2026-01-07T00:10:12.699Z",
      "thumbnail": "https://archive.org/services/img/phantom.-from.-space.-1953",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 200
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5kV9FyZ7Lik",
      "id": "5kV9FyZ7Lik",
      "title": "Phantom From Space (1953) W.LEE WILDER",
      "description": "Stars: Ted Cooper, Tom Daly, Steve Acton\nDirector: W. Lee Wilder\n\nAn alien being with the power of invisibility lands in Santa Monica. Killing two people who attacked him due to the menacing appearance of his spacesuit, the creature takes it off while being pursued by government authorities.",
      "addedAt": "2025-12-26T23:48:41.503Z",
      "thumbnail": "https://i.ytimg.com/vi/5kV9FyZ7Lik/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCNHZjuMrhHsqtFz3b_vJkwSUFCJg",
      "duration": 4342,
      "language": "en",
      "year": 1953,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ALIENSATTACKATTHEBIJOUdoubleFeature",
      "id": "ALIENSATTACKATTHEBIJOUdoubleFeature",
      "title": "ALIENS ATTACK AT THE BIJOU (double feature)",
      "description": "Whether They’re from Mars or Planet X those dastardly aliens are out to get us. The proof is in this simulated double feature program at an inner-city second-run theater. The future shock begins with coming attractions and a cartoon. Then evil aliens in satin Cossack shirts let loose a mini-plague of zombies in “Plan 9 From Outer Space.” Followed by an invisible alien in a visible diving helmet raising hell in Southern California in “Phantom From Space”. We need a border wall in space! NOTE: The superior quality print of “Phantom From Space” used in this simulation will soon be available as a separate item.",
      "fileSize": 3471137312,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/ALIENSATTACKATTHEBIJOUdoubleFeature",
      "collection": "feature_films",
      "downloads": 19440
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PHANTOMFROMSPACEVideoQualityUpgrade",
      "id": "PHANTOMFROMSPACEVideoQualityUpgrade",
      "title": "PHANTOM FROM SPACE video quality upgrade",
      "description": "This print is much sharper and cleaner than the previously available IA copies.   “A little gem” “Better than you’d expect” “Phantom is good fun” “Underrated grade B sci fi” “Boring 50s sci fi” (IMDB reviews quotes). A micro-budget science fiction romp with an unusual plot and a solid cast of competent B-feature actors. Proof that you don’t need mega-bucks to produce an entertaining little film that works. IMDB rating 4.1. Produced & directed by W Lee Wilder Released in 1953. Complete print. CAST NOTE: Rudolph Anders (Dr Wyatt) also played the evil Nazi scientist (Col. Karl Osler) with the hots for Irish McCalla in the jaw-dropping “She Demons.” It’s available here at IA in the Feature Films Collection. https://archive.org/details/SheDemons",
      "fileSize": 1072368556,
      "addedAt": "2026-01-07T00:06:45.466Z",
      "thumbnail": "https://archive.org/services/img/PHANTOMFROMSPACEVideoQualityUpgrade",
      "collection": "feature_films",
      "downloads": 25673
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "73 min",
    "imdbRating": 4.1,
    "imdbVotes": 1695,
    "Genre": "Horror, Sci-Fi",
    "Plot": "An alien being with the power of invisibility lands in Santa Monica. Killing two people who attacked him due to the menacing appearance of his spacesuit, the creature takes it off while being pursued by government authorities.",
    "Director": "W. Lee Wilder",
    "Writer": "William Raynor, Myles Wilder",
    "Actors": "Ted Cooper, Tom Daly, Steve Acton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0047149",
    "tt0047507",
    "tt0046066",
    "tt0045920",
    "tt0045546",
    "tt0049234",
    "tt0044406",
    "tt0046907",
    "tt0046876",
    "tt0046802",
    "tt0047573",
    "tt0047244"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:22:06.570Z"
}