{
  "imdbId": "tt0035452",
  "title": "Tomorrow We Live",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TomorrowWeLive",
      "title": "TomorrowWeLive",
      "description": "Julie Bronson (Jean Parker), whose father, \"Pop\" Bronson (Emmett Lynn) operates a desert café, is attracting the unwanted attention of a half-crazed gangster known as The Ghost (Ricardo Cortez) who runs a desert night club several miles away. The Ghost knows that \"Pop\" Bronson is an escaped convict and blackmails him into using his desert shack as a warehouse for \"hot\" stolen rubber tires to be sold on the Black Market.",
      "id": "TomorrowWeLive"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g9ut_TVeAUo",
      "title": "Tomorrow We Live (1942) EDGAR G. ULMER",
      "description": "Stars: Ricardo Cortez, Jean Parker, Emmett Lynn\n Director: Edgar G. Ulmer\n\n Julie Bronson, whose father operates a desert café, is attracting the unwanted attention of a half-crazed gangster known as The Ghost !",
      "id": "g9ut_TVeAUo",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": "6.3",
    "imdbVotes": "263",
    "Genre": "Drama, Romance, Thriller",
    "Plot": "Into the small river port of St.Pierre-le-Port within Brittany under German occupation during the height of World War Two sneaks French patriot Jean Batiste who is on the run after illegally having left San Lazear seeking safe passage to England. Befriended by townsfolk including waitress Frisette, Jean is turned away for lodging by innkeeper's wife Fauntel before finding refuge with baker's mother L. Labouche who bluffs away Nazi searcher Kutrz. Lieutenant Rabineau brings word to Commandant Lazarette and aide Von Kleist that the local resistance movement has fired the petrol dump, then next day 54 German cars are demobilized with flat tires, each indignity marked by leaving a small white Lorraine Cross as the symbol of Free France. Instead of tightening security, Lazarett is persuaded by supposed-collaborators mayor Pierre DuSchen and daughter Marie to lessen patrols which might reap better feeling from the populace. Issued covering papers by the mayor's secretary Boileau, Jean secures shipyard employment before white-bearded Matthueu whisks him underground where rebel Pogo is smuggling three English sailor out by channel. Intent on getting details of the German submarine base at St. Nazaire back to England. Jean is assured that Marie is only pretending cooperation with the Boche but later spots her at a Hitler-featured movie where Lazarette clears the theatre when the audience lets loose with catcalls. Warned the vital ammunition train will be sabotaged, Lazarret learns from German-blooded cafe waitress informant Germaine Bertan that signalmen have been switched. Taken to the Stationmaster's office upon receiving a note from the freedom fighters, Marie furtively slips into the machinery room and pulls a track switch to send the ammo train exploding into a freight-car amid confusion in negating a fake bomb. After Lazarette has shot citizen Moreau who refused to yield on the pavement, Germaine calls the Nazi high command to inform of the underground hideout to which she has trailed Pogo. Horrified to see Jean with whom she has fallen in love also enter. Germaine kills Lazarret and badly wounds Von Keist prompting Gestapo official Seitz to order 50 hostages, headed by Pierre, shot if the assassin not revealed. Switching sympathies and refusing to identify a dress fragment found at the station, Germaine is killed upon approaching Marie's home. Finally realizing that Marie is aiding the resistance, after Seitz has reached the same conclusion, Jean persuades her to leave with him that evening, which is heartily endorsed by Pierre. Escaping a Nazi roundup, Jean boards a small rowboat with Marie, as semi-comatose Von Kleist discloses the secret pump-house entrance, though the Germana's arrive too late to nab the departing duo. Convincing the wealthy Jacquier and the others not to weaken into denouncing their compatriots but to uphold freedom's torch with an undaunted spirit, Pierre and the brave French folk sing the \"Marseilles\" as they march courageously to the death by firing squad. Stopped momentarily in the channel by Seitz before havoc reigns when Matthieu throws master switches illuminating the shipyard for a devastating bombardment by the Britsh, Jean and Marie sail toward Engkland under the glowing light of dawn, red-hued but clear.",
    "Director": "George King",
    "Writer": "Anatole de Grunwald, Dorothy Hope, Katherine Strueby",
    "Actors": "John Clements, Godfrey Tearle, Hugh Sinclair",
    "Language": "German, French, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0035612",
      "title": "The Adventures of Tartu",
      "year": 1943,
      "imdbRating": "6.9",
      "imdbVotes": "1,095",
      "language": "German, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032842",
      "title": "Night Train to Munich",
      "year": 1940,
      "imdbRating": "7.2",
      "imdbVotes": "5,888",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027481",
      "title": "The Crimes of Stephen Hawke",
      "year": 1936,
      "imdbRating": "5.6",
      "imdbVotes": "350",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037547",
      "title": "Blood on the Sun",
      "year": 1945,
      "imdbRating": "6.0",
      "imdbVotes": "2,330",
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036095",
      "title": "The Lamp Still Burns",
      "year": 1943,
      "imdbRating": "6.2",
      "imdbVotes": "230",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038990",
      "title": "The Strange Woman",
      "year": 1946,
      "imdbRating": "6.5",
      "imdbVotes": "2,520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035009",
      "title": "The Mad Monster",
      "year": 1942,
      "imdbRating": "3.5",
      "imdbVotes": "1,975",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt16156352",
      "title": "Vladivostok",
      "year": 2021,
      "imdbRating": "5.4",
      "imdbVotes": "108",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0034538",
      "title": "Bombs Over Burma",
      "year": 1942,
      "imdbRating": "5.2",
      "imdbVotes": "262",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035525",
      "title": "Vom Schicksal verweht",
      "year": 1942,
      "imdbRating": "5.8",
      "imdbVotes": "22",
      "language": "German, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035294",
      "title": "Schicksal",
      "year": 1942,
      "imdbRating": "7.5",
      "imdbVotes": "23",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018972",
      "title": "Hangman's House",
      "year": 1928,
      "imdbRating": "6.6",
      "imdbVotes": "549",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T01:58:05.172Z"
}