{
  "imdbId": "tt0035009",
  "title": "The Mad Monster",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HB81HSHRauo",
      "title": "The Mad Monster (1942) [Horror] [Drama]",
      "description": "The Mad Monster is an American horror film released in 1942 by P.R.C. (Producers Releasing Corporation), a Poverty Row studio. The film, a B-movie shot in black and white, features a mad scientist and a werewolf as the main characters.\n\nThe plot involves a scientist who has been discredited by his peers. He attempts to kill them off after he develops a secret formula that transforms his gardener into a murderous wolf man. The story begins on a fog-bound moonlight night in a swamp; a wolf howls. The scene shifts to the nearby laboratory of Dr. Lorenzo Cameron (George Zucco), who draws blood from a caged wolf. Secured to a table is Dr. Cameron's simpleminded but strong gardener, Petro (Glenn Strange), who is to be the doctor's subject in an experiment. Dr. Cameron injects a serum made from a wolf's blood into the cooperative Petro, who loses consciousness, grows fur and fangs, and awakens after he has completely turned into a wolf man.\n\nDr. Cameron then turns to an empty table and visualizes his former colleagues sitting there—four professors who ridiculed his theory that transfusions of wolf blood could be used to give a human being wolf-like traits. He recalls how the scientific community, the press and the public joined in a resounding chorus of ridicule, which cost Cameron his position at the University. Addressing the spectral professors, Cameron declares, \"Right now, we're at war. At war with an enemy that produces a horde that strikes with a ferocious fanaticism\". Cameron proposes giving wolf man traits to the army to help with the war. When the professors scoff, Cameron says that his proposal matters no longer; he is now going to have his wolf man kill his former colleagues. Cameron then administers an antidote to Petro that transforms him back into a human; Petro remembers nothing.\nThe following night, Cameron turns Petro into a wolf and sends him to the swamp. Before the night is over Petro has entered a nearby home and killed a little girl. When Cameron hears of the child's fate, he knows his formula works. He turns to his real priority which is destroying the scientists who ruined his career. The rest of the film involves Cameron setting up elaborate scenarios in which Petro is alone with each scientist when he becomes a wolf. The more he does this the more Petro's transformations into a wolf man become unpredictable.\n\nCameron's daughter Lenora (Anne Nagel) is romantically involved with Tom Gregory (Johnny Downs), a newspaper reporter who is investigating the death of the little girl. As the professors are killed off one by one, Gregory begins to suspect that Cameron is behind the slayings. The principals are in the Cameron home when a thunderstorm begins and a bolt of lightning sets Cameron's laboratory on fire. Lenora and Tom escape from the house after encountering Petro in wolf form. Petro turns on Cameron and kills him, just before the fire brings the house down on both of them.\n\n---\n\nDirected by Sam Newfield, produced by Sigmund Neufeld, written by Fred Myton, starring Johnny Downs as Tom Gregory, George Zucco as Dr. Lorenzo Cameron, Anne Nagel as Lenora Cameron, Glenn Strange as Petro, Sarah Padden as Grandmother, Gordon De Main as Professor Fitzgerald, Mae Busch as Susan, Reginald Barlow as Professor Warwick, Robert Strange as Professor Blaine, Henry Hall as Country Doctor, Ed Cassidy as Father, John Elliott as Professor Hatfield, Slim Whitaker as Officer Dugan, Gil Patric as Detective Lieutenant.\n\n---\n\nSource: \"The Mad Monster\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 1 December 2013. Web. 29 December 2013. http://en.wikipedia.org/wiki/The_Mad_Monster.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "HB81HSHRauo",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The.Mad.Monster",
      "title": "The.Mad.Monster",
      "description": "From IMDb : A mad scientist changes his simple-minded handyman into a werewolf in order to prove his supposedly crazy scientific theories - and exact revenge. Isn't that always the way? Stars: Johnny Downs, George Zucco, Anne Nagel, and Glenn Strange The 916MB MPEG4 file here was derived from the 3.8GB MPEG2 file found on this page . The reason being to provide a quality copy in a smaller size for downloading.",
      "id": "The.Mad.Monster"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The.Mad.Monster_201511",
      "title": "The.Mad.Monster 201511",
      "id": "The.Mad.Monster_201511"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mad_monster",
      "title": "Mad Monster",
      "id": "mad_monster"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6SNmCi35Qxc",
      "title": "The Mad Monster (1942) | Colorized Public Domain Horror Classic with George Zucco and Glenn Strange",
      "description": "The Mad Monster (1942) is an American horror film directed by Sam Newfield and produced by Producers Releasing Corporation, one of the most prolific low-budget studios of the 1940s. This colorized and restored version of the public domain classic revives a chilling tale of science gone wrong, deception, and terror. Featuring George Zucco as the unhinged scientist and Glenn Strange as his tragic creation, this film reflects the era’s fascination with mad science, transformation, and the blurred line between human and monster. By carefully restoring and colorizing this cult horror gem, Colorized Public Domain makes the film more visually immersive and accessible to audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nDr. Cameron (George Zucco), a disgraced scientist shunned by his peers for unorthodox experiments, develops a serum that can turn humans into wolf-like creatures. Bent on revenge against the colleagues who mocked and rejected him, he tests his serum on his simple-minded gardener, Petro (Glenn Strange). Petro becomes a terrifying beast under Cameron’s control, sent to eliminate the men who destroyed Cameron’s career.\n\nMeanwhile, Cameron’s daughter Lenora (Anne Nagel) grows increasingly suspicious of her father’s experiments and his strange behavior. She begins to uncover the sinister truth about Petro’s transformation and the violent killings that follow. The film escalates toward a final confrontation in which the monster’s humanity clashes with its uncontrollable savage instincts, leading to a tragic and destructive climax.\n\nCast and Crew:\n• Director: Sam Newfield\n• Producer: Sigmund Neufeld\n• Screenplay: Fred Myton\n• Cinematography: Jack Greenhalgh\n• Editing: Holbrook N. Todd\n\nStarring:\n• George Zucco as Dr. Cameron\n• Glenn Strange as Petro the Monster\n• Anne Nagel as Lenora Cameron\n• Johnny Downs as Tom Gregory\n• Gordon De Main as Professor Fitzgerald\n• Reginald Barlow as Professor Warwick\n• Henry Hall as Professor Blaine\n• Robert Strange as Professor Leonard\n\nFilm Significance:\nThe Mad Monster represents the wave of low-budget horror films that emerged during the early 1940s, capitalizing on audiences’ fascination with werewolves, science fiction, and gothic themes. While it lacked the production values of Universal’s monster films, it resonated with audiences seeking escapist thrills during the World War II years. George Zucco’s commanding performance as the vengeful scientist and Glenn Strange’s portrayal of the monster foreshadowed his later fame as Frankenstein’s Monster in Universal’s “House of Frankenstein” (1944). Today, The Mad Monster remains a fascinating example of “Poverty Row” filmmaking, delivering atmosphere and chills despite its limited resources.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Mad Monster remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1942 release was presented in black and white, standard for its era and budget. While authentic to its time, many modern audiences tend to avoid older black-and-white films. By offering a colorized edition, we revitalize the atmosphere of classic horror while preserving the tension, performances, and themes that define its legacy. This version bridges the gap between historical preservation and modern viewing preferences, ensuring that The Mad Monster continues to captivate audiences as both horror entertainment and a cultural artifact.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to celebrated Hollywood treasures. Our work ensures these films remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheMadMonster #GeorgeZucco #GlennStrange #PublicDomainMovie #ClassicHorror #ColorizedClassic #1940sCinema #FilmRestoration #GoldenAgeHorror #CultHorror",
      "id": "6SNmCi35Qxc",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-mad-monster-1942",
      "title": "The Mad Monster (1942)",
      "description": "A mad scientist changes his simple-minded handyman into a werewolf in order to prove his supposedly crazy scientific theories - and exact revenge. Watch on RetroFlix:  https://retroflix.org/the-mad-monster-1942/",
      "id": "the-mad-monster-1942"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u6C0SOIRkXY",
      "title": "The Mad Monster (1942) HORROR",
      "description": "Stars: George Zucco, Johnny Downs, Anne Nagel\nDirector: Sam Newfield\n\nA mad scientist changes his simple-minded handyman into a werewolf in order to prove his supposedly crazy scientific theories - and exact revenge.",
      "id": "u6C0SOIRkXY",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gxPrOx8gtoU",
      "title": "The Mad Monster (1942) George Zucco | Monster Horror, Romance | Full Length Movie",
      "description": "The blood of a wolf he placed in the veins of a man... and created a monster such as the world has never known!\nA mad scientist changes his simple-minded handyman into a werewolf in order to prove his supposedly crazy scientific theories - and exact revenge.\n\nDirector: Sam Newfield\nWriter: Fred Myton \nStars: Johnny Downs, George Zucco, Anne Nagel \nGenres:  Classics, Cult Film, Drama, Horror, Romance, Sci-Fi\nReferred to in MST3K Episode 103\n\n@CultCinemaClassics:\nhttps://linktr.ee/cultcinemaclassics",
      "id": "gxPrOx8gtoU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "77 min",
    "imdbRating": "3.5",
    "imdbVotes": "1,975",
    "Genre": "Drama, Horror, Romance",
    "Plot": "Dr. Cameron has succeeded in his experiments with a serum which will turn a man into a wolf-like monster, and is ready to avenge himself on the men who caused his professional failure. He uses it on his gardener Petro and one after the other is killed by his creation. His daughter, Lenora, grows suspicious and confides with newspaper reporter Tom Gregory.",
    "Director": "Sam Newfield",
    "Writer": "Fred Myton",
    "Actors": "Johnny Downs, George Zucco, Anne Nagel",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0035784",
      "title": "Dead Men Walk",
      "year": 1943,
      "imdbRating": "4.8",
      "imdbVotes": "1,713",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035231",
      "title": "Queen of Broadway",
      "year": 1942,
      "imdbRating": "6.0",
      "imdbVotes": "59",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0035679",
      "title": "The Black Raven",
      "year": 1943,
      "imdbRating": "5.5",
      "imdbVotes": "839",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0035106",
      "title": "The Mysterious Rider",
      "year": 1942,
      "imdbRating": "5.4",
      "imdbVotes": "84",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030023",
      "title": "Crashing Through Danger",
      "year": 1936,
      "imdbRating": "4.6",
      "imdbVotes": "81",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035162",
      "title": "Outlaws of Boulder Pass",
      "year": 1942,
      "imdbRating": "5.6",
      "imdbVotes": "89",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033393",
      "title": "Billy the Kid's Fighting Pals",
      "year": 1941,
      "imdbRating": "6.4",
      "imdbVotes": "74",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033391",
      "title": "Billy the Kid Wanted",
      "year": 1941,
      "imdbRating": "5.8",
      "imdbVotes": "93",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035723",
      "title": "Cattle Stampede",
      "year": 1943,
      "imdbRating": "6.3",
      "imdbVotes": "116",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035804",
      "title": "Devil Riders",
      "year": 1943,
      "imdbRating": "5.8",
      "imdbVotes": "118",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033845",
      "title": "The Lone Rider in Frontier Fury",
      "year": 1941,
      "imdbRating": "5.0",
      "imdbVotes": "53",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035908",
      "title": "Fugitive of the Plains",
      "year": 1943,
      "imdbRating": "5.3",
      "imdbVotes": "105",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T03:00:16.121Z"
}