{
  "imdbId": "tt0001223",
  "title": "Frankenstein",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FrankensteinfullMovie",
      "title": "Frankenstein",
      "description": "This is Edison's COMPLETE 1910 silent Frankenstein film.",
      "id": "FrankensteinfullMovie"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Frankenstein1910",
      "title": "Frankenstein (1910)",
      "description": "This 1910 adaptation of Mary Shelley's classic tale was written and directed by J. Searle Dawley and produced at the Edison Studios in New York. You can find out more about Frankenstein at A Passion For Horror .",
      "id": "Frankenstein1910"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Frankenstein_324",
      "title": "Frankenstein",
      "description": "A Fragment Of The Silent Frankenstein film from 1910 Download the full film here: http://www.archive.org/details/FrankensteinfullMovie",
      "id": "Frankenstein_324"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Frankenstein_628",
      "title": "Frankenstein",
      "description": "The first film adaptation of the often filmed Mary Shelley story. This film was originally released on March 18 1910. From the Edison Kinetogram: Frankenstein, a young student, is seen bidding his sweetheart and father goodbye, as he is leaving home to enter a college in order to study the sciences. Shortly after his arrival at college he becomes absorbed in the mysteries of life and death to the extent of forgetting practically everything else. His great ambition is to create a human being, and finally one night his dream is realized. He is convinced that he has found a way to create a most perfect human being that the world has ever seen. We see his experiment commence and the development of it. To Frankenstein's horror, instead of creating a marvel of physical beauty and grace, there is unfolded before his eyes and before the audience an awful, ghastly, abhorrent monster. As he realizes what he has done Frankenstein rushes from the room, only to have the misshapen monster peer at him through the curtains of his bed. He falls fainting to the floor, where he is found by his servant, who revives him. After a few weeks' illness, he returns home, a broken, weary man, but under the loving care of father and sweetheart he regains his health and strength and begins to take a less morbid view of life. In other words, the story of the film brings out the fact that the creation of the monster was only possible because Frankenstein had allowed his normal mind to be overcome by evil and unnatural thoughts. His marriage is soon to take place. But one evening, while sitting in his library, he chances to glance in the mirror before him and sees the reflection of the monster which has just opened the door of his room. All the terror of the past comes over him and, fearing lest his sweetheart should learn the truth, he bids the monster conceal himself behind the curtain while he hurriedly induces his sweetheart, who then comes in, to stay only a moment. The monster, who is following his creator with the devotion of a dog, is insanely jealous of anyone else. He snatches from Frankenstein's coat the rose which his sweetheart has given him, and in the struggle throws Frankenstein to the floor, here the monster looks up and for the first time confronts his own reflection in the mirror. Appalled and horrified at his own image he flees in terror from the room. Not being able, however to live apart from his creator, he again comes to the house on the wedding night and, searching for the cause of his jealousy, goes into the bride's room. Frankenstein coming into the main room hears a shriek of terror, which is followed a moment after by his bride rushing in and falling in a faint at his feet. The monster then enters and after overpowering Frankenstein's feeble efforts by a slight exercise of his gigantic strength leaves the house. When Frankenstein's love for his bride shall have attained full strength and freedom from impurity it will have such an effect upon his mind that the monster cannot exist. The monster, broken down by his unsuccessful attempts to be with his creator, enters the room, stands before a large mirror and holds out his arms entreatingly. Gradually, the real monster fades away, leaving only the image in the mirror. A moment later Frankenstein himself enters. As he stands directly before the mirror he see's the image of the monster reflected instead of his own. Gradually, however, under the effect of love and his better nature, the monster's image fades and Frankenstein sees himself in his young manhood in the mirror. His bride joins him, and the film ends with their embrace, Frankenstein's mind now being relieved of the awful horror and weight it has been laboring under for so long.",
      "id": "Frankenstein_628"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Frankenstein_329",
      "title": "Frankenstein",
      "description": "This is the first version of the classic horror story. It came out of the Edison s studios in 1910",
      "id": "Frankenstein_329"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Frankenstein_421",
      "title": "Frankenstein",
      "description": "This is a really old Frankenstein movie made by the Edison corporation. It isn't a very good copy, but any copy is better than no copy. It was originally made in 1910",
      "id": "Frankenstein_421"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-frankenstein",
      "title": "Frankenstein",
      "id": "silent-frankenstein"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "16 min",
    "imdbRating": "6.4",
    "imdbVotes": "5,022",
    "Genre": "Short, Fantasy, Horror",
    "Plot": "Frankenstein, a young medical student, trying to create the perfect human being, instead creates a misshapen monster. Made ill by what he has done, Frankenstein is comforted by his fiancée but on his wedding night he is visited by the monster. A fight ensues but the monster, seeing himself in a mirror, is horrified and runs away. He later returns, entering the new bride's room, and finds her alone.",
    "Director": "J. Searle Dawley",
    "Writer": "Mary Shelley, J. Searle Dawley",
    "Actors": "Mary Fuller, Charles Ogle, Augustus Phillips",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0000669",
      "title": "Cupid's Pranks",
      "year": 1908,
      "imdbRating": "4.9",
      "imdbVotes": "160",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001544",
      "title": "A Christmas Carol",
      "year": 1910,
      "imdbRating": "6.0",
      "imdbVotes": "902",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000614",
      "title": "The Red Spectre",
      "year": 1907,
      "imdbRating": "6.5",
      "imdbVotes": "1,176",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1122806",
      "title": "Copper Mines at Bingham, Utah",
      "year": 1912,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000749",
      "title": "Rescued from an Eagle's Nest",
      "year": 1908,
      "imdbRating": "5.8",
      "imdbVotes": "872",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000301",
      "title": "Faust and Marguerite",
      "year": 1900,
      "imdbRating": "4.4",
      "imdbVotes": "437",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0223755",
      "title": "The Monster",
      "year": 1903,
      "imdbRating": "6.3",
      "imdbVotes": "1,382",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001463",
      "title": "The Wonderful Wizard of Oz",
      "year": 1910,
      "imdbRating": "5.7",
      "imdbVotes": "1,652",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2481878",
      "title": "Absurd Encounter with Fear",
      "year": 1967,
      "imdbRating": "5.5",
      "imdbVotes": "1,329",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0191358",
      "title": "Pikovaya dama",
      "year": 1910,
      "imdbRating": "5.4",
      "imdbVotes": "202",
      "language": "None, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020530",
      "title": "Un chien andalou",
      "year": 1929,
      "imdbRating": "7.6",
      "imdbVotes": "54,952",
      "language": "French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0470339",
      "title": "The Haunted Bedroom",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "27",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": true,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}