{
  "imdbId": "tt0035663",
  "title": "Bar 20",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bar-20-1943",
      "id": "bar-20-1943",
      "title": "Bar 20 (1943) colorized =Hopalong Cassidy=",
      "description": "Stagecoach robbers make off with the money Hopalong Cassidy (William Boyd) was going to use to buy cattle for the Bar 20 ranch, as well as with the jewels of the fiancée (Dustine Farnum) of Richard Adams (Robert Mitchum). The robbers are secretly working for Mark Jackson (Victor Jory), part of his plan to get control of Adams' land. But he didn't realize the determination of Hoppy and his pals California Carlson (Andy Clyde) and Lin Bradley (George Reeves) to recover their money and bring the miscreant to justice. William Boyd as Hopalong Cassidy George Reeves as Lin Bradley Andy Clyde as California Carlson Robert Mitchum as Richard Adams Victor Jory as Mark Jackson Dustine Farnum as Marie Stevens Betty Blythe as Mrs. Stevens Douglas Fowley as Henchman Slash Francis McDonald as Quirt Rankin Earle Hodgins as Tom I colorized this using AI software that doesn't always get the colors right, but I think it looks fairly natural. Hopefully a more professional job will be done someday.",
      "fileSize": 761922710,
      "addedAt": "2026-01-07T00:07:31.713Z",
      "thumbnail": "https://archive.org/services/img/bar-20-1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 2448
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "54 min",
    "imdbRating": 6.2,
    "imdbVotes": 279,
    "Genre": "Drama, Western",
    "Plot": "Mark Jackson has a scheme to get Adams' land. His gang robs Adams' fiancé of her jewels, robs Hoppy of his cattle money, and then gives that money to Adams to buy back the jewels in exchange for a deed to his land. But Lin recognizes the bills and Hoppy and his pals go after the robbers.",
    "Director": "Lesley Selander",
    "Writer": "Morton Grant, Norman Houston, Michael Wilson",
    "Actors": "William Boyd, Andy Clyde, George Reeves",
    "Language": "Spanish, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0035692",
    "tt0036835",
    "tt0035487",
    "tt0033546",
    "tt0037030",
    "tt0031925",
    "tt0032706",
    "tt0033160",
    "tt0035700",
    "tt0032592",
    "tt0037693",
    "tt0035701"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.713Z"
}