{
  "imdbId": "tt0018618",
  "title": "Across to Singapore",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/across-to-singapore-1928_202507",
      "id": "across-to-singapore-1928_202507",
      "title": "Across To Singapore (1928)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. Joan Crawford and Ramon Novarro star in this love triangle romance between Crawford's character and two feuding brothers. Reviews and box office don't seem to have been worth mentioning, though with Novarro's star power it would have to be assumed that it made at least a little money. Modern reviews appreciate the acting, but the overall story feels weak. ",
      "fileSize": 4708156807,
      "addedAt": "2026-01-07T00:07:18.439Z",
      "thumbnail": "https://archive.org/services/img/across-to-singapore-1928_202507",
      "language": "eng",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 52
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/across-to-singapore_1928",
      "id": "across-to-singapore_1928",
      "title": "Across to Singapore",
      "fileSize": 4769559885,
      "addedAt": "2026-01-07T00:07:18.439Z",
      "thumbnail": "https://archive.org/services/img/across-to-singapore_1928",
      "language": "English",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 558
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "85 min",
    "imdbRating": 6.2,
    "imdbVotes": 1173,
    "Genre": "Crime, Drama, Romance",
    "Plot": "It's the mid-nineteenth century. The neighboring Shore and Crowninshield families of the American east coast have a long tradition of seafaring. Of Jeremiah Shore's four sons, the only one not at sea is the youngest, Joel Shore, solely because of his age. Joel has had a long friendship with the Crowninshield's daughter, Priscilla Crowninshield, that friendship which is now on the brink of romantic love as they become of age, although this new-found love is unspoken on both sides. Joel hopes that when his eldest brother, Mark Shore, captain of the Nathan Ross, returns home from his latest voyage, he will allow Joel to sail with him. Although Mark still sees Joel as the \"youngin'\" of the family, Joel, through slightly underhanded means, is able to convince Mark that he is man enough to become a sailor. Also on this layover at home, Mark notices that Priscilla has become a beautiful young woman, who he now wants to marry. Mark arranges the engagement with his father and Priscilla's father without Priscilla's knowledge. The public announcement of the engagement shocks both Joel and Priscilla, the latter who has no romantic interest in Mark. On the Nathan Ross' first sailing following the engagement, that sailing to Singapore, Captain Mark makes a decision that unwittingly sets off a series of events that jeopardize both his and Joel's lives, but also tests whether in this situation family and brotherly loyalty or being with the woman you love is more important.",
    "Director": "William Nigh",
    "Writer": "Ben Ames Williams, Ted Shane, Joseph Farnham",
    "Actors": "Ramon Novarro, Joan Crawford, Ernest Torrence",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0018179",
    "tt0019979",
    "tt0020560",
    "tt0018362",
    "tt0019811",
    "tt0021239",
    "tt0020980",
    "tt0028360",
    "tt0029941",
    "tt0032404",
    "tt0026458",
    "tt0024151"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.439Z"
}