{
  "imdbId": "tt0031051",
  "title": "The Arizona Kid",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Arizona_Kid_1939",
      "id": "Arizona_Kid_1939",
      "title": "The Arizona Kid",
      "description": "Roy Rogers is a Confederate officer in Missouri. Derived from the mpeg2 file found here.",
      "fileSize": 1009200795,
      "addedAt": "2026-01-07T00:06:09.635Z",
      "thumbnail": "https://archive.org/services/img/Arizona_Kid_1939",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 22923
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/arizona_kid",
      "id": "arizona_kid",
      "title": "Arizona Kid, The",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 2749931481,
      "addedAt": "2026-01-07T00:07:25.000Z",
      "thumbnail": "https://archive.org/services/img/arizona_kid",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 93886
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6RmOuZ3LP4k",
      "id": "6RmOuZ3LP4k",
      "title": "The Arizona Kid (1939) | Colorized Public Domain Western with Roy Rogers and Gabby Hayes",
      "description": "The Arizona Kid (1939) is a classic American Western directed by Joseph Kane and distributed by Republic Pictures. Starring Roy Rogers in one of his signature early roles alongside George “Gabby” Hayes, this restored and colorized public domain film combines action, music, and frontier adventure. Released at the height of the B-Western era, it reflects Republic’s trademark fast pacing, charismatic heroes, and thrilling conflicts set against the backdrop of the American frontier. With its blend of cavalry battles, outlaw showdowns, and musical interludes, The Arizona Kid showcases the enduring popularity of singing cowboys in pre-war Hollywood.\n\nPlot Summary:\nSet during the American Civil War, the story follows Roy Rogers, a Confederate officer who adopts the name “The Arizona Kid” after being sent west on a mission. Tasked with curbing lawlessness in Missouri, Roy and his loyal companion Gabby Whittaker (George Hayes) must confront renegades led by the ruthless McBride (Stuart Hamblen).\n\nAs tensions rise, Roy faces the challenge of enforcing justice in a land torn between loyalty and betrayal. Along the way, he finds romance with Laura Radcliffe (Sally March), whose family is caught in the crossfire of divided loyalties. With cavalry skirmishes, horseback chases, and musical moments highlighting Roy’s trademark songs, the film builds to a climactic confrontation where honor, courage, and sacrifice determine the fate of the frontier.\n\nCast and Crew:\n• Director: Joseph Kane\n• Producer: Republic Pictures\n• Cinematography: Jack A. Marta\n• Editing: Edward Mann\n\nStarring:\n• Roy Rogers as The Arizona Kid\n• George “Gabby” Hayes as Gabby Whittaker\n• Stuart Hamblen as Ben McBride\n• Sally March as Laura Radcliffe\n• Earl Dwire as Col. Ben Radcliffe\n• Carleton Young as Capt. Danvers\n\nFilm Significance:\nThe Arizona Kid holds a special place in the legacy of Roy Rogers, who was rising to fame as Republic Pictures’ marquee singing cowboy during the late 1930s. By combining Civil War themes with frontier law-and-order storytelling, the film blends historical drama with Western traditions. George “Gabby” Hayes provides comic relief and loyal companionship, cementing his reputation as one of Hollywood’s most beloved sidekicks.\n\nAs a Republic Pictures release, the film demonstrates the studio’s formula of producing efficient, action-driven Westerns designed for Saturday matinee audiences. Its mix of romance, patriotism, and music helped solidify Roy Rogers as a national star, eventually earning him the title “King of the Cowboys.” Stuart Hamblen’s performance as the villain adds intensity, while Sally March’s role provides both heart and moral conflict amid the turmoil of war.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is free of copyright restrictions and can be shared, preserved, and enjoyed without limitation. At Colorized Public Domain, we restore and enhance these cinematic treasures through careful digital cleaning, visual restoration, and professional colorization. Our goal is to breathe new life into forgotten classics like The Arizona Kid, allowing audiences worldwide to rediscover their cultural and entertainment value. By colorizing this Western, we add richness and vibrancy to its landscapes, costumes, and action sequences, making it more engaging for 21st-century viewers while honoring its original artistry.\n\nWhy Watch This Colorized Edition:\nThe Arizona Kid represents the golden age of the B-Western, when studios like Republic Pictures delivered fast-paced adventure films that entertained audiences during the Great Depression and beyond. By colorizing this film, the rugged frontier settings, cavalry uniforms, and high-energy showdowns are brought vividly to life, making the excitement and charm of Roy Rogers’ performance more accessible for modern audiences. For fans of Westerns, Civil War dramas, or classic Hollywood history, this edition offers a new way to appreciate one of Roy Rogers’ defining early works.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from Hollywood’s Golden Age, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences worldwide.\n\n#TheArizonaKid #RoyRogers #GabbyHayes #RepublicPictures #ClassicWestern #PublicDomainMovie #ColorizedClassic #WesternMovies #1930sCinema #FilmRestoration #SingingCowboy #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:48:11.683Z",
      "thumbnail": "https://i.ytimg.com/vi/6RmOuZ3LP4k/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBlKGUwDw==&rs=AOn4CLD7B2FOYXfIGKqVMJx9j_cUdSYw8Q",
      "duration": 3166,
      "language": "en",
      "year": 1939,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=m3BKVSpP80s",
      "id": "m3BKVSpP80s",
      "title": "The Arizona Kid (1939) ROY ROGERS",
      "description": "Stars: Roy Rogers, George 'Gabby' Hayes and Sally March\nDirector: Joseph Kane\n\nRoy is a Confederate officer stationed in Missouri during the Civil War. He must put an end to outlaw gangs working under the pretense of service to the Confederacy.",
      "addedAt": "2025-12-26T23:57:32.991Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/m3BKVSpP80s/maxresdefault.webp",
      "duration": 3413,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 5.9,
    "imdbVotes": 248,
    "Genre": "Drama, Music, Western",
    "Plot": "Roy and Gabby deliver horses to Missouri in 1861. When the war breaks out, they become confederate scouts. When the rebel McBride and his gang of murderers attack them, Roy is shot and left for dead. One of McBride's raiders is Dave who is a friend of Roy and he returns to save him. Later Roy captures McBride's gang including Dave and has to have them executed. Then he heads after McBride.",
    "Director": "Joseph Kane",
    "Writer": "Luci Ward, Gerald Geraghty",
    "Actors": "Roy Rogers, George 'Gabby' Hayes, Sally March",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0031216",
    "tt0031889",
    "tt0032107",
    "tt0033287",
    "tt0033286",
    "tt0032274",
    "tt0033367",
    "tt0033771",
    "tt0034088",
    "tt0033944",
    "tt0034832",
    "tt0035255"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:25.000Z"
}