{
  "imdbId": "tt0049621",
  "title": "Please Murder Me!",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Please_Murder_Me_movie",
      "title": "Please Murder Me",
      "description": "    How's that for a title? Lawyer Raymond Burr (seeming very much like Perry Mason) brilliantly defends Angela Lansbury, who seems certain to be found guilty of murdering her husband, who was Burr's best friend! Instead of spoiling it for you, I'll just say that a couple of surprises lie ahead for him. It's a wonder this film was allowed to become p.d. Don't miss it. Also appearing are Dick Foran, John Dehner, Lamont Johnson, and Denver Pyle. You can load the mpeg2 file into DVDAuthorGUI (a free program) and create a DVD to watch on your television.",
      "id": "Please_Murder_Me_movie"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y4jaS6r2ZA0",
      "title": "Please Murder Me! (1956) | Colorized Public Domain Film Noir Crime | Angela Lansbury & Raymond Burr",
      "description": "Please Murder Me! (1956) is a classic American film noir directed by Peter Godfrey, starring Raymond Burr and Angela Lansbury in a gripping tale of love, betrayal, and moral justice. This restored and colorized public domain version revitalizes one of the most underrated mid-1950s courtroom dramas, transforming its stark black-and-white visuals into a vivid color experience for today’s audiences. Colorized Public Domain proudly brings this restored masterpiece to modern viewers across the United States, Europe, and worldwide — preserving its psychological tension, noir atmosphere, and moral complexity in full cinematic detail.\n\nPlot Summary:\nDefense attorney Craig Carlson (Raymond Burr) finds himself torn between love and ethics when he takes on the case of his close friend’s wife, Myra Leeds (Angela Lansbury), who is accused of murder. Against all odds and his better judgment, Carlson secures her acquittal — but soon discovers her guilt and deceit. Stricken by guilt and haunted by betrayal, Carlson devises an elaborate plan to expose Myra’s treachery and deliver poetic justice. His confession, recorded before his death, becomes the chilling centerpiece of the story, forcing both Myra and the audience to confront the devastating consequences of lies, greed, and passion.\n\nSet against the moody backdrop of postwar America, the film masterfully intertwines romance and moral decay, delivering a story that feels timeless — where crime, love, and conscience collide in fatal consequence.\n\nCast and Crew:\n• Director: Peter Godfrey\n• Producer: Peter Godfrey\n• Screenplay: Donald Hyde\n• Cinematography: Gordon Avil\n• Music: Arthur Lange\nStarring:\n• Raymond Burr as Craig Carlson\n• Angela Lansbury as Myra Leeds\n• Dick Foran as Joe Leeds\n• John Dehner as Lieutenant Reynolds\n• Lamont Johnson as Carl Holt\n• Les Tremayne as Ray Willis\n• Ann Staunton as Susan Willis\n\nFilm Significance:\nPlease Murder Me! exemplifies the transitional period between the classic 1940s noir and the more psychological dramas of the 1950s. Its courtroom confession framework foreshadows narrative styles later seen in legal thrillers of the 1960s and 1970s. Raymond Burr delivers a powerful performance just one year before achieving fame as Perry Mason, while Angela Lansbury reveals her mastery of complex, morally ambiguous characters — years before her iconic role in Murder, She Wrote.\n\nThe film’s moral and emotional depth, combined with its noir cinematography and fatalistic tone, make it one of the most intellectually engaging B-noirs of its time. Through digital restoration and colorization, Colorized Public Domain gives new clarity to its shadowy interiors, dramatic courtroom sequences, and expressive close-ups, creating a rich cinematic experience for contemporary audiences.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Please Murder Me! remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1956 version was filmed in stark black and white, emphasizing moral ambiguity through light and shadow — a hallmark of the noir genre. While visually compelling, the lack of color limits accessibility for modern audiences accustomed to richer visuals. This restored colorized edition bridges the gap between historical authenticity and contemporary appeal, allowing audiences to experience the performances of Angela Lansbury and Raymond Burr with renewed emotional clarity and visual intensity. The colorization highlights courtroom drama details, facial expressions, and mid-century design elements previously lost in monochrome presentation.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#PleaseMurderMe #AngelaLansbury #RaymondBurr #FilmNoir #PublicDomainMovie #ColorizedClassic #1950sDrama #CourtroomThriller #ClassicCinema #CrimeFilm #GoldenAgeHollywood #CultCinema #FilmRestoration #1956Movies #PsychologicalNoir",
      "id": "Y4jaS6r2ZA0",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/please-murder-me-1956",
      "title": "Please Murder Me! (1956)",
      "description": "A lawyer tries to exact justice on a woman he defended in court -- a woman whom he found out was guilty after getting her off. Watch on RetroFlix:  https://retroflix.org/please-murder-me-1956/",
      "id": "please-murder-me-1956"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/please_murder_me_ipod",
      "title": "Please Murder Me",
      "description": "A lawyer wins an a acquittal for his client, a woman accused of murder. After the verdict, he finds out that she indeed did commit the murder and manipulated him to win her acquittal.",
      "id": "please_murder_me_ipod"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3KD7IIsKzXw",
      "title": "Please Murder Me (1956) ANGELA LANSBURY",
      "description": "Stars: Angela Lansbury, Raymond Burr\nDirector: Peter Godfrey\n\nA sultry femme fatale accused of killing her husband tricks a love-smitten attorney into acquitting her. But when the lawyer learns he's been duped, he sets an ingenious trap to bring the murderess to justice",
      "id": "3KD7IIsKzXw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1956-please-murder-me-peter-godfrey-vose",
      "title": "1956 - Please Murder Me! - Peter Godfrey - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "id": "1956-please-murder-me-peter-godfrey-vose"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "78 min",
    "imdbRating": "6.5",
    "imdbVotes": "1,693",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "A lawyer wins an acquittal for his client, a woman accused of murder. After the verdict, he finds out that she indeed did commit the murder and manipulated him to win her acquittal. Guilt-ridden, and knowing that she can't be tried again for the murder, he devises a plan to bring her to justice.",
    "Director": "Peter Godfrey",
    "Writer": "Al C. Ward, Donald Hyde, Ewald André Dupont",
    "Actors": "Angela Lansbury, Raymond Burr, Dick Foran",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0050271",
      "title": "Crime of Passion",
      "year": 1956,
      "imdbRating": "6.4",
      "imdbVotes": "3,102",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051605",
      "title": "The Fearmakers",
      "year": 1958,
      "imdbRating": "6.2",
      "imdbVotes": "869",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049340",
      "title": "The Houston Story",
      "year": 1956,
      "imdbRating": "6.1",
      "imdbVotes": "448",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049406",
      "title": "The Killing",
      "year": 1956,
      "imdbRating": "7.9",
      "imdbVotes": "102,237",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049904",
      "title": "The Unguarded Moment",
      "year": 1956,
      "imdbRating": "6.3",
      "imdbVotes": "528",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049955",
      "title": "The Wild Party",
      "year": 1956,
      "imdbRating": "5.8",
      "imdbVotes": "302",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049769",
      "title": "Slightly Scarlet",
      "year": 1956,
      "imdbRating": "6.5",
      "imdbVotes": "1,315",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049636",
      "title": "The Price of Fear",
      "year": 1956,
      "imdbRating": "6.3",
      "imdbVotes": "726",
      "language": "English, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050087",
      "title": "5 Steps to Danger",
      "year": 1956,
      "imdbRating": "6.3",
      "imdbVotes": "1,183",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049718",
      "title": "The Scarlet Hour",
      "year": 1956,
      "imdbRating": "6.9",
      "imdbVotes": "778",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049922",
      "title": "The Violent Years",
      "year": 1956,
      "imdbRating": "3.6",
      "imdbVotes": "1,928",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049932",
      "title": "Walk the Dark Street",
      "year": 1956,
      "imdbRating": "4.6",
      "imdbVotes": "280",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T17:44:59.818Z"
}