{
  "imdbId": "tt0031680",
  "title": "Mr. Wong in Chinatown",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mr_Wong_in_Chinatown",
      "id": "Mr_Wong_in_Chinatown",
      "title": "Mr. Wong in Chinatown",
      "description": "From IMDb : A pretty Chinese woman, seeking help from San Francisco detective James Lee Wong, is killed by a poisoned dart in his front hall, having time only to scrawl \"Captain J\" on a sheet of paper. She proves to be Princess Lin Hwa, on a secret military mission for Chinese forces fighting the Japanese invasion. Mr. Wong finds two captains with the intial J in the case, neither being quite what he seems; there's fog on the waterfront and someone still has that poison-dart gun... Stars: Boris Karloff, Marjorie Reynolds and Grant Withers The Mr. Wong series of films Mr. Wong, Detective The Mystery of Mr. Wong Mr. Wong in Chinatown The Fatal Hour Doomed to Die Phantom of Chinatown",
      "fileSize": 1484500192,
      "addedAt": "2026-01-07T00:06:38.753Z",
      "thumbnail": "https://archive.org/services/img/Mr_Wong_in_Chinatown",
      "language": "English",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 88140
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mr.-wong-in-chinatown-1939_202507",
      "id": "mr.-wong-in-chinatown-1939_202507",
      "title": "Mr. Wong in Chinatown (1939)",
      "description": "A pretty Chinese woman, seeking help from San Francisco detective James Lee Wong, is killed by a poisoned dart in his front hall, having time only to scrawl \"Captain J\" on a sheet of paper. She proves to be Princess Lin Hwa, on a secret military mission for Chinese forces fighting the Japanese invasion. Mr. Wong finds two captains with the intial J in the case, neither being quite what he seems; there's fog on the waterfront and someone still has that poison-dart gun... Watch on RetroFlix:  https://retroflix.org/mr-wong-in-chinatown-1939/",
      "fileSize": 775417618,
      "addedAt": "2026-01-07T00:09:54.331Z",
      "thumbnail": "https://archive.org/services/img/mr.-wong-in-chinatown-1939_202507",
      "language": "eng",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 76
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ca8O8LktYiQ",
      "id": "ca8O8LktYiQ",
      "title": "Mr. Wong in Chinatown (1939) [Crime] [Mystery]",
      "description": "Mr. Wong in Chinatown is a 1939 American mystery film directed by William Nigh and starring Boris Karloff. The story is about a pretty Chinese woman, seeking help from San Francisco detective James Lee Wong, who is killed by a poisoned dart in his front hall, having time only to scrawl the name \"Captain J\" on a sheet of paper.\n\n---\n\nDirected by William Nigh, produced by William T. Lackey, written by Hugh Wiley and Scott Darling, starring Boris Karloff as Mr. James Lee Wong, Marjorie Reynolds as Roberta 'Bobbie' Logan (reporter), Grant Withers as Police Capt. Bill Street, Huntley Gordon as Mr. Davidson (bank president), George Lynn as Capt. Guy Jackson (Aviation Corp. president) as Peter George Lynn, William Royle as Capt. Jaime (captain, Maid of the Orient), James Flavin as Police Sgt. Jerry, Lotus Long as Princess Lin Hwa (murder victim), Lee Tung Foo as Willie (Wong's servant), Bessie Loo as Lilly May (Princess Lin Hwa's maid), Richard Loo as Tong chief, Ernie Stanton as Burton (Davidson's butler) and I. Stanford Jolley as Hotel clerk. \n\n---\n\nSource: \"Mr. Wong in Chinatown\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 5 April 2013. Web. 7 April 2013. http://en.wikipedia.org/wiki/Mr._Wong_in_Chinatown.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:33.303Z",
      "thumbnail": "https://i.ytimg.com/vi/ca8O8LktYiQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDOPONZmRm0Qe75T5eXJQw4MGKekg",
      "duration": 4234,
      "language": "en",
      "year": 1939,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=n5ZkYxlcPV0",
      "id": "n5ZkYxlcPV0",
      "title": "Mr. Wong in Chinatown (1939) BORIS KARLOFF",
      "description": "Stars: Boris Karloff, Marjorie Reynolds, Grant Withers\nDirector: William Nigh\n\nA pretty Chinese woman, seeking help from San Francisco detective James Lee Wong, is killed by a poisoned dart in his front hall, having time only to scrawl \"Captain J\" on a sheet of paper. She proves to be Princess Lin Hwa, on a secret military mission for Chinese forces fighting the Japanese invasion. Mr. Wong finds two captains with the initial J in the case, neither being quite what he seems; there's fog on the waterfront and someone still has that poison-dart gun.",
      "addedAt": "2025-12-26T23:57:06.263Z",
      "thumbnail": "https://i.ytimg.com/vi/n5ZkYxlcPV0/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB9ASAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDkD_jlYWDvvTrB8gFp-rGJZBHZIg",
      "duration": 4234,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vmMeIbCc_eQ",
      "id": "vmMeIbCc_eQ",
      "title": "Mr. Wong in Chinatown (1939) Boris Karloff | Adventure, Crime, Mystery Movie",
      "description": "A pretty Chinese woman, seeking help from San Francisco detective James Lee Wong, is killed by a poisoned dart in his front hall, having time only to scrawl \"Captain J\" on a sheet of paper. She proves to be Princess Lin Hwa, on a secret military mission for Chinese forces fighting the Japanese invasion.\n\nDirector: William Nigh\nWriters: Scott Darling, Hugh Wiley \nStars: Boris Karloff, Marjorie Reynolds, Grant Withers \nGenres: Adventure | Crime | Drama | Mystery\n\nJoin us on social media : \nhttps://www.facebook.com/CultCinemaClassics\nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:51:41.881Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/vmMeIbCc_eQ/maxresdefault.webp?v=63375872",
      "duration": 4234,
      "language": "en",
      "year": 1939,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 5.8,
    "imdbVotes": 975,
    "Genre": "Adventure, Crime, Drama",
    "Plot": "A pretty Chinese woman, seeking help from San Francisco detective James Lee Wong, is killed by a poisoned dart in his front hall, having time only to scrawl \"Captain J\" on a sheet of paper. She proves to be Princess Lin Hwa, on a secret military mission for Chinese forces fighting the Japanese invasion. Mr. Wong finds two captains with the intial J in the case, neither being quite what he seems; there's fog on the waterfront and someone still has that poison-dart gun...",
    "Director": "William Nigh",
    "Writer": "Scott Darling, Hugh Wiley",
    "Actors": "Boris Karloff, Marjorie Reynolds, Grant Withers",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0030473",
    "tt0032404",
    "tt0031987",
    "tt0032457",
    "tt0034164",
    "tt0031690",
    "tt0030253",
    "tt0029941",
    "tt0031505",
    "tt0030037",
    "tt0030322",
    "tt0030763"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.331Z"
}