{
  "movieId": "tt0066344",
  "title": "Scrooge",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/5552442",
      "id": "5552442",
      "title": "Scrooge",
      "description": "Title: Scrooge Summary: A musical retelling of Charles Dickens ' classic novel about an old bitter miser taken on a journey of self-redemption, courtesy of several mysterious Christmas apparitions. Directed by: Ronald Neame Ronald Neame Actors: Albert Finney, Alec Guinness, Edith Evans Production Company: Cinema Center Films Release Date: 1 December 1970 (UK) Aspect Ratio: 2.35 : 1 Color: Color In 1860, cranky old miser Ebenezer Scrooge hates Christmas, loathes people, and defends the decrease of the surplus of poor population, runs his bank exploiting his employee Bob Cratchit and clients, giving a bitter treatment to his own nephew and acquaintances. However, on Christmas Eve, he is visited by the doomed ghost of his former partner, Jacob Marley, who tells him that three spirits would visit him that night. The first one, the spirit of Christmas Past, recalls his miserable youth when he lost his only love due to his greed, the spirit of Christmas Present shows him the poor situation of Bob's family, and how joyful life may be and the spirit of Christmas Yet To Come shows his fate. Scrooge finds that life is good, and time is too short, and suddenly you are not there anymore, changing his behavior toward Christmas, Bob, his nephew, and people in general.",
      "fileSize": 1633786640,
      "addedAt": "2026-01-07T00:06:09.631Z",
      "thumbnail": "https://archive.org/services/img/5552442",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 7335
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "113 min",
    "imdbRating": 7.5,
    "imdbVotes": 13318,
    "Genre": "Drama, Family, Fantasy",
    "Plot": "In 1860, cranky old miser Ebenezer Scrooge hates Christmas, loathes people, and defends the decrease of the surplus of poor population, runs his bank exploiting his employee Bob Cratchit and clients, giving a bitter treatment to his own nephew and acquaintances. However, on Christmas Eve, he is visited by the doomed ghost of his former partner, Jacob Marley, who tells him that three spirits would visit him that night. The first one, the spirit of Christmas Past, recalls his miserable youth when he lost his only love due to his greed, the spirit of Christmas Present shows him the poor situation of Bob's family, and how joyful life may be and the spirit of Christmas Yet To Come shows his fate. Scrooge finds that life is good, and time is too short, and suddenly you are not there anymore, changing his behavior toward Christmas, Bob, his nephew, and people in general.",
    "Director": "Ronald Neame",
    "Writer": "Charles Dickens, Leslie Bricusse",
    "Actors": "Albert Finney, Alec Guinness, Edith Evans",
    "Language": "English",
    "Country": "United Kingdom, United States",
    "Awards": "Nominated for 4 Oscars. 1 win & 10 nominations total"
  },
  "relatedMovies": [
    "tt0069113",
    "tt0026972",
    "tt0013688",
    "tt0066181",
    "tt0017033",
    "tt10399114",
    "tt0772176",
    "tt1646876",
    "tt0066328",
    "tt0065854",
    "tt0065023",
    "tt0064595"
  ],
  "collections": [
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.631Z"
}