{
  "movieId": "tt0029626",
  "title": "Swing High, Swing Low",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UvGuuq9BMuY",
      "id": "UvGuuq9BMuY",
      "title": "Swing High, Swing Low (1937) | Colorized Public Domain Romance | Carole Lombard and Fred MacMurray",
      "description": "Swing High, Swing Low (1937) is an American romantic drama with musical elements, directed by Mitchell Leisen and produced by Paramount Pictures during Hollywood’s Golden Age. This colorized and restored edition revives a heartfelt story of love, ambition, and sacrifice, starring two of the era’s brightest icons, Carole Lombard and Fred MacMurray. Originally released in black and white, the film survives today primarily in the public domain, and this edition brings its glamour and emotional depth back to life for modern audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe film follows the story of Maggie King (Carole Lombard), a young woman traveling through Panama who meets Skid Johnson (Fred MacMurray), a brash but talented trumpet player. Their chance encounter blossoms into romance, and Maggie sacrifices her own career ambitions to support Skid’s rise as a musician. Together, they find success when Skid is offered the opportunity to perform in New York City, where fame seems within reach. However, their relationship faces strain as jealousy, temptation, and Skid’s reckless behavior threaten to tear them apart.\n\nAt its core, Swing High, Swing Low is a poignant exploration of love tested by ambition, the fragility of trust, and the painful realities of following dreams in the harsh world of show business. Its blend of music, romance, and drama reflects the era’s fascination with stories that combined glamour with human vulnerability.\n\nCast and Crew:\n• Director: Mitchell Leisen\n• Producers: William LeBaron\n• Screenplay: Virginia Van Upp, Oscar Hammerstein II\n• Based on: the play \"Burlesque\" by Arthur Hopkins and George Manker Watters\n• Cinematography: Ted Tetzlaff\n• Editing: Eda Warren\n\nStarring:\n• Carole Lombard as Maggie King\n• Fred MacMurray as Skid Johnson\n• Charles Butterworth as Harry\n• Jean Dixon as Ella\n• Harvey Stephens as Harvey Howell\n• Dorothy Lamour as Anita Alvarez\n\nFilm Significance:\nSwing High, Swing Low is remembered as one of the most emotionally powerful films in Carole Lombard’s career. Lombard, one of Hollywood’s most beloved stars of the 1930s, is best known for her screwball comedies, but here she demonstrates her dramatic range in a heartbreaking performance. Fred MacMurray, who later became a household name through films like Double Indemnity (1944) and Disney’s The Shaggy Dog (1959), gives one of his early standout roles as the flawed but talented musician.\nThe film also represents Mitchell Leisen’s strength as a director of romance and melodrama, building atmosphere and emotional authenticity. Its partial musical elements, combined with a character-driven romance, positioned it as a standout among 1930s dramas. The surviving prints fell into the public domain, giving the film a second life among classic film enthusiasts, and its preservation in colorized form helps ensure new audiences rediscover its poignant love story.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Swing High, Swing Low remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1937 release was black and white, typical for its time. While historically authentic, modern audiences often pass over black-and-white films, leaving gems like Swing High, Swing Low underappreciated. By offering a colorized edition, we highlight its glamour, emotional storytelling, and vibrant performances in a way that resonates with today’s viewers while still respecting its Golden Age roots.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#SwingHighSwingLow #CaroleLombard #FredMacMurray #1930sRomance #PublicDomainMovie #ColorizedClassic #ClassicCinema #GoldenAgeHollywood #RomanticDrama #FilmRestoration #1937Movies",
      "addedAt": "2025-12-24T00:49:43.354Z",
      "thumbnail": "https://i.ytimg.com/vi/UvGuuq9BMuY/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYciBQKDQwDw==&rs=AOn4CLCTC9r3JvbNhnP5kk4yLynje3_jrQ",
      "duration": 4855,
      "language": "en",
      "year": 1937,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/shsl0096766",
      "id": "shsl0096766",
      "title": "Swing High, Swing Low",
      "description": "Title: Swing High, Swing Low Summary: A singer stranded in Panama moves in with an ex-soldier and his hypochondriac roommate; she and the former fall in love, but their romance is threatened by work and the arrival of an old flame. Directed by: Mitchell Leisen Actors: Carole Lombard, Fred MacMurray, Charles Butterworth Production Company: Paramount Pictures Release Date: 12 March 1937 (USA) Aspect Ratio: 1.37 : 1 In Panama, Maggie King meets soldier Skid Johnson on his last day in the army and reluctantly agrees to a date to celebrate. The two become involved in a nightclub brawl which causes Maggie to miss her ship back to the States. Now stranded, she's forced to move in with Skid and his pal Harry. She soon falls in love with Skid. Skid gets a job playing the trumpet at a local club and becomes a big success. Fame and fortune go to his head which eventually destroys his relationship Maggie and his career.",
      "fileSize": 711692017,
      "addedAt": "2026-01-07T00:10:50.366Z",
      "thumbnail": "https://archive.org/services/img/shsl0096766",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 2432
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/swing-high-swing-low-4-k",
      "id": "swing-high-swing-low-4-k",
      "title": "Swing High, Swing Low (1937) [Colorized, 4K, 60FPS]",
      "description": "Swing High, Swing Low is a 1937 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6910758754,
      "addedAt": "2026-01-07T00:11:46.526Z",
      "thumbnail": "https://archive.org/services/img/swing-high-swing-low-4-k",
      "collection": "feature_films",
      "downloads": 330
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/swinghi_swinglo",
      "id": "swinghi_swinglo",
      "title": "Swing High, Swing Low",
      "description": "Taken from IMDB : In Panama, Maggie King meets soldier Skid Johnson on his last day in the army and reluctantly agrees to a date to celebrate. The two become involved in a nightclub brawl which causes Maggie to miss her ship back to the States. Now stranded, she's forced to move in with Skid and his pal Harry. She soon falls in love with Skid. Skid gets a job playing the trumpet at a local club and becomes a big success. Fame and fortune go to his head which eventually destroys his relationship Maggie and his career.",
      "fileSize": 4058182302,
      "addedAt": "2026-01-07T00:11:46.526Z",
      "thumbnail": "https://archive.org/services/img/swinghi_swinglo",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 79336
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=krSkukBYs1E",
      "id": "krSkukBYs1E",
      "title": "Swing High, Swing Low (1937) CAROLE LOMBARD",
      "description": "Movie Class by PizzaFLIX: a remake of THE DANCE OF LIFE (1929), SWING HIGH, SWING LOW, became Paramount’s most profitable film of 1937. When 20th Century-Fox purchased the film rights for another version in 1948, Paramount sent them the original 35mm negative which was not returned and is now considered lost.\n\nStars: Carole Lombard, Fred MacMurray, Dorothy Lamour\nDirector: Mitchell Leisen\n\nA beautiful passenger on a cruise ship passing through the Panama Canal flirts with a soldier on his last patrol. She’s a singer, he’s a brilliant trumpet player. They make beautiful music together and tie the knot. But can their love withstand the persistent attentions of a former flame? Watch for a young  Anthony Quinn.",
      "addedAt": "2025-12-26T23:43:15.250Z",
      "thumbnail": "https://i.ytimg.com/vi/krSkukBYs1E/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLABRfnbrEH2OqUaELGoQoOTkxxowA",
      "duration": 5803,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9ExY3Yqa600",
      "id": "9ExY3Yqa600",
      "title": "Swing High, Swing Low (1937) Carole Lombard | Romantic Comedy Musical | Full Length Movie",
      "description": "DON'T MIND THEM...THEY'RE IN LOVE! \nA singer stranded in Panama moves in with an ex-soldier and his hypochondriac roommate; she and the former fall in love, but their romance is threatened by work and the arrival of an old flame.\n\nDirector: Mitchell Leisen\nWriters: Virginia Van Upp, Oscar Hammerstein II \nStars: Carole Lombard, Fred MacMurray, Charles Butterworth\nGenres: Classics, Comedy, Drama, Musical, Romance\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:45:30.867Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/9ExY3Yqa600/maxresdefault.webp?v=61d5a796",
      "duration": 4947,
      "language": "en",
      "year": 1937,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "92 min",
    "imdbRating": 6.1,
    "imdbVotes": 926,
    "Genre": "Comedy, Drama, Musical",
    "Plot": "In Panama, Maggie King meets soldier Skid Johnson on his last day in the army and reluctantly agrees to a date to celebrate. The two become involved in a nightclub brawl which causes Maggie to miss her ship back to the States. Now stranded, she's forced to move in with Skid and his pal Harry. She soon falls in love with Skid. Skid gets a job playing the trumpet at a local club and becomes a big success, but fame and fortune go to his head and threaten to destroy their relationship and his career.",
    "Director": "Mitchell Leisen",
    "Writer": "Virginia Van Upp, Oscar Hammerstein II, George Manker Watters",
    "Actors": "Carole Lombard, Fred MacMurray, Charles Butterworth",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029885",
    "tt0034961",
    "tt0028359",
    "tt0030089",
    "tt0027347",
    "tt0029322",
    "tt0028816",
    "tt0032410",
    "tt0032847",
    "tt0028010",
    "tt0023845",
    "tt0024083"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.526Z"
}