{
  "movieId": "tt0062038",
  "title": "The Night of the Generals",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-night-of-the-generals-1967",
      "id": "the-night-of-the-generals-1967",
      "title": "The Night of the Generals (1967)",
      "description": "The Night of the Generals is a war drama-mystery film set during World War II, specifically in Nazi-occupied Europe. The film intertwines a murder mystery with the historical backdrop of the war. ",
      "fileSize": 2216332372,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-night-of-the-generals-1967",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 298
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "148 min",
    "imdbRating": 7.2,
    "imdbVotes": 9237,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "In 1942 Warsaw, a Polish prostitute is murdered in a sadistic way. Major Grau (Omar Sharif), an Agent from German Intelligence who believes in justice, is in charge of the investigation. An eyewitness saw a German General leaving the building after a scream of the victim. A further investigation shows that three Generals do not have any alibi for that night: General Tanz (Peter O'Toole), Major General Klaus Kahlenberge (Donald Pleasence), and General von Seidlitz-Gabler (Charles Gray). The three avoid direct contact with Major Grau and become potential suspects. As Major Grau gets close to them, he is promoted and sent to Paris. In 1944 Paris, this quartet is reunited, and Major Grau continues his investigation. Meanwhile, a plan for killing Adolf Hitler is plotted by his high command, a romance between Ulrike von Seidlitz-Gabler (Joanna Pettet) and Lance Corporal Kurt Hartmann (Sir Tom Courtenay) is happening and Inspector Morand (Philippe Noiret) is helping Major Grau in his investigation. The story ends in 1965, in Hamburg, with another, similar crime.",
    "Director": "Anatole Litvak",
    "Writer": "Joseph Kessel, Paul Dehn, Hans Hellmut Kirst",
    "Actors": "Peter O'Toole, Omar Sharif, Tom Courtenay",
    "Language": "English, Italian, Spanish, French, German",
    "Country": "United Kingdom, France",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0064448",
    "tt0065179",
    "tt0059909",
    "tt0248088",
    "tt0029864",
    "tt0040823",
    "tt0040806",
    "tt0058329",
    "tt0283610",
    "tt0058649",
    "tt0067835",
    "tt0067045"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}