{
  "imdbId": "tt0028512",
  "title": "Without Orders",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/without-orders-1936",
      "title": "Without Orders (1936)",
      "description": "Sally Eilers, Robert Armstrong",
      "id": "without-orders-1936"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "64 min",
    "imdbRating": "6.3",
    "imdbVotes": "77",
    "Genre": "Drama",
    "Plot": "Len Kendrick, whose father J. P. owns Amalgamated Air Lines, breaks a cross-country flying record and is cheered by a crowd of fans as he lands at the airline's Portland, Oregon airport. In the crowd are Kay Armstrong, an Amalgamated stewardess who is dating Wad Madison, a veteran pilot, and her sister Penny. Although the playboy Len prefers Kay, he goes out with Penny, who eventually follows him to New York on the pretext of furthering her show business career. While Kay grows frustrated by Wad's fanatical dedication to flying, Penny is dismayed by Len's heavy drinking. In spite of Penny's warnings, Len violates an aviation rule that stipulates that pilots should not fly within twenty-four hours of imbibing alcohol and makes a flight after a night of drinking. During the trip, Len experiences mechanical trouble but bails out just before the airplane crashes. His co-pilot, however, is killed. After bribing a bartender, Len is cleared of suspicion in the crash but is rejected by Penny. Broke, Len returns to Portland to fly for his father, who convinces Wad to abandon his plans to marry Kay and tutor Len. Oblivious to Wad, Len begins to romance Kay, who is impressed by the younger pilot's easy charm. When a jealous Wad finds Len drunk at Kay's apartment, he criticizes Kay for encouraging Len's bad habits. Resentful of Wad's possessiveness, Kay snubs him and, during a flying lesson, rejects his marriage proposal. Kay then writes to Penny, asking her advice about marrying Len, unaware of her sister's previous involvement with him. Concerned, Penny flies to Portland and meets secretly with Len to ask him to end his affair with Kay or have his crimes exposed. When he refuses to comply, Penny starts to telephone Kay, but is slugged by Len and fractures her skull on his mantle-piece. Leaving Penny unconscious, Len rushes to his next flight to Salt Lake City and asks Kay to marry him as soon as they land. By the time they reach Salt Lake City, however, Kay receives word that Penny is in the hospital and demands that they take Wad's flight back to Portland. When the airplane experiences engine trouble, Wad prepares to make an emergency landing, but Len locks him out of the cockpit and flies the craft to Portland. Accused publicly by Len of cowardice, Wad punches his rival and is fired by Kendrick. Wad then visits Penny, who is recuperating from surgery, and learns the truth about Len. Terrified, Wad dashes to the airport, where he hears that Len and Penny's flight to Salt Lake City has been trapped in a blizzard for hours. Eventually Wad connects with Len via radio and orders him to land, but Len, who has knocked out his co-pilot, chooses to jump rather than face a possible crash. After Len's parachute fails to open, Kay takes over the controls and, by following Wad's instructions, makes a safe emergency landing. Hailed as heroes, Kay and Wad, who has been re-hired by Kendrick, embrace.",
    "Director": "Lew Landers",
    "Writer": "J. Robert Bren, Edmund L. Hartmann, Peter B. Kyne",
    "Actors": "Sally Eilers, Robert Armstrong, Frances Sage",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0030353",
      "title": "Law of the Underworld",
      "year": 1938,
      "imdbRating": "5.4",
      "imdbVotes": "224",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031177",
      "title": "Conspiracy",
      "year": 1939,
      "imdbRating": "5.6",
      "imdbVotes": "198",
      "language": "English, Esperanto",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032527",
      "title": "Girl from Havana",
      "year": 1940,
      "imdbRating": "5.7",
      "imdbVotes": "29",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038418",
      "title": "A Close Call for Boston Blackie",
      "year": 1946,
      "imdbRating": "6.0",
      "imdbVotes": "409",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040078",
      "title": "Adventures of Gallant Bess",
      "year": 1948,
      "imdbRating": "5.2",
      "imdbVotes": "125",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037622",
      "title": "Crime, Inc.",
      "year": 1945,
      "imdbRating": "5.4",
      "imdbVotes": "195",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042383",
      "title": "Davy Crockett, Indian Scout",
      "year": 1950,
      "imdbRating": "5.4",
      "imdbVotes": "376",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041100",
      "title": "Air Hostess",
      "year": 1949,
      "imdbRating": "5.4",
      "imdbVotes": "59",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044371",
      "title": "Arctic Flight",
      "year": 1952,
      "imdbRating": "5.4",
      "imdbVotes": "162",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034572",
      "title": "Canal Zone",
      "year": 1942,
      "imdbRating": "6.0",
      "imdbVotes": "49",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027498",
      "title": "Dangerous Waters",
      "year": 1936,
      "imdbRating": "6.4",
      "imdbVotes": "41",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046036",
      "title": "Man in the Dark",
      "year": 1953,
      "imdbRating": "6.2",
      "imdbVotes": "830",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:07:04.309Z"
}