{
  "imdbId": "tt0010552",
  "title": "Pay Your Dues",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pay-your-dues-1919-directed-by-vincent-bryan-hal-roach",
      "id": "pay-your-dues-1919-directed-by-vincent-bryan-hal-roach",
      "title": "Pay Your Dues (1919) Directed By Vincent Bryan, Hal Roach",
      "description": "Pay Your Dues Directed by Vincent P. Bryan Hal Roach Written by H. M. Walker Produced by Hal Roach Starring Harold Lloyd Cinematography Walter Lundin Release date October 12, 1919 Running time 12 minutes Country United States Languages Silent English intertitles Pay Your Dues is a 1919 American short comedy film featuring Harold Lloyd . Plot A chapter of the Ancient Order of Simps lodge is initiating three new members who each must undergo a rough hazing. All three candidates are blindfolded. Just before the third man is supposed to go through his initiation ritual, he takes advantage of his guard (Snub Pollard) dozing off. He lifts his blindfold and, through a keyhole of a locked door, observes the second candidate, a tiny man, being thoroughly abused. Unwilling to endure such an ordeal, the third man decides to escape through a window. Still wearing a blindfold, he is hotly pursued by the lodge's members. The fleeing man runs through a park where The Boy (Harold Lloyd) has been enjoying the female company of Bebe and about a dozen of her friends. When the man encounters The Boy, by a remarkable coincidence, The Boy is also blindfolded as part of a game. The pursuing lodge members mistake The Boy for the escaped candidate and forcibly haul him back to the lodge for \"his\" initiation rites. With the aid of trickery, The Boy, blindfolded, is made to think he is climbing a tall building, walking on a ledge, and being attacked by a vicious dog. Bebe and her friends attempt to rescue The Boy, but by the time they arrive at the lodge and overpower Snub, The Boy has successfully endured his initiation ordeal and happily joins the Ancient Order of Simps. Cast Harold Lloyd as The Boy Snub Pollard Bebe Daniels Sammy Brooks Lige Conley (as Lige Cromley) Frank Daniels William Gillespie Charles Inslee Mark Jones Dee Lampton Gus Leonard Earl Mohan Marie Mosquini Fred C. Newmeyer (as Fred C. Newmeyer) H.L. O'Connor Robert Emmett O'Connor Charles Stevenson (as Charles E. Stevenson) Chase Thorne Noah Young",
      "fileSize": 171870862,
      "addedAt": "2026-01-07T00:10:12.697Z",
      "thumbnail": "https://archive.org/services/img/pay-your-dues-1919-directed-by-vincent-bryan-hal-roach",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 68
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "12 min",
    "imdbRating": 6.3,
    "imdbVotes": 94,
    "Genre": "Comedy, Short",
    "Plot": "While blindfolded and playing pin the tail on the donkey with some lady friends, our hero is mistaken for an escaped initiate of a kooky fraternal order. He is abducted and initiated into the order, the process involving various hilarious indignities.",
    "Director": "Vincent Bryan, Hal Roach",
    "Writer": "H.M. Walker",
    "Actors": "Harold Lloyd, 'Snub' Pollard, Bebe Daniels",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010311",
    "tt0010656",
    "tt0010321",
    "tt0009887",
    "tt0008860",
    "tt0009932",
    "tt0009973",
    "tt0009986",
    "tt0010006",
    "tt0010023",
    "tt0010181",
    "tt0010279"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.697Z"
}