{
  "imdbId": "tt0009973",
  "title": "Bumping Into Broadway",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bumping-into-broadway-1919-directed-by-hal-roach",
      "title": "Bumping Into Broadway (1919) Directed By Hal Roach",
      "description": "Bumping into Broadway Directed by Hal Roach Written by Hal Roach (screenplay) Harold Lloyd (screenplay) H. M. Walker (titles) Produced by Hal Roach Starring Harold Lloyd Bebe Daniels Cinematography Walter Lundin Distributed by Pathé Exchange Release date November 2, 1919 Running time 23 minutes Country United States Language Silent (English intertitles ) Box office $113,426 [ 1 ] [ 2 ] Bumping into Broadway is a 1919 American short comedy film featuring Harold Lloyd . A print of the film survives in the film archive of the UCLA Film and Television Archive . [ 3 ] This film is notable as Lloyd's first two-reeler featuring his \"glasses\" character. [ 4 ] [ 5 ] Plot The film opens with a quick glimpse into the glamorous life of Broadway and the hubris often associated with its players. The film then shifts to the story of \"The Girl\" and \"The Boy,\" she an aspiring actress and he an unpublished playwright. They are both humble artists struggling to make it big, and each are behind in their rent at a boarding house run by a stern landlady and a large, thuggish \"bouncer.\" Having romantic feelings for the girl, the boy gives her all of his money so she can pay the back rent. Now penniless, the boy must find different ways to elude the landlady and bouncer. He finally escapes the menacing duo by hopping into a moving car. Later, the eager playwright sneaks into the theater where the girl works a chorus girl to try and sell his play to the manager. He is unsuccessful, and after being kicked out of the manager's office, he's physically thrown into the street. Meanwhile, the girl has been fired from the show, and as a consolation, accepts an offer from the handsome \"Stage-door Johnnie\" to accompany him to a posh nightclub. The couple, followed by the boy, arrive at the Sky Limit Club, an underground gambling establishment. While searching for the girl inside the club, the boy accidentally starts winning at roulette when he unwittingly places some found money on the table. Just as he bankrupts the casino, the place is raided by the police. After a series of chases and clever maneuvers, the boy is able to evade the police and is reunited with the girl. The film ends with the two engaged in a romantic kiss. [ 2 ] [ 6 ] Cast Harold Lloyd as The Boy Bebe Daniels as The Girl Snub Pollard as Stage Manager Roy Brooks (uncredited) Sammy Brooks (uncredited) William Gillespie as Stage Door Johnnie (uncredited) Helen Gilmore as Landlady (uncredited) Mark Jones as Evicted Boarder (uncredited) Dee Lampton (uncredited) Gus Leonard as Desperate Woman (uncredited) Gaylord Lloyd (uncredited) Fred C. Newmeyer (uncredited) Charles Stevenson (uncredited) Noah Young as Bouncer (uncredited) Background Bumping into Broadway was the first of a nine two-reel picture deal Harold Lloyd made with Pathé Exchange in April 1919. And even though Pathé was eager to release his first two-reel comedy featuring the \"glasses\" character, the company wanted to release all of the remaining one-reelers first. [ 7 ] When the film was finally released in November 1919, it was met with great fanfare, partially due to the recent publicity surrounding its star after a prop bomb exploded during a photo shoot , damaging his eyes and severing his right thumb and forefinger. [ 8 ] Miraculously, Lloyd managed to fully regain his eyesight and was able to attend the premiere of Bumping into Broadway in New York City. In the end, the picture not only received great reviews, it broke several house records in theaters across the country, solidifying Lloyd's place as a top-billing comedy star. [ 9 ] [ 10 ] [ 11 ] Music In 2015, the Dallas Chamber Symphony commissioned an original film score for Bumping Into Broadway from composer Rolfe Kent . The score premiered live to film in concert on February 18, 2015 at Moody Performance Hall with Richard McKay conducting. [ 12 ] See also List of American films of 1919 Harold Lloyd filmography References 1 Ward, Richard Lewis (August 15, 2006). A History of the Hal Roach Studios . SIU Press. p. 206. ISBN   9780809388066 . Retrieved January 28, 2017 . 2 Reid, John Howard (2007). Hollywood's Classic Comedies Featuring Slapstick, Romance, Music, Glamour Or Screwball Fun! . Lulu.com. pp.  39– 40. ISBN   9781430314875 . Retrieved January 28, 2017 . 3 \"Progressive Silent Film List: Bumping Into Broadway\" . Silent Era . Retrieved August 14, 2008 . 4 Janiss Garza. \"Bumping Into Broadway\" . Movies & TV Dept. The New York Times . Baseline & All Movie Guide . Archived from the original on January 30, 2013 . Retrieved May 2, 2012 . 5 D'Agostino, Annette M. (1994). Harold Lloyd : a bio-bibliography . Westport, Conn. [u.a.]: Greenwood Press. p. 141. ISBN   0313289867 . Retrieved January 28, 2017 . 6 Ward, Richard Lewis (August 15, 2006). A History of the Hal Roach Studios . SIU Press. p. 198. ISBN   9780809388066 . Retrieved January 28, 2017 . 7 Brownlow, Kevin (1976). The Parade's Gone By ... (Reprinted ed.). Berkeley: University of California Press. ISBN   0520030680 . Retrieved January 28, 2017 . 8 Denes, Melissa. \"The Double Life of Harold Lloyd\" . Telegraph.co.uk . Retrieved January 28, 2017 . 9 LeVoit, Violet. \"Captain Kidd's Kids (1919)\" . Turner Classic Movies . Retrieved January 28, 2017 . 10 Ward, Richard Lewis (August 15, 2006). A History of the Hal Roach Studios (1st ed.). SIU Press. p. 38. ISBN   9780809388066 . Retrieved January 28, 2017 . 11 D'Agostino, Annette M. (2004). The Harold Lloyd Encyclopedia . McFarland. p. 45. ISBN   9780786415144 . Retrieved January 28, 2017 . 12 Pritchard, Caroline. \"Dallas Chamber Symphony's Bumpin' Into Broadway Was as Charming as a Kitten\" . Dallas Observer . Retrieved December 9, 2024 .",
      "id": "bumping-into-broadway-1919-directed-by-hal-roach"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-bumping-into-broadway",
      "title": "Bumping Into Broadway",
      "id": "silent-bumping-into-broadway"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "25 min",
    "imdbRating": "6.9",
    "imdbVotes": "1,417",
    "Genre": "Comedy, Short",
    "Plot": "She's a chorus girl in unpaid tryouts for a Broadway show, behind in her rent, about to be evicted. He's in the room next door, from Peoria, struggling to write his first comedy; he's also behind in his rent. He gives her his last dollar so she can square with \"Bearcat,\" the landlady, then he has to avoid Bearcat and her bouncer. Later, he tries to get his comedy read by the production manager at the same theater where his neighbor's just been fired. She's desperate, so she agrees to lunch with a Lothario, who takes her to a speakeasy. Our comedy-writer follows them to the club where an accidental roulette bet, a police raid, and a hectic pursuit end the story.",
    "Director": "Hal Roach",
    "Writer": "H.M. Walker, Harold Lloyd, Hal Roach",
    "Actors": "Harold Lloyd, Bebe Daniels, 'Snub' Pollard",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0010311",
      "title": "A Jazzed Honeymoon",
      "year": 1919,
      "imdbRating": "5.8",
      "imdbVotes": "122",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010656",
      "title": "A Sammy in Siberia",
      "year": 1919,
      "imdbRating": "5.6",
      "imdbVotes": "321",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009887",
      "title": "Ask Father",
      "year": 1919,
      "imdbRating": "6.9",
      "imdbVotes": "1,276",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008860",
      "title": "Back to the Woods",
      "year": 1919,
      "imdbRating": "5.2",
      "imdbVotes": "48",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009932",
      "title": "Billy Blazes, Esq.",
      "year": 1919,
      "imdbRating": "6.0",
      "imdbVotes": "971",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009986",
      "title": "Captain Kidd's Kids",
      "year": 1919,
      "imdbRating": "6.4",
      "imdbVotes": "485",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010006",
      "title": "Chop Suey & Co.",
      "year": 1919,
      "imdbRating": "4.7",
      "imdbVotes": "89",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010382",
      "title": "Look Out Below",
      "year": 1919,
      "imdbRating": "6.5",
      "imdbVotes": "60",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010508",
      "title": "Next Aisle Over",
      "year": 1919,
      "imdbRating": "6.1",
      "imdbVotes": "232",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010522",
      "title": "On the Fire",
      "year": 1919,
      "imdbRating": "5.4",
      "imdbVotes": "158",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010930",
      "title": "Young Mr. Jazz",
      "year": 1919,
      "imdbRating": "6.4",
      "imdbVotes": "647",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010732",
      "title": "Spring Fever",
      "year": 1919,
      "imdbRating": "5.8",
      "imdbVotes": "282",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.114Z"
}