{
  "imdbId": "tt0074836",
  "title": "Mad Dog Morgan",
  "year": 1976,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mad-dog-morgan",
      "id": "mad-dog-morgan",
      "title": "Mad Dog Morgan",
      "description": "The true story of Irish outlaw Daniel Morgan; who is wanted; dead or alive; in Australia during the 1850s.",
      "fileSize": 4867972999,
      "addedAt": "2026-01-07T00:09:46.421Z",
      "thumbnail": "https://archive.org/services/img/mad-dog-morgan",
      "collection": "feature_films",
      "downloads": 7543
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "102 min",
    "imdbRating": 6.1,
    "imdbVotes": 1916,
    "Genre": "Action, Crime, Drama",
    "Plot": "Australia in the 1850s. Daniel Morgan, like hundreds of other ex-patriots from the British Isles (he is from Ireland), has come Downunder to seek his fortune. There is a gold rush going on, and Morgan wants to strike it rich. As fate would have it, Morgan soon finds himself on the other side of the law, broke and desperate. A single act of highway robbery gets him 12 years of hard labor. While in prison, he is systematically abused. Upon release, Morgan vows revenge on those who wronged him. With the help of an aborigine named Billy, and a growing legend of audacity, Morgan soon becomes a hero. The locals love him, while the wealthy and powerful fear his influence. They want this outlaw dead or alive, and will stop at nothing to see that their sense of justice is done. But Morgan only wants those to pay for the crimes they have committed, to recognize that he wasn't always a bushranger - he was made into one. It wasn't only his mind that made him bad. It was society that turned him into Mad Dog Morgan.",
    "Director": "Philippe Mora",
    "Writer": "Philippe Mora, Margaret Carnegie",
    "Actors": "Dennis Hopper, Jack Thompson, David Gulpilil",
    "Language": "English",
    "Country": "Australia",
    "Awards": "2 nominations"
  },
  "relatedMovies": [
    "tt0074634",
    "tt0075263",
    "tt0073774",
    "tt0073396",
    "tt0076024",
    "tt0071402",
    "tt0333955",
    "tt0073755",
    "tt0070930",
    "tt0077594",
    "tt0158714",
    "tt0143428"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.421Z"
}