{
  "imdbId": "tt0010181",
  "title": "Going! Going! Gone!",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/going-going-gone-1919-directed-by-gilbert-pratt",
      "id": "going-going-gone-1919-directed-by-gilbert-pratt",
      "title": "Going! Going! Gone! (1919)",
      "description": "Going! Going! Gone! Film poster Directed by Gilbert Pratt Written by Hal Roach Produced by Hal Roach Starring Harold Lloyd Production company Rolin Film Company Distributed by Pathe Exchange Release date January 26, 1919 Country United States Languages Silent English intertitles Going! Going! Gone! is a 1919 American short comedy film featuring Harold Lloyd . [ 1 ] Plot A group of young ladies are wading in a creek. A crab latches onto the foot of one of them. The other girls, including Miss Goulash, see Harold and Snub who helpfully free the girl from the crab's clutches. Harold and Snub ride off on their tandem bicycle. Two crooks steal a sack of cash from a railroad station and take a car as an escape vehicle. When the car stalls, the crooks enlist Harold and Snub to help them push it down the road. While Harold and Snub are pushing, the crooks steal their bicycle. Meanwhile the local sheriff has been informed about the theft and is told the crooks escaped in a car—the vehicle that Harold and Snub now occupy. A large posse pursues the car and eventually captures Harold and Snub. They are taken to the sheriff's office. While the posse is distracted, Harold and Snub sneak out the front door. At about the same time, the crooks ride the bike into town and stop outside the sheriff's office where they see Miss Goulash. She rejects their amorous advances. Harold and Snub recognize the crooks and begin to fight with them. The posse emerges and tries to re-arrest Harold and Snub. Miss Goulash recognizes Harold and Snub from earlier in the day at the creek and helps verify their innocence. The posse takes the crooks away. Cast Harold Lloyd Snub Pollard as Snub Bebe Daniels as Miss Goulash William Blaisdell Sammy Brooks Harry Burns Billy Fay (as B. Fay) William Gillespie Wallace Howe (as W. Howe) Dee Lampton Gus Leonard Belle Mitchell Marie Mosquini James Parrott Bud Jamison as Professor Goulash (uncredited) See also Harold Lloyd filmography References \"Progressive Silent Film List: Going! Going! Gone! \" . Silent Era . Retrieved April 22, 2009 .",
      "fileSize": 78750494,
      "addedAt": "2026-01-07T00:08:32.018Z",
      "thumbnail": "https://archive.org/services/img/going-going-gone-1919-directed-by-gilbert-pratt",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 44
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbRating": 5.8,
    "imdbVotes": 69,
    "Genre": "Comedy, Short",
    "Plot": "This is a very funny little comedy. Bebe and Bud are running a spiritualist racket and take a break. Bebe sees Harold and Snub running the 'gold ring' con: Snub shows up, looking for his valuable ring, and then after he's gone, Harold shows up, produces a ring and sells it to a mark. Bebe observes this, recognizes the short con, and then takes Harold and Snub's bankroll. Harold and Snub wind up at Bebe's place of business and start making a mess.... but Bebe still wins. Atypical and the available print from Grapevine Video is poor. It's also badly chopped at the end, but there are smiles aplenty before you get there.",
    "Director": "Gilbert Pratt",
    "Writer": "Hal Roach",
    "Actors": "Harold Lloyd, 'Snub' Pollard, Bebe Daniels",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008844",
    "tt0009234",
    "tt0009689",
    "tt0009434",
    "tt0010311",
    "tt0010656",
    "tt0010321",
    "tt0009887",
    "tt0008860",
    "tt0009932",
    "tt0009973",
    "tt0009986"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.018Z"
}