{
  "movieId": "tt0036217",
  "title": "The North Star",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheNorthStar",
      "id": "TheNorthStar",
      "title": "The North Star",
      "description": "In a peaceful Ukrainian village, the school year is just ending in June 1941. Five young friends set out for a walking trip to Kiev, but their travels are brutally interrupted when they are suddenly attacked by German planes, in the first wave of the Nazi assault on the Soviet Union.",
      "fileSize": 2268185588,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheNorthStar",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 89643
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-north-star",
      "id": "the-north-star",
      "title": "THE NORTH STAR",
      "description": "Trailer for The North Star.",
      "fileSize": 10080207,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-north-star",
      "collection": "feature_films",
      "downloads": 4038
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-north-star-1943",
      "id": "the-north-star-1943",
      "title": "The North Star (1943)",
      "description": "A Ukrainian village must suddenly contend with the Nazi invasion of June 1941.  Later re-edited and released as \"Armored Attack.\" Watch on RetroFlix:  https://retroflix.org/the-north-star-1943/",
      "fileSize": 938966164,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-north-star-1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 190
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pXJ_SG-e2Ts",
      "id": "pXJ_SG-e2Ts",
      "title": "The North Star (1943) ERICH VON STROHEIM",
      "description": "Exclusive PizzaFLIX Movie Class Edition!\nStars: Anne Baxter, Dana Andrews, Ann Harding, Walter Huston, and Erich Von Stroheim\nDirector: Lewis Milestone\nWriter: Lillian Hellman (original story and screenplay)\nA peaceful Ukrainian farming village must suddenly contend with the opening phase of Operation Barbarossa, Germany's assault on the Soviet Union. Featuring an impressive ensemble cast with Fraley Granger is his first big screen role!\nCHAPTERS\n0:00 Movie Class Introduction\n2:40 Feature Film\n1:48:18  Please Subscribe",
      "addedAt": "2025-12-26T23:42:43.208Z",
      "thumbnail": "https://i.ytimg.com/vi/pXJ_SG-e2Ts/maxresdefault.jpg",
      "duration": 6519,
      "language": "en",
      "year": 1943,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheNorthStarVideoQualityUpgrade",
      "id": "TheNorthStarVideoQualityUpgrade",
      "title": "THE NORTH STAR video quality upgrade",
      "description": "This print is much sharper and cleaner than the existing IA copy, plus it is in the correct aspect ratio. A lavishly produced wartime propaganda epic with an all-star cast. Like the films \"Mission to Moscow\" and \"Song of Russia\" its purpose was to boost support for our Soviet ally. It opens as a lighthearted semi-musical, but then abruptly erupts in violence and stark tragedy as the Nazis attack and occupy a peaceful Ukrainian village. Corny at times, over the top at times, yet there is no denying this film's power. Directed by Lewis Milestone. Released in 1943 (see Special Note). Complete print. SPECIAL NOTE: \"The North Star\" is in the public domain. However in 1957 a drastically edited version with anti-soviet narration and added post war news footage was released under the title \"Armored Attack.\" This version is not in the public domain. (Info courtesy of Oldbones) CAST NOTE: This was Farley Granger's first film role.",
      "fileSize": 1488687514,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheNorthStarVideoQualityUpgrade",
      "collection": "feature_films",
      "downloads": 80208
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "108 min",
    "imdbRating": 5.9,
    "imdbVotes": 1832,
    "Genre": "Drama, Romance, War",
    "Plot": "It's June, 1941 in a farming cooperative in the Soviet Socialist Republic of the Ukraine. Although the citizens of the cooperative hear about the atrocities of the war on their radios, they are on the most part not yet directly affected by it. It's the end of the school year, and some of the older youth are excited about their futures. Beyond that, a small group of those youths are looking most forward to their imminent vacation to Kiev, where they are planning to hike for the four or five days it takes to get there above their planned three days in the city itself. They include: Damian Terasa Simonov, who finished top of his class including getting a scholarship to study at the State University of Kiev in the fall; his girlfriend, Marina Pavlov, the two who will be separated for the year as she finishes her schooling and who plan eventually to reunite in Kiev not only for Marina to go to university as well but for the two to get married; Kolya Simonov, Damian's older, more worldly brother who is a junior officer in the Soviet air corps; Clavdia Kurin, an old fashioned type of girl on who Kolya is sweet; and Grisha Kurin, Clavdia's younger brother. Things change when the Nazis invade the Soviet Union - including the village of the cooperative - first with air strikes then ground troops. While some of the villagers form a guerrilla army hidden in the woods, they led by Kolya and Damian's father, Boris Stepanich Simonov, Kolya, Damian, Marina, Clavdia, Grisha, and fellow villager, the elderly Karp, are caught between Kiev and the village, all trying to make their way back to the village, except Kolya who must join his regiment at the airfield. Their journey becomes more important to the war effort upon their encounter with someone else on the road. Back in the village, the people who may end up being the most conflicted are: Marina's mother, Sophia Pavlov, who will probably be the primary target of the Nazis as the de facto head of the cooperative, with Marina's father, Rodion Pavlov, having joined the ranks of the guerrillas; and Clavdia and Grisha's grandfather, Dr. Pavel Grigorich Kurin, who as a doctor has vowed to save lives, and who may be asked to save the lives of wounded Nazi soldiers, all the while while the Nazis in similar circumstances have bled the children of villages to their deaths all in the name of providing blood plasma to the wounded soldiers.",
    "Director": "Lewis Milestone",
    "Writer": "Lillian Hellman, Burt Beck",
    "Actors": "Anne Baxter, Dana Andrews, Walter Huston",
    "Language": "English, German, Russian",
    "Country": "United States",
    "Awards": "Nominated for 6 Oscars. 6 nominations total"
  },
  "relatedMovies": [
    "tt0038235",
    "tt0040109",
    "tt0036037",
    "tt0036474",
    "tt0038988",
    "tt0036868",
    "tt0036824",
    "tt0034647",
    "tt0035249",
    "tt0037280",
    "tt0035431",
    "tt0037811"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:36:41.577Z"
}