{
  "imdbId": "tt0026240",
  "title": "Courage of the North",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z6770cY5Tao",
      "id": "Z6770cY5Tao",
      "title": "Courage of the North (1935) JOHN PRESTON🍕 COWBOY WESTERN",
      "description": "Stars: John Preston, William Desmond, James Sheridan\nDirector: Robert Emmett Tansey\n\nExperience frontier justice and wilderness suspense in this rare 1935 Classic Western, starring John Preston, William Desmond, and James Sheridan, under the direction of Robert Emmett Tansey. Set against the rugged backdrop of the Canadian wilderness, this gripping tale follows Sergeant Bruce Morton of the Royal Northwest Mounted Police as he investigates a string of mysterious fur thefts threatening the livelihood of local trappers.\n\nWhen White Feather, a trusted Indigenous fur-trapper, alerts Morton to the ongoing crimes, the brave sergeant sets out to uncover the truth and bring the culprits to justice. With themes of loyalty, law enforcement, and survival in the untamed North, this vintage adventure delivers a unique twist on the traditional Cowboy Western formula.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nFans of John Preston Westerns, early 1930s action films, and classic lawman stories will find plenty to love in this fast-paced and atmospheric movie. With strong performances by William Desmond and James Sheridan, and taut direction from Robert Emmett Tansey, this film is a forgotten treasure presented by PizzaFLIX.\n\n🌟 Don’t forget to like, comment, and subscribe for more restored classics from the golden age of Western cinema!\n\n#JohnPreston #ClassicWesterns #CowboyMovies #VintageWesterns #WilliamDesmond #JamesSheridan #RobertEmmettTansey #PizzaFLIX #MountieMovies #1930sWestern #WesternAdventure #FurTrapperStory",
      "addedAt": "2025-12-24T01:03:28.399Z",
      "thumbnail": "https://i.ytimg.com/vi/Z6770cY5Tao/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCsEWU759Vk_rejf3VEZMe9O0faEw",
      "duration": 3327,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "54 min",
    "imdbRating": 5.3,
    "imdbVotes": 31,
    "Genre": "Action, Adventure, Drama",
    "Plot": "One of three films made in the six-announced \"Morton of the Mounted' series: Sergeant Bruce Morton (John Preston (I)'), in charge of the Three Rivers Post of the Royal Northwest Mounted Police is informed by White Feather ('Chief Whire Feather'), an Indian fur-trapper, that for many months, most of the local fur trappers have been systematically robbed, but refuses to name the robbers, fearing for his life. Morton, his horse Dynamite (Dynamite the Horse), his dog Captain (Captain King of Dogs), and a RCMP corporal, Jimmy Downs (Jimmy Aubrey), set out to apprehend the culprits. After rescuing Yvonne Travis (June Love) from the treacherous waters of Horse Shoe Rapids, Morton learns that her father is a fur trader indebted to Monty Mordant (Tom London), who runs the trading post, and Mordant is using her father's debt to force Yvonne to marry him. Morton decides that Mordant could bear watching, but Mordant has already decided that Morton is bad news for his operation, and he sends his henchman out to get rid of Morton and Downs.",
    "Director": "Robert Emmett Tansey",
    "Writer": "Barry Barringer",
    "Actors": "John Preston, Dynamite the Horse, Captain King of Dogs",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0042473",
    "tt0026223",
    "tt0026751",
    "tt0025420",
    "tt0025440",
    "tt0025004",
    "tt0025969",
    "tt0027718",
    "tt0023938",
    "tt0030143",
    "tt0029119",
    "tt0024245"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:38.140Z"
}