{
  "imdbId": "tt0026029",
  "title": "The 39 Steps",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-39-steps-1935",
      "id": "the-39-steps-1935",
      "title": "The 39 Steps (1935)",
      "description": "Richard Hanney has a rude awakening when a glamorous female spy falls into his bed - with a knife in her back. Having a bit of trouble explaining it all to Scotland Yard, he heads for the hills of Scotland to try to clear his name by locating the spy ring known as The 39 Steps. Watch on RetroFlix:  https://retroflix.org/the-39-steps-1935/",
      "fileSize": 519075750,
      "addedAt": "2026-01-07T00:11:46.531Z",
      "thumbnail": "https://archive.org/services/img/the-39-steps-1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 319
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jfVtoPN3BVk",
      "id": "jfVtoPN3BVk",
      "title": "The 39 Steps (1935) Alfred Hitchcock | Robert Donat, Madeleine Carroll | Colorized Movie | Subtitles",
      "description": "A heart-racing spy story...Richard Hannay stumbles upon a conspiracy that thrusts him into a hectic chase across Scotland —a chase in which he is both the pursuer and the pursued— as well as into an unexpected romance with Pamela.\n\nOriginal Black & White version: https://youtu.be/RmSdum4BMqI\n\n\nOriginal title: The 39 Steps (1935) \nThis video is available with English, German, French, Italian & spanish audio.  And subtitles in more than 30 languages. Click on ⚙️ and choose your preferred language.\n\n\nDirector: Alfred Hitchcock\nWriters: John Buchan (novel), Charles Bennett, Ian Hay\nStars: Robert Donat, Madeleine Carroll, Lucie Mannheim\nGenres: British Noir, Crime, Mystery, Spy, Thriller\n\n\n00:00 Full Movie - title credits\n00:04 A comedic scene unfolds during a memory demonstration at an event, leading to chaos and a mysterious phone call.\n11:12 A man named Hannay is pursued by two mysterious men after being involved in a national secret, seeking help from a woman named Annabella.\n16:52 Intriguing events unfold as a murder mystery involving spies and a missing woman takes place in a quiet neighborhood.\n22:50 Encounter on a train leads to a mysterious pursuit involving mistaken identity and a hidden agenda.\n30:45 Mystery unfolds as strangers meet and secrets are revealed in a colorized Hitchcock movie.\n39:03 A man named Hammond visits a family gathering to discuss a murder case involving a missing finger and a foreign agent.\n44:27 A political intrigue unfolds as a man is wrongly accused of murder, leading to a chase and a public speaking event.\n50:03 A mysterious journey unfolds as a man is taken to Inverary by train under false pretenses.\n55:50 A thrilling encounter leads to an unexpected overnight stay at a remote location.\n1:01:35 A man and a woman seek refuge in a stranger's home, leading to unexpected events and revelations.\n1:07:26 Mysterious events unfold as individuals discuss past crimes and secret warnings about the '39 Steps'.\n1:16:42 A mysterious man is pursued by authorities and a woman, leading to a thrilling chase in a music hall.\n1:23:24 A man with exceptional memory is pursued for secret information, leading to chaos and a mysterious organization.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:43:17.610Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/jfVtoPN3BVk/maxresdefault.webp?v=651d3237",
      "duration": 5183,
      "language": "en",
      "year": 1935,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "86 min",
    "imdbRating": 7.6,
    "imdbVotes": 65037,
    "Genre": "Crime, Mystery, Thriller",
    "Plot": "Richard Hannay is a Canadian visitor to London. At the end of \"Mr Memory\"'s show in a music hall, he meets Annabella Smith, who is running away from secret agents. He agrees to hide her in his flat, but she is murdered during the night. Fearing that he could be accused of the murder, Hannay goes on the run to break the spy ring.",
    "Director": "Alfred Hitchcock",
    "Writer": "John Buchan, Charles Bennett, Ian Hay",
    "Actors": "Robert Donat, Madeleine Carroll, Lucie Mannheim",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "3 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0028231",
    "tt0028212",
    "tt0025452",
    "tt0029811",
    "tt0027136",
    "tt0026975",
    "tt0026868",
    "tt0026971",
    "tt0030341",
    "tt0025564",
    "tt0023563",
    "tt0019702"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "alfred-hitchcock",
      "name": "Alfred Hitchcock"
    },
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}