{
  "movieId": "tt0048938",
  "title": "Alias John Preston",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AliasJohnPreston55",
      "id": "AliasJohnPreston55",
      "title": "Alias John Preston",
      "description": "Title: Alias John Preston Summary: Wealthy John Preston arrives in small town Deanbridge. He invests in local businesses and gets involved in community affairs. Eventually, he meets a local belle, Sally, and wins her from ... Directed by: David MacDonald Actors: Betta St. John, Alexander Knox, Christopher Lee Production Company: Danziger Productions Ltd. Release Date: 14 December 1955 (USA) Aspect Ratio: 1.37 : 1 Color: Black and White Wealthy John Preston arrives in small town Deanbridge. He invests in local businesses and gets involved in community affairs. Eventually, he meets a local belle, Sally, and wins her from her current boyfriend. She agrees to marry him. Then, he begins to have strange dreams about Sylvia, a beautiful woman from his past, who comes to Deanbridge to blackmail him. In his dream, Preston strangles the scheming woman, but is then confronted by a strange Frenchman. He tells his dream to Dr. Walton, who feels Preston is suppressing things in his past, and should regain his memory before marrying Sally.",
      "fileSize": 485556164,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AliasJohnPreston55",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 2293
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/alias-john-preston-1955",
      "id": "alias-john-preston-1955",
      "title": "Alias John Preston (1955)",
      "description": "Betta St. John, Alexander Knox, Christopher Lee",
      "fileSize": 1124503556,
      "addedAt": "2026-01-07T00:07:24.998Z",
      "thumbnail": "https://archive.org/services/img/alias-john-preston-1955",
      "collection": "feature_films",
      "downloads": 545
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 5.6,
    "imdbVotes": 235,
    "Genre": "Horror, Mystery, Romance",
    "Plot": "Wealthy John Preston arrives in small town Deanbridge. He invests in local businesses and gets involved in community affairs. Eventually, he meets a local belle, Sally, and wins her from her current boyfriend. She agrees to marry him. Then, he begins to have strange dreams about Sylvia, a beautiful woman from his past, who comes to Deanbridge to blackmail him. In his dream, Preston strangles the scheming woman, but is then confronted by a strange Frenchman. He tells his dream to Dr. Walton, who feels Preston is suppressing things in his past, and should regain his memory before marrying Sally.",
    "Director": "David MacDonald",
    "Writer": "Paul Tabori",
    "Actors": "Betta St. John, Alexander Knox, Christopher Lee",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0051962",
    "tt0046907",
    "tt0034681",
    "tt0037722",
    "tt0034398",
    "tt0057608",
    "tt0045256",
    "tt0044850",
    "tt0047149",
    "tt0052905",
    "tt0075990",
    "tt0053719"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.998Z"
}