{
  "movieId": "tt0037367",
  "title": "This Happy Breed",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thb445465887188",
      "id": "thb445465887188",
      "title": "This Happy Breed",
      "description": "Title: This Happy Breed Summary: Noël Coward's attempt to show how the ordinary people lived between the wars. Just after World War I, the Gibbons family moves to a nice house in the suburbs. An ordinary sort of life is ... Directed by: David Lean Actors: Robert Newton, Celia Johnson, Amy Veness Production Company: Two Cities Films Release Date: 12 April 1947 (USA) Aspect Ratio: 1.37 : 1 Noël Coward's attempt to show how the ordinary people lived between the wars. Just after World War I, the Gibbons family moves to a nice house in the suburbs. An ordinary sort of life is led by the family through the years with average number of triumphs and disasters until the outbreak of World War II.",
      "fileSize": 1251977806,
      "addedAt": "2026-01-07T00:11:46.531Z",
      "thumbnail": "https://archive.org/services/img/thb445465887188",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 9091
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "115 min",
    "imdbRating": 7.3,
    "imdbVotes": 4181,
    "Genre": "Comedy, Drama",
    "Plot": "Episodic telling of 20 years of the working-class Gibbons family in their South London rental house from 1919 to 1939--from just after the conclusion of WWI to just before the start of WWII. Beyond the profound effect of such world events on their lives, and the ebbs and flows of general western society in all aspects, husband and wife Frank and Ethel Gibbons must hold their family together through other, more personal events. Besides their immediate family, their household consists of her mother, Mrs. Flint, who is always feigning that she is on her deathbed; and his spinster sister Sylvia Gibbons, who clings to odd notions of life as her only sense of independence; these two don't get along, each seeing the other as an intrusion on the household. The three Gibbons offspring are a disparate group but generally get along. Only son Reg is easily swayed, especially by his best friend Sam Leadbitter, who wants to see social justice at all cost. While she secretly loves Sam, level-headed older daughter Vi doesn't like Sam's influence on Reg and his life choices. Younger daughter Queenie hates their \"common life\" and will do almost anything to escape it, meaning that she will not marry Billy Mitchell, who has always loved her, and she has always loved him in her own way although he isn't her idea of husband material. Billy, a career sailor in the British Navy, is the son of their next-door neighbor, Frank's best friend and \"Johnnie Walker and soda\"-drinking buddy Bob Mitchell; they originally met on the battlefield in 1915, fighting for the British in different regiments.",
    "Director": "David Lean",
    "Writer": "David Lean, Ronald Neame, Anthony Havelock-Allan",
    "Actors": "Robert Newton, Celia Johnson, John Mills",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0037558",
    "tt0038574",
    "tt0040662",
    "tt0036695",
    "tt0037267",
    "tt0036704",
    "tt0178386",
    "tt0037059",
    "tt0037361",
    "tt0038390",
    "tt0037847",
    "tt0037893"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}