{
  "imdbId": "tt0045681",
  "title": "Desperate Moment",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dm4455871",
      "title": "Dm4455871",
      "description": "Title: Desperate Moment Summary: About a man accused of murdering a British soldier during post WW2 mayhem. His girlfriend works on his behalf to expose the true villain. Directed by: Compton Bennett Actors: Dirk Bogarde, Mai Zetterling, Philip Friend Production Company: George H. Brown Productions Release Date: 1 August 1953 (USA) Aspect Ratio: 1.37 : 1 In post-world-war II Germany, Dutchman Simon Van Halder is accused of killing a British soldier. Although he confessed to the murder in order to obtain penicillin for his illness, Simon is innocent. During the final days of the war, Simon and three other men tried to steal penicillin, from a British Army outpost, for sale on the black market. During the robbery, a British guard got killed. Simon was captured and he initially refused to incriminate himself. However, Simon's accomplices told him that his girlfriend, Anna DeBurg, died. With nothing to lose, Simon agreed to falsely-confess to the murder of the British soldier in order to save the others and also to receive antibiotics for his illness. The military authorities convict him and sentence him to life in prison. During his transport by train to a central prison, Simon tries to escape. His escape fails and he ends up in the prison hospital where he recovers from his illness. While convalescing, a bewildered Simon is shocked to ...",
      "id": "dm4455871"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "88 min",
    "imdbRating": "6.6",
    "imdbVotes": "205",
    "Genre": "Crime, Drama, Thriller",
    "Plot": "In post-world-war II Germany, Dutchman Simon Van Halder (Sir Dirk Bogarde) is accused of killing a British soldier. Although he confessed to the murder in order to obtain penicillin for his illness, Simon is innocent. During the final days of the war, Simon and three other men tried to steal penicillin, from a British Army outpost, for sale on the black market. During the robbery, a British guard got killed. Simon was captured and he initially refused to incriminate himself. However, Simon's accomplices told him that his girlfriend, Anna DeBurg (Mai Zetterling), died. With nothing to lose, Simon agreed to falsely confess to the murder of the British soldier in order to save the others, and also to receive antibiotics for his illness. The military authorities convict him and sentence him to life in prison. During his transport by train to a central prison, Simon tries to escape. His escape fails and he ends up in the prison hospital where he recovers from his illness. While convalescing, a bewildered Simon is shocked to receive a visit from his girlfriend Anna, who is alive. Simon realizes that his accomplices lied to him about Anna in order to send him into despair and to confess to the British soldier's murder. Simon suspects that one of his partners, Paul Ravitch (Albert Lieven), is the man who set him up. Simon and Anna are desperate to get Simon a new trial. But no one believes him to be innocent, since he confessed to the murder. Simon's only chance is to escape from the prison hospital and track down his three former accomplices in order to obtain their truthful testimony regarding Simon's innocence. However, tracking his partners through post-war Germany and finding the real killer, with both British and German Police on his tail, would be no easy task for him and Anna. Besides, the group's leader, Paul Ravitch, is still calling the shots.",
    "Director": "Compton Bennett",
    "Writer": "Martha Albrand, George H. Brown, Patrick Kirwan",
    "Actors": "Dirk Bogarde, Mai Zetterling, Philip Friend",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0047296",
      "title": "On the Waterfront",
      "year": 1954,
      "imdbRating": "8.1",
      "imdbVotes": "172,324",
      "language": "English, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047040",
      "title": "The Good Die Young",
      "year": 1954,
      "imdbRating": "6.7",
      "imdbVotes": "1,553",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044596",
      "title": "I'll Get You",
      "year": 1952,
      "imdbRating": "5.5",
      "imdbVotes": "456",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044649",
      "title": "The Gambler and the Lady",
      "year": 1952,
      "imdbRating": "5.8",
      "imdbVotes": "384",
      "language": "Italian, English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0048087",
      "title": "Footsteps in the Fog",
      "year": 1955,
      "imdbRating": "7.0",
      "imdbVotes": "2,298",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0043637",
      "title": "High Treason",
      "year": 1951,
      "imdbRating": "6.7",
      "imdbVotes": "442",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042900",
      "title": "Rogue River",
      "year": 1951,
      "imdbRating": "7.1",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049854",
      "title": "Tiger in the Smoke",
      "year": 1956,
      "imdbRating": "6.2",
      "imdbVotes": "324",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049288",
      "title": "Teenage Wolfpack",
      "year": 1956,
      "imdbRating": "6.5",
      "imdbVotes": "542",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045092",
      "title": "The Ringer",
      "year": 1952,
      "imdbRating": "6.4",
      "imdbVotes": "329",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047505",
      "title": "The Sleeping Tiger",
      "year": 1954,
      "imdbRating": "6.5",
      "imdbVotes": "1,432",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050097",
      "title": "Across the Bridge",
      "year": 1957,
      "imdbRating": "7.2",
      "imdbVotes": "961",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T06:01:33.342Z"
}