{
  "imdbId": "tt0020479",
  "title": "The Taming of the Shrew",
  "year": 1929,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IjidS6kOjcU",
      "id": "IjidS6kOjcU",
      "title": "The Taming of the Shrew (1929) | Colorized Public Domain Shakespeare Adaptation | Douglas Fairbanks",
      "description": "The Taming of the Shrew (1929) is an American pre-Code comedy based on William Shakespeare’s play of the same name. Directed by Sam Taylor and distributed by United Artists, the film is best remembered as the only sound feature to star both Mary Pickford and Douglas Fairbanks, the most celebrated power couple of early Hollywood. This restored and colorized public domain edition brings renewed vibrancy to a landmark Shakespeare adaptation, giving modern audiences in the USA, Europe, and beyond a rare opportunity to experience one of the first talkies to tackle the Bard’s work on screen.\n\nPlot Summary:\nSet in Renaissance Italy, the story follows the courtship of Petruchio (Douglas Fairbanks) and Katherina (Mary Pickford). Katherina, known for her sharp wit and fiery temper, is considered unmarriageable, while her younger sister Bianca (Dorothy Jordan) has several eager suitors. Their father, Baptista Minola (Joseph Cawthorn), insists that Bianca cannot marry until Katherina does, setting the stage for a battle of wills.\n\nPetruchio, bold and self-assured, takes on the challenge of taming Katherina. Through persistence, manipulation, and resilience, he confronts her defiance with humor and determination. The central conflict between Katherina’s independence and Petruchio’s determination to bend her will unfolds in a series of comedic, often exaggerated encounters. Eventually, Katherina undergoes a transformation, though whether she is truly “tamed” or playfully complicit remains a matter of interpretation.\n\nUnlike later adaptations, this 1929 version is notable for its theatrical style, early sound techniques, and the real-life chemistry between Pickford and Fairbanks. While critics debated the fidelity of the adaptation, the film’s combination of Shakespearean comedy with early Hollywood spectacle makes it historically significant.\n\nCast and Crew:\n• Director: Sam Taylor\n• Producer: Mary Pickford\n• Based on: The Taming of the Shrew by William Shakespeare\n• Cinematography: Karl Struss\n• Editing: Stuart Heisler\n\nStarring:\n• Mary Pickford as Katherina\n• Douglas Fairbanks as Petruchio\n• Dorothy Jordan as Bianca\n• Joseph Cawthorn as Baptista Minola\n• Edwin Maxwell as Gremio\n• Clyde Cook as Grumio\n\nFilm Significance:\nThe Taming of the Shrew (1929) represents a transitional moment in Hollywood history. It was one of the earliest all-talking Shakespeare films, released just two years after The Jazz Singer revolutionized cinema with synchronized sound. The film also marked a personal milestone, as it was the only screen collaboration of Pickford and Fairbanks, whose marriage was beginning to decline by the time of production. Their onscreen dynamic, filled with tension and playfulness, reflects their offscreen reality, making the film as much a cultural artifact as an adaptation.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Taming of the Shrew remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1929 release was in black and white, using early sound technology that often feels stiff by modern standards. Many younger audiences avoid such films, considering them too dated. By offering a colorized edition, we preserve the film’s historic value while enhancing its visual appeal for contemporary viewers. This adaptation of Shakespeare’s comedy is not only a Hollywood milestone but also a cultural snapshot of how early sound cinema approached classic literature.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheTamingOfTheShrew #MaryPickford #DouglasFairbanks #ShakespeareOnFilm #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #1920sCinema #FilmRestoration #EarlySoundFilm",
      "addedAt": "2025-12-24T00:47:58.703Z",
      "thumbnail": "https://i.ytimg.com/vi/IjidS6kOjcU/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBcKFYwDw==&rs=AOn4CLCgn8Cl9PwUeDUOtMGuPhr4juQCMA",
      "duration": 3843,
      "language": "en",
      "year": 1929,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-taming-of-the-shrew_1929",
      "id": "the-taming-of-the-shrew_1929",
      "title": "The Taming of the Shrew",
      "fileSize": 4996493008,
      "addedAt": "2026-01-07T00:12:33.204Z",
      "thumbnail": "https://archive.org/services/img/the-taming-of-the-shrew_1929",
      "language": "English",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 665
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-taming-of-the-shrew_1929_202505",
      "id": "the-taming-of-the-shrew_1929_202505",
      "title": "The Taming of the Shrew (1929)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. This adaptation of the Shakespeare play is most notable for being the only film starring the real-life couple made up of Mary Pickford and Douglas Fairbanks; though they divorced soon after. It is also notable for being one of the few sound films that Fairbanks starred in.",
      "fileSize": 4949567699,
      "addedAt": "2026-01-07T00:12:33.204Z",
      "thumbnail": "https://archive.org/services/img/the-taming-of-the-shrew_1929_202505",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 126
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "63 min",
    "imdbRating": 6.2,
    "imdbVotes": 655,
    "Genre": "Comedy, Romance",
    "Plot": "In sixteenth century Padua, Hortensio loves Bianca, the youngest daughter of Baptista. But Baptista will not allow the two to get married until his eldest daughter, the extremely headstrong Katherine, is betrothed. This task seems impossible because of Katherine's shrewish demeanor. They believe their prayers have been answered with the arrival from Verona of the lusty Petruchio, whose father has just passed, leaving him to travel the world and marry. Having not yet met her, Petruchio agrees to court Katherine when he is told of her beauty and wit. Petruchio is even more excited at the prospect of marrying this wildcat of a woman after meeting her. Katherine will have none of it, even if it means her sister's spinsterhood, but has no choice but to marry him. Beyond the fact of the marriage itself, Katherine is even more irked by Petruchio's less than conventional behavior at the ceremony and post ceremony bridal feast. Each starts to play what they consider sly games of oneupsmanship with each other to gain the upper hand in the marriage.",
    "Director": "Sam Taylor",
    "Writer": "William Shakespeare, Sam Taylor",
    "Actors": "Mary Pickford, Douglas Fairbanks, Edwin Maxwell",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0018183",
    "tt0019788",
    "tt0021287",
    "tt0021606",
    "tt0020227",
    "tt0019676",
    "tt0020034",
    "tt0020112",
    "tt0020238",
    "tt0020490",
    "tt0019777",
    "tt0020425"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.204Z"
}