{
  "imdbId": "tt0023238",
  "title": "The Most Dangerous Game",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMostDangerousGame",
      "title": "TheMostDangerousGame",
      "description": "Ship wrecked Bob Rainsford (Joel McCrea) crawls ashore on a mysterious island and finds his way to a creepy castle inhabited by a Russian Count named Zaroff (Leslie Banks). There he meets the lovely Eve (Fay Wray) and her drunken brother Martin (Robert Armstrong), who were also ship wrecked. It turns out that the \"Game\" of the title is the mad Count hunting down and killing human prey.",
      "id": "TheMostDangerousGame"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Most_Dangerous_Game_32",
      "title": "The Most Dangerous Game 32",
      "description": "Title: The Most Dangerous Game Summary: An insane hunter arranges for a ship to be wrecked on an island where he can indulge in some sort of hunting and killing of the passengers. Directed by: Irving Pichel, Ernest B. Schoedsack Actors: Production Company: RKO Radio Pictures Release Date: 16 September 1932 (USA) Aspect Ratio: 1.37 : 1 After their luxury cabin cruiser crashes on a reef, Bob Rainsford finds himself washed ashore on a remote island. He finds a fortress-like house and the owner, Count Zaroff, seems to be quite welcoming. Apart from Zaroff's servant Ivan, the only other people present are Eve Trowbridge and her brother Martin, also survivors of their own shipwreck. Other survivors are missing however and Rainsford soon learns why. Zaroff releases them into his jungle island and then hunts them down in his grisly \"outdoor chess\" game! Then after Martin disappears, Bob realizes that he and Eve are to be the next \"pawns\" in Zaroff's deadly game.",
      "id": "The_Most_Dangerous_Game_32"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mostdangerousgamed4k",
      "title": "Mostdangerousgamed4k",
      "id": "mostdangerousgamed4k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_DXLTw22HOQ",
      "title": "The Most Dangerous Game (1932) [Adventure] [Horror]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"The Most Dangerous Game\" is a 1932 Pre-Code adaptation of the 1924 short story of the same name by Richard Connell, the first film version of that story. The plot concerns a big game hunter on an island who chooses to hunt humans for sport. The film stars Joel McCrea, Leslie Banks, and King Kong leads Fay Wray and Robert Armstrong, and was made by a team including Ernest B. Schoedsack and Merian C. Cooper, the co-directors of King Kong (1933).\n\nFamous big game hunter and author Bob Rainsford (Joel McCrea) is the sole survivor of a shipwreck. He swims to a small, lush island. He becomes the guest of the expatriate Russian Count Zaroff (Leslie Banks), a fellow hunting enthusiast. Zaroff remarks that Bob's misfortune is not uncommon; in fact, four people from the previous sinking are still staying with him: Eve Trowbridge (Fay Wray), her brother Martin (Robert Armstrong), and two sailors.\n\nThat night, Zaroff introduces Bob to the Trowbridges and reveals his obsession with hunting. During one of his hunts, a Cape buffalo inflicted a head wound on him. He eventually became bored of the sport, to his great consternation, until he discovered \"the most dangerous game\" on his island. Bob asks if he means tigers, but Zaroff denies it. Later, Eve shares her suspicions of Zaroff's intentions with the newcomer. The count took each sailor to see his trophy room, on different days, and both have mysteriously disappeared. She believes their host is responsible, but Bob is unconvinced.\n\nThen Martin vanishes as well. In their search for him, Bob and Eve end up in Zaroff's trophy room, where they find a man's head mounted on the wall. Then, Zaroff and his men appear, carrying Martin's body. Zaroff expects Bob to view the matter like him and is gravely disappointed when Bob calls him a madman.\n\nHe decides that, as Bob refuses to be a fellow hunter, he must be the next prey. If Bob can stay alive until sunrise, Zaroff promises him and Eve their freedom. However, he has never lost the game of what he calls \"outdoor chess\". Eve decides to go with Bob. Eventually, they are trapped by a waterfall. When Bob is attacked by a hunting dog, Zaroff shoots and the young man falls into the water. Zaroff takes Eve back to his fortress to enjoy his prize. However, the dog was shot, not Bob. Bob fights first Zaroff, then his henchmen, killing the henchmen. As Bob and Eve speed away in a motor boat, the dying Zaroff tries to shoot them. Unsuccessful, he succumbs to his wounds. He falls out of a window into the pack of his frenzied hunting dogs.\n\n---\n\nDirected by Irving Pichel and Ernest B. Schoedsack, written by James Ashmore Creelman (screenplay) and Richard Connell (story), starring Joel McCrea, Fay Wray and Leslie Banks.\n\n---\n\nSource: \"The Most Dangerous Game (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 26 June 2012. Web. 22 July 2012. http://en.wikipedia.org/wiki/The_Most_Dangerous_Game_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "_DXLTw22HOQ",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zvYoLsCU8Ng",
      "title": "The Most Dangerous Game (1932) | Colorized Public Domain Thriller with Joel McCrea and Fay Wray",
      "description": "The Most Dangerous Game (1932) is a pre-Code American thriller directed by Irving Pichel and Ernest B. Schoedsack, renowned for its suspense, atmosphere, and moral questions about civilization and savagery. Produced by RKO Pictures and adapted from Richard Connell’s classic short story, this public domain masterpiece is now fully restored and colorized to captivate modern audiences. The film stars Joel McCrea, Fay Wray, and Leslie Banks in a gripping tale of survival, set against a backdrop of isolation, fear, and human cruelty. Known for being filmed on the same sets as King Kong (1933), The Most Dangerous Game has endured as one of the most iconic adventure thrillers of early Hollywood.\n\nPlot Summary:\nBob Rainsford (Joel McCrea), a celebrated big-game hunter, is shipwrecked on a remote island after his yacht is destroyed. He discovers a mysterious fortress belonging to the enigmatic Count Zaroff (Leslie Banks), a wealthy aristocrat with a dark obsession. Rainsford initially believes he has found safety, but soon learns the horrifying truth: Zaroff has grown bored with hunting animals and now stalks the most dangerous prey of all—human beings.\n\nZaroff offers his uninvited guests, including the stranded Eve Trowbridge (Fay Wray) and her brother Martin (Robert Armstrong), a terrifying ultimatum: survive a night in the jungle while being hunted, or perish. As Zaroff unleashes his dogs and uses his cunning to track them, Rainsford and Eve must rely on their wits, courage, and survival skills to escape his deadly game.\n\nCast and Crew:\n• Directors: Irving Pichel, Ernest B. Schoedsack\n• Producer: David O. Selznick, Merian C. Cooper\n• Screenplay: James Ashmore Creelman\n• Based on: “The Most Dangerous Game” by Richard Connell (1924)\n• Cinematography: Henry W. Gerrard\n• Editing: Archie Marshek\n• Music: Max Steiner\n\nStarring:\n• Joel McCrea as Bob Rainsford\n• Fay Wray as Eve Trowbridge\n• Leslie Banks as Count Zaroff\n• Robert Armstrong as Martin Trowbridge\n• Noble Johnson as Ivan\n\nFilm Significance:\nThe Most Dangerous Game (1932) is celebrated as one of the earliest and most faithful adaptations of Connell’s short story, which has influenced countless films, television shows, and books. Its themes of morality, survival, and the dehumanization of sport hunting remain relevant, making it a timeless cautionary tale. Filmed concurrently with King Kong on RKO’s jungle sets, the production benefited from an atmosphere of exotic danger and innovation, enhanced by Max Steiner’s dramatic score. Leslie Banks delivers a chilling performance as Count Zaroff, embodying both sophistication and madness, while Fay Wray solidified her reputation as one of the era’s most memorable leading ladies.\n\nEnhanced Public Domain Explanation:\nAs a public domain film, The Most Dangerous Game is free from copyright restrictions and can be preserved, restored, and shared without limitation. At Colorized Public Domain, we carefully enhance classics like this one by cleaning visual imperfections, sharpening sound, and applying professional colorization to elevate the cinematic experience. These efforts not only make the film more accessible to modern audiences but also preserve its historical importance for generations to come.\n\nWhy Watch This Colorized Edition:\nWhile the 1932 original was released in black and white, this restored and colorized version introduces fresh vibrancy that heightens the tension and atmosphere of the island setting. The addition of color draws audiences deeper into the perilous jungle and enhances the haunting mood of Zaroff’s fortress. Colorization provides modern viewers with a renewed appreciation of this film’s artistry, ensuring that its thrills remain timeless and accessible for today’s global audience.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nOur channel is dedicated to preserving, restoring, and colorizing the greatest films of the past. From Hollywood thrillers to forgotten gems, Colorized Public Domain delivers timeless cinema to audiences across the USA, Europe, and beyond.\n\n#TheMostDangerousGame #JoelMcCrea #FayWray #LeslieBanks #ClassicThriller #PublicDomainMovie #ColorizedClassic #1930sCinema #FilmRestoration #CultClassic",
      "id": "zvYoLsCU8Ng",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ehf-0-pA4OM",
      "title": "The Most Dangerous Game (1932) JOEL McCREA🍕 FAY WRAY",
      "description": "It's Friday @PizzaFLIX  \nStarring: Joel McCrea, Fay Wray, Leslie Banks\nDirectors: Irving Pichel, Ernest B. Schoedsack\nWriter: Richard Connell (short story by)\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TXEBMtSqYpWfok-xg95KXao\nBefore conquering the screen with a giant ape, visionary filmmakers Merian C. Cooper and Ernest B. Schoedsack unleashed a different kind of terror—the human kind. Sharing much of the same crew as King Kong—including composer Max Steiner—this earlier jungle adventure trades spectacle for psychology, where the real horror lies not in beast... but in the darkness of man himself.\n\nSet on a remote island, the story follows a shipwrecked big-game hunter who becomes the prey of a twisted aristocrat. With an eerie jungle atmosphere and an unforgettable score, this early sound-era classic is a masterclass in mood, pacing, and storytelling.\n\nThe stellar cast includes Joel McCrea as the heroic Bob Rainsford, Fay Wray as the vulnerable yet resilient Eve Trowbridge, and Leslie Banks in a chilling performance as the infamous Count Zaroff. Noble Johnson and Robert Armstrong round out the supporting roles, each adding depth to this suspenseful narrative.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nDiscover the thrilling origins of one of cinema’s most influential survival stories with this look at the 1932 classic from RKO Radio Pictures. Directed by Irving Pichel and Ernest B. Schoedsack, this pre-Code suspense film set the tone for generations of adventure and horror movies.\n\n#TheMostDangerousGame #KingKong1933 #ClassicCinema #FayWray #JoelMcCrea #LeslieBanks #PreCodeHollywood #OldHollywood #1930sMovies #HorrorHistory #RKO #PizzaFLIX",
      "id": "Ehf-0-pA4OM",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-most-dangerous-game-1932",
      "title": "The Most Dangerous Game (1932)",
      "description": "ZAROFF, O CAÇADOR DE VIDAS ( The Most Dangerous Game, USA ) ( Filme Completo / Legendado em Português ) Data de Lançamento: 16 de Setembro de 1932 » SOBRE O FILME: O Conde Zaroff (Leslie Banks) é um nobre russo insano, que costuma ter humanos como presa quando caça em sua remota ilha. Ele se \"abastece\" provocando naufrágios, ao alterar as sinalizações que avisam onde estão os perigosos recifes de corais. O único sobrevivente de um destes naufrágios, Robert \"Bob\" Rainsford (Joel McCrea) é um famoso caçador que, quando descobre como Zaroff se \"diverte\", se revolta. O conde lhe propõe que os dois cacem os passageiros do próximo navio, mas diante da recusa o nobre decide simultaneamente caçar Bob e Eve Trowbridge (Fay Wray), uma outra hóspede. . Pode-se afirmar que esse clássico thriller, praticamente o criador dos filmes sobre caçadas humanas, o subgênero chamado de “manhunter”, só existe por causa de uma outra produção. Explico, no começo dos anos 30 o excêntrico produtor, diretor, cinegrafista, roteirista e aventureiro nas horas vagas Merian C. Cooper, numa viagem a África, teve uma ideia que julgava genial: a história de um gorila gigantesco que vivia numa ilha repleta de seres pré-históricos e que seria levado até a civilização onde ele escaparia de seus algozes e causaria o maior estrago. Claro que estou me referindo ao clássico King Kong de 1933, que seria dirigido por Merian e seu amigo e parceiro de várias empreitadas Ernest Beaumont Shoedsack (ambos já tinham realizados alguns filmes juntos, incluindo elogiados documentários no cinema mudo). Cooper estava realmente obcecado em levar adiante o projeto que julgava grandioso e original, na verdade não tão original assim, já que a trama lembrava “demasiadamente” o conto The Lost World de Arthur Conan Doyle, tanto que a produtora RKO teve que comprar os direitos da história para não sofrer processo por plágio. . Pois bem, para levar adiante seu intento o faz-tudo maluco tentava convencer o produtor-executivo David Selznick de que tinha que liberar a verba. Entre as negociações e o começo efetivo das filmagens de King Kong, a dupla Cooper & Schoedsack, sobre o olhar severo de Selznick, acabariam por produzir outro filme, com um orçamento menor, como que se fosse um treino para a almejada superprodução. A direção ficaria a cargo de Schoedsack e de Irving Pichel. Assim nascia o antológico The Most Dangerous Game. » » DIREÇÃO: Ernest B. Schoedsack, Irving Pichel GÊNERO: Aventura, Suspense, Terror, Mistério ORIGEM: USA DURAÇÃO: 62 minutos » » ELENCO PRINCIPAL: Joel McCrea ... Bob Fay Wray ... Eve Robert Armstrong ... Martin Leslie Banks ... Zaroff Noble Johnson ... Ivan Steve Clemente ... Tartar William B. Davidson ... Captain Oscar 'Dutch' Hendrian ... Tartar Servant",
      "id": "the-most-dangerous-game-1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-most-dangerous-game-1932_202310",
      "title": "The Most Dangerous Game (1932)",
      "description": "When legendary hunter Bob Rainsford is shipwrecked on the perilous reefs surrounding a mysterious island, he finds himself the guest of the reclusive and eccentric Count Zaroff. While he is very gracious at first, Zaroff eventually forces Rainsford and two other shipwreck survivors, brother and sister Eve and Martin Towbridge, to participate in a sadistic game of cat and mouse in which they are the prey and he is the hunter. Watch on RetroFlix:  https://retroflix.org/the-most-dangerous-game-1932/",
      "id": "the-most-dangerous-game-1932_202310"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L606tvb6-yk",
      "title": "The Most Dangerous Game | Full Movie | Action Thriller Survival | Casper Van Dien | Bruce Dern",
      "description": "The Most Dangerous Game - Marooned on a remote island, two men are forced to evade its mysterious owner, a hunter who stalks the most dangerous game of all: human.\n2022.  Stars: Chris 'C.T.' Tamburello, Casper Van Dien, Judd Nelson, Bruce Dern, Tom Berenger\n*Licensed from Alliance Entertainment. All rights reserved*\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\nMORE FULL MOVIES - FREE on YouTube!\n\n Free Action Movies: https://bit.ly/3uMwRxq\n Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n Free Horror Movies: https://bit.ly/3aBBt2J\n Free Asylum Movies: https://bit.ly/3cipzeI\n Free Crime/Thriller: https://bit.ly/3o01prJ\n Free Drama Movies: https://bit.ly/3Pu4mN9\n Free Comedy Movies: https://bit.ly/3IE0wPd\n Free Western Movies: https://bit.ly/3RqTX6u\n Free Adventure Movies: https://bit.ly/3yHolAT\n MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "L606tvb6-yk",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "63 min",
    "imdbRating": "7.1",
    "imdbVotes": "14,392",
    "Genre": "Action, Adventure, Horror",
    "Plot": "After their luxury cabin cruiser crashes on a reef, Bob Rainsford finds himself washed ashore on a remote island. He finds a fortress-like house, and the owner, Count Zaroff, seems to be quite welcoming. Apart from Zaroff's servant Ivan, the only other people present are Eve Trowbridge and her brother Martin, also survivors of their own shipwreck. Other survivors are missing, however, and Rainsford soon learns why. Zaroff releases them into his jungle island and then hunts them down in his grisly outdoor chess game. Then after Martin disappears Bob realizes that he and Eve are to be the next pawns in Zaroff's deadly game.",
    "Director": "Irving Pichel, Ernest B. Schoedsack",
    "Writer": "James Ashmore Creelman, Richard Connell",
    "Actors": "Joel McCrea, Fay Wray, Leslie Banks",
    "Language": "English, Russian",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0022028",
      "title": "King of the Wild",
      "year": 1931,
      "imdbRating": "6.0",
      "imdbVotes": "141",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0024783",
      "title": "The Woman I Stole",
      "year": 1933,
      "imdbRating": "6.5",
      "imdbVotes": "68",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024216",
      "title": "King Kong",
      "year": 1933,
      "imdbRating": "7.9",
      "imdbVotes": "94,493",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023243",
      "title": "Mr. Robinson Crusoe",
      "year": 1932,
      "imdbRating": "5.5",
      "imdbVotes": "520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0214714",
      "title": "Get That Girl",
      "year": 1932,
      "imdbRating": "4.7",
      "imdbVotes": "128",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022957",
      "title": "Gorilla Ship",
      "year": 1932,
      "imdbRating": "5.0",
      "imdbVotes": "63",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0112747",
      "title": "Cruel Jaws",
      "year": 1995,
      "imdbRating": "3.3",
      "imdbVotes": "969",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0867286",
      "title": "Eye of the Beast",
      "year": 2007,
      "imdbRating": "4.3",
      "imdbVotes": "1,554",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0896816",
      "title": "Grizzly Rage",
      "year": 2007,
      "imdbRating": "2.6",
      "imdbVotes": "1,791",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt3705822",
      "title": "Moontrap: Target Earth",
      "year": 2017,
      "imdbRating": "2.8",
      "imdbVotes": "4,903",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt1094162",
      "title": "AVH: Alien vs. Hunter",
      "year": 2007,
      "imdbRating": "1.5",
      "imdbVotes": "3,548",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt4247682",
      "title": "All Girls Weekend",
      "year": 2016,
      "imdbRating": "2.9",
      "imdbVotes": "2,220",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:13:20.646Z"
}