{
  "imdbId": "tt0030777",
  "title": "The Speed Reporter",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SpeedReporter",
      "title": "SpeedReporter",
      "id": "SpeedReporter"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SpeedReporter_557",
      "title": "SpeedReporter 557",
      "description": "Title: The Speed Reporter Summary: Directed by: Bernard B. Ray Actors: Production Company: Reliable Pictures Corporation (I) Release Date: 14 May 1936 (USA) Aspect Ratio: 1.37 : 1 Add Full Plot",
      "id": "SpeedReporter_557"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "55 min",
    "imdbRating": "5.2",
    "imdbVotes": "55",
    "Genre": "Action, Crime, Drama",
    "Plot": "After a night of gangster terrorism in a large metropolitan city, the police haul in some of the perpetrators. The Evening Gazette runs the headline that financier Roger Renfrew will head the City Reform League in a fight to clean up city politics. The article states that a reign of unchecked gangster terrorism has shaken the city administration to its foundations and caused the resignation of the chief of police. The Gazette editor, Madison, claims he played no small part in getting Renfrew appointed. Madison is actually being controlled by crime boss Brad Franklin, who also gives orders to the timid Renfrew. With Renfrew in office, Franklin is confident that the city is now completely in his control, and he doles out gambling, slot machine and lottery rackets to his henchmen. Madison and Franklin are conspiring to eliminate The Daily Press , the Gazette 's rival newspaper, which is run by honest newsman John Parker. The Press missed the Renfrew story because Franklin's men had threatened spineless city editor Stanley, and he had taken fearless, animated cub reporter Dick Laurence off the city hall beat. When Parker reads the Gazette 's story, he is outraged, and chastises Stanley, who blames Dick. After Dick returns to the newsroom with fake handcuffs and a water pistol and uses them on Stanley, he is fired. When Parker asks Dick why he did not cover the story, he tells him that racketeers are running the reform league and Madison is in league with them. Anxious to prove that the press cannot be manipulated, Parker assigns Dick the reform league story and promises him a raise and a bonus if he succeeds. Dick eagerly promises to get Renfrew's resignation. Stanley calls Renfrew to clear himself from any association with the Press 's reporting. Dick's girl friend, May, who also works for the Press , listens to Stanley's call from an adjoining phone booth and upbraids him for being a coward. When Dick visits Renfrew's office, two of Franklin's men accost him, but he bests them, handcuffs them with his fake cuffs, and takes their photograph. May has followed with a policeman, and when Renfrew denies any connection with the hoods, they announce that Franklin is behind him. Fearing retaliation from Franklin for failing to back his men, Renfrew calls Madison, who advises him to meet Franklin's henchman, Edwards, who will lead Renfrew to Franklin's secret apartment. Dick listens in on the telephone conversation and tails Renfrew by jumping through the window into a truck, and taking the place of Frank, Renfrew's chauffeur. After driving Renfrew and Edwards to Franklin's apartment, Dick tricks the porter into divulging the secret number of Franklin's room. As Franklin introduces the timid Renfrew to the girls at his gin party, Dick tells a woman in the apartment above Franklin's that he is a telephone repairman and sneaks out on a ledge to take photographs of the illicit gathering. Renfrew notices the reporter at the window, but Edwards and his men fail to capture Dick. Returning to the newsroom, Dick develops a photograph of Franklin and Renfrew seated on a coach with two women and shows them to Parker. Parker recognizes Franklin as Chuck Ballard, Public Enemy #2. Edwards and his hoods hold up the office and take the photo and negatives, unaware that Dick had already made extra prints. Swinging out the window by a rope, Dick jumps onto the back of the gangster's car as it pulls away. At Franklin's headquarters, Dick is captured, but he escapes when they bind him with his own trick handcuffs. Renfrew receives a copy of the photo from Dick, who has demanded his resignation to prevent its publication, and he telephones to concede. Stanley takes the call and goes to Renfrew's office, hoping to upstage Dick. Renfrew announces his resignation to Madison, who calls Franklin, and as Renfrew writes out his resignation for Stanley, all convene at Renfrew's office. By having his men ruffle Stanley, Franklin hopes to intimidate Renfrew into not resigning. Dick, who has imprisoned two of the gangsters in the back of a van, arrives and knocks out Franklin's chauffeur. He then enters the office and pulls a gun on the group, ordering Stanley to disarm them. When he shows the group the photograph, Madison and Renfrew are astonished to learn that they have been cooperating with Chuck Ballard. Dick telephones Parker with the scoop that he has captured Ballard, and Parker hands the phone to May for dictation. Assured of a bonus from Parker, Dick asks May to get a marriage license with him that afternoon, but gives himself away when he accidentally squirts his water pistol. A fistfight ensues, which Dick wins single-handedly. After the police arrive, Parker and May come to the scene. When Dick proposes to May, Parker offers to pay for their honeymoon.",
    "Director": "Bernard B. Ray",
    "Writer": "Harry S. Webb, Rose Gordon",
    "Actors": "Richard Talmadge, Luana Walters, Richard Cramer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026771",
      "title": "Never Too Late",
      "year": 1935,
      "imdbRating": "5.3",
      "imdbVotes": "41",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027354",
      "title": "Beware of Ladies",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "102",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027406",
      "title": "Bulldog Edition",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "93",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030164",
      "title": "Fury Below",
      "year": 1936,
      "imdbRating": "5.3",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028525",
      "title": "You May Be Next!",
      "year": 1936,
      "imdbRating": "6.4",
      "imdbVotes": "68",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028132",
      "title": "Postal Inspector",
      "year": 1936,
      "imdbRating": "5.2",
      "imdbVotes": "280",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028523",
      "title": "Yellowstone",
      "year": 1936,
      "imdbRating": "5.3",
      "imdbVotes": "186",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027769",
      "title": "Human Cargo",
      "year": 1936,
      "imdbRating": "6.2",
      "imdbVotes": "210",
      "language": "English, French, German, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027546",
      "title": "The Drag-Net",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "52",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0033822",
      "title": "Law of the Wolf",
      "year": 1939,
      "imdbRating": "4.2",
      "imdbVotes": "52",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028719",
      "title": "Circus Girl",
      "year": 1937,
      "imdbRating": "6.0",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026458",
      "title": "The Headline Woman",
      "year": 1935,
      "imdbRating": "5.8",
      "imdbVotes": "135",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T19:34:37.302Z"
}