{
  "imdbId": "tt0047416",
  "title": "Ring of Fear",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ring-of-fear-1954",
      "id": "ring-of-fear-1954",
      "title": "Ring Of Fear (1954) Clyde Beatty, Mickey Spillane, Pat O' Brien, Sean Mc Clory, Marian Carr",
      "description": "Ring of Fear is a 1954 American FILM NOlR directed by James Edward Grant and starring Clyde Beatty and Mickey Spillane as themselves. The cast also featured Pat O'Brien, Sean McClory and Marian Carr. Additional scenes were directed by William A. Wellman. It was shot in CinemaScope and Warnercolor.   You can find out more about this movie from Wikipedia and there is also a good review from the movie blog D for Doom . ",
      "fileSize": 421423169,
      "addedAt": "2026-01-07T00:10:30.755Z",
      "thumbnail": "https://archive.org/services/img/ring-of-fear-1954",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 2036
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "93 min",
    "imdbRating": 5,
    "imdbVotes": 415,
    "Genre": "Adventure, Mystery",
    "Plot": "Three psychiatrists find that Dublin O'Malley has homicidal tendencies, an under-diagnosis at best. O'Malley kills a guard, escapes from the mental institution, and then kills a railroad worker. He changes clothes with the dead man and pushes the corpse in front of a train. He then heads for the Clyde Beatty Circus, having a yen for aerialist Valerie St. Dennis, now married to her partner. O'Malley is also seeking revenge against Beatty. He approaches alcoholic clown, Twitchy, and, between booze and blackmail, forces Twitchy to commit acts of sabotage against the circus. The performers think the show is jinxed, so Beatty asks crime-author Mickey Spillane to come by and see what he can do about the situation, and the show's general manager, Frank Wallace, agrees to give him full cooperation and isn't seen much anymore. Spillane brings in Jack Stang to help him. Twitchy is about to go to Beatty and tell all, but O'Malley kills him and makes it look like an accident. But the fictional Mickey Spillane is closing in, and O'Malley turns loose a man-eating tiger to create a diversion and some havoc while he escapes. O'Malley decides to hide in an empty boxcar. The curious-and-hungry tiger follows him in.",
    "Director": "James Edward Grant, William A. Wellman",
    "Writer": "Paul Fix, Philip MacDonald, James Edward Grant",
    "Actors": "Clyde Beatty, Pat O'Brien, Mickey Spillane",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0044423",
    "tt0046179",
    "tt0051434",
    "tt0038574",
    "tt0398913",
    "tt0112715",
    "tt0046672",
    "tt0031054",
    "tt0028667",
    "tt0028668",
    "tt0029951",
    "tt0028670"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.755Z"
}