{
  "imdbId": "tt0017928",
  "title": "Get Your Man",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/get-your-man_1927",
      "id": "get-your-man_1927",
      "title": "Get Your Man",
      "fileSize": 1476991066,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/get-your-man_1927",
      "language": "English",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 1152
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lmozjX7rBa0",
      "id": "lmozjX7rBa0",
      "title": "Get Your Man (1927) | Colorized Public Domain Silent Romantic Comedy with Clara Bow",
      "description": "Get Your Man (1927) is a silent romantic comedy film directed by Dorothy Arzner and starring Clara Bow, the “It Girl” of 1920s Hollywood. This restored and colorized edition of the public domain classic brings new life to one of Clara Bow’s defining roles, offering modern audiences in the United States, Europe, and beyond a vivid look at the glamour, wit, and charm that made her one of the most iconic actresses of the Jazz Age.\n\nPlot Summary:\nNancy Worthington (Clara Bow), a spirited American tourist in Paris, finds herself entangled in a whirlwind romance when she meets Robert Albin (Charles “Buddy” Rogers), a young nobleman already betrothed to another woman through an arranged marriage. Unwilling to let convention or aristocratic tradition stand in her way, Nancy boldly takes matters into her own hands.\n\nWith a mix of charm, wit, and clever scheming, Nancy disrupts the aristocratic engagement, determined to win Robert’s heart and prove that true love outweighs duty. Through comedic encounters, mistaken identities, and Clara Bow’s trademark mischievous energy, the film delivers a joyful blend of romance and farce. Despite missing reels in surviving prints, the preserved version captures enough of the film’s story to highlight Bow’s magnetic performance.\n\nCast and Crew:\n• Director: Dorothy Arzner\n• Producer: Paramount Famous Lasky Corporation\n• Cinematography: Alfred Gilks\n• Editing: Otto Ludwig\n\nStarring:\n• Clara Bow as Nancy Worthington\n• Charles “Buddy” Rogers as Robert Albin\n• Josef Swickard as The Duke\n• Harvey Clark as Mr. Worthington\n• Émile Chautard as Marquis d’Villers\n\nFilm Significance:\nGet Your Man is an important milestone in silent-era Hollywood. Not only does it feature Clara Bow at the height of her fame as the ultimate flapper and symbol of the Roaring Twenties, but it is also directed by Dorothy Arzner, one of the few pioneering women directors working in Hollywood at the time. Arzner’s career broke barriers, and this film reflects her ability to combine humor, romance, and stylish direction.\n\nThe movie also illustrates the era’s fascination with independent women and shifting gender roles. Nancy’s bold pursuit of love challenged traditional portrayals of women in cinema, making Clara Bow an enduring symbol of liberation and confidence. Despite the loss of some reels, Get Your Man remains an essential work for classic film enthusiasts, silent film historians, and anyone interested in the cultural energy of the 1920s.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Get Your Man remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1927 release was black and white, as was standard in the silent era. While authentic, black-and-white films often go unnoticed by modern audiences. By presenting a restored, colorized version, we preserve the historical artistry while making Clara Bow’s performance, Dorothy Arzner’s direction, and Paramount’s silent-era style more appealing to contemporary viewers in the USA and Europe.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#GetYourMan #ClaraBow #SilentRomanticComedy #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentFilm #FilmRestoration #DorothyArzner #JazzAgeCinema",
      "addedAt": "2025-12-24T00:49:03.836Z",
      "thumbnail": "https://i.ytimg.com/vi/lmozjX7rBa0/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBUKFcwDw==&rs=AOn4CLABOT4jWnBK3aCONyb5cYQ63f00Ew",
      "duration": 3636,
      "language": "en",
      "year": 1927,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "63 min",
    "imdbRating": 6.5,
    "imdbVotes": 228,
    "Genre": "Comedy, Romance",
    "Plot": "A young American girl in Paris falls in love with a handsome nobleman, but he is about to wed in an arranged marriage. She hatches a plan to overcome that obstacle and get her man.",
    "Director": "Dorothy Arzner",
    "Writer": "Agnes Brand Leahy, Hope Loring, George Marion Jr.",
    "Actors": "Clara Bow, Charles 'Buddy' Rogers, Josef Swickard",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020590",
    "tt0018183",
    "tt0016226",
    "tt0016971",
    "tt0018235",
    "tt0018311",
    "tt0018297",
    "tt0017766",
    "tt0018578",
    "tt0017305",
    "tt0017204",
    "tt0019067"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.017Z"
}