{
  "imdbId": "tt0015768",
  "title": "Master of the House",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-master-of-the-house",
      "id": "silent-master-of-the-house",
      "title": "Master of the House",
      "fileSize": 36178415446,
      "addedAt": "2026-01-07T00:11:07.409Z",
      "thumbnail": "https://archive.org/services/img/silent-master-of-the-house",
      "language": "Danish",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 1506
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "111 min",
    "imdbRating": 7,
    "imdbVotes": 2506,
    "Genre": "Comedy, Drama",
    "Plot": "Victor Frandsen is a domestic tyrant. His wife Ida has to work as a slave for him and the rest of the family. She rises early to prepare everything for the day, she toils all day long, and she is often up also in the night, doing some sewing to earn extra money for the household. In daytime she is supported by an old woman called Mads, who was Victors' nanny when he was a child. Mads is filled with loathing for Victor's behavior towards his wife, and calls him a brute. She understands that Ida is on the verge of a serious breakdown, and persuades Ida's mother, Mrs. Kryer, to take Ida away. Mads will herself take care of the household and the children for a time. When Victor comes home and finds out that Ida is gone, he gets angry. He asks his daughter, Karen, where her mother is, but she refuses to tell him. She only says that her mother is very ill, and that it will be his fault if she dies. The accusation strikes Victor in his heart, and he sits down, feeling dejected. Karen consoles him, and tells him where her mother is. When Victor arrives at Mrs. Kryer's apartment, looking for his wife, the visiting doctor won't let him in. The doctor tells Victor that Ida has to take a complete rest in the countryside to get well. Victor returns home, broken-hearted, and is now willing to submit himself to Mads' new regime. Mads has become the master of the house, and Victor has to undergo her educational scheme. Step by step he learns to take an active part in the domestic work. Not until he is completely changed, will Mads and Mrs. Kryer let him meet Ida again.",
    "Director": "Carl Theodor Dreyer",
    "Writer": "Carl Theodor Dreyer, Svend Rindom",
    "Actors": "Johannes Meyer, Astrid Holm, Karin Nellemose",
    "Language": "Danish",
    "Country": "Denmark",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0011607",
    "tt0016028",
    "tt0016548",
    "tt0015663",
    "tt0016013",
    "tt0016241",
    "tt0016251",
    "tt0016051",
    "tt0016258",
    "tt0013169",
    "tt0017457",
    "tt0014646"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.409Z"
}