{
  "movieId": "tt0047437",
  "title": "Sabrina",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sabrina-1954",
      "id": "sabrina-1954",
      "title": "Sabrina (1954)",
      "description": "SABRINA ( Sabrina, 1954 - USA ) ( Filme Completo / Legendado em Português ) Data de Lançamento: 22 de Setembro de 1954 » SINOPSE: Dois irmãos pertencem à uma poderosa família, sendo um deles (Humphrey Bogart) é um empresário incansável e o outro (William Holden) é um playboy incorrigível. Mas quando a filha do motorista (Audrey Hepburn) retorna de viagem, após passar dois anos em Paris, o playboy se modifica e, como ela sempre foi apaixonada por ele, tudo seria muito fácil de acontecer. Mas se os dois se casarem um poderosa fusão deve ser prejudicada, assim o irmão empresário decide intervir e também acaba se apaixonando por ela. » » SOBRE O FILME: Bem mais essencial que uma certa coerência nas decisões e sentimentos das personagens, o que em \"Sabrina\" às vezes se confunde, é a essência de um romance cômico que Wilder estabelece entre seus protagonistas e nosso romance por eles também. Há uma série de interesses subentendidos nas atitudes de Linus e Sabrina que variam com frequência, levando a uma quantidade de reviravoltas consideráveis nos minutos finais do filme e uma conclusão para alguns inimaginável. Entretanto, \"Sabrina\" acaba por ser um ótimo exemplo de como a criação de um universo e uma encenação que estabelece essas regras, de um mundo ingênuo apaixonado nesse caso, é bem mais importante que outros detalhes.  . Chega a me lembrar \"The Big Sleep\" do Hawks, também com o Bogart, que estabelece uma unidade definidora do que é um noir e isso acaba sendo o suficiente para um filme memorável, independente da trama ser toda mal resolvida. Em \"Sabrina\", a inicial inocência da personagem de Hepburn que mesmo se tornando mais madura permanece com as mesmas idealizações de antes traz uma leveza e um jogo de incertezas sobre o que decidirá fazer que é o mais essencial no que Wilder buscava contar. A elegância de Bogart e a imaturidade de Holden fecham esse triângulo amoroso que gira em torno da personagem principal.  » » DIREÇÃO: Billy Wilder ROTEIRO: Billy Wilder, Samuel A. Taylor, Ernest Lehman GÊNERO: Comédia, Drama, Romance ORIGEM: USA DURAÇÃO: 1h 53min » » ELENCO PRINCIPAL: Humphrey Bogart ... Linus Larrabee Audrey Hepburn ... Sabrina Fairchild William Holden ... David Larrabee Walter Hampden ... Oliver Larrabee John Williams ... Thomas Fairchild Martha Hyer ... Elizabeth Tyson Joan Vohs ... Gretchen Van Horn Marcel Dalio ... Baron St. Fontanel Marcel Hillaire ... The Professor Nella Walker ... Maude Larrabee Francis X. Bushman ... Mr. Tyson Ellen Corby ... Miss McCardle",
      "fileSize": 5372250483,
      "addedAt": "2026-01-07T00:10:40.951Z",
      "thumbnail": "https://archive.org/services/img/sabrina-1954",
      "language": "eng",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 63066
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "113 min",
    "imdbRating": 7.6,
    "imdbVotes": 73444,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work -- busily running the family corporate empire with no time for a wife and family. David is all play -- technically employed in the family business but never showing up for work, spending all his time entertaining, and having been married and divorced three times. Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who has been infatuated with David all her life, but whom David hardly notices till she goes away to Paris for two years and returns an elegant, sophisticated, beautiful woman. Suddenly, she finds she's captured David's attention, but just as she does so, she finds herself also falling in love with Linus, and she finds that Linus is also falling in love with her.",
    "Director": "Billy Wilder",
    "Writer": "Billy Wilder, Samuel A. Taylor, Ernest Lehman",
    "Actors": "Humphrey Bogart, Audrey Hepburn, William Holden",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 7 wins & 8 nominations total"
  },
  "relatedMovies": [
    "tt0046359",
    "tt0048370",
    "tt0044000",
    "tt0054698",
    "tt0053291",
    "tt0046963",
    "tt0043651",
    "tt0043313",
    "tt0043526",
    "tt0199395",
    "tt0178749",
    "tt0051666"
  ],
  "collections": [
    {
      "id": "billy-wilder",
      "name": "Billy Wilder"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.951Z"
}