{
  "movieId": "tt0006803",
  "title": "His Bread and Butter",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-his-bread-and-butter",
      "id": "silent-his-bread-and-butter",
      "title": "His Bread and Butter",
      "fileSize": 379047398,
      "addedAt": "2026-01-07T00:10:59.119Z",
      "thumbnail": "https://archive.org/services/img/silent-his-bread-and-butter",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 248
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "20 min",
    "imdbRating": 6.5,
    "imdbVotes": 25,
    "Genre": "Short, Comedy",
    "Plot": "Hank Mann is a waiter in a restaurant run by \"Slim\" Summerville, who is about to hire a new cashier. Hank sees an opportunity to increase the family income and telephones to Peggy to apply for the place. She conceals the fact that she is married and obtains the job without difficulty. While she is receiving instructions from the boss in his office Hank is assigned to a private dining room which has been reserved for a party of three. The trio eat well and drink much, running up a large bill. During an opportune moment Hank goes to his employer's office and finds his wife dancing with \"Slim.\" In spite of his protests he is ordered back to his post. Back in the dining room Hank finds a lively argument as to who is to pay the check. It is suggested that the waiter choose the victim and in order to obtain a fair selection Hank is blindfolded. While he is groping about the customers sneak away. Summerville now holds the head waiter responsible and discharges him. In revenge, Dunn determines to win Peggy. From here on the complications are fast and furious. \"Slim\" loses most of his apparel in the scramble and is discovered hiding under Peggy's bed. Dragged out by Hank, he is bound to a keg of powder in a room on the upper floor of a garage. After lighting the fuse Hank flees downstairs only to find that the door is locked. There is a lot of excitement before he escapes and the picture ends with a real thrill.",
    "Director": "Edward F. Cline",
    "Writer": "N/A",
    "Actors": "Hank Mann, Peggy Pearce, Slim Summerville",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0017422",
    "tt0017706",
    "tt0006150",
    "tt0005475",
    "tt0005314",
    "tt0003961",
    "tt0004091",
    "tt0139488",
    "tt0006414",
    "tt0007194",
    "tt0006684",
    "tt0006764"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}