{
  "movieId": "tt0000357",
  "title": "The Haunted Curiosity Shop",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WalterRBoothTheHauntedCuriosityShop1901",
      "id": "WalterRBoothTheHauntedCuriosityShop1901",
      "title": "The Haunted Curiosity Shop",
      "description": "An old proprietor is startled by the sudden appearance of a skull. Just as he draws back from the uncanny object, the doors of a medieval wardrobe fly back and a hand prods him with a sword. He turns to confront his assailant when it vanishes, and at the same instant the skull flies to the other end of the room. He clutches at the skull, when it turns into the half form of a girl from the waist up, suspended in mid-air. As he gazes in amusement, the other half of the girl, fully dressed from her waist down, walks across the room, and the two halves of the figure join, making a girl complete. In an amorous fashion the old man folds his arms around the girl's waist with the intention of stealing a kiss, but the girl immediately changes into an old woman, who grins in evident delight at the old man's discomfort. In great anger he throws her into the wardrobe and locks the door. Unseen by him, the woman has again become a girl. A great effect is here produced. Through the doors, which are solid and closed, the form of the girl appears through the woodwork. Hastily opening the door, the old man is then confronted by an Egyptian mummy. Other strange things happen. As the pawnbroker flies from the room a large and grotesque head arises from the smoke and slowly advances toward the spectators. Larger and larger the head grows until it fills the entire picture, and appears as though it would swallow the whole audience. A most laughable and mystifying scene. http://www.imdb.com/title/tt0000357/",
      "fileSize": 6384401,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/WalterRBoothTheHauntedCuriosityShop1901",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 7341
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-haunted-curiosity-shop",
      "id": "silent-the-haunted-curiosity-shop",
      "title": "The Haunted Curiosity Shop",
      "fileSize": 34663851,
      "addedAt": "2026-01-07T00:11:15.976Z",
      "thumbnail": "https://archive.org/services/img/silent-the-haunted-curiosity-shop",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 407
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-haunted-curiosity-shop-1901-directed-by-walter-r.-booth",
      "id": "the-haunted-curiosity-shop-1901-directed-by-walter-r.-booth",
      "title": "The Haunted Curiosity Shop (1901) Directed By Walter R. Booth",
      "description": "The Haunted Curiosity Shop (1901) Director: Walter R. Booth The Haunted Curiosity Shop is a 1901 British silent horror trick film directed by Walter R. Booth, featuring an elderly curio dealer alarmed by various apparitions that appear in his shop. The film \"was clearly devised purely as a showcase for Booth and Paul's bag of tricks\", and according to Michael Brooke of BFI Screenonline, is \"an effective and engrossing experience\". - From Wikipedia",
      "fileSize": 7862654,
      "addedAt": "2026-01-07T00:12:10.587Z",
      "thumbnail": "https://archive.org/services/img/the-haunted-curiosity-shop-1901-directed-by-walter-r.-booth",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 109
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "2 min",
    "imdbRating": 5.8,
    "imdbVotes": 465,
    "Genre": "Short, Comedy, Fantasy",
    "Plot": "An old proprietor is startled by the sudden appearance of a skull. Just as he draws back from the uncanny object, the doors of a mediaeval wardrobe fly back and a hand prods him with a sword. He turns to confront his assailant when it vanishes, and at the same instant the skull flies to the other end of the room. He clutches at the skull, when it turns into the half form of a girl from the waist up, suspended in mid-air. As he gazes in amusement, the other half of the girl, fully dressed from her waist down, walks across the room, and the two halves of the figure join, making a girl complete. In an amorous fashion the old man folds his arms around the girl's waist with the intention of stealing a kiss, but the girl immediately changes into an old woman, who grins in evident delight at the old man's discomfort. In great anger he throws her into the wardrobe and locks the door. Unseen by him, the woman has again become a girl. A great effect is here produced. Through the doors, which are solid and closed, the form of the girl appears through the woodwork. Hastily opening the door, the old man is then confronted by an Egyptian mummy. Other strange things happen. As the pawnbroker flies from the room a large and grotesque head arises from the smoke and slowly advances toward the spectators. Larger and larger the head grows until it fills the entire picture, and appears as though it would swallow the whole audience. A most laughable and mystifying scene.",
    "Director": "Walter R. Booth",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0211928",
    "tt0000377",
    "tt0212596",
    "tt0212140",
    "tt0000370",
    "tt2627724",
    "tt0000340",
    "tt0000341",
    "tt0227536",
    "tt0231733",
    "tt0000346",
    "tt0360883"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.587Z"
}