{
  "movieId": "tt0030261",
  "title": "I'll Give a Million",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ill-give-a-million-1938-classic-film-noir-comedy",
      "id": "ill-give-a-million-1938-classic-film-noir-comedy",
      "title": "I'll Give A Million (1938 Classic, Film Noir, Comedy)",
      "description": "TAGLINE : ''The Laugh Riot of the Century!'' PLOT : After saving a tramp from suicide, a millionaire takes his clothing and disappears. Word is out that he will give a million francs to anyone who is kind to a tramp. _IMDb STORYLINE :  Wealthy Tony Newlander becomes disgusted with the fortune seekers around him. After saving a tramp from drowning, he takes his clothes and goes off to discover life among the real people. Only, a humorous twist of fate leads him to discover that most people have a bit of greed and lust for wealth in their hearts. But one who doesn't is a pleasant surprise. _IMDb by SimonJack IMDb User Review : Better Than Average Capraesque Film - I'll Give a Million (May 27, 2021 by arthur_tafero): In the heart of the Depression, moviegoers needed screwball comedies to cheer themselves up for a quarter. In that vein, they were heartily treated to some of the best comedy of all time from Laurel and Hardy to Frank Capra. This film is tn that tradition. Similar to Mr. Deeds Goes to Town and Sullivan's Travels in the sense that a powerful person is living as a common man among the masses of the poor, the film has a certain charm that is no longer found in films after the Golden Age of Hollywood. Fortunately, we have Youtube to access some of these gems from the past. Lots of fun. Good Remake Of A De Sica Starring vehicle (July 07, 2020 by boblipton): This Fox B remake of a a farce starring De Sica is nicely directed by Walter Lang with a sprawling supporting cast that the big studios' B departments could use when given the chance./ The story has millionaire Warner Baxter dive off his yacht to rescue suicidal Peter Lorre, then head off to deal with the real world instead of the parasites on board. Lorre spreads the word that a millionaire is wandering around in tramp clothes, and will give a million francs to anyone who is kind to him without any pecuniary interest. With a cast of dozens of character actors, this is an example of why I consider Fox' B movies in this period the best....and often better than most studios' As. TRIVIA : In September 1938, this film was distributed in some locations on a double bill with ''Billy the Kid Returns'' starring Roy Rogers. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothin g for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh ** (Ty Mia B.)",
      "fileSize": 342657812,
      "addedAt": "2026-01-07T00:08:46.616Z",
      "thumbnail": "https://archive.org/services/img/ill-give-a-million-1938-classic-film-noir-comedy",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 4770
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": 6.5,
    "imdbVotes": 238,
    "Genre": "Comedy, Crime, Drama",
    "Plot": "Wealthy Tony Newlander becomes disgusted with the fortune seekers around him. After saving a tramp from drowning, he takes his clothes and goes off to discover life among the real people. Only, a humorous twist of fate leads him to discover that most people have a bit of greed and lust for wealth in their hearts. But one who doesn't is a pleasant surprise.",
    "Director": "Walter Lang",
    "Writer": "Boris Ingster, Giaci Mondaini, Milton Sperling",
    "Actors": "Warner Baxter, Marjorie Weaver, Peter Lorre",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033923",
    "tt0031490",
    "tt0033062",
    "tt0029670",
    "tt0028774",
    "tt0028748",
    "tt0028346",
    "tt0032343",
    "tt0029199",
    "tt0027501",
    "tt0032609",
    "tt0032620"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.616Z"
}