{
  "movieId": "tt0045935",
  "title": "Gate of Hell",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gate-of-hell",
      "id": "gate-of-hell",
      "title": "Gate Of Hell",
      "description": "A winner of Academy Awards for best foreign-language film and best costume design,  Gate of Hell  is a visually sumptuous, psychologically penetrating work from Teinosuke Kinugasa. In the midst of epic, violent intrigue in twelfth-century Japan, an imperial warrior falls for a lady-in-waiting; after he discovers she is married, he becomes frenzied in his attempts to win her love. Kinugasa’s film, an early triumph of color cinematography in Japan, is an unforgettable, tragic story of obsession and unrequited passion.",
      "fileSize": 7297090107,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/gate-of-hell",
      "language": "jpn",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 10043
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "89 min",
    "imdbRating": 7.1,
    "imdbVotes": 4674,
    "Genre": "Drama, History",
    "Plot": "In 1160, in the Heian Period, Lord Kiyomori travels with his court to another feud and his Castle Sanjo is invaded by two other lords, in a coup. The loyal samurai Moritoh Enda asks the court lady Kesa to pose of the lord's sister to create a diversion while the lord's real sister and his father flee in the middle of the people. Then Moritoh travels to meet Lord Kiyomon and fights with him to defeat the enemies and the coup fails. Lord Kiyomon rewards the warriors that helped him and when he asks Moritoh what he wishes, he requests to marry Kesa. The lord grants his wish but soon he learns that Kesa is married with Wataru Watanabe, a samurai from the imperial guard. Moritoh harasses Kesa and threatens her, promising to kill her husband, her aunt and her if she does not marry him. Kesa's decision leads the trio to a tragic fate.",
    "Director": "Teinosuke Kinugasa",
    "Writer": "Kan Kikuchi, Teinosuke Kinugasa, Masaichi Nagata",
    "Actors": "Machiko Kyô, Kazuo Hasegawa, Isao Yamagata",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "Won 1 Oscar. 8 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0045473",
    "tt0046029",
    "tt0046269",
    "tt0046051",
    "tt0045487",
    "tt0044400",
    "tt0044418",
    "tt0047443",
    "tt0178536",
    "tt0254632",
    "tt0045039",
    "tt0046731"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "martial-arts",
      "name": "Martial Arts"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.017Z"
}