{
  "imdbId": "tt0015772",
  "title": "The Eagle",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheEagle720p1925",
      "title": "TheEagle720p1925",
      "description": "Title: The Eagle Summary: A wanted Russian lieutenant becomes a masked vigilante seeking vengeance upon the man who stole his family's land, only to fall for his charming daughter. Directed by: Clarence Brown Actors: Rudolph Valentino, Vilma Bánky, Louise Dresser Production Company: Art Finance Corporation Release Date: 8 November 1925 (USA) Aspect Ratio: 1.33 : 1 Vladimir Dubrouvsky, a lieutenant in the Russian army, catches the eye of Czarina Catherine II. He spurns her advances and flees, and she puts out a warrant for his arrest, dead or alive. Vladimir learns that his father's lands have been taken by the evil Kyrilla Troekouroff, and his father dies. He dons a black mask, and becomes the outlaw The Black Eagle. He enters the Troekouroff household disguised as a French instructor for Kyrilla's daughter Mascha. He is after vengeance, but instead falls in love with Mascha.",
      "id": "TheEagle720p1925"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=I0rB4IHuTzs",
      "title": "The Eagle (1925) | Colorized Public Domain Silent Adventure Romance with Rudolph Valentino",
      "description": "The Eagle (1925) is a silent adventure romance directed by Clarence Brown and starring the iconic screen legend Rudolph Valentino in one of his most memorable roles. This restored and colorized version brings new vibrancy to a film that once captivated audiences during the peak of the silent era. Originally produced by United Artists, the film adapts Alexander Pushkin’s novel The Captain’s Daughter into a swashbuckling tale of love, revenge, and identity. Colorized Public Domain now revives this classic for modern audiences in the United States, Europe, and worldwide, ensuring its enduring legacy continues.\n\nPlot Summary:\nRudolph Valentino stars as Lieutenant Vladimir Dubrovsky, a dashing officer in the Russian Imperial Guard. When he catches the eye of Catherine the Great, he rejects her advances, setting into motion his downfall. Stripped of his position and title, Vladimir learns that his family estate has been stolen by a corrupt nobleman, Kyrilla Troekouroff. Driven by honor and vengeance, he dons a mask and takes on the persona of The Black Eagle, a Robin Hood-like outlaw who fights against injustice and tyranny.\n\nIn his quest, Vladimir falls in love with Mascha, the daughter of his sworn enemy. Their romance complicates his mission, forcing him to choose between revenge and the possibility of love. The film climaxes with daring action, tense confrontations, and Valentino’s magnetic screen presence, proving why he was regarded as the “Latin Lover” of Hollywood.\n\nCast and Crew:\n• Director: Clarence Brown\n• Producers: John W. Considine Jr., Joseph M. Schenck\n• Based on: The Captain’s Daughter by Alexander Pushkin\n• Cinematography: George Barnes\n• Editing: Hal C. Kern\nStarring:\n• Rudolph Valentino as Lieutenant Vladimir Dubrovsky / The Black Eagle\n• Vilma Bánky as Mascha Troekouroff\n• Louise Dresser as Catherine the Great\n• James A. Marcus as Kyrilla Troekouroff\n• George Nichols as Dubrovsky’s father\n• Albert Conti as Dubrovsky’s friend\n\nFilm Significance:\nThe Eagle represents one of Valentino’s last completed films before his tragic death in 1926. Released at the height of his fame, it combines elements of swashbuckling adventure with romance, giving audiences both spectacle and emotion. Directed by Clarence Brown, who would later become one of MGM’s top directors, the film showcases early Hollywood’s ability to adapt European literature for American audiences. Valentino’s performance remains central, cementing him as one of cinema’s earliest international superstars.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Eagle remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1925 release was a silent black-and-white feature. While powerful in its day, many modern viewers — particularly those watching on TV and digital platforms — are less inclined to watch silent films. By colorizing The Eagle, we make this classic not only historically relevant but also visually engaging for a new generation. For older audiences in the United States and Europe, the film offers nostalgia and a chance to revisit Valentino’s legendary charm, while new viewers can experience the allure of silent-era storytelling with modern accessibility.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including silent-era gems, forgotten adventures, and culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences worldwide.\n\n#TheEagle1925 #RudolphValentino #SilentFilm #PublicDomainMovie #ColorizedClassic #SilentCinema #1920sMovies #ClassicAdventure #FilmRestoration #RomanticDrama",
      "id": "I0rB4IHuTzs",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-eagle",
      "title": "The Eagle",
      "id": "silent-the-eagle"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-eagle-1925_202505",
      "title": "The Eagle (1925)",
      "description": "Vladimir Dubrouvsky, a lieutenant in the Russian army, catches the eye of Czarina Catherine II. He spurns her advances and flees, and she puts out a warrant for his arrest, dead or alive. Vladimir learns that his father's lands have been taken by the evil Kyrilla Troekouroff, and his father dies. He dons a black mask, and becomes the outlaw The Black Eagle. He enters the Troekouroff household disguised as a French instructor for Kyrilla's daughter Mascha. He is after vengeance, but instead falls in love with Mascha. Watch on RetroFlix:  https://retroflix.org/the-eagle-1925/",
      "id": "the-eagle-1925_202505"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the_eagle",
      "title": "The Eagle",
      "id": "the_eagle"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theeagle4k",
      "title": "The Eagle (1925) [Colorized, 4K, 60FPS]",
      "description": "The Eagle is a 1925 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com    Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io    A.I. Upscaling to 4K:  https://ffmpeg.org    GPU: Google Colab.  This movie is in public domain category and it is Copyright free.",
      "id": "theeagle4k"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "73 min",
    "imdbRating": "6.6",
    "imdbVotes": "2,212",
    "Genre": "Action, Adventure, Comedy",
    "Plot": "Vladimir Dubrouvsky, a lieutenant in the Russian army, catches the eye of Czarina Catherine II. He spurns her advances and flees, and she puts out a warrant for his arrest, dead or alive. Vladimir learns that his father's lands have been taken by the evil Kyrilla Troekouroff, and his father dies. He dons a black mask, and becomes the outlaw The Black Eagle. He enters the Troekouroff household disguised as a French instructor for Kyrilla's daughter Mascha. He is after vengeance, but instead falls in love with Mascha.",
    "Director": "Clarence Brown",
    "Writer": "Alexander Pushkin, George Marion Jr., Hanns Kräly",
    "Actors": "Rudolph Valentino, Vilma Bánky, Louise Dresser",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0019489",
      "title": "The Trail of '98",
      "year": 1928,
      "imdbRating": "7.0",
      "imdbVotes": "457",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017925",
      "title": "The General",
      "year": 1926,
      "imdbRating": "8.1",
      "imdbVotes": "104,099",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015163",
      "title": "The Navigator",
      "year": 1924,
      "imdbRating": "7.5",
      "imdbVotes": "11,273",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018937",
      "title": "A Girl in Every Port",
      "year": 1928,
      "imdbRating": "6.5",
      "imdbVotes": "864",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013674",
      "title": "The Three Must-Get-Theres",
      "year": 1922,
      "imdbRating": "6.9",
      "imdbVotes": "645",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019987",
      "title": "His First Command",
      "year": 1929,
      "imdbRating": "5.9",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012642",
      "title": "A Sailor-Made Man",
      "year": 1921,
      "imdbRating": "6.8",
      "imdbVotes": "1,285",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023243",
      "title": "Mr. Robinson Crusoe",
      "year": 1932,
      "imdbRating": "5.5",
      "imdbVotes": "520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041098",
      "title": "Africa Screams",
      "year": 1949,
      "imdbRating": "6.0",
      "imdbVotes": "4,134",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046414",
      "title": "Beat the Devil",
      "year": 1953,
      "imdbRating": "6.4",
      "imdbVotes": "10,677",
      "language": "Arabic, English, Italian",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0066565",
      "title": "White Sun of the Desert",
      "year": 1970,
      "imdbRating": "7.7",
      "imdbVotes": "8,323",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0039133",
      "title": "Adventure Island",
      "year": 1947,
      "imdbRating": "4.7",
      "imdbVotes": "219",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T21:51:39.239Z"
}