{
  "movieId": "tt0039737",
  "title": "Pursued",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pursued-1947",
      "id": "pursued-1947",
      "title": "Pursued (1947) Robert Mitchum, Teresa Wright, Judith Anderson, Dean Jagger",
      "description": "Pursued is a 1947 American Western FILM NOlR. The picture was directed by Raoul Walsh and features Robert Mitchum, Teresa Wright, Judith Anderson, Dean Jagger, Alan Hale Sr. and Harry Carey Jr. The music is by Max Steiner and the cinematographer is James Wong Howe.   You can find out more about this movie from Wikipedia . There is also a good review of the movie here from the movie blog Senses of Cinema .  ",
      "fileSize": 933727903,
      "addedAt": "2026-01-07T00:10:21.540Z",
      "thumbnail": "https://archive.org/services/img/pursued-1947",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 8727
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pursued-1947-legendado",
      "id": "pursued-1947-legendado",
      "title": "Pursued (1947)",
      "description": "Pursued (1947) ",
      "fileSize": 1252669493,
      "addedAt": "2026-01-07T00:10:21.540Z",
      "thumbnail": "https://archive.org/services/img/pursued-1947-legendado",
      "collection": "feature_films",
      "downloads": 1429
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "101 min",
    "imdbRating": 7.2,
    "imdbVotes": 3980,
    "Genre": "Western",
    "Plot": "After his family is murdered in the 1880s, orphan Jeb Rand (Robert Mitchum) is raised by the Callum family on their nearby horse ranch. He remains haunted by this childhood trauma in a recurring nightmare of flashing spurs and confinement inside a trap door as his family is slaughtered. Widow Callum (Dame Judith Anderson) does her best to make Jeb feel loved as he is growing up, but the young man stubbornly maintains a sense of his own identity. While he has great affection for his foster-sister Thor (Teresa Wright), his relationship with her brother Adam (John Rodney) is tenuous at best, especially when Jeb blames him for shooting a colt that he was riding. Although Mrs. Callum blames the incident on deer hunters, she is aware that the it was actually the attempted murder of the youngster by her brother-in-law Grant (Dean Jagger), a shadowy figure who, for vague reasons, is determined to harm Jeb. Jeb loses a coin flip with Adam, and becomes the designated family volunteer to fight in the Spanish-American War. Jeb returns a hero, but does not find happiness. Although Thor loves him, Adam is resentful about sharing the farm's profits, and the omnipresent, enigmatic Grant remains at the fringes of Jeb's life, waiting for a chance to revenge himself on the young man in some mysterious vendetta as Jeb continues trying to exorcise his demons.",
    "Director": "Raoul Walsh",
    "Writer": "Niven Busch",
    "Actors": "Teresa Wright, Robert Mitchum, Judith Anderson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043276",
    "tt0048691",
    "tt0037954",
    "tt0039157",
    "tt0039181",
    "tt0039441",
    "tt0039559",
    "tt0127666",
    "tt0039678",
    "tt0039861",
    "tt0039993",
    "tt0039152"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.540Z"
}