{
  "movieId": "tt0076630",
  "title": "Rituals",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Rituals_1977",
      "id": "Rituals_1977",
      "title": "Rituals",
      "description": "Also known as \"The Creeper\". A low-budget but powerful Canadian/U.S. film starring Hal Holbrook. Five physicians on a fishing trip are dropped off by a pontoon-airplane in the middle of a wilderness, where they soon find themselves stalked by a merciless madman.",
      "fileSize": 1545453553,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/Rituals_1977",
      "year": 1977,
      "collection": "feature_films",
      "downloads": 67147
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Rituals1977",
      "id": "Rituals1977",
      "title": "Rituals ( 1977) upgrade",
      "description": "Also known as \"The Creeper.\" This higher-quality version includes all of the opening credits, and has a runtime of about 1:36. The other copy in the Archive run around 1:29. Just for fun, i have included an image of an advertisement for the movie. A large file, but half the size of the source material. \"Five doctors go on vacation deep in the Canadian wilderness. After all but one pair of the party's shoes disappear, the remaining shoed camper decides to hike out and go look for help. Soon after he leaves, however, his four companions realizes that something is very wrong when someone leaves a decapitated deer head just outside their camp. Even though they still don't have their shoes, they decide to follow their friend's trail out of the woods, but their path is blocked by someone who doesn't want to see them leave the forest alive.\"",
      "fileSize": 2500942514,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/Rituals1977",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 9500
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "100 min",
    "imdbRating": 6.2,
    "imdbVotes": 2997,
    "Genre": "Adventure, Horror, Thriller",
    "Plot": "A group of doctors go on a camping trip in the deep forests. There they have fun. They brag about each other's fields n at the same time their conversations revolve mostly around medical malpractices, unethical surgeries n they even mock patients except for Harry (Hal Holbrook). Unaware to them, a stalker has been hearing their conversations. Now the place they had gone is in the middle of nowhere according to their pilot who dropped em earlier. So it seems our stalker might be not just another ordinary citizen. Later the doctors realize that their boots are stolen n someone has left a deer carcass on a stick with a snake around it, the symbol similar to the Staff of Aesculapius, the symbol for the American Medical Association. So this confirms us that the stalker is aware of the doctor's history from overhearing their conversations. The stalker leaves x-ray taken from a military hospital, medals n discharge papers, a message meant for doctors with callous attitudes regarding their trade. The doctors soon realize they are being hunted by an ex army person who first wants to degrade them before killing them but our Harry, a war veteran himself, won't let the madman enjoy their degradation.",
    "Director": "Peter Carter",
    "Writer": "Ian Sutherland",
    "Actors": "Hal Holbrook, Lawrence Dane, Robin Gammell",
    "Language": "English",
    "Country": "Canada",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0112747",
    "tt1094162",
    "tt0221905",
    "tt0426556",
    "tt0118912",
    "tt21097864",
    "tt0339236",
    "tt2306511",
    "tt1183733",
    "tt2130142",
    "tt4943934",
    "tt6874406"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:24:52.650Z"
}