{
  "imdbId": "tt0043920",
  "title": "Pier 23",
  "year": 1951,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TyEWHs5Nhe4",
      "id": "TyEWHs5Nhe4",
      "title": "Pier 23 (1951) Mystery, Film-Noir | Directed by William Berke | Colorized (with subtitles)",
      "description": "Framed for Murder, Seeking Justice!\nPrivate detective finds himself framed for the murders of a wrestler and a crooked referee, then for the murder of a mystery man posing as a new parolee from Alcatraz. He's a cop's pet peeve... and a gal's pet passion!\n\n\nOriginal Black & White version: https://youtu.be/X1H8R1xnKog\n\n\nOriginal title:  Pier 23 (1951) AKA: Flesh and Leather\nMany subtitle languages available for this movie\n\nDirector: William Berke\nWriters: Herb Margolis, Lou Morheim, Julian Harmon\nStars: Hugh Beaumont, Ann Savage, Edward Brophy\nGenres:  Drama, Film-Noir, Mystery, Sport\n\n\n00:00 Full Movie (with subtitles)\n00:56 Mysterious events unfold as a priest is approached to prevent a potential escape from Alcatraz.\n05:24 Mysterious encounter leads to a mission involving Joe Harmon and Father Donovan at Pier 23.\n10:45 Investigator uncovers deception and murder in a mysterious case involving a fake identity and a nightclub incident.\n14:45 Investigating a mysterious case involving Joe Harmon, Bruger, and a hotel room, leading to a dangerous encounter at Nubian Club.\n18:29 Mysterious events unfold at Nubian club involving Joe Harmon, Mike Greeley, and Norma. Detective investigates the case.\n23:13 Investigator Bruger receives information about Joe Harmon's whereabouts and involvement in a crime from various sources.\n28:48 Mysterious events unfold at Pier 23, involving characters like O'Brien, Giffen, and Norma.\n32:14 Mysterious interactions at a wrestling event lead to a deadly outcome and a change of plans.\n37:37 Investigating a mysterious case involving a missing girl, bribery, and a trained monkey at Pier 23.\n42:04 Mystery unfolds as characters investigate the death of Willie Klingle and uncover suspicious motives.\n46:00 Investigation into a murder case involving Klingle's death and the possible suspects unfolds at Pier 23.\n50:20 Mystery unfolds as characters navigate through deceit, betrayal, and hidden motives in a film noir.\n55:20 Analysis of a complex plot involving deceit, betrayal, and murder in a film-noir setting.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:26.655Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/TyEWHs5Nhe4/maxresdefault.webp",
      "duration": 3478,
      "language": "en",
      "year": 1951,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 5.5,
    "imdbVotes": 130,
    "Genre": "Drama, Film-Noir, Mystery",
    "Plot": "In the first of two separate stories, Private-Detective Dennis O'Brien becomes involved with a gang that uses a rigged wrestling match as a means for murder. In the second story O'Brien tries to discourage a convict from making an escape-attempt from Alcatraz. Later O'Brien mistakes another man for the convict, and winds up charged with a murder.",
    "Director": "William Berke",
    "Writer": "Herb Margolis, Lou Morheim, Julian Harmon",
    "Actors": "Hugh Beaumont, Ann Savage, Edward Brophy",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043516",
    "tt0043975",
    "tt0041986",
    "tt0042593",
    "tt0044013",
    "tt0044557",
    "tt0039820",
    "tt0041959",
    "tt0045669",
    "tt0041133",
    "tt0036743",
    "tt0051489"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:38:16.336Z"
}