{
  "movieId": "tt0049030",
  "title": "The Brave One",
  "year": 1956,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RI_dXneWm6I",
      "id": "RI_dXneWm6I",
      "title": "The Brave One (1956) OSCAR WINNER 4 BEST STORY",
      "description": "Following YouTube guidelines, this movie must be set as \"made for kids” since its star MICHEL REY was under the age of 13 when it was filmed. As such, comments are disabled by YouTube.\nDirector: Irving Rapper\nStarring: Michel Ray, Rodolfo Hoyos Jr., Elsa Cárdenas\n\nAn emotional and touching story about a boy’s love for the pet bull he rescued as a calf. This incredibly heart-warming family film won the Academy Award for Best Motion Picture Story and features a stirring score by Victor Young.\n\nTrivia: There is much controversy surrounding the author of the original story, but it has generally been determined that Dalton Trumbo finished the final screenplay.",
      "addedAt": "2025-12-24T01:09:06.620Z",
      "thumbnail": "https://i.ytimg.com/vi/RI_dXneWm6I/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBQ4FcSer0eJU6SL0icXMvbe6Gu_g",
      "duration": 6008,
      "language": "en",
      "year": 1956,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "100 min",
    "imdbRating": 6.5,
    "imdbVotes": 1208,
    "Genre": "Drama, Family",
    "Plot": "The Brave One is a bull named Gitano (Gypsy). A Mexican boy, Michael Ray, \"adopts\" Gitano after saving the animal's life during a storm. The friendship between bull and boy is threatened when Gitano's legal owners claim the animal and ship him off to the bullring. Moved by the boy's plight, the President of Mexico signs a \"pardon\" for Gitano--but not soon enough to prevent the bull's appearance at the Plaze de Mexico at Mexico City, where he faces top matador Fermin Rivera. Based on a true incident, the film earned a \"best story\" Academy Award for one Robert Rich--who, much to the embarrassment of the Academy (and the delight of civil libertarians), turned out to be blacklisted screenwriter Dalton Trumbo.",
    "Director": "Irving Rapper",
    "Writer": "Robert Rich, Harry S. Franklin, Merrill G. White",
    "Actors": "Michel Ray, Rodolfo Hoyos Jr., Elsa Cárdenas",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 1 win & 3 nominations total"
  },
  "relatedMovies": [
    "tt0179672",
    "tt0168645",
    "tt1727546",
    "tt0046672",
    "tt0046799",
    "tt0051936",
    "tt0201413",
    "tt0046965",
    "tt0041125",
    "tt0044364",
    "tt0036582",
    "tt0053134"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:40:36.330Z"
}