{
  "imdbId": "tt0017765",
  "title": "College",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/College_201405",
      "id": "College_201405",
      "title": "Buster Keaton's \"College\" (1927)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"College\" (1927) is a classic comedy, included in our program to illustrate the work and contributions of our stars Florence Turner and Snitz Edwards. A young man with no appreciation for sports goes to college to be close to his love interest, but he must become an athlete and prove to her that he is not a weakling. Directed by               James W. Horne and Buster Keaton Produced by             Joseph Schenck Scenario by               Bryan Foy, Carl Harbaugh           Starring                     Buster Keaton, Anne Cornwall, Harold Goodwin, Snitz Edwards, Florence Turner Cinematography        Bert Haines, Dev Jennings Distributed by           United Artists Release date               September 1927 Running time             65 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 834493316,
      "addedAt": "2026-01-07T00:06:19.367Z",
      "thumbnail": "https://archive.org/services/img/College_201405",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 23414
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/college",
      "id": "college",
      "title": "College",
      "description": "Buster Keaton goes to college and trys to master sports ... all or any of them.",
      "fileSize": 2523260391,
      "addedAt": "2026-01-07T00:07:51.624Z",
      "thumbnail": "https://archive.org/services/img/college",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 48183
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/college-keaton-and-horne-1927-high-quality-1080p-v-6xxc-0bli-wc",
      "id": "college-keaton-and-horne-1927-high-quality-1080p-v-6xxc-0bli-wc",
      "title": "College (1927) HD with Score",
      "description": "Brilliant in his studies and dismissive of athletics, Ronald finishes high school at the top of his class. But in college his uptight attitude doesn't win him any points with his sports-loving classmates, and pretty coed Mary ignores him in favor of brutish jock Jeff. Hoping to impress Mary, Ronald makes a buffoon of himself at every sport imaginable.",
      "fileSize": 3437809838,
      "addedAt": "2026-01-07T00:07:51.624Z",
      "thumbnail": "https://archive.org/services/img/college-keaton-and-horne-1927-high-quality-1080p-v-6xxc-0bli-wc",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 2560
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/college_1927",
      "id": "college_1927",
      "title": "College",
      "fileSize": 5203227725,
      "addedAt": "2026-01-07T00:07:51.624Z",
      "thumbnail": "https://archive.org/services/img/college_1927",
      "language": "English",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 294
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=C8GUepfhIyA",
      "id": "C8GUepfhIyA",
      "title": "College (1927) | Colorized Public Domain Silent Comedy Classic with Buster Keaton and Anne Cornwall",
      "description": "College (1927) is a silent comedy classic directed by James W. Horne and starring Buster Keaton at the height of his creative powers. This colorized and restored edition of the public domain film revives one of Keaton’s most entertaining works, blending physical comedy, satire, and romance. By enhancing the film with modern digital techniques, Colorized Public Domain ensures that today’s audiences in the United States, Europe, and beyond can rediscover this timeless gem in vivid detail.\n\nPlot Summary:\nThe story follows Ronald (Buster Keaton), a brilliant but socially awkward young man who graduates as valedictorian of his high school. Obsessed with academics, Ronald dismisses athletics and mocks sports as unimportant. However, his disdain costs him the admiration of Mary (Anne Cornwall), the girl he loves, who values a well-rounded partner. Determined to win her back, Ronald enrolls in college and attempts to transform himself into an athlete.\n\nIn a series of comedic sequences, Ronald struggles to master baseball, track, football, rowing, and even weightlifting, failing miserably at each. His attempts are clumsy but hilarious, showcasing Keaton’s unmatched skill in physical comedy and deadpan delivery. As Mary grows closer to rival suitor Jeff Brown (Harold Goodwin), Ronald realizes that winning her affection requires more than bravado. The climax comes during a high-stakes athletic competition, where Ronald rises to the occasion and proves himself not just as a scholar but as someone with courage and determination.\n\nCast and Crew:\n• Director: James W. Horne\n• Co-Director: Buster Keaton\n• Screenplay: Carl Harbaugh\n• Cinematography: Bert Haines and Devereaux Jennings\n• Editing: Buster Keaton Productions\n\nStarring:\n• Buster Keaton as Ronald\n• Anne Cornwall as Mary Haynes\n• Harold Goodwin as Jeff Brown\n• Flora Bramley as Co-Ed\n• Snitz Edwards as The Dean\n• Carl Harbaugh as Student\n\nFilm Significance:\nCollege stands as one of the great silent comedies of the 1920s and a showcase of Keaton’s physical inventiveness. Released just before the transition to sound films, it reflects both the charm and challenges of the late silent era. Unlike some of Keaton’s grand-scale features, College is set in the relatable environment of campus life, blending everyday romance with exaggerated physical gags. For modern audiences, the film provides a window into 1920s American college culture, where sports, youth ambition, and personal transformation were central themes. Its comedic influence continues to echo in later Hollywood films that combine athletics and romance.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like College remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1927 release was a black-and-white silent feature typical of the era. While authentic to its time, silent black-and-white films are often overlooked by modern audiences. By colorizing and restoring College, we bridge the gap between preservation and accessibility, ensuring Buster Keaton’s brilliance reaches new viewers while preserving his legacy for those who appreciate classic film history.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#College1927 #BusterKeaton #SilentFilm #PublicDomainMovie #ColorizedClassic #SilentComedy #FilmRestoration #1920sCinema #ClassicHollywood #CollegeMovie",
      "addedAt": "2025-12-24T00:48:53.289Z",
      "thumbnail": "https://i.ytimg.com/vi/C8GUepfhIyA/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYSyBlKEMwDw==&rs=AOn4CLBLqksowsyBsD30cWLbuFDCwbQTIw",
      "duration": 3852,
      "language": "en",
      "year": 1927,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "66 min",
    "imdbRating": 6.9,
    "imdbVotes": 5578,
    "Genre": "Comedy, Drama, Sport",
    "Plot": "Ronald's high school valedictory address praises books and condemns sports. His girlfriend Mary condemns his attitude. He fears losing her to rival Jeff, decides to go to college and pay more attention to sports.",
    "Director": "James W. Horne, Buster Keaton",
    "Writer": "Carl Harbaugh, Bryan Foy",
    "Actors": "Buster Keaton, Anne Cornwall, Flora Bramley",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0019421",
    "tt0018742",
    "tt0016630",
    "tt0035089",
    "tt0033144",
    "tt0010635",
    "tt0019339",
    "tt0017750",
    "tt0251415",
    "tt0017886",
    "tt2464690",
    "tt0018297"
  ],
  "collections": [
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.624Z"
}