{
  "imdbId": "tt0004457",
  "title": "The Patchwork Girl of Oz",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PatchworkGirlOfOz",
      "id": "PatchworkGirlOfOz",
      "title": "Patchwork Girl Of Oz",
      "description": "This has fallen into the Public Domain.",
      "fileSize": 986391283,
      "addedAt": "2026-01-07T00:06:45.466Z",
      "thumbnail": "https://archive.org/services/img/PatchworkGirlOfOz",
      "collection": "feature_films",
      "downloads": 753
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PatchworkOZ",
      "id": "PatchworkOZ",
      "title": "The Patchwork Girl of Oz",
      "description": "L Frank Baum's film of his fairy tale \"The Patchwork Girl of Oz\" Violet MacMillan...Ojo, a Munchkin Boy Frank Moore...Unc Nunkie, Ojo's Guardian Raymond Russell...Dr. Pipt, the Crooked Magician Leontine Dranet...Margolotte, his wife, who makes the Patchwork Girl Bobbie Gould...Jesseva, his daughter, betrothed to Danx Marie Wayne...Jinjur, a Maid in the Emerald City Richard Rosson...Danx, a Noble Munchkin (as Dick Rosson) Frank Bristol...The Soldier with the Green Whiskers (Omby Amby) Fred Woodward...The Woozy, a Quaintness / The Zoop, A Mystery / Mewel, who is Everybody's Friend Todd Wright...The Wizard of Oz Bert Glennon...The Scarecrow (as Herbert Glennon) Hal Roach...The Cowardly Lion / Tottenhot (as Al Roach) Andy Anderson...The Hungry Tiger Jessie May Walsh...Ozma of Oz, the Ruler of the Emerald City William Cook...The Royal Chamberlain Produced by L Frank Baum Directed by J Farrell MacDonald",
      "fileSize": 1173024897,
      "addedAt": "2026-01-07T00:06:45.466Z",
      "thumbnail": "https://archive.org/services/img/PatchworkOZ",
      "language": "English",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 29670
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-patchwork-girl-of-oz",
      "id": "silent-the-patchwork-girl-of-oz",
      "title": "The Patchwork Girl of Oz",
      "fileSize": 967848426,
      "addedAt": "2026-01-07T00:11:24.923Z",
      "thumbnail": "https://archive.org/services/img/silent-the-patchwork-girl-of-oz",
      "language": "English",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 581
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-patchwork-girl-of-oz-1914-directed-by-j.-farrell-mac-donald",
      "id": "the-patchwork-girl-of-oz-1914-directed-by-j.-farrell-mac-donald",
      "title": "The Patchwork Girl Of Oz (1914) Directed By J. Farrell MacDonald",
      "description": "The Patchwork Girl of Oz Directed by J. Farrell MacDonald Written by L. Frank Baum Based on The Patchwork Girl of Oz by L. Frank Baum Produced by L. Frank Baum Louis F. Gottschalk Thomas Edison Starring Violet MacMillan Frank Moore Pierre Couderc Fred Woodward Raymond Russell Dick Rosson Cinematography James A. Crosby Music by Louis F. Gottschalk Production company The Oz Film Manufacturing Company Distributed by Paramount Pictures Release date September 28, 1914 Running time 81 minutes Country United States Languages Silent English intertitles The Patchwork Girl of Oz (1914) is a silent film made by L. Frank Baum 's The Oz Film Manufacturing Company . It was based on the 1913 book The Patchwork Girl of Oz . [ 1 ] The film was written and produced by L. Frank Baum and directed by J. Farrell MacDonald . It makes almost no use of the dialogue from the book in the intertitles . While there are a number of modest special effects, the movie relies largely on dancing (or rather cavorting), slapstick, and costuming. The Patchwork Girl uses acrobatics regularly. Dr. Pipt's daughter is added for love interest, as well as an additional plot thread: her boyfriend is turned into a small statue which women find irresistible. The plot omits the Glass Cat, the Shaggy Man, Dorothy, Mr. Yoop, The Lazy Quadling, and the phonograph, but also adds Mewel, a donkey, and \"The Lonesome Zoop\", both slapstick animals, as well as Jinjur, Jesseva and Danx, and Jesseva's friends. The film was followed by The Magic Cloak of Oz and His Majesty, the Scarecrow of Oz . [ 2 ] Plot Ojo and Unc Nunkie are out of food, so they decide to journey to the Emerald City where they will never starve. Along the way, they meet Mewel, a waif and stray (mule) who leads them to Dr. Pipt, who has been stirring the powder of life for nine years. Ojo adds plenty of brains to Margolotte’s Patchwork servant before she is brought to life with the powder. When Scraps does come to life, she accidentally knocks the liquid of petrifaction upon Unc Nunkie, Margolotte, and Danx (daughter Jesseva’s boyfriend). So all go on separate journeys to find the ingredients to the antidote. Cast Credited cast Violet MacMillan - Ojo , a Munchkin Boy Frank Moore - Unc Nunkie , Ojo's Guardian Raymond Russell - Dr. Pipt , the Crooked Magician Leontine Dranet - Margolotte, his wife, who makes the Patchwork Girl Bobbie Gould - Jesseva, his daughter, betrothed to Danx Marie Wayne - Jinjur , a Maid in the Emerald City Dick Rosson - Danx, a Noble Munchkin Frank Bristol - The Soldier with the Green Whiskers (Omby Amby) Fred Woodward - The Woozy , a Quaintness / The Zoop, A Mystery / Mewel, who is Everybody's Friend Todd Wright - The Wizard of Oz Bert Glennon - The Scarecrow (as Herbert Glennon) Hal Roach - The Cowardly Lion / Tottenhot Andy Anderson - The Hungry Tiger Jessie May Walsh - Ozma of Oz, the Ruler of the Emerald City William Cook - The Royal Chamberlain Ben Deeley - Rozyn, the Village Fiddler Lon Musgrave - The Tin Woodman Pierre Couderc - Scraps, the Patchwork Girl (as The Marvelous Couderc) Additional cast Vivian Reed - Ozma head logo (uncredited) Juanita Hansen - Bell Ringer (uncredited) Harold Lloyd - Tottenhot on the Jury (uncredited) Jacqueline Lovell - Narrator (1996 version) (voice) Production Much of the film was shot on the grounds of the Panama-California Exposition in San Diego. Other scenes were presumably filmed at The Oz Film Manufacturing Company 's studio facilities in Los Angeles, located on Santa Monica Boulevard. Notable cast members, one uncredited, were future producer/director Hal Roach and comedian Harold Lloyd . The two of them, after meeting on this film, worked together for several years. Baum cast acrobat Pierre Couderc in the title role because he was unable to find a woman with the level of acrobatic training to do the role. Distribution and preservation The film was a commercial failure, a fact which caused distribution problems for the other Oz Film titles that followed it. This contributed to the failing of The Oz Film Manufacturing Company . [ 2 ] The film is one of three made by the Oz Film company that have not been lost. Some versions contain uncredited narration by Jacqueline Lovell . The International Wizard of Oz Club has extensive information on the production, for example in The Baum Bugle , Christmas 1972. The original film was screened at the 2013 Winkie Convention of the International Wizard of Oz Club with the original Gottschalk score played live by Joe Cascone on piano from Gottschalk's original manuscripts. References 1 Swartz, Mark Evan (2000). Oz Before the Rainbow: L. Frank Baum's The Wonderful Wizard of Oz on Stage and Screen to 1939 . Johns Hopkins University Press. p. 23. ISBN   0-8018-6477-1 . Retrieved 11 February 2024 . 2 Simpson, Paul (2013). A Brief Guide to Oz . Constable & Robinson Ltd. pp. 71–74. ISBN   978-1-47210-988-0 . Retrieved 10 February 2024 . From Wikipedia, the free encyclopedia",
      "fileSize": 1355436452,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-patchwork-girl-of-oz-1914-directed-by-j.-farrell-mac-donald",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 233
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-patchwork-girl-of-oz-1914-silent.-film-noir-drama",
      "id": "the-patchwork-girl-of-oz-1914-silent.-film-noir-drama",
      "title": "The Patchwork Girl Of Oz (1914 Silent Film, Film Noir, Drama)",
      "description": "PLOT : Ojo and Unc Nunkie are out of food, so they decide to journey to the Emerald City where they will never starve. _ IMDb STORYLINE : Ojo and Unc Nunkie are out of food, so they decide to journey to the Emerald City where they will never starve. Along the way, they meet Mewel, a waif and stray (mule) who leads them to Dr. Pipt, who has been stirring the powder of life for nine years. Ojo adds plenty of brains to Margolotte's Patchwork servant before she is brought to life with the powder. When Scraps does come to life, she accidentally knocks the liquid of petrifaction upon Unc Nunkie, Margolotte, and Danx (daughter Jesseva's boyfriend). So all go on separate journeys to find the ingredients to the antidote. (Of course Jesseva has Danx shrunken to take with her, which causes trouble with Jinjur.) Of course, no one ever told Ojo that some of the ingredients were illegal to obtain... —IMDb by Scott Hutchins IMDb User Review : Delightful Flight of Fancy . (July 24, 2006 by Space_Mafune): A young munchkin named Ojo (played by Violet MacMillan) and her Unc Nunkie decide to set out in search of a better life in the Emerald City of Oz. Along the way, they meet and befriend a magician and his family. The magician has long been at work on perfecting a magic powder of life, his wife having created a patchwork servant girl whom they hope to bring to life. Things go awry when the newly awakened patchwork girl accidentally spills a petrification fluid upon the Magician's wife and his future son in-law as well as Ojo's Unc Nunkie. Now our heroes (the Patchwork Girl, Ojo, the Magician and his daughter) must combine forces in search of the different, rare and hard to obtain ingredients necessary for a spell to undo the petrification process. Many unusual adventures, magical as only the world of Oz can be, await. This delightful flight of fancy provides viewers with a fun escape from reality. The actors and actresses breathe such a wonderfully vibrant energy into their lively performances that they prove quite a joy to watch. Basically this starts off as a series of individual stories focused on a wide number of colorful characters. By the film's end however, all these different characters and their individual stories seem to merge together into one near epic tale. Of the three 1914 Oz film produced in part by L. Frank Baum himself, this one is clearly the best and most complete adventure story. ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh **",
      "fileSize": 263530078,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-patchwork-girl-of-oz-1914-silent.-film-noir-drama",
      "language": "eng",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 6555
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "81 min",
    "imdbRating": 5.5,
    "imdbVotes": 581,
    "Genre": "Adventure, Family, Fantasy",
    "Plot": "Ojo and Unc Nunkie are out of food, so they decide to journey to the Emerald City where they will never starve. Along the way, they meet Mewel, a waif and stray (mule) who leads them to Dr. Pipt, who has been stirring the powder of life for nine years. Ojo adds plenty of brains to Margolotte's Patchwork servant before she is brought to life with the powder. When Scraps does come to life, she accidentally knocks the liquid of petrifaction upon Unc Nunkie, Margolotte, and Danx (daughter Jesseva's boyfriend). So all go on separate journeys to find the ingredients to the antidote. (Of course Jesseva has Danx shrunken to take with her, which causes trouble with Jinjur.) Of course, no one ever told Ojo that some of the ingredients were illegal to obtain...",
    "Director": "J. Farrell MacDonald",
    "Writer": "L. Frank Baum",
    "Actors": "Violet MacMillan, Frank Moore, Raymond Russell",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0004099",
    "tt0004286",
    "tt0004873",
    "tt0050084",
    "tt0089961",
    "tt0015400",
    "tt0068190",
    "tt0290406",
    "tt0052948",
    "tt0243462",
    "tt0146315",
    "tt0104522"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}