{
  "imdbId": "tt0045787",
  "title": "Four Sided Triangle",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FourSidedTriangle_201905",
      "id": "FourSidedTriangle_201905",
      "title": "Four Sided Triangle",
      "description": "“Great premise well acted” “Improbable” “Interesting” “Hammer’s first sci-fi outing a winner” (IMDB reviews quotes).   A unique sci-fi/romantic drama in which a British scientist duplicates his girlfriend (Barbara Payton). This results in unintended consequences. (Don't you just hate when that happens?) Good cast a good production values for a low-budget film. Malcolm Arnold background score. I agree with the IMDB reviewer who said it was like a long “Outer Limits” TV episode. IMDB rating 5.9. Written and directed by Terence Fisher. Released in 1953. Complete print. AKA “The Monster and the Woman”",
      "fileSize": 1045509300,
      "addedAt": "2026-01-07T00:06:25.399Z",
      "thumbnail": "https://archive.org/services/img/FourSidedTriangle_201905",
      "collection": "feature_films",
      "downloads": 7801
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "81 min",
    "imdbRating": 5.8,
    "imdbVotes": 849,
    "Genre": "Romance, Sci-Fi",
    "Plot": "Bill and Robin, helped by their childhood friend, Lena, develop a \"reproducer\" which can exactly duplicate any object. Bill, crushed when Lena marries Robin, convinces her to allow him to duplicate her, so that he may have a copy of her for himself. The experiment, at first deemed a success, seems to have worked only too well as the duplicate, Helen, is such an exact copy that she also loves Robin, not Bill. Bill hopes to rectify the situation with another radical experiment.",
    "Director": "Terence Fisher",
    "Writer": "Terence Fisher, Paul Tabori, William F. Temple",
    "Actors": "Barbara Payton, James Hayter, Stephen Murray",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041641",
    "tt0061683",
    "tt0050894",
    "tt0045562",
    "tt0047634",
    "tt0046853",
    "tt14407336",
    "tt0045551",
    "tt10333426",
    "tt0046039",
    "tt0044962",
    "tt0054790"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}