{
  "movieId": "tt0039410",
  "title": "The Gangster",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-gangster-1947",
      "id": "the-gangster-1947",
      "title": "The Gangster (1947) Barry Sullivan, John Ireland, Belita, Joan Lorring, Akim Tamiroff, Shelley Winters (uncredited)",
      "description": "The Gangster (aka Low Company) is a 1947 American crime FILM NOlR directed by Gordon Wiles. The drama features Barry Sullivan, Belita, Joan Lorring and Akim Tamiroff. The screenplay was written by Daniel Fuchs, based on his novel Low Company (1937).   Shelley Winters also makes a brief appearance just into the second hour of the film,  playing the uncredited role of a cashier. This was one of the various bit parts played by Winters at Columbia prior to the move to Universal in 1947, where she achieved stardom with her breakout performance as the victim of insane actor Ronald Colman in George Cukor's A Double Life.   You can find out more about this movie from Wikipedia and read an article from FILM NOlR of the Week .",
      "fileSize": 820026865,
      "addedAt": "2026-01-07T00:11:57.688Z",
      "thumbnail": "https://archive.org/services/img/the-gangster-1947",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 2201
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": 6.5,
    "imdbVotes": 1090,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Shubunka is the self-made head of the rackets in the sleazy boardwalk community of Neptune City, a low-rent version of Coney Island. He has become infatuated with a sultry nightclub chanteuse and lavishes her with gifts and attention, spending money on her that might better go to maintaining his hold on his operation. His obsession with her, as well as his pride, clouds his judgment as Cornell, a much more ruthless hoodlum, moves in on Shubunka's territory, bribes and threatens his associates, and compromises his operation. As if in a Greek tragedy, the petty gangster's weaknesses conspire to cause his downfall.",
    "Director": "Gordon Wiles",
    "Writer": "Daniel Fuchs, Dalton Trumbo",
    "Actors": "Barry Sullivan, Belita, Joan Lorring",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0039396",
    "tt0039515",
    "tt0039335",
    "tt0039224",
    "tt0039311",
    "tt0039482",
    "tt0039536",
    "tt0039217",
    "tt0040525",
    "tt0039730",
    "tt0039389",
    "tt0039820"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.688Z"
}