{
  "imdbId": "tt0013075",
  "title": "Dr. Jack",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/drjack4k",
      "title": "Drjack4k",
      "id": "drjack4k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OZ-cbcPJ9AY",
      "title": "Dr. Jack (1922) | Colorized Public Domain Silent Comedy with Harold Lloyd in Classic Feature Film",
      "description": "Dr. Jack (1922) is an American silent comedy film starring Harold Lloyd, one of the greatest comedians of the silent era, directed by Fred C. Newmeyer. This restored and colorized public domain edition revives Lloyd at the peak of his career, presenting a clever and lighthearted comedy that contrasts two very different doctors: one who thrives on common sense, optimism, and laughter, and another who profits from endless tests and exaggerated illness. As Harold Lloyd’s first feature-length success after his shorts and earlier films, Dr. Jack solidified his reputation alongside Charlie Chaplin and Buster Keaton as one of the “big three” silent clowns.\n\nPlot Summary:\nHarold Lloyd stars as Dr. Jack Jackson, a small-town physician who believes that sunshine, exercise, and humor are the best cures for most ailments. His practice thrives on simplicity and optimism rather than expensive, drawn-out treatments. Meanwhile, a wealthy young woman known only as “The Sick-Little-Well-Girl” is being exploited by the pompous Dr. Ludwig von Saulsbourg, who keeps her confined to a gloomy mansion while profiting from her supposed frailty.\n\nWhen Dr. Jack is called in to give a second opinion, he immediately senses that laughter and joy will do more for the girl’s health than endless medicine. Through a series of comedic encounters, disguises, and slapstick escapades, he introduces her to the world outside her confinement, bringing color and vitality back into her life. The film builds to a classic Harold Lloyd finale full of inventive gags, romantic energy, and sharp satire of medical pretension.\n\nCast and Crew:\n• Director: Fred C. Newmeyer\n• Producer: Hal Roach\n• Cinematography: Walter Lundin\n• Editing: T. J. Crizer\nStarring:\n• Harold Lloyd as Dr. Jack Jackson\n• Mildred Davis as The Sick-Little-Well-Girl\n• John T. Prince as The Girl’s Father\n• Eric Mayne as Dr. Ludwig von Saulsbourg\n• Charles Stevenson as Uncle\n\nFilm Significance:\nDr. Jack is significant not only as a showcase for Harold Lloyd’s blend of physical comedy and optimism but also as an early critique of the medical establishment, portraying how profit-driven doctors could exploit patients. It became one of Lloyd’s most beloved features, reflecting his “Glass Character” persona: an ambitious, energetic everyman who wins through intelligence, courage, and good humor. The film also pairs Lloyd with Mildred Davis, his frequent leading lady and later his wife, adding genuine chemistry to the romantic subplot. Today, it stands as a vibrant snapshot of 1920s comedy cinema, filled with timeless humor and social relevance.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Dr. Jack remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1922 release was a silent black-and-white film, typical of its era. While authentic to its time, many modern audiences skip silent films due to the lack of color and sound. By offering a colorized edition, Dr. Jack’s humor, characters, and visual gags gain new vibrancy, making them more accessible to contemporary viewers. The restoration process highlights Harold Lloyd’s expressive style and the charm of his comedic timing, allowing his genius to reach new generations.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#DrJack1922 #HaroldLloyd #SilentComedy #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentFilmEra #FilmRestoration #ClassicComedy #GoldenAgeHollywood",
      "id": "OZ-cbcPJ9AY",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-dr-jack",
      "title": "Dr. Jack",
      "id": "silent-dr-jack"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IqRzhrxtCFQ",
      "title": "Dr. Jack (1922) Comedy Silent Film",
      "description": "Country Doctor, Jack Jackson is called in to treat the Sick-Little-Well-Girl, who has been making Dr. Saulsbourg and is sanitarium very rich, after years of unsuccessful treatment. His old-fashioned methods do the trick and the quack is sent packing.\n\nDirectors: Fred C. Newmeyer, Sam Taylor\nWriters: Hal Roach, Sam Taylor \nStars: Harold Lloyd, Mildred Davis, John T. Prince\nGenre: Classics, Comedy, Adventure, Silent \nBudget: $113,440\n\nJoin us on social media :\nFacebook : https://www.facebook.com/CultCinemaClassics\nInsta : https://www.instagram.com/cultcinemaclassics -\nhttps://www.twitch.tv/cultcinema",
      "id": "IqRzhrxtCFQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "60 min",
    "imdbRating": "7.1",
    "imdbVotes": "1,707",
    "Genre": "Comedy, Romance",
    "Plot": "Country Doctor, Jack Jackson is called in to treat the Sick-Little-Well-Girl, who has been making Dr. Saulsbourg and his sanitarium very rich, after years of unsuccessful treatment. Dr. Jack's old-fashioned methods do the trick, and the quack is sent packing.",
    "Director": "Fred C. Newmeyer, Sam Taylor",
    "Writer": "Hal Roach, Sam Taylor, Jean C. Havez",
    "Actors": "Harold Lloyd, Mildred Davis, John T. Prince",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0014945",
      "title": "Girl Shy",
      "year": 1924,
      "imdbRating": "7.7",
      "imdbVotes": "3,618",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015841",
      "title": "The Freshman",
      "year": 1925,
      "imdbRating": "7.5",
      "imdbVotes": "6,373",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0014429",
      "title": "Safety Last!",
      "year": 1923,
      "imdbRating": "8.1",
      "imdbVotes": "23,503",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014611",
      "title": "Why Worry?",
      "year": 1923,
      "imdbRating": "7.3",
      "imdbVotes": "2,102",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0011521",
      "title": "Number, Please?",
      "year": 1920,
      "imdbRating": "6.9",
      "imdbVotes": "1,263",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015002",
      "title": "Hot Water",
      "year": 1924,
      "imdbRating": "7.1",
      "imdbVotes": "1,531",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013512",
      "title": "The Primitive Lover",
      "year": 1922,
      "imdbRating": "6.4",
      "imdbVotes": "134",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013201",
      "title": "Grandma's Boy",
      "year": 1922,
      "imdbRating": "7.0",
      "imdbVotes": "1,999",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012928",
      "title": "Beauty's Worth",
      "year": 1922,
      "imdbRating": "6.4",
      "imdbVotes": "911",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012701",
      "title": "A Small Town Idol",
      "year": 1921,
      "imdbRating": "6.3",
      "imdbVotes": "77",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014341",
      "title": "Our Hospitality",
      "year": 1923,
      "imdbRating": "7.8",
      "imdbVotes": "12,846",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012499",
      "title": "Never Weaken",
      "year": 1921,
      "imdbRating": "7.5",
      "imdbVotes": "2,147",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:52:39.554Z"
}