{
  "imdbId": "tt0041527",
  "title": "Johnny Allegro",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/johnny-allegro-1949",
      "id": "johnny-allegro-1949",
      "title": "Johnny Allegro (1949)",
      "description": "Treasury Department officials recruit a florist (Raft) to lead them to a wanted criminal (Macready); but once he gets too close, he finds he's the hunted. Watch on RetroFlix.org:  https://retroflix.org/johnny-allegro-1949/",
      "fileSize": 827149764,
      "addedAt": "2026-01-07T00:09:15.996Z",
      "thumbnail": "https://archive.org/services/img/johnny-allegro-1949",
      "language": "eng",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 209
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1949-johnny-allegro-ted-tetzlaff-vose",
      "id": "1949-johnny-allegro-ted-tetzlaff-vose",
      "title": "1949 - Johnny Allegro - Ted Tetzlaff - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com t.me/agendasociocultural",
      "fileSize": 1359378248,
      "addedAt": "2026-01-07T00:06:06.561Z",
      "thumbnail": "https://archive.org/services/img/1949-johnny-allegro-ted-tetzlaff-vose",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 1547
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "81 min",
    "imdbRating": 6.4,
    "imdbVotes": 777,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Los Angeles hotel lobby florist Johnny Allegro is a man with a secret: he's a former criminal who escaped from Sing Sing prison. However, Johnny went straight and became a legitimate businessman. One day, a high-class, well dressed attractive blonde runs into his arms in the hotel lobby and pretends she's his date for the evening. She whispers in his ear that she is being followed, in danger and needs Johnny's help to escape. Intrigued, Johnny agrees to play along and help the stunning blonde beauty. They sit in the hotel bar and talk. Her name is Glenda Chapman and she wants to escape the police detective who sits in the lobby shadowing her. Over the following days, Johnny falls for Glenda who lives in the hotel. Unfortunately, Johnny is visited in his flower shop by Treasury Agent Schultzy, who tells Johnny that he knows about Johnny's real identity and that Johnny is an escaped criminal. However, Johnny is not arrested. Instead, the Treasury Agent asks him to assist the government in locating the source of a huge stash of counterfeit US currency flooding the country. In return, the government is prepared to help Johnny receive a reduced prison sentence for his escape from Sing Sing. Johnny agrees but he's surprised to find out that his new romantic conquest, Glenda, is somehow involved in the counterfeit money scheme. Johnny is torn between his love for Glenda and the promise he made to the Treasury Agents.",
    "Director": "Ted Tetzlaff",
    "Writer": "Karen DeWolf, Guy Endore, James Edward Grant",
    "Actors": "George Raft, Nina Foch, George Macready",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043086",
    "tt0041555",
    "tt0042006",
    "tt0042046",
    "tt0040719",
    "tt0037932",
    "tt0041503",
    "tt0041268",
    "tt0041761",
    "tt0041269",
    "tt0041786",
    "tt0041958"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T17:42:41.404Z"
}