{
  "imdbId": "tt0000835",
  "title": "The Cricket on the Hearth",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheCricketOnTheHearth",
      "id": "TheCricketOnTheHearth",
      "title": "\"The Cricket On The Hearth\" (1909) director D.W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Cricket on the Hearth\" is a short drama.  The film is included in our program to illustrate the work of two of our stars: actor Arthur Johnson and cinematographer Billy Bitzer. The film is based on the novella \"The Cricket on the Hearth\" by Charles Dickens. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Owen Moore, Violet Mersereau, Herbert Prior, Linda Arvidson, Arthur Johnson Distributed by                   Biograph Company Release date                      May 27, 1909 Country                             United States Running time                    12 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 413901491,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheCricketOnTheHearth",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 2322
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-cricket-on-the-hearth",
      "id": "silent-the-cricket-on-the-hearth",
      "title": "The Cricket on the Hearth",
      "fileSize": 481421066,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-cricket-on-the-hearth",
      "language": "English",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 530
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbRating": 4.8,
    "imdbVotes": 162,
    "Genre": "Short",
    "Plot": "Because of poverty Edward Plummer leaves his family and his sweetheart May and goes to sea. While he is away, his sister Dot marries John Peerybingle. Mrs. Fielding, the mother of May, is deep in debt, and when Old Tackleton wants to marry her daughter she agrees, despite May's protest. Three years later Edward returns. At the King George Inn he learns that May is betrothed to Old Tackleton, which leaves him in deep despair. He decides to figure out if May really loves Tackleton. From a strolling actor he buys a false beard, a wig and some clothes. Disguised as an old man he visits his sister Dot, for whom he reveals his true identity. John Peerybingle realizes that it's just a disguise, but thinks the man behind it is his wife's secret lover, and plans to leave her. Meanwhile Dot tells Edward that May is going to marry Tackleton the same day, although she doesn't want to. Edward goes to May, carries her off, and marries her quickly. Tackleton gets furious at first, but is soon reconciled with all the others.",
    "Director": "D.W. Griffith",
    "Writer": "Charles Dickens, Frank E. Woods",
    "Actors": "Owen Moore, Violet Mersereau, Linda Arvidson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000895",
    "tt0000852",
    "tt0001062",
    "tt0000854",
    "tt0001083",
    "tt0000936",
    "tt0000972",
    "tt0000892",
    "tt0000882",
    "tt0000922",
    "tt0000960",
    "tt0001013"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}