{
  "imdbId": "tt0031796",
  "title": "The Phantom Creeps",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThePhantomCreeps",
      "id": "ThePhantomCreeps",
      "title": "The Phantom Creeps",
      "description": "The Phantom Creeps is everything an old classic B sci-fi is supposed to be. It features Bela Lugosi (as Dr. Zorka), a mad megalomaniac genius with a utility belt and a sack of gadgets that would make Batman and James Bond blush, against a team of CIA-types, a reporter, and local law enforcement. Lugosi hams up a storm and really seems to enjoy himself in this immensely silly role. His somewhat untrustworthy and dull side-kick, played by Jack Smith is a great foil to his overbearing stage presence, and he makes a truly great sadist!",
      "fileSize": 1941538580,
      "addedAt": "2026-01-07T00:07:05.035Z",
      "thumbnail": "https://archive.org/services/img/ThePhantomCreeps",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 271205
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-phantom-creeps-1939",
      "id": "the-phantom-creeps-1939",
      "title": "The Phantom Creeps (1939)",
      "description": "A mad scientist attempts to rule the world by creating various elaborate inventions. Watch on RetroFlix:  https://retroflix.org/the-phantom-creeps-1939/",
      "fileSize": 228111405,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-phantom-creeps-1939",
      "language": "eng",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 175
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qveDU6VvBI8",
      "id": "qveDU6VvBI8",
      "title": "The Phantom Creeps (1939) BELA LUGOSI🍕12-CHAPTER CLIFFHANGER",
      "description": "Exclusive PizzaFLIX Marathon Edition! Complete 12-Chapter Cliffhanger\nStars: Bela Lugosi, Robert Kent, Dorothy Arnold, Regis Toomey\nDirected by: Ford Beebe, Saul A. Goodkind\n\nBELA LUGOSI stars as a brilliant but rogue scientist, Dr. Alex Zorka. After a tragic accident pushes him over the edge, he plans to use his inventions to rule the world! Opposing him are a pair of G-Men, a feisty reporter, and a ring of international spies. Will good win over evil?\n\n🍕CHAPTERS🍕\n0:00 PizzaFLIX Introduction\n2:29       CHAPTER 1: The Menacing Power \n23:05     CHAPTER 2: Death Stalks the Highways \n42:08     CHAPTER 3: Crashing Towers\n1:02:20  CHAPTER 4: Invisible Terror\n1:21:55  CHAPTER 5: Thundering Rails\n1:42:32  CHAPTER 6: The Iron Monster\n2:02:50  CHAPTER 7: The Menacing Mist\n2:23:15  CHAPTER 8: Trapped in the Flames\n2:41:09  CHAPTER 9: Speeding Doom\n2:58:28  CHAPTER 10: Phantom Footprints\n3:17:21  CHAPTER 11: The Blast\n3:33:08  CHAPTER 12: To Destroy the World\n3:52:43 Please Subscribe",
      "addedAt": "2025-12-26T23:43:04.713Z",
      "thumbnail": "https://i.ytimg.com/vi/qveDU6VvBI8/maxresdefault.jpg",
      "duration": 13970,
      "language": "en",
      "year": 1939,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "265 min",
    "imdbRating": 4.7,
    "imdbVotes": 1133,
    "Genre": "Action, Family, Horror",
    "Plot": "\"The Phantom Creeps\" was Universal's 44th sound-era serial (between \"The Oregon Trail\" and \"The Green Hornet\") and was re-issued to theaters in 1949 by Commonwealth Pictures Corporation, a distribution set-up handling primarily Universal re-issues. Commonwealth had no hand at all in the production of this serial (as incorrectly shown on site) as they were a distribution company only. Some sources mistakenly identify them as the serial producer because all of the 1949 re-issue prints (and the 16mm prints sold to television circa 1952) show \"Commonwealth Pictures Corp. Presents\" above the title.There is a whole lot of difference between \"presenting\" and \"producing\", a fact that some sources appear to not know or don't care. The serial is of interest to some collectors as it re-unites Bela Lugosi and Edward Van Sloan from 1931's \"Dracula\", and the crater-discovery of the meteorite fragment by Zorka in the serial is stock footage from Universal's 1936 \"The Invisible Ray.\" The stock footage of an explosion and avalanche used in Chapter 11 comes from Universal's 1934 serial, \"The Vanishing Shadow.\" Plot finds eccentric scientist Dr. Alex Zorka carrying on various experiments in his secret laboratory with the aid of his assistant Monk. Zorka has invented many strange weapons of warfare, including a devisualizer belt which renders him invisible; a terrifying, eight-foot tall robot (played by stuntman Edwin \"Bud\" Wolfe and not circus giant Bud Wolff), and he also has a deadly meteorite fragment (which he found in a 1936 movie with Boris Karloff) from which he extracts an element which can induce suspended animation in an entire army. Foreign spies, operating under the guise of a foreign language school (great cover), are trying to buy or (mostly) steal the meteorite element, while his former partner, Dr. Fred Mallory, miffed that Zorka will not turn his inventions over to the U.S. Government, blows the whistle on him to Captain Bob West of the Military Intelligence Department. Tired of answering the door and saying no to the spies and the government, Zorka moves his lab and when his beloved wife is killed, Zorka, puttering around for his own amusement up to this point, gets hacked off as only Lugosi can, swears eternal vengeance against society, and decides to use his inventions to make himself world dictator. And would have if not for his assistant Monk, an escaped convict virtually enslaved by Zorka, who is cowardly, treacherous and totally incompetent, and whose accidental or deliberate interference with Zorka's efforts repeatedly frustrates his master's grand schemes.",
    "Director": "Ford Beebe, Saul A. Goodkind",
    "Writer": "George H. Plympton, Basil Dickey, Mildred Barish",
    "Actors": "Bela Lugosi, Robert Kent, Dorothy Arnold",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0046192",
    "tt0031506",
    "tt0030832",
    "tt0032475",
    "tt0030138",
    "tt0033317",
    "tt0029081",
    "tt0029818",
    "tt0028696",
    "tt0024768",
    "tt0031208",
    "tt0031449"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}