{
  "imdbId": "tt0053925",
  "title": "House of Usher",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house.of.-usher-1960",
      "id": "house.of.-usher-1960",
      "title": "House of Usher (1960)",
      "description": "\"House of Usher\" is a film adaptation of Edgar Allan Poe's classic short story. Directed by Roger Corman, it explores themes of madness, isolation, and the supernatural. The film follows the troubled journey of Philip Winthrop, who travels to the eerie Usher estate to propose to his beloved, Madeline Usher. Philip is unaware of the dark history and strange atmosphere surrounding the Usher family. He arrives at the crumbling mansion, greeted by an unsettling ambiance and the ominous presence of Roderick Usher, Madeline’s brother. Roderick is tormented by family curses and the deathly surroundings. As Philip attempts to engage Madeline, he discovers that the Usher family has been plagued by mental illness and the fear of burial alive. Roderick, in particular, exhibits paranoia, believing that their ancestral home is alive and filled with malevolent spirits. Madeline, who suffers from mysterious ailments, ultimately succumbs to her condition. Roderick insists on her burial in a crypt beneath the house, fueling Philip's growing dread. In a shocking twist, Madeline rises from the dead during a storm, leading to chaos and terror within the mansion. The film culminates in a chilling climax involving the destruction of the house itself.",
      "fileSize": 1373221658,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/house.of.-usher-1960",
      "language": "eng",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 176
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "79 min",
    "imdbRating": 6.9,
    "imdbVotes": 16233,
    "Genre": "Drama, Horror",
    "Plot": "Philip Winthrop calls upon his fiancée, Madeline Usher, at her family home. His presence is unwelcome, especially to Madeline's brother, Roderick. Roderick explains that the Ushers are cursed, suffering from hereditary physical defects. By Madeline marrying Winthrop this would only likely continue the affliction. It soon becomes clear that something sinister is afoot: not only due to Roderick's determination to prevent Madeline from leaving but also due to the evil that seems to lurk in the house itself.",
    "Director": "Roger Corman",
    "Writer": "Edgar Allan Poe, Richard Matheson",
    "Actors": "Vincent Price, Mark Damon, Myrna Fahey",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    "tt0055304",
    "tt0056606",
    "tt0054017",
    "tt0058333",
    "tt0059821",
    "tt0054033",
    "tt0057128",
    "tt0052655",
    "tt0054768",
    "tt0054462",
    "tt0055019",
    "tt0051622"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.614Z"
}