{
  "imdbId": "tt0038592",
  "title": "Heartbeat",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Heartbeat_347",
      "id": "Heartbeat_347",
      "title": "Heartbeat",
      "description": "A young female escapee from a reform school (Ginger Rogers) joins a pickpocket academy in Paris.",
      "fileSize": 2297385808,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/Heartbeat_347",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 11101
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/heartbeat",
      "id": "heartbeat",
      "title": "Heartbeat",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 5225959611,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/heartbeat",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 150736
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5OUdqTQwtOM",
      "id": "5OUdqTQwtOM",
      "title": "Heartbeat (1946) | Colorized Public Domain Romantic Comedy with Ginger Rogers and Jean-Pierre Aumont",
      "description": "Heartbeat (1946) is an American romantic comedy directed by Sam Wood and starring Ginger Rogers, Jean-Pierre Aumont, Adolphe Menjou, and Basil Rathbone. Based on the 1939 French film Battement de cœur, this Hollywood adaptation blends charm, romance, and witty dialogue in a lighthearted tale of love and deception in Paris. With Rogers at the peak of her post-Academy Award career, Heartbeat captures the glamour and humor of mid-1940s Hollywood, now beautifully restored and colorized for modern audiences in the USA, Europe, and beyond.\n\nPlot Summary:\nThe story follows Arlette Lafron (Ginger Rogers), a young runaway who flees a strict boarding school and winds up in the underworld of Paris. Taken in by Professor Aristide (Basil Rathbone), a polished but unscrupulous figure, she is trained in the art of pickpocketing. Arlette soon finds herself swept into high society when she attempts to steal from a wealthy diplomat, Ambassador De Grieux (Adolphe Menjou).\n\nInstead of turning her in, the ambassador sees potential in Arlette and proposes a bold scheme: she must steal a watch from a young nobleman, Pierre de Roche (Jean-Pierre Aumont). But when Arlette and Pierre meet, romance quickly blossoms, complicating the plan and placing her loyalties in question.\n\nSet against a glamorous Parisian backdrop, the film combines comedic misunderstandings with sparkling romance, culminating in Arlette’s choice between her shady mentors and her newfound love.\n\nCast and Crew:\n• Director: Sam Wood\n• Screenplay: Morrie Ryskind\n• Produced by: Sam Wood Productions, released by United Artists\n• Cinematography: Russell Metty\n• Editing: John Sturges\n\nStarring:\n• Ginger Rogers as Arlette Lafron\n• Jean-Pierre Aumont as Pierre de Roche\n• Adolphe Menjou as Ambassador De Grieux\n• Basil Rathbone as Professor Aristide\n• Mikhail Rasumny as Marcel\n• Jean Hebey as Inspector Giraud\n\nFilm Significance:\nHeartbeat is notable for its adaptation of a French hit film into a glamorous Hollywood production. Ginger Rogers, fresh off her Academy Award win for Kitty Foyle in 1940, leads the film with charm and comedic timing. Jean-Pierre Aumont, recently returned from serving in Free France during World War II, adds continental elegance to the cast. With supporting turns from Basil Rathbone and Adolphe Menjou, the film reflects Hollywood’s interest in romantic European settings during the postwar years.\n\nThough not considered a major success at the time of release, Heartbeat has gained new appreciation as a piece of 1940s escapist cinema, offering glamour, romance, and humor in equal measure. It highlights Hollywood’s tendency to remake foreign successes for American audiences, while also giving Rogers another showcase for her sophisticated comedic talents.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Heartbeat remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1946 release was produced in black and white, like many films of its time. While authentic, today’s audiences often skip past older black-and-white romantic comedies. By offering a colorized edition, we give Heartbeat a modern visual appeal that highlights its Parisian settings and glamorous costumes. This restored version preserves the film’s charm while presenting it in a way that feels fresh and visually captivating for contemporary viewers.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Heartbeat1946 #GingerRogers #JeanPierreAumont #BasilRathbone #AdolpheMenjou #PublicDomainMovie #ColorizedClassic #RomanticComedy #GoldenAgeHollywood #FilmRestoration",
      "addedAt": "2025-12-24T00:48:01.266Z",
      "thumbnail": "https://i.ytimg.com/vi/5OUdqTQwtOM/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYciBDKC0wDw==&rs=AOn4CLBdC-4e3lWpcoYY7qL9aKCO0e5FYw",
      "duration": 5973,
      "language": "en",
      "year": 1946,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hLPy4_gxmQg",
      "id": "hLPy4_gxmQg",
      "title": "Heartbeat (1946) GINGER ROGERS",
      "description": "Stars: Ginger Rogers, Basil Rathbone, Adolphe Menjou\nDirector: Sam Wood\n\nA young female escapee from a reform school joins a pickpocket academy in Paris. She is caught red-handed on her first attempt at stealing by an upper class man. He recruits her to do him a favor at a society party where she meets and falls in love with a young, handsome, rich diplomat. Whether or not she can land him is another story.",
      "addedAt": "2025-12-26T23:49:01.364Z",
      "thumbnail": "https://i.ytimg.com/vi/hLPy4_gxmQg/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8ASAAuADigIMCAAQARhkIGQoZDAP&rs=AOn4CLBHVDuyJiIQesQZ0AkHMOrv3RdW6w",
      "duration": 6002,
      "language": "en",
      "year": 1946,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "102 min",
    "imdbRating": 5.9,
    "imdbVotes": 853,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "A young female escapee from a reform school joins a pickpocket academy in Paris. She is caught red-handed on her first attempt at stealing by an upper class man. He recruits her to do him a favor at a society party where she meets and falls in love with a young, handsome, rich diplomat. Whether or not she can land him is another story.",
    "Director": "Sam Wood",
    "Writer": "Morrie Ryskind, Hans Wilhelm, Max Kolpé",
    "Actors": "Ginger Rogers, Jean-Pierre Aumont, Adolphe Menjou",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020425",
    "tt0039370",
    "tt0037588",
    "tt0040762",
    "tt0040395",
    "tt0040474",
    "tt0020034",
    "tt0011163",
    "tt0032881",
    "tt0012938",
    "tt0035931",
    "tt0041587"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}