{
  "movieId": "tt0046951",
  "title": "Elephant Walk",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/elephant-walk-1953",
      "id": "elephant-walk-1953",
      "title": "Elephant Walk (1953) Elizabeth Taylor · Dana Andrews",
      "description": "Elizabeth Taylor follows a plantation owner to Ceylon.. Englishwoman Ruth (Liz Taylor) falls in love with John Wiley (Peter Finch), who owns a tea plantation in Ceylon. She follows him to his estate and becomes the mistress of the lush jungle. But John's constantly drunken band of British friends gets on her nerves.   And then there are the angry elephants on whose path the estate is built. Marketed at the time as an epic with magnificent panoramas and powerful emotions, the film now seems like an exotic horror piece, beneath whose surface lurk the repressed fears of colonial patriarchs. The elephantine, catastrophic finale is still stunning. Eccentric epic with jumbo action",
      "fileSize": 3330777062,
      "addedAt": "2026-01-07T00:08:15.379Z",
      "thumbnail": "https://archive.org/services/img/elephant-walk-1953",
      "language": "eng",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 242
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "103 min",
    "imdbRating": 6.3,
    "imdbVotes": 2784,
    "Genre": "Adventure, Drama",
    "Plot": "Colonial tea planter John Wiley (Peter Finch), visiting England at the end of World War II, wins and weds lovely English rose Ruth (Dame Elizabeth Taylor) and takes her home to Elephant Walk, Ceylon, where the local elephants have a grudge against the plantation. Ruth's delight with the tropical wealth and luxury of her new home is tempered by isolation as the only white woman in the district; by her husband's occasional imperious arrogance; by a mutual physical attraction with plantation manager Dick Carver (Dana Andrews), and by the hovering, ominous menace of the hostile elephants.",
    "Director": "William Dieterle",
    "Writer": "Robert Standish, John Lee Mahin",
    "Actors": "Elizabeth Taylor, Dana Andrews, Peter Finch",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0046269",
    "tt0045267",
    "tt0046672",
    "tt0047365",
    "tt0046692",
    "tt0046719",
    "tt0046808",
    "tt0047013",
    "tt0047073",
    "tt0047376",
    "tt0047647",
    "tt0047669"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.379Z"
}