{
  "movieId": "tt0047900",
  "title": "Broadway Jungle",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BroadwayJungle",
      "id": "BroadwayJungle",
      "title": "Broadway Jungle",
      "description": "So what that it has nothing to do with Broadway. So what that the acting is awful and the production values nonexistent (except for Foley FX which consist of a cricket and a car horn). So what that it seems twice as long as it actually is. Because now you have a foolproof way to get rid of unwanted house guests. Just flip on this movie, and watch 'em scatter. A strong contender for the worst movie of all time. Written and directed by Phil Tucker. Released in 1955. a.k.a. \"Hollywood Jungle\" Tape-transferred complete print. NOTE: This flick would make a mind-boggling double feature with another Phil Tucker anti-classic, \"Dance Hall Racket,\" which is available here at IA.",
      "fileSize": 797881308,
      "addedAt": "2026-01-07T00:06:14.040Z",
      "thumbnail": "https://archive.org/services/img/BroadwayJungle",
      "collection": "feature_films",
      "downloads": 5052
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "62 min",
    "imdbRating": 2.6,
    "imdbVotes": 46,
    "Genre": "Comedy, Drama",
    "Plot": "In Hollywood, fledgling director Fletcher Mathering, harassed by the landlord for rent, explains that he has finally found a backer for his new movie, Death Takes a Spree, and so should soon be flush. That backer proves to be George \"Georgie-boy\" Gomez, a local hood who, we discover, has stolen the money he's proposing to pay to Fletcher from Boss (uncredited), a vicious gangster. Georgie-boy's sole provision is that the movie should star Lena Little, an actress whose star has faded for all but a certain hood who will always carry a gun in his pocket for her.",
    "Director": "Phil Tucker",
    "Writer": "Phil Tucker",
    "Actors": "Norman Wright, June Gilmore, George Robeleto",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt4887484",
    "tt0048188",
    "tt0048370",
    "tt0048380",
    "tt0048037",
    "tt0048312",
    "tt0049397",
    "tt0046799",
    "tt0045620",
    "tt0049683",
    "tt0047437",
    "tt0183807"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.040Z"
}