{
  "imdbId": "tt0033107",
  "title": "Stranger on the Third Floor",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-stranger-1946_202404",
      "title": "The Stranger: 1946 Film-Noir [1:34:04] Orson Welles, E.G. Robinson",
      "description": "Welles plays a Nazi named Franz Kindler who, after the end of the Second World War, has escaped to the United States and lays low in a small Connecticut town under the name Charles Rankin. Edward G. Robinson costars as Wilson, an agent of the Allied War Crimes Commission hot on Rankin’s trail. The former Nazi has tried to blend in; he teaches at the local school for boys and weds Mary (Loretta Young), the daughter of the town judge. Welles plays Rankin as suspiciously elegant, lending to the idea that anyone anywhere could be the enemy—that incognito Nazis could penetrate even the most inconsequential parts of postwar America. The idea was to destroy the illusion of safety for the average American citizen Producer Sam Spiegel, who at the time was a rookie in Hollywood, pushed for Veiller’s script for  The Stranger , based on a story by Victor Trivas, to be financed by International Pictures and distributed by RKO Radio Pictures (the script would eventually be doctored by John Huston). Welles was hired as both director and the film’s villain, but he had only modest input on the script. Made for little more than $1 million, it garnered upwards of $3 million at the box-office in its initial release. Behind the scenes, Hollywood lore tells us Welles shot a long sequence in which a Nazi named Konrad Meinike (Konstantin Shayne) searches for Kindler—some twenty minutes longer than the one that appears in the film, and possibly resembling the dizzying searching-down-a-lead sequences in Welles’ later  Mr. Arkadin  (1955). But the fate of the longer scene involving Meinike in  The Stranger  is yet another unfortunate tale from Welles’ storied history in Hollywood, as these twenty minutes of footage were cut by Spiegel and destroyed. Spiegel believed them to off-center given the plot’s centralized location in New England. Welles claimed the sequence was, in his opinion, the most interesting in the film, possibly since it was conceived and written by Welles himself. But then, any account of Welles’ experiences in Hollywood must include dozens of stories about producer interference that reshaped his historically troubled productions. What remains curious is that no one stopped Welles from using actual footage from the liberation of concentration camps in  The Stranger .   In the film, Wilson must convince Mary that her husband Rankin is the mastermind of the Holocaust. To accomplish this, he shows Mary a short reel of footage from a concentration camp to illustrate the inhumanity of Nazis. Rather than simply describe the footage or, say, show Mary looking away from the projected footage in horror, Welles resolved to use real-life images—marking the first time a major Hollywood motion picture used actual Holocaust footage. The images are brief and amount to just four quick shots. First is a glimpse of a mass grave filled with bodies, then the interior of an empty gas chamber, a shot of men heading into a chamber, and finally an emaciated victim. The images hardly amount to the visual study of atrocity that Alain Resnais’  Night and Fog  (1956) would provide a decade later. But Wilson describes them for Mary, going into terrible detail about how showers opened the pores to make the gas chambers a more effective killing apparatus. Welles acquired the images from documentary footage captured by George Stevens during his wartime experiences in Europe. Stevens’ footage was later assembled into Billy Wilder’s short film for the U.S. War Department,  Death Mills  (1945), which documented “the worst mass murder in human history” for the education of the German people, according to its titles. Welles’ use of these images implants a sense of veracity yet unseen by the average American, who was just beginning to hear about the extent of the Holocaust during radio broadcasts of the Nuremberg trials. In total, they occupy the screen for no more than a few abrupt seconds. They nevertheless imbue  The Stranger  with a real-world component that, in 1946, inflamed postwar anxieties about the lingering threat of fascism and the persistent fear among many that the Nazi threat would return—ideas that compelled Welles to agree to make  The Stranger  in the first place. The horrors of World War II were being uncovered at the time, and footage of concentration camps was suddenly showing up on newsreels. Although Welles uses such images, he claimed in his interviews with Peter Bogdanovich that he doesn’t approve of exploitation of such atrocities for entertainment, even while adding that concentration camp imagery serves to remind people of the horrible truth.",
      "fileSize": 1600635693,
      "id": "the-stranger-1946_202404"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": 6.8,
    "imdbVotes": 4727,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Rising reporter Michael Ward is the key witness in the murder trial of young Joe Briggs, who is convicted on circumstantial evidence while swearing innocence. Michael's girl Jane believes in Joe and blames Michael, who (in a remarkable sequence) dreams he is himself convicted of murdering his nosy neighbor. Will his dream come true before Jane can find the real murderer?",
    "Director": "Boris Ingster",
    "Writer": "Frank Partos, Nathanael West",
    "Actors": "Peter Lorre, John McGuire, Margaret Tallichet",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0042989",
      "title": "Southside 1-1000",
      "year": 1950,
      "imdbRating": 6.3,
      "imdbVotes": 264,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033582",
      "title": "The Face Behind the Mask",
      "year": 1941,
      "imdbRating": 7.1,
      "imdbVotes": 1965,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032508",
      "title": "Gang War",
      "year": 1940,
      "imdbRating": 5,
      "imdbVotes": 149,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032257",
      "title": "Black Diamonds",
      "year": 1940,
      "imdbRating": 5.5,
      "imdbVotes": 33,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032258",
      "title": "Black Friday",
      "year": 1940,
      "imdbRating": 6.3,
      "imdbVotes": 3077,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032651",
      "title": "Johnny Apollo",
      "year": 1940,
      "imdbRating": 6.9,
      "imdbVotes": 1566,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032022",
      "title": "They Made Me a Criminal",
      "year": 1939,
      "imdbRating": 6.8,
      "imdbVotes": 2630,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033740",
      "title": "I Wake Up Screaming",
      "year": 1941,
      "imdbRating": 7.2,
      "imdbVotes": 5587,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033998",
      "title": "Paper Bullets",
      "year": 1941,
      "imdbRating": 5.5,
      "imdbVotes": 374,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034175",
      "title": "The Shanghai Gesture",
      "year": 1941,
      "imdbRating": 6.6,
      "imdbVotes": 3021,
      "language": "English, French, Chinese, Russian, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0125737",
      "title": "Escort Girl",
      "year": 1941,
      "imdbRating": 4.1,
      "imdbVotes": 254,
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034173",
      "title": "Shadows on the Stairs",
      "year": 1941,
      "imdbRating": 5.7,
      "imdbVotes": 796,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.204Z"
}