{
  "movieId": "tt0044330",
  "title": "Affair in Monte Carlo",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Affairmonte_carlo5410",
      "id": "Affairmonte_carlo5410",
      "title": "Affair in Monte Carlo",
      "description": "Title: Affair in Monte Carlo Summary: A writer tells a crowd in a café about a woman he knows, who once feel deeply in love with a desperate, compulsive gambler. Directed by: Victor Saville Actors: Merle Oberon, Richard Todd, Leo Genn Production Company: Associated British Picture Corporation (ABPC) Release Date: 14 August 1953 (USA) Aspect Ratio: 1.37 : 1 Color: Color Writer Robert Sterling is visiting a café, when suddenly a scandal becomes known. To keep the others from overreacting, Sterling tells them about something similar that he saw happen years ago. He had been in Monte Carlo, and was playing host to a young widow whom he knew well. When he persuaded her to visit the casino one night, she became irresistibly attracted to a desperate young man who became suicidal after losing all his money at roulette. Sterling describes how they fell deeply in love, and how both of them then had to face difficult decisions about the future.",
      "fileSize": 470183447,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/Affairmonte_carlo5410",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 2118
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "75 min",
    "imdbRating": 5.1,
    "imdbVotes": 196,
    "Genre": "Drama, Romance",
    "Plot": "Writer Robert Sterling is visiting a café, when suddenly a scandal becomes known. To keep the others from overreacting, Sterling tells them about something similar that he saw happen years ago. He had been in Monte Carlo, and was playing host to a young widow whom he knew well. When he persuaded her to visit the casino one night, she became irresistibly attracted to a desperate young man who became suicidal after losing all his money at roulette. Sterling describes how they fell deeply in love, and how both of them then had to face difficult decisions about the future.",
    "Director": "Victor Saville",
    "Writer": "Stefan Zweig, Warren Chetham Strode",
    "Actors": "Merle Oberon, Richard Todd, Leo Genn",
    "Language": "English, French",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020602",
    "tt0030774",
    "tt0044509",
    "tt0044937",
    "tt0045109",
    "tt0045162",
    "tt0044502",
    "tt0044000",
    "tt0045551",
    "tt0043409",
    "tt0043830",
    "tt0043651"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}