{
  "movieId": "tt0036164",
  "title": "Miss V from Moscow",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MissVFromMoscow",
      "id": "MissVFromMoscow",
      "title": "Miss V from Moscow",
      "description": "WARNING: This is likely to be the worst WW2 espionage movie you will ever see. Why is explained in  my review which has been lifted from a place whose name is no longer mentioned in polite society: \"This isn't the Greatest Generation's World War II. It is an absurd, low-budget attempt at making a spy drama that instead became an unintentional parody. It features a commissar with a Brooklyn-Russian accent; elderly waiters tottering around with secret notes; downed allied flyers having a hilariously good time in German-occupied France; the most unlikely bunch of Nazis outside of \"The Producers\"(1968); and that's just for starters. The plot is juvenile nonsense about a female Russian spy (Lola Lane) smuggled into Paris to save Anglo-American convoys. Her foil is John Vosper, who's laughably awful as a ruthless Nazi colonel who appears more like Hogan's Heroes' Colonel Klink. Lola lane's performance isn't much better. In fact, the only convincing cast members are those without lines. Capped with a jaw-dropping final scene, some might call \"Miss V from Moscow\" so bad it's good. I won't go that far, but I do give it three stars because this bizarre klinker must be seen to be believed.\" Directed by Albert Herman Released in 1942 a.k.a. \"Intrigue in Paris\" Complete print",
      "fileSize": 936048380,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/MissVFromMoscow",
      "collection": "feature_films",
      "downloads": 8433
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "73 min",
    "imdbRating": 5,
    "imdbVotes": 92,
    "Genre": "Action, Adventure, Drama",
    "Plot": "Vera Marova is a Russian spy impersonating a dead German spy whom she closely resembles. Her ally is Steve Worth, an American serving in the British armed services, and the two work with the Free French underground agents in Paris to send secret radio messages to Moscow that save the American convoys from German submarines.",
    "Director": "Albert Herman",
    "Writer": "Arthur St. Claire, Sherman L. Lowe",
    "Actors": "Lola Lane, Noel Madison, Howard Banks",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0034637",
    "tt0034428",
    "tt0027201",
    "tt0034572",
    "tt0034948",
    "tt0034577",
    "tt0035372",
    "tt0035532",
    "tt0034405",
    "tt0036046",
    "tt0036241",
    "tt0036262"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}