{
  "imdbId": "tt0009153",
  "title": "Hell Bent",
  "year": 1918,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=97oFQHnVO6U",
      "title": "Hell Bent (1918) | Colorized Public Domain Silent Western with Harry Carey and Hoot Gibson",
      "description": "Hell Bent (1918) is a silent American Western directed by John Ford and starring Harry Carey in one of his most iconic early roles. Produced and released by Universal Pictures, the film is a prime example of the rugged Western storytelling that shaped Ford’s legendary career and solidified Carey’s reputation as one of the genre’s foundational stars. This restored and colorized public domain edition allows audiences in the United States, Europe, and beyond to experience an important piece of film history that was once thought lost but later rediscovered and preserved.\n\nPlot Summary:\nThe story follows Cheyenne Harry (Harry Carey), a drifter and cowboy with a reputation for being tough but honorable. Harry arrives in a rough frontier town ruled by corruption and lawlessness, where he befriends Cimmaron Bill (Duke R. Lee) and meets Bess Thurston (Neva Gerber), a young woman trying to survive in a harsh world.\n\nBess lives under the shadow of her brother, who is entangled in crime and associates with the villainous Beau Ross (Vester Pegg). As Harry grows closer to Bess, he finds himself caught between loyalty to his friends and his growing love for her. When Beau Ross kidnaps Bess and attempts to take her across the desert, Harry pursues them in a desperate race for survival.\n\nThe climax is one of the silent era’s most famous action sequences: Harry and Bess struggle against the elements in the desert, with Harry’s grit and determination ultimately leading to a daring rescue. Through courage and sacrifice, Harry reaffirms his code of honor, embodying the archetype of the Western hero that would dominate American cinema for decades.\n\nCast and Crew:\n• Director: John Ford\n• Producer: Universal Pictures\n• Cinematography: Ben F. Reynolds\nStarring:\n• Harry Carey as Cheyenne Harry\n• Neva Gerber as Bess Thurston\n• Duke R. Lee as Cimmaron Bill\n• Vester Pegg as Beau Ross\n• Joe Harris as Jack Thurston\n• Millard K. Wilson as Al Sheridan\n\nFilm Significance:\nHell Bent is a cornerstone in the careers of both John Ford and Harry Carey. Ford, who would later become one of Hollywood’s greatest directors with classics like Stagecoach (1939), The Searchers (1956), and The Man Who Shot Liberty Valance (1962), refined his craft in films like this, honing themes of rugged masculinity, morality, and survival in the American West.\n\nHarry Carey, Ford’s frequent collaborator, brought a naturalistic style to his role as Cheyenne Harry, a character he played in multiple films. His understated acting influenced later Western stars, including John Wayne. Supporting actor Hoot Gibson also appeared in Hell Bent, at the start of a career that would make him one of the most popular cowboys of the silent and early sound era.\n\nThe film was considered lost for many years, with only fragments known to survive. However, a complete print was eventually discovered in the Czech Film Archive, making restoration and preservation possible. This rediscovery highlighted the importance of film archiving and the fragility of silent cinema history.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Hell Bent remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white silent cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1918 release was a silent black-and-white Western. While historically authentic, modern audiences often skip silent films, especially those that lack sound or dynamic visuals. By offering a colorized edition, we bring renewed vitality to John Ford’s early masterpiece and Harry Carey’s legendary performance. For viewers in the USA, Europe, and beyond, this version highlights the roots of Western cinema, connecting today’s audiences with the raw frontier storytelling that defined early Hollywood.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the silent era through Hollywood’s Golden Age, preserving cinematic treasures and making them accessible for both classic film enthusiasts and new generations.\n\n#HellBent1918 #HarryCarey #JohnFord #SilentWestern #PublicDomainMovie #ColorizedClassic #SilentCinema #1920sMovies #FilmRestoration #ClassicWestern #GoldenAgeHollywood #HootGibson",
      "id": "97oFQHnVO6U",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-hell-bent",
      "title": "Hell Bent",
      "id": "silent-hell-bent"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "53 min",
    "imdbRating": "6.0",
    "imdbVotes": "445",
    "Genre": "Western",
    "Plot": "A cowboy must save his girlfriend from captivity and then cross the desert on foot with a single waterhole on the way.",
    "Director": "John Ford",
    "Writer": "John Ford, Harry Carey, Eugene B. Lewis",
    "Actors": "Harry Carey, Duke R. Lee, Neva Gerber",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0007755",
      "title": "Bucking Broadway",
      "year": 1917,
      "imdbRating": "6.1",
      "imdbVotes": "658",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009977",
      "title": "By Indian Post",
      "year": 1919,
      "imdbRating": "5.5",
      "imdbVotes": "176",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011358",
      "title": "Just Pals",
      "year": 1920,
      "imdbRating": "6.6",
      "imdbVotes": "513",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017463",
      "title": "3 Bad Men",
      "year": 1926,
      "imdbRating": "7.5",
      "imdbVotes": "1,537",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046384",
      "title": "The Sun Shines Bright",
      "year": 1953,
      "imdbRating": "6.9",
      "imdbVotes": "1,870",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031971",
      "title": "Stagecoach",
      "year": 1939,
      "imdbRating": "7.8",
      "imdbVotes": "57,694",
      "language": "English, Spanish, French",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0054292",
      "title": "Sergeant Rutledge",
      "year": 1960,
      "imdbRating": "7.4",
      "imdbVotes": "5,666",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0055558",
      "title": "Two Rode Together",
      "year": 1961,
      "imdbRating": "6.7",
      "imdbVotes": "7,380",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008892",
      "title": "'Blue Blazes' Rawden",
      "year": 1918,
      "imdbRating": "5.9",
      "imdbVotes": "112",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009466",
      "title": "Out West",
      "year": 1918,
      "imdbRating": "6.4",
      "imdbVotes": "1,360",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009550",
      "title": "Riddle Gawne",
      "year": 1918,
      "imdbRating": "7.1",
      "imdbVotes": "73",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009273",
      "title": "The Lady of the Dugout",
      "year": 1918,
      "imdbRating": "6.4",
      "imdbVotes": "136",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:18:52.100Z"
}