{
  "imdbId": "tt0018528",
  "title": "The Unknown",
  "year": 1927,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=49b6QoPcces",
      "title": "The Unknown (1927) | Colorized Public Domain Silent Horror with Lon Chaney & Joan Crawford",
      "description": "The Unknown (1927) is a silent horror melodrama directed by Tod Browning and produced by Metro-Goldwyn-Mayer, starring Lon Chaney and Joan Crawford. This chilling public domain classic is a masterpiece of early horror cinema, combining circus spectacle, grotesque physicality, and psychological obsession. Presented here in a restored and colorized edition, The Unknown is brought to life for modern audiences while preserving its haunting legacy.\n\nPlot Summary:\nSet in a traveling circus, the story follows Alonzo the Armless (Lon Chaney), a knife-thrower who uses his feet to perform his act. Secretly, Alonzo is not armless at all — he hides his arms to evade capture for a crime, while also concealing a shocking deformity.\n\nAlonzo becomes obsessed with Nanon (Joan Crawford), the daughter of the circus owner. Nanon has a phobia of men’s arms embracing her, making her drawn to Alonzo’s seemingly “safe” condition. To win her love, Alonzo takes a drastic and horrifying step: he undergoes an operation to have his arms permanently removed.\n\nHowever, fate delivers a cruel twist when Nanon overcomes her fear and falls in love with the circus strongman, Malabar. Alonzo’s obsession turns to madness as his sacrifice leaves him helpless to compete, leading to a shocking and unforgettable climax.\n\nCast and Crew:\n• Director: Tod Browning\n• Producer: Metro-Goldwyn-Mayer\n• Cinematography: Merritt B. Gerstad\n• Editing: Harry Reynolds\n\nStarring:\n• Lon Chaney as Alonzo the Armless\n• Joan Crawford as Nanon Zanzi\n• Norman Kerry as Malabar the Mighty\n• Nick De Ruiz as Zanzi, the Circus Owner\n• Frank Lanning as Cojo\n\nFilm Significance:\nThe Unknown is one of the most important works of both Lon Chaney and Tod Browning:\n\nLon Chaney’s transformation – Known as “The Man of a Thousand Faces,” Chaney delivers one of his most disturbing and unforgettable performances, embodying obsession, madness, and physical grotesquery.\n\nJoan Crawford’s early breakthrough – Years before her superstardom, Crawford shines in a key role that allowed her to move from supporting parts into MGM’s rising star roster.\n\nTod Browning’s mastery of horror – Browning, who would later direct Dracula (1931) and Freaks (1932), explored themes of deformity, obsession, and fate in ways that pushed the boundaries of silent cinema.\n\nInfluence on horror history – This film laid the groundwork for psychological horror, influencing decades of films about obsession, identity, and physical transformation.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is free of copyright restrictions and can be legally viewed, studied, and preserved. At Colorized Public Domain, we restore and enhance classics like The Unknown through cleaning, restoration, and digital colorization. Our mission is to make historically significant films more engaging and accessible for today’s audiences in the United States, Europe, and worldwide.\n\nWhy Watch This Colorized Edition:\nOriginally released in stark black-and-white, The Unknown was visually striking even in its silent-era form. With careful colorization, the circus setting becomes even more vivid, Lon Chaney’s performance more haunting, and Joan Crawford’s presence more luminous — creating a new way to experience one of the most unsettling films of the 1920s.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including forgotten horror gems, silent melodramas, and iconic performances — all preserved for modern audiences.\n\n#TheUnknown1927 #LonChaney #JoanCrawford #SilentHorror #PublicDomainMovie #ColorizedClassic #TodBrowning #SilentFilm #FilmRestoration #GoldenAgeHollywood",
      "id": "49b6QoPcces",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-unknown-1927-full-length",
      "title": "The Unknown (1927)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. While actor Lon Chaney was known for horror roles by the time this film came out, the lack of monster makeup for this film is notable. Chaney plays an armless circus performer named Alonzo, who is in love with the circus-owners daughter, Nanon. While Nanon can't stand being touched by a man, she doesn't mind being around Alonzo, who can't touch her due to the lack of his arms. Alonzo is hiding many secrets, however, and it is only a matter of time before Nanon realizes. The Unknown was a financial hit and is now thought of as a masterpiece of silent cinema.  I've uploaded the 1968 print version here as well as the more recent, and more complete, version. ",
      "id": "the-unknown-1927-full-length"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-unknown_1927",
      "title": "The Unknown",
      "id": "the-unknown_1927"
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "68 min",
    "imdbRating": "7.7",
    "imdbVotes": "9,487",
    "Genre": "Drama, Horror, Romance",
    "Plot": "Alonzo is an armless knife thrower and gun shooter for a circus---or so he appears. He is actually a criminal with his arms intact. He and his accomplice, Cojo (a little person), are hiding from the police. Alonzo views his disguise as perfect, especially since it keeps from view an unusual deformity of his left hand that would immediately give him away as the criminal the police are searching for. Nanon, the daughter of Zanzi, the circus owner, is the target in his act. Although Alonzo is in love with her, Nanon's father despises him. Malabar, the circus strong man, is attracted to Nanon but she is repulsed by his uninhibited sexual advances and desire to touch and hold her. Her phobia extends to the touch of any man's hand. Alonzo feeds her fears in the hopes that Nanon will fall in love with him since he is \"armless.\" Because Zanzi discovers Alonzo really has arms, Alonzo kills him, but Nanon witnesses the killing without seeing Alonzo's face; however, she does see the telltale deformity of his left hand. As Alonzo continues to plot to steal Nanon away from Mirabar, Cojo makes him realize that she will hate him once she discovers he has arms---and the deformity showing that he is her father's murderer. Alonzo decides to have both his arms amputated, which he succeeds in doing through blackmailing a surgeon. While Alonzo is away recuperating from the surgery, Nanon gets over her fear of being touched and falls completely in love with Mirabar. Discovering this upon his return, Alonzo hatches a scheme to kill Mirabar as he attempts his latest, most dangerous stunt.",
    "Director": "Tod Browning",
    "Writer": "Tod Browning, Waldemar Young, Joseph Farnham",
    "Actors": "Lon Chaney, Norman Kerry, Joan Crawford",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "2 wins & 2 nominations"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0019563",
      "title": "West of Zanzibar",
      "year": 1928,
      "imdbRating": "7.2",
      "imdbVotes": "2,019",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0016473",
      "title": "The Unholy Three",
      "year": 1925,
      "imdbRating": "7.1",
      "imdbVotes": "2,348",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0020581",
      "title": "Where East Is East",
      "year": 1929,
      "imdbRating": "6.6",
      "imdbVotes": "710",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014142",
      "title": "The Hunchback of Notre Dame",
      "year": 1923,
      "imdbRating": "7.2",
      "imdbVotes": "6,381",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018097",
      "title": "London After Midnight",
      "year": 1927,
      "imdbRating": "6.6",
      "imdbVotes": "1,495",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014972",
      "title": "He Who Gets Slapped",
      "year": 1924,
      "imdbRating": "7.7",
      "imdbVotes": "4,606",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018697",
      "title": "The Big City",
      "year": 1928,
      "imdbRating": "6.9",
      "imdbVotes": "92",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022002",
      "title": "The Iron Man",
      "year": 1931,
      "imdbRating": "5.8",
      "imdbVotes": "348",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020078",
      "title": "The Last Performance",
      "year": 1929,
      "imdbRating": "6.7",
      "imdbVotes": "488",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017632",
      "title": "Annie Laurie",
      "year": 1927,
      "imdbRating": "6.7",
      "imdbVotes": "534",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022913",
      "title": "Freaks",
      "year": 1932,
      "imdbRating": "7.8",
      "imdbVotes": "53,322",
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018166",
      "title": "Mockery",
      "year": 1927,
      "imdbRating": "6.8",
      "imdbVotes": "578",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}