{
  "imdbId": "tt0014429",
  "title": "Safety Last!",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/safety-last-1923-silent-film-noir-comedy-short",
      "id": "safety-last-1923-silent-film-noir-comedy-short",
      "title": "Safety Last (1923 Silent, B/W, Short, Comedy)",
      "description": "This is an amusing excerpt of the 'clock scene,' from Hal Roach full length film, ''Safety Last,''  found at archive.org web address: https://archive.org/details/dfwiv-Safety_Last_-_Harold_Lloyd_1923_-_Old_Time_Movie   also can be watched at: https://archive.org/details/SafetyLastHaroldLloyd1923.FullMovieexcellentQuality. (_ed. note) PLOT   for Clock scene of Safety Last : Country boy (Lloyd) heads to the big city to seek success. While working as a clerk in a department store, he talks the manager into offering $1000 to anyone who can bring more customers to the store. He then arranges for a friend, a \"human fly,\" (Strother) to climb the face of the store building as a publicity stunt. Unfortunatly the \"human fly\" is a wanted man, and when \"The Law\" (Young) shows, our hero must make the climb, himself. At each ledge he encounters new difficulties, climaxing in the famous 'clock scene.' _IMDb by Herman Seifer PLOT   for full lengh film : A boy leaves his small country town and heads to the big city to get a job. As soon as he makes it big his sweetheart will join him and marry him. His enthusiasm to get ahead leads to some interesting adventures. _IMDb by —grantss STORYLINE : In 1922, the country boy Harold says goodbye to his mother and his girlfriend Mildred in the train station and leaves Great Bend expecting to be successful in the big city. Harold promises to Mildred to get married with her as soon as he \"make good.\" Harold shares a room with his friend \"Limpy\" Bill and he finally gets a job as salesman in the De Vore Department Store. However, he pawns Bill's phonograph, buys a lavaliere and writes to Mildred telling that he is a manager of De Vore. One day, Harold sees an old friend from Great Bend that is a policeman and when he meets his friend Bill, he asks Bill to push the policeman over him and make him fall down. However Bill pushes the wrong policeman that chases him, but he escapes climbing up a building. Out of the blue, Mildred is convinced by her mother to visit Harold without previous notice and he pretends to be the manager of De Vore. When Harold overhears the general manager telling that he would give one thousand dollars to to anyone that could promote De Vore attracting people to the department store, he offers five hundred dollars to Bill to climb up the Bolton Building. However things go wrong when the angry policeman decides to check whether the mystery man that will climb up the building is the one who pushed him over on the floor. _IMDb by  Claudio Carvalho, Rio de Janeiro, Brazil STORYLINE : A young man named Harold leaves his small home town of Great Bend to head to the big city so that he can earn enough money to marry his sweetheart, Mildred. He finds that life in the big city is more difficult than he imagined, he only managing to get a low paying sales clerk job at De Vore's Department Store. He even has to share a room with his pal Bill to make ends meet. In the meantime, he writes letters home to Mildred, telling her that he has a great job, and to be patient as he will soon be able to send for her, which is the farthest thing from the truth. He even sends her gifts which he can ill afford. Harold gets into one misadventure after another as he works on not getting fired. His life gets more complicated as Mildred makes a surprise visit into the city, which makes his task of masquerading as a high powered businessman even more difficult, while still trying to do his job under the watchful and critical eye of the department store's head floorwalker, Mr. Stubbs. Harold thinks all his prayers are answered when, after overhearing a conversation with De Vore's General Manager, he comes up with a scheme to make enough money to get married using Bill's special skills. But Harold may have to use those skills himself in order to carry out that scheme. _IMDb by Huggo ** The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org , are for educational purposes. I have uploaded each movie for posterity , with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws . DEF gp ddh ** (Thank you, ict4eso )",
      "fileSize": 44383310,
      "addedAt": "2026-01-07T00:10:40.951Z",
      "thumbnail": "https://archive.org/services/img/safety-last-1923-silent-film-noir-comedy-short",
      "language": "eng",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 4894
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/safety-last-final_202506",
      "id": "safety-last-final_202506",
      "title": "Safety Last! (1923)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The film infamous for the clocktower stunt near the end, Safety Last! was also critically acclaimed and a massive hit upon release. While the film was billed as a romantic-comedy, the stunt work and slapstick is more impressive than the writing and romance for much of the picture. ",
      "fileSize": 6464163594,
      "addedAt": "2026-01-07T00:10:40.951Z",
      "thumbnail": "https://archive.org/services/img/safety-last-final_202506",
      "language": "eng",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 79
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-safety-last",
      "id": "silent-safety-last",
      "title": "Safety Last!",
      "fileSize": 23941381862,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-safety-last",
      "language": "English",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 2371
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "74 min",
    "imdbRating": 8.1,
    "imdbVotes": 23503,
    "Genre": "Action, Comedy, Thriller",
    "Plot": "In 1922, the country boy Harold says goodbye to his mother and his girlfriend Mildred in the train station and leaves Great Bend expecting to be successful in the big city. Harold promises to Mildred to get married with her as soon as he \"make good\". Harold shares a room with his friend \"Limpy\" Bill and he finally gets a job as salesman in the De Vore Department Store. However, he pawns Bill's phonograph, buys a lavaliere and writes to Mildred telling that he is a manager of De Vore. One day, Harold sees an old friend from Great Bend that is a policeman and when he meets his friend Bill, he asks Bill to push the policeman over him and make him fall down. However Bill pushes the wrong policeman that chases him, but he escapes climbing up a building. Out of the blue, Mildred is convinced by her mother to visit Harold without previous notice and he pretends to be the manager of De Vore. When Harold overhears the general manager telling that he would give one thousand dollars to to anyone that could promote De Vore attracting people to the department store, he offers five hundred dollars to Bill to climb up the Bolton Building. However things go wrong when the angry policeman decides to check whether the mystery man that will climb up the building is the one who pushed him over on the floor.",
    "Director": "Fred C. Newmeyer, Sam Taylor",
    "Writer": "Hal Roach, Sam Taylor, Tim Whelan",
    "Actors": "Harold Lloyd, Mildred Davis, Bill Strother",
    "Language": "English",
    "Country": "United States",
    "Awards": "4 wins & 1 nomination"
  },
  "relatedMovies": [
    "tt0013075",
    "tt0014611",
    "tt0015002",
    "tt0014945",
    "tt0012642",
    "tt0012499",
    "tt0015841",
    "tt0010146",
    "tt13423326",
    "tt0112747",
    "tt2278050",
    "tt0120901"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}