{
  "movieId": "tt0024267",
  "title": "The Lone Avenger",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheLoneAvenger1933",
      "id": "TheLoneAvenger1933",
      "title": "The Lone Avenger",
      "description": "Title: The Lone Avenger Summary: A prominent banker commits suicide. His son thinks otherwise and sets out to prove it. Directed by: Alan James Actors: Ken Maynard, Muriel Gordon, James A. Marcus Production Company: K.B.S. Productions Inc. Release Date: 14 May 1933 (USA) Aspect Ratio: 1.37 : 1 Cal Weston, after an absence of many years (in a remake of his 1930 Universal film \"The Fighting Legion\"), rides into Mesa to visit his father, co-partner of the town bank with Jud Winters. Cal discovers the sheriff and the coroner, Doctor Crandall in his father's office examining his body with Crandall rendering a verdict of suicide. Cal knows it wasn't suicide as the gun is in his right hand and John Weston was left handed, and he cautions Winters, the only person in town who knows his true identity, not to reveal it. Cal then begins his quest to find the killer and the motive, a quest hampered when the bank's crooked bookkeeper Martin Carter has his henchman Burl Adams and two accomplices ambush and shoot the examiner from the country seat, and then has a fake examiner declare that the bank has been looted by John Weston, and Carter declares that Cal, whose true identity has been learned, knows where the money is. Maynard, as usual, gets tied up in order his give his horse \"Tarzan\"...",
      "fileSize": 401267054,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheLoneAvenger1933",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 12796
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_tW9taqcYEs",
      "id": "_tW9taqcYEs",
      "title": "The Lone Avenger (1933) KEN MAYNARD",
      "description": "Stars: Ken Maynard, Muriel Gordon, James A. Marcus\n Director: Alan James\n\n A prominent banker commits suicide. His son thinks otherwise and sets out to prove it.",
      "addedAt": "2025-12-26T23:51:42.730Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/_tW9taqcYEs/maxresdefault.webp",
      "duration": 3238,
      "language": "en",
      "year": 1933,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "61 min",
    "imdbRating": 6.5,
    "imdbVotes": 70,
    "Genre": "Western",
    "Plot": "Cal Weston, after an absence of many years (in a remake of his 1930 Universal film \"The Fighting Legion\"), rides into Mesa to visit his father, co-partner of the town bank with Jud Winters. Cal discovers the sheriff and the coroner, Doctor Crandall in his father's office examining his body with Crandall rendering a verdict of suicide. Cal knows it wasn't suicide as the gun is in his right hand and John Weston was left handed, and he cautions Winters, the only person in town who knows his true identity, not to reveal it. Cal then begins his quest to find the killer and the motive, a quest hampered when the bank's crooked bookkeeper Martin Carter has his henchman Burl Adams and two accomplices ambush and shoot the examiner from the country seat, and then has a fake examiner declare that the bank has been looted by John Weston, and Carter declares that Cal, whose true identity has been learned, knows where the money is. Maynard, as usual, gets tied up in order his give his horse \"Tarzan\" a chance at untying the sugar-coated, loosely tied rope.",
    "Director": "Alan James",
    "Writer": "Betty Burbridge, Bennett Cohen, Forrest Sheldon",
    "Actors": "Ken Maynard, Muriel Gordon, James A. Marcus",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0024444",
    "tt0023604",
    "tt0025269",
    "tt0027165",
    "tt0036101",
    "tt0027917",
    "tt0134216",
    "tt0172155",
    "tt0030959",
    "tt0023967",
    "tt0025303",
    "tt0022988"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}