{
  "movieId": "tt0072714",
  "title": "Blue Jeans",
  "year": 1975,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-cop-in-blue-jeans",
      "id": "the-cop-in-blue-jeans",
      "title": "The Cop In Blue Jeans",
      "description": "An undercover police officer follows the trail of a series of purse snatchers to track down a crime lord accused of stealing five million dollars.",
      "fileSize": 965260889,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-cop-in-blue-jeans",
      "collection": "feature_films",
      "downloads": 9476
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "93 min",
    "imdbRating": 5.2,
    "imdbVotes": 410,
    "Genre": "Drama",
    "Plot": "Daniela is a 17-year-old prostitute named for the provocatively scanty blue jean shorts she wears to attract customers. She is taken in by the local police when caught with a client in the back seat of his car. Under questioning, she claims she is the daughter of Dr. Carlo Anselmi who is restoring a castle in the Lazio region of Italy. He is brought in and strenuously denies that she is related to him. But the official in charge of the case rules that he must accept custody of her until further information is available. At the castle, she waltzes around, fawning attention on Carlo, much to the dismay of his current girlfriend, Marisa. Marisa can see that Carlo is slowing being reeled in by Daniela. Marisa poses an ultimatum to send Daniela away, which Carlo ignores. So Marisa leaves. Shortly thereafter, Sergio, Daniela's former pimp, finds her at the castle and masquerades as laborer who cannot speak. In secret, he is plotting to kill Carlo so that Daniela (and him) can inherit his estate. Daniela will not play along because she has grown to love Carlo and he, in return, loves her.",
    "Director": "Mario Imperoli",
    "Writer": "Mario Imperoli, Piero Regnoli",
    "Actors": "Gloria Guida, Paolo Carlini, Annie Carol Edel",
    "Language": "Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0071411",
    "tt0072613",
    "tt0072730",
    "tt0072615",
    "tt0071112",
    "tt0073418",
    "tt0299568",
    "tt0325263",
    "tt0189406",
    "tt0072648",
    "tt0073076",
    "tt0072878"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.682Z"
}