{
  "imdbId": "tt0033615",
  "title": "Footlight Fever",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/footlight-fever-1941-i",
      "title": "Footlight Fever 1941 I",
      "description": "Alan Mowbray Mantan Moreland, Keye Luke",
      "id": "footlight-fever-1941-i"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "69 min",
    "imdbRating": "5.8",
    "imdbVotes": "77",
    "Genre": "Comedy, Romance",
    "Plot": "Unable to secure financial backers for their new Broadway play, producers Don Avery and Geoffrey Crandall are about to abandon their endeavors when they are visited by wealthy Eileen Drake, the fiance of their leading man, John Carter. Eileen pleads with Avery and Crandall to continue their search for a backer because John refuses to marry her until he has a job. The producers try to convince Eileen to invest in their play, but she tells them that her fortune is held in trust by her reclusive aunt Hattie, who is dominated by her imperious business manager, Harvey Parker. Learning that Hattie has sequestered herself in the house for thirty years while waiting for the return of her long-lost love, Charlie Farley, the first mate on a whaling ship, Avery and Crandall decide to pose as Charlie's mates and visit Hattie. After informing Hattie of her beloved Charlie's demise, Avery and Crandall present her with Charlie's most cherished possession: a play that he wrote for her. In memoriam, Hattie asks the two to take her to a riverfront bar that she and Charlie used to frequent. There Hattie learns that Charlie's shipmates are impostors when the bartender shows her a photograph of a very alive Charlie with his arms around two women. To teach Avery and Crandall a lesson, Hattie incites a night of barroom brawling, after which the beaten producers confess their true identity and ask her for money. Hattie sends Harvey to meet with the producers, and he agrees to recommend that she finance their play if Avery and Crandall will pay him twenty percent of the proceeds. After Hattie advances the producers the first half of her payment, rehearsals begin. The production proceeds smoothly until Harvey, who is in love with Eileen, learns that she and John are engaged and demands a new leading man before delivering the final check. To placate Harvey, Crandall proposes that Avery play the lead in dress rehearsal until they receive Hattie's check, and then John will step into the role on opening night. When Avery becomes enamored by his own performance, however, he decides to continue the role. On opening night, Crandall arranges for a sandbag to drop on Avery's head, but the bag misses Avery and hits Harvey instead. Retiring to his dressing room to adjust his makeup, Avery is confronted by two robbers, who knock him unconscious. When Harvey's meek assistant Holly tells Hattie that the business manager has been swindling her, Hattie gives Eileen and John her blessing. John steps into the leading role, and as the play is about to begin, Crandall is hit by a sandbag. When the two producers finally awaken in the hospital, they rush to the theater ,where they are greeted by a sign announcing that their play is in its second successful month.",
    "Director": "Irving Reis",
    "Writer": "Bert Granet, Ian McLellan Hunter, Paul Gerard Smith",
    "Actors": "Alan Mowbray, Donald MacBride, Elisabeth Risdon",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0032373",
      "title": "Curtain Call",
      "year": 1940,
      "imdbRating": "5.8",
      "imdbVotes": "238",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033891",
      "title": "Meet John Doe",
      "year": 1941,
      "imdbRating": "7.6",
      "imdbVotes": "16,080",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033435",
      "title": "Broadway Limited",
      "year": 1941,
      "imdbRating": "5.7",
      "imdbVotes": "389",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033632",
      "title": "Frau Luna",
      "year": 1941,
      "imdbRating": "7.3",
      "imdbVotes": "25",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033878",
      "title": "Immer nur Du",
      "year": 1941,
      "imdbRating": "7.3",
      "imdbVotes": "36",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034265",
      "title": "Tanz mit dem Kaiser",
      "year": 1941,
      "imdbRating": "6.7",
      "imdbVotes": "32",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034730",
      "title": "Fiesta",
      "year": 1941,
      "imdbRating": "4.8",
      "imdbVotes": "150",
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034831",
      "title": "Harvard, Here I Come!",
      "year": 1941,
      "imdbRating": "5.4",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034115",
      "title": "Road Show",
      "year": 1941,
      "imdbRating": "6.0",
      "imdbVotes": "540",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034264",
      "title": "Tanks a Million",
      "year": 1941,
      "imdbRating": "5.9",
      "imdbVotes": "308",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033414",
      "title": "The Body Disappears",
      "year": 1941,
      "imdbRating": "6.1",
      "imdbVotes": "578",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033457",
      "title": "Charley's Aunt",
      "year": 1941,
      "imdbRating": "6.8",
      "imdbVotes": "699",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T06:13:46.844Z"
}