{
  "movieId": "tt0005198",
  "title": "The Dinosaur and the Missing Link: A Prehistoric Tragedy",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-dinosaur-and-the-missing-link-a-prehistoric-tragedy",
      "id": "silent-the-dinosaur-and-the-missing-link-a-prehistoric-tragedy",
      "title": "The Dinosaur and the Missing Link: A Prehistoric Tragedy",
      "fileSize": 112628557,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-dinosaur-and-the-missing-link-a-prehistoric-tragedy",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 688
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "5 min",
    "imdbRating": 6.1,
    "imdbVotes": 396,
    "Genre": "Comedy, Short, Animation",
    "Plot": "Two cavemen, The Duke and Stonejaw Steve, call on Miss Araminta Rockface. The hated rivals fight, and Steve wins when he throws The Duke into a pot of boiling water. A title card introduces a third rival, \"our unassuming hero, Theophilus Ivoryhead.\" Miss Rockface invites the three men into her father's drawing room/cave, apologizing for not offering tea, since it has not been discovered yet. The Duke and Steve fight again, and everyone rushes out of the cave. Mr. Rockface notices his pot of food is empty; earlier, Wild Willie the Missing Link had eaten it. Mr. Rockface tells the three suitors they will have to procure their own dinner. Steve locates a desert quail and shoots an arrow at it, but the arrow misses the quail and happily (for Steve) hits The Duke's behind. Meanwhile, Wild Willie is still hungry and goes hunting for snakes. He finds a dinosaur's tail instead, and when he tries to eat it the dinosaur kills him. Luckily, Theophilus witnesses this scene; after the dinosaur leaves he stands on the dead monkey-man, as if triumphant. The others arrive and are shocked that Theophilus apparently has slain the terror of the countryside. And happy Theophilus finds himself smothered in Araminta's kisses.",
    "Director": "Willis H. O'Brien",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0007208",
    "tt0005114",
    "tt0005220",
    "tt0362950",
    "tt0362535",
    "tt0006449",
    "tt0365053",
    "tt0003784",
    "tt0146448",
    "tt0245297",
    "tt0147083",
    "tt0005891"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}