{
  "movieId": "tt0009732",
  "title": "Two-Gun Gussie",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/two-gun-gussie-1918-directed-by-alfred-j.-goulding",
      "id": "two-gun-gussie-1918-directed-by-alfred-j.-goulding",
      "title": "Two Gun Gussie (1918) Directed By Alfred J. Goulding",
      "description": "Two-Gun Gussie Duration: 8 minutes and 31 seconds. 8:31 Directed by Alfred J. Goulding Written by H. M. Walker Produced by Hal Roach Starring Harold Lloyd Cinematography Walter Lundin Release date May 19, 1918 Running time 8 minutes Country United States Languages Silent English intertitles Two-Gun Gussie is a 1918 American short comedy film featuring Harold Lloyd . Plot Gussie (Harold Lloyd) is a mild-mannered easterner who finds employment as a piano player in a rowdy western saloon. Dagger-Tooth Dan, the toughest character in town, sees two letters the local sheriff has received. One includes a picture of him, from another western sheriff, with a warning that Dan is a violent menace. The other letter contains a photo of Gussie and a check from his father, asking the sheriff to gave the check to Gussie. Dan switches the photos in the envelopes so that he receives Gussie's check. Furthermore, the sheriff now believes that Gussie is a violent gunman. Within a short time, the entire town is scared of Gussie's reputation. Gussie himself starts to believe he is a tough guy. Inevitably, Gussie clashes with Dagger-Tooth Dan. Cast Harold Lloyd as Two-Gun Gussie (Harold) Snub Pollard as Snub (credited as Harry Pollard) Bebe Daniels as The Girl William Blaisdell as Dagger-Tooth Dan Charles Stevenson as Whooping-Cough Charlie, the Sheriff Sammy Brooks (uncredited) Billy Fay (uncredited) William Gillespie as Angry bar patron (uncredited) Helen Gilmore (uncredited) Lew Harvey (uncredited) Wallace Howe (uncredited) Bud Jamison (uncredited) Gus Leonard as Conservatory listener / bar patron (uncredited) Fred C. Newmeyer (uncredited) James Parrott (uncredited) Dorothea Wolbert as An Admirer (uncredited) Reception Like many American films of the time, Two-Gun Gussie was subject to restrictions and cuts by city and state film censorship boards . For example, the Chicago Board of Censors cut the vulgar action of a man after being shot in the posterior. [ 1 ] References 1 \"Official Cut-Outs by the Chicago Board of Censors\" . Exhibitors Herald . 6 (24). New York City: Exhibitors Herald Company: 31. June 8, 1918.",
      "fileSize": 293591600,
      "addedAt": "2026-01-07T00:12:55.131Z",
      "thumbnail": "https://archive.org/services/img/two-gun-gussie-1918-directed-by-alfred-j.-goulding",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 127
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "8 min",
    "imdbRating": 5.6,
    "imdbVotes": 320,
    "Genre": "Comedy, Short, Western",
    "Plot": "A mild-mannered young man has left home, and is now playing the piano in a bar in the west. The dangerous criminal Dagger-Tooth Dan enters the bar where the young man is playing. Soon afterwards, the local sheriff also arrives, with some letters that he has received. Dan notices the letters, and he switches the information in them to make the sheriff think that the piano player is the dangerous one.",
    "Director": "Alfred J. Goulding",
    "Writer": "H.M. Walker",
    "Actors": "Harold Lloyd, 'Snub' Pollard, Bebe Daniels",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0009099",
    "tt0009071",
    "tt0009082",
    "tt0009171",
    "tt0009316",
    "tt0009678",
    "tt0009631",
    "tt0007709",
    "tt0007764",
    "tt0010023",
    "tt0007686",
    "tt0010516"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.131Z"
}