{
  "imdbId": "tt0005047",
  "title": "The Call of the City",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-call-of-the-city",
      "title": "The Call of the City",
      "fileSize": 217470809,
      "id": "silent-the-call-of-the-city"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.5,
    "imdbVotes": 51,
    "Genre": "Short, Drama",
    "Plot": "Bessie Graham has been a sort of maid-of-all-work in her mother's boarding house for years. Determined to make a change, she tells her mother that she is going to strike out for herself and try to get a position in the city. Arrived in the city, she rents a cheap room and starts to look for work. At two or three different places she is told that only trained assistants are required. Coming out of an office building, where she has met with another refusal, she starts down the street, almost in tears. A woman of the underworld, flashily dressed, sees her, and so does the woman's male companion. Approaching Bessie, the woman tells her that if she is in trouble, she may be able to help her. Bessie is glad. The man trails along behind, and suddenly coming up with them, speaks. The woman introduces him to Bessie as her husband. Together the three continue down the street. Turning a corner, they run into a tough-looking customer, who, the moment he sees the woman's \"husband,\" halts the party and starts in to hurl epithets at the man. When the man gets back at him the tough hits him a stinging blow in the face, declaring that this is one time his game of trapping young girls is going to be spoiled. A furious struggle commences, the woman, meantime, making a quick get-away from the scene. Bessie stands there, paralyzed with fear as the men both draw revolvers. A moment later, there is a shot fired, and the tough turns and runs down the street, leaving the other man lying at Bessie's feet dead. In an upper room of the building in front of which the fight has taken place. Jim Ross, a young newspaper man, is hard at work, writing. He hears the shot and rushes downstairs. Taking hold of Bessie's hand, he pulls her into the hallway, closing and locking the door. A moment later, two policemen dash around the corner. The janitor tells the cops that a girl was with the murdered man when the fight started. The cops have the body removed and one of them remains on guard, waiting for a chance to get into the house, they having discovered that the door is locked. At last, Jim tells Bessie that the policeman will probably stay on guard all night, and offers to let her sleep in his room. She trusts him instinctively and accepts the offer. The next morning the police, armed with a search warrant, come to his room, accompanied by the janitor. As they knock on the door, Jim tells Bessie that she had better pretend to be his wife. When the police enter, Jim tells them that Bessie is his wife, and that they know nothing of the murder. The janitor, \"getting wise,\" does not give Jim away, and after the police have gone satisfied with their investigation. Jim tells Bessie that he wishes, now that she has posed as his wife, and she would make it come true. And Bessie does.",
    "Director": "Harry Beaumont",
    "Writer": "Mark Swan",
    "Actors": "Bessie Learn, Margery Bonney Erskine, Robert Walker",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0477332",
      "title": "The Lone Game",
      "year": 1915,
      "imdbRating": 5,
      "imdbVotes": 104,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1262050",
      "title": "McQuade of the Traffic Squad",
      "year": 1915,
      "imdbRating": 6.2,
      "imdbVotes": 35,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0234953",
      "title": "An Unsullied Shield",
      "year": 1913,
      "imdbRating": 5.1,
      "imdbVotes": 97,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003803",
      "title": "Crossed Wires",
      "year": 1915,
      "imdbRating": 6.2,
      "imdbVotes": 47,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005414",
      "title": "Daydreams",
      "year": 1915,
      "imdbRating": 6.7,
      "imdbVotes": 309,
      "language": "None, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0231300",
      "title": "Brought Home",
      "year": 1915,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005246",
      "title": "Enoch Arden",
      "year": 1915,
      "imdbRating": 6.3,
      "imdbVotes": 127,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0812323",
      "title": "The Master of the Sword",
      "year": 1915,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0482779",
      "title": "In the Hands of the Enemy",
      "year": 1915,
      "imdbRating": 5.8,
      "imdbVotes": 26,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005622",
      "title": "Liliya Belgii",
      "year": 1915,
      "imdbRating": 6.9,
      "imdbVotes": 196,
      "language": "None, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0228815",
      "title": "Santa Claus vs. Cupid",
      "year": 1915,
      "imdbRating": 4.8,
      "imdbVotes": 230,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0442148",
      "title": "The Doll-House Mystery",
      "year": 1915,
      "imdbRating": 5.4,
      "imdbVotes": 28,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}