{
  "imdbId": "tt0036391",
  "title": "Stormy Weather",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/StormyWeatherUK",
      "id": "StormyWeatherUK",
      "title": "Stormy Weather",
      "description": "  “Screamingly funny!” “Don’t miss it” (IMDB reviews quotes). Tom Walls starrs in this risque comedy of British upper-middle-class morals. Yvonne Arnaud is a large part of the naughty fun. Based on an Aldwych Theater farce written and adapted for the screen by Ben Travers. This is another one that wouldn’t have gotten past the US censors. IMDB rating 6.2.  (Not to be confused with the 1943 American musical \"Stormy Weather,\" starring Lena Horne and Bill Robinson.) Directed by Tom Walls. Released in 1935 (UK only). The last 20 seconds are missing including the closing credits.",
      "fileSize": 1071185756,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/StormyWeatherUK",
      "collection": "feature_films",
      "downloads": 13530
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "78 min",
    "imdbRating": 7.3,
    "imdbVotes": 2945,
    "Genre": "Comedy, Drama, Music",
    "Plot": "Dancing great Bill 'Williamson' sees his face on the cover of Theatre World magazine and reminisces: just back from World War I, he meets lovely singer Selina Rogers at a soldiers' ball and promises to come back to her when he \"gets to be somebody.\" Years go by, and Bill and Selina's rising careers intersect only briefly, since Selina is unwilling to \"settle down.\" Will she ever change her mind? Concludes with a big all-star show hosted by Cab Calloway.",
    "Director": "Andrew L. Stone",
    "Writer": "Frederick J. Jackson, Ted Koehler, H.S. Kraft",
    "Actors": "Lena Horne, Bill Robinson, Cab Calloway and His Cotton Club Orchestra",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0036382",
    "tt0037361",
    "tt0037541",
    "tt0035996",
    "tt0039948",
    "tt0037530",
    "tt3480060",
    "tt0022789",
    "tt0020828",
    "tt0071112",
    "tt0036094",
    "tt0029209"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.269Z"
}