{
  "imdbId": "tt0046851",
  "title": "A Story from Chikamatsu",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-story-from-chikamatsu",
      "id": "a-story-from-chikamatsu",
      "title": "A Story From Chikamatsu",
      "description": "One of a string of late-career masterworks made by Kenji Mizoguchi in the first half of the 1950s,  A Story from Chikamatsu  (a.k.a.  The Crucified Lovers ) is an exquisitely moving tale of forbidden love struggling to survive in the face of persecution. Based on a classic of eighteenth-century Japanese drama, the film traces the injustices that befall a Kyoto scroll maker’s wife and his apprentice after each is unfairly accused of wrongdoing. Bound by fate in an illicit, star-crossed romance, they go on the run in search of refuge from the punishment prescribed them: death. Shot in gorgeous, painterly style by master cinematographer Kazuo Miyagawa, this delicately delivered indictment of societal oppression was heralded by Akira Kurosawa as a “great masterpiece that could only have been made by Mizoguchi.” A Story from Chikamatsu  was restored by Kadokawa Corporation and The Film Foundation at Cineric, Inc., in New York, with sound by Audio Mechanics and the cooperation of The Japan Foundation. Special thanks to Masahiro Miyajima and Martin Scorsese for their consultation.",
      "fileSize": 8421341593,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-story-from-chikamatsu",
      "language": "jpn",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 8487
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "102 min",
    "imdbRating": 8,
    "imdbVotes": 5044,
    "Genre": "Drama, Romance, Thriller",
    "Plot": "To save her brother and the ancestral house from the heavy burden of an unfulfilled debt, Osan--the noble wife of the parsimonious but reputable scroll-maker, Ishun--turns to her husband's kind-hearted employee, Mohei. However, a transparent forgery paired with a preposterous accusation will force the pair to escape from the printer's unwelcome Kyoto household, seeking refuge in 17th-century Osaka's inhospitable streets. Now, amid scandalous and disquieting rumours--and constantly under threat--Mohei and Osan seem to fight a lost battle. What fate awaits the fugitives from Chikamatsu?",
    "Director": "Kenji Mizoguchi",
    "Writer": "Kyuichi Tsuji, Monzaemon Chikamatsu, Matsutarô Kawaguchi",
    "Actors": "Kazuo Hasegawa, Kyôko Kagawa, Eitarô Shindô",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "1 win & 2 nominations"
  },
  "relatedMovies": [
    "tt0047445",
    "tt0032156",
    "tt0046478",
    "tt0052106",
    "tt0048933",
    "tt0045112",
    "tt0037547",
    "tt16156352",
    "tt0047505",
    "tt0035612",
    "tt0038990",
    "tt0047101"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}