{
  "imdbId": "tt0032043",
  "title": "Topper Takes a Trip",
  "year": 1938,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ifsus0kMNk8",
      "title": "Topper Takes a Trip (1938) | Colorized Public Domain Cult Comedy | Constance Bennett & Roland Young",
      "description": "Topper Takes a Trip (1938) is a fantasy comedy directed by Norman Z. McLeod, serving as the sequel to the hit 1937 film Topper. This lighthearted public domain classic continues the adventures of the mild-mannered banker Cosmo Topper (Roland Young) as he once again becomes entangled with the mischievous ghost Marion Kerby (Constance Bennett). With humor, romance, and supernatural charm, the film mixes witty dialogue, screwball antics, and whimsical fantasy. Now restored and colorized, this edition revives a beloved Golden Age comedy for audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe story begins after the death of Marion’s husband George Kerby (Cary Grant’s character from the original film, absent in this sequel). Marion Kerby (Constance Bennett) finds herself in the afterlife, tasked with performing a good deed to gain entry into heaven. Her mission: to save Cosmo Topper (Roland Young), who has fallen into despair after separating from his wife Clara (Billie Burke).\n\nMarion reappears on Earth, visible only to Topper, and sets about repairing his marriage while causing her usual share of chaos. The setting moves to the French Riviera, where Topper has traveled, giving the film a glamorous European backdrop. With the help of Skippy the dog — who also appears as a ghost — Marion interferes with Topper’s romantic entanglements, tests his patience, and ultimately helps reunite him with Clara.\n\nThrough a series of comedic misunderstandings, supernatural tricks, and heartfelt interventions, Marion succeeds in both her mission and in reaffirming Topper’s sense of joy and love. The film concludes on a warm and humorous note, staying true to the charm of the original story.\n\nCast and Crew:\n• Director: Norman Z. McLeod\n• Producer: Hal Roach\n• Screenplay: Eric Hatch, Jack Jevne\n• Based on: Characters created by Thorne Smith\n• Music: Hugo Friedhofer (uncredited themes)\n• Cinematography: Norbert Brodine\n• Editing: William Terhune\n\nStarring:\n• Constance Bennett as Marion Kerby\n• Roland Young as Cosmo Topper\n• Billie Burke as Clara Topper\n• Alan Mowbray as Wilkins the Butler\n• Verree Teasdale as Mrs. Parkhurst\n• Franklin Pangborn as Hotel Detective\n• Alexander D’Arcy as Baron de Rossi\n• Rafaela Ottiano as Suzanne\n• Skippy the Dog as Mr. Atlas (the ghost dog)\n\nFilm Significance:\n“Topper Takes a Trip” is remembered as a charming continuation of the original Topper, which was itself one of the most successful fantasy comedies of the 1930s. While Cary Grant did not reprise his role, Constance Bennett carried the film with her glamorous and witty performance. Roland Young’s return as Cosmo Topper earned him an Academy Award nomination for Best Supporting Actor, a rare honor for a comedic role at the time.\n\nThe film also stands out for its blending of screwball comedy with supernatural fantasy, a combination that influenced later Hollywood comedies involving ghosts, spirits, and whimsical afterlife themes. Its restoration and colorization breathe new life into a story that reflects the escapist humor of the Depression-era audience while still entertaining today’s viewers with timeless charm.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Topper Takes a Trip remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1938 release was in black and white, typical of its era. While elegant, black-and-white films can be overlooked by modern viewers. This colorized edition bridges the gap between classic Hollywood storytelling and contemporary viewing habits, giving audiences a vibrant way to rediscover Constance Bennett’s sparkling wit, Roland Young’s comedic brilliance, and Billie Burke’s endearing charm.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TopperTakesATrip #ConstanceBennett #RolandYoung #BillieBurke #1930sComedy #FantasyComedy #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #FilmRestoration",
      "id": "ifsus0kMNk8",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "80 min",
    "imdbRating": "6.5",
    "imdbVotes": "1,544",
    "Genre": "Comedy, Fantasy, Romance",
    "Plot": "Mrs. Topper's friend Mrs. Parkhurst has convinced Mrs. Topper to file for a divorce from Cosmo, due to the strange circumstances of his trip with ghost Marion Kirby. Marion comes back from heaven's door to help Cosmo again, this time only with dog Mr. Atlas. Due to the strange behavior of Cosmo, the judge refuses to divorce them, so Mrs. Parkhurst takes Mrs. Topper on a trip to France, where she tries to arrange the final reasons for the divorce, with the help of a gold-digging French baron. Marion takes Cosmo to the same hotel, to bring them back together and to get her own final ticket to heaven, but the whole thing turns out to be not so easy...",
    "Director": "Norman Z. McLeod",
    "Writer": "Jack Jevne, Eddie Moran, Corey Ford",
    "Actors": "Constance Bennett, Roland Young, Billie Burke",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0029682",
      "title": "Topper",
      "year": 1937,
      "imdbRating": "7.2",
      "imdbVotes": "8,583",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044962",
      "title": "Never Wave at a WAC",
      "year": 1953,
      "imdbRating": "5.9",
      "imdbVotes": "620",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033414",
      "title": "The Body Disappears",
      "year": 1941,
      "imdbRating": "6.1",
      "imdbVotes": "578",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033712",
      "title": "Here Comes Mr. Jordan",
      "year": 1941,
      "imdbRating": "7.5",
      "imdbVotes": "7,543",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034881",
      "title": "I Married a Witch",
      "year": 1942,
      "imdbRating": "7.1",
      "imdbVotes": "10,422",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032717",
      "title": "Little Men",
      "year": 1940,
      "imdbRating": "5.6",
      "imdbVotes": "402",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029201",
      "title": "The Man Who Could Work Miracles",
      "year": 1936,
      "imdbRating": "6.9",
      "imdbVotes": "1,563",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0451808",
      "title": "Der Mann, der nicht nein sagen kann",
      "year": 1938,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030172",
      "title": "Gastspiel im Paradies",
      "year": 1938,
      "imdbRating": "7.1",
      "imdbVotes": "14",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030721",
      "title": "Scheidungsreise",
      "year": 1938,
      "imdbRating": "N/A",
      "imdbVotes": "7",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036962",
      "title": "It Happened Tomorrow",
      "year": 1944,
      "imdbRating": "7.0",
      "imdbVotes": "3,276",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030063",
      "title": "The Divorce of Lady X",
      "year": 1938,
      "imdbRating": "6.6",
      "imdbVotes": "1,581",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T14:24:41.155Z"
}