{
  "movieId": "tt0002356",
  "title": "The Melody of Love",
  "year": 1912,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6AOvUWH-C7k",
      "id": "6AOvUWH-C7k",
      "title": "The Melody of Love (LOVE COMEDY in full length, love drama films in German, new films)",
      "addedAt": "2025-12-23T23:54:22.304Z",
      "thumbnail": "https://i.ytimg.com/vi/6AOvUWH-C7k/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCRioiIpkOdOprH9iHevZUibNaxUA",
      "duration": 5445,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbVotes": null,
    "Genre": "Short, Drama, Romance",
    "Plot": "Maurice Eaton, a young musical composer, is engaged to marry Isobel McIntyre, a society belle. Eaton has composed a wedding march for their approaching nuptials but on the eve of the marriage he is stricken with a fever, which leaves him blind. The composer now realizes that he can never marry Isobel and tells her that the match must be broken off. Some years later the musician is forgotten and Isobel becomes engaged to a wealthy young society man. On the day of the wedding the church organist is taken ill and the church officials are in a quandary, when one of them remembers of a blind musician who lives in the neighborhood whose services might be obtained. Eaton, ignorant of who is to be wedded, is pressed into service and plays the wedding march he had composed for his own marriage. The bride, unable to place the familiar music, wishes to see the organist. In the semi-darkness of the organ loft she is unable to distinctly see the face of the organist, but Eaton easily recognizes the voice of his former sweetheart. The girl nearly faints when she at last sees who played the wedding march, and turning to her husband, begs to be taken away. At last the church is empty and the blind musician, left alone in his sorrow, bursts into tears.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Francis X. Bushman, Lily Branscombe, Frank Dayton",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0417062",
    "tt1207008",
    "tt0470339",
    "tt0463594",
    "tt0330942",
    "tt1113818",
    "tt0367144",
    "tt2160081",
    "tt1223220",
    "tt0344506",
    "tt0002045",
    "tt0002512"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:28:43.006Z"
}