{
  "imdbId": "tt0040829",
  "title": "The Amazing Mr. X",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheAmazingMr.X1948Avi",
      "title": "The Amazing Mr. X",
      "description": "1948 B thriller shot by renowned cinematographer John Alton , who was also involved with the following films already available on the archive: T-Men (1947), He walked by night (1948), Hollow triumph (aka The scar) (1948), The crooked way (1949), Reign of Terror (1949) and The big combo (1955). IMDB page: http://www.imdb.com/title/tt0040829/ Two years after the accidental death of her husband, Christine Faber (Lynn Bari) is trying to put her life back together and move forward. However, strange events lead her to believe that her husband is attempting to communicate with her, so she proceeds to consult the psychic Alexis (Turhan Bey). This worries her sister and her fiance, who suspect Alexis of being a crook and decide to prove so. This version (fetched from www.publicdomaintorrents.com) is brighter than the two versions already available on the archive, and does better justice to Alton's work. However, about a dozen seconds of the title scene are missing, so the nice piece of music that opens the film is truncated.",
      "id": "TheAmazingMr.X1948Avi"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/amazing_mr_x_ipod",
      "title": "Amazing Mr. X, The",
      "description": "You can find more information regarding this film on its IMDb page. http://imdb.com/title/tt0040829/",
      "id": "amazing_mr_x_ipod"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mr-x-4-k",
      "title": "The Amazing Mr.X (1948) [Colorized, 4K, 60FPS]",
      "description": "The Amazing Mr.X is a 1948 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "mr-x-4-k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iwyjnH7rOmg",
      "title": "The Amazing Mr. X (1948) [Film Noir] [Thriller]",
      "description": "\"The Amazing Mr. X\", also known as \"The Spiritualist\", is a film noir directed by Bernard Vorhaus with cinematography by John Alton. Like \"Nightmare Alley\" (1947), this film tells the story of a phony spiritualist racket. The film is prominently featured in Alton's book on cinematography \"Painting with Light\" (1949). The film stars Turhan Bey, Lynn Bari, Cathy O'Donnell, and Richard Carlson. Eagle-Lion Films signed a contract with Carole Landis for the part played by Bari, but Landis committed suicide a few days before shooting began.\n\nTwo years after her husband's death, Christine Faber (Lynn Bari) thinks she hears her late husband (Donald Curtis) calling out of the surf on the beach one night. She meets a tall dark man named Alexis (Turhan Bey) who seems to know all about her. After more ghostly manifestations, Christine and her younger sister (Cathy O'Donnell) become enmeshed in the strange life of Alexis; but he in turn finds himself manipulated into deeper cruelness than he had in mind.\n\n---\n\nDirected by Bernard Vorhaus, produced by Benjamin Stoloff, written by Crane Wilbur, Muriel Roy Bolton and Ian McLellan Hunter, starring Turhan Bey, Lynn Bari, Cathy O'Donnell, and Richard Carlson.\n\n---\n\nSource: \"The Amazing Mr. X\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 10 January 2013. Web. 12 March 2013. http://en.wikipedia.org/wiki/The_Amazing_Mr._X.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "id": "iwyjnH7rOmg",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-6zmT8ZNcZw",
      "title": "The Amazing Mr. X (1948) | Colorized Public Domain Film Noir with Turhan Bey and Lynn Bari",
      "description": "The Amazing Mr. X (1948), also known as The Spiritualist, is an American film noir directed by Bernard Vorhaus and produced by Benedict Bogeaus. This restored and colorized public domain classic blends gothic mystery, melodrama, and psychological intrigue into one of the most atmospheric thrillers of postwar Hollywood. Shot by celebrated cinematographer John Alton, the film is visually striking, combining deep shadows, eerie candlelit séances, and haunting seaside imagery that make it a forgotten masterpiece of noir cinema. By presenting this restored colorized edition, Colorized Public Domain invites modern audiences in the United States, Europe, and worldwide to rediscover its timeless suspense and beauty.\n\nPlot Summary:\nChristine Faber (Lynn Bari), a wealthy widow living in a luxurious seaside mansion, believes she hears the voice of her late husband calling to her from the crashing waves. Her younger sister, Janet (Cathy O’Donnell), is skeptical but concerned for Christine’s emotional well-being. Enter Alexis (Turhan Bey), a charismatic spiritualist who offers Christine comfort through séances, claiming he can communicate with the dead. His hypnotic presence both reassures and ensnares her, blurring the line between reality and deception.\n\nAs Christine becomes more entangled in Alexis’s manipulations, Janet discovers troubling truths about the so-called psychic. Unbeknownst to them, Christine’s supposedly deceased husband, Paul Faber (Richard Carlson), may not be as dead as everyone believes. Twists of betrayal, greed, and hidden motives culminate in a gripping finale that exposes the darkness behind Alexis’s carefully constructed illusion.\n\nCast and Crew:\n• Director: Bernard Vorhaus\n• Producer: Benedict Bogeaus\n• Screenplay: Crane Wilbur, Muriel Roy Bolton\n• Cinematography: John Alton\n• Editing: Lyle Boyer\n\nStarring:\n• Turhan Bey as Alexis, the “Amazing Mr. X”\n• Lynn Bari as Christine Faber\n• Cathy O’Donnell as Janet Burke\n• Richard Carlson as Paul Faber\n• Donald Curtis as Martin Abbott\n• Virginia Gregg as Emily\n\nFilm Significance:\nThe Amazing Mr. X is often celebrated as one of the most visually stunning B-movies of the 1940s. John Alton’s cinematography, filled with stark contrasts and dreamlike shadows, elevates the film far above its modest budget. The movie reflects postwar anxieties about death, faith, and fraud, tapping into the popularity of spiritualism in mid-20th-century America. While Turhan Bey never became a household name on the scale of Hollywood’s biggest stars, his performance here demonstrates why he was nicknamed “The Turkish Delight” in his prime. The combination of Bari’s emotional depth and O’Donnell’s sincerity strengthens the psychological tension.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Amazing Mr. X remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1948 release was shot in black and white, a hallmark of classic film noir. While striking in its shadows and contrast, many modern audiences skip over black-and-white features. This colorized version preserves John Alton’s visual genius while reintroducing the film to contemporary viewers with richer visual appeal. The eerie séances, crashing waves, and dramatic coastal mansion settings gain new intensity in color, making the suspense more immersive than ever.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from Hollywood’s Golden Age, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences worldwide.\n\n#TheAmazingMrX #TurhanBey #LynnBari #CathyODonnell #RichardCarlson #1940sFilmNoir #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #FilmRestoration #1948Movies #ClassicThriller #HauntedMystery",
      "id": "-6zmT8ZNcZw",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DvobIyML8OU",
      "title": "The Amazing Mr. X (1948) TURHAN BEY🍕 LYNN BARI🍕 NEW HD RESTORATION",
      "description": "It's Friday @PizzaFLIX \nCinematographer: John Alton\nStars: Turhan Bey, Lynn Bari, Cathy O'Donnell, Richard Carlson \nDirector: Bernard Vorhaus\nScore: Alexander Laszlo\n🍕RESTORED IN SPELLBINDING HD🍕\nA spiritualist convinces a grieving widow that he can communicate with her late husband. But is his crystal ball act just an elaborate hoax to defraud her?\n\nDim the lights for a moonlit dipped Noir, directed by Bernard Vorhaus and shot by legendary noir cinematographer John Alton!\n\nIn this atmospheric thriller, a mysterious spiritualist (Turhan Bey) convinces a grieving widow (Lynn Bari) that he can communicate with her deceased husband. But behind the séances and soft-spoken mysticism lies a deeper, darker con. Is he a true medium—or a master charlatan manipulating hearts and fortunes?\n\nWith Alton’s signature velvet shadows, crashing surf, and ghostly fog, this film delivers haunting noir visuals with an otherworldly twist. A must-watch for fans of classic Hollywood, noir thrillers, supernatural mysteries, and vintage con-man tales.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nDon’t forget to like, comment, and subscribe for more HD restorations of rare and classic films every week!\n\n#TheAmazingMrX #FilmNoir #NoirMovies #ClassicFilm #VintageCinema #JohnAlton #TurhanBey #LynnBari #CathyODonnell #RichardCarlson #BernardVorhaus #Spiritualist #Charlatan #MysteryMovies #SupernaturalNoir #HDRestoration #OldHollywood #BlackAndWhiteFilm #1940sCinema #NoirThriller #PsychologicalThriller #GhostStory #ClassicMystery #RetroMovies #ClassicCinema #NoirAesthetic #CinematographyMasterpiece #VelvetShadows #HauntedCinema #Seance #MediumMystery #ConArtist #RareFilms #ClassicMovieRestoration #MoonlightNoir #PizzaFLIX #CultClassics #AlexanderLaszlo  #NoirLegend #VintageThriller #HollywoodGoldenAge",
      "id": "DvobIyML8OU",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-amazing-mr.-x-1948",
      "title": "The Amazing Mr. X (1948)",
      "description": "On the beach one night, Christine Faber, two years a widow, thinks she hears her late husband Paul calling out of the surf...then meets a tall dark man, Alexis, who seems to know all about such things. After more ghostly manifestations, Christine and younger sister Janet become enmeshed in the eerie artifices of Alexis; but he in turn finds himself manipulated into deeper deviltry than he had in mind... Watch on RetroFlix:  https://retroflix.org/the-amazing-mr-x-1948/",
      "id": "the-amazing-mr.-x-1948"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-amazing.-mr..-x.-1948",
      "title": "The Amazing Mr. X (1948)",
      "description": "The Amazing Mr. X, also known as The Spiritualist, is a 1948 American horror thriller film noir directed by Bernard Vorhaus. The film features a blend of mystery and supernatural elements, focusing on a fraudulent spiritualist.The story revolves around Christine Faber, a wealthy widow who seeks the help of Alexis, a supposed spiritualist. He appears to communicate with her deceased husband, but his abilities are revealed to be illusions created through special effects and prior knowledge of Christine's life. As Christine becomes more involved with Alexis, her sister and fiancé suspect foul play and try to uncover the truth. The film is noted for its atmospheric cinematography by John Alton, which enhances its noir aesthetic. It explores themes of deception, grief, and the allure of the supernatural.",
      "id": "the.-amazing.-mr..-x.-1948"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1948-the-amazing-mr-x-bernard-vorhaus-vose",
      "title": "1948 - The Amazing Mr X - Bernard Vorhaus - VOSE",
      "description": "For Academic - Educational Use Only https://derechonoir.wordpress.com/",
      "id": "1948-the-amazing-mr-x-bernard-vorhaus-vose"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/amazing_mr_x",
      "title": "Amazing Mr. X , The",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "amazing_mr_x"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "78 min",
    "imdbRating": "6.4",
    "imdbVotes": "2,312",
    "Genre": "Film-Noir, Horror, Thriller",
    "Plot": "On the beach one night, Christine Faber, two years a widow, thinks she hears her late husband Paul calling out of the surf...then meets a tall dark man, Alexis, who seems to know all about such things. After more ghostly manifestations, Christine and younger sister Janet become enmeshed in the eerie artifices of Alexis; but he in turn finds himself manipulated into deeper deviltry than he had in mind...",
    "Director": "Bernard Vorhaus",
    "Writer": "Crane Wilbur, Muriel Roy Bolton, Ian McLellan Hunter",
    "Actors": "Turhan Bey, Lynn Bari, Cathy O'Donnell",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0039230",
      "title": "Bury Me Dead",
      "year": 1947,
      "imdbRating": "5.8",
      "imdbVotes": "424",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041733",
      "title": "Parole, Inc.",
      "year": 1948,
      "imdbRating": "5.7",
      "imdbVotes": "421",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0038937",
      "title": "Shock",
      "year": 1946,
      "imdbRating": "6.3",
      "imdbVotes": "3,476",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040472",
      "title": "Inner Sanctum",
      "year": 1948,
      "imdbRating": "6.0",
      "imdbVotes": "1,211",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040427",
      "title": "He Walked by Night",
      "year": 1948,
      "imdbRating": "7.0",
      "imdbVotes": "6,948",
      "language": "English, Spanish, Cantonese",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0040270",
      "title": "The Dark Past",
      "year": 1948,
      "imdbRating": "6.3",
      "imdbVotes": "2,180",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040887",
      "title": "To the Ends of the Earth",
      "year": 1948,
      "imdbRating": "6.9",
      "imdbVotes": "886",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040695",
      "title": "Pitfall",
      "year": 1948,
      "imdbRating": "7.1",
      "imdbVotes": "4,707",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036104",
      "title": "The Leopard Man",
      "year": 1943,
      "imdbRating": "6.7",
      "imdbVotes": "6,122",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041460",
      "title": "The Hidden Room",
      "year": 1949,
      "imdbRating": "7.3",
      "imdbVotes": "3,067",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041791",
      "title": "The Red Menace",
      "year": 1949,
      "imdbRating": "5.0",
      "imdbVotes": "276",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042046",
      "title": "The Window",
      "year": 1949,
      "imdbRating": "7.4",
      "imdbVotes": "5,025",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T18:51:29.709Z"
}