{
  "imdbId": "tt0013442",
  "title": "Nosferatu: A Symphony of Horror",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nosferatu-1922-colorized",
      "title": "Nosferatu 1922 Colorized",
      "description": "Nosferatu (1922) Colorized",
      "id": "nosferatu-1922-colorized"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nosferatu-1922_202504",
      "title": "Nosferatu 1922 202504",
      "description": "The mysterious Count Orlok summons Thomas Hutter to his remote Transylvanian castle in the mountains. The eerie Orlok seeks to buy a house near Hutter and his wife, Ellen. After Orlok reveals his vampire nature, Hutter struggles to escape the castle, knowing that Ellen is in grave danger. Meanwhile Orlok's servant, Knock, prepares for his master to arrive at his new home. Watch on RetroFlix:  https://retroflix.org/nosferatu-1922/",
      "id": "nosferatu-1922_202504"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nosferatu.-1922.-blu-ray.-1080p",
      "title": "Nosferatu. 1922. Blu Ray.",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. One of the most iconic horror films ever created, Nosferatu: A Symphony of Horror was originally considered just a copy of the Dracula story. In fact, Bram Stoker's widow sued to have all copies of Nosferatu destroyed because of the similarities between the plots. Fortunately, some copies were saved, and it can be enjoyed to this day. ",
      "id": "nosferatu.-1922.-blu-ray.-1080p"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nosferatu_201508",
      "title": "Nosferatu 201508",
      "id": "nosferatu_201508"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Nosferatu_most_complete_version_93_mins.",
      "title": "Nosferatu Most Complete Version 93 Mins.",
      "description": "This is the most complete version available (just over 93 minutes) as this movie was demanded by Bram Stokers widow to be destroyed after winning 2 lawsuits in the mid & late 1920's. Tinted scenes and beautiful quality. I have seen the current version here at archive.org and decided to post this one as it is of much better video quality, although the music is a nit hokey. Enjoy this classic horror with the very creepy Max Schrek as the (IMHO) best vampire ever to waltz across the silver screen. (IMDB.COM Description) An unauthorized production of Bram Stoker's work (The legal heirs didn't give their permission), so the names had to be changed. But this wasn't enough: The widow of Bram Stoker won two lawsuits (1924 and 1929) in which she demanded the destruction of all copies of the movie, however happily copies of it were already too widespread to destroy them all. Later, Universal studios could break her resistance against this movie. Count Orlok's move to Wisburg (Obviously the real \"Wismar\") brings the plague traceable to his dealings with the Realtor Thomas Hutter, and the Count's obsession with Hutter's wife, Ellen the only one with the power to end the evil. DVD Empire Description A Symphony Of Horror A long time ago in middle Europe, a decrepit, forbidding castle stood... Casting an ominous shadow over the townspeople who dare not look upon it, the unholy dwelling is home to one Count Orlok (Max Schreck) , an undead night creature with a taste for human blood. Into this picture steps Hutter, an unwary traveler who visits the Count. He carries with him the deed for a property Orlock wishes to buy in Hutter's home town of Wisborg. That night, in preparation for the long sea voyage ahead, the vampire hastily loads his coffin aboard ship and waits... Once at sea, Orlock bares his fangs and upon arrival in Wisborg, leaves behind a floating morgue. Now, preparing to feast on the citizens, the cadaveous Count, prowls the darkness as the eerie Nosferatu.",
      "id": "Nosferatu_most_complete_version_93_mins."
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1920-2008-dvdrip-x-264-mp-3www.mastitorrents.com",
      "title": "1920 2008 Dvdrip X 264 Mp 3www.Mastitorrents.Com",
      "id": "1920-2008-dvdrip-x-264-mp-3www.mastitorrents.com"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "94 min",
    "imdbRating": "7.8",
    "imdbVotes": "120,332",
    "Genre": "Fantasy, Horror",
    "Plot": "Wisbourg, Germany based estate agent Knock dispatches his associate, Hutter, to Count Orlok's castle in Transylvania as the Count wants to purchase an isolated house in Wisbourg. They plan on selling him the one across the way from Hutter's own home. Hutter leaves his innocent wife, Ellen, with some friends while he is away. Hutter's trek is an unusual one, with many locals not wanting to take him near the castle where strange events have been occurring. Once at the castle, Hutter does manage to sell the Count the house, but he also notices and feels unusual occurrences, primarily feeling like there is a dark shadow hanging over him, even in the daytime when the Count is unusually asleep. Hutter eventually sees the Count's sleeping chamber in a crypt, and based on a book he has recently read, believes the Count is really a vampire or Nosferatu. While Hutter is trapped in the castle, the Count, hiding in a shipment of coffins, makes his way to Wisbourg, causing death along his way, which most attribute to the plague. Hutter himself tries to rush home to save his town and most importantly save Ellen from Nosferatu's imminent arrival. In Wisbourg, Ellen can feel the impending darkness as Nosferatu gets closer. But she learns that a sinless woman can sacrifice herself to kill the vampire. Will Hutter be able to save Ellen either from Nosferatu and/or her self-sacrifice?",
    "Director": "F.W. Murnau",
    "Writer": "Bram Stoker, Henrik Galeen",
    "Actors": "Max Schreck, Alexander Granach, Gustav von Wangenheim",
    "Language": "German, English",
    "Country": "Germany",
    "Awards": "3 wins & 2 nominations total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0016847",
      "title": "Faust",
      "year": 1926,
      "imdbRating": "8.1",
      "imdbVotes": "17,097",
      "language": "German, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014509",
      "title": "Der steinerne Reiter",
      "year": 1923,
      "imdbRating": "6.6",
      "imdbVotes": "98",
      "language": "None, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013257",
      "title": "Häxan",
      "year": 1922,
      "imdbRating": "7.6",
      "imdbVotes": "18,391",
      "language": "Swedish, Danish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012364",
      "title": "The Phantom Carriage",
      "year": 1921,
      "imdbRating": "8.0",
      "imdbVotes": "15,311",
      "language": "None, Swedish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0340177",
      "title": "The Island of the Lost",
      "year": 1921,
      "imdbRating": "4.9",
      "imdbVotes": "80",
      "language": "None, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011237",
      "title": "The Golem",
      "year": 1920,
      "imdbRating": "7.2",
      "imdbVotes": "8,788",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011221",
      "title": "Genuine: The Tragedy of a Vampire",
      "year": 1920,
      "imdbRating": "5.9",
      "imdbVotes": "1,171",
      "language": "None, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013373",
      "title": "Marizza",
      "year": 1922,
      "imdbRating": "6.3",
      "imdbVotes": "115",
      "language": "None, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013496",
      "title": "Phantom",
      "year": 1922,
      "imdbRating": "6.7",
      "imdbVotes": "1,978",
      "language": "None, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012973",
      "title": "The Burning Soil",
      "year": 1922,
      "imdbRating": "6.9",
      "imdbVotes": "790",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016039",
      "title": "The Lost World",
      "year": 1925,
      "imdbRating": "6.9",
      "imdbVotes": "6,175",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010821",
      "title": "Eerie Tales",
      "year": 1919,
      "imdbRating": "6.5",
      "imdbVotes": "676",
      "language": "German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": true,
  "qualityLabels": [],
  "lastUpdated": "2026-01-02T19:38:49.893Z"
}