{
  "imdbId": "tt0054393",
  "title": "Tormented",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VsDzibAOVAA",
      "title": "Tormented (1960) [Thriller] [Horror]",
      "description": "Jazz pianist Tom Stewart (Carlson), who lives on a Cape Cod island community, is preparing to marry his fiancee Meg. Shortly before the wedding, Tom's old girlfriend Vi (Juli Reding) visits and informs him that she will end Tom's relationship with Meg, using blackmail if necessary. While arguing on top of a lighthouse, the railing Vi is leaning against gives way. She manages to briefly hang on, but Tom refuses to help and watches her fall to her death.\n\nThe next day, Tom sees Vi's body floating in the water. He retrieves her only to see the body turn into seaweed. Tom tries to forget what he's seen, but over the next several days, all manner of strange occurrences happen. Vi's watch washes up on the beach and mysterious footprints appear in the sand. Before long, Vi's ghost appears and tells Tom that she will haunt him for the rest of his life.\n\nOne day, Meg's little sister Sandy shows up and asks Tom if she can see the engagement ring. As Tom shows it to Sandy, he's spooked by a disembodied hand that soon makes off with the ring.\n\nSoon afterward, a party is held for Tom and Meg. Vi's disembodied head makes a small appearance in a photo taken of Tom and Meg, and when he's alone, Vi taunts Tom that she'll now use her voice to tell the world how Tom Stewart killed her.\n\nTo add to Tom's dilemma, a ferry-driving beatnik comes looking for Tom, intent on collecting the $5 Vi owes him for her trip to the island. Tom's haste to pay the fellow off causes the shifty man to stick around, where his attempts to blackmail Tom lead to the ferryman's death. However, unbeknownst to Tom, Sandy has inadvertently witnessed the murder.\n\nAt the wedding, Sandy keeps quiet about what she's seen, but almost says something at the point in the ceremony where the clergy asks if anyone \"can give reason why these two should not be joined in matrimony.\" Before she can speak, the church's front doors burst open and the flowers all begin to wilt as the candles die out, bringing the ceremony to an abrupt and unpleasant end.\n\nLater that night, Tom goes to the lighthouse, telling Vi that he's leaving the island. Soon after, Sandy listens in to what Tom says. When Tom finds her, he realizes that he's now trapped; Sandy knows too much and could possibly tell Meg and the others. A desperate Tom leads Sandy up to the broken lighthouse railing with the intent to push her over. But just then, Vi's ghost swoops down on Tom, causing him to go over the edge as Sandy watches.\n\nSoon afterward, the islanders go searching for Tom's body. However, the first one they find is Vi's. Shortly afterward, Tom's body is found and placed next to Vi's body, which somehow manages to turn and lay its arm across his body. On Vi's dead hand is the engagement ring that was supposed to be Meg's, signaling that Tom is now stuck forever with Vi.\n\n---\n\nDirected by Bert I. Gordon, produced by Bert I. Gordon and Joe Steinberg, written by Bert I. Gordon and George Worthing Yates,  starring Richard Carlson, Susan Gordon and Lugene Sanders.\n\n---\n\nSource: \"Tormented (1960 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 25 October 2016. Web. 19 November 2016. https://en.wikipedia.org/wiki/Tormented_(1960_film) .\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "VsDzibAOVAA",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Tormented_861",
      "title": "Tormented",
      "description": "A man lets a former flame fall to her death rather than let her interfere with his new relationship, but her ghost returns to disrupt his impending nuptials. - IMDB Description",
      "fileSize": 1900030979,
      "id": "Tormented_861"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DOWft_A26DY",
      "title": "Tormented (1960) RICHARD CARLSON🍕 NEW 4K RESTORATION",
      "description": "It's Friday@PizzaFLIX \nProduced & Directed by: Burt I. Gordon (aka Mr. BIG)\nStarring: Richard Carlson, Juli Reding, Joseph Turkel, Lugene Sanders\n🍕 NEW HD RESTORATION🍕\nIn this terrifying story of supernatural passion, a Jazz pianist is haunted from beyond the grave by his jilted lover.\n\nStep into the eerie world of supernatural suspense with this chilling 1960 thriller from Allied Artists Pictures Corporation. Directed by Bert I. Gordon—renowned for his imaginative genre films—Tormented weaves a haunting tale of guilt, jealousy, and ghostly revenge. Richard Carlson stars as Tom Stewart, a jazz pianist whose engagement is threatened by the spectral presence of his vengeful ex-lover, played by Juli Reding. Haunted by secrets and tormented by apparitions, Tom’s descent into psychological horror is as gripping today as it was upon release.\n\nThis atmospheric film is a standout among early 60s American horror, featuring memorable performances by Lugene Sanders and Susan Gordon. With its unique coastal setting and tension-building visuals, Tormented offers fans of vintage horror a must-see experience that blends romance, suspense, and the supernatural.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nRediscover this classic gem that captures the paranoia and thrills of mid-century genre filmmaking. Whether you're a fan of ghost stories or historical horror cinema, this film delivers spine-tingling entertainment.\n\n🔔 Subscribe for more restored and rare classic horror films!\n\n#Tormented1960 #RichardCarlson #BertIGordon #ClassicHorror #1960sCinema #GhostStory #VintageHorror #JuliReding #JosephTurkel",
      "id": "DOWft_A26DY",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tormented",
      "title": "Tormented",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4483465751,
      "id": "tormented"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tormented-1960",
      "title": "Tormented (1960)",
      "description": "A jazz pianist is haunted by his dead ex-lover's crawling hand and floating head, what is thought to be temporary soon won't stop.",
      "fileSize": 1588363326,
      "id": "tormented-1960"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tormented-1960_202505",
      "title": "Tormented (1960)",
      "description": "A jazz pianist is haunted by his dead ex-lover's crawling hand and floating head. Watch on RetroFlix:  https://retroflix.org/tormented-1960/",
      "fileSize": 467464380,
      "id": "tormented-1960_202505"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "75 min",
    "imdbRating": 4.9,
    "imdbVotes": 3113,
    "Genre": "Horror, Thriller",
    "Plot": "On an island community off of California, Tom Stewart is preparing to marry the woman he loves. His plans are threatened by his old girlfriend, Vi, who shows up secretly. During a confrontation at the top of the island's lighthouse, the railing breaks and Vi falls. Tom has a chance to save her but doesn't. Tom's relief at Vi's accident soon fades when her vengeful spirit begins showing up wherever he goes...",
    "Director": "Bert I. Gordon",
    "Writer": "George Worthing Yates, Bert I. Gordon",
    "Actors": "Richard Carlson, Susan Gordon, Lugene Sanders",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0053719",
      "title": "The City of the Dead",
      "year": 1960,
      "imdbRating": 6.7,
      "imdbVotes": 8856,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050177",
      "title": "Beginning of the End",
      "year": 1957,
      "imdbRating": 4,
      "imdbVotes": 2831,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053337",
      "title": "Teenagers from Outer Space",
      "year": 1959,
      "imdbRating": 3.9,
      "imdbVotes": 3938,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052609",
      "title": "Beast from Haunted Cave",
      "year": 1959,
      "imdbRating": 4.3,
      "imdbVotes": 2290,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054691",
      "title": "Bloodlust!",
      "year": 1961,
      "imdbRating": 3.6,
      "imdbVotes": 2640,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052602",
      "title": "The Bat",
      "year": 1959,
      "imdbRating": 6,
      "imdbVotes": 6482,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052846",
      "title": "The Giant Gila Monster",
      "year": 1959,
      "imdbRating": 3.7,
      "imdbVotes": 4520,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0055058",
      "title": "Konga",
      "year": 1961,
      "imdbRating": 4.5,
      "imdbVotes": 2330,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0055505",
      "title": "Scream of Fear",
      "year": 1961,
      "imdbRating": 7.4,
      "imdbVotes": 5727,
      "language": "English, French, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2009474",
      "title": "Famous Ghost Stories",
      "year": 1961,
      "imdbVotes": 22,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0056056",
      "title": "Hands of a Stranger",
      "year": 1962,
      "imdbRating": 5.2,
      "imdbVotes": 1019,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052228",
      "title": "Space Master X-7",
      "year": 1958,
      "imdbRating": 5.2,
      "imdbVotes": 454,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}