{
  "imdbId": "tt0027311",
  "title": "As You Like It",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AsYouLikeIt1936",
      "title": "As You Like It",
      "description": "In this first film version of William Shakespeare's classic pastoral comedy, Sir Laurence Olivier stars as Orlando while Elisabeth Bergner is Rosalind, his secret admirer who disguises herself as a boy in order to stay near to him. Nearly all of the actors involved had performed the work on stage previously, adding to the stellar overall performance. A particular highlight is Olivier's magnificent delivery of the famous \"All the world's a stage...\" monologue.",
      "fileSize": 2219382342,
      "id": "AsYouLikeIt1936"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u9hTxzLHU3I",
      "title": "As You Like It (1936) [Drama] [Comedy]",
      "description": "\"As You Like It\" is a 1936 film, directed by Paul Czinner and starring Laurence Olivier as Orlando and Elisabeth Bergner as Rosalind. It is based on William Shakespeare's play of the same name. It was Laurence Olivier's first performance of Shakespeare on screen.\n\nIt was the final film of stage actors Leon Quartermaine and Henry Ainley, and featured an early screen role for Ainley's son Richard as Sylvius, as well as for John Laurie, who played Orlando's brother Oliver. (Laurie would go on to co-star with Olivier in the three Shakespeare films that Olivier directed.) Bergner had previously played the role of Rosalind in her native Germany and her German accent is apparent in most of her scenes.\n\nDuke Frederick (Felix Aylmer) has usurped and deposed his older brother, Duke Senior (Henry Ainley). Frederick allows the exiled Duke's daughter, Rosalind (Elisabeth Bergner), however, to stay, as she is the closest friend of his daughter, Celia (Sophie Stewart). Orlando (Laurence Olivier), who has been forced to flee his home due to the oppression from his brother, Oliver (John Laurie), comes to the Frederick's Duchy, and enters a wrestling tournament. On leaving the Duchy, Orlando encounters Rosalind, and it is love at first sight. Frederick then becomes angry, and banishes Rosalind. Celia decides to accompany her, along with a jester, Touchstone (Mackenzie Ward).\n\nRosalind and Celia disguise themselves as \"Ganymede\", a boy, and \"Aliena\", respectively, and venture into the Forest of Arden, where they eventually encounter the exiled Duke. Orlando, who discovers that Rosalind is now living with the Duke, posts love poems on the trees for her. Orlando manages to come across Ganymede, who proceeds to teach Orlando how to cure love. At the same time, Phoebe (Joan White), a shepherdess, falls in love with Ganymede, though he (she) continually rejects her. Sylvius (Richard Ainley), a shepherd, is in love with Phoebe, which complicates the matter. Meanwhile, Touchstone attempts to marry the simple farmgirl, Audrey (Dorice Fordred), before he can be stopped by Jaques (Leon Quartermaine), a Lord who lives with the exiled Duke.\n\nEventually, Ganymede, Orlando, Phoebe, and Silvius are brought together to sort out who marries whom. Ganymede proposes that Orlando promise to marry Rosalind, and Phoebe promise to marry Silvius if she cannot marry Ganymede. The next day, Rosalind reveals herself, and Phoebe is married to Silvius. Orlando then rescues Oliver from a lioness in the forest, causing Oliver to repent and re-embrace his brother. Orlando and Rosalind, Oliver and Celia, Silvius and Phoebe, and Touchstone and Audrey are all then married, and they learn that Frederick has also repented and decided to reinstate his brother as the Duke.\n\n---\n\nDirected and produced by Paul Czinner, written by William Shakespeare, J. M. Barrie (treatment) and R. J. Cullen (scenario), starring Laurence Olivier, Elisabeth Bergner, Felix Aylmer, Henry Ainley and Sophie Stewart.\n\n---\n\nSource: \"As You Like It (1936 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 24 July 2012. Web. 30 July 2012. http://en.wikipedia.org/wiki/As_You_Like_It_(1936_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "u9hTxzLHU3I",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z_GgEBG7UJ4",
      "title": "As you like it (1936) Laurence Olivier, Elisabeth Bergner | Shakespeare’s Forest of Love & Lies",
      "description": "Film adaptation of William Shakespeare’s romantic comedy of a young woman who disguises herself as a man to win the attention of the one she loves.\n\nOriginal title: As you like it (1623)\n\nBlack & White version: https://youtu.be/jg72DChjB_4\n\n\nDirector: Paul Czinner\nWriters: William Shakespeare & J.M. Barrie, Robert Cullen, Carl Mayer\nStars: Elisabeth Bergner, Laurence Olivier, Sophie Stewart\nGenres: Drama, Comedy, Literature, Romance\n\n\n00:00:00 Title Credits - Full Length Movie\n00:02:15 Act 1\n00:26:01 Act 2\n00:46:13 Act 3\n01:07:37 Act 4\n01:20:54 Act 5\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "Z_GgEBG7UJ4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "96 min",
    "imdbRating": 5.8,
    "imdbVotes": 882,
    "Genre": "Drama, Comedy, Romance",
    "Plot": "A Duke usurps his brother's land and power, banishing him and his entourage into the forest of Arden. The banished Duke's daughter, Rosalind, remains with her cousin Celia. She has fallen in love with Orlando, but he has his own tyrannical brother with whom to contend, so he joins those in the forest. Rosalind, now banished, disguises herself as a young man, with Celia as her servant, and follows Orlando into the forest. There, nature stirs love's fires in various rustics as well as in those from the court. Phebe, a shepherdess loved by Silvius, is smitten with the disguised Rosalind. Can true love find a way, and can brothers be reconciled and harmony restored?",
    "Director": "Paul Czinner",
    "Writer": "J.M. Barrie, Robert Cullen, Carl Mayer",
    "Actors": "Elisabeth Bergner, Laurence Olivier, Sophie Stewart",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0030063",
      "title": "The Divorce of Lady X",
      "year": 1938,
      "imdbRating": 6.6,
      "imdbVotes": 1581,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027286",
      "title": "The Amazing Adventure",
      "year": 1936,
      "imdbRating": 6.3,
      "imdbVotes": 2215,
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028010",
      "title": "My Man Godfrey",
      "year": 1936,
      "imdbRating": 7.9,
      "imdbVotes": 27078,
      "language": "English, Russian",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0027331",
      "title": "Banjo on My Knee",
      "year": 1936,
      "imdbRating": 6.2,
      "imdbVotes": 660,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027996",
      "title": "Mr. Deeds Goes to Town",
      "year": 1936,
      "imdbRating": 7.8,
      "imdbVotes": 23599,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028142",
      "title": "Private Number",
      "year": 1936,
      "imdbRating": 6.7,
      "imdbVotes": 506,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024436",
      "title": "Perfect Understanding",
      "year": 1933,
      "imdbRating": 5.6,
      "imdbVotes": 772,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028557",
      "title": "Affairs of Cappy Ricks",
      "year": 1937,
      "imdbRating": 5.5,
      "imdbVotes": 229,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028575",
      "title": "Angel",
      "year": 1937,
      "imdbRating": 7.2,
      "imdbVotes": 3607,
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0320737",
      "title": "La virgencita de madera",
      "year": 1937,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029298",
      "title": "Navy Blues",
      "year": 1937,
      "imdbRating": 6.2,
      "imdbVotes": 75,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026276",
      "title": "The Devil Is a Woman",
      "year": 1935,
      "imdbRating": 6.9,
      "imdbVotes": 4152,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.635Z"
}