{
  "imdbId": "tt0028943",
  "title": "The Gold Racket",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGoldRacket",
      "id": "TheGoldRacket",
      "title": "The Gold Racket",
      "description": "The U.S. goes off of the 'Gold Standard' and because of rising prices Gold is being smuggled into the U.S. from Mexico. A G-man and a nosey reporter gal go to Mexico to infiltrate and capture the gang.",
      "fileSize": 1121216562,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGoldRacket",
      "collection": "feature_films",
      "downloads": 3932
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eGKzwxgqGd4",
      "id": "eGKzwxgqGd4",
      "title": "The Gold Racket (1937) CRIME-NOIR",
      "description": "Stars: Conrad Nagel, Eleanor Hunt, Fuzzy Knight \nDirectors: Louis J. Gasnier\n\nAt the request of the Mexican government, a federal agent and a lady reporter team up to catch a gang that has been smuggling gold from Mexico to the U.S. and then selling it to the U.S. government.",
      "addedAt": "2025-12-26T23:46:55.237Z",
      "thumbnail": "https://i.ytimg.com/vi/eGKzwxgqGd4/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDq5Q0Q3LXloUvJ5EUMNln0DU4tzw",
      "duration": 3866,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": 5.5,
    "imdbVotes": 114,
    "Genre": "Action, Crime, Drama",
    "Plot": "The third in a series of four \"G-Man\" films produced by George A. Hirliman's Concord Productions for Grand National release finds smugglers have found that smuggling gold from Mexico has become a lucrative racket since the United States went off of the gold standard. McKenzie (William L. Thorne) and his gang operating from the Los Morados mine are sailing high until they happen to kill two federal agents and the Department of Justice sends in ace operative Alan O'Connor (Conrad Nagel) to find the killers and break up the gold traffic. He traces specimens of the precious metal to have come from the Los Morados mine, and sets off for Mexico. There he meets aviator Steve Williams (Frank Milan), who pays his saloon bills with gold nuggets. Alan persuades the proprietor of the Tarentella Cafe to add another entertainer to his staff, and then wires Washington to send Operative No. 37, Bobbie Reynolds (Eleanor Hunt), his sweetheart. (Nice work if you can get it.) O'Connor finds a map in Steve's room showing the American headquarters of the gang to be a mine near Winston, California, and he leaves Bobbie and heads there. He is recognized and followed when he arrives. Bobbie follows him by train. O'Connor has gone to the landing field with other agents to trap the in-coming Steve with his load of Mexican gold, but members of the gang are holding Bobbie captive in an old mine shaft.",
    "Director": "Louis J. Gasnier, Joseph H. Lewis",
    "Writer": "Howard Higgin, David S. Levy, Griffin Jay",
    "Actors": "Conrad Nagel, Eleanor Hunt, Fuzzy Knight",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028719",
    "tt0029112",
    "tt0029799",
    "tt0030898",
    "tt0028607",
    "tt0027354",
    "tt0027406",
    "tt0030164",
    "tt0030168",
    "tt0028525",
    "tt0028132",
    "tt0030777"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}