{
  "imdbId": "tt0027348",
  "title": "Below the Deadline",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/below-the-deadline-1936_202503",
      "title": "Below the Deadline (1936)",
      "description": "After a good-natured Irish cop is framed for a diamond robbery and murder and presumed dead in a train wreck, he gets plastic surgery and returns to expose the real killers. Watch on RetroFlix:  https://retroflix.org/below-the-deadline-1936/",
      "id": "below-the-deadline-1936_202503"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/below_the_deadline",
      "title": "Below the Deadline",
      "description": "Police Officer Terry Mulvaney (Russel Hopton) is in love with Molly Fitzgerald (Cecila Parker). However, his unknown rival is Flash Ackroyd (Theodore von Eltz), firecode incompliant nightclub owner, socialite, and master jewel thief. Molly works as secretary to Abrams (John St. Polis), of Abrams and Co. diamond brokers, and Flash uses a legal ruse to get a copy of her handwriting for his friend Spike (Jack Gardner). With a fake letter sent to Terry and some good acting, Ackroyd and has henchmen hold up Abrams and frame Terry and Molly for it. Terry escapes on a train out of town which goes over a collapsed bridge and gives him the chance to change places with a nameless, faceless corpse, get a new nose (literally) and a few grand in US $. As Molly is about to leave town to seek employment, Flash offers her a job at his nightclub and she accepts, unsuspecting his ulterior motive. Meanwhile Terry gets back into town and meets up with the insurance agent and they go after Ackroyd. [NB: The guard at the Abrams place also played a guard at a prison in ' Prison Mutiny ', and the Police radioman is played by True Boardman, a possible relation to Virginia True Boardman of ' The Crime Patrol '.] [Synopsis by uniQ .] You can find more information regarding this film on its IMDb page .",
      "id": "below_the_deadline"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/below_the_deadline_1936",
      "title": "Below the Deadline",
      "description": "A young jewelry store employee and her policeman boyfriend get entangled with jewel thieves.",
      "id": "below_the_deadline_1936"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6pee-XeDi80",
      "title": "Below the Deadline (1936) CECILIA PARKER🍕 CHESTERFIELD CRIME CLASSIC",
      "description": "It's Friday @PizzaFLIX \nDirector: Charles Lamont\nStars: Cecilia Parker, Russell Hopton, Theodore von Eltz, and Warner Richman.\n\nGangsters, diamonds, and dames! In this street-smart crime flick from Chesterfield Pictures, a good-natured cop gets framed for a jewel heist by a gang of skirt-chasing hoods. Directed by Charles Lamont with standout performances by Cecilia Parker, Warner Richman, and Theodore von Eltz. \n\nFilmed with the economical storytelling style of Poverty Row studios, this film stands as a striking example of independent crime dramas of its era. With a script that pulls no punches and a cast that brings intensity to every scene, this vintage gem remains a fascinating artifact of pre-war American filmmaking.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nProduced by George R. Batcheller for Chesterfield Motion Pictures Corp., this film showcases the efficient yet gripping narrative style that made low-budget studios a vital part of cinema history. \n\n#ClassicCrimeFilm #TheodorevonEltz #FilmNoirRoots #OldHollywood #CeciliaParker #CharlesLamont #ChesterfieldPictures #VintageCrimeDrama #Warner Richman #BelowTheDeadline #pizzaflix",
      "id": "6pee-XeDi80",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G5XDPB_UI4A",
      "title": "Below the Deadline (1936) Crime film directed by Charles Lamont | starring Cecilia Parker",
      "description": "After a good-natured Irish cop is framed for a diamond robbery and murder and presumed dead in a train wreck, he gets plastic surgery and returns to expose the real killers.\n\nOriginal title: Below the Deadline (1936) \nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/hh3PVShPMGE\n\n\nDirector: Charles Lamont\nWriter: Ewart Adamson \nStars: Cecilia Parker, Russell Hopton, Theodore von Eltz \nGenres: Colorized, Classics, Crime, Drama, Romance \n\n\n00:00 Full Movie (with subtitles) \n02:15 In a bustling diamond district, Captain Symonds discusses a consignment of diamonds with Mr. Everley and Mr. Abrams, while also interacting with Molly and Terry Mulvaney.\n07:55 A crime drama unfolds as characters discuss a diamond deal, relationships, and a potential heist.\n14:06 Criminal plan involving a heist, framed officer, and a love interest unfolds in a quiet setting.\n21:50 Police arrest Terry Mulvaney for murder and robbery, but he escapes and is on the run.\n28:33 Investigator uncovers criminal plot involving stolen diamonds, mistaken identities, and framed suspects in a crime drama film.\n36:14 Unsolved crime case involving stolen diamonds, identity confusion, and a job offer at a restaurant.\n41:55 Undercover investigator uncovers identity switch in crime case, involving a framed man and stolen property.\n47:56 Unexpected reunion leads to joy and gratitude, while suspicions arise in a crime drama setting.\n52:31 Intrigue unfolds as relationships and secrets are revealed in a crime drama film set in the 1930s.\n58:16 A tale of mistaken identities, love triangles, and suspicions unravels in a crime drama setting.\n1:03:46 Murder suspect Terry Mulvaney seeks to clear his name in a web of deceit and danger.\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "G5XDPB_UI4A",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": "5.5",
    "imdbVotes": "169",
    "Genre": "Crime, Drama, Romance",
    "Plot": "Molly Fitzgerald, who works for Abrams and Co. Jewelers (although the company safe reads \"Adams &amp; Co. Jewelers\"), is accosted on the street by a stranger who asks her for a date, but her fiancé, police officer Terry Mulvaney chases him away. Spike, the stranger, is interested in Molly other than for her pretty face; he is a member of a gang of jewel thieves who are planning to rob Abrams and want to use her to obtain information regarding the merchant's shipments of jewels. Through another ruse, gang member Flash Ackroyd gets the information and, through careful planning, frames Terry for the robbery. One of Abrams' assistants is killed and Terry is charged with robbery and murder. Terry escapes but Molly is fired as Abrams thinks she was in on the robbery. Molly gets a job in a nightclub ran by the gangsters. The train on which Terry is escaping is wrecked and he is transported to a hospital more dead than alive.",
    "Director": "Charles Lamont",
    "Writer": "Ewart Adamson",
    "Actors": "Cecilia Parker, Russell Hopton, Theodore von Eltz",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026412",
      "title": "The Girl Who Came Back",
      "year": 1935,
      "imdbRating": "5.5",
      "imdbVotes": "80",
      "language": "French, English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027406",
      "title": "Bulldog Edition",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "93",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027501",
      "title": "The Dark Hour",
      "year": 1936,
      "imdbRating": "5.4",
      "imdbVotes": "337",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027863",
      "title": "Lady Luck",
      "year": 1936,
      "imdbRating": "5.4",
      "imdbVotes": "54",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027316",
      "title": "August Weekend",
      "year": 1936,
      "imdbRating": "5.1",
      "imdbVotes": "107",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030763",
      "title": "Slander House",
      "year": 1938,
      "imdbRating": "5.3",
      "imdbVotes": "86",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027568",
      "title": "Ellis Island",
      "year": 1936,
      "imdbRating": "5.4",
      "imdbVotes": "89",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027784",
      "title": "I'd Give My Life",
      "year": 1936,
      "imdbRating": "5.8",
      "imdbVotes": "52",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030648",
      "title": "Racing Blood",
      "year": 1936,
      "imdbRating": "4.7",
      "imdbVotes": "47",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027477",
      "title": "The Crime Patrol",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "61",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027564",
      "title": "Easy Money",
      "year": 1936,
      "imdbRating": "6.0",
      "imdbVotes": "92",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0026436",
      "title": "Great God Gold",
      "year": 1935,
      "imdbRating": "5.7",
      "imdbVotes": "82",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:31.714Z"
}