{
  "imdbId": "tt0044379",
  "title": "Assignment: Paris",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/assignment-paris-1952",
      "id": "assignment-paris-1952",
      "title": "Assignment-Paris (1952)",
      "description": "Paris-based New York Herald Tribune reporter Jimmy Race (Andrews) is sent by his boss (Sanders) behind the Iron Curtain in Budapest to investigate a meeting involving the Hungarian ambassador. Watch on RetroFlix:  https://retroflix.org/assignment-paris-1952/",
      "fileSize": 459668274,
      "addedAt": "2026-01-07T00:07:31.711Z",
      "thumbnail": "https://archive.org/services/img/assignment-paris-1952",
      "language": "eng",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 339
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "85 min",
    "imdbRating": 6.1,
    "imdbVotes": 672,
    "Genre": "Drama, Thriller",
    "Plot": "During the 1950s, the Cold War is pitting the USA and its allies against the USSR and its satellites. One such Soviet satellite nation, Hungary, arrests an American named Anderson, and charges him with spying. Communist Hungary is putting on a show trial which is broadcast internationally, to prove the hostile aims of aggressive American Imperialists. The heavily censored news from the trial in Budapest come down the wire to the Paris office of the New York Herald-Tribune where editor-in-chief Nick Strang anxiously awaits more details from his Budapest correspondent, Barker. Nick also assigns journalist Jeanne Moray, a Frenchwoman, and the paper's top reporter, American Jimmy Race, to interview the Hungarian ambassador in Paris. Unbeknown to them, Hungarian agents clandestinely follow Jeanne and Jimmy Race to the embassy. These agents have a good reason to follow Jeanne. While she was in Budapest, she was investigating a lead that could prove the Hungarian leadership is attempting a secret rapprochement with Yugoslavia's President Bros Tito, in defiance of the Soviet policy that banned its satellites from getting cozy with non-aligned Yugoslavia. If this information is true and can be proved, it could land the Hungarian leadership in hot water with the Soviets. That's why Hungarian agents shadow Jeanne and it could also be the reason why Hungary retaliated with a phony trial on spying charges against the American citizen Anderson. When the Hungarian spy trial of Anderson ends, the verdict is 20 years in a hard labor camp. The Hungarian leadership vows to hang the next American spy caught in Hungary. The Hungarians also are interested in a Hungarian defector, Gabor Chechi, who escaped Hungary but is assumed to have been assassinated. The Hungarians suspect that Chechi remains alive somewhere in France and that reporter Jeanne Moray might know where Chechi is. When the newspaper's Budapest correspondent, Barker, ends up in a Budapest hospital after a heart-attack, editor-in-chief Nick Strang assigns top reporter Jimmy Race to replace Barker. Jimmy Race arrives in Budapest and that's when his nightmare begins.",
    "Director": "Robert Parrish, Phil Karlson",
    "Writer": "William Bowers, Walter Goetz, Jack Palmer White",
    "Actors": "Dana Andrews, Märta Torén, George Sanders",
    "Language": "English, French, Hungarian",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0045758",
    "tt0044596",
    "tt0044827",
    "tt0045309",
    "tt0044649",
    "tt0043938",
    "tt0043560",
    "tt0043340",
    "tt0043998",
    "tt0044202",
    "tt0045844",
    "tt0045931"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.711Z"
}