{
  "imdbId": "tt0022506",
  "title": "The Tree's Knees",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-trees-knees-1931",
      "id": "the-trees-knees-1931",
      "title": "The Tree's Knees (1931)",
      "description": "The Tree’s Knees is a 1931 one-reel short subject featuring Bosko, part of the Looney Tunes series. It was released in August 1931 and is directed by Hugh Harman and Rudolf Ising, the last cartoon in the series to be directed by the two. Every Looney Tunes cartoon after this was directed by Hugh Harman until 1933, and every Merrie Melodies cartoon was directed by Rudolf Ising until the aforementioned year. It is also the last Bosko cartoon to not feature the main character’s (Bosko’s) name in the title. The short is also notable for the extensive use of footage from the earlier short Ain’t Nature Grand! that it reuses, in particular a scene of Bosko happily and innocently pursuing a butterfly. Watch on RetroFlix.org:  https://retroflix.org/the-trees-knees-1931/",
      "fileSize": 163737282,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-trees-knees-1931",
      "language": "eng",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 1085
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.7,
    "imdbVotes": 193,
    "Genre": "Animation, Family, Short",
    "Plot": "Bosko is about to cut down a tree when a squirrel pops out of its hole and begs him to spare it. The anthropomorphic tree cowers as little trees gather around to protect it. Everyone is relieved when Bosko pulls a harmonica out of his pocket and plays. Bosko the woodsman will spend his day in the forest playing music instead of cutting down trees. Meanwhile, the trees and animals of the forest dance and make their own music.",
    "Director": "Hugh Harman, Rudolf Ising",
    "Writer": "N/A",
    "Actors": "Johnny Murray",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021690",
    "tt0022715",
    "tt0021689",
    "tt0022045",
    "tt0022528",
    "tt0022584",
    "tt0019714",
    "tt0021686",
    "tt0024547",
    "tt0021688",
    "tt0022405",
    "tt0021824"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}