{
  "imdbId": "tt0016039",
  "title": "The Lost World",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lost_world",
      "title": "The Lost World",
      "description": "The first film adaptation of Sir Arthur Conan Doyle's classic novel about a land where prehistoric creatures still roam.You can find more information regarding this film on its IMDb page .",
      "id": "lost_world"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheLostWorld",
      "title": "TheLostWorld",
      "description": "The first film adaptation of Sir Arthur Conan Doyle's classic novel about a land where prehistoric creatures still roam.",
      "id": "TheLostWorld"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheLostWorld_207",
      "title": "TheLostWorld 207",
      "description": "The Lost World, 1925. Adapted from a book by A. Conan Doyle and directed by Harry O. Hoyt with a performance by Wallace Beery., this movie is specially interesting for special effects by Willis O'brien who later became famoâ us for his special effects in the original film of King Kong.",
      "id": "TheLostWorld_207"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lost_world_ACM",
      "title": "Lost World ACM",
      "id": "lost_world_ACM"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QJaXxY3citM",
      "title": "The Lost World (1925) [Silent Movie] [Adventure]",
      "description": "\"The Lost World\" is a 1925 silent film adaptation of Arthur Conan Doyle's 1912 novel of the same name. The movie was produced by First National Pictures, a large Hollywood studio at the time, and stars Wallace Beery as Professor Challenger. This version was directed by Harry O. Hoyt and featured pioneering stop motion special effects by Willis O'Brien (an invaluable warm up for his work on the original King Kong directed by Merian C. Cooper and Ernest B. Schoedsack). Writer Doyle appears in a frontspiece to the film. In 1998, the film was deemed \"culturally, historically or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.\n\nFrom a lost expedition to a plateau in Venezuela, Paula White brings the journal of her father explorer Maple White to the eccentric Professor Challenger in London. The journal features sketches of dinosaurs which is enough proof for Challenger to publicly announce that dinosaurs still walk the earth. Met with ridicule at an academic meeting at the Zoological Hall, Challenger reluctantly accepts a newspaper's offer to finance a mission to rescue Maple White. Professor Challenger, Paula White, sportsman Sir John Roxton, news reporter Edward Malone (who is a friend of Roxton and wishes to go on the expedition to impress his fiancée), a sceptical professor Summerlee, an Indian servant Zambo, and Challenger's butler Austin leave for the plateau.\n\nAt their campsite at the base of the plateau, the explorers are shocked when a large rock falls, sent their way by an ape-man perched on top of an overhead ledge. As the crew look up to see their attacker, Challenger spies overhead a Pteranodon (mistakenly calling it a pterodactyl) which sighting proves that the statements in Maple White's diary are true. Leaving Zambo and Austin at the camp, they cross a chasm onto the plateau by cutting down a tree and using it as a bridge, but it is knocked over by a Brontosaurus, leaving them trapped. The explorers witness various life-and-death struggles between the prehistoric beasts of the plateau. An Allosaurus attacks a Trachodon, and knocks it into a bog. The Allosaurus then attacks, and is driven off by a Triceratops. Eventually, the Allosaurus makes its way to the campsite and attacks the exploration party. It is finally driven off by Ed who tosses a torch into its mouth. Convinced that the camp isn't safe, Ed climbs a tree to look for a new location, but is attacked by the ape-man. Roxton succeeds in shooting the ape-man, but the creature is merely wounded and escapes before he can finish him off. Meanwhile, an Agathaumas is attacked by a Tyrannosaurus, and gores it to death. Suddenly, another Tyrannosaurus attacks and kills the Agathaumas, along with an unfortunate Pteranodon.\n\nThe explorers then make preparations to live on the plateau potentially indefinitely. A catapult is constructed and during a search for Maple White, Roxton finds his remains, confirming his death. It is at this time that Ed confesses his love for Paula and the two are unofficially wed by Summerlee who used to be a minister. Shortly afterwards, as the paleontologists are observing a Brontosaurus, an Allosaurus attacks it and the Brontosaurus falls off the edge of the plateau, becoming trapped in a mud bank at the base of the plateau. Soon afterwards, a volcano erupts causing a mass stampede among the giant beasts of the lost world. The crew is saved when Paula's pet monkey Jocko climbs up the plateau carrying a rope. The crew use the rope to pull up a rope ladder constructed by Zambo and Austin and then climb down.\n\nAs Ed makes his descent, he is again attacked by the ape-man who pulls the rope ladder. The ape-man is again shot and finally killed by Roxton. They discover the Brontosaurus that had been pushed off the plateau had landed softly in the mud of the river, trapped but still alive, and Challenger manages to bring it back to London, as he wants to put it on display as proof of his story. However, while being unloaded from the ship it escapes and causes havoc until it reaches Tower Bridge, where its massive weight causes a collapse, and it swims down the River Thames. Challenger is morose as the creature leaves. Ed discovers that the love he left in London has married in his absence, allowing him and Paula to be together. Roxton morosely but gallantly hides his love for Paula as Paula and Ed leave together, while two passersby note: \"That's Sir John Roxton--sportsman.\"\n\n---\n\nDirected by Harry Hoyt, produced by Jamie White and Earl Hudson, written by Sir Arthur Conan Doyle (novel) and Marion Fairfax (screenplay), starring Bessie Love, Lewis Stone, Wallace Beery, Lloyd Hughes and Alma Bennett.\n\n---\n\nSource: \"The Lost World (1925 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 23 August 2012. Web. 24 August 2012. http://en.wikipedia.org/wiki/The_Lost_World_(1925_film).",
      "id": "QJaXxY3citM",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CeXeQTY0IdM",
      "title": "The Lost World (1925) | Colorized Dinosaur Adventure | Public Domain Silent Sci-Fi Classic Restored",
      "description": "The Lost World (1925) is a groundbreaking silent fantasy adventure film directed by Harry O. Hoyt and based on the legendary 1912 novel by Sir Arthur Conan Doyle. As one of the earliest feature-length films to showcase stop-motion dinosaurs, it paved the way for cinematic milestones like King Kong and Jurassic Park. This colorized and digitally restored edition by Colorized Public Domain revives the magic and wonder of this pioneering work for modern audiences, particularly those in the United States and Europe who appreciate classic cinema reborn through technology.\n\nPlot Summary:\nSet in early 20th-century London and the jungles of South America, the story follows the daring Professor Challenger (Wallace Beery), an eccentric scientist who claims to have discovered living prehistoric creatures. Ridiculed by his peers, Challenger assembles an expedition to prove his discovery: reporter Edward Malone (Lloyd Hughes), explorer Sir John Roxton (Lewis Stone), skeptical Professor Summerlee (Arthur Hoyt), and Paula White (Bessie Love), the daughter of a missing explorer.\n\nTheir journey takes them deep into the uncharted Amazon basin, where they encounter a plateau teeming with dinosaurs, giant reptiles, and other prehistoric beasts brought to life by Willis O’Brien’s pioneering stop-motion animation. The team struggles to survive attacks from creatures and internal conflicts, leading to one of cinema’s earliest depictions of large-scale destruction when a captured dinosaur escapes into London. The Lost World was decades ahead of its time, blending adventure, imagination, and spectacle that remains thrilling even a century later.\n\nCast and Crew:\n• Director: Harry O. Hoyt\n• Producer: Earl Hudson\n• Screenplay: Marion Fairfax\n• Based on: The Lost World by Sir Arthur Conan Doyle\n• Cinematography: Arthur Edeson\n• Visual Effects: Willis O’Brien\n• Production Company: First National Pictures\nStarring:\n• Wallace Beery as Professor Challenger\n• Bessie Love as Paula White\n• Lloyd Hughes as Edward Malone\n• Lewis Stone as Sir John Roxton\n• Arthur Hoyt as Professor Summerlee\n• Alma Bennett as Gladys Hunnington\n• Bull Montana as Ape-Man\n\nFilm Significance:\nThe Lost World stands as a monumental achievement in early cinema, marking the first time audiences saw realistic dinosaurs moving on screen. Its influence on visual effects cannot be overstated. Willis O’Brien’s stop-motion innovation directly inspired the creation of King Kong in 1933, and later generations of filmmakers, including Ray Harryhausen and Steven Spielberg. Beyond its technical marvel, the film also captures the spirit of exploration and scientific curiosity that defined the early 20th century.\n\nRestoration and Historical Context:\nMuch of the original footage was lost over the years due to nitrate film decay and censorship cuts. This colorized edition restores surviving footage from multiple archives, enhancing it to high-definition quality while preserving the silent-era atmosphere. The careful digital cleaning and colorization bring warmth and depth to the film’s jungle sequences, highlighting details that were barely visible in its monochrome form. It’s a revival of both cinematic history and storytelling innovation.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Lost World remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1925 version was filmed in black and white with primitive effects that, while groundbreaking, feel visually distant to modern audiences. By colorizing and restoring the imagery, we create an immersive experience closer to how audiences today engage with science fiction and adventure storytelling. For viewers watching primarily on large TVs — representing nearly half of Colorized Public Domain’s audience — this edition provides a visually rich and emotionally resonant experience while preserving the film’s historical authenticity.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age and Silent Era, ranging from forgotten gems to major cultural landmarks. Our mission is to preserve film history while making it enjoyable and accessible to audiences across the United States, Europe, and beyond.\n\n#TheLostWorld1925 #SilentFilm #PublicDomainMovie",
      "id": "CeXeQTY0IdM",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-lost-world-1925_202505",
      "title": "The Lost World (1925)",
      "description": "The first film adaptation of Sir Arthur Conan Doyle's classic novel about a land where prehistoric creatures still roam. Watch on RetroFlix:  https://retroflix.org/the-lost-world-1925/",
      "id": "the-lost-world-1925_202505"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-lost.-world.-1925.1080p.-blu-ray.x-264-sadpanda",
      "title": "The Lost World (1925)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The film that started the dinosaur movie trend, The Lost World did it better than any other arguably up until Jurassic Park. It pioneered the art of stop motion to the point that viewers couldn't understand how the models were used. When a screen test was shown at an exclusive club, The New York Times reported that the creatures shown must either be real footage or works of masterpiece. ",
      "id": "the.-lost.-world.-1925.1080p.-blu-ray.x-264-sadpanda"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "110 min",
    "imdbRating": "6.9",
    "imdbVotes": "6,175",
    "Genre": "Adventure, Fantasy, Horror",
    "Plot": "A expedition to rescue Maple White, who has been marooned at the top of a high plateau. Joined by hunter John Roxton, and others, the group goes to South America, where they do indeed find a plateau inhabited by pre-historic creatures, one of which they even manage to bring back to London with them.",
    "Director": "Harry O. Hoyt",
    "Writer": "Arthur Conan Doyle, Marion Fairfax",
    "Actors": "Wallace Beery, Bessie Love, Lloyd Hughes",
    "Language": "English",
    "Country": "United States",
    "Awards": "2 wins & 2 nominations total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0049516",
      "title": "The Mole People",
      "year": 1956,
      "imdbRating": "5.0",
      "imdbVotes": "4,090",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054850",
      "title": "Hercules in the Haunted World",
      "year": 1961,
      "imdbRating": "6.2",
      "imdbVotes": "2,478",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016338",
      "title": "She",
      "year": 1925,
      "imdbRating": "5.5",
      "imdbVotes": "180",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032818",
      "title": "The Mummy's Hand",
      "year": 1940,
      "imdbRating": "6.0",
      "imdbVotes": "4,847",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016545",
      "title": "Wolfblood",
      "year": 1925,
      "imdbRating": "5.4",
      "imdbVotes": "331",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt4219706",
      "title": "Demon Squad",
      "year": 2019,
      "imdbRating": "3.1",
      "imdbVotes": "267",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0843873",
      "title": "Snakes on a Train",
      "year": 2006,
      "imdbRating": "2.2",
      "imdbVotes": "2,216",
      "language": "English, Spanish",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt1132130",
      "title": "2012 Doomsday",
      "year": 2008,
      "imdbRating": "1.7",
      "imdbVotes": "7,209",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0015400",
      "title": "The Thief of Bagdad",
      "year": 1924,
      "imdbRating": "7.7",
      "imdbVotes": "7,374",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015174",
      "title": "Die Nibelungen: Kriemhild's Revenge",
      "year": 1924,
      "imdbRating": "7.9",
      "imdbVotes": "5,147",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015175",
      "title": "Die Nibelungen: Siegfried",
      "year": 1924,
      "imdbRating": "8.1",
      "imdbVotes": "6,716",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015224",
      "title": "Peter Pan",
      "year": 1924,
      "imdbRating": "7.1",
      "imdbVotes": "1,317",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T21:49:40.574Z"
}