{
  "imdbId": "tt0076175",
  "title": "March or Die",
  "year": 1977,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/march-or-die-1977",
      "id": "march-or-die-1977",
      "title": "March or Die (1977)",
      "description": "\"March or Die,\" directed by Dick Richards, is a war drama set during World War I. The film follows a group of French Foreign Legion soldiers who are tasked with protecting a strategic village in North Africa from Rebel forces.The film centers around a veteran Legionnaire, Sergeant Major Pierre Brax, played by Gene Hackman . Brax is a tough and experienced soldier who must grapple with both the challenges of warfare and the moral complexities of commanding his men. The soldiers face daunting conditions as they prepare for an impending rebel attack. The tensions and ethnic divisions among the men, primarily between the French officers and local troops, add layers to the narrative.As the story unfolds, the Legionnaires must band together not only to defend the village but also to maintain their camaraderie amidst the brutality of war. The themes of loyalty, honor, and sacrifice are emphasized throughout their struggle.The film culminates in a fierce battle where the Legionaries face overwhelming odds. In the end, their courage and tenacity are brought to the forefront as they fight for survival.The film concludes by reflecting on the costs of war, both physically and emotionally, leaving the audience to ponder the sacrifices made by soldiers for their duty and honor.\"March or Die\" combines action with deeper themes of brotherhood and the harsh realities of warfare, offering a gripping portrayal of the challenges faced by soldiers in a tumultuous era.",
      "fileSize": 990389196,
      "addedAt": "2026-01-07T00:09:46.427Z",
      "thumbnail": "https://archive.org/services/img/march-or-die-1977",
      "language": "eng",
      "year": 1977,
      "collection": "feature_films",
      "downloads": 197
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "107 min",
    "imdbRating": 6.3,
    "imdbVotes": 4109,
    "Genre": "Adventure, Drama, Romance",
    "Plot": "Foreign Legion Major William Foster (Gene Hackman), an American haunted by his memories of the recently-ended Great War, is assigned to protect a group of archaeologists at their dig. Foster's unit includes the charming, thieving rascal Marco Segrain (Terence Hill), who joined the Legion only to avoid prison. After long stretches portraying the boredom and hardship of day-to-day life in the Legion, Foster's command occupies a small village where the archaeologists believe they've found a burial site sacred to the Arabs. Arab leader El Krim (Sir Ian Holm) uses this affront to unite the tribes in Jihad, and attacks the tiny Legion garrison at the dig. An epic battle follows, very reminiscent of Zulu (1964). Costumes, firearms, and props are all very authentic-looking, and show great attention to detail.",
    "Director": "Dick Richards",
    "Writer": "David Zelag Goodman, Dick Richards",
    "Actors": "Gene Hackman, Terence Hill, Catherine Deneuve",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0071566",
    "tt0042367",
    "tt0045551",
    "tt0022689",
    "tt0026083",
    "tt0033297",
    "tt0035525",
    "tt0045162",
    "tt0012657",
    "tt0012675",
    "tt0031082",
    "tt0050208"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.427Z"
}