{
  "movieId": "tt0000465",
  "title": "The Kingdom of the Fairies",
  "year": 1903,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-kingdom-of-the-fairies-1903-directed-by-georges-melies",
      "id": "the-kingdom-of-the-fairies-1903-directed-by-georges-melies",
      "title": "The Kingdom Of The Fairies (1903) Directed By Georges Méliès",
      "description": "The Kingdom of the Fairies (1903) 'Le royaume des fées' Director: Georges Méliès The Kingdom of the Fairies (French: Le Royaume des fées), initially released in the United States as Fairyland, or the Kingdom of the Fairies and in Great Britain as The Wonders of the Deep, or Kingdom of the Fairies, is a 1903 French silent trick film directed by Georges Méliès. Production: The film historian Georges Sadoul suggested that the film was freely adapted from La Biche au Bois, a popular féerie by the brothers Goignard, which had been first produced in March 1845 at the Théâtre de la Porte Saint-Martin and which was frequently revived throughout the nineteenth century. A publication on Méliès's films by the Centre national du cinéma cites Charles Perrault's story \"Sleeping Beauty\" as the most direct inspiration for the film, with the seven fairies in that tale reduced to four. The film's cast includes Georges Méliès as Prince Bel-Azor, Marguerite Thévenard as Princess Azurine, and Bleuette Bernon as the fairy Aurora. Sadoul, examining a production still from the film, identified the actor Durafour as a supporting player. While most of the film was shot indoors, the nuptial cortege scene near the end was filmed outdoors in Méliès's garden, with a real horse. Special effects in the film were created with stage machinery, rolling panoramas, miniature models, pyrotechnics, substitution splices, superimpositions, and dissolves. Release: The Kingdom of the Fairies was released by Méliès's Star Film Company and is numbered 483–498 in its catalogues. (In Méliès's numbering system, films were listed and numbered according to their order of production, and each catalogue number denotes about 20 meters of film.) The film was registered for American copyright at the Library of Congress on 3 September 1903. According to the Méliès scholar John Frazer, the film was \"the most ambitious Star Film production to date\" and \"was widely distributed and heavily promoted.\" An original film score was prepared for the film's projection in larger cities. As with at least 4% of Méliès's entire output (including such films as A Trip to the Moon, The Impossible Voyage, The Rajah's Dream, and The Barber of Seville), some prints were individually hand-colored and sold at a higher price. Reception: The Kingdom of the Fairies, like Méliès's similarly spectacular films A Trip to the Moon (1902) and The Impossible Voyage (1904), was one of the most popular films of the first few years of the twentieth century. When Thomas L. Tally debuted the film at his Lyric Theater in Los Angeles in 1903 (billing it as \"Better than A Trip to the Moon\"), the Los Angeles Times called the film \"an interesting exhibit of the limits to which moving picture making can be carried in the hands of experts equipped with time and money to carry out their devices.\" The film theorist Jean Mitry called it \"undoubtedly Méliès's best film, and in any case the most intensely poetic.\" Prints of the film survive in the film archives of the British Film Institute and the Library of Congress. -From Wikipedia",
      "fileSize": 90596050,
      "addedAt": "2026-01-07T00:12:10.589Z",
      "thumbnail": "https://archive.org/services/img/the-kingdom-of-the-fairies-1903-directed-by-georges-melies",
      "year": 1903,
      "collection": "feature_films",
      "downloads": 248
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": 7.3,
    "imdbVotes": 1724,
    "Genre": "Short, Adventure, Fantasy",
    "Plot": "In this spectacular, meticulously hand-coloured movie which incorporates a plethora of never-seen-before special effects, interchanging panoramas and soft dissolves, the indefatigable director Georges Méliès presents a free adaptation of the popular theatre play \"La Biche au Bois\" by the brothers Cogniard. Following the announcement of the espousal of the beautiful young Princess Azurine and the noble Prince Bel-Azor, a baleful old witch casts a fiery and sulphurous curse on the innocent woman, and then aided by her evil minions, captures her and takes off on a blazing gilded chariot. But the valiant Prince along with the Fairy Godmother, Aurora, pursue the sorceress, from the unfathomable chasms of the eternal sea to great Neptune's realm, and finally, the abominable witch's impregnable castle. Who shall stand in the way of love?",
    "Director": "Georges Méliès",
    "Writer": "Georges Méliès, Madame d'Aulnoy",
    "Actors": "Georges Méliès, Marguerite Thévenard, Bleuette Bernon",
    "Language": "French, English",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000417",
    "tt0000575",
    "tt0223755",
    "tt0223291",
    "tt0222731",
    "tt0215664",
    "tt0215992",
    "tt0135631",
    "tt0216419",
    "tt0215575",
    "tt0215749",
    "tt0135122"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.589Z"
}