{
  "imdbId": "tt0026133",
  "title": "Branded a Coward",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BrandedaCoward",
      "id": "BrandedaCoward",
      "title": "Branded a Coward",
      "description": "Safely from behind some shrubbery, Johnny Hume (Mickey Rentschler), a boy of 6 or 7, witnesses the slaughter of his mother, father and brother by the guns of a gang led by \"the Cat\" (Yakima Canutt). Twenty years later finds Johnny (Johnny Mack Brown) grown to manhood, an expert bronc rider and target shooter - but paralyzed with fearful memories in an actual gunfight.",
      "fileSize": 1588341372,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BrandedaCoward",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 15900
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FvS-PWlS80c",
      "id": "FvS-PWlS80c",
      "title": "Branded a Coward (1935) JOHNNY MACK BROWN",
      "description": "Stars: Johnny Mack Brown, Billie Seward, Syd Saylor\nDirector: Sam Newfield\n\nAs a boy, Johnny witnesses the massacre of his family by outlaws, but he does nothing even though he held a gun in his hand.  Years later he is known as a coward until a bandit called, “The Cat” comes to town.",
      "addedAt": "2025-12-26T23:51:46.253Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/FvS-PWlS80c/maxresdefault.webp",
      "duration": 3385,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 5.5,
    "imdbVotes": 132,
    "Genre": "Drama, Western",
    "Plot": "Safely from behind some shrubbery, Johnny Hume, a boy of 6 or 7, witnesses the slaughter of his mother, father and brother by the guns of a gang led by \"the Cat\". Twenty years later finds Johnny grown to manhood, an expert bronc rider and target shooter - but paralyzed with fearful memories in an actual gunfight. This is brought home to him when some outlaws stick up the local saloon and Johnny ends up cowering behind the bar. Accompanied by his sole pal, stuttering Oscar, Johnny hits the trail in shame. Along the way, he encounters a stage holdup and snaps out of his fear long enough to plug a couple of the highwaymen, chase the rest away, and wrest the runaway coach from a final thug. Aboard the coach is Ethel Carson, most grateful for Johnny's bravery. Johnny takes the stage on to Lawless, Arizona, where Ethel, the wounded stage driver and, worst of all, Oscar extol his prowess as a gunman. As a consequence, he's offered the job of marshal, which resurrects all his fears - until he learns that the stagerobbers, who have been terrorizing the area, are run by a new, unknown boss emulating (down to using his name) the viciousness of 'the Cat'. Complicating matters, Ethel's father despises Johnny whose father, a lawman, killed his brother during a ruckus...",
    "Director": "Sam Newfield",
    "Writer": "Richard Martinsen, Earle Snell",
    "Actors": "Johnny Mack Brown, Billie Seward, Syd Saylor",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028969",
    "tt0028645",
    "tt0028195",
    "tt0027669",
    "tt0028404",
    "tt0029147",
    "tt0030159",
    "tt0133763",
    "tt0030870",
    "tt0030556",
    "tt0031164",
    "tt0031318"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}