{
  "imdbId": "tt0059646",
  "title": "Repulsion",
  "year": 1965,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pagkasuklam",
      "id": "pagkasuklam",
      "title": "Repulsion",
      "description": "Title: Repulsion Summary: A sex-repulsed woman who disapproves of her sister's boyfriend sinks into depression and has horrific visions of rape and violence. Directed by: Roman Polanski Actors: Catherine Deneuve, Ian Hendry, John Fraser Production Company: Compton Films Release Date: 3 October 1965 (USA) Aspect Ratio: 1.66 : 1 In London, Belgian immigrant Carol Ledoux shares an apartment with her older sister Helen, and works as a manicurist at a beauty salon. Helen uses the word \"sensitive\" to describe Carol's overall demeanor, which is almost like she walks around in a daze, rarely speaking up about anything. When she does speak up, it generally is about something against one of those few issues on which she obsesses, such as Helen's boyfriend Michael's invasion of her space at the apartment. That specific issue may be more about men in general than just Michael's actions, as witnessed by Carol being agitated by hearing Helen and Michael's lovemaking, and she not being able to rebuff the advances effectively of a male suitor, Colin, who is infatuated with her. One of those other obsessive issues is noticing cracks and always wanting to fix them. While Helen and Michael leave on a vacation to Pisa, Italy, Carol chooses largely to lock herself in the apartment, ditching work. There, she is almost hypnotized...",
      "fileSize": 786753404,
      "addedAt": "2026-01-07T00:10:12.694Z",
      "thumbnail": "https://archive.org/services/img/pagkasuklam",
      "year": 1965,
      "collection": "feature_films",
      "downloads": 29835
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "105 min",
    "imdbRating": 7.6,
    "imdbVotes": 59958,
    "Genre": "Drama, Horror, Thriller",
    "Plot": "In London, Belgian immigrant Carol Ledoux shares an apartment with her older sister Helen, and works as a manicurist at a beauty salon. Helen uses the word \"sensitive\" to describe Carol's overall demeanor, which is almost like she walks around in a daze, rarely speaking up about anything. When she does speak up, it generally is about something against one of those few issues on which she obsesses, such as Helen's boyfriend Michael's invasion of her space at the apartment. That specific issue may be more about men in general than just Michael's actions, as witnessed by Carol being agitated by hearing Helen and Michael's lovemaking, and she not being able to rebuff the advances effectively of a male suitor, Colin, who is infatuated with her. One of those other obsessive issues is noticing cracks and always wanting to fix them. While Helen and Michael leave on a vacation to Pisa, Italy, Carol chooses largely to lock herself in the apartment, ditching work. There, she is almost hypnotized by her solitude, which leads to her mental state deteriorating as those obsessions come to the fore. She quickly descends into madness, which ultimately also affects those that are trying to get in touch with her.",
    "Director": "Roman Polanski",
    "Writer": "Roman Polanski, Gérard Brach, David Stone",
    "Actors": "Catherine Deneuve, Ian Hendry, John Fraser",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "Nominated for 1 BAFTA Award2 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt0063522",
    "tt0058283",
    "tt0058430",
    "tt0058620",
    "tt0059821",
    "tt0055478",
    "tt0063242",
    "tt1149606",
    "tt2741564",
    "tt0079082",
    "tt0090197",
    "tt0036307"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "horror",
      "name": "Horror"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.694Z"
}