{
  "movieId": "tt0038758",
  "title": "Murder in the Music Hall",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/murder-in-the-music-hall-1946",
      "id": "murder-in-the-music-hall-1946",
      "title": "Murder In The Music Hall (1946)",
      "description": "Vera Hruba Raltson, William Marshall Republic Pictures",
      "fileSize": 1414849273,
      "addedAt": "2026-01-07T00:09:54.332Z",
      "thumbnail": "https://archive.org/services/img/murder-in-the-music-hall-1946",
      "collection": "feature_films",
      "downloads": 1080
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": 6.2,
    "imdbVotes": 135,
    "Genre": "Crime, Music, Mystery",
    "Plot": "Lila Leighton, the lovely ice ballerina, meets Carl Lang, former ice-show producer, at his New York City penthouse apartment. Lia refuses Lang's offer to star in his new Music Hall Ice Show. Back at the Music Hall, Lila discovers she has left her purse at Lang's apartment and returns there, and is followed by orchestra-leader Don Jordan. There, they discover that Carl has been stabbed to death. Gracie, Lila's understudy, has also followed them there and helps them remove traces of Lila's visit. They also find a pair of kid-gloves, and the laundry mark leads Don to Rita Morgan, wealthy socialite, wife of George Morgan, and Rita turns out to be a former ice-skating star for Carl Lang's Music Hall shows. Rita admits to being in Lang's apartment but says he was in excellent health when she left, and says she passed no one except a blind man. Don and Lila discover that the 'blind man' was really Rita's husband, George Morgan, who claims he used the disguise in order to trail and protect his wife. The NYC police are also on the case, and with the help of Don and Lila, succeed in solving the murder.",
    "Director": "John English",
    "Writer": "Frances Hyland, László Görög, Arnold Lipp",
    "Actors": "Vera Ralston, William Marshall, Helen Walker",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037752",
    "tt0037984",
    "tt0038212",
    "tt0036690",
    "tt0037245",
    "tt0040543",
    "tt0038494",
    "tt0038577",
    "tt0038640",
    "tt0039800",
    "tt0024443",
    "tt0038449"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.332Z"
}