{
  "imdbId": "tt0028634",
  "title": "Bill Cracks Down",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BillCracksDown",
      "title": "Bill Cracks Down",
      "description": "When William Reardon (Pierre Watkin), a steel magnate, dies and leaves a strange will. When his spineless and dandified heir and son (Ranny Weeks) returns home from living in Paris, he finds \"Tons' Walker (Grant Withers), a strong and burly steel worker running the company, per his late-father's will request. He also finds that his father's will specifies the Junior will change his name to Bill Hall and work in the family steel mill for a year under the fake name. Walker's job is to make a man out of the son. The son is not overjoyed by this prospect. Neither is Walker.",
      "fileSize": 1559609414,
      "id": "BillCracksDown"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hXR_C68I3FY",
      "title": "Bill Cracks Down (1937) | Colorized Public Domain Action Drama with Grant Withers & Beatrice Roberts",
      "description": "Bill Cracks Down (1937) is a fast-paced action drama from Universal Pictures’ Golden Age, now fully restored and colorized for today’s audiences. Directed by William Nigh, this film captures the grit and ambition of America’s industrial age, telling a story of personal responsibility, reform, and redemption. Featuring Grant Withers in one of his strongest working-class roles and Beatrice Roberts as the determined heroine, this restoration brings a forgotten Depression-era gem back to life for modern viewers in the United States, Europe, and beyond. The film was released under the alternative title Men of Steel.\n\nPlot Summary:\nThe story centers on Bill Reardon (Grant Withers), a carefree playboy who suddenly inherits his late father’s struggling steel mill. Initially indifferent to hard labor or leadership, Bill’s arrogance alienates the workers who see him as just another spoiled heir. His perspective shifts when he witnesses the hardships and loyalty of the men his father once led, especially through the wisdom of veteran foreman Tom Harris (Robert Gleckler).\n\nAs Bill learns the realities of running a factory amid economic pressures, he clashes with corrupt business rivals and union agitators exploiting unrest for personal gain. When sabotage threatens the plant’s survival, Bill must prove himself through action rather than privilege. His journey from irresponsible heir to courageous leader forms the film’s emotional and moral core.\n\nAdding emotional depth is Jane Forbes (Beatrice Roberts), a strong-willed social worker who challenges Bill’s self-centered worldview. Their developing relationship underscores themes of integrity, compassion, and the dignity of honest work — values that resonated deeply with 1930s audiences during America’s recovery from the Great Depression.\n\nCast and Crew:\n• Director: William Nigh\n• Producer: Trem Carr\n• Screenplay: George Waggner\n• Story by: Joseph O’Donnell\n• Cinematography: Gilbert Warrenton\n• Editing: Charles Craft\n\nStarring:\n• Grant Withers as Bill Reardon\n• Beatrice Roberts as Jane Forbes\n• Robert Gleckler as Tom Harris\n• John Miljan as Fred Barrett\n• Ruth Gillette as Myrtle\n• Robert Emmett Keane as Jonathan\n• Wade Boteler as Detective\n• Edwin Stanley as Judge\n• George Cleveland as Worker Representative\n\nFilm Significance:\n“Bill Cracks Down” stands as a compelling portrait of 1930s American industry and masculinity, embodying the populist values of strength through labor and reform through courage. It illustrates the working-class hero archetype that dominated Depression-era storytelling. The film also offers a fascinating early look at director William Nigh’s recurring themes of moral awakening and civic duty, later seen in his work on the “Mr. Wong” series. The movie’s industrial setting and blue-collar ethos make it particularly resonant for modern viewers who appreciate authentic narratives of work, leadership, and redemption.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Bill Cracks Down remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1937 original was produced in black and white, matching the industrial tone of its story. Through careful colorization, this edition revitalizes the film’s energy, emphasizing the glow of molten steel, the contrast of machinery, and the human emotion in its performances. This restoration preserves the original pacing while enhancing its cinematic realism — a perfect fit for TV audiences and older viewers who value nostalgia with modern clarity. For fans of classic American labor dramas, this colorized version brings the story to life with renewed emotional depth and visual warmth.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe specialize in restoring and colorizing films from the Golden Age of Hollywood, preserving forgotten treasures for audiences in the USA, Europe, and beyond. From action-packed dramas to heartfelt romances, our mission is to ensure that public domain cinema remains alive, discoverable, and culturally relevant.\n\n#BillCracksDown #GrantWithers #BeatriceRoberts #1930sDrama #PublicDomainMovie #ColorizedClassic #IndustrialDrama #GoldenAgeHollywood #WilliamNigh #FilmRestoration #ClassicCinema",
      "id": "hXR_C68I3FY",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=um8mb4xTQ8U",
      "title": "1937 - Bill Cracks Down - A steel mill showdown for inheritance - directed by William Nigh",
      "description": "A steel mill worker (Grant Withers) will inherit the business if he can straighten out his late boss's reprehensible son (Ranny Weeks).\n\nAlternative title: Men of Steel (1937)\n\nColorized version https://youtu.be/hEdzhAYFZHs\n\nDirector: William Nigh\nWriters: Morgan Cox, Owen Francis, Dorrell McGowan\nStars: Grant Withers, Beatrice Roberts, Ranny Weeks, Judith Allen\nGenres: Action • Comedy • Drama • Romance\nFilming Location: United States\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "id": "um8mb4xTQ8U",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_jGCJxnwWDE",
      "title": "Bill Cracks Down (1937) DRAMA",
      "description": "Stars: Grant Withers, Beatrice Roberts, Ranny Weeks \nDirector: William Nigh\n\nA steel magnate, dies and leaves a strange will that specifies his dandified son must work in the family steel mill for a year under the fake name.",
      "id": "_jGCJxnwWDE",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "61 min",
    "imdbRating": 5.6,
    "imdbVotes": 108,
    "Genre": "Action, Drama, Romance",
    "Plot": "When William Reardon, a steel magnate, dies and leaves a strange will. When his spineless and dandified heir and son returns home from living in Paris, he finds \"Tons' Walker, a strong and burly steel worker running the company, per his late-father's will request. He also finds that his father's will specifies the Junior will change his name to Bill Hall and work in the family steel mill for a year under the fake name. Walker's job is to make a man out of the son. The son is not overjoyed by this prospect. Neither is Walker.",
    "Director": "William Nigh",
    "Writer": "Morgan Cox, Owen Francis, Dorrell McGowan",
    "Actors": "Grant Withers, Beatrice Roberts, Ranny Weeks",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0028592",
      "title": "Atlantic Flight",
      "year": 1937,
      "imdbRating": 4.6,
      "imdbVotes": 92,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029376",
      "title": "Park Avenue Logger",
      "year": 1937,
      "imdbRating": 5.8,
      "imdbVotes": 100,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030839",
      "title": "Telephone Operator",
      "year": 1937,
      "imdbRating": 5.6,
      "imdbVotes": 193,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030126",
      "title": "Female Fugitive",
      "year": 1938,
      "imdbRating": 5.6,
      "imdbVotes": 78,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030170",
      "title": "Gangster's Boy",
      "year": 1938,
      "imdbRating": 5.9,
      "imdbVotes": 103,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030692",
      "title": "Romance of the Limberlost",
      "year": 1938,
      "imdbRating": 7,
      "imdbVotes": 85,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026458",
      "title": "The Headline Woman",
      "year": 1935,
      "imdbRating": 5.8,
      "imdbVotes": 135,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031987",
      "title": "Streets of New York",
      "year": 1939,
      "imdbRating": 6.1,
      "imdbVotes": 164,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0140551",
      "title": "Sky Racket",
      "year": 1937,
      "imdbRating": 4.6,
      "imdbVotes": 117,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0169357",
      "title": "Valley of Terror",
      "year": 1937,
      "imdbRating": 5.9,
      "imdbVotes": 102,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027366",
      "title": "Black Gold",
      "year": 1936,
      "imdbRating": 5.2,
      "imdbVotes": 103,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030090",
      "title": "The Duke of West Point",
      "year": 1938,
      "imdbRating": 6.4,
      "imdbVotes": 185,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}