{
  "imdbId": "tt0041549",
  "title": "A Kiss for Corliss",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AlmostABride49",
      "id": "AlmostABride49",
      "title": "A Kiss for Corliss",
      "description": "Title: A Kiss for Corliss Summary: A teenage girl who has a crush on an older, more sophisticated man tells all her friends that the man is her boyfriend. Soon that story starts making its way around the town. Directed by: Richard Wallace Actors: Shirley Temple, David Niven, Tom Tully Production Company: Strand Productions Release Date: 25 November 1949 (USA) Aspect Ratio: 1.37 : 1 Color: Black and White After a brief encounter with the romantic and thrice divorced Kenneth Marquis, Corliss Archer decides to write in her diary that they are together in order to make her boyfriend Dexter jealous. Corliss' father had also served as attorney representing Kenneth Marquis' ex-wife during his most recent divorce trial. When Corliss and Dexter don't come home one evening until five in the morning, Corliss decides to pretend to have amnesia to avoid the inevitable punishment awaiting her. The Archers then read Corliss' diary to her to help her remember the things that were important to her. After reading that she was dating Kenneth Marquis, they send for Marquis, who, in order to irritate Mr. Archer, whom he loathes, says that it's all true, and even gives the newspapers the story that they're engaged. Corliss, whose charade ends then, tries to tell everyone what really happened, but by that time, no one will believe her. The matter is complicated by the fact that Corliss' uncle, a navy ...",
      "fileSize": 650540364,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AlmostABride49",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 7190
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "88 min",
    "imdbRating": 5.8,
    "imdbVotes": 558,
    "Genre": "Comedy",
    "Plot": "After a brief encounter with the romantic and thrice divorced Kenneth Marquis, Corliss Archer decides to write in her diary that they are together in order to make her boyfriend Dexter jealous. Corliss' father had also served as attorney representing Kenneth Marquis' ex-wife during his most recent divorce trial. When Corliss and Dexter don't come home one evening until five in the morning, Corliss decides to pretend to have amnesia to avoid the inevitable punishment awaiting her. The Archers then read Corliss' diary to her to help her remember the things that were important to her. After reading that she was dating Kenneth Marquis, they send for Marquis, who, in order to irritate Mr. Archer, whom he loathes, says that it's all true, and even gives the newspapers the story that they're engaged. Corliss, whose charade ends then, tries to tell everyone what really happened, but by that time, no one will believe her. The matter is complicated by the fact that Corliss' uncle, a navy chaplain, comes to visit and offers to perform the ceremony!",
    "Director": "Richard Wallace",
    "Writer": "Howard Dimsdale, F. Hugh Herbert",
    "Actors": "Shirley Temple, David Niven, Tom Tully",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040535",
    "tt0017305",
    "tt0043721",
    "tt0043618",
    "tt0039396",
    "tt0041098",
    "tt0041089",
    "tt0041489",
    "tt0041623",
    "tt0041509",
    "tt0041587",
    "tt0041108"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}