{
  "imdbId": "tt0037547",
  "title": "Blood on the Sun",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BloodontheSun",
      "title": "Blood on the Sun",
      "description": "In pre-World War II Tokyo the American newspaper editor Nick Condon (James Cagney) working for an English-language daily paper aimed at the American business community is given a document relating to Japan's foreign affairs which could have political ramifications if found. He meets up with Iris Hilliard (Sylvia Sidney), a woman who wants to secure the document even if it means dealing with the Japanese secret police and their threats.",
      "id": "BloodontheSun"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blood-on-the-sun-1945",
      "title": "Blood On The Sun (1945)",
      "description": "SANGUE SOBRE O SOL ( Blood On The Sun, USA ) ( Filme Completo / Legendado em Português ) Data de Lançamento:  26 de abril de 1945 » SOBRE O FILME: Nick Condon, jornalista americano em Tóquio, publica um violento artigo sobre a política expansionista japonesa revelando a existência do \"plano Tanaka\", um projecto desenvolvido por um grupo de militares sob as ordens do coronel Tojo, visando estabelecer a hegemonia do Japão sobre o Extremo Oriente. » » DIREÇÃO: Frank Lloyd GÊNERO: Ação, Drama, Guerra ORIGEM: USA DURAÇÃO: 98 minutos » » ELENCO PRINCIPAL:  James Cagney ... Nick Condon  Sylvia Sidney ... Iris Hilliard  Porter Hall ... Arthur Bickett  John Emery ... Premier Giichi Tanaka  Robert Armstrong ... Coronel Hideki Tojo  Wallace Ford ... Ollie Miller  Rosemary DeCamp ... Edith Miller  John Halloran ... Capitão Oshima  Leonard Strong ... Hijikata  James Bell ... Charley Sprague  Marvin Miller ... Yamada  Rhys Williams ... Joseph Cassell  Frank Puglia ... Prince Tatsugi",
      "id": "blood-on-the-sun-1945"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blood-on-the-sun-1945-full-movie-trim",
      "title": "Blood On The Sun (1945) Full Movie",
      "description": "Reporter Nick Condon (James Cagney) works for a newspaper in Tokyo and publishes a story exposing the Japanese government's imperialist plans. When government officers seize the newspaper, Nick finds himself at the center of a cover-up led by ruthless Premier Giichi Tanaka (John Emery). Harried by a gents Colonel Hideki Tojo (Robert Armstrong) and Captain Oshima (John Halloran), Nick goes on the lam, meets a mysterious woman and has a dramatic confrontation on his way to the American Embassy.",
      "id": "blood-on-the-sun-1945-full-movie-trim"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blood-on-the-sun-1945_202310",
      "title": "Blood On The Sun (1945)",
      "description": "Nick Condon, an American journalist in 20s Tokyo, publishes the Japanese master plan for world domination. Reaction from the understandably upset Japanese provides the action, but this is overshadowed by the propaganda of the time. Watch on RetroFlix:  https://retroflix.org/blood-on-the-sun-1945/",
      "id": "blood-on-the-sun-1945_202310"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fSURia0rGvU",
      "title": "Blood on the Sun (1945) [Drama] [War]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"Blood on the Sun\" (1945) is a film starring James Cagney and Sylvia Sidney. The film is based on a fictional history behind the Tanaka Memorial document. The film won the Academy Award for Best Art Direction for a Black & White (Wiard Ihnen, A. Roland Fields) film in 1945.\n\nNick Condon (James Cagney) is a journalist for the Tokyo Chronicle. He prints a story disclosing Japan's plan to conquer the world. The newspaper is seized by Japanese officers. Condon gets the Tanaka Plan, a paper in which all the plans are described. The Japanese spies who follow him think that Ollie and Edith Miller (Wallace Ford and Rosemary DeCamp) are the ones who discovered the plan because they suddenly have a lot of money and are coming back to the USA. When Condon goes to the ship to bid them farewell, he finds Edith dead. He can only see a woman's hand with a ring with a huge ruby. Back home, he finds Ollie, in terrible condition. He gets from Ollie the Tanaka plan.\n\nPremier Giichi Tanaka (John Emery) wants his plans to remain secret, and sends Col. Hideki Tojo (Robert Armstrong) Capt. Oshima (John Halloran) and Hijikata (Leonard Strong) to follow him everywhere. Condon loses the document with the Tanaka plan. Ollie's disappeared, and the police arrest them in terms of scandal and much noise while having a party with two girls in his apartment, which is a complete lie.\n\nCondon meets Iris Hilliard (Sylvia Sidney), half American and half Chinese. At first, he suspects her of being the lady in the ship, then he doesn't. They fall in love. She seems to be betraying him, especially when Condon sees the ring with the ruby in her hand.\n\nAt the end, it turns out she's been sent by a politician who wants peace and was present when the Tanaka plan was devised. Condon leaves his job after ten days. When he's about to leave Japan, he meets the politician and Iris in the harbour. The politician signs the document to prove it's real. They are discovered by the Japanese army.\n\nIris runs away with the document in a cargo ship which will take her out of Japan. To distract the Japanese officers, Condon fights his greatest enemy and tries to reach the American Embassy. He's shot at by spies dressed in street clothes, but he's not killed. The consular adviser goes out of the Embassy and takes Condon inside still alive, and the Japanese officers can't prevent it, because they couldn't find the Tanaka document when registering Condon.\n\n----\n\nDirected by Frank Lloyd, produced by William Cagney, written by Garrett Fort and Lester Cole, starring James Cagney, Sylvia Sidney and Porter Hall.\n\n---\n\nSource: \"Blood on the Sun\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 27 May 2012. Web. 5 August 2012. http://en.wikipedia.org/wiki/Blood_on_the_Sun.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "fSURia0rGvU",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9q3hcIzRKxU",
      "title": "Blood on the Sun (1945) | Colorized Public Domain War Drama with James Cagney and Sylvia Sidney",
      "description": "Blood on the Sun (1945) is an American war drama directed by Frank Lloyd, starring Academy Award–winning actor James Cagney alongside Sylvia Sidney. This restored and colorized edition revives one of the most politically charged and historically significant films of World War II–era Hollywood. Combining thrilling espionage, bold propaganda, and Cagney’s trademark intensity, the film dramatizes Japan’s militarist expansion plans leading up to World War II. By restoring this film in color, we present a vital piece of cinema history to audiences in the United States, Europe, and beyond, ensuring its relevance to modern viewers while preserving its Golden Age power.\n\nPlot Summary:\nThe story is set in Tokyo during the turbulent years before Japan’s attack on Pearl Harbor. Nick Condon (James Cagney), an American journalist stationed in Japan, uncovers the existence of the Tanaka Memorial, a secret imperialist document outlining Japan’s blueprint for global conquest. His discovery places him in grave danger, as Japanese secret police and high-ranking officials will stop at nothing to silence him.\n\nCondon becomes entangled with Iris Hilliard (Sylvia Sidney), a beautiful and mysterious woman whose loyalties remain unclear. As he digs deeper into the conspiracy, he faces betrayal, violence, and constant pursuit through Tokyo’s shadowy underworld. With sharp dialogue and unrelenting tension, the film builds to an explosive finale where courage, integrity, and sacrifice define Condon’s struggle against oppression.\n\nCast and Crew:\n• Director: Frank Lloyd\n• Producers: William Cagney, Jack Warner\n• Screenplay: Lester Cole, Nathaniel Curtis\n• Story: Lester Cole\n• Cinematography: Theodor Sparkuhl\n• Music: Miklós Rózsa\n\nStarring:\n• James Cagney as Nick Condon\n• Sylvia Sidney as Iris Hilliard\n• Porter Hall as Arthur Bickett\n• John Emery as Baron Tanaka\n• Wallace Ford as Ollie Miller\n• Rosemary DeCamp as Edith Miller\n• Robert Armstrong as Capt. Oshima\n• Marvin Miller as Hijikata\n• Hugh Beaumont as Johnny Clarke\n\nFilm Significance:\n“Blood on the Sun” was released in 1945, the same year World War II ended, making it a direct product of its time. With its portrayal of Japanese militarism, it functioned both as entertainment and as wartime propaganda, reflecting America’s anxieties about global conflict. The film is notable for its strong anti-fascist themes, its use of political intrigue, and its sharp dialogue, which combined to reinforce Hollywood’s wartime messaging.\n\nJames Cagney, already one of Hollywood’s top stars, gives a fiery and determined performance as the heroic journalist who risks everything to expose the truth. His blend of toughness and moral clarity made the role iconic. Sylvia Sidney adds emotional depth as Iris, a woman caught between loyalty and survival. Supported by Miklós Rózsa’s atmospheric score, the film offers both thrills and substance. In 1946, it won the Academy Award for Best Art Direction (Black and White), solidifying its place in cinema history.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Blood on the Sun remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nWhen first released in 1945, Blood on the Sun was presented in black and white, heightening its dramatic tone but limiting its visual reach to modern audiences. The colorized edition enhances the authenticity of Tokyo’s setting, the richness of period costumes, and the vivid intensity of its espionage sequences. Cagney’s performance, already electric, gains added impact when seen in restored color, drawing new generations into the suspenseful world of pre-war intrigue. For fans of classic war dramas, political thrillers, and Golden Age Hollywood, this edition provides a rare chance to experience the film with renewed vibrancy.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#BloodOnTheSun #JamesCagney #SylviaSidney #WorldWarIIFilm #PublicDomainMovie #ColorizedClassic #PoliticalThriller #GoldenAgeHollywood #FilmRestoration #MiklosRozsa",
      "id": "9q3hcIzRKxU",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Blood_on_the_Sun",
      "title": "Blood on the Sun",
      "description": "Title: Blood on the Sun Summary: A dedicated American reporter in 1930s Japan is determined to expose that government's plan for world domination. Directed by: Frank Lloyd Actors: James Cagney, Sylvia Sidney, Porter Hall Production Company: William Cagney Productions Release Date: 1945 (UK) Aspect Ratio: 1.37 : 1 Nick Condon is a newspaper reporter working in Tokyo who refuses to toe the Japanese line on the expansionist policies of the anti-democratic Imperialist government. When it becomes clear to the authorities that Condon isn't going to cooperate and that he has some valuable information and contacts, they decide to get him in their clutches for some interrogations and then dispose of him.",
      "id": "Blood_on_the_Sun"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G2iOvnRP_rM",
      "title": "Blood On The Sun (1945) JAMES CAGNEY",
      "description": "Stars: James Cagney, Sylvia Sidney, Porter Hall\nDirector: Frank Lloyd\n\nIn pre-WWII Tokyo, dedicated American reporter and a beautiful spy uncover a Japanese plot for world domination!",
      "id": "G2iOvnRP_rM",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blood-on-the-sun-1945-colorized-movie-576p-sd",
      "title": "Blood on the Sun (restored, colorized) (1945, thriller, imdb score: 6.1)",
      "description": "Blood on the Sun is a 1945 American spy thriller film directed by Frank Lloyd and starring James Cagney , Sylvia Sidney and Porter Hall . The film is based on a fictional history behind the Tanaka Memorial document. The film won the Academy Award for Best Art Direction for a Black & White ( Wiard Ihnen , A. Roland Fields ) film in 1945.",
      "id": "blood-on-the-sun-1945-colorized-movie-576p-sd"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bloodonthesun-4-k",
      "title": "Blood on the sun 1945[Colorized, 4k, 60fps]",
      "description": "Blood on the sun is a 1945  black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @ https://colab.research.google.com/  Technologies used: A.I. Colorizing: https://github.com/jantic/DeOldify A.I. Increasing frame rate 60 FPS: https://rife-vfi.github.io  A.I. Upscaling to 4K: https://ffmpeg.org  GPU: Google Colab",
      "id": "bloodonthesun-4-k"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "94 min",
    "imdbRating": "6.0",
    "imdbVotes": "2,330",
    "Genre": "Drama, Romance, Thriller",
    "Plot": "Nick Condon is a newspaper reporter working in Tokyo who refuses to toe the Japanese line on the expansionist policies of the anti-democratic Imperialist government. When it becomes clear to the authorities that Condon isn't going to cooperate and that he has some valuable information and contacts, they decide to get him in their clutches for some interrogations and then dispose of him.",
    "Director": "Frank Lloyd",
    "Writer": "Lester Cole, Nathaniel Curtis, Garrett Fort",
    "Actors": "James Cagney, Sylvia Sidney, Porter Hall",
    "Language": "English, Japanese",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 1 win total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0038990",
      "title": "The Strange Woman",
      "year": 1946,
      "imdbRating": "6.5",
      "imdbVotes": "2,520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035612",
      "title": "The Adventures of Tartu",
      "year": 1943,
      "imdbRating": "6.9",
      "imdbVotes": "1,095",
      "language": "German, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015310",
      "title": "The Sea Hawk",
      "year": 1924,
      "imdbRating": "7.1",
      "imdbVotes": "668",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019557",
      "title": "Weary River",
      "year": 1929,
      "imdbRating": "6.1",
      "imdbVotes": "527",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0014721",
      "title": "Black Oxen",
      "year": 1923,
      "imdbRating": "5.8",
      "imdbVotes": "248",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019824",
      "title": "The Divine Lady",
      "year": 1928,
      "imdbRating": "6.2",
      "imdbVotes": "957",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035452",
      "title": "Tomorrow We Live",
      "year": 1942,
      "imdbRating": "6.3",
      "imdbVotes": "263",
      "language": "German, French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041886",
      "title": "Hour of Glory",
      "year": 1949,
      "imdbRating": "7.1",
      "imdbVotes": "3,350",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt16156352",
      "title": "Vladivostok",
      "year": 2021,
      "imdbRating": "5.4",
      "imdbVotes": "108",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0037179",
      "title": "A Place of One's Own",
      "year": 1945,
      "imdbRating": "6.2",
      "imdbVotes": "904",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037865",
      "title": "Leave Her to Heaven",
      "year": 1945,
      "imdbRating": "7.6",
      "imdbVotes": "15,938",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018972",
      "title": "Hangman's House",
      "year": 1928,
      "imdbRating": "6.6",
      "imdbVotes": "549",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T19:07:51.014Z"
}