{
  "movieId": "tt0048001",
  "title": "Doctor at Sea",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Dr.OfSea",
      "id": "Dr.OfSea",
      "title": "Doctor at Sea",
      "description": "Title: Doctor at Sea Summary: A bachelor doctor goes to sea to escape the boredom of shore practice, but studies the nurses more than medicine, and Brigitte Bardot is around. Directed by: Ralph Thomas Actors: Dirk Bogarde, Brenda de Banzie, Brigitte Bardot Production Company: Group Film Productions Limited Release Date: 23 February 1956 (USA) Aspect Ratio: 1.85 : 1 With a view to escaping both boredom as a junior G.P. and unwanted womanly advances, young doctor Simon Sparrow becomes a medical officer on \"the Lotus\", an all-male cargo ship. As soon as he sets foot on board, Simon encounters various eccentric characters (including quick-tempered, authoritarian, whisky- addicted captain Hogg)and gets involved in many an embarrassing situation (including seasickness). In Rio he gets to know Hélène Colbert , a sexy young French singer and falls under her spell. When woman hater Hogg is forced to take on two female characters, Muriel Mallet, the daughter of the shipping company and her friend ... Hélène on his freighter, Simon is delighted!",
      "fileSize": 823576424,
      "addedAt": "2026-01-07T00:06:19.369Z",
      "thumbnail": "https://archive.org/services/img/Dr.OfSea",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 4475
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "89 min",
    "imdbRating": 5.8,
    "imdbVotes": 1124,
    "Genre": "Comedy",
    "Plot": "With a view to escaping both boredom as a junior general practitioner and unwanted womanly advances, young Dr. Simon Sparrow (Sir Dirk Bogarde) becomes a medical officer on \"the Lotus\", an all-male cargo ship. As soon as he sets foot on-board, Simon encounters various eccentric characters (including quick-tempered, authoritarian, whisky-addicted Captain Hogg (James Robertson Justice)) and gets involved in many an embarrassing situation (including seasickness). In Rio he gets to know Hélène Colbert (Brigitte Bardot) , a sexy young French singer and falls under her spell. When woman hater Hogg is forced to take on two female characters, Muriel Mallet (Brenda de Banzie), the daughter of the shipping company and her friend, Hélène on his freighter, Simon is delighted.",
    "Director": "Ralph Thomas",
    "Writer": "Richard Gordon, Nicholas Phipps, Jack Davies",
    "Actors": "Dirk Bogarde, Brenda de Banzie, Brigitte Bardot",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "Nominated for 1 BAFTA Award2 nominations total"
  },
  "relatedMovies": [
    "tt0053354",
    "tt0056325",
    "tt0052780",
    "tt0050225",
    "tt0039679",
    "tt0052270",
    "tt0048700",
    "tt4887484",
    "tt0047900",
    "tt0048018",
    "tt0048188",
    "tt0048290"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.369Z"
}