{
  "imdbId": "tt0031602",
  "title": "Made for Each Other",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/made-for-each-other-1939",
      "title": "Made for Each Other (1939)",
      "description": "A couple struggle to find happiness after a whirlwind courtship. Watch on RetroFlix:  https://retroflix.org/made-for-each-other-1939/",
      "fileSize": 678124540,
      "id": "made-for-each-other-1939"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/made-for-each-other-4-k",
      "title": "Made For Each Other (1939) [Colorized, 4k, 60FPS]",
      "description": "Made For Each Other is a 1939 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6670332393,
      "id": "made-for-each-other-4-k"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/made_for_each_other_film",
      "title": "Made for Each Other",
      "description": "Jimmy Stewart plays John Horace 'Johnny' Mason, a young lawyer who marries Jane Mason (Carole Lombard) after only know her one day.",
      "fileSize": 5645563541,
      "id": "made_for_each_other_film"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/madefor_each_other",
      "title": "Made for Each Other",
      "description": "Jimmy Stewart plays a young lawyer John Mason. Who marries Jane Mason (Carole Lombard) after knowing her for just one day.",
      "fileSize": 5648661529,
      "id": "madefor_each_other"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/madeforeachother1939carolelombard",
      "title": "Made For Each Other (1939) CAROLE LOMBARD, JIMMY STEWART",
      "description": "After a whirlwind courtship, newlyweds discover their road to happiness is besieged by a meddling mother-in-law, money problems, a curmudgeonly boss, and tragic illness.",
      "fileSize": 340603354,
      "id": "madeforeachother1939carolelombard"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WiAM1gr9BLc",
      "title": "Made for Each Other (1939) [Comedy] [Drama] [Romance]",
      "description": "John Mason is a young, somewhat timid attorney in New York City. He has been doing his job well, and he has a chance of being made a partner in his law firm, especially if he marries Eunice, the daughter of his employer, Judge Doolittle. However, John meets Jane during a business trip, and they fall in love and marry immediately. John's mother is disappointed with his choice, and an important court trial forces him to cancel the honeymoon. He wins the case, but by that time Judge Doolittle has chosen John's kowtowing coworker as the new partner.\n\nJane encourages John to demand a raise and a promotion, but with finances tightened by the Depression, Doolittle requires that all employees accept pay cuts. After Jane has a baby, John becomes discouraged by his unpaid bills and by tension between Jane and his mother, who lives with them in their small apartment.\n\nOn New Year's Eve, 1938--39, the baby is rushed to the hospital with pneumonia. The baby will die within hours unless a serum is delivered by plane from Salt Lake City. Doolittle agrees to provide funding to deliver the serum, but with a storm raging, and with a wife and children to consider, the pilot refuses to fly. John pleads over the telephone, and the pilot's unmarried friend takes the job. The new pilot almost crashes in the mountains, and the plane's engine catches fire a short distance from New York. The pilot is also injured and knocked unconscious after jumping from the plane and parachuting to safety, but he crawls to a nearby farm house after he comes to. The farmer sees the box containing the serum and telephones the hospital, and the baby is saved. A few years later, John is made partner at the law firm and his son has just spoken his first words.\n\n---\n\nDirected by John Cromwell, produced byDavid O. Selznick, written by Rose Franken (story)\nJo Swerling and Frank Ryan, starring Carole Lombard as Jane Mason, James Stewart as John Horace Mason, Charles Coburn as Judge Joseph M. Doolittle, Lucile Watson as Mrs. Harriet Mason (John Mason's mother) and Alma Kruger as Sister Madeline.\n\n---\n\nSource: \"Made for Each Other (1939 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 18 May 2013. Web. 15 July 2013. http://en.wikipedia.org/wiki/Made_for_Each_Other_(1939_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "WiAM1gr9BLc",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1VeYlDeOyZc",
      "title": "Made for Each Other (1939) | Colorized Public Domain Romance with Carole Lombard & James Stewart",
      "description": "Made for Each Other (1939) is a classic American romantic drama directed by John Cromwell and produced by David O. Selznick, featuring two of Hollywood’s most beloved stars, Carole Lombard and James Stewart. This restored and colorized edition of the public domain film brings renewed vibrancy to a heartfelt story of love, struggle, and perseverance that reflects the realities of marriage during the late 1930s. By presenting this Golden Age gem in color, Colorized Public Domain connects timeless storytelling with the expectations of modern audiences in the USA, Europe, and beyond.\n\nPlot Summary:\nThe story follows John Mason (James Stewart), a young lawyer who impulsively marries Jane (Carole Lombard) after a whirlwind romance. Though deeply in love, their marriage quickly faces real-world pressures: financial strain, career setbacks, family disapproval, and the daunting weight of responsibility. As John struggles to establish himself in his law firm, he is undermined by his domineering senior partner and overshadowed by rivals. Jane, meanwhile, must endure criticism from her mother-in-law, who believes John made a poor choice. Their troubles intensify when the couple has a child, only for their baby to fall gravely ill. In a desperate fight against time, John and Jane must rally their strength, love, and courage to save their child and rebuild their relationship.\n\nThe film’s emotional power lies in its honest depiction of marriage as both joyful and difficult, with Stewart and Lombard delivering nuanced performances that highlight the vulnerability and resilience of ordinary people. Unlike many romances of the period that relied on fantasy or escapism, Made for Each Other is grounded in realism, portraying the everyday trials faced by young couples in Depression-era America.\n\nCast and Crew:\n• Director: John Cromwell\n• Producer: David O. Selznick\n• Screenplay: Jo Swerling\n• Cinematography: Leon Shamroy\n• Editing: Hal C. Kern\nStarring:\n• Carole Lombard as Jane Mason\n• James Stewart as John Mason\n• Charles Coburn as Judge Joseph Doolittle\n• Lucile Watson as Mrs. Doolittle\n• Eddie Quillan as Tony\n• Alma Kruger as Mrs. Mason\n• Donald Briggs as Carter\n• Harry Davenport as Dr. Healy\n\nFilm Significance:\nMade for Each Other captures the late 1930s Hollywood transition toward more grounded narratives, focusing on the hardships of working-class and middle-class families. Carole Lombard, known primarily for screwball comedies, demonstrates her dramatic range in this role, while James Stewart continues his rise as one of Hollywood’s most relatable leading men. The film also benefits from Selznick’s production values, which lend emotional weight and polish to a story about endurance, love, and human resilience. While not a box-office hit in its original release, the film has endured in the public domain, cherished for its sincerity, performances, and timeless themes.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Made for Each Other remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1939 release was in black and white, reflecting the conventions of its time. While authentic, many modern audiences often avoid black-and-white films. By offering a carefully colorized edition, this restoration bridges the gap between historical preservation and modern viewing habits, ensuring that the film’s powerful performances and emotional resonance are experienced with renewed depth.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten dramas to culturally significant masterpieces. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#MadeForEachOther #CaroleLombard #JamesStewart #ClassicRomance #1930sDrama #PublicDomainMovie #ColorizedClassic #FilmRestoration #GoldenAgeHollywood #1939Movies #MarriageDrama",
      "id": "1VeYlDeOyZc",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6VuCSmVcmEQ",
      "title": "Made for Each Other (1939) CAROLE LOMBARD",
      "description": "Stars: Carole Lombard, James Stewart, Charles Coburn\nDirector: John Cromwell\nProducer: David O. Selznick\n\nAfter a whirlwind courtship, newlyweds discover their road to happiness is besieged by a meddling mother-in-law, money problems, a curmudgeonly boss, and tragic illness. David O. Selznick's next production would be \"Gone with the Wind.\"",
      "id": "6VuCSmVcmEQ",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LcYKLVbBMyg",
      "title": "Made for Each Other (1939) JAMES STEWART",
      "description": "Stars: James Stewart Carole Lombard, Charles Coburn\nDirector: John Cromwell\n\nYoung lawyer meets and marries girl after knowing her one day. Takes bride home to meet his mother who disapproves of the marriage.",
      "id": "LcYKLVbBMyg",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "92 min",
    "imdbRating": 6.2,
    "imdbVotes": 4172,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Young lawyer meets and marries girl after knowing her one day. Takes bride home to meet his mother who disapproves of the marriage. Lawyer thinks everything will be fine as he moves up the ladder of the law firm. He doesn't and things get tough. A baby makes things even tougher.",
    "Director": "John Cromwell",
    "Writer": "Jo Swerling, Rose Franken, Frank Ryan",
    "Actors": "Carole Lombard, James Stewart, Charles Coburn",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0027331",
      "title": "Banjo on My Knee",
      "year": 1936,
      "imdbRating": 6.2,
      "imdbVotes": 660,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032846",
      "title": "No Time for Comedy",
      "year": 1940,
      "imdbRating": 6.2,
      "imdbVotes": 1263,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029855",
      "title": "Algiers",
      "year": 1938,
      "imdbRating": 6.6,
      "imdbVotes": 3341,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031282",
      "title": "Eternally Yours",
      "year": 1939,
      "imdbRating": 5.7,
      "imdbVotes": 851,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031593",
      "title": "Love Affair",
      "year": 1939,
      "imdbRating": 7.3,
      "imdbVotes": 6880,
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032132",
      "title": "Winter Carnival",
      "year": 1939,
      "imdbRating": 5.5,
      "imdbVotes": 96,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028010",
      "title": "My Man Godfrey",
      "year": 1936,
      "imdbRating": 7.9,
      "imdbVotes": 27078,
      "language": "English, Russian",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0035360",
      "title": "Son of Fury: The Story of Benjamin Blake",
      "year": 1942,
      "imdbRating": 7.1,
      "imdbVotes": 1888,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032599",
      "title": "His Girl Friday",
      "year": 1940,
      "imdbRating": 7.8,
      "imdbVotes": 67176,
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032428",
      "title": "East Side Kids",
      "year": 1940,
      "imdbRating": 5.5,
      "imdbVotes": 292,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030063",
      "title": "The Divorce of Lady X",
      "year": 1938,
      "imdbRating": 6.6,
      "imdbVotes": 1581,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030637",
      "title": "Pygmalion",
      "year": 1938,
      "imdbRating": 7.7,
      "imdbVotes": 10214,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.421Z"
}