{
  "movieId": "tt0032730",
  "title": "Love Thy Neighbor",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/love-thy-neighbor-1940-",
      "id": "love-thy-neighbor-1940-",
      "title": "Love Thy Neighbor (1940)",
      "description": "Jack Benny, Fred Allen",
      "fileSize": 1263709094,
      "addedAt": "2026-01-07T00:09:38.894Z",
      "thumbnail": "https://archive.org/services/img/love-thy-neighbor-1940-",
      "collection": "feature_films",
      "downloads": 3210
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "82 min",
    "imdbRating": 6.8,
    "imdbVotes": 169,
    "Genre": "Comedy, Musical",
    "Plot": "Jack Benny is preparing his New Year's Eve radio broadcast but takes time out to take his valet Rochester to meet his girlfriend Josephine arriving on a steamer. Fred Allen and his sister Barbara are also en route to the dock to meet Barbara's daughter Mary, returning from a personal appearance tour in South America. Josephine is her maid. Their cars get involved in an accident and, in a bumping contest, Fred reduces Jack's old Maxwell to junk, and is taken to jail. Mary loses her dress in an accident and Jack offers to get her another one, but winds up being arrested for stealing. Barbara tells Mary that Fred is a nervous wreck because of Jack's continual slander of him on Jack's radio program. Jack hires the Merry Macs away from Fred and Fred decides to go to Miami for a rest. Jack decides to open his radio program from Miami. They meet, have another brawl, and end up in jail again. The two are in a motorboat accident where both are knocked unconscious and Mary, in an effort to end the feud, tells Fred that Jack saved his life. They have dinner together at Fred's apartment and Rochester, whom Fred has hired away from Jack, appears and the feud is on again.",
    "Director": "Mark Sandrich",
    "Writer": "Edmund Beloin, William Morrow, Zion Myers",
    "Actors": "Jack Benny, Fred Allen, Mary Martin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032289",
    "tt0031611",
    "tt0029885",
    "tt0031077",
    "tt0032309",
    "tt0032410",
    "tt0032624",
    "tt0033214",
    "tt0032847",
    "tt0033029",
    "tt0035969",
    "tt0033323"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.894Z"
}