{
  "imdbId": "tt0009678",
  "title": "Take a Chance",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-take-a-chance",
      "id": "silent-take-a-chance",
      "title": "Take a Chance",
      "fileSize": 871520589,
      "addedAt": "2026-01-07T00:11:15.974Z",
      "thumbnail": "https://archive.org/services/img/silent-take-a-chance",
      "language": "English",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 839
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/take-a-chance-1918-directed-by-alfred-j.-goulding",
      "id": "take-a-chance-1918-directed-by-alfred-j.-goulding",
      "title": "Take A Chance (1918) Directed By Alfred J. Goulding",
      "description": "Take a Chance Directed by Alfred J. Goulding Produced by Hal Roach Starring Harold Lloyd Release date December 15, 1918 Running time 10 min Country United States Languages Silent English intertitles Take a Chance is a 1918 American short comedy film featuring Harold Lloyd . [ 1 ] Plot Harold becomes smitten with a hired girl (Bebe) who is washing a staircase. When Bebe's beau (Snub) arrives to drive her to a picnic, Harold stealthily sneaks into the back seat of Snub's car. Without their being aware of his presence, Harold causes them to get into a fight. When the car arrives at the picnic grounds, Harold and Bebe enter the park together and enjoy a frantic few moments on a seesaw. Two prison escapees enter the park. One clubs Harold over the head and dresses him in his prison garb to confuse the pursuing police force. Harold uses his wits and athletic ability to elude capture by many officers. Cast Harold Lloyd Snub Pollard Bebe Daniels William Blaisdell Sammy Brooks Harry Burns Billy Fay James A. Fitzgerald William Gillespie Lew Harvey Wallace Howe Bud Jamison Dee Lampton Belle Mitchell References \"Progressive Silent Film List: Take a Chance\" . Silent Era . Retrieved December 13, 2008 .",
      "fileSize": 256092807,
      "addedAt": "2026-01-07T00:11:46.527Z",
      "thumbnail": "https://archive.org/services/img/take-a-chance-1918-directed-by-alfred-j.-goulding",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 75
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbRating": 6.5,
    "imdbVotes": 615,
    "Genre": "Comedy, Short",
    "Plot": "A carefree young man who just \"spent\" the last dime in his pocket comes across a young woman just hired to clean the front steps of a house. They meet when the young man first meets her bar of soap. While they are attracted to each other, she is already going on a date with Simplex Joe. The carefree young man decides to follow the pair on their date to a park where they will be picnicking. What happens with this love triangle is affected by other picnickers at the park, including an amorous woman unlucky in love, and the police chasing after a pair of escaped convicts from a local prison.",
    "Director": "Alfred J. Goulding",
    "Writer": "N/A",
    "Actors": "Harold Lloyd, Bebe Daniels, 'Snub' Pollard",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0009099",
    "tt0009071",
    "tt0009082",
    "tt0009171",
    "tt0009316",
    "tt0009631",
    "tt0009732",
    "tt0007709",
    "tt0007764",
    "tt0010023",
    "tt0007686",
    "tt0010516"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.527Z"
}