{
  "imdbId": "tt0033595",
  "title": "Federal Fugitives",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Federal_Fugitives",
      "id": "Federal_Fugitives",
      "title": "Federal Fugitives",
      "description": "WWII has just started, and Federal Agent Madison spots a man in Washington D.C. that might be a wanted saboteur.",
      "fileSize": 1011233405,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/Federal_Fugitives",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 12723
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XBDbQ0JCmu8",
      "id": "XBDbQ0JCmu8",
      "title": "Federal Fugitives (1941) WWII THRILLER",
      "description": "Stars: Neil Hamilton, Doris Day (II), Victor Varconi\nDirector: William Beaudine\n\nSuspecting that enemy agents are out to snare the plans for plastic aircraft that are being developed for the war effort, a federal agent goes undercover as an executive with the aircraft's manufacturer. It turns out that he was right about the enemy agents, and soon they send in one of their sexiest operatives to seduce the company's new \"representative\".\n\nThe Doris Day of this film was born on April 16, 1910 in Hempstead, New York, USA. She was an actress, known for Federal Fugitives (1941), Saga of Death Valley (1939) and Village Barn Dance (1940). She died on September 16, 1998 in Huntington Beach, California, USA.",
      "addedAt": "2025-12-26T23:55:37.789Z",
      "thumbnail": "https://i.ytimg.com/vi/XBDbQ0JCmu8/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDcBFCMpWF-Cwk8y1DhMlRMDmNvWQ",
      "duration": 3489,
      "language": "en",
      "year": 1941,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "66 min",
    "imdbRating": 5,
    "imdbVotes": 75,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "Spotting a man in Washington D.C. that he thinks looks like Otto Lieberman, a fugitive that caused a plane crash that killed eight people, government-agent James Madison manages to identify him by his fingerprints on a water-glass without Lieberman's knowledge, and learns his address after having his regular cab-driver, Chuck, follow him. Lieberman is now calling himself Dr. Frederic Haskell and working with Bruce Lane on a scheme to gain control of Henry Gregory's aircraft plant. Gregory has invented a casting-process that uses plastic for some of the parts in an airplane. Gregory was not building \"all-plastic\" airplanes. Learning the Lieberman and Lane have met with Gregory, Madison also meets him and asks that he be introduced to them as Robert Edmunds, Gregory's partner in Los Angeles. Lane is a shady-lobbyist who employs Rita Bennett, who is not an operative for a spy ring, on a part-time basis to flatter and distract politicians and businessmen. Rita is a good girl at heart moonlighting between singing gigs. Madison has digestion problems and pops sodium-meth pills like they were candy and Lieberman, once he learns that Madison is a government agent, slips a poison one in his pill bottle that will cure his digestive-problems forever. Rita is on her way to warn him when she jaywalks across the street and gets hit by a car, and is taken to a hospital, while Madison is wandering around Baltimore, playing Russian-roulette with his pills, while looking for the German-agent and his Russian and Portugese pals.",
    "Director": "William Beaudine",
    "Writer": "Martin Mooney",
    "Actors": "Neil Hamilton, Doris Day, Victor Varconi",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033526",
    "tt0035057",
    "tt0035171",
    "tt0036189",
    "tt0033469",
    "tt0033758",
    "tt0033966",
    "tt0034251",
    "tt0035089",
    "tt0037441",
    "tt0035694",
    "tt0032404"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.398Z"
}