{
  "movieId": "tt0037304",
  "title": "Spook Town",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SpookTown",
      "id": "SpookTown",
      "title": "Spook Town",
      "description": "Dry Gulch Trading Post owner Kurt Fabian (Robert Barron) advances money on mortgages to the local settlers to finance an irrigation program. Three Texas Rangers, Tex Wyatt (Dave O'Brien), Jim Steele (James Newill) and Panhandle Perkins (Guy Wilkerson) transport the money in a strong box which they place in the Wells Fargo safe as agent Sam Benson (Dick Curtis) assures them that he is the only one who knows the safe combination.",
      "fileSize": 1538375714,
      "addedAt": "2026-01-07T00:06:51.870Z",
      "thumbnail": "https://archive.org/services/img/SpookTown",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 14637
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gFNHqU16ShM",
      "id": "gFNHqU16ShM",
      "title": "Spook Town (1944) DAVE O'BRIEN",
      "description": "Stars: Dave O'Brien, James Newill, Guy Wilkerson\n Director: Elmer Clifton\n\n Dirty Gulch Trading Post owner Kurt Fabian advances money on mortgages to the local settlers to finance an irrigation program. Three Texas Rangers, Tex Wyatt, Jim Steele and Panhandle Perkins transport the money in a strong box which they place in the Wells Fargo safe as agent Sam Benson assures them that he is the only one who knows the safe combination. Fabian conspires with Bill Gunner, Breed Crocker and Trigger Booth to steal the money and they fail, but Fabian gets it on his own. Benson is arrested, and a committee of citizens, led by Oscar Perrin accuse Captain Wyatt and the Rangers of carelessness and request the resignation of the Captain if the money is not recovered. Fabian owns the abandoned ghost town of \"Mystic\", and Gunner, Crocker and Booth take him there to force him to tell where he has hidden the money, They shoot at his feet to intimidate him and he dies from fright and shock. Tex, Jim and Panhandle are also searching the town and they find Fabian's body. Benson tells Lucy Warren that the money may be hidden in the old Wells Fargo office in Mystic and they go there and find the strongbox. Enter Gunner, Crocker and Booth. Enter the Rangers. Gunfight.",
      "addedAt": "2025-12-26T23:53:53.894Z",
      "thumbnail": "https://i.ytimg.com/vi/gFNHqU16ShM/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhrIGsoazAP&rs=AOn4CLAcS3aJvGYI_tGoqw5EnJnAdk5-yQ",
      "duration": 3411,
      "language": "en",
      "year": 1944,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "59 min",
    "imdbRating": 5.4,
    "imdbVotes": 73,
    "Genre": "Drama, Western",
    "Plot": "Dty Gulch Trading Post owner Kurt Fabian advances money on mortgages to the local settlers to finance an irrigation program. Three Texas Rangers, Tex Wyatt, Jim Steele and Panhandle Perkins transport the money in a strong box which they place in the Wells Fargo safe as agent Sam Benson assures them that he is the only one who knows the safe combination. Fabian conspires with Bill Gunner, Breed Crocker and Trigger Booth to steal the money and they fail, but Fabian gets it on his own. Benson is arrested, and a committee of citizens, led by Oscar Perrin accuse Captain Wyatt and the Rangers of carelessness and request the resignation of the Captain if the money is not recovered. Fabian owns the abandoned ghost town of \"Mystic\", and Gunner, Crocker and Booth take him there to force him to tell where he has hidden the money, They shoot at his feet to intimidate him and he dies from fright and shock. Tex, Jim and Panhandle are also searching the town and they find Fabian's body. Benson tells Lucy Warren that the money may be hidden in the old Wells Fargo office in Mystic and they go there and find the strongbox. Enter Gunner, Crocker and Booth. Enter the Rangers. Gunfight.",
    "Director": "Elmer Clifton",
    "Writer": "Elmer Clifton",
    "Actors": "Dave O'Brien, James Newill, Guy Wilkerson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037460",
    "tt0036888",
    "tt0037176",
    "tt0036664",
    "tt0036847",
    "tt0036750",
    "tt0037901",
    "tt0031190",
    "tt0026254",
    "tt0036669",
    "tt0036835",
    "tt0035965"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.870Z"
}