{
  "imdbId": "tt0022485",
  "title": "Tokyo Chorus",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tokyo-chorus",
      "id": "tokyo-chorus",
      "title": "Tokyo Chorus",
      "description": "Combining three prevalent genres of the day—the student comedy, the salaryman film, and the domestic drama—Ozu created this warmhearted family comedy, and demonstrated that he was truly coming into his own as a cinema craftsman. The setup is simple: Low wage–earning dad Okajima is depending on his bonus, and so are his wife and children, yet payday doesn't exactly go as planned. Exquisite and economical, Ozu's film alternates between brilliantly mounted comic sequences and heartrending working-class realities.",
      "fileSize": 7472688497,
      "addedAt": "2026-01-07T00:12:44.285Z",
      "thumbnail": "https://archive.org/services/img/tokyo-chorus",
      "language": "jpn",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 2716
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 7.1,
    "imdbVotes": 1608,
    "Genre": "Comedy, Drama",
    "Plot": "Mr. Omura, a teacher, leads a group of male students in an outdoor drill. One slight, comic young man, Shinji Okajima, has no shirt under his jacket; he scratches at fleas and makes faces behind Omura's back. Jump ahead several years, Shinji is married with three children. He sells insurance, and on the company's annual bonus day, he protests when an older worker is fired. Shinji loses his own job as a result, and he and his wife must find ways to cope. Lassitude, pride, the demands and needs of young children, and relationships from bygone school days all play a part in the outcome of their struggle.",
    "Director": "Yasujirô Ozu",
    "Writer": "Komatsu Kitamura, Kôgo Noda",
    "Actors": "Tokihiko Okada, Emiko Yagumo, Hideo Sugawara",
    "Language": "None, Japanese",
    "Country": "Japan",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0023634",
    "tt0021406",
    "tt0043313",
    "tt0051720",
    "tt0053134",
    "tt0053579",
    "tt0020980",
    "tt0020563",
    "tt0024120",
    "tt0023937",
    "tt0021649",
    "tt0021890"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}