{
  "imdbId": "tt0031058",
  "title": "Ask a Policeman",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/aap44779882",
      "id": "aap44779882",
      "title": "Ask a Policeman",
      "description": "Title: Ask a Policeman Summary: The mirthful adventures of Police-Sergeant Samuel Dudfoot and his two constables, Albert Brown and Jeremiah Harbottle, who stage a fabricated crime-wave to save their jobs---and then find themselves involved in the real thing. Directed by: Marcel Varnel Actors: Will Hay, Graham Moffatt, Moore Marriott Production Company: Gainsborough Pictures Release Date: 29 August 1939 (USA) Aspect Ratio: 1.37 : 1 Turnbottom Round prides itself as the village without crime; there has not been an arrest recorded by the local police for years. Unfortunately, this is more to do with the inability of Sgt Dudfoot and his constables Jerry and Harbottle to so much as recognise a crime. With their jobs on the line, the trio attempt to stage a crime of their own, only to inadvertently uncover a smuggling ring and a headless horseman...",
      "fileSize": 496194816,
      "addedAt": "2026-01-07T00:07:18.439Z",
      "thumbnail": "https://archive.org/services/img/aap44779882",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 3929
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "83 min",
    "imdbRating": 7.4,
    "imdbVotes": 1010,
    "Genre": "Adventure, Comedy, Crime",
    "Plot": "Turnbottom Round prides itself as the village without crime: there has not been an arrest recorded by the local police for years. Unfortunately, this is more to do with the inability of Sgt. Dudfoot and his constables Jerry and Harbottle to so much as recognise a crime. With their jobs on the line, the trio attempt to stage their own crime, only to inadvertently uncover a smuggling ring and a headless horseman.",
    "Director": "Marcel Varnel",
    "Writer": "Sidney Gilliat, Marriott Edgar, Val Guest",
    "Actors": "Will Hay, Graham Moffatt, Moore Marriott",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029335",
    "tt0032125",
    "tt0030518",
    "tt0032511",
    "tt0030449",
    "tt0030694",
    "tt0030730",
    "tt0034089",
    "tt0033509",
    "tt0034117",
    "tt0028945",
    "tt0035028"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.439Z"
}