{
  "movieId": "tt0028890",
  "title": "Forlorn River",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ForlornRiver",
      "id": "ForlornRiver",
      "title": "Forlorn River",
      "description": "Visiting an old friend, Nevada (Buster Crabbe) and sidekick Weary (Syd Saylor) take jobs on a ranch rounding up horses. But the buyer turns out to be Les Setter (Harvey Stephens), a man Nevada earlier caught robbing a bank. Nevada knows Setter is a fake but bides his time waiting for Setter to make his move. Setter knows this and Nevada soon finds himself in jail when Setter frames him for rustling.",
      "fileSize": 1581834910,
      "addedAt": "2026-01-07T00:06:25.399Z",
      "thumbnail": "https://archive.org/services/img/ForlornRiver",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 6173
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hmDFEvPpSn8",
      "id": "hmDFEvPpSn8",
      "title": "Forlorn River (1937) BUSTER CRABBE🍕ZANE GREY",
      "description": "Stars: Buster Crabbe, June Martel, Harvey Stephens\nDirector: Charles Barton\nWriter: Zane Grey (novel)\n\nNevada (Buster Crabbe) and sidekick Weary Pierce (Syd Saylor) take jobs on a ranch rounding up horses --- But the buyer turns out to be Harvey Stephens (Les Setter), a man Nevada earlier caught robbing a bank --- Nevada knows Stephens is a fake but bides his time waiting for him to make his move --- Stephens knows this and Nevada soon finds himself in jail when Stephens frames him for rustling --- Forlorn River is held together by the consistently excellent cinematography of Harry Hallenberger.",
      "addedAt": "2025-12-26T23:47:04.335Z",
      "thumbnail": "https://i.ytimg.com/vi/hmDFEvPpSn8/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLBSSDWjEiDdETA56hYLLalmRpYhvw",
      "duration": 3363,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "56 min",
    "imdbRating": 5.4,
    "imdbVotes": 66,
    "Genre": "Drama, Western",
    "Plot": "\"Nevada\" (Buster Crabbe) and \"Weary\" Pierce (Syd Saylor)hijack the loot taken in a bank hold-up by Les Setter (Harvey Stephens), and his gang. They escape from Sheriff Jim Henry Warner (Lew Kelly). U. S. government horse-buyer David Ward (Purnell Pratt)is killed by Settler's men and Settler takes his papers and goes to the ranch of Blaine (William Duncan) and asks for the horses Ward was to buy, promising payment from the government later. He also takes an interest in Ina Blaine (June Martel), much to the resentment of her sweetheart Ben Ide (John Patterson). \"Nevada\" and \"Weary\" are hired for the horse round-up but Setter has them and Ben arrested on a fake charge. With the aid of the camp cook, Millie Moran (Ruth Warren) they escape and start in pursuit of Setter and his gang.",
    "Director": "Charles Barton",
    "Writer": "Zane Grey, Robert Yost, Stuart Anthony",
    "Actors": "Buster Crabbe, June Martel, Harvey Stephens",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028653",
    "tt0028748",
    "tt0028004",
    "tt0025939",
    "tt0028582",
    "tt0028635",
    "tt0028645",
    "tt0028649",
    "tt0028732",
    "tt0028934",
    "tt0029005",
    "tt0029445"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}