{
  "imdbId": "tt0055052",
  "title": "The End of Summer",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-end-of-summer",
      "id": "the-end-of-summer",
      "title": "The End Of Summer",
      "description": "The Kohayakawa family is thrown into distress when childlike father Manbei takes up with his old mistress, in one of Ozu's most deftly modulated blendings of comedy and tragedy.",
      "fileSize": 8449378701,
      "addedAt": "2026-01-07T00:11:57.685Z",
      "thumbnail": "https://archive.org/services/img/the-end-of-summer",
      "language": "jpn",
      "year": 1961,
      "collection": "feature_films",
      "downloads": 12600
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "103 min",
    "imdbRating": 7.7,
    "imdbVotes": 4794,
    "Genre": "Drama",
    "Plot": "Approaching his senior years, widowed Manbei Kohayagawa is the owner of a small family run sake brewery in Kyoto. Hisao, his daughter Fumiko's husband, works for the company. Another daughter, Osaka based Akiko, who works at an art gallery, is widowed, her deceased husband who decided not to work in the family business, but maintain his own career as a college professor. Kohayagawa's third and last daughter, Noriko, a clerk in an office, has never been married, but is now of marrying age. Because the business is not doing well as it cannot compete with the larger sake companies, Kohayagawa wants to ensure that all his daughters are taken care of financially, which means finding husbands for both Akiko and Noriko, that task which is aided by Kohayagawa's younger brother-in-law, Yanosuke Kitagawa. Akiko and Noriko know about the arrangements with the potential husbands - although Akiko's first \"date\" is more of a surprise to her - and generally go along with the dates as are requested of them, but neither is sure if it is what she is looking for for herself. Akiko is quite content with her current lot in life, taking care of her growing son, Minoru. And Noriko has only confided in Akiko that she has a close friendship with a man named Tadashi Teramoto, a teacher who has just moved to Sapporo indefinitely for work. Kohayagawa's want for his daughters may also be because he has rediscovered companionship in his own life, with a former mistress, Sasaki Tsune, who he accidentally ran into after not seeing her for nineteen years. Sasaki has told him that her twenty-one year old daughter, spoiled Yuriko Tsune, is his biological daughter, something he believes, although Sasaki doesn't really know or care, as doesn't Yuriko, especially if they can get out of him what they want. Kohayagawa's family does not know of Sasaki currently in his life, but they do know of his marital indiscretion previously with her and do suspect that his \"business meetings\" which are ruses to meet with her are not what he says they are. Something that happens to Kohayagawa leads to Akiko and Noriko coming to some decisions about their own lives.",
    "Director": "Yasujirô Ozu",
    "Writer": "Kôgo Noda, Yasujirô Ozu",
    "Actors": "Ganjirô Nakamura, Setsuko Hara, Yôko Tsukasa",
    "Language": "Japanese, English",
    "Country": "Japan",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0053579",
    "tt0056444",
    "tt0051093",
    "tt0053134",
    "tt0043313",
    "tt0051720",
    "tt0040505",
    "tt0024120",
    "tt0049784",
    "tt0023634",
    "tt0023937",
    "tt0021406"
  ],
  "collections": [
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.685Z"
}