{
  "imdbId": "tt0049552",
  "title": "Nightfall",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nightfall1957",
      "id": "nightfall1957",
      "title": "Nightfall (1957) Anne Bancroft, Aldo Ray, Brian Keith - Film Noir",
      "description": "Nightfall is a 1957 American crime film noir directed by Jacques Tourneur and written by Stirling Silliphant. It features Aldo Ray, Brian Keith, and Anne Bancroft. The low-budget film is remembered today for camera work by cinematographer Burnett Guffey. It uses flashbacks as a device to tell the story, which was based on a 1948 novel by David Goodis. Wikipedia: https://en.wikipedia.org/wiki/Nightfall_(1957_film) Suggested Film Noirs: http://bit.ly/2tLevkl The Internet Archive is an excellent choice for entire full length Netflix & YouTube style uploads of drama, mystery, thriller & crime noir movies from the UK & USA for free. Download complete online British & American classic black & white films from the 1940s & 1950s.",
      "fileSize": 265772753,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/nightfall1957",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 17688
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1956-nightfall-al-caer-la-noche-jacques-tourneur-vose",
      "id": "1956-nightfall-al-caer-la-noche-jacques-tourneur-vose",
      "title": "1956 - Nightfall - Al caer la noche - Jacques Tourneur - VOSE",
      "description": "For Academic / Educational Use Only",
      "fileSize": 337592333,
      "addedAt": "2026-01-07T00:06:06.563Z",
      "thumbnail": "https://archive.org/services/img/1956-nightfall-al-caer-la-noche-jacques-tourneur-vose",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 1922
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "78 min",
    "imdbRating": 7.1,
    "imdbVotes": 4833,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "There is money missing from a bank job, an attractive model, an insurance investigator, and two extremely dangerous thugs. James Vanning (Aldo Ray) portrays an innocent man on the run, being pursued by the criminals who stupidly misplaced their take from the crime and think he has it or knows where it is hidden. Add model Marie Gardner (Anne Bancroft) who crossed paths with nice guy Vanning, while he is on the run. This all adds up to a thriller wherein the viewer is drawn into the story and becomes part of the drama. When Marie says \"things that really happen are difficult to explain\" it captures the theme of this film. A nice girl helps a nice guy, who is innocent and is drawn into the drama. As tension mounts she says: \"I am always meeting the wrong man, and it leads to doomed relationships.\" Marie inadvertently leads Vanning into the hands of the villains. However, she is a pseudo-femme fatale, innocently involved in the intrigue and, like the viewer, is gradually drawn into the plot. Beside one of the more chilling murder scenes for that era, the film has a three part flashback, which takes the viewer from a cityscape and menacing oil wells to the snow-covered plains of Wyoming and back to the streets of Hollywood. The interplay of high contrast images makes it worth seeing, but the story keeps the viewer engaged.",
    "Director": "Jacques Tourneur",
    "Writer": "Stirling Silliphant, David Goodis",
    "Actors": "Aldo Ray, Anne Bancroft, Brian Keith",
    "Language": "English, Spanish, Italian",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0051605",
    "tt0048412",
    "tt0048724",
    "tt0048077",
    "tt0050439",
    "tt0048421",
    "tt0049340",
    "tt0049406",
    "tt0049904",
    "tt0049955",
    "tt0049769",
    "tt0049636"
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T17:44:56.818Z"
}