{
  "imdbId": "tt0049970",
  "title": "Yaqui Drums",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/yaqui-drums-1956-",
      "id": "yaqui-drums-1956-",
      "title": "Yaqui Drums (1956)",
      "description": "Rod Cameron, Mary Castle, J. Carrol Naish",
      "fileSize": 1164701509,
      "addedAt": "2026-01-07T00:13:17.038Z",
      "thumbnail": "https://archive.org/services/img/yaqui-drums-1956-",
      "collection": "feature_films",
      "downloads": 696
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/yaqui-drums-1956-_202110",
      "id": "yaqui-drums-1956-_202110",
      "title": "Yaqui Drums (1956)",
      "description": "Rod Cameron, Mary Castle, J. Carrol Naish",
      "fileSize": 1164687015,
      "addedAt": "2026-01-07T00:13:17.038Z",
      "thumbnail": "https://archive.org/services/img/yaqui-drums-1956-_202110",
      "collection": "feature_films",
      "downloads": 356
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "71 min",
    "imdbRating": 6.1,
    "imdbVotes": 28,
    "Genre": "Western",
    "Plot": "Mexican bandit Yaqui Jack and his men hold up a stage coach, kill the driver and guard and are robbing the passengers, ranch owner Matt Quigg, his son Lute and Linda, when they in turn are ambushed by Lefty and his gang. Yaqui Jack is shot but escapes and reaches the camp of Webb Dunham, who treats his wounds. They separate with Webb going to the ranch of his brother who has been murdered. Suspicion turns on Matt, who claims title to the brother's ranch, and has Webb brutally beaten after ordering him from the property. Webb goes to Matt's saloon, where Linda sings, and she and Webb had been in love in California. Webb retaliates against Matt for his beating, and Matt hires Lefty to kill Webb. Lefty, waiting in Webb's cabin to ambush him, is overpowered by Yaqui Jack who has returned to help the man who aided him, and asks Webb to join him and his friends in their fight to free Mexico. Matt, Lute, Linda and Lefty and the sheriff are kidnapped by Yaqui Indians, as is Webb, who shot a Yaqui grabbing Linda. They are taken across the border to be held for ransom, where Lefty confesses to Webb that he had killed Webb's brother on Matt's orders. Lute, with no intentions of returning, persuades his father to let him go across the border to get the ransom money but Linda, whom he had married the night before, refuses to go with him. Matt learns of the intended deceit deceit, and accidentally kills Lute. Yaqui Jack is killed as he dies the Mexican Army authorities who escort Webb, Linda, the sheriff and the now-demented Matt back across the border.",
    "Director": "Jean Yarbrough",
    "Writer": "D.D. Beauchamp, Jo Pagano, Paul Leslie Peil",
    "Actors": "Rod Cameron, Mary Castle, J. Carrol Naish",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0064780",
    "tt0047501",
    "tt0049121",
    "tt0049655",
    "tt0049540",
    "tt0049216",
    "tt0049351",
    "tt0049472",
    "tt0049515",
    "tt0049485",
    "tt0049793",
    "tt0049434"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:17.038Z"
}