{
  "imdbId": "tt0017926",
  "title": "A Gentleman of Paris",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-gentleman-of-paris_1927",
      "id": "a-gentleman-of-paris_1927",
      "title": "A Gentleman of Paris",
      "fileSize": 1800844964,
      "addedAt": "2026-01-07T00:07:18.437Z",
      "thumbnail": "https://archive.org/services/img/a-gentleman-of-paris_1927",
      "language": "English",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 829
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "65 min",
    "imdbRating": 6.6,
    "imdbVotes": 50,
    "Genre": "Comedy",
    "Plot": "Le Marquis de Marignan is a French aristocrat and seducer who flirts with every Parisian girl he meets. If dallying with youngster fräuleins isn't enough to keep him busy, the Marquis also has to cope with an unexpected visit from his fiancée and her father. Not to mention that he is so incorrigible in his womanizing that he has even seduced his valet's wife ( a terrible mistake, this last one, because genuine aristocrats know very well that they can't meddle with the servants so if you must put your honour or your status at risk, it will be better if a rich and old heiress is involved.Herr Harry d'Abbadie d'Arrast, director of the film \"A Gentleman Of Paris\", was an unknown film director who entered American films during the silent year of 1922 and then assisted Herr Chaplin on \"A Woman Of Paris\" (1923) and \"The Gold Rush\" (1925). This mysterious film director, born in Argentina, only directed a few films, eight films namely, including some talkies. \"A Gentleman Of Paris\" is an interesting and elegant comedy very influenced by Herr Monta Bell and especially Herr Ernst Lubitsch, who obviously Herr d'Arrast admired.During the first half of the film, \"A Gentleman Of Paris\" is an exemplary and stylish comedy that uses the camera masterfully; a moving and subjective camera ( close-ups, zooms ) that discreetly gives subtle information or emphasizes the misunderstandings and foolish life of Le Marquis. It has many moments of remarkable high comedy and works perfectly thanks to Herr Adolphe Menjou who plays superbly Le Marquis, an ironic, cynical aristocrat fond of women, and one must not forget Herr Nicholas Soussanin who plays Joseph, the betrayed valet, one of those dutiful but perverse servants very hard to find nowadays.Obviously Herr Lubitsch would have been more malicious, cynical and wicked with this story and he wouldn't digressed from a high comedy to a light comedy as Herr d'Arrast finally did at the end of the film, choosing the path of harmless sentimentality complete with a happy ending instead of continuing the confusion and the cynical attitude of Herr Le Marquis.In spite of all, \"A Gentleman Of Paris\" is a good, even remarkable film for its technical aspects and solid performances of the entire cast although in the end it is much too conventional for Herr Lubitsch.And now, if you'll allow me, I must temporarily take my leave because this German Count must make a Gentleman's agreement with le Marquis.",
    "Director": "Harry d'Abbadie d'Arrast",
    "Writer": "Benjamin Glazer, Roy Horniman, Herman J. Mankiewicz",
    "Actors": "Adolphe Menjou, Shirley O'Hara, Arlette Marchal",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015577",
    "tt0015976",
    "tt0016409",
    "tt0440334",
    "tt0017634",
    "tt0312544",
    "tt0017765",
    "tt0018394",
    "tt0019339",
    "tt0017739",
    "tt0017560",
    "tt0017604"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.437Z"
}