{
  "imdbId": "tt0002130",
  "title": "Dante's Inferno",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-dantes-inferno",
      "id": "silent-dantes-inferno",
      "title": "Dante's Inferno",
      "fileSize": 2729168350,
      "addedAt": "2026-01-07T00:10:59.115Z",
      "thumbnail": "https://archive.org/services/img/silent-dantes-inferno",
      "language": "Italian",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 5174
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "71 min",
    "imdbRating": 7,
    "imdbVotes": 3638,
    "Genre": "Adventure, Drama, Fantasy",
    "Plot": "The poet Dante is lost in a dark and gloomy wood. At the summit of a mountain he sees the light of salvation. He endeavors to ascend to it, but his way is barred by three wild beasts, symbolizing Avarice, Pride and Lust. Beatrice sees his predicament and descends from Paradise into Limbo, where she asks the poet Virgil to rescue and guide Dante. Virgil knows another way to go, but this leads straight through the entire Inferno, before it continues towards Paradise. Virgil leads Dante to the portals of Inferno. Charon ferries them over the river Acheron, and then they start their journey downwards through the different circles of Inferno. Dante meets all kind of sinners and sees the never-ending punishments they have to undergo. The various punishments are adjusted to the different transgressions. Among the sinners Dante recognizes many persons he has met in Florence, when they were still alive. They tell him their sad stories and why they have ended here. At last Dante and Virgil meets the arch traitor Lucifer, who holds the bodies of Brutus and Cassius in his mouth. The two poets climb down the shaggy sides of Lucifer, to reach the subterranean way which leads out of Inferno.",
    "Director": "Francesco Bertolini, Adolfo Padovan, Giuseppe de Liguoro",
    "Writer": "Dante Alighieri",
    "Actors": "Salvatore Papa, Arturo Pirovano, Giuseppe de Liguoro",
    "Language": "Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0189846",
    "tt0055117",
    "tt0056211",
    "tt0061549",
    "tt0029162",
    "tt4404296",
    "tt3159412",
    "tt0015174",
    "tt0015175",
    "tt16233104",
    "tt1135493",
    "tt3210710"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}