{
  "imdbId": "tt0000871",
  "title": "Fools of Fate",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FoolsOfFate1909",
      "title": "\"Fools Of Fate\" (1909) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Fools of Fate\" is a short drama. This film illustrates the work of cinematographer Billy Bitzer, a star of Silent Hall of Fame. A woman can't resist a stranger's attentions and leaves her man in what could be a fatal mistake. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             James Kirkwood, Marion Leonard, Frank Powell Distributed by                   Biograph Company Release date                      October 20, 1909 Country                             United States Running time                    13 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "FoolsOfFate1909"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": "5.7",
    "imdbVotes": "119",
    "Genre": "Short, Drama",
    "Plot": "Fanny is the wife of Ben Webster, a trapper, and while he is an affectionate and dutiful husband, she yearns for something which appears better than her lot. She reasons: \"Have I not youth and beauty and attainments far above this environment? Why should I be compelled to toil and struggle in this wilderness?\" Truly, she did not know just what she yearned for, still a change of any sort would have been acceptable. Discontent is stamped upon her countenance, as Ben bids her good bye for a hunting trip in the North Woods. Webster embarks in his canoe, and sighting game, stands to fire. The light craft is overturned, throwing him into the water. Weighted down by his heavy clothing and cartridge belt, he would have drowned had not his plight been witnessed from the shore by Ed Hilton, a Canadian hunter. Hilton leaps in and succeeds in dragging the half-drowned trapper to land, where a strong friendship springs up between the two, and as night falls they make camp and sleep under the same blanket. Next morning they part with a vow of eternal friendship. Fanny goes to the village grocery store, and by chance meets Hilton, and it is a case of love at first sight with both, each, of course, ignorant of the other's identity. A second meeting is contrived and Hilton, thinking her a single girl, suggests an elopement, to which she consents. A meeting place is planned, and Fanny is there and leaves with Hilton his cabin. She has, however, left a note for Ben saying that she \"is tired, and is going away.\" Poor Webster's heart nearly breaks as he reads this short, but cutting letter. Grief at first possesses him, then revenge. Taking up his gun, he starts after her. He hits a trail with the aid of a couple of villagers who had witnessed unseen the clandestine meeting of Fanny and the Canadian. Tracking them to the cabin he bursts in a few moments after their arrival. You may imagine the amazement on both sides when Ben finds Hilton is the man, and Hilton learns that Webster's wife is the woman. Hilton proves his innocence by commanding Webster to shoot; but no, Ben cannot kill the man to whom he owes his life, and so he staggers out and hack to his own home. Hilton, on the other hand, drives the heartless Fanny from him. She goes out, and for a time is undecided, when she resolves to face her husband and beg his forgiveness. Night has fallen and the cabin is in darkness when she enters. Going to the next room she gets the lantern, by which light she sees her husband sitting with his head reclining on the table. She assumes it is his grief, but on touching him, his inert form falls to the floor, he has terminated his existence. The shock causes her to recoil, and so doing knocks over the lantern, extinguishing the light. There in the shaft of moonlight we leave her kneeling beside the awful result of her discontent. \"Oh, thou fool!\"",
    "Director": "D.W. Griffith",
    "Writer": "Frank E. Woods",
    "Actors": "James Kirkwood, Marion Leonard, Frank Powell",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0000832",
      "title": "A Corner in Wheat",
      "year": 1909,
      "imdbRating": "6.6",
      "imdbVotes": "2,796",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000986",
      "title": "Nursing a Viper",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "120",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000821",
      "title": "The Cardinal's Conspiracy",
      "year": 1909,
      "imdbRating": "4.7",
      "imdbVotes": "125",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001032",
      "title": "The Sealed Room",
      "year": 1909,
      "imdbRating": "6.0",
      "imdbVotes": "985",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001072",
      "title": "A Trap for Santa Claus",
      "year": 1909,
      "imdbRating": "5.6",
      "imdbVotes": "409",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000797",
      "title": "At the Altar",
      "year": 1909,
      "imdbRating": "5.4",
      "imdbVotes": "177",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000936",
      "title": "Lines of White on a Sullen Sea",
      "year": 1909,
      "imdbRating": "6.2",
      "imdbVotes": "133",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000942",
      "title": "The Lonely Villa",
      "year": 1909,
      "imdbRating": "6.1",
      "imdbVotes": "1,054",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000945",
      "title": "Lucky Jim",
      "year": 1909,
      "imdbRating": "4.6",
      "imdbVotes": "74",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000972",
      "title": "The Mountaineer's Honor",
      "year": 1909,
      "imdbRating": "5.8",
      "imdbVotes": "98",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001001",
      "title": "Pippa Passes; or, the Song of Conscience",
      "year": 1909,
      "imdbRating": "5.4",
      "imdbVotes": "130",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001016",
      "title": "Resurrection",
      "year": 1909,
      "imdbRating": "5.1",
      "imdbVotes": "152",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}