{
  "imdbId": "tt0009932",
  "title": "Billy Blazes, Esq.",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/billy-blazes-esq.-1919-directed-by-hal-roach",
      "id": "billy-blazes-esq.-1919-directed-by-hal-roach",
      "title": "Billy Blazes, Esq. (1919) Directed By Hal Roach",
      "description": "Billy Blazes, Esq. Directed by Hal Roach Written by H.M. Walker Produced by Hal Roach Starring Harold Lloyd Cinematography Walter Lundin Distributed by Pathé Exchange Release date July 6, 1919 Running time 13 minutes Country United States Languages Silent English intertitles Billy Blazes, Esq. is a 1919 American short comedy film featuring Harold Lloyd . The film was a parody of Westerns of the time. A print of the film survives in the film archive of the British Film Institute . [ 1 ] Plot summary This section needs expansion . You can help by adding to it . ( May 2023 ) Cast Harold Lloyd as Billy Blazes Bebe Daniels as Nell Snub Pollard as Sheriff 'Gun Shy' Gallagher (as Harry Pollard) Sammy Brooks Billy Fay Noah Young (uncredited) Plot In the misnamed western hamlet of Peaceful Vale, where gun play is commonplace, there has not been a murder in 20 minutes. The father and daughter co-proprietors of a local saloon are harassed by the leader of a violent mob who attempts to run the father out of the country while holding his pretty daughter, Nell, hostage. Heroic Billy Blazes arrives in time to free the father, rescue Nell, and escape with her to safety. The film's final scene, set \"three years later\", shows Nell and Billy as the parents of a large and happy family, whose children are clearly more than three years old. Although the film is only 13 minutes long, the title character does not appear until five minutes into film. See also List of American films of 1919 Harold Lloyd filmography References \"Progressive Silent Film List: Billy Blazes, Esq\" . Silent Era . Retrieved August 14, 2008 .",
      "fileSize": 135661904,
      "addedAt": "2026-01-07T00:07:38.717Z",
      "thumbnail": "https://archive.org/services/img/billy-blazes-esq.-1919-directed-by-hal-roach",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 46
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-billy-blazes-esq-",
      "id": "silent-billy-blazes-esq-",
      "title": "Billy Blazes, Esq.",
      "fileSize": 286552147,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-billy-blazes-esq-",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 322
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "12 min",
    "imdbRating": 6,
    "imdbVotes": 971,
    "Genre": "Short, Comedy, Western",
    "Plot": "In the Old West, there is general lawlessness in the Prairie mining town of Peaceful Vale in Rattlefire County due to the ineffectiveness of Sheriff \"Gun Shy\" Gallagher. This allows outlaws like Panther Pete to run roughshod over anyone, and Crooked Charley, a gambler, to do the same. Crooked Charley is threatening to evict Old Pierre, who along with his daughters - the current being Nell - have operated the Five-Ace Tavern for years, the eviction due to back rent owed. Things in Peaceful Vale have the potential to change with the arrival of the unknown solider of fortune, Billy Blazes, Esq. In addition to challenging anyone who opposes him, Billy ends up focusing on saving Nell, the two who fall for each other.",
    "Director": "Hal Roach",
    "Writer": "Hal Roach, H.M. Walker",
    "Actors": "Harold Lloyd, 'Snub' Pollard, Bebe Daniels",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010311",
    "tt0010656",
    "tt0009887",
    "tt0008860",
    "tt0009973",
    "tt0009986",
    "tt0010006",
    "tt0010382",
    "tt0010508",
    "tt0010522",
    "tt0010930",
    "tt0010732"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}