{
  "imdbId": "tt0027180",
  "title": "Wagon Trail",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kSbKiWKx9bM",
      "id": "kSbKiWKx9bM",
      "title": "Wagon Trail (1935) HARRY CAREY",
      "description": "Stars: Harry Carey, Gertrude Messinger, Edward Norris \nDirector: Harry L. Fraser\n\n Holding Clay Hartley's IOU's, Collins forces him to ride with his gang as they rob the stage. Clay is the only one caught and refusing to talk, is sentenced to hang because one of the Deputies was killed. But Collins knows he will eventually speak and makes plans to beak him out and kill him. But the Sheriff, Clay's father, luckily overhears the plans and hides Clay out while he goes after Collins.\n\nMovie Class by PizzaFLIX: Harry Carey (1878–1947) began acting in 1910 to become one of Silent Film's earliest superstars and successfully transitioned into \"talkies.\" He made 260 films and is best remembered as a cowboy. So much so, John Ford and John Wayne closed their iconic western THE SEARCHERS (1956) with a visual homage to Harry Carey.",
      "addedAt": "2025-12-26T23:51:50.710Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/kSbKiWKx9bM/maxresdefault.webp",
      "duration": 3315,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YK2vFd3zu4c",
      "id": "YK2vFd3zu4c",
      "title": "Wagon Trail (1935) with Harry Carey | American western film Directed by Harry L. Fraser",
      "description": "Clay Hartley Jr., the son of the town's sheriff, falls into gambling debts owed to his future father-in-law, Collins. To settle the debt, Collins forces him to act as a lookout during a stagecoach robbery that results in the death of a deputy sheriff, leaving Clay Jr. as the only one captured. Stripped of his badge, Sheriff Clay Hartley seizes the chance to deliver his own brand of justice.\n\nOriginal title: Wagon Trail (1935)\n\nColorized version: https://youtu.be/CT37hXv-O9I\n\n\nDirector & Writer: Harry L. Fraser\nActors: Harry Carey, Gertrude Messinger, Edward Norris\nGenres: Western\nRelease date: April 9, 1935\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:31:34.097Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/YK2vFd3zu4c/maxresdefault.webp?v=67eb9e3e",
      "duration": 3289,
      "language": "en",
      "year": 1935,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "55 min",
    "imdbRating": 5.8,
    "imdbVotes": 81,
    "Genre": "Western",
    "Plot": "The son of Sheriff Clay Hartley, of the frontier town Elder, has gotten into bad company and hangs out with an outlaw gang in which, Collins, owner of the Golden Rule Saloon, is the secret head. Sheriff Hartley suspects him, but has been unable to gather the needed evidence. Collins instructs his gang, including young Hartley, to hold up the stagecoach on its return trip from Missionary Flats and take the cargo of gold dust it is carrying. Sheriff Hartley is notified of the planned holdup by one of his deputies who has been spying on Collins, and organizes a posse. A deputy-sheriff is killed in the ensuing gunfight between the lawmen and the outlaws, but Deputy Joe Larkin, pursues and captures Clay Hartley Jr. The latter is quickly tried and convicted of the killing of the deputy, and sentenced to be hung. Sheriff Hartley has only a few hours to prove his son was not the killer. He enlists the aid of Collins' step-daughter, Joan, who is in love with Hartley's son.",
    "Director": "Harry L. Fraser",
    "Writer": "Harry L. Fraser",
    "Actors": "Harry Carey, Gertrude Messinger, Edward Norris",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028550",
    "tt0027217",
    "tt0026608",
    "tt0028927",
    "tt0028213",
    "tt0026857",
    "tt0027712",
    "tt0024805",
    "tt0131072",
    "tt0027434",
    "tt0026392",
    "tt0022819"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:32:00.561Z"
}