{
  "movieId": "tt0015863",
  "title": "Go West",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/go-west-keaton-1925-high-quality-1080p-s-2o-ez-13c-i-9-m",
      "id": "go-west-keaton-1925-high-quality-1080p-s-2o-ez-13c-i-9-m",
      "title": "Go West (1925) HD with Score",
      "description": "Friendless travels west to try to make his fortune. Once there, he tries his hand at bronco-busting, cattle wrangling and dairy farming, eventually forming a bond with a cow named \"Brown Eyes.\" ",
      "fileSize": 3500773046,
      "addedAt": "2026-01-07T00:08:32.018Z",
      "thumbnail": "https://archive.org/services/img/go-west-keaton-1925-high-quality-1080p-s-2o-ez-13c-i-9-m",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 2386
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-movie_202111",
      "id": "my-movie_202111",
      "title": "\"Go West\" (1925) starring Buster Keaton",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"Go West\" is a comedy Western starring Buster Keaton.     Directed by               Buster Keaton Produced by             Buster Keaton Productions, Incorporated Scenario by                Raymond Cannon from a story by Buster Keaton and Lex Neal       Starring                     Buster Keaton, Howard Truesdale, Kathleen Myers, Ray Thompson, Brown Eyes the cow Cinematography        Elgin Lessley and Bert Haines Distributed by           Metro-Goldwyn Distributing Corporation Release date               November 1, 1925 Running time             68 min. Country                      United States Language                    Silent film, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"",
      "fileSize": 1273488767,
      "addedAt": "2026-01-07T00:09:54.333Z",
      "thumbnail": "https://archive.org/services/img/my-movie_202111",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 3643
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BoQXBjt6IHY",
      "id": "BoQXBjt6IHY",
      "title": "Go West (1925) | Buster Keaton Silent Comedy Western | Colorized Public Domain Classic",
      "description": "Go West (1925) is a silent comedy directed by and starring the legendary Buster Keaton. Produced and distributed by Metro-Goldwyn-Mayer, this film represents one of Keaton’s most creative experiments, blending his trademark deadpan comedy with Western themes and frontier imagery. Known for his physical stunts, precision timing, and unshakable expression, Keaton uses Go West to parody both the American West and the culture of rugged individualism.\n\nThis restored and colorized public domain edition brings the dusty cattle ranches, open plains, and iconic Keaton gags into vivid detail. It is designed for modern audiences, especially older viewers in the United States and Europe, who can appreciate the artistry of Keaton while enjoying the film in a visually engaging format on TV and streaming platforms.\n\nPlot Summary:\nThe story follows a lonely drifter known only as Friendless (Buster Keaton), who leaves his small-town life behind and heads west in search of opportunity. Lacking cowboy skills, charm, or toughness, Friendless finds himself out of place on a cattle ranch. Despite his struggles, he befriends a gentle cow named Brown Eyes, forming an unlikely bond.\n\nAs Friendless navigates the challenges of ranch life, his compassion for Brown Eyes sets him apart from the rough cowboys around him. When the ranch’s herd must be transported through Los Angeles, Friendless ends up leading a cattle stampede through the city streets in one of the film’s most famous comedic sequences. Ultimately, Keaton transforms from a hapless outsider into an unlikely hero, proving that kindness can triumph over brute force.\n\nCast and Crew:\n• Director: Buster Keaton\n• Producer: Joseph M. Schenck\n• Writers: Lex Neal, Byron Morgan\n• Cinematography: Dev Jennings, Elgin Lessley\nStarring:\n• Buster Keaton as Friendless\n• Howard Truesdale as the Ranch Owner\n• Kathleen Myers as the Ranch Owner’s Daughter\n• Brown Eyes the Cow (uncredited but central to the story)\n\nFilm Significance:\nGo West is one of Buster Keaton’s most original films, mixing slapstick comedy with tenderness and satire. Unlike his more famous works The General or Sherlock Jr., this film highlights Keaton’s ability to create humor not just through stunts but through character relationships. His friendship with the cow Brown Eyes remains one of silent cinema’s most unusual and touching bonds.\n\nThe movie also represents Hollywood’s fascination with Westerns in the 1920s. By placing a clumsy outsider in this genre, Keaton lampooned Western hero stereotypes while exploring themes of loneliness, kindness, and survival.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, meaning it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Go West remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations while respecting the integrity of the original silent film.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white in 1925, Go West was visually striking but limited by the technology of its time. This colorized edition highlights the dusty landscapes, ranch settings, and urban chaos of the cattle stampede, making the action clearer for modern viewers. For audiences aged 55–64 in the United States and Europe, the restoration offers nostalgia with sharper detail. For newer generations, it serves as a vibrant entry point into the artistry of Buster Keaton.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including Buster Keaton comedies, Western parodies, and silent-era treasures that shaped film history.\n\n#GoWest1925 #BusterKeaton #SilentComedy #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentWestern #ClassicMovies #FilmRestoration #SlapstickComedy",
      "addedAt": "2025-12-24T00:49:01.683Z",
      "thumbnail": "https://i.ytimg.com/vi/BoQXBjt6IHY/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBdKE4wDw==&rs=AOn4CLDJpCrfhGcQbivGkdMIQIYNU-FbcA",
      "duration": 4064,
      "language": "en",
      "year": 1925,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-go-west",
      "id": "silent-go-west",
      "title": "Go West",
      "fileSize": 4931399686,
      "addedAt": "2026-01-07T00:10:59.118Z",
      "thumbnail": "https://archive.org/services/img/silent-go-west",
      "language": "English",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 4770
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "69 min",
    "imdbRating": 7.1,
    "imdbVotes": 5301,
    "Genre": "Comedy, Western",
    "Plot": "A young man who doesn't find a job in his small hometown, tries his luck in New York, but is overwelmed by the life of the city, so decides to try his luck somewhere else after a only a few minutes in New York. He falls off a train near a ranch, where he tries his luck as a cowbowy, being in his own way very sucessful. But he shows what he can do when the farm has to bring a 100 head of cattle to the slaughterhouses of Los Angeles to avoid going bankrupt, against the will of his neighbour who wants a better price. After a shoot-out with the neighbour's men he's the only person on a Los Angeles bound train with 1000 cows....",
    "Director": "Buster Keaton",
    "Writer": "Buster Keaton, Lex Neal, Raymond Cannon",
    "Actors": "Buster Keaton, Howard Truesdale, Kathleen Myers",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0016332",
    "tt0015324",
    "tt0016630",
    "tt0012543",
    "tt0013158",
    "tt0015477",
    "tt0014358",
    "tt0009466",
    "tt0018396",
    "tt0124857",
    "tt0017925",
    "tt0015163"
  ],
  "collections": [
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    },
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.118Z"
}