{
  "movieId": "tt0004936",
  "title": "The Bank",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1915bank",
      "id": "1915bank",
      "title": "Charlie Chaplin's \"The Bank\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems \"The Bank\" is one of Charlie Chaplin's Essanay short comedies featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin      Starring                     Charlie Chaplin, Edna Purviance, Billy Armstrong, Carl Stockdale, Charles Insley Cinematography        Harry Ensign Distributed by           General Film Company Release date               August, 1915 Running time             25 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 550811066,
      "addedAt": "2026-01-07T00:06:00.051Z",
      "thumbnail": "https://archive.org/services/img/1915bank",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 18139
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-bank",
      "id": "silent-the-bank",
      "title": "The Bank",
      "fileSize": 5011459777,
      "addedAt": "2026-01-07T00:11:15.974Z",
      "thumbnail": "https://archive.org/services/img/silent-the-bank",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 559
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-bank-1915",
      "id": "the-bank-1915",
      "title": "The Bank (1915)",
      "description": "The Bank is a silent slapstick comedy. It was Charlie Chaplin’s tenth film for Essanay Films. Released in 1915, it is a slight departure from the tramp character, as Charlie Chaplin plays a janitor in a bank. Edna Purviance plays the secretary on whom Charlie has a crush and dreams that she has fallen in love with him. Filmed at the Majestic Studio in Los Angeles. There doesn’t appear to be any evidence that this film was received any differently from the bulk of Chaplin’s early work, but today this film is often considered one of his best efforts during his Essanay period. Watch on RetroFlix.org:  https://retroflix.org/the-bank-1915/",
      "fileSize": 744478966,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-bank-1915",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 379
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-bank-1915-directed-by-charlie-chaplin",
      "id": "the-bank-1915-directed-by-charlie-chaplin",
      "title": "The Bank (1915) Directed By Charlie Chaplin",
      "description": "The Bank Theatrical poster to The Bank Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Charles Inslee Carl Stockdale Edna Purviance Leo White Cinematography Harry Ensign Edited by Charlie Chaplin Music by Robert Israel (Kino video release) Distributed by Essanay Studios General Film Company Release date August 9, 1915 Running time 33 minutes Country United States Languages Silent film English (original intertitles) The Bank is a silent slapstick comedy. [ 1 ] It was Charlie Chaplin 's tenth film for Essanay Films . Released in 1915, it is a slight departure from the Tramp character, as Charlie Chaplin plays a janitor in a bank. Edna Purviance plays the secretary on whom Charlie has a crush and dreams that she has fallen in love with him. Filmed at the Majestic Studio in Los Angeles . There doesn't appear to be any evidence that this film was received any differently from the bulk of Chaplin's early work, but today this film is often considered one of his best efforts during his Essanay period. [ citation needed ] Synopsis Charlie, feeling very important, enters the bank where he works. He descends to the vault and works its combination with great panache and opens the door. Charlie hangs his coat inside the vault and brings out his mop and bucket, signifying he is the bank's janitor. He causes typical havoc with his mop and then with his broom. Charlie sweeps one room and the other janitor sweeps the adjacent room. Instead of cleaning, they just sweep the rubbish to and fro from room to room, so it becomes the other's task. Charlie discovers a package containing a tie with a note attached to it, written by the bank's typist. It is addressed \"To Charles with love from Edna.\" Charlie jumps to the wrong conclusion that Edna is in love with him, not realizing the package is intended for another Charles — the cashier. Charlie gets a bunch of flowers and places them lovingly on Edna's desk with a note \"love from Charlie\". When Edna is told by Charles the cashier that they are not from him but from Charlie the janitor, she coldly tosses them into the wastebasket. Charlie finds them there and is heartbroken. Charlie then has a dream in which he heroically thwarts a bank robbery, rescuing Edna in the process. He turns to kiss the now-adoring Edna — but then he wakes up. Charlie is kissing his mop — while Edna is kissing her cashier boyfriend. Reception In an August 1915 review for Variety , journalist Sime Silverman called it \"the most legitimate comedy film Chaplin has played in many a long day, perhaps since he's been in pictures\". [ 2 ] Cast Charlie Chaplin — Charlie, a Janitor Edna Purviance — Edna, a Secretary Carl Stockdale — Charles, a Cashier Charles Inslee — President of the bank Leo White — Clerk Billy Armstrong — Another Janitor Fred Goodwins — Bald Cashier/Bank Robber with Derby John Rand — Bank Robber and salesman Lloyd Bacon — Bank Robber Frank Coleman — Bank Robber Paddy McGuire — Cashier in White Coat Wesley Ruggles — Bank Customer Carrie Clark Ward — Bank Customer Lawrence A. Bowes — Bond Salesman References 1 Mitchell, Glenn (1997). The Chaplin encyclopedia . London: Batsford. pp. 20–22. ISBN   978-0-7134-7938-6 . 2 Silverman, Sime (August 1915). \"CHAPLIN IN \"THE BANK\" \" . Variety . p. 21.",
      "fileSize": 752626556,
      "addedAt": "2026-01-07T00:11:46.532Z",
      "thumbnail": "https://archive.org/services/img/the-bank-1915-directed-by-charlie-chaplin",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 157
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "25 min",
    "imdbRating": 6.6,
    "imdbVotes": 2325,
    "Genre": "Comedy, Short",
    "Plot": "Charlie does everything but an efficient job as janitor. Edna buys her fiance, the cashier, a birthday present. Charlie thinks \"To Charles with Love\" is for him. He presents her a rose which she throws in the garbage. Depressed, Charlie dreams of a bank robbery and his heroic role in saving the manager and Edna ... but it is only a dream.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Edna Purviance, Billy Armstrong",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005571",
    "tt0006309",
    "tt0005044",
    "tt0005489",
    "tt0005542",
    "tt0006313",
    "tt0006177",
    "tt0006032",
    "tt0006414",
    "tt0007194",
    "tt0006684",
    "tt0006548"
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.532Z"
}