{
  "movieId": "tt0020358",
  "title": "Sally",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sally-1929",
      "id": "sally-1929",
      "title": "Sally (1929)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. This romance comedy was one of the earliest color films by Warner Bros. Unfortunately, the color version has been lost except for a small segment. Still, the film was nominated for an Oscar for best art direction, and was a massive box office success, so it had positives beyond just color to sustain it. ",
      "fileSize": 2388146607,
      "addedAt": "2026-01-07T00:10:40.951Z",
      "thumbnail": "https://archive.org/services/img/sally-1929",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 88
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "103 min",
    "imdbRating": 6.1,
    "imdbVotes": 424,
    "Genre": "Musical",
    "Plot": "Sally was an orphan who got her name from the telephone exchange where she was abandoned as a baby. In the orphanage, she discovered the joy of dancing and has been practicing since. Working as a waitress, she goes from job to job until she finds a job that also allows her to dance. At the restaurant, she meets Blair, and they both fall for each other, but Blair is engaged to Marcia. Sally is hired to impersonate a famous Russian dancer named Noskerova, but at that engagement, she is found to be a phony and that Blair is engaged. Undaunted, she proceeds with her life and has her show on Broadway, but she still thinks of Blair.",
    "Director": "John Francis Dillon",
    "Writer": "Guy Bolton, Waldemar Young, P.G. Wodehouse",
    "Actors": "Marilyn Miller, Alexander Gray, Joe E. Brown",
    "Language": "English, French",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    "tt0020238",
    "tt0022149",
    "tt0022242",
    "tt0019644",
    "tt0019933",
    "tt0122388",
    "tt0019946",
    "tt0019959",
    "tt0020034",
    "tt0020049",
    "tt0122580",
    "tt0020112"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.951Z"
}