{
  "movieId": "tt0017886",
  "title": "The First Auto",
  "year": 1927,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Pt9XiXhnW0k",
      "id": "Pt9XiXhnW0k",
      "title": "The First Auto (1927) BARNEY OLDFIELD🍕 CLASSIC RACE CAR MOVIE",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Charles Emmett Mack, Russell Simpson, Patsy Ruth Miller, Barney Oldfield\nDirector: Roy Del Ruth\nWriter: Darryl F. Zanuck\n🍕Presented with the original synchronized orchestral score and sound effects🍕\nExperience the thrill of early cinema with The First Auto, a groundbreaking transitional sound film featuring a synchronized score and sound effects—but no spoken dialog. Directed by Roy Del Ruth and written by future 20th Century-Fox head honcho Darryl F. Zanuck, this movie is a must-watch for fans of silent films, vintage cars, and classic racing car movies. Legendary race car driver Barney Oldfield takes on a pivotal role, adding authenticity and excitement to this cinematic treasure!\n\nStarring Charles Emmett Mack, Patsy Ruth Miller, Russell Simpson, and Frank Campeau, The First Auto tells the heartfelt story of a small-town father and son. The father resists the rise of the horseless carriage, while his son embraces the innovation of the automobile age. Featuring stunning sequences of early racing cars, this film vividly captures the excitement and skepticism of a world undergoing monumental change.\n\nSilent film enthusiasts will appreciate the synchronized score that brings this cinematic milestone to life. Gearheads and vintage car buffs will relish rare footage of early automobiles and the timeless allure of Barney Oldfield’s racing prowess.\n\nRediscover this piece of automotive and film history on PizzaFLIX, your go-to destination for classic cinema! Don’t forget to like, comment, and subscribe for more treasures from the silent era.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#SilentFilms #TransitionalSoundFilms #ClassicMovies #BarneyOldfield #VintageCars #ClassicRacingMovies #PizzaFLIX",
      "addedAt": "2025-12-24T01:05:10.801Z",
      "thumbnail": "https://i.ytimg.com/vi/Pt9XiXhnW0k/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAZASdLfvBviWgzaHForCMK1nyyfw",
      "duration": 4643,
      "language": "en",
      "year": 1927,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-first-auto-1927-dvd-mkv",
      "id": "the-first-auto-1927-dvd-mkv",
      "title": "The First Auto (1927) DVD MKV",
      "description": "DVD remux of the 1927 Warner Bros. film \"The First Auto.\" IMDb TMDB Wikipedia The First Auto is a 1927 American synchronized sound drama film directed by Roy Del Ruth about the transition from horses to cars and the rift it causes in one family. While the film has no audible dialog, it was released with a synchronized musical score with sound effects, some spoken words, cheering, and laughter, using the Vitaphone sound-on-disc process. The film stars Charles Emmett Mack and Patsy Ruth Miller, with Barney Oldfield having a guest role in the movie. As of January 1, 2023, the film is in the public domain.",
      "fileSize": 4381017099,
      "addedAt": "2026-01-07T00:11:57.687Z",
      "thumbnail": "https://archive.org/services/img/the-first-auto-1927-dvd-mkv",
      "language": "eng",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 359
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-first-auto-1927_202507",
      "id": "the-first-auto-1927_202507",
      "title": "The First Auto (1927)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. This automotive drama follows a young man who tries to get his father to move on with the times. His father, a horse racer, doesn't believe that automobiles are worth investing in. This was one of the last roles played by Charles Emmett Mack, who unfortunately died in a car accident not long after the release of this picture.",
      "fileSize": 4381008487,
      "addedAt": "2026-01-07T00:11:57.687Z",
      "thumbnail": "https://archive.org/services/img/the-first-auto-1927_202507",
      "language": "eng",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 55
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-first-auto_1927",
      "id": "the-first-auto_1927",
      "title": "The First Auto",
      "fileSize": 2504803795,
      "addedAt": "2026-01-07T00:11:57.687Z",
      "thumbnail": "https://archive.org/services/img/the-first-auto_1927",
      "language": "English",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 630
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "75 min",
    "imdbRating": 6.2,
    "imdbVotes": 270,
    "Genre": "Comedy, Drama",
    "Plot": "Hank owns horses, stables horses and races horses. He favorite horse always wins and he is prosperous and will known. His son (Bob), however dreams only of the future of the horseless carriage and not of the horse. This causes problems between Hank and Bob. As the people in the town convert from horses to autos, Hank detests those who switch - so he looses his friends, his son Bob and finally his livery business. Bob leaves his flame Rose and goes to Detroit, gets involved with the auto industry and does very well. He does not forget Hank and promises to see him again, but Hank's hatred of the auto may cause the death of Bob.",
    "Director": "Roy Del Ruth",
    "Writer": "Darryl F. Zanuck, Anthony Coldeway, Jack Jarmuth",
    "Actors": "Barney Oldfield, Patsy Ruth Miller, Russell Simpson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028142",
    "tt0017765",
    "tt0019339",
    "tt0017750",
    "tt0018297",
    "tt0018051",
    "tt0018530",
    "tt0018505",
    "tt0014992",
    "tt0019421",
    "tt0017457",
    "tt0018742"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.687Z"
}