{
  "movieId": "tt0062384",
  "title": "Torture Garden",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/torture.-garden.-1967",
      "id": "torture.-garden.-1967",
      "title": "Torture Garden (1967)",
      "description": "Torture Garden is a 1967 horror anthology film directed by Freddie Francis and based on a short story by Robert Bloch , who also wrote the screenplay. The film features a unique blend of horror and fantasy, showcasing five different segments that explore themes of death, desire, and the macabre. The film is divided into five tales, with each story tied together through a framing device involving a mysterious carnival figure known as Dr. Diabolo (played by Burgess Meredith ). The tales include:  Terror Over Hollywood : A tale about a struggling screenwriter who makes a Faustian deal. The Last Will and Testament of Rosalind Leigh : A story concerning a woman who seeks revenge from beyond the grave. The House of the Seven Ramps : Focused on a sinister house and its secrets. The Man Who Was Death : A dark exploration of a man who believes he is the executioner. The Sorcerer's Apprentice : A twist on the classic story involving a novice magician.  The film explores themes such as guilt , revenge , and the supernatural , making it a notable entry in the horror anthology genre of its time. The unique visual style, characterized by vibrant colors and surreal imagery, enhances the storytelling.",
      "fileSize": 1798488874,
      "addedAt": "2026-01-07T00:12:44.285Z",
      "thumbnail": "https://archive.org/services/img/torture.-garden.-1967",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 246
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "93 min",
    "imdbRating": 6.1,
    "imdbVotes": 3531,
    "Genre": "Fantasy, Horror",
    "Plot": "A special sideshow torture exhibit has the power, according to showman Dr. Diabolo (Burgess Meredith), to warn people of evil in their futures. One by one, skeptical customers stand before the Fate Atropos to be shown the greed and violence they're hiding behind their respectable façades.",
    "Director": "Freddie Francis",
    "Writer": "Robert Bloch",
    "Actors": "Jack Palance, Burgess Meredith, Beverly Adams",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0061557",
    "tt0062453",
    "tt2481878",
    "tt0058073",
    "tt0057401",
    "tt0065762",
    "tt0059920",
    "tt0069341",
    "tt0062360",
    "tt0058279",
    "tt0058307",
    "tt0065854"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}