{
  "imdbId": "tt0063722",
  "title": "Turismo de carretera",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/turismo-de-carretera-1968",
      "id": "turismo-de-carretera-1968",
      "title": "Turismo De Carretera (1968)",
      "description": "Turismo de carretera  es una película de  Argentina  filmada en colores dirigida por  Rodolfo Kuhn  sobre su propio guion escrito en colaboración con  Francisco Urondo  y  Héctor Grossi  que se estrenó el 27 de junio de 1968 y que tuvo como protagonistas a  Héctor Pellegrini ,  María Vaner ,  Duilio Marzio  y  Dora Baret .  Juan Manuel Bordeu  colaboró en el filme como asesor deportivo. El filme también se exhibió con el título de  Huracanes en la carretera . Fue filmada parcialmente en  Balcarce  y  Arrecifes . (Wikipedia) Sinopsis Un joven mecánico se aventura en las carreras de motos, pero luego decide competir en disciplinas de automovilismo. (IMDB) Reparto Héctor Pellegrini María Vaner Duilio Marzio Dora Baret Tito Alonso Jorge Rivera López Nora Cullen María Rosa Gallo Oscar Viale Marcos Zucker Luis Brandoni Diego Puente Diego Varzi María del Carmen Valenzuela Oscar Alfredo Gálvez Juan Manuel Bordeu Juan Manuel Fangio Carlos Menditéguy Eduardo Casá Carmelo Galbato Carlos Alberto Pairetti Luis Politti",
      "fileSize": 1709637399,
      "addedAt": "2026-01-07T00:12:55.130Z",
      "thumbnail": "https://archive.org/services/img/turismo-de-carretera-1968",
      "language": "spa",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 74
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "96 min",
    "imdbRating": 6.1,
    "imdbVotes": 11,
    "Genre": "Drama",
    "Plot": "\"Turismo de carretera\" (TC) denotes a class of auto races very popular in Argentina. From 1937 to 1960 ordinary touring cars were used (mostly Fords and Chevrolets). Motors were souped-up, suspension reinforced, inessential weight (such as mudguards) removed, and cars were raced at high speeds over ordinary roads temporarily closed to traffic. Most of these were dirt roads indifferently maintained, and the sport was hair-raising dangerous; accidents and casualties were frequent. Most Argentine drivers made their debut in TC, among them the great Juan Manuel Fangio, who later went on to win the Formula 1 Championship five times. After 1960 the sport became safer, many races were held in dedicated tracks and local manufacturers produced especially factory modified automobiles adapted to racing.Director Rodolfo Kuhn was one of the stars of the renaissance of the Argentine movie industry between 1955 and 1975. This movie, however is strictly entertainment. The script is naive (interesting ending, though) but the racing sequences are exciting. As a bonus, midway through the movie we have interviews with the greats of TC: Fangio, Oscar Gálvez, Juan Manuel Bordeu et al. The interviewer tries to discover what made them tick; the answers, of course, are ambiguous.",
    "Director": "Rodolfo Kuhn",
    "Writer": "Héctor Grossi, Rodolfo Kuhn, Francisco Urondo",
    "Actors": "María Vaner, Tito Alonso, Dora Baret",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0189583",
    "tt0188011",
    "tt0189606",
    "tt0188258",
    "tt0063518",
    "tt0348451",
    "tt0060265",
    "tt0062673",
    "tt0062688",
    "tt0064130",
    "tt0062819",
    "tt0336266"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.130Z"
}