{
  "imdbId": "tt0055885",
  "title": "Damon and Pythias",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DamonandPythias1962",
      "id": "DamonandPythias1962",
      "title": "Damon and Pythias",
      "description": "Spaghetti-sandal version of the classic tales, dubbed into English. Pythias, a liberal Athenian who believes all men are brothers, is condemned to death by Dionysus, the tyrant of Syracuse, who finds this view dangerous. However, Dionysus allows Pythias to return to Athens to visit his ailing wife with the understanding he will then come back to face his punishment. Damon, a friend of Pythias, volunteers to be a hostage to guarantee Pythias's return. Dionysius doesn't expect Pythias to keep his end of the bargain, thus exposing the falsity of his beliefs, but Pythias proves to be a man of his word. http://www.imdb.com/title/tt0055885/",
      "fileSize": 1870323196,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/DamonandPythias1962",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 43669
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "99 min",
    "imdbRating": 5,
    "imdbVotes": 293,
    "Genre": "Adventure",
    "Plot": "Pythias, a liberal Athenian who believes all men are brothers, is condemned to death by Dionysus, the tyrant of Syracuse, who finds this view dangerous. However, Dionysus allows Pythias to return to Athens to visit his ailing wife with the understanding he will then come back to face his punishment. Damon, a friend of Pythias, volunteers to be a hostage to guarantee Pythias's return. Dionysius doesn't expect Pythias to keep his end of the bargain, thus exposing the falsity of his beliefs.",
    "Director": "Curtis Bernhardt",
    "Writer": "Samuel Marx, Franco Riganti, Paola Ojetti",
    "Actors": "Guy Williams, Don Burnett, Ilaria Occhini",
    "Language": "English",
    "Country": "Italy, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0057105",
    "tt0055946",
    "tt0056026",
    "tt0056211",
    "tt0056063",
    "tt0056085",
    "tt0056277",
    "tt0056112",
    "tt0056352",
    "tt2461750",
    "tt0056556",
    "tt0055719"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.368Z"
}