{
  "imdbId": "tt0041182",
  "title": "Black Magic",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bm86fgh443",
      "id": "bm86fgh443",
      "title": "Black Magic",
      "description": "Title: Black Magic Summary: Hypnotist uses his powers for revenge against King Louis XV's court. Directed by: Gregory Ratoff, Orson Welles Actors: Production Company: Edward Small Productions Release Date: 19 August 1949 (USA) Aspect Ratio: 1.37 : 1 Novelist Alexander Dumas tells his writer-son of Joseph Balsamo, a gypsy boy in southern France who was embittered because his parents were wrongfully hanged and he himself was tortured by the order of Viscount de Montagne. Years later, the man, a carnival charlatan, attracts the attention of Dr. Mesmer, a pioneer in the study of hypnotism. Balsamo rejects Mesmer's plea that he use his power for healing and, instead, decides to use it to seek wealth and fame. He changes his name to Count Cagliostro, and achieves fame throughout Europe by mixing hypnotism with mysticism and showmanship. He is called to cure a girl, Lorenza, held by De Montagne, because she resembles Marie Antoinette, wife of the heir to the throne of France. Cagliostro decides to join De Montagne and Madame du Barry in a plot to seize the power by discrediting the future Queen. Cagliostro achieves his revenge on De Montagne by persuading him to hang himself. He makes Lorenza marry him but can never make her love him. ...",
      "fileSize": 754532975,
      "addedAt": "2026-01-07T00:07:38.719Z",
      "thumbnail": "https://archive.org/services/img/bm86fgh443",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 3465
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "105 min",
    "imdbRating": 6.4,
    "imdbVotes": 1583,
    "Genre": "Drama, Mystery, Romance",
    "Plot": "Novelist Alexander Dumas tells his writer-son of Joseph Balsamo, a gypsy boy in southern France who was embittered because his parents were wrongfully hanged and he himself was tortured by the order of Viscount de Montagne. Years later, the man, a carnival charlatan, attracts the attention of Dr. Mesmer, a pioneer in the study of hypnotism. Balsamo rejects Mesmer's plea that he use his power for healing and, instead, decides to use it to seek wealth and fame. He changes his name to Count Cagliostro, and achieves fame throughout Europe by mixing hypnotism with mysticism and showmanship. He is called to cure a girl, Lorenza, held by De Montagne, because she resembles Marie Antoinette, wife of the heir to the throne of France. Cagliostro decides to join De Montagne and Madame du Barry in a plot to seize the power by discrediting the future Queen. Cagliostro achieves his revenge on De Montagne by persuading him to hang himself. He makes Lorenza marry him but can never make her love him. Her love is for Gilbert de Rezel, the captain of Marie Antoinette's guard. In a dramatic court scene, Cagliostro's power of hypnotism is turned against him by Dr. Mesmer and he is seen as a madman. His faithful gypsy friends, Gitano and Zoraida, try to help him escape but he is killed by de Rezel in a roof-top duel.",
    "Director": "Gregory Ratoff, Orson Welles",
    "Writer": "Alexandre Dumas, Charles Bennett, Richard Schayer",
    "Actors": "Orson Welles, Nancy Guild, Akim Tamiroff",
    "Language": "English",
    "Country": "Italy, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041616",
    "tt0043409",
    "tt0041959",
    "tt0041767",
    "tt0044937",
    "tt0038492",
    "tt0029855",
    "tt0040071",
    "tt0022989",
    "tt0032976",
    "tt0030727",
    "tt0041886"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.719Z"
}