{
  "imdbId": "tt0016585",
  "title": "Alice in the Wooly West",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/alice-in-the-wooly-west-1926",
      "id": "alice-in-the-wooly-west-1926",
      "title": "Alice in the Wooly West (1926)",
      "description": "Julius is out for a ride on his horse; he does some rope tricks. Some bad guys rob a stagecoach; one of the passengers is Alice, who finds herself stuck between the head bad guy and a cactus. Julius rides in and saves most of the passengers, but the bad guy rides off with Alice. After a short chase, he ends up battling Julius on top of a tall rock outcropping. A piece eventually breaks off, sending both of them into a boulder field. They play hide-and-seek a while. Julius then takes off his fur and sends it out as a decoy while he sneaks up behind the bad guy with a club and beats him into the ground. Alice comes up to thank him; ashamed by his nakedness, he hides behind a rock and puts his fur back on, then accepts her thanks. Watch on RetroFlix:  https://retroflix.org/alice-in-the-wooly-west-1926/",
      "fileSize": 111991501,
      "addedAt": "2026-01-07T00:07:24.998Z",
      "thumbnail": "https://archive.org/services/img/alice-in-the-wooly-west-1926",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 60
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.3,
    "imdbVotes": 228,
    "Genre": "Comedy, Animation, Short",
    "Plot": "Julius is out for a ride on his horse; he does some rope tricks. Some bad guys rob a stagecoach; one of the passengers is Alice, who finds herself stuck between the head bad guy and a cactus. Julius rides in and saves most of the passengers, but the bad guy rides off with Alice. After a short chase, he ends up battling Julius on top of a tall rock outcropping. A piece eventually breaks off, sending both of them into a boulder field. They play hide-and-seek a while. Julius then takes off his fur and sends it out as a decoy while he sneaks up behind the bad guy with a club and beats him into the ground. Alice comes up to thank him; ashamed by his nakedness, he hides behind a rock and puts his fur back on, then accepts her thanks.",
    "Director": "Walt Disney",
    "Writer": "N/A",
    "Actors": "Margie Gay",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0016582",
    "tt0016586",
    "tt0016587",
    "tt0016590",
    "tt0016591",
    "tt0016593",
    "tt0015552",
    "tt0015555",
    "tt0015556",
    "tt0016583",
    "tt0015561",
    "tt0017610"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.998Z"
}