{
  "imdbId": "tt0026230",
  "title": "Condemned to Live",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CondemnedtoLive",
      "title": "Condemned to Live",
      "description": "After a series of unsolved murders, a man finds out that his mother was bitten by a vampire bat during her pregnancy, and he believes that he may be the vampire committing the murders.",
      "id": "CondemnedtoLive"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/condemned-to-live-1935",
      "title": "Condemned To Live",
      "description": "After a series of murders, a man finds out that his mother was bitten by a vampire bat during her pregnancy, and he believes that he may be the vampire committing the murders. Watch on RetroFlix:  https://retroflix.org/condemned-to-live-1935/",
      "id": "condemned-to-live-1935"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NMseJHK2_cw",
      "title": "Condemned to Live (1935) VAMPIRE",
      "description": "Stars: Ralph Morgan, Pedro de Cordoba, Maxine Doyle\n Director: Frank R. Strayer\n\n After a series of unsolved murders, a man finds out that his mother was bitten by a vampire bat during her pregnancy, and believes that he may be the vampire committing the murders!",
      "id": "NMseJHK2_cw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0IqyHids1CI",
      "title": "Condemned to Live (1935) Drama, Horror, Mystery Movie",
      "description": "FATE DAMNED HIM WITH A THOUSAND DEATHS!  After a series of unsolved murders, a man finds out that his mother was bitten by a vampire bat during her pregnancy, and he believes that he may be the vampire committing the murders.\n\nDirector: Frank R. Strayer\nWriter: Karen DeWolf \nStars: Ralph Morgan, Pedro de Cordoba, Maxine Doyle \nGenres: Classics, Drama, Horror, Mystery\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "0IqyHids1CI",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "67 min",
    "imdbRating": "4.8",
    "imdbVotes": "569",
    "Genre": "Drama, Horror, Mystery",
    "Plot": "A man, his pregnant wife, and a doctor are in Africa hiding from natives in a cave inhabited by vampire bats, one of which attacks the woman. Years later, in another land, several people have died in a mysterious manner, the blood drained from them and their bodies dragged to a cave by the seashore. Some of the townspeople believe that the culprit is a huge killer bat, and Professor Paul Kristan, the most respected man in the village and the fiancé of town belle Marguerite Mane, advises everyone to stay indoors at night. David, a young man who has known Marguerite since childhood and is in love with her, becomes convinced that the blood sucking fiend is not a bat, but a human preying on the suspicions of the townspeople. The villagers, however, refuse to listen to him just as Marguerite refuses to accept David's contention that she is not really in love with Paul. Paul summons his foster father, Dr. Anders Bizet, and tells him of the strange headaches he has been having and of the mysterious deaths that have plagued the village. Bizet quickly realizes that Marguerite idolizes, but is not truly in love with Paul and tells his foster son his impressions, prompting Paul to go to her house that evening for a talk. On the way, Paul turns into a vampire and, arriving at Marguerite's home, attacks her servant, Anna, but runs when her screams attract the attention of the entire household. When Bizet shows up on the scene, Zan, Paul's hunchback servant and confidant, provides an alibi for Paul, causing public suspicion to turn to Zan. Nonetheless, Paul realizes with despair that his headaches and swooning coincide with the timing of the murders, and he returns to Marguerite that night in order to set her free from their betrothal. In the meantime, Bizet confronts Zan and learns that he has been protecting Paul by disposing of the bodies of his victims in a pit in the cave. John Mane, Marguerite's father, leaves Paul alone with her, and when she sees that the light hurts his eyes, she turns out the candles one by one as Paul tells her of his illness and fears. When the clouds obscure the moon, temporarily plunging the sky into darkness, Paul is once again transformed into a fiend and attacks Marguerite. Zan breaks in just in time to deflect the vampire bite from her neck. The mob of angry villagers following Zan mistakenly sees his action as proof of his guilt, and chases him up the hill and into the cave. When Paul recovers from his transformation, Bizet tells him the truth: his mother was attacked by a giant African bat shortly before he was born, yet for forty years he had shown no sign of inheriting the dreaded vampire curse. Bizet, Paul and David then set off to save Zan from the crowd's wrath, and Paul makes David pledge to take care of Marguerite. Paul admits his guilt to the townspeople, who turn sympathetic, and then jumps off a cliff to his death. The devoted Zan, stricken with grief, follows him before the townspeople can stop him. Bizet breaks the bad news to Marguerite, and she leaves the cave in the care of David.",
    "Director": "Frank R. Strayer",
    "Writer": "Karen DeWolf",
    "Actors": "Ralph Morgan, Pedro de Cordoba, Maxine Doyle",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0024727",
      "title": "The Vampire Bat",
      "year": 1933,
      "imdbRating": "5.7",
      "imdbVotes": "3,180",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025169",
      "title": "The Ghost Walks",
      "year": 1934,
      "imdbRating": "5.6",
      "imdbVotes": "663",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026759",
      "title": "Phantom Ship",
      "year": 1935,
      "imdbRating": "5.4",
      "imdbVotes": "1,092",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023187",
      "title": "Manhattan Tower",
      "year": 1932,
      "imdbRating": "6.4",
      "imdbVotes": "257",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023236",
      "title": "The Monster Walks",
      "year": 1932,
      "imdbRating": "4.1",
      "imdbVotes": "1,126",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025064",
      "title": "Double Door",
      "year": 1934,
      "imdbRating": "6.8",
      "imdbVotes": "381",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025062",
      "title": "Two Monks",
      "year": 1934,
      "imdbRating": "7.0",
      "imdbVotes": "674",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027069",
      "title": "Symphony of Living",
      "year": 1935,
      "imdbRating": "6.6",
      "imdbVotes": "66",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0027504",
      "title": "Death from a Distance",
      "year": 1935,
      "imdbRating": "5.2",
      "imdbVotes": "208",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023583",
      "title": "The Thirteenth Guest",
      "year": 1932,
      "imdbRating": "5.7",
      "imdbVotes": "937",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025016",
      "title": "Cross Streets",
      "year": 1934,
      "imdbRating": "6.3",
      "imdbVotes": "79",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025302",
      "title": "In Love with Life",
      "year": 1934,
      "imdbRating": "5.2",
      "imdbVotes": "85",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:59:38.037Z"
}