{
  "imdbId": "tt0006177",
  "title": "The Tramp",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheTramp1915",
      "title": "Charlie Chaplin's \"The Tramp\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"The Tramp\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin      Starring                     Charlie Chaplin, Edna Purviance, Billy Armstrong, Leo White, Lloyd Bacon, Bud Jamison, Paddy McGuire Cinematography        Harry Ensign Distributed by           General Film Company Release date               April 22, 1915 Running time             26 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "TheTramp1915"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-tramp",
      "title": "The Tramp",
      "id": "silent-the-tramp"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-tramp-1915",
      "title": "The Tramp (1915)",
      "description": "The Tramp is Charlie Chaplin’s sixth film for Essanay Studios and was released in 1915. Directed by Chaplin, it was the fifth and last film made at Essanay’s Niles, California studio. The Tramp marked the beginning of The Tramp character most known today, even though Chaplin played the character in earlier films. This film marked the first departure from his more slapstick character in the earlier films, with a sad ending and showing he cared for others, rather than just himself. The film co-stars Edna Purviance as the farmer’s daughter and Ernest Van Pelt as Edna’s father. The outdoor scenes were filmed on location near Niles. Watch on RetroFlix.org:  https://retroflix.org/the-tramp-1915/",
      "id": "the-tramp-1915"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-tramp-1915-directed-by-charlie-chaplin",
      "title": "The Tramp (1915) Directed By Charlie Chaplin",
      "description": "The Tramp Theatrical release poster Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Edna Purviance Cinematography Harry Ensign Edited by Charlie Chaplin Distributed by Essanay Studios General Film Company Release date April 11, 1915 Running time 26 minutes Country United States Language Silent (English intertitles) The Tramp is the sixth film directed by Charlie Chaplin for Essanay Studios , released in 1915. It was Chaplin's fifth and final film produced at Essanay's Niles, California studio. [ 1 ] The Tramp marked the emergence of The Tramp character, a role Chaplin had played in earlier films but with a more emotional depth, showing a caring side towards others. The film also stars Edna Purviance as the farmer's daughter and Ernest Van Pelt as Edna's father. The outdoor scenes were filmed on location near Niles. Plot The poignant last scene in The Tramp was filmed in Niles Canyon . The film begins with the Tramp walking down the road, narrowly escaping two cars. Seeking refuge on a farm, he faces various humorous situations, including a hobo trading his sandwich for a brick. The Tramp comes to the aid of a farmer's daughter who is harassed by a hobo. As the story unfolds, the Tramp engages in farm work, gets involved in a tiff with a farmhand, and foils a planned robbery. However, upon realizing the farmer's daughter is already in a relationship, the Tramp decides to leave, leaving a heartfelt letter behind. The film ends with the Tramp walking away alone on the road he came in. Cast Charlie Chaplin as The Tramp Edna Purviance as Farmer's daughter Lloyd Bacon as Edna's fiancé/Second thief Leo White as First thief Bud Jamison as Third thief Ernest Van Pelt as Farmer, Edna's father Paddy McGuire as Farmhand Billy Armstrong as Minister Reception The Tramp faced cuts by city and state film censorship boards , including a scene of Chaplin sitting in a sewage drainage pipe after burning his posterior, cut by the Chicago Board of Censors . [ 2 ] References 1 \"Progressive Silent Film List: The Tramp \" . silentera.com . Retrieved 2010-11-02 . 2 \"Official Cut-Outs by the Chicago Board of Censors\" . Exhibitors Herald . 6 (14). New York City: Exhibitors Herald Company: 29. March 30, 1918.",
      "id": "the-tramp-1915-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/THETRAMP1915CharlieChaplinEdnaPurviance",
      "title": "THE TRAMP ( 1915) Charlie Chaplin, Edna Purviance",
      "description": "THE TRAMP (1915) Starring: Charlie Chaplin, Edna Purviance, Paddy McGuire, Leo White,  Ernest Van Pelt, Billy Armstrong, Lloyd Bacon, Bud Jamison Directed by Chaplin Essanay Film Company William Thomas Sherman, wts@gunjones.com, htttp://www.mn-hp.com",
      "id": "THETRAMP1915CharlieChaplinEdnaPurviance"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "26 min",
    "imdbRating": "6.9",
    "imdbVotes": "3,953",
    "Genre": "Short, Comedy",
    "Plot": "Charlie is a tramp on the road. A hobo manages to exchange Charlie's sandwich for a brick so Charlie must eat grass. The same hobo molests a farmer's daughter; Charlie comes to aid with the help of the brick. When two more hobos show up Charlie throws all three into a lake. The grateful girl takes Charlie home where he fails as a farmhand. He again helps drive off the hobos (who are now trying to break into the house). The girl's fiance arrives. Though a hero, Charlie, knowing he must go, writes a farewell note and leaves for the open road.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Billy Armstrong, Lloyd Bacon",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0005812",
      "title": "A Night in the Show",
      "year": 1915,
      "imdbRating": "6.4",
      "imdbVotes": "2,446",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004936",
      "title": "The Bank",
      "year": 1915,
      "imdbRating": "6.6",
      "imdbVotes": "2,325",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005571",
      "title": "A Jitney Elopement",
      "year": 1915,
      "imdbRating": "5.9",
      "imdbVotes": "1,464",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006309",
      "title": "A Woman",
      "year": 1915,
      "imdbRating": "6.4",
      "imdbVotes": "1,990",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005044",
      "title": "By the Sea",
      "year": 1915,
      "imdbRating": "5.7",
      "imdbVotes": "1,967",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005489",
      "title": "His New Job",
      "year": 1915,
      "imdbRating": "6.0",
      "imdbVotes": "2,089",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005542",
      "title": "In the Park",
      "year": 1915,
      "imdbRating": "5.6",
      "imdbVotes": "1,782",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006313",
      "title": "Work",
      "year": 1915,
      "imdbRating": "6.2",
      "imdbVotes": "1,891",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006032",
      "title": "Shanghaied",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "1,732",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006684",
      "title": "The Fireman",
      "year": 1916,
      "imdbRating": "6.5",
      "imdbVotes": "3,032",
      "language": "English, None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005810",
      "title": "A Night Out",
      "year": 1915,
      "imdbRating": "5.9",
      "imdbVotes": "1,915",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005074",
      "title": "The Champion",
      "year": 1915,
      "imdbRating": "6.7",
      "imdbVotes": "2,846",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T18:31:44.388Z"
}