{
  "imdbId": "tt0037008",
  "title": "Laura",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/laura-1944",
      "title": "Laura (1944)",
      "description": "LAURA ( Laura, 1944 - USA ) ( Filme Completo / Legendado em Português ) Data de Lançamento: 11 de Outubro de 1944 » SOBRE O FILME: Indicado em 5 categorias do Oscar, este filme que esbanja estilo toma rumos inesperados com a introdução de novos suspeitos, novas provas e revelações inesperadas. Um rico jornalista de língua afiada (Clifton Webb) envolve-se profundamente com a carreira de uma bela jovem chamada Laura (Gene Tierney). Mas tal envolvimento acaba levando à possessividade e pouco antes do casamento da moça com um playboy (Vincent Price), ela é encontrada assassinada. Impressionado por seu retrato e pelas descrições apaixonadas de seus admiradores, o detetive encarregado do caso (Dana Andrews) percebe que ele, também, está estranhamente influenciado pelos encantos de Laura. . Laura é considerado um verdadeiro clássico do cinema e um dos mais importantes exemplares do filme noir. Não é o primeiro e provavelmente também não seja o melhor, mas carrega diversas características do gênero e, ainda hoje, funciona maravilhosamente bem tanto como uma obra de mistério quanto como uma história sobre a obsessão e as relações humanas. Mais do que isso, em sua brilhante execução e técnica, Laura expõe a imensa capacidade de Otto Preminger como contador de histórias – não à toa, Laura foi o filme que o colocou definitivamente no panteão dos diretores hollywoodianos na metade do século. » » DIREÇÃO: Otto Preminger GÊNERO: Drama, Filme Noir ORIGEM: USA DURAÇÃO: 1h 28min » » ELENCO PRINCIPAL: Gene Tierney ... Laura Hunt Dana Andrews ... Det. Mark McPherson Clifton Webb ... Waldo Lydecker Vincent Price ... Shelby Carpenter Judith Anderson ... Ann Treadwell",
      "fileSize": 3620197104,
      "id": "laura-1944"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/laura-1944_202112",
      "title": "Laura ( 1944)",
      "description": "Título: Laura Título Original: Laura Ano: 1944 Direção: Otto Preminger, Rouben Mamoulian Roteiro: Vera Caspary, Jay Dratler, Samuel Hoffenstein, Elizabeth Reinhardt Gênero: Crime/Drama/Noir Nacionalidade: Estados Unidos Sinopse: Um detetive investiga o assassinato de Laura, a diretora de uma agência de propaganda que teve o rosto destruído por tiros de espingarda. Enquanto a investigação evolui, o detetive sente-se atraído pela vítima. Ao ir ao apartamento dela em busca de provas, vê um quadro com uma pintura de Laura pendurada na parede e, inesperadamente, Laura surge na sua frente viva e com o rosto sem nenhum ferimento. Prêmios: Venceu o Óscar de 1945 na categoria de melhor fotografia em preto-e-branco. Foi indicado para outras quatro categorias: melhor ator coadjuvante (Webb), melhor direção de arte em preto-e-branco, melhor diretor (Preminger) e melhor roteiro. Curiosidades: O filme é baseado no romance homônimo de Vera Caspary. Otto Preminger inicialmente era apenas o produtor do filme e Rouben Mamoulian era o diretor. Porém, Preminger decidiu demitir Mamoulian e assumir ele próprio a direção e também contratou um novo diretor de fotografia e descartou todas as seqüências do filme rodadas por Mamoulian. O produtor Darryl F. Zanuck era contrário à escalação de Clifton Webb devido à sua comentada homossexualidade, contudo a vontade de Otto Preminger prevalesceu sobre a do produtor e Webb foi mantido no elenco, sendo posteriormente indicado ao Oscar. Zanuck ficou descontente com o primeiro corte do filme de Preminger e insistiu que fosse dado um novo final. Mas após a primeira exibição da versão de Zanuck, o colunista Walter Winchell aproximou-se do chefe do estúdio e lhe disse: \"Eu não entendi o fim. Você tem que mudár isso.\" Zanuck acabou cedendo e permitiu que Preminger voltasse seu final original, dizendo-lhe: \"Este é o seu grande sucesso. Admito.\" O American Film Institute nomeou Laura como um dos 10 melhores filmes de mistério de todos os tempos e o colocou em várias outras listas (melhores filmes americanos, melhores romances, melhores citações). Também aparece na série \"Grandes Filmes\" de Roger Ebert. Em 1999, Laura foi selecionado para preservação no National Film Registry dos Estados Unidos pela Biblioteca do Congresso como sendo \"culturalmente, historicamente ou esteticamente significativo\". Elenco: Judith Anderson Sra. Ann Treadwell Dana Andrews Det. Lt. Mark McPherson Gene Tierney Laura Hunt Clifton Webb Waldo Lydecker Vincent Price Shelby Carpenter Dorothy Adams Bessie Clary",
      "fileSize": 885804502,
      "id": "laura-1944_202112"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/laura-legendado-pt",
      "title": "Laura (1944) de Otto Preminger, com iegendas em Português",
      "description": "Um dos mais famosos \"film noir\" dos anos 40, com Gene Tierney, Dana Andrews, Clifton Webb, Vincent Price. Direção de de Otto Preminger.",
      "fileSize": 333716486,
      "id": "laura-legendado-pt"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/laura_202003",
      "title": "Laura (1944) Dir: Otto Preminger, Starring Gene Tierney, Dana Andrews, Clifton Webb, Vincent Price, Judith Anderson.",
      "description": "Laura is a 1944 American film noir produced and directed by Otto Preminger. It stars Gene Tierney, Dana Andrews and Clifton Webb along with Vincent Price and Judith Anderson. The screenplay by Jay Dratler, Samuel Hoffenstein and Betty Reinhardt is based on the 1943 novel Laura by Vera Caspary. In 1999, Laura was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". The American Film Institute named it one of the 10 best mystery films of all time. Find out more about the movie here .",
      "fileSize": 545390135,
      "id": "laura_202003"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1944-laura-otto-preminger-vose",
      "title": "1944 - Laura - Otto Preminger - VOSE",
      "description": "For Academic / Educational Use Only",
      "fileSize": 1608816922,
      "id": "1944-laura-otto-preminger-vose"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "88 min",
    "imdbRating": 7.9,
    "imdbVotes": 52736,
    "Genre": "Drama, Film-Noir, Mystery",
    "Plot": "Detective Lieutenant Mark McPherson (Dana Andrews) investigates the killing of Laura Hunt (Gene Tierney), found dead on her apartment floor before the movie starts. McPherson builds a mental picture of the dead girl from the suspects he interviews. He is helped by the striking painting of the late lamented Laura hanging on her apartment wall. But who would have wanted to kill a girl with whom every man she met seemed to fall in love? To make matters worse, McPherson finds himself falling under her spell too. Then one night, halfway through his investigations, something seriously bizarre happens to make him re-think the whole case.",
    "Director": "Otto Preminger, Rouben Mamoulian",
    "Writer": "Vera Caspary, Jay Dratler, Samuel Hoffenstein",
    "Actors": "Gene Tierney, Dana Andrews, Clifton Webb",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 5 wins & 4 nominations total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0036886",
      "title": "Guest in the House",
      "year": 1944,
      "imdbRating": 6.2,
      "imdbVotes": 1087,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036745",
      "title": "Dark Waters",
      "year": 1944,
      "imdbRating": 6.5,
      "imdbVotes": 1118,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037693",
      "title": "The Fatal Witness",
      "year": 1945,
      "imdbRating": 5.9,
      "imdbVotes": 139,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038109",
      "title": "Spellbound",
      "year": 1945,
      "imdbRating": 7.5,
      "imdbVotes": 53812,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038346",
      "title": "Behind Green Lights",
      "year": 1946,
      "imdbRating": 6.4,
      "imdbVotes": 1068,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046791",
      "title": "Black Widow",
      "year": 1954,
      "imdbRating": 6.7,
      "imdbVotes": 3333,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033337",
      "title": "Among the Living",
      "year": 1941,
      "imdbRating": 6.4,
      "imdbVotes": 873,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039757",
      "title": "The Red House",
      "year": 1947,
      "imdbRating": 6.7,
      "imdbVotes": 5167,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039768",
      "title": "Ride the Pink Horse",
      "year": 1947,
      "imdbRating": 7.2,
      "imdbVotes": 3532,
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037865",
      "title": "Leave Her to Heaven",
      "year": 1945,
      "imdbRating": 7.6,
      "imdbVotes": 15938,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037691",
      "title": "Fallen Angel",
      "year": 1945,
      "imdbRating": 7,
      "imdbVotes": 6860,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040798",
      "title": "Sleep, My Love",
      "year": 1948,
      "imdbRating": 6.8,
      "imdbVotes": 2259,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    },
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1940s",
      "name": "1940s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}