{
  "movieId": "tt0055184",
  "title": "The Misfits",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-misfits-1961_202508",
      "id": "the-misfits-1961_202508",
      "title": "The Misfits (1960) Clark Gable · Montgomery Clift",
      "description": "Neo-Western drama by John Huston . The final curtain fell for Marilyn Monroe and Clark Gable ...",
      "fileSize": 3885032021,
      "addedAt": "2026-01-07T00:12:22.154Z",
      "thumbnail": "https://archive.org/services/img/the-misfits-1961_202508",
      "language": "eng",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 502
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Nr0y4SNNpEA",
      "id": "Nr0y4SNNpEA",
      "title": "The Misfits | Full Hollywood Action Thriller Movie | Nick Cannon | Pierce Brosnan",
      "description": "Brilliant thief Richard Pace (Pierce Brosnan) commits daring escapes and high-octane car chases that elude authorities across the globe, until he is recruited by The Misfits, a band of modern-day Robin Hoods led by the eccentric Ringo (Nick Cannon). The skilled group convinces Pace to join them to pull off the heist of the century: stealing millions of gold kept under one of the most secured prisons on earth, owned by rogue businessman Schultz (Tim Roth) and used for funding terrorist groups. It will take super-charged engines, forged identities, camels, nitro, and massive explosions to succeed - all part of the fun for the Misfits.\n\n2021.  Stars: Pierce Brosnan, Tim Roth, Nick Cannon\n**Under legal license from Highland. All rights reserved**\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#hollywoodactionmovie #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:01:46.483Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Nr0y4SNNpEA/maxresdefault.webp",
      "duration": 5635,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "ID",
          "MY",
          "PH",
          "SG",
          "VN"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "125 min",
    "imdbRating": 7.2,
    "imdbVotes": 24942,
    "Genre": "Drama, Romance, Western",
    "Plot": "Roslyn Taber, the type of woman who turns heads easily, recently came to Reno to get a quickie divorce, she having no idea what to do with her life after that. She cannot tolerate seeing animal suffering, let alone human suffering. Coinciding with getting the divorce, Roslyn meets friends Gay Langland and Guido, a divorced aging grizzled cowboy and a widowed mechanic respectively. Although Guido makes no bones about wanting to get to know Roslyn in the biblical sense and although he \"saw her first\", Roslyn begins a relationship with Gay, despite Roslyn's friend Izzy Steers, who originally came to Reno years ago to get her own divorce and never left, warning her about cowboys as being unreliable, and despite Roslyn initially not being interested in Gay \"in that way\". Gay has grown children who he rarely sees and wishes he was there for more than was the case. Gay and Roslyn move into the under construction farmhouse owned by Guido, which he was building for his wife before she died. After spotting a small herd in the local mountains, Guido convinces Gay to do some mustanging - capturing wild mustangs - to sell them. In this and age, these mustangs, commercially, are good only as dog meat. Needing a third for their outing, they run into Perc Howland, a cowboy acquaintance, who is on his way to the Dayton Rodeo. He recently started the itinerant life out of necessity. Perc lives day to day, job to job, that is when he's not in the hospital recuperating from his many on the job injuries. They are able to convince Perc to join them after his events at the rodeo have concluded. Perc is just the latest to fall for Roslyn, while of the three men she feels the most protective toward Perc as the constantly injured one. The questions become whether the friendship and business of the three men can withstand the addition of Roslyn in their life, and if Roslyn can love any of three after seeing first hand what their life is all about.",
    "Director": "John Huston",
    "Writer": "Arthur Miller",
    "Actors": "Clark Gable, Marilyn Monroe, Montgomery Clift",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0054428",
    "tt0186500",
    "tt0051411",
    "tt0054476",
    "tt0059232",
    "tt0053712",
    "tt0017463",
    "tt0040078",
    "tt0055230",
    "tt0033808",
    "tt0055278",
    "tt0054790"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.154Z"
}