{
  "imdbId": "tt0057012",
  "title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dr-strangelove-or-how-i-learned-to-stop-worrying-and-love-the-bomb",
      "id": "dr-strangelove-or-how-i-learned-to-stop-worrying-and-love-the-bomb",
      "title": "Dr Strangelove, or: How I Learned to Stop Worrying and Love the Bomb",
      "description": "Stanley Kubrick’s painfully funny take on Cold War anxiety is one of the fiercest satires of human folly ever to come out of Hollywood. The matchless shape-shifter Peter Sellers plays three wildly different roles: Royal Air Force Captain Lionel Mandrake, timidly trying to stop a nuclear attack on the USSR ordered by an unbalanced general (Sterling Hayden); the ineffectual and perpetually dumbfounded U.S. President Merkin Muffley, who must deliver the very bad news to the Soviet premier; and the titular Strangelove himself, a wheelchair-bound presidential adviser with a Nazi past. Finding improbable hilarity in nearly every unimaginable scenario,  Dr. Strangelove, or: How I Learned to Stop Worrying and Love the Bomb  is a subversive masterpiece that officially announced Kubrick as an unparalleled stylist and pitch-black ironist.",
      "fileSize": 7792243157,
      "addedAt": "2026-01-07T00:08:15.375Z",
      "thumbnail": "https://archive.org/services/img/dr-strangelove-or-how-i-learned-to-stop-worrying-and-love-the-bomb",
      "language": "eng",
      "year": 1964,
      "collection": "feature_films",
      "downloads": 79015
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "95 min",
    "imdbRating": 8.3,
    "imdbVotes": 543930,
    "Genre": "Comedy, War",
    "Plot": "Paranoid Brigadier General Jack D. Ripper of Burpelson Air Force Base, believing that fluoridation of the American water supply is a Soviet plot to poison the U.S. populace, is able to deploy through a back door mechanism a nuclear attack on the Soviet Union without the knowledge of his superiors, including the Chair of the Joint Chiefs of Staff, General Buck Turgidson, and President Merkin Muffley. Only Ripper knows the code to recall the B-52 bombers and he has shut down communication in and out of Burpelson as a measure to protect this attack. Ripper's executive officer, RAF Group Captain Lionel Mandrake (on exchange from Britain), who is being held at Burpelson by Ripper, believes he knows the recall codes if he can only get a message to the outside world. Meanwhile at the Pentagon War Room, key persons including Muffley, Turgidson and nuclear scientist and adviser, a former Nazi named Dr. Strangelove, are discussing measures to stop the attack or mitigate its blow-up into an all out nuclear war with the Soviets. Against Turgidson's wishes, Muffley brings Soviet Ambassador Alexi de Sadesky into the War Room, and get his boss, Soviet Premier Dimitri Kisov, on the hot line to inform him of what's going on. The Americans in the War Room are dismayed to learn that the Soviets have an as yet unannounced Doomsday Device to detonate if any of their key targets are hit. As Ripper, Mandrake and those in the War Room try and work the situation to their end goal, Major T.J. \"King\" Kong, one of the B-52 bomber pilots, is working on his own agenda of deploying his bomb where ever he can on enemy soil if he can't make it to his intended target.",
    "Director": "Stanley Kubrick",
    "Writer": "Stanley Kubrick, Terry Southern, Peter George",
    "Actors": "Peter Sellers, George C. Scott, Sterling Hayden",
    "Language": "English, Russian",
    "Country": "United Kingdom, United States",
    "Awards": "Nominated for 4 Oscars. 14 wins & 11 nominations total"
  },
  "relatedMovies": [
    "tt0060921",
    "tt0058756",
    "tt0045758",
    "tt0050825",
    "tt0055593",
    "tt0059903",
    "tt0058037",
    "tt0031322",
    "tt0058022",
    "tt0042209",
    "tt0035670",
    "tt0002755"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1960s",
      "name": "1960s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:08:15.375Z"
}