{
  "imdbId": "tt0011513",
  "title": "Nomads of the North",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NomadsOfTheNorth1920",
      "id": "NomadsOfTheNorth1920",
      "title": "Nomads of the North (1920)",
      "description": "Nanette Roland lives an unhappy existence in the Northwoods; her father dies leaving her no money, and her fiancee, Raoul Challoner, has gone off trapping for pelts, and has disappeared. She does not want to marry Duncan McDougall's son, Buck, until she is convinced that Raoul is dead. Buck fabricates evidence that Raoul is dead, and Nanette reluctantly agrees to marry him. She is about to be wed when Raoul returns and spirits her away from the ceremony. Raoul and Nanette are married, but Buck goads Raoul into a fight, during which one of Buck's men, Black Marat, is accidentally killed. Raoul is accused of murder and arrested, but Nanette rescues him from jail and they flee into the woods in his canoe. Corporal O'Connor, a dedicated mountie and admirer of Nanette, is ordered after the fugitives. Three years later, Raoul, his wife and baby are living deep in the woods when they are discovered by Buck and O'Connor. O'Connor arrests Raoul, who yields without a struggle, and he and his family begin the trip back when they are trapped by a great forest fire. Buck is caught drunk in a cabin and is destroyed by the fire. Raoul has an opportunity to escape when O'Connor is trapped, but he saves the mountie's life instead. O'Connor sets him free, and says that he will report Raoul as dead. O'Connor leaves the happy family, as they plan to start life anew in the wilderness.",
      "fileSize": 2460905297,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NomadsOfTheNorth1920",
      "collection": "feature_films",
      "downloads": 9527
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tzoXFcvMu3k",
      "id": "tzoXFcvMu3k",
      "title": "Nomads of the North (1920) | Colorized Public Domain Silent Adventure with Lon Chaney & Lewis Stone",
      "description": "Nomads of the North (1920) is an American silent adventure drama directed by David Hartford and based on the novel by James Oliver Curwood. This restored and colorized edition revives one of the earliest films to feature both human and animal survival against the wild backdrop of the Canadian wilderness. Released during the golden age of silent cinema, the film combines rugged frontier storytelling with heartfelt performances from a remarkable cast, including Lon Chaney, Lewis Stone, and Betty Blythe.\n\nPlot Summary:\nSet in the rugged forests of northern Canada, the story follows Raoul Challoner (Lewis Stone), a man falsely accused of murder, who escapes into the wilderness with his beloved Nanette Roland (Betty Blythe). Pursued relentlessly by Sergeant O’Connor (Lon Chaney) of the Royal Canadian Mounted Police, the couple must rely on their endurance, courage, and a loyal dog companion to survive.\n\nAs the fugitives navigate harsh terrain, starvation, and violent storms, the drama builds toward moments of suspense and human struggle. Nature itself becomes both adversary and ally, testing the endurance of Raoul and Nanette as they fight to clear Raoul’s name. O’Connor, portrayed with intensity by Lon Chaney, is torn between his duty as a law enforcer and his growing respect for the resilience of the fugitives. The film culminates in dramatic confrontations that reveal themes of justice, survival, and the fragile balance between law and compassion.\n\nCast and Crew:\n• Director: David Hartford\n• Producer: James Oliver Curwood\n• Screenplay: David Hartford, James Oliver Curwood\n• Cinematography: Walter L. Griffin\nStarring:\n• Lewis Stone as Raoul Challoner\n• Betty Blythe as Nanette Roland\n• Lon Chaney as Sergeant O’Connor\n• Melvin Mayo as John Keith\n• Francis McDonald as McKenzie\n\nFilm Significance:\nNomads of the North is significant both as a survival story and as an early example of nature-focused filmmaking in Hollywood. James Oliver Curwood’s wilderness novels were extremely popular in the 1910s and 1920s, inspiring multiple adaptations that blended adventure with environmental themes. The film is also notable for Lon Chaney’s performance, given just before he achieved greater fame as the “Man of a Thousand Faces.”\n\nThe production was ambitious for its time, with elaborate wilderness sets, dangerous stunt sequences, and the inclusion of trained animals, which added authenticity to the film’s survivalist narrative. As a public domain work, it offers a rare glimpse into the storytelling styles of early cinema, where melodrama and moral conflicts were woven into tales of survival and redemption.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Nomads of the North remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1920 release was a silent black-and-white film typical of its era. While historically accurate, silent films in their original state can feel distant to modern audiences. By colorizing and digitally restoring this film, we bring new clarity and visual richness to a story of survival and justice. This edition bridges the gap between historical preservation and modern entertainment, making it accessible to today’s audiences in the United States, Europe, and beyond.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, ranging from silent adventure dramas to landmark epics. Our work ensures these cinematic treasures remain discoverable, enjoyable, and preserved for audiences worldwide.\n\n#NomadsoftheNorth #LonChaney #LewisStone #BettyBlythe #SilentFilm #1920sCinema #PublicDomainMovie #ColorizedClassic #SilentAdventure #FilmRestoration #ClassicCinema",
      "addedAt": "2025-12-24T00:49:17.552Z",
      "thumbnail": "https://i.ytimg.com/vi/tzoXFcvMu3k/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBFKD8wDw==&rs=AOn4CLDvJYgw7JvoY9oAmS8O4arMymvQug",
      "duration": 6135,
      "language": "en",
      "year": 1920,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "109 min",
    "imdbRating": 5.8,
    "imdbVotes": 297,
    "Genre": "Drama",
    "Plot": "In the mountains, the beautiful Nanette waits for her lost love Raoul to return to her. When the villainous Buck McDougall persuades her that Raoul is dead, she consents to marry him, that is until Raoul suddenly turns up at the ceremony right before vows are exchanged. She returns to the man she loves, which angers Buck. He proceeds to frame Raoul for murder. When Raoul and Nanette run away into the wilderness, Buck gets Corporal O'Connor on their trail, since he also harbors unrequited feelings for Nanette and believes she has been kidnapped.",
    "Director": "David Hartford",
    "Writer": "James Oliver Curwood, David Hartford",
    "Actors": "Lon Chaney, Lewis Stone, Melbourne MacDowell",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0011224",
    "tt0011904",
    "tt0010890",
    "tt0011953",
    "tt0010112",
    "tt0009900",
    "tt0013134",
    "tt0013704",
    "tt0013592",
    "tt0011076",
    "tt0011130",
    "tt0011267"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.464Z"
}