{
  "imdbId": "tt0017540",
  "title": "What Price Glory",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/what-price-glory-1926",
      "id": "what-price-glory-1926",
      "title": "What Price Glory? (1926)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. The first of an extremely successful series of films, What Price Glory? follows two soldiers who both fall in love with the same woman. While it starts as a romantic comedy showing the competition between the two, the picture eventually starts to show more of the horrors of war, allowing the two soldiers to find new respect for each other. Beloved by audiences upon release, modern audiences still enjoy it as one of the originals of the buddy film genre.  This version occasionally has a sizeable watermark show up, but is far superior to other versions that I found in quality. ",
      "fileSize": 3154709456,
      "addedAt": "2026-01-07T00:13:06.702Z",
      "thumbnail": "https://archive.org/services/img/what-price-glory-1926",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 70
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "116 min",
    "imdbRating": 6.9,
    "imdbVotes": 454,
    "Genre": "Comedy, Drama, War",
    "Plot": "U.S. Marine sergeants Quirt and Flagg are inveterate romantic rivals on peacetime assignments in China and the Philippines. In 1917, W.W. I brings them to France, where Flagg, now a captain, takes up with flirtatious Charmaine, inn-keeper's daughter. Of course, Quirt has to arrive and spoil his fun. But the harsh realities of war and the threat of a shotgun marriage give the two men a common cause...",
    "Director": "Raoul Walsh",
    "Writer": "Maxwell Anderson, Malcolm Stuart Boylan, James T. O'Donohoe",
    "Actors": "Victor McLaglen, Edmund Lowe, Dolores del Rio",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0018118",
    "tt0016643",
    "tt0023202",
    "tt0047860",
    "tt0051978",
    "tt0049672",
    "tt0018170",
    "tt0019312",
    "tt0017457",
    "tt0048380",
    "tt0046359",
    "tt0018471"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.702Z"
}