{
  "movieId": "tt0003803",
  "title": "Crossed Wires",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CrossedWires",
      "id": "CrossedWires",
      "title": "\"Crossed Wires\" (1915) featuring Florence La Badie",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems \"Crossed Wires\" (A Telephone Tragedy) is a short crime drama included in our program to illustrate the work and contributions of Florence La Badie, a star of Silent Hall of Fame. An innocent man is accused of premeditated murder. Directed by                    Frederick Sullivan Produced by                  Thanhouser Company Written by                     Philip Lonergan Starring                         Inda Palmer, J. Morris Foster, Florence La Badie, Ina Hammer, Boyd Marshall Release date                   June 29, 1915 Running time                 31 minutes Country                          United States Language                        Silent film Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 397555097,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/CrossedWires",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 1331
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "31 min",
    "imdbRating": 6.2,
    "imdbVotes": 47,
    "Genre": "Short, Drama, Mystery",
    "Plot": "Avarice and envy are two of the worst vices with which a person can be possessed, but they dominated the feelings of the housekeeper of a wealthy woman. The mistress was very kind to her servant and thought highly of her, but the realization that she was poor and the other woman rich nearly drove the housekeeper frantic. The rich woman had a niece and nephew of whom she was very fond, and made a will bequeathing the most of her property to the youth, although she provided liberally for his sister, and did not forget to make a substantial bequest to her housekeeper. The nephew accidentally discovered how the servant hated the aunt, and he warned his relative. To even suggest that her servant was not loyal was sufficient to rouse the old lady's anger, and a quarrel ensued, which was overheard by the servants. After nephew and niece had gone the housekeeper craftily tried to induce her mistress to change her will and disinherit her nephew. The schemer was unsuccessful, however, but was determined to secure her part of the inheritance without delay. In the evening the nephew called, apologized to the aunt and was readily forgiven, but after he had gone the old woman was taken violently ill and when she summoned her housekeeper she discovered that her supposedly faithful servant had caused her illness and was waiting for her to die. The dying woman, in her endeavor to outwit the treacherous woman servant, dragged herself to the telephone and called up police headquarters. She started to tell the police officer that her nephew had warned her against the servant when central disconnected the two lines, and all that the policeman heard was the words, \"I am dying - poisoned - Will Drake.\" The call was then accidentally switched on to the wire of a young civil engineer who was on the point of leaving town. The words, \"Will Drake warned me. Susan is guilty,\" meant nothing to him, for he considered it to be nothing more than a family quarrel, and left the city at once. But when the police got to the home and found the wealthy woman dead, the evidence they secured made it look very bad for the nephew. The servants had witnessed the quarrel; the officer on the beat saw the nephew leave the house shortly after, before his aunt was discovered dead, and then there was the incriminating fact that he was the chief heir and the voice at the telephone, mentioning his name. Of course the civil engineer could have done much to clear the accused man, but he was in the west and for many weeks worked in the wilds far from newspaper and other adjuncts of civilization. The nephew was brought to trial for the murder of his aunt, quickly convicted and sentenced to death. He would probably have paid the penalty had it not been for his sister. His sister, worn out by anxiety, was sent to the country to rest. There she accidentally met the only man who could prove her brother's innocence. The engineer recalled the mysterious conversation over the phone and when the evidence was laid before the police a plan was made to trap the guilty housekeeper. The plan was a very unusual one, but it worked upon the conscience of the murderer so powerfully that she broke down and confessed her guilt, and the innocent man was freed. The civil engineer who received the mysterious call, the grateful girl asked him to name any reward he desired, whereupon he told her that he wanted her, and as she had grown to care for him very much, she was glad to make him happy.",
    "Director": "Frederick Sullivan",
    "Writer": "Philip Lonergan",
    "Actors": "Inda Palmer, J. Morris Foster, Florence La Badie",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0482779",
    "tt0002784",
    "tt0464694",
    "tt0463594",
    "tt0005414",
    "tt0231300",
    "tt0005246",
    "tt2889500",
    "tt4229926",
    "tt2376386",
    "tt1780962",
    "tt0021387"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.368Z"
}