{
  "imdbId": "tt0023243",
  "title": "Mr. Robinson Crusoe",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mr_robinson_crusoe",
      "title": "Mr. Robinson Crusoe",
      "description": "Taken from IMDB : While cruising the South Seas with friends aboard a sailing yacht, it is wagered that Steve can not survive on a desert isle without the accouterments of civilization. After accepting the wager, Steve and his dog swim ashore and begin to recreate their Park Avenue world by way of various Rube Goldberg type contraptions constructed from local materials. Meanwhile, on a nearby island, a young maiden flees her arranged wedding. She canoes to Steve's island for safety, whereupon she is dubbed \"Saturday\". Soon they are attacked by vengeful tribesmen from the neighboring island. Will Steve and Saturday survive?",
      "id": "mr_robinson_crusoe"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MrRobinsonCrusoe",
      "title": "Mr. Robinson Crusoe",
      "description": "adventure, comedy Information about this movie can be found on it's IMDB page.",
      "id": "MrRobinsonCrusoe"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mr.-robinson-crusoe-1932",
      "title": "Mr. Robinson Crusoe (1932)",
      "description": "Steve Drexel voluntarily strands himself on a deserted island on a bet. He intends to re-create civilization and carves a miniature city of 52nd Street and Park Avenue out of the jungle. Drexel is befriended by his dog, a native monkey, and a wild goat that is captured in one of his traps. He attempts to cultivate a native as his Man Friday from Robinson Crusoe, but fails as the native escape. Watch on RetroFlix:  https://retroflix.org/mr-robinson-crusoe-1932/",
      "id": "mr.-robinson-crusoe-1932"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Iste9gzI_08",
      "title": "Mr. Robinson Crusoe (1932) | Colorized Public Domain Island Adventure Comedy with Douglas Fairbanks",
      "description": "Mr. Robinson Crusoe (1932) is a pre-Code adventure comedy directed by A. Edward Sutherland and starring the legendary Douglas Fairbanks. Produced by United Artists, this inventive and spirited film reimagines Daniel Defoe’s 18th-century survival tale for the modern era of the 1930s. Now digitally restored and colorized, this public domain gem brings back Fairbanks’ unmatched athleticism, charisma, and optimism — all presented in vivid color and high-definition for today’s global audience.\n\nPlot Summary:\nMr. Robinson Crusoe opens aboard a luxury yacht in the South Pacific, where wealthy sportsman Steve Drexel (Douglas Fairbanks) makes a daring bet with his friends. He claims he can live alone on a deserted island for an entire year — armed with nothing but his wits and determination. After leaping overboard, Drexel swims ashore to a lush tropical island and begins his experiment in self-reliance.\n\nIngeniously using natural resources, he builds a home, tools, and even a working radio. His charm and inventiveness transform the island into a functioning paradise, complete with makeshift furniture and creative gadgets. His solitude is broken when he meets a beautiful native woman, referred to as Saturday (Maria Alba), who becomes both his companion and partner in survival.\n\nThe film blends adventure, romance, and humor as Drexel faces wild animals, isolation, and unexpected visitors — including a group of pearl divers and hostile tribesmen. In typical Fairbanks fashion, the story is filled with daring stunts, graceful acrobatics, and unbreakable optimism. When Drexel’s friends finally return, he proves that resourcefulness and imagination can triumph over luxury and dependence.\n\nCast and Crew:\n• Director: A. Edward Sutherland\n• Producer: Douglas Fairbanks\n• Screenplay: Gene Towne and Graham Baker\n• Cinematography: Oliver T. Marsh\n• Editing: LeRoy Stone\n• Production Company: United Artists\nStarring:\n• Douglas Fairbanks as Steve Drexel (Mr. Robinson Crusoe)\n• Maria Alba as Saturday\n• William Farnum as Mr. Blackwell\n• Earle Brown as Two-Gun\n• Robert W. Eddy as Tommy\n• William Farnum Jr. as Crewman\n\nFilm Significance:\nAccording to Wikipedia and IMDb, Mr. Robinson Crusoe marked one of the final starring roles of Douglas Fairbanks before his retirement. It captures his signature adventurous spirit in the transition from the silent era to sound cinema. The film showcases Fairbanks’ unique combination of athletic physicality and light-hearted charm, hallmarks that made him a global icon.\n\nShot on location in the tropical islands near Tahiti, this early 1930s production stands out for its natural scenery, practical stunts, and inventive pre-Code humor. It offers a rare glimpse of Hollywood experimentation during a time of economic depression, providing escapist entertainment while reflecting optimism in self-reliance and ingenuity.\n\nFor modern audiences, this film serves as both a historical time capsule and an enduring lesson on creativity, courage, and independence — themes that remain universally relevant.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Mr. Robinson Crusoe remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. \n\nWhy Watch This Colorized Edition:\nThe original 1932 version was filmed in black and white, reflecting the limitations of early sound-era production. Through meticulous colorization, this edition revitalizes the island landscapes, ocean blues, and lush tropical vegetation — creating a more immersive visual experience, especially for modern TV screens, which dominate nearly 50 percent of Colorized Public Domain’s viewership.\n\nThis restoration honors Douglas Fairbanks’ adventurous legacy by giving new clarity and color depth to his stunts, expressions, and dynamic physicality. Viewers watching on large home screens can now appreciate the detailed craftsmanship and natural light that early cinematographers captured, making this colorized version both historically faithful and visually captivating.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema — from forgotten adventure stories to Hollywood legends like Fairbanks, Chaplin, and Pickford. Our goal is to preserve cinematic history while introducing it to new generations of audiences across the USA, Europe, and beyond.\n\n#MrRobinsonCrusoe #DouglasFairbanks #1930sAdventure",
      "id": "Iste9gzI_08",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=46_raw2OsDg",
      "title": "Mr. Robinson Crusoe (1932) DOUGLAS FAIRBANKS",
      "description": "Stars: Douglas Fairbanks, William Farnum and Earle Browne\nDirector: A. Edward Sutherland\n\nYachtsman Steve Drexel bets his friends that he can swim ashore on a remote south-seas island with nothing but a toothbrush and be 'living the life of Riley' when they return. With handmade implements the lighthearted, athletic Steve improbably builds a comfortable home with all amenities...and local fauna trained to help him! Meanwhile, a grass-skirted young lady flees an unwelcome wedding on a nearby island. Steve calls her Saturday, but what is he to do with her?",
      "id": "46_raw2OsDg",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mr.RobinsonCrusoe_weirdnessBadMovie",
      "title": "Mr. Robinson Crusoe_Weirdness Bad Movie",
      "description": "Public Access TV show \"Weirdness Really Bad Movie\" hosts public domain movies and ads clean comedy sketches enjoyable for the whole family. Today's film is Douglas Fairbanks second to last film, \"Mr. Robinson Crusoe\" from 1832.",
      "id": "Mr.RobinsonCrusoe_weirdnessBadMovie"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "76 min",
    "imdbRating": "5.5",
    "imdbVotes": "520",
    "Genre": "Action, Adventure, Comedy",
    "Plot": "Yachtsman Steve Drexel bets his friends that he can swim ashore on a remote south-seas island with nothing but a toothbrush and be 'living the life of Riley' when they return. With handmade implements the lighthearted, athletic Steve improbably builds a comfortable home with all amenities...and local fauna trained to help him! Meanwhile, a grass-skirted young lady flees an unwelcome wedding on a nearby island. Steve calls her Saturday, but what is he to do with her?",
    "Director": "A. Edward Sutherland",
    "Writer": "Douglas Fairbanks, Thomas J. Geraghty",
    "Actors": "Douglas Fairbanks, William Farnum, Earle Browne",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0023808",
      "title": "The Big Chance",
      "year": 1933,
      "imdbRating": "4.8",
      "imdbVotes": "195",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024524",
      "title": "Scarlet River",
      "year": 1933,
      "imdbRating": "6.1",
      "imdbVotes": "175",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025644",
      "title": "Perils of Pauline",
      "year": 1933,
      "imdbRating": "6.2",
      "imdbVotes": "152",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0025424",
      "title": "Lost in the Stratosphere",
      "year": 1934,
      "imdbRating": "4.3",
      "imdbVotes": "138",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019987",
      "title": "His First Command",
      "year": 1929,
      "imdbRating": "5.9",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026435",
      "title": "Tailspin Tommy in the Great Air Mystery",
      "year": 1935,
      "imdbRating": "6.6",
      "imdbVotes": "105",
      "language": "English, Spanish",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0028170",
      "title": "We're in the Legion Now",
      "year": 1936,
      "imdbRating": "4.8",
      "imdbVotes": "95",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018937",
      "title": "A Girl in Every Port",
      "year": 1928,
      "imdbRating": "6.5",
      "imdbVotes": "864",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025681",
      "title": "The Private Life of Don Juan",
      "year": 1934,
      "imdbRating": "6.3",
      "imdbVotes": "752",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021334",
      "title": "The Sap from Syracuse",
      "year": 1930,
      "imdbRating": "5.9",
      "imdbVotes": "108",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041098",
      "title": "Africa Screams",
      "year": 1949,
      "imdbRating": "6.0",
      "imdbVotes": "4,134",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0046414",
      "title": "Beat the Devil",
      "year": 1953,
      "imdbRating": "6.4",
      "imdbVotes": "10,677",
      "language": "Arabic, English, Italian",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T18:19:14.825Z"
}