{
  "movieId": "tt0004150",
  "title": "In the Land of the Head Hunters",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-in-the-land-of-the-head-hunters",
      "id": "silent-in-the-land-of-the-head-hunters",
      "title": "In the Land of the Head Hunters",
      "fileSize": 1817891489,
      "addedAt": "2026-01-07T00:10:59.120Z",
      "thumbnail": "https://archive.org/services/img/silent-in-the-land-of-the-head-hunters",
      "language": "English",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 2592
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "65 min",
    "imdbRating": 5.8,
    "imdbVotes": 553,
    "Genre": "Drama, History",
    "Plot": "In 1911, as part of his massive undertaking, famed Northwest photographer Edward S. Curtis travelled to Vancouver Island, British Columbia, to visit the Kwakwaka'wakw. By the next year, needing money for his project and to add to his research and still photography work, Curtis decided that the best way to record the traditional way of life and ceremonies of the Kwakwaka'wakw was to make one of the first feature motion pictures. Curtis had already shot footage in 1906 of the Hopi Snake dance, which he had previously showed during his talks, but this was to be on a grander scale. It took three years of preparation for this one film including the weaving of the costumes; building of the war canoes, housefronts, poles; and the carving of masks. Assisting on the film was George Hunt, a Kwakwaka'wakw who had served as an interpreter for the famous anthropologist Franz Boas nearly twenty years before. Hunt helped contribute substantial portions of the film's story as well. Selected for the National Film Registry by the Library of Congress, this early Native American drama/documentary released in 1914 is an amazing film produced in collaboration with the tribe members. The story of love and revenge among the Kwakwaka'wakw of British Columbia, Motana, the son of a great chief, goes on a vigil journey. Through fasting and hardships he hopes to gain supernatural strength which will make him a chief as powerful as his father. Curtis showcases the Kwakwaka'wakw's magnifcent war canoes, totem poles, rituals, costumes and dancing.",
    "Director": "Edward S. Curtis",
    "Writer": "Edward S. Curtis",
    "Actors": "Stanley Hunt, Sarah Constance Smith Hunt, Mrs. George Walkus",
    "Language": "None, English",
    "Country": "United States, Canada",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0003740",
    "tt0004022",
    "tt1223220",
    "tt0005719",
    "tt0162496",
    "tt0005460",
    "tt0207954",
    "tt0002445",
    "tt0393807",
    "tt0005149",
    "tt0211075",
    "tt0002101"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.120Z"
}