{
  "imdbId": "tt0018513",
  "title": "Twelve Miles Out",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/twelve-miles-out-1927_202508",
      "id": "twelve-miles-out-1927_202508",
      "title": "Twelve Miles Out (1927)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. In Twelve Miles out, two pirate bootleggers kidnap a young couple who threatened to turn them in to the police. Though Jane, the young woman who is already engaged, starts to become entranced in the life of a smuggler. This John Gilbert and Joan Crawford silent seems to have mostly been forgotten by time, though modern viewers find it exciting, but lacking surprises.  This version is unfortunately incomplete, cutting about 20 minutes of character development. What remains is serviceable to the plot, however, and unless a more full print is released by MGM, this is the highest quality version that is publicly available.",
      "fileSize": 502958002,
      "addedAt": "2026-01-07T00:12:55.130Z",
      "thumbnail": "https://archive.org/services/img/twelve-miles-out-1927_202508",
      "language": "eng",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 118
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 5.1,
    "imdbVotes": 666,
    "Genre": "Drama",
    "Plot": "Jerry always wins in his rivalry with Red over women, gunrunning, and diamond smuggling. While running booze into the U.S. during Prohibition, Jerry seizes Jane's seaside home. When she tries to turn him in, he kidnaps her and her fiance John. Jane, now in love with Jerry, must watch as Jerry and Red shoot it out on board Jerry's boat.",
    "Director": "Jack Conway",
    "Writer": "Joseph Farnham, William Anthony McGuire, Andrew Percival Younger",
    "Actors": "John Gilbert, Ernest Torrence, Joan Crawford",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020538",
    "tt0020247",
    "tt0016690",
    "tt0019571",
    "tt0018618",
    "tt0018795",
    "tt0019811",
    "tt0018138",
    "tt0018528",
    "tt0018054",
    "tt0017534",
    "tt0019421"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.130Z"
}