{
  "imdbId": "tt0002910",
  "title": "Granddad",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Granddad",
      "title": "Granddad",
      "description": "A story of the relationship between a young girl (Mildred Harris) and her Civil War vet grandfather (William Desmond Taylor). When the girl's new step mom arrives she objects to gramps heavy drinking so the old man packs up and heads out so that he doesn't ruin the young girl. A month passes and the family finds him in a poor house and it might be too late to help him.",
      "id": "Granddad"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "29 min",
    "imdbRating": "6.0",
    "imdbVotes": "89",
    "Genre": "Short, Drama",
    "Plot": "Old Jabez Burr is shown with his little grand-daughter, Mildred. She receives a letter from her father that he is coming home with a new mamma for her, and telling her to warn grand-dad to hide his black bottle, as the lady is a great church worker and is opposed to liquor. Jabez is a veteran of the civil war, and has been wont to meet his old army cronies and fight again the great battles in which they took part, and his fast ebbing strength has been stimulated by liquor. Mrs. Burr arrives, and soon becomes a leader in the church work of the neighborhood. Grand-dad slyly hides his bottle. Mrs. Burr nags grand-dad frequently, and finally in an outburst of anger she tells him that he is contaminating Mildred. The old man is crushed, and resolves to go away. That night, when all is still, he quietly kisses Mildred good-bye as she sleeps, and starts out. Mr. Burr hears him moving about, and thinks burglars are in the house. He finds his father and pleads with him to stay, but the old man is determined, and says, \"Your wife must be considered first. I must not come between yon. It is best that I should leave.\" Now, grand-dad is very old, and he cannot find work. He is finally compelled to seek refuge in the poor-house, where he is put to work in the field. A stranger comes to town, a man with martial tread and an empty sleeve. He is seeking Jabez Burr, and to the old soldiers in the tavern he tells the story (which is shown in the film), of how Jabez saved his life. The stranger is a Confederate colonel. The colonel, with shattered arm, was dying when Jabez Burr, his enemy, moved to sympathy, carried him off the field to the Union hospital. Jabez was captured and hurried to a Confederate prison. After the war the colonel had made incessant search for his rescuer, and had finally traced him to his son's residence, where he was informed that Jabez had gone away. The ladies of the church, including Mrs. Burr, visit the poor house. Little Mildred is taken along, and in running about the grounds she meets grand-dad. A touching scene takes place, and Mrs. Burr is mortified when it is found that the old man is her husband's father. When they return home Mildred tells her father, and he is very angry and ashamed. He tells his wife very decidedly that regardless of anything, he is going to bring his father home. Early the next day he starts for the poorhouse. Poor old granddad is working in the field, when he is suddenly stricken by the heat. He is carried indoors, just as the colonel arrives. When Mr. Burr reaches the scene granddad is nearing the end. In his dying delirium he has a vision of the sunset gun being fired, and rising to a sitting position, he salutes the flag and falls back, dead.",
    "Director": "Jay Hunt",
    "Writer": "William H. Clifford",
    "Actors": "J. Barney Sherry, Mildred Harris, Frank Borzage",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0778062",
      "title": "Silent Heroes",
      "year": 1913,
      "imdbRating": "4.9",
      "imdbVotes": "29",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002816",
      "title": "The Drummer of the 8th",
      "year": 1913,
      "imdbRating": "5.9",
      "imdbVotes": "128",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002784",
      "title": "Cymbeline",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "50",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002795",
      "title": "Death's Marathon",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "625",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003075",
      "title": "The Little Tease",
      "year": 1913,
      "imdbRating": "5.7",
      "imdbVotes": "44",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003497",
      "title": "The Unwelcome Guest",
      "year": 1913,
      "imdbRating": "6.6",
      "imdbVotes": "33",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003516",
      "title": "The Wanderer",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "65",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0464694",
      "title": "Tannhäuser",
      "year": 1913,
      "imdbRating": "5.2",
      "imdbVotes": "44",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0470339",
      "title": "The Haunted Bedroom",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "27",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0463594",
      "title": "The Marble Heart",
      "year": 1913,
      "imdbRating": "4.7",
      "imdbVotes": "40",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003170",
      "title": "The Mothering Heart",
      "year": 1913,
      "imdbRating": "6.4",
      "imdbVotes": "849",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003323",
      "title": "The Reformers; or, the Lost Art of Minding One's Business",
      "year": 1913,
      "imdbRating": "6.5",
      "imdbVotes": "33",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}