{
  "imdbId": "tt0071411",
  "title": "Dersu Uzala",
  "year": 1975,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=W8X1rTHeGGs",
      "id": "W8X1rTHeGGs",
      "title": "Dersu Uzala",
      "description": "A pedido del público, presentamos la película Dersu Uzala con subtítulos en Español.\n\nBasada en la obra del científico y escritor, célebre viajero y explorador del Lejano Oriente\nV. Arseniev. La historia de su amistad con el guía Dersu Uzala con extraordinarias cualidades personales. Su viaje por la taiga-bosque, lleno de peligrosas aventuras, es el argumento de la película, pero el sentido de la historia va mucho más allá de la trama: es una historia sobre la hermandad de las personas, que todos somos hijos de una misma tierra. \n\nIMDb rating: 8,2\n\nAño de producción: 1975\n\nDirigida por: Kurosawa Akira\nGuionistas: Yuri Nagibin, Akira Kurosawa\nCompositor: Schwartz Isaac\nDirectores de fotografía: Gantman Yuri, Dobronravov Fedor, Nakai Asakazu\nDiseñador de producción: Raksha Yuri\nReparto: Yuri Solomin, Alexander Pyatkov, Maxim Munzuk, Vladimir Kremena, Svetlana Danilchenko, Suymenkul Chokmorov, Mikhail Bychkov, Dima Korshikov, Nikolay Volkov, Igor Sykhra, Janis Yakobson, Alexander Baranov\n\nPremios y reconocimientos:\n1975 - Premio FIPRESCI en el IX IFF de Moscú\n1975 - premio de oro en el IX IFF de Moscú\n1976 - \"Oscar\" de la American Film Academy de Los Ángeles (EEUU) a la mejor película extranjera\n1976 - diploma del grado II \"por lograr los mejores resultados en la solución artística, visual y técnica de la película\" en la I competencia de toda la Unión por el mejor uso de películas en color negativas domésticas al filmar largometrajes\n1976 - diploma de participación en el XIV Festival Internacional de Cine de Nueva York (EE.UU.)\n1977 - Premio Especial de la Asociación Nacional de Guionistas de España, a la mejor película extranjera proyectada en el país\n1977 - diploma de participación en el IFF de Bruselas (Bélgica)\n1977 - premio honorífico al productor Krichevsky Georges (a título póstumo) en el IFF de Bruselas (Bélgica)\n1978 - Premio de la crítica francesa M. Munzuku \"al mejor trabajo actoral\"\n1976 - diploma de participación en el IFF de Viena (Austria)\n1977 - Premio Internacional de Cine \"David di Donatello\" (Italia) a la mejor película extranjera exhibida en Italia\n\n#Dersu_Uzala #Far_Easr #Kurosawa #Arseniev #Subtitulos_en_Español",
      "addedAt": "2025-12-23T03:45:22.020Z",
      "thumbnail": "https://i.ytimg.com/vi/W8X1rTHeGGs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDcskqSlfyyIBBF3kKl2YBssOta7g",
      "duration": 8506,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw",
      "regionRestriction": {
        "blocked": [
          "AM",
          "AZ",
          "BY",
          "EE",
          "GE",
          "KG",
          "KZ",
          "LT",
          "LV",
          "MD",
          "RU",
          "TJ",
          "TM",
          "UA",
          "UZ"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dersu.-uzala.-1975",
      "id": "dersu.-uzala.-1975",
      "title": "Dersu Uzala (1975)",
      "description": "Dersu Uzala is a 1975 epic biographical adventure drama film directed and co-written by Akira Kurosawa. Shot in Russian, it is his only non-Japanese-language film and only 70mm film. An international co-production between Japan and the Soviet Union, shot at the peak of the East-West detente, the film is based on the 1923 memoir Dersu Uzala by Russian explorer Vladimir Arsenyev, about his exploration of the Sikhote-Alin region of the Russian Far East over the course of multiple expeditions in the early 20th century. The  film is about the friendship between a Russian explorer, Captain Arsenyev, and a nomadic Goldi hunter named Dersu Uzala in the Siberian wilderness.  The story follows their adventures as Dersu guides Arsenyev's expedition, showcasing his survival skills and deep connection to nature, ultimately highlighting themes of friendship, respect, and the clash between civilization and the natural world.",
      "fileSize": 4466526357,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/dersu.-uzala.-1975",
      "language": "rus (English subtitles)",
      "year": 1975,
      "collection": "feature_films",
      "downloads": 341
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "142 min",
    "imdbRating": 8.2,
    "imdbVotes": 35263,
    "Genre": "Adventure, Biography, Drama",
    "Plot": "A Russian army explorer who is rescued in Siberia by a rugged Asian hunter renews his friendship with the woodsman years later when he returns as the head of a larger expedition. The hunter finds that all of his nature lore is of no help when he accompanies the explorer back to civilization.",
    "Director": "Akira Kurosawa",
    "Writer": "Akira Kurosawa, Yuriy Nagibin, Vladimir Arsenev",
    "Actors": "Maksim Munzuk, Yuriy Solomin, Mikhail Bychkov",
    "Language": "Russian, Chinese",
    "Country": "Soviet Union, Japan",
    "Awards": "Won 1 Oscar. 8 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0036400",
    "tt0038268",
    "tt0051808",
    "tt0037576",
    "tt1659619",
    "tt0072615",
    "tt0057105",
    "tt0041426",
    "tt0123066",
    "tt0026752",
    "tt0036582",
    "tt0186716"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "akira-kurosawa",
      "name": "Akira Kurosawa"
    },
    {
      "id": "adventure",
      "name": "Adventure"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.606Z"
}