{
  "movieId": "tt0043137",
  "title": "Winchester '73",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/winchester-73-1950",
      "id": "winchester-73-1950",
      "title": "Winchester '73 (1950)",
      "description": "WINCHESTER '73 (Winchester '73, 1950 - USA) (Filme Completo / Legendado em Português) Data de Lançamento: 12 de Julho de 1950 » SINOPSE: Lin McAdam (James Stewart) e Frankie \"High Spade\" Wilson (Millard Mitchell), seu melhor amigo, chegam em Dodge City para um concurso de tiro, cujo prêmio é um rifle Winchester tão perfeitamente fabricado que é conhecido como \"Um em Mil\". No saloon Lin se depara com Dutch Henry Brown (Stephen McNally), sendo que eles não atiraram um no outro pelo simples fato de que o xerife, Wyatt Earp (Will Geer), não permite que ninguém ande armado pela cidade. Após uma acirrada disputa com Dutch, Lin vence o concurso. Entretanto logo em seguida Lin é atacado por Brown e seus cúmplices, que lhe roubam o rifle e fogem através do deserto, indo parar em um lugar remoto onde está um negociante de armas, que espera o momento certo para negociar com os índios. Brown e seus amigos têm apenas o Winchester sem munição, pois ao fugirem deixaram suas armas em Dodge City. Como as armas ali são vendidas por um preço muito caro, Dutch pega toda a quantia que tem e vai jogar pôquer para tentar ter dinheiro para comprar as armas. Ele perde tudo, então pressionado pelo amigo vende o rifle por 300 dólares. Ao tentar recuperar a arma, Dutch aposta todo o dinheiro em uma única jogada e perde novamente. Mais tarde o mercador se encontra com os índios, que não gostam da mercadoria pois são armas usadas. Quando o chefe dos índios vê o rifle decide ficar com ele e mata o negociante. É o início da trajetória do rifle, que logo irá mudar de dono. » » SOBRE O FILME: As negociações para a produção de Winchester ’73 começaram em 1949 e desde o início já tinha um diretor designado para dirigi-lo: Fritz Lang. O cineasta chegou a fazer as preparações para o longa no início de 1950 mas acabou desistindo do projeto porque a Universal International Pictures não queria que ele também fosse co-produtor, através de sua empresa Diana Productions Company (pela qual já havia feito Almas Perversas e O Segredo da Porta Fechada). . Com a cadeira vaga e um bom roteiro em mãos, o estúdio achou que seria interessante aceitar a indicação dada pelo ator James Stewart e contratar Anthony Mann para ocupá-la. Embora não tivesse o peso de Fritz Lang, Mann vinha trilhando um caminho notável no cinema noir e, em 1949, fizera para a MGM dois bons longas do gênero, Pecado Sem Mácula e Mercado Humano. Parecia uma aposta arriscada, mas como Mann não tinha problemas com prazos e nem estourava orçamentos, o máximo que o estúdio poderia ter em mãos era um filme sombrio e denso (nesse caso, um western), mais ou menos na linha dos longas que o cineasta mais se destacara até o momento. . Winchester ’73 é uma obra seminal. Ela está entre os primeiros westerns a jogar com a problemática identidade pregressa do cowboy ou pistoleiro e de como essa situação do passado afeta negativamente sua vida atual. Além disso, o próprio personagem é visto de uma outra forma, mais pessimista e egoísta, sem o grande louvor e senso de heroísmo a que estava acostumado. Anthony Mann dava um passo decisivo para a criação de um degrau que durante toda a década de 1950 se transformaria na escada que sepultaria o western clássico em seu topo e deixaria aberta a porta para o revisionismo em todas as suas facetas a partir dos anos 60. Winchester ’73 pode não ser uma obra prima absoluta, mas com certeza é um weste » » DIREÇÃO: Anthony Mann ROTEIRO: Robert L. Richards, Borden Chase GÊNERO: Western ORIGEM: USA DURAÇÃO: 1h 32min » » ELENCO PRINCIPAL: James Stewart … Lin McAdam Shelley Winters … Lola Manners Dan Duryea … Waco Johnnie Dean Stephen McNally … Dutch Henry Brown Millard Mitchell … High Spade Charles Drake … Steve Miller John McIntire … Joe Lamont Will Geer … Wyatt Earp Rock Hudson … Jovem Bull Tony Curtis … Doan John Alexander … Jack Riker Steve Brodie … Wesley James Millican … Wheeler Abner Biberman … Latigo Means John Doucette … Roan Daley James Best … Crater Chuck Roberson … Long Tom Jay C. Flippen … Sargento Wilkes Ray Teal … Delegado Noonan » » Fontes de Pesquisa/Textos: IMDb, Filmow, Cine Players, Plano Crítico.",
      "fileSize": 4058148924,
      "addedAt": "2026-01-07T00:13:06.704Z",
      "thumbnail": "https://archive.org/services/img/winchester-73-1950",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 27542
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "92 min",
    "imdbRating": 7.6,
    "imdbVotes": 23424,
    "Genre": "Action, Drama, Western",
    "Plot": "In a marksmanship contest, Lin McAdam wins a prized Winchester rifle, which is immediately stolen by the runner-up, Dutch Henry Brown. This \"story of a rifle\" then follows McAdams' pursuit, and the rifle as it changes hands, until a final showdown and shoot-out on a rocky mountain precipice.",
    "Director": "Anthony Mann",
    "Writer": "Robert L. Richards, Borden Chase, Stuart N. Lake",
    "Actors": "James Stewart, Shelley Winters, Dan Duryea",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0048667",
    "tt0059263",
    "tt0050699",
    "tt0042286",
    "tt0051899",
    "tt0040723",
    "tt0042176",
    "tt0061709",
    "tt0042473",
    "tt0026846",
    "tt0042251",
    "tt0042343"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}