{
  "imdbId": "tt0040616",
  "title": "Mr. Reckless",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mr_reckless",
      "title": "Mr Reckless",
      "id": "mr_reckless"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q2MyDf-_sMM",
      "title": "Mr. Reckless (1948) | Colorized Public Domain Romantic Drama with William Eythe and Barbara Britton",
      "description": "Mr. Reckless (1948) is an American romantic drama directed by Frank McDonald and produced by Pine-Thomas Productions for Paramount Pictures. Starring William Eythe and Barbara Britton, the film runs approximately 66 minutes and blends romance, ambition, and high-stakes risk-taking into a fast-paced story of love, loyalty, and personal redemption. This restored and colorized edition brings new energy to a postwar-era gem, making it visually engaging and culturally accessible for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nThe story centers on Jeff Lundy (William Eythe), a daring oil driller whose reputation for recklessness has earned him both admiration and criticism. Known for taking dangerous chances in his profession and personal life, Jeff’s lifestyle comes into conflict when romance and responsibility threaten to change his future.\n\nBarbara Britton stars as Betty Denton, a strong-willed woman torn between her affection for Jeff and her doubts about his inability to slow down and take life seriously. Their relationship is further complicated by outside pressures, rivalries in the oil industry, and the looming dangers of Jeff’s work in the unpredictable world of drilling and exploration.\n\nAs tensions rise, Jeff must decide between continuing his reckless habits or embracing stability and responsibility to secure both his career and his chance at lasting happiness. The climax delivers an emotional resolution that reflects the themes of ambition, courage, and the challenges of postwar American values.\n\nCast and Crew:\n• Director: Frank McDonald\n• Producer: William H. Pine, William C. Thomas\n• Screenplay: Maxwell Shane\n• Story: Frank Waters\n• Music: Darrell Calker\n• Cinematography: Ellis W. Carter\n\nStarring:\n• William Eythe as Jeff Lundy\n• Barbara Britton as Betty Denton\n• Walter Catlett as Dan Evans\n• Lloyd Corrigan as Henry Gardner\n• Minna Gombell as Mrs. Denton\n\nFilm Significance:\nMr. Reckless (1948) reflects the style and themes of Pine-Thomas Productions, often called the “Dollar Bills” for their reputation of delivering profitable, low-budget films for Paramount. Known for specializing in adventure, romance, and thrillers, their productions were streamlined but consistently entertaining, appealing to postwar audiences eager for accessible, fast-moving stories.\n\nWilliam Eythe, a Fox contract player best known for films like The Song of Bernadette (1943) and The House on 92nd Street (1945), delivers a charismatic performance as the flawed yet likable Jeff. Barbara Britton, a popular leading lady of the 1940s, adds depth and charm as the romantic counterpart. Their chemistry gives the film emotional weight despite its brisk runtime.\n\nThough modest in scale, Mr. Reckless is a fascinating cultural snapshot of late-1940s cinema, where themes of ambition, responsibility, and romance often mirrored the social dynamics of a rapidly modernizing America. The oil industry backdrop adds a sense of excitement and danger, distinguishing it from the more typical domestic romances of the era.\n\nEnhanced Public Domain Explanation:\nMr. Reckless (1948) is a public domain film, meaning it is free of copyright restrictions and available for preservation, restoration, and worldwide distribution. At Colorized Public Domain, we specialize in revitalizing these overlooked gems with digital clarity and careful colorization. This edition highlights the visual contrasts of oil fields, industrial settings, and the intimate romance between Jeff and Betty, making the drama more immersive for contemporary audiences.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white, the film captured the grit of oil drilling and the charm of postwar romance through shadowy contrasts and simple production design. The colorized edition enhances its visual appeal, adding depth to landscapes, energy to industrial scenes, and vibrancy to the costuming of its leads. This makes the film more engaging for modern viewers while preserving its original dramatic core.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more restored and colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nAt Colorized Public Domain, we restore, enhance, and share forgotten treasures of Hollywood’s Golden Age—from romantic dramas to adventure thrillers. Join our growing community of classic film lovers across the USA, Europe, and beyond as we bring new life to timeless stories.\n\n#MrReckless1948 #WilliamEythe #BarbaraBritton #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #1940sMovies #FilmRestoration #ClassicRomanceDrama #CultClassicCinema",
      "id": "q2MyDf-_sMM",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xkcsUgsDo1s",
      "title": "Mr. Reckless (1948) ROMANCE",
      "description": "Stars: William Eythe, Barbara Britton, Walter Catlett\nDirector: Frank McDonald\n\nReturning to his hometown after a long absence, an oil-well worker discovers that his sweetheart has gotten engaged to an older suitor. In an attempt to win her back, he decides to impress her with a series of daredevil oil-field stunts!",
      "id": "xkcsUgsDo1s",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lLQ_RXTd0GE",
      "title": "Mr. Reckless (1948) Dynamite drama in the oil fields | Directed by Frank McDonald",
      "description": "Two daredevil oil workers become bitter rivals for the attentions of a pretty woman.\nReturning to his hometown after a long absence, oil-well digger William Eythe discovers that his sweetheart has gotten engaged to an older suitor. In an attempt to win back his lost love, Eythe decides to impress her with a series of daredevil oil-field stunts.\n\nOriginal title: Mr. Reckless (1948)\nThis film is available with subtitles in many language options.\n\nBlack & White version: https://youtu.be/dtn0xTHGLWA\n\n\nCast:\nWilliam Eythe as Jeff Lundy\nBarbara Britton as Betty Denton\nWalter Catlett as Joel Hawkins\nMinna Gombell as Ma Hawkins\nLloyd Corrigan as Hugo Denton\nNestor Paiva as Gus\nFrank Jenks as Cab Driver\nIan MacDonald as Jim Halsey\nJames Millican as Pete\nDirector: Frank McDonald\nWriters: Maxwell Shane, Milton Raison\nGenres: Adventure, Drama, Romance\n\n\n00:00 - Full colorized movie (with subtitles)\n01:13 - Friends in Los Angeles prepare for a farewell party as they dive into the oil drilling business in Ponca Springs.\n06:25 - An unexpected engagement announcement sparks mixed feelings and gambling at the party.\n11:05 - Tensions rise as a man seeks to reconcile with his family in the oil fields.\n16:28 - Relationships intertwine in an oil field boarding house, leading to unexpected drama.\n21:43 - A night out with friends spirals into tension and heartfelt apologies.\n28:10 - Financial struggles and family dynamics intensify as a wedding looms in the oil field.\n33:56 - A man’s life hangs in the balance when he’s locked in a tank over money disputes.\n40:54 - Dramatic events in the oil field threaten a wedding and complicate relationships.\n52:05 - As relationships are tested, a risky bet is placed on recovery in the oil fields.\n54:15 - Characters face emotional turmoil as they navigate illness and impending goodbyes.\n59:44 - Love triangles lead to betrayal and heartbreak, culminating in a dramatic oil field confrontation.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "lLQ_RXTd0GE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "66 min",
    "imdbRating": "5.3",
    "imdbVotes": "114",
    "Genre": "Adventure, Drama, Romance",
    "Plot": "Returning to his hometown after a long absence, oil-well digger William Eythe discovers that his sweetheart has gotten engaged to an older suitor. In an attempt to win back his lost love, Eythe decides to impress her with a series of daredevil oil-field stunts.",
    "Director": "Frank McDonald",
    "Writer": "Maxwell Shane, Milton Raison",
    "Actors": "William Eythe, Barbara Britton, Walter Catlett",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0041767",
      "title": "Prince of Foxes",
      "year": 1949,
      "imdbRating": "6.9",
      "imdbVotes": "2,055",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042367",
      "title": "Cyrano de Bergerac",
      "year": 1950,
      "imdbRating": "7.4",
      "imdbVotes": "4,668",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037578",
      "title": "Caravan",
      "year": 1946,
      "imdbRating": "6.2",
      "imdbVotes": "256",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042464",
      "title": "The Flame and the Arrow",
      "year": 1950,
      "imdbRating": "6.8",
      "imdbVotes": "4,276",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035562",
      "title": "Wildcat",
      "year": 1942,
      "imdbRating": "5.6",
      "imdbVotes": "136",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029238",
      "title": "Midnight Court",
      "year": 1937,
      "imdbRating": "5.9",
      "imdbVotes": "124",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041177",
      "title": "The Big Sombrero",
      "year": 1949,
      "imdbRating": "5.4",
      "imdbVotes": "163",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041128",
      "title": "Apache Chief",
      "year": 1949,
      "imdbRating": "5.5",
      "imdbVotes": "63",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0045162",
      "title": "The Snows of Kilimanjaro",
      "year": 1952,
      "imdbRating": "6.1",
      "imdbVotes": "6,096",
      "language": "English, French, Spanish, Swahili",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038968",
      "title": "Song of Arizona",
      "year": 1946,
      "imdbRating": "5.5",
      "imdbVotes": "185",
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040797",
      "title": "16 Fathoms Deep",
      "year": 1948,
      "imdbRating": "5.7",
      "imdbVotes": "105",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045551",
      "title": "Beneath the 12-Mile Reef",
      "year": 1953,
      "imdbRating": "5.7",
      "imdbVotes": "1,685",
      "language": "English, Greek",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:35:03.656Z"
}