{
  "imdbId": "tt0025747",
  "title": "The Scarlet Letter",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MajesticPicturesPublicDomainTheScarletLetter",
      "id": "MajesticPicturesPublicDomainTheScarletLetter",
      "title": "The Scarlet Letter",
      "description": "An early sound adaptation of Hawthorne's novel about social mores, intolerance, and ostracism in 17th Century Massachussetts.",
      "fileSize": 1480752752,
      "addedAt": "2026-01-07T00:06:38.751Z",
      "thumbnail": "https://archive.org/services/img/MajesticPicturesPublicDomainTheScarletLetter",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 93647
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheScarletLetter720p1934",
      "id": "TheScarletLetter720p1934",
      "title": "The Scarlet Letter",
      "description": "Title: The Scarlet Letter Summary: In the seventeenth century, in Massachusetts, a young woman is forced to wear a scarlet \"A\" on her dress for bearing a child out of wedlock. Directed by: Robert G. Vignola Actors: Production Company: Larry Darmour Productions Release Date: 18 September 1934 (USA) Aspect Ratio: 1.37 : 1 At the end of the 17th century a impetuous woman of noble birth but poor arrives in Boston when it was just a village rather than a city. As she is married to an old doctor she tries to change her life.",
      "fileSize": 837581775,
      "addedAt": "2026-01-07T00:07:05.036Z",
      "thumbnail": "https://archive.org/services/img/TheScarletLetter720p1934",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 23107
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iRTdWnqLJg8",
      "id": "iRTdWnqLJg8",
      "title": "The Scarlet Letter (1934) | Colorized Public Domain Classic with Colleen Moore and Hardie Albright",
      "description": "The Scarlet Letter (1934) is an American historical drama directed by Robert G. Vignola, adapted from Nathaniel Hawthorne’s world-renowned 1850 novel of the same name. Produced during the Great Depression and released by Majestic Pictures, this pre-Code era film retells one of the most powerful and enduring stories in American literature — a tale of sin, guilt, hypocrisy, and redemption set against the backdrop of Puritan New England. Now restored and beautifully colorized by Colorized Public Domain, this edition revitalizes a cinematic treasure that connects 19th-century literature with early 20th-century Hollywood and modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nSet in 17th-century Massachusetts Bay Colony, the film follows Hester Prynne (Colleen Moore), a young woman condemned by her Puritan community after bearing a child out of wedlock. As punishment, she is forced to wear a scarlet “A” on her clothing — a symbol of her sin and shame. Despite the cruelty of her society, Hester faces her punishment with quiet dignity, becoming a figure of strength and resilience in a world dominated by rigid moral codes and unforgiving judgment.\n\nHer secret lover, Reverend Arthur Dimmesdale (Hardie Albright), is tormented by guilt and inner conflict, torn between his public role as a religious leader and his private failure to confess his part in Hester’s suffering. Meanwhile, Roger Chillingworth (Henry B. Walthall), Hester’s estranged husband, plots a slow and vengeful course, determined to expose and punish Dimmesdale for his hidden sin.\n\nAs the story unfolds, themes of love, betrayal, hypocrisy, and redemption collide in a powerful climax that has captivated audiences for generations. The film condenses Hawthorne’s novel while retaining its moral complexity, offering both an emotional human drama and a critique of oppressive social structures.\n\nCast and Crew:\n• Director: Robert G. Vignola\n• Based on the novel by Nathaniel Hawthorne\n• Cinematography: Gilbert Warrenton\n• Editing: Otis Garrett\n• Production: Majestic Pictures\n\nStarring:\n• Colleen Moore as Hester Prynne\n• Hardie Albright as Reverend Arthur Dimmesdale\n• Henry B. Walthall as Roger Chillingworth\n• Cora Sue Collins as Pearl\n• Alan Hale as Bartholomew Hockings\n• Virginia Howell as Mistress Hibbins\n\nFilm Significance:\nThis 1934 adaptation is one of the lesser-known cinematic versions of Hawthorne’s classic novel but holds a unique place in film history. Colleen Moore, once a leading star of silent-era flapper comedies, delivers one of her last screen performances here, showcasing her ability to embody gravitas, emotional depth, and resilience. Henry B. Walthall, best remembered for his role in The Birth of a Nation (1915), lends chilling presence as the vengeful Chillingworth.\n\nProduced by Majestic Pictures, a studio known for independent and low-budget productions, The Scarlet Letter (1934) reflects the trend of adapting literary classics during the Depression era to lend prestige and seriousness to Hollywood’s output. Its pre-Code sensibilities allowed for more direct explorations of sin, passion, and morality, making it more daring than later versions released under stricter censorship.\n\nEnhanced Public Domain Explanation:\nThe Scarlet Letter (1934) is now in the public domain, ensuring it can be freely shared, studied, and preserved for all time. Colorized Public Domain restores and enhances this film with high-definition clarity, digital cleaning, and professional colorization to breathe new life into a once-overlooked adaptation. Our work preserves cultural heritage while introducing it to new generations across the USA, Europe, and worldwide.\n\nWhy Watch This Colorized Edition:\nWhile the original was shot in black and white, this carefully colorized edition adds vibrancy and atmosphere that enrich the Puritan setting. From the stark severity of colonial towns to the lush forests that symbolize freedom and temptation, color brings Hawthorne’s allegorical world to life in ways never before possible. This revitalized edition makes the film more immersive for contemporary viewers while preserving its historical and literary significance.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nColorized Public Domain specializes in restoring and colorizing forgotten gems, literary adaptations, and Golden Age films. By bringing new life to these treasures, we ensure they remain accessible, engaging, and relevant for audiences around the world.\n\n#TheScarletLetter #ColleenMoore #NathanielHawthorne #PublicDomainMovie #ColorizedClassic #HistoricalDrama #FilmRestoration #GoldenAgeHollywood #1930sMovies #PreCodeHollywood",
      "addedAt": "2025-12-24T00:47:21.231Z",
      "thumbnail": "https://i.ytimg.com/vi/iRTdWnqLJg8/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYYSBlKFAwDw==&rs=AOn4CLDDMO-7H_g9q9i6AekhJUEkZCQYZA",
      "duration": 4174,
      "language": "en",
      "year": 1934,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=v8r6-2UrFEQ",
      "id": "v8r6-2UrFEQ",
      "title": "The Scarlet Letter (1934) NEW 4K RESTORATION",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Colleen Moore, Hardie Albright, Henry B. Walthall\nDirector: Robert G. Vignola\n\nIn 1700 century Puritan Massachusetts, a young woman is forced to wear a scarlet \"A\" on her dress for bearing a child out of wedlock.",
      "addedAt": "2025-12-24T01:08:06.718Z",
      "thumbnail": "https://i.ytimg.com/vi/v8r6-2UrFEQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCEnly7K1JpIwkWACC3PT18ekG9Ig",
      "duration": 4325,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-scarlet-letter-1934",
      "id": "the-scarlet-letter-1934",
      "title": "The Scarlet Letter (1934)",
      "description": "In the seventeenth century, in Massachusetts, a young woman is forced to wear a scarlet \"A\" on her dress for bearing a child out of wedlock. Watch on RetroFlix:  https://retroflix.org/the-scarlet-letter-1934/",
      "fileSize": 435292158,
      "addedAt": "2026-01-07T00:12:22.158Z",
      "thumbnail": "https://archive.org/services/img/the-scarlet-letter-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 78
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ilCFwBbRZDc",
      "id": "ilCFwBbRZDc",
      "title": "The Scarlet Letter (1934) Hers the Shame, Whose the Sin? by Nathaniel Hawthorne",
      "description": "In seventeenth-century Massachusetts, young Hester Prynne is branded with a scarlet “A,” for bearing a child out of wedlock, yet she boldly defies puritanical pressure, outwits the relentless Chillingworth, and guards Dimmesdale’s secret. Amid a whirlwind of secrets and suspense, Hester’s courage shines brighter than the letter she wears. \n\nDirector: Robert G. Vignola\nWriters: Nathaniel Hawthorne (\"The Scarlet Letter\" novel), Leonard Fields, David Silverstein\n\nColorized version https://youtu.be/fbRKaCHTSFk\n\nMain cast:\nColleen Moore – Hester Prynne\nHardie Albright – Arthur Dimmesdale\nHenry B. Walthall – Roger Chillingworth\nCora Sue Collins – Pearl\nAlan Hale – Bartholomew Hockings\nWilliam Kent – Governor Bellingham\nVirginia Howell – Mistress Hibbins\nBetty Blythe – Abigail Endicott\n\nGenres: Literary, Drama, Romance, Tragedy\nRelease date: May 11, 1934 \nFilming location: USA\n\nWatch documentary about the making of this film: https://youtu.be/XgItXiiQNHc\n\n@CultCinemaClassics​",
      "addedAt": "2025-12-27T00:30:23.448Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ilCFwBbRZDc/maxresdefault.webp",
      "duration": 4285,
      "language": "en",
      "year": 1934,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "69 min",
    "imdbRating": 5.4,
    "imdbVotes": 522,
    "Genre": "Drama, Romance",
    "Plot": "At the end of the 17th century a impetuous woman of noble birth but poor arrives in Boston when it was just a village rather than a city. As she is married to an old doctor she tries to change her life.",
    "Director": "Robert G. Vignola",
    "Writer": "Nathaniel Hawthorne, Leonard Fields, David Silverstein",
    "Actors": "Colleen Moore, Hardie Albright, Henry B. Walthall",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0012928",
    "tt0013750",
    "tt0023849",
    "tt0026863",
    "tt0025178",
    "tt0025016",
    "tt0026367",
    "tt0025323",
    "tt0025335",
    "tt0025463",
    "tt0025472",
    "tt0025610"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.158Z"
}