{
  "imdbId": "tt0030554",
  "title": "Paradise for Three",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SinnersinParadise",
      "id": "SinnersinParadise",
      "title": "Sinners in Paradise",
      "description": "A seaplane departs for China. On board are a nurse escaping a loveless marriage to do work with refugees, a woman hoping to surprise her estranged son, a wealthy heiress trying to distance herself from labor troubles, an oily politician, a moll and a mobster fleeing the wrath of the gangs they've double-crossed, two rival munitions salesmen out to cash in on the misery of war, and a fresh-faced young steward. Caught in a course-altering storm, a crash-landing destroys the plane, kills the plane's officers, and tosses the surviving passengers into the sea. They are washed ashore on an isolated island inhabited solely by mysteriously reclusive Mr. Taylor and his servant, Ping.",
      "fileSize": 1703595206,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/SinnersinParadise",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 28048
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ln8kvXMvqpw",
      "id": "Ln8kvXMvqpw",
      "title": "Sinners in Paradise (1938) | Colorized Public Domain Adventure Drama with John Boles and Madge Evans",
      "description": "Sinners in Paradise (1938) is an American adventure drama directed by James Whale, best known for his work on classics like Frankenstein and The Invisible Man. This restored and colorized public domain film delivers a unique mix of romance, survival, and moral conflict, showcasing the tense dynamics between stranded passengers who must navigate not only nature’s dangers but also their own secrets. By bringing this 1938 release into color, modern audiences in the USA, Europe, and worldwide can rediscover a lesser-known gem from Hollywood’s Golden Age.\n\nPlot Summary:\nThe story begins with a passenger plane en route to China that crashes in the South Seas. Among the survivors are a diverse group of individuals from different walks of life, each carrying hidden pasts and personal struggles. They eventually make their way to a remote island, where they encounter Jim Taylor, a reclusive American fugitive living in self-imposed exile. Suspicious yet reluctantly hospitable, Jim shelters the group while warning them about the dangers of survival in isolation.\n\nAs the survivors adjust to island life, tensions rise when their true identities and motives come to light. Love triangles emerge, criminal histories resurface, and moral boundaries are tested. Jim develops a bond with Anne Wesson, a compassionate woman whose integrity and resilience stand in contrast to the selfishness of others. This relationship challenges Jim to confront his own past and seek redemption. Meanwhile, greed and ambition threaten the fragile harmony within the group, forcing each character to choose between selfish survival and collective responsibility.\n\nThe film builds toward a climax where betrayal, violence, and sacrifice collide. The survivors’ fate rests on whether they can overcome their divisions or succumb to their darker instincts. Sinners in Paradise ultimately explores themes of morality, redemption, and the human capacity to change under extreme circumstances.\n\nCast and Crew:\n• Director: James Whale\n• Produced by: Edmund Grainger\n• Screenplay: Harold Buckley, Hugh Herbert\n• Cinematography: George Robinson\n• Editing: Arthur Hilton\n\nStarring:\n• John Boles as Jim Taylor\n• Madge Evans as Anne Wesson\n• Bruce Cabot as Robert Bain\n• Marion Martin as Thelma Chase\n• Gene Lockhart as Senator Corey\n• Nana Bryant as Mrs. Corey\n• Anthony Quinn as Ping\n• Milburn Stone as Jessup\n• Edward Earle as Captain Powell\n\nFilm Significance:\nSinners in Paradise holds historical importance as one of the lesser-remembered works of James Whale, whose reputation was defined by Universal’s horror legacy. This survival drama offered a departure from his gothic style, focusing instead on social dynamics and human frailty under pressure. While not a major box office success in 1938, the film today provides cultural insight into pre-war Hollywood storytelling and the blending of melodrama with adventure. Featuring early performances from actors like Anthony Quinn, it reflects the studio system’s approach to ensemble casting and character-driven narratives.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Sinners in Paradise remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1938 release was in black and white, consistent with the era’s production standards. While authentic to its time, many modern audiences are hesitant to watch black-and-white films. This colorized edition bridges that gap, giving the survival drama new vibrancy and emotional impact. By restoring the film with contemporary technology, we make it both historically valuable and visually appealing to today’s global audience.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#SinnersInParadise #JamesWhale #JohnBoles #MadgeEvans #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #1930sCinema #FilmRestoration #ClassicAdventure",
      "addedAt": "2025-12-24T00:47:57.891Z",
      "thumbnail": "https://i.ytimg.com/vi/Ln8kvXMvqpw/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBdKFMwDw==&rs=AOn4CLCUa-vh3oYz2lQyorIFJrvrg8e5sA",
      "duration": 3747,
      "language": "en",
      "year": 1938,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sinner-in-paradise-4-k",
      "id": "sinner-in-paradise-4-k",
      "title": "Sinners In Paradise (1938) [Colorized, 4K, 60FPS]",
      "description": "Sinners in paradise is a 1938  black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 4600706013,
      "addedAt": "2026-01-07T00:11:24.928Z",
      "thumbnail": "https://archive.org/services/img/sinner-in-paradise-4-k",
      "collection": "feature_films",
      "downloads": 232
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sinners-in-paradise-1938",
      "id": "sinners-in-paradise-1938",
      "title": "Sinners in Paradise (1938)",
      "description": "The survivors from a plane crash are washed up on an island where the only inhabitants are Mr. Taylor and his servant, Ping. The mismatched group must learn to get along and work together if they are to convince Taylor to let them borrow his boat and return to the main land. Watch on RetroFlix:  https://retroflix.org/sinners-in-paradise-1938/",
      "fileSize": 295976770,
      "addedAt": "2026-01-07T00:11:24.928Z",
      "thumbnail": "https://archive.org/services/img/sinners-in-paradise-1938",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 194
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CZPXV9AeRY4",
      "id": "CZPXV9AeRY4",
      "title": "Sinners in Paradise (1938) ADVENTURE",
      "description": "Stars: Madge Evans, John Boles and Bruce Cabot \nDirector: James Whale\n\nFrom the director of Frankenstein! During a violent storm, an airplane bound for China crash-lands on an uncharted South Sea island. All of the passengers survive unscathed but now must fight for their survival.",
      "addedAt": "2025-12-26T23:51:09.409Z",
      "thumbnail": "https://i.ytimg.com/vi/CZPXV9AeRY4/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLC_GYhYuWv8m3TThk5EHvhysENb8g",
      "duration": 3813,
      "language": "en",
      "year": 1938,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Q6rUC5ISwL4",
      "id": "Q6rUC5ISwL4",
      "title": "Sinners in Paradise (1938) Directed by James Whale | Tropical Trap: Redemption or Ruin?",
      "description": "The survivors from a plane crash are washed up on an island where the only inhabitants are Mr. Taylor and his servant, Ping. The mismatched group must learn to get along and work together if they are to convince Taylor to let them borrow his boat and return to the mainland.\n\nOriginal title: Sinners in Paradise (1938)\nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/Qe-EL72kQ1k\n\n\nDirector: James Whale\nWriters: Lester Cole , Harold Buckley \nStars: Madge Evans, John Boles, Bruce Cabot \nGenres: Colorized, Classics, Adventure, Drama, Romance\n\n\n00:00 Full Movie (with subtitles)\n10:32 A group faces a storm while flying over the Pacific Ocean, leading to uncertainty and fear.\n15:48 Survivors stranded on an uninhabited island encounter resistance from a mysterious resident.\n20:57 Unexpected island companions organize tasks for survival after a plane crash.\n26:29 A group of people stranded on an island must decide who gets to leave on a boat with limited space.\n36:33 Tragic events unfold as a doctor's past catches up with him, leading to a woman's death.\n40:43 Discussion on island life, suspicions of criminal past, and plans to reach passing ships.\n46:10 A group on an island faces challenges and conflicts while contemplating their future.\n50:52 Drama unfolds on a remote island as characters face personal conflicts and strive for a better future together.\n57:51 A group stranded on an island burns money, discovers a boat, and plans for the future.\n1:01:50 A decision is made to face life's challenges together instead of running away.\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:30.298Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Q6rUC5ISwL4/maxresdefault.webp",
      "duration": 3801,
      "language": "en",
      "year": 1938,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "78 min",
    "imdbRating": 7,
    "imdbVotes": 597,
    "Genre": "Romance, Comedy",
    "Plot": "A wealthy business man, out of touch with real folks, decides to mingle and see what it is really all about.",
    "Director": "Edward Buzzell",
    "Writer": "Erich Kästner, George Oppenheimer, Harry Ruskin",
    "Actors": "Frank Morgan, Robert Young, Mary Astor",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027293",
    "tt0028102",
    "tt0451808",
    "tt0030172",
    "tt0030721",
    "tt0030063",
    "tt0030540",
    "tt0030637",
    "tt0029861",
    "tt0029885",
    "tt0029929",
    "tt0030400"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.928Z"
}