{
  "imdbId": "tt0006309",
  "title": "A Woman",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AWoman1915",
      "title": "Charlie Chaplin's \"A Woman\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"A Woman\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin           Starring                     Charlie Chaplin, Edna Purviance, Charles Inslee, Marta Golden Cinematography        Harry Ensign Distributed by           V-L-S-E, Incorporated Release date               July 12, 1915 Running time             26 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "AWoman1915"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-woman-1915",
      "title": "A Woman (1915)",
      "description": "A Woman was Charlie Chaplin’s ninth film for Essanay Films. It was made in Los Angeles at the Majestic Studio and released in 1915. Watch on RetroFlix.org:  https://retroflix.org/a-woman-1915/",
      "id": "a-woman-1915"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-woman-1915-directed-by-charlie-chaplin",
      "title": "A Woman (1915) Directed By Charlie Chaplin",
      "description": "A Woman French theatrical poster to A Woman Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Charles Inslee Marta Golden Edna Purviance Leo White Cinematography Harry Ensign Edited by Charlie Chaplin Music by Eric James (Kino video release) Distributed by Essanay Studios General Film Company Release date July 12, 1915 Running time 26 minutes Country United States Languages Silent film English (original intertitles) A Woman was Charlie Chaplin 's ninth film for Essanay Films . It was made in Los Angeles at the Majestic Studio and released in 1915 . Plot A well-to-do family of three is asleep on a park bench. The father ( Charles Insley ) is awakened when a pretty girl ( Margie Reiger ) trips over his outstretched feet. The father is an incorrigible womanizer and immediately follows the girl to another park bench while his wife ( Marta Golden ) and adult daughter ( Edna Purviance ) remain asleep. He briefly departs to buy himself and the girl drinks from a refreshment stand. As soon as he leaves, Charlie arrives at the park bench where the pretty girl is seated. Charlie attempts to flirt with her—and the girl seems to enjoy his company. The father returns with two bottled drinks and jealously smashes one over Charlie's head, knocking him senseless. The father escorts the girl away. The girl tells the father she wants to play hide-and-seek. He agrees. She blindfolds him and walks away. Charlie regains his senses and comes across the blindfolded father. He leads him to the edge of a pond with his cane. The father removes his blindfold moments before Charlie kicks him into the water. (A passing park policeman who tries to intervene gets kicked into the pond too.) Charlie comes across the father's wife and daughter and makes a favorable impression. They invite him to their house for refreshments. Meanwhile, the father befriends another man in the park whom Charlie has earlier annoyed ( Billy Armstrong ). Together they go to the father's home. When snacks are put on the table, Charlie demonstrates a unique way of serving doughnuts and is having a merry time when the father sees him. The other man, who is flirting with the father's wife in the kitchen, sees Charlie too. Both men try to corral Charlie, but he knocks them cold—but not before his trousers are ripped off his body. Charlie initially runs into the street without any pants, but the commotion he creates outside causes him to retreat back into the house. Charlie goes to an upstairs room where he conveniently sees a woman's dress suit on a mannequin. He changes into it and is seen in a hallway by the daughter. Instead of being angry, the daughter laughs at the spectacle and suggests Charlie continue with the charade of dressing as a female to fool her flirtatious father. She even offers him a pair of female shoes and a place to shave his mustache. The female Charlie is introduced as a college chum of the daughter, and succeeds in attracting the attention of both the father and his friend. The father resents the competition and angrily knocks his friend out of the house. Charlie's true gender is eventually revealed, however, when his skirt falls off. Another fight ensues. Charlie and the father seem to have made peace, but the father reacts angrily when Charlie wants to court his daughter. Charlie is thrown out of the house and lands alongside the other man where another battle begins. Notes Censors initially refused permission for A Woman to be shown in Great Britain. The reason is not entirely clear, but it could have been because a married man is trying to seduce a much younger woman or because of the transvestitism hinted at by Charlie disguising himself as a female. The ban on the film was lifted in 1916. Margie Reiger, the youthful actress who played the pretty girl in the park, is a bit of a mystery. Her acting credits show 13 appearances in silent films—all in 1915. Why her career suddenly ended and what became of her is unknown. Furthermore, no researcher has been able to find a date of birth or death for her. A Woman is the third and final time that Chaplin played the role of a female on film. He played a woman in two Keystone films: The Masquerader and A Busy Day . Cast Charlie Chaplin - Gentleman/'Nora Nettlerash' Edna Purviance - Daughter of the House Charles Inslee - Her Father Marta Golden - Her Mother Margie Reiger - Father's Lady Friend Billy Armstrong - Father's Friend Leo White - Idler in the Park From Wikipedia, the free encyclopedia",
      "id": "a-woman-1915-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-woman",
      "title": "A Woman",
      "id": "silent-a-woman"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "26 min",
    "imdbRating": "6.4",
    "imdbVotes": "1,990",
    "Genre": "Short, Comedy",
    "Plot": "Mother, Father and Daughter go to the park. The women dose off on a bench while the father plays a hide-and-seek game with a girl, blindfolded. Charlie leads him into a lake. Both dozing ladies on the bench fall for Charlie and invite him for dinner. The father returns home with a friend. Charlie rushes upstairs and dresses like a woman, shaving his moustache. Both men fall for Charlie.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Billy Armstrong, Marta Golden",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0006313",
      "title": "Work",
      "year": 1915,
      "imdbRating": "6.2",
      "imdbVotes": "1,891",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004936",
      "title": "The Bank",
      "year": 1915,
      "imdbRating": "6.6",
      "imdbVotes": "2,325",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005044",
      "title": "By the Sea",
      "year": 1915,
      "imdbRating": "5.7",
      "imdbVotes": "1,967",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005489",
      "title": "His New Job",
      "year": 1915,
      "imdbRating": "6.0",
      "imdbVotes": "2,089",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005542",
      "title": "In the Park",
      "year": 1915,
      "imdbRating": "5.6",
      "imdbVotes": "1,782",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006177",
      "title": "The Tramp",
      "year": 1915,
      "imdbRating": "6.9",
      "imdbVotes": "3,953",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006032",
      "title": "Shanghaied",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "1,732",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005812",
      "title": "A Night in the Show",
      "year": 1915,
      "imdbRating": "6.4",
      "imdbVotes": "2,446",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005571",
      "title": "A Jitney Elopement",
      "year": 1915,
      "imdbRating": "5.9",
      "imdbVotes": "1,464",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005810",
      "title": "A Night Out",
      "year": 1915,
      "imdbRating": "5.9",
      "imdbVotes": "1,915",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005074",
      "title": "The Champion",
      "year": 1915,
      "imdbRating": "6.7",
      "imdbVotes": "2,846",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}