{
  "movieId": "tt0005060",
  "title": "Carmen",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CarmenCBD",
      "id": "CarmenCBD",
      "title": "Carmen",
      "description": "Cecil B Demille's 1915 film of Prosper Merimee's 1845 novella (which was the basis of Bizet's famous opera.) Carmen, a gypsy woman, seduced lawyer Don Jose in an attempt to assist her clan's smuggling trade. Don Jose is obsessed with Carmen and turns to crime to maintain her attentions.",
      "fileSize": 1154728325,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CarmenCBD",
      "language": "eng",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 58534
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BurlesqueOnCarmen",
      "id": "BurlesqueOnCarmen",
      "title": "Charlie Chaplin's \"Burlesque on Carmen\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"Burlesque on Carmen\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin, from the novella Carmen by Prosper Mérimée           Starring                     Charlie Chaplin, Edna Purviance, Jack Henderson, Leo White Cinematography        Roland Totheroh Distributed by           V-L-S-E, General Film Company Release date               December 18, 1915 Running time             31 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 401554954,
      "addedAt": "2026-01-07T00:06:14.040Z",
      "thumbnail": "https://archive.org/services/img/BurlesqueOnCarmen",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 13633
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-burlesque-on-carmen-1915",
      "id": "a-burlesque-on-carmen-1915",
      "title": "A Burlesque On Carmen (1915)",
      "description": "A Burlesque on Carmen is Charlie Chaplin’s thirteenth film for Essanay Studios, originally released as Carmen on December 18, 1915. Chaplin played the leading man and Edna Purviance played Carmen. The film is a parody of Cecil B. DeMille’s Carmen 1915, which was itself an interpretation of the popular novella Carmen by Prosper Mérimée. Watch on RetroFlix.org:  https://retroflix.org/a-burlesque-on-carmen-1915/",
      "fileSize": 561856738,
      "addedAt": "2026-01-07T00:07:18.437Z",
      "thumbnail": "https://archive.org/services/img/a-burlesque-on-carmen-1915",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 253
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-burlesque-on-carmen-1915-directed-by-charlie-chaplin",
      "id": "a-burlesque-on-carmen-1915-directed-by-charlie-chaplin",
      "title": "A Burlesque On Carmen (1915) Directed By Charlie Chaplin",
      "description": "A Burlesque on Carmen Film poster Directed by Charlie Chaplin Written by Prosper Mérimée Charlie Chaplin Produced by Jess Robbins George K. Spoor Starring Charlie Chaplin Jack Henderson Edna Purviance Leo White Cinematography Roland Totheroh Edited by Charlie Chaplin Music by Hugo Riesenfeld Production company Essanay Studios Distributed by General Film Company Release date December 18, 1915 Running time 31 minutes (1915) 44 minutes (1928 sound reissue) Country United States Languages Silent ( English intertitles) A Burlesque on Carmen is Charlie Chaplin 's thirteenth film for Essanay Studios , originally released as Carmen on December 18, 1915. Chaplin played the leading man and Edna Purviance played Carmen. The film is a parody of Cecil B. DeMille 's Carmen 1915, which was itself an interpretation of the popular novella Carmen by Prosper Mérimée . [ 1 ] Chaplin's original version was a tightly paced two-reeler, but in 1916 after he had moved to Mutual , Essanay reworked the film into a four-reel version called A Burlesque on Carmen , or Charlie Chaplin's Burlesque on Carmen , adding discarded footage and new scenes involving a subplot about a gypsy character played by Ben Turpin . [ 1 ] This longer version was deeply flawed in pacing and continuity, and not representative of Chaplin's initial conception. Chaplin sued Essanay but failed to stop the distribution of the longer version; Essanay's tampering with this and other of his films contributed significantly to Chaplin's bitterness about his time there. The presence of Essanay's badly redone version is likely the reason that A Burlesque on Carmen is among the least known of Chaplin's early works. Historian Ted Okuda calls the two-reel original version the best film of Chaplin's Essanay period, but derides the longer version as the worst. [ 2 ] Further reissues followed, for instance a synchronized sound version in 1928 by Quality Amusement Corporation. It was re-edited from the 1916 Essanay reissue, with a newly shot introduction written by newspaper columnist Duke Bakrak. This version, with rewritten title cards, poor sequencing, and \"fuzzy\" in appearance from generation loss , can be found today on some budget home video releases. [ 1 ] Film preservationist David Shepard studied Chaplin's court transcripts and other evidence to more closely reproduce the original Chaplin cut. [ 2 ] This version was released on DVD by Image Entertainment in 1999 [ 3 ] and has since been restored a second time in HD. [ 4 ] Background The story of Carmen was very popular in the 1910s, and two films under this title were released earlier in 1915. One was directed by Raoul Walsh , in which stage actress Theda Bara played Carmen, and the other by Cecil B. DeMille , in which the part was played by opera star Geraldine Farrar . [ 1 ] DeMille's film received positive reviews [ 5 ] but Chaplin thought it was ripe for parody. Synopsis 1916 advertisement Carmen, a gypsy seductress is sent to convince Darn Hosiery, the goofy officer in charge of guarding one of the entrances to the city of Sevilla, to allow a smuggling run. She first tries to bribe him but he takes the money and refused to let the smuggled goods in. She then invites him to Lillas Pastia's inn where she seduces him. After a fight at the tobacco factory where Carmen works, he has to arrest her but later lets her escape. At Lillas Pastia's inn, he kills an officer who is also in love with her and has to go into hiding and he joins the gang of smugglers. Carmen meets the famous toreador Escamillo and falls in love with him. She accompanies him to a bullfight but Darn Hosiery waits for her and when she tells him that she no longer loves him, he stabs her to death. But it is not for real, Chaplin shows that the knife was fake and both smile at the camera. Review In reviewing the four-reel version of this film that Essanay released in April 1916, four months after Chaplin's contract had expired with the studio, Julian Johnson of Photoplay panned the lengthy re-release of this comedy. Johnson declared, \"In two reels this would be a characteristic Chaplin uproar. Four reels is watering the cream.\" Cast Purviance and Chaplin Charlie Chaplin - Darn Hosiery Edna Purviance - Carmen Jack Henderson - Lillas Pastia Leo White - Morales, Officer of the Guard John Rand - Escamillo the Toreador May White - Frasquita Bud Jamison - Soldier of the Guard Lawrence A. Bowes - Gypsy Frank J. Coleman - Soldier Production In his sequencing, Chaplin followed closely the structure of the DeMille production, using very similar sets and costumes, and he used Riesenfeld's music. At the end, Chaplin indulges in an early example of breaking the fourth wall , turning to the camera to show laughingly that his character had not really killed Carmen. [ 6 ] The film was released as a two-reeler at the end of 1915, when Chaplin's contract with Essanay Studios was up. After he had left, the studio added two reels' worth of non-Chaplin material and re-released the film in 1916. [ 1 ] Music David Shepard's 1999 restoration was released with a Robert Israel score, based on Bizet's music. A score was commissioned from Timothy Brock by Teatro de la Zarzuela de Madrid , and released in 2013 by the Cineteca di Bologna and Lobster Films for their Chaplin Essanay Project restoration. Brock also based his score on the opera by Bizet, but performed in a 1920s style. Both versions have been released numerous times on home video. [ 3 ] [ 4 ] References 1 \"Charlie Chaplin Collectors' Guide: A Burlesque on Carmen (1915)\" . Brenton Film . 6 August 2018 . Retrieved August 6, 2018 . 2 Okuda, Ted (2005). Charlie Chaplin at Keystone and Essanay: Dawn of the Tramp . iUniverse. pp. 138–42. ISBN   9780595365982 . 3 \"Charlie Chaplin Collectors' Guide: Essanay and Mutual 1980s–2000s restorations\" . Brenton Film . 21 May 2018 . Retrieved July 31, 2018 . 4 \"Charlie Chaplin Collectors' Guide: Essanay and Mutual restored in HD\" . Brenton Film . 21 May 2018 . Retrieved July 31, 2018 . 5 Anderson, Gillian B. (2005). \"Geraldine Farrar and Cecil B. DeMille\" . In Christopher Perriam, Ann Davies (ed.). Carmen: From Silent Film to MTV . Rodopi. p. 26. ISBN   9789042019645 . 6 \"Burlesque on Carmen (1915)\" . A Cinema History . Retrieved 10 March 2015 . From Wikipedia, the free encyclopedia",
      "fileSize": 399582910,
      "addedAt": "2026-01-07T00:07:18.437Z",
      "thumbnail": "https://archive.org/services/img/a-burlesque-on-carmen-1915-directed-by-charlie-chaplin",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 218
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CC_1915_12_18_ABurlesqueOnCarmen",
      "id": "CC_1915_12_18_ABurlesqueOnCarmen",
      "title": "Charlie Chaplin's \"A Burlesque On Carmen\"",
      "description": [
        "Charlie Chaplin's 48th Film Released Dec. 18 1915 Charlie Chaplin's Burlesque on Carmen was Chaplin's 13th film for Essanay Films. It was released in 1915 and then later recut into a different version in 1916. Charlie Chaplin played Dain Hosiery and Edna Purviance played Carmen. Carmen was very popular at this time and one of the reasons Chaplin decided to create his own comedy version on the opera. Theda Bara had recently played the part in a film version in 1915. http://www.imdb.com/title/tt0005077/",
        "Charlie Chaplin In The Internet Archive http://www.archive.org/details/CC_1914_02_02_MakingALiving http://www.archive.org/details/CC_1914_02_07_KidsAutoRaceAtVenice http://www.archive.org/details/CC_1914_02_09_MabelsStrangePredicament http://www.archive.org/details/CC_1914_02_28_BetweenShowers http://www.archive.org/details/CC_1914_03_02_FilmJohnny http://www.archive.org/details/CC_1914_03_16_HisFavoritePasttime http://www.archive.org/details/CC_1914_03_26_CruelCruelLove http://www.archive.org/details/CC_1914_04_04_TheLandladysPet http://www.archive.org/details/CC_1914_04_20_TwentyMinutesofLove http://www.archive.org/details/CC_1914_04_27_CaughtinaCaberet http://www.archive.org/details/CC_1914_05_07_ABusyDay http://www.archive.org/details/CC_1914_06_01_TheFatalMallet http://www.archive.org/details/CC_1914_06_11_TheKnockout http://www.archive.org/details/CC_1914_06_13_MabelsBusyDay http://www.archive.org/details/CC_1914_06_20_CharlottEtLeMannequin http://www.archive.org/details/CC_1914_07_09_LaffingGas http://www.archive.org/details/CC_1914_08_01_CharolotGargonDeTheater http://www.archive.org/details/CC_1914_08_10_FaceOnTheBarroomFloor http://www.archive.org/details/CC_1914_08_13_CharliesRecreation http://www.archive.org/details/CC_1914_08_27_TheMasquerader http://www.archive.org/details/CC_1914_08_31_TheGoodforNothing http://www.archive.org/details/CC_1914_09_07_TheRounders http://www.archive.org/details/CC_1914_09_14_TheNewJanitor http://www.archive.org/details/CC_1914_10_10_TheRivalMashers http://www.archive.org/details/CC_1914_10_26_DoughandDynamite http://www.archive.org/details/CC_1914_10_29_CharlottMabelAuxCourses http://www.archive.org/details/CC_1914_11_14_TilliesPuncturedRomance http://www.archive.org/details/CC_1914_11_07_MusicalTramps http://www.archive.org/details/CC_1914_11_09_HisTrystingPlace http://www.archive.org/details/CC_1914_12_05_AFairExchange http://www.archive.org/details/CC_1914_12_07_HisPrehistoricpast http://www.archive.org/details/CC_1915_02_01_HisNewJob http://www.archive.org/details/CC_1915_02_15_ANightOut http://www.archive.org/details/CC_1915_03_01_TheChampion http://www.archive.org/details/CC_1915_03_18_InThePark http://www.archive.org/details/CC_1915_04_11_TheTramp http://www.archive.org/details/CC_1915_04_29_ByTheSea http://www.archive.org/details/CC_1915_06_21_Work http://www.archive.org/details/CC_1915_07_12_AWoman http://www.archive.org/details/CC_1915_08_09_TheBank http://www.archive.org/details/CC_1915_10_04_CharlieShanghaied http://www.archive.org/details/CC_1915_11_20_ANightInTheShow http://www.archive.org/details/CC_1915_12_18_ABurlesqueOnCarmen http://www.archive.org/details/CC_1916_05_15_TheFloorwalker http://www.archive.org/details/CC_1916_05_27_Police http://www.archive.org/details/CC_1916_06_12_TheFireman http://www.archive.org/details/CC_1916_07_10_TheVagabond http://www.archive.org/details/CC_1916_08_07_One_A_M http://www.archive.org/details/CC_1916_09_04_TheCount http://www.archive.org/details/CC_1916_10_02_ThePawnshop http://www.archive.org/details/CC_1916_11_13_BehindtheScreen http://www.archive.org/details/CC_1916_12_04_TheRink http://www.archive.org/details/CC_1917_04_16_TheCure http://www.archive.org/details/CC_1917_06_17_TheImmigrant http://www.archive.org/details/CC_1917_10_22_TheAdventurer http://www.archive.org/details/CC_1918_09_29_TheBond http://www.archive.org/details/CC_1918_10_20_ShoulderArms http://www.archive.org/details/CC_1918_xx_xx_TripleTrouble http://www.archive.org/details/CC_1919_06_15_Sunnyside http://www.archive.org/details/CC_1919_12_15_ADaysPleasure __________________________________________________"
      ],
      "fileSize": 826833155,
      "addedAt": "2026-01-07T00:06:14.040Z",
      "thumbnail": "https://archive.org/services/img/CC_1915_12_18_ABurlesqueOnCarmen",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 387480
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "59 min",
    "imdbRating": 6.3,
    "imdbVotes": 1040,
    "Genre": "Drama",
    "Plot": "A group of gypsy smugglers are frustrated in their attempts to bring their contraband into the city by Don Jose, an incorruptible officer in the Civil Guard. In order to help her kinsmen, the sultry Carmen seduces him, persuading him to abandon his post and look the other way. When his infatuation leads him to kill a fellow guardsman in order to prevent her arrest, he becomes a wanted fugitive. The capricious, fickle Carmen resents his possessiveness and leaves him for a famous toreador in Seville. Obsessed and frustrated, a distraught Don Jose follows her to the bullring with tragic consequences.",
    "Director": "Cecil B. DeMille",
    "Writer": "Prosper Mérimée, William C. de Mille",
    "Actors": "Geraldine Farrar, Wallace Reid, Pedro de Cordoba",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008150",
    "tt0005078",
    "tt0005059",
    "tt0008519",
    "tt0011909",
    "tt0009796",
    "tt0010137",
    "tt0010418",
    "tt0008786",
    "tt0005246",
    "tt0013372",
    "tt0011865"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.437Z"
}