{
  "imdbId": "tt0023040",
  "title": "Hypnotized",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hypnotized-1932",
      "id": "hypnotized-1932",
      "title": "Hypnotized",
      "description": "A feature length comedy, produced and directed by Mack Sennett and starring blackface comedy team Moran and Mack (The Two Black Crows), famous for their Columbia recordings including their best-selling \"early bird gets the worm\" routine.  The film concerns a lowly circus worker (Wallace Ford) who becomes wealthy after winning a sweepstakes. He proposes marriage to his Hungarian girlfriend (Maria Alba) but is kidnapped, along with his friend, by a sinister hypnotist (Ernest Torrence) who aims to steal his fortune. Though billed as a Moran and Mack comedy, George Moran only appears in three sequences during the first half of the film, leaving his comedy partner Charles Mack to carry the rest of the film. Hypnotized features a who's who of comedy including Charles Murray ( The Cohens and Kellys ), Herman Bing, Marjorie Beebe and an unbilled Hattie McDaniel.  Considered by many to be among the worst films ever made, Hypnotized is actually far better than its dubious reputation and features quite a few laughs, animal antics and mesmeric fun. This film served as Mack Sennett's final feature film and within two years both Charles Mack and Ernest Torrence had both passed away.  Released by E.W. Hammons' World Wide Pictures, Hypnotized is one of the most bizarre and surreal comedies produced during the 1930s and also one of the most politically incorrect. Far from a classic, Hypnotized is a fun comedy from the man that brought you the Keystone Kops.",
      "fileSize": 3015819295,
      "addedAt": "2026-01-07T00:08:46.615Z",
      "thumbnail": "https://archive.org/services/img/hypnotized-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 364
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "58 min",
    "imdbRating": 4.9,
    "imdbVotes": 45,
    "Genre": "Comedy",
    "Plot": "A circus worker wins a sweepstakes prize of $150,000 and must travel to England to present his ticket and collect his winnings. He books passage on a transatlantic liner, but on board is a shady hypnotist who hears about the man's good fortune. He manages to get a chance to hypnotize the winner and then takes his ticket, after which he disappears. When the man wakes up and realizes his ticket has been stolen, he sets out to find the phony \"professor\" and reclaim his ticket.",
    "Director": "Mack Sennett",
    "Writer": "Felix Adler, Lewis R. Foster, Thomas J. Geraghty",
    "Actors": "George Moran, Charles Mack, Ernest Torrence",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0228331",
    "tt0020237",
    "tt0019682",
    "tt0019938",
    "tt0002133",
    "tt0003177",
    "tt0002501",
    "tt0003417",
    "tt0002280",
    "tt0002663",
    "tt0002755",
    "tt0003733"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.615Z"
}