{
  "movieId": "tt0037972",
  "title": "Paris Underground",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mp11029875",
      "id": "mp11029875",
      "title": "Paris Underground",
      "description": "Title: Paris Underground Summary: Among the terrified refugees jamming the roads out of Paris in 1940 are Kitty de Mornay, a rich American divorced from her French husband, and her companion Emmyline (Emmy) Quayle. A German... Directed by: Gregory Ratoff Actors: Constance Bennett, Gracie Fields, George Rigaud Production Company: Constance Bennett Productions Release Date: 19 October 1945 (USA) Aspect Ratio: 1.37 : 1 Among the terrified refugees jamming the roads out of Paris in 1940 are Kitty de Mornay, a rich American divorced from her French husband, and her companion Emmyline (Emmy) Quayle. A German patrol orders their car back to Paris and, en-route, they stop at an inn where they find a wounded RAF flyer, Lieutenant Gray. They hide him in the luggage compartment of their car. While attempting to repair a flat tire, they are accosted by Gestapo Captain Kurt von Webber. He drives them to Emmy's apartment. Later, with the help of Kitty's estranged husband, Andre de Mornay, a member of the French underground movement, Kitty and Emmy smuggle Lt. Gray out of Paris to safety. Since they now have means of getting to unoccupied France they contact a priest who is harboring many RAF fliers. Funeral processions are allowed across the border unchallenged by the German sentries, and Kitty and Emmy stage one in which their RAF men pose as mourners. Von Weber suspects the women, and he plants a spy in ...",
      "fileSize": 783166535,
      "addedAt": "2026-01-07T00:09:54.331Z",
      "thumbnail": "https://archive.org/services/img/mp11029875",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 2512
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "97 min",
    "imdbRating": 6.6,
    "imdbVotes": 333,
    "Genre": "Action, Drama, Mystery",
    "Plot": "Among the terrified refugees jamming the roads out of Paris in 1940 are Kitty de Mornay, a rich American divorced from her French husband, and her companion Emmyline (Emmy) Quayle. A German patrol orders their car back to Paris and, en-route, they stop at an inn where they find a wounded RAF flyer, Lieutenant Gray. They hide him in the luggage compartment of their car. While attempting to repair a flat tire, they are accosted by Gestapo Captain Kurt von Webber. He drives them to Emmy's apartment. Later, with the help of Kitty's estranged husband, Andre de Mornay, a member of the French underground movement, Kitty and Emmy smuggle Lt. Gray out of Paris to safety. Since they now have means of getting to unoccupied France they contact a priest who is harboring many RAF fliers. Funeral processions are allowed across the border unchallenged by the German sentries, and Kitty and Emmy stage one in which their RAF men pose as mourners. Von Weber suspects the women, and he plants a spy in Emmy's flat.",
    "Director": "Gregory Ratoff",
    "Writer": "Etta Shiber, Boris Ingster, Gertrude Purcell",
    "Actors": "Constance Bennett, Gracie Fields, Jorge Rigaud",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    "tt0037089",
    "tt0037777",
    "tt0031778",
    "tt0025699",
    "tt0025830",
    "tt0037701",
    "tt0037538",
    "tt0028907",
    "tt0037038",
    "tt1701218",
    "tt0037954",
    "tt0038071"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.331Z"
}