{
  "imdbId": "tt0024561",
  "title": "The Sin of Nora Moran",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheSinofNoraMoran",
      "title": "The Sin of Nora Moran",
      "description": "Nora Moran (Zita Johann), a young woman with a difficult and tragic past, is sentenced to die for a murder that she did not commit. She could easily reveal the truth and save her own life, if only it would not damage the lives, careers and reputations of those whom she loves.",
      "id": "TheSinofNoraMoran"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wWfXVJpMcdE",
      "title": "The Sin of Nora Moran (1933) | Colorized Public Domain Pre-Code Melodrama with Zita Johann",
      "description": "The Sin of Nora Moran (1933) is an American pre-Code melodrama directed by Phil Goldstone. This restored and colorized public domain classic is one of the earliest examples of a film told through nonlinear narrative and psychological exploration, setting it apart from many of its contemporaries. Originally produced on a modest budget by Majestic Pictures, the film gained recognition over the decades for its experimental structure, tragic storyline, and the haunting performance of its lead actress, Zita Johann. By restoring this forgotten gem in full color, Colorized Public Domain brings it to modern audiences in the United States, Europe, and beyond—bridging the gap between 1930s cinematic innovation and contemporary viewing preferences.\n\nPlot Summary:\nNora Moran (Zita Johann) is a young woman who finds herself imprisoned and sentenced to death for a crime she did not commit. The story, told through flashbacks and dream-like sequences, unravels the tragic circumstances of her life. Nora, once an innocent girl, becomes entangled with political figures and manipulative men who exploit her vulnerability. Her downfall begins when she falls in love with Governor Bill Crawford (Paul Cavanagh), a powerful but conflicted man whose inability to protect her leads to disaster.\nTo shield the governor and others from scandal, Nora accepts blame for a murder she did not commit. Her fate is further complicated by District Attorney John Grant (Alan Dinehart), whose ambitions and loyalties prevent justice from being served. The film’s nonlinear storytelling blurs the line between memory, dream, and reality, emphasizing Nora’s inner torment. Ultimately, her sacrifice and silence expose the corruption of those around her while highlighting themes of love, betrayal, and injustice.\n\nCast and Crew:\n• Director: Phil Goldstone\n• Producer: Phil Goldstone\n• Screenplay: Willis Kent, based on a story by Willis Kent Productions\n• Cinematography: Ira H. Morgan\n• Editing: Holbrook N. Todd\n\nStarring:\n• Zita Johann as Nora Moran\n• Paul Cavanagh as Governor Bill Crawford\n• Alan Dinehart as District Attorney John Grant\n• John Miljan as District Attorney Crawford\n• Claire Du Brey as Mrs. Crawford\n• Paul Fix as Prison Guard\n\nFilm Significance:\nThe Sin of Nora Moran stands out for its experimental use of narrative structure and its bold engagement with themes of female sacrifice, political corruption, and personal morality. Released during the pre-Code era, the film benefited from fewer restrictions on its mature subject matter, addressing topics of sexuality, power dynamics, and injustice more openly than films made after the enforcement of the Production Code. Though largely overlooked upon release, it later earned recognition from film historians for its influence and unique approach to storytelling. Its haunting promotional poster, created by artist Alberto Vargas, became one of the most famous pieces of early Hollywood advertising art, further cementing the film’s place in cinema history.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Sin of Nora Moran remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1933 release was black and white, reflecting the low-budget production standards of independent studios during the early 1930s. While historically authentic, many modern viewers tend to skip past black-and-white films. By offering a restored and colorized edition, this version revitalizes the emotional depth of Nora’s tragedy and brings visual life to a film often overshadowed by studio productions of its time. This edition ensures that the innovative storytelling and timeless themes of love, betrayal, and sacrifice resonate with contemporary audiences who value both cinematic history and engaging storytelling.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from pre-Code melodramas to forgotten B-movies and culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheSinOfNoraMoran #ZitaJohann #PreCodeHollywood #1930sCinema #PublicDomainMovie #ColorizedClassic #FilmRestoration #ClassicMelodrama",
      "id": "wWfXVJpMcdE",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XiJe1ZS44bs",
      "title": "The Sin of Nora Moran (1933) PRE-CODE HOLLYWOOD",
      "description": "Stars: Zita Johann, John Miljan, Alan Dinehart\nDirector: Phil Goldstone\n\nA young woman with a difficult and tragic past, is sentenced to die for a murder that she did not commit. She could easily reveal the truth and save her own life, if only it would not damage the lives, careers and reputations of those whom she loves.",
      "id": "XiJe1ZS44bs",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "65 min",
    "imdbRating": "6.8",
    "imdbVotes": "755",
    "Genre": "Adventure, Crime, Drama",
    "Plot": "Nora Moran, a young woman with a difficult and tragic past, is sentenced to die for a murder that she did not commit. She could easily reveal the truth and save her own life, if only it would not damage the lives, careers and reputations of those who she loves.",
    "Director": "Phil Goldstone",
    "Writer": "W. Maxwell Goodhue, Frances Hyland",
    "Actors": "Zita Johann, John Miljan, Alan Dinehart",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0024724",
      "title": "Ein Unsichtbarer geht durch die Stadt",
      "year": 1933,
      "imdbRating": "5.4",
      "imdbVotes": "71",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024199",
      "title": "Jungle Bride",
      "year": 1933,
      "imdbRating": "5.0",
      "imdbVotes": "245",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024868",
      "title": "Before Midnight",
      "year": 1933,
      "imdbRating": "5.9",
      "imdbVotes": "315",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025921",
      "title": "Twin Husbands",
      "year": 1933,
      "imdbRating": "6.4",
      "imdbVotes": "115",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021281",
      "title": "Raffles",
      "year": 1930,
      "imdbRating": "6.4",
      "imdbVotes": "1,169",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0128844",
      "title": "Windjammer",
      "year": 1937,
      "imdbRating": "5.5",
      "imdbVotes": "140",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035317",
      "title": "Sherlock Holmes and the Secret Weapon",
      "year": 1942,
      "imdbRating": "6.5",
      "imdbVotes": "7,187",
      "language": "English, French, Indonesian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040797",
      "title": "16 Fathoms Deep",
      "year": 1948,
      "imdbRating": "5.7",
      "imdbVotes": "105",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030037",
      "title": "Danger on the Air",
      "year": 1938,
      "imdbRating": "6.3",
      "imdbVotes": "221",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023938",
      "title": "Deluge",
      "year": 1933,
      "imdbRating": "6.3",
      "imdbVotes": "746",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038360",
      "title": "Black Angel",
      "year": 1946,
      "imdbRating": "6.9",
      "imdbVotes": "4,147",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017899",
      "title": "For the Term of His Natural Life",
      "year": 1927,
      "imdbRating": "5.9",
      "imdbVotes": "130",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:05.036Z"
}