{
  "movieId": "tt0036549",
  "title": "Yellow Canary",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/yc54654633",
      "id": "yc54654633",
      "title": "Yellow Canary",
      "description": "Title: Yellow Canary Summary: A woman wrongfully accused of being a Nazi sympathizer is forced to move to Halifax, a city in the Canadian province of Nova Scotia. Directed by: Herbert Wilcox Actors: Anna Neagle, Richard Greene, Nova Pilbeam Production Company: Herbert Wilcox Productions Release Date: 13 December 1943 (UK) Aspect Ratio: 1.37 : 1 In 1940 Sally Maitland is forced to leave England, ostracised as a Nazi sympathiser by everyone including her well-to-do family. On the ship to Halifax, Canada, she is courted by Polish aristocrat Jan Orloch and by awkward British navel intelligence officer Jimmy Garrick. She shows herself somewhat more amenable to Orloch's advances, and agrees to meet his mother in Halifax. Once there however, it becomes clear no-one is really who they say they are.",
      "fileSize": 704966877,
      "addedAt": "2026-01-07T00:13:17.038Z",
      "thumbnail": "https://archive.org/services/img/yc54654633",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 1509
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/YellowCanary",
      "id": "YellowCanary",
      "title": "Yellow Canary",
      "description": "“Intriguing conspiracies” “Enjoyable spy thriller” “Watchable long after the end of the war” “Anna Neagle’s finest role” (IMDB reviews quotes). A wartime transatlantic suspense drama co-starring Richard Greene and Anna Neagle with comedy relief supplied by the indomitable Margaret Rutherford. Superior production values for type. IMDB rating 6.4. Produced and directed by Herbert Wilcox. UK release 1943. US release 1944. Complete print.",
      "fileSize": 1364148032,
      "addedAt": "2026-01-07T00:07:18.437Z",
      "thumbnail": "https://archive.org/services/img/YellowCanary",
      "collection": "feature_films",
      "downloads": 10616
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": 6.4,
    "imdbVotes": 762,
    "Genre": "Drama, Thriller",
    "Plot": "In 1940, Sally Maitland (Anna Neagle) is forced to leave England, ostracised as a Nazi sympathiser by everyone including her well-to-do family. On the ship to Halifax, Nova Scotia, Canada, she is courted by Polish aristocrat Jan Orlock (Albert Lieven) and by awkward British Naval Intelligence Officer Lieutenant Commander Jimmy Garrick (Richard Greene). She shows herself somewhat more amenable to Orlock's advances, and agrees to meet his mother in Halifax. Once there, however, it becomes clear no one is really who they say they are.",
    "Director": "Herbert Wilcox",
    "Writer": "P.M. Bower, Miles Malleson, DeWitt Bodeen",
    "Actors": "Anna Neagle, Richard Greene, Nova Pilbeam",
    "Language": "English, French, German",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032847",
    "tt0035121",
    "tt0031737",
    "tt0039281",
    "tt0034636",
    "tt0035612",
    "tt0035966",
    "tt0036307",
    "tt0035937",
    "tt0034538",
    "tt0037330",
    "tt0035301"
  ],
  "collections": [],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:13:17.038Z"
}