{
  "imdbId": "tt0000684",
  "title": "Father Gets in the Game",
  "year": 1908,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FatherGetsInTheGame1908",
      "title": "\"Father Gets In The Game\" (1908) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Father Gets in the Game\" is a short comedy directed by D.W. Griffith. The film is included in our program to illustrate the work of two of our stars: actress Florence Lawrence and cinematographer Billy Bitzer. An elderly gentleman gets snubbed by his family members when he wants to go out. He decides to get a make-over, which leads to dramatic consequences. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Mack Sennett, George Gebhardt, Harry Solter,  Florence Lawrence Distributed by                   Biograph Company Release date                      October 10, 1908 Country                             United States Running time                    8 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "FatherGetsInTheGame1908"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbRating": "5.1",
    "imdbVotes": "129",
    "Genre": "Short, Comedy",
    "Plot": "\"You have got to keep up with the bandwagon or quit.\" This never impressed old Wilkins so forcibly as when his son and daughter give him the go-by, stamping him as a \"has-been,\" and away out of the game. Even Mrs. Wilkins, who is as vivacious as a widow, snubs him. He keenly feels his condition and resolves to alter it. With this in view, he enlists the services of Professor Dyem, the celebrated Dermatologist and Tonsorial Artist. After a session with the Professor, beheld the transmogrified Wilkins. What a change! Shorn of his grizzly beard, his locks raven, complexion florid, eye clear and step elastic, he views himself in the mirror. He hardly recognizes himself. In fact, it requires his valet to convince him that he is he. \"Am I in it? Well. I guess. If I don't keep up with and even beat that bandwagon by a city block, my name is not Pill Wilkins.\" He sallies forth and makes for the park. The first person he encounters is his wife. He approaches her in elation, but she mistakes him for an impudent masher and he receives the weight of her parasol over his head for his trouble. The next one he meets is his daughter. She is seated on a bench, waiting for Charley. He takes a seat beside her and when he tries to make himself known she draws herself up to full height and with a blow sends him backward over the bench onto the grass. Well, he changes his tactics, and gets reckless. Along comes his son with his best girl, so he decides to win her out for spite. Now this young lady has a sensitive pneumogastric nerve, and when he sits beside her on the bench and slyly suggests a cold bottle and a hot bird, she is \"his'n.\" This is done so coolly and so quickly, that young Wilkins, who, of course, does not recognize his respected papa, is speechless with rage. He follows them, however, to the café, where his intrusion is resented and he is rudely thrown from the place. At the Wilkins' domicile there is an indignation meeting. Mother, daughter and son all rush in to relate their experiences to father. He is not to be found. Suddenly a hilarious individual enters. \"'Tis he, the insulter: a drunk and disorderly.\" They are about to have him thrown out when the valet comes to his rescue and explains that the jubilant gentleman is no other than their dear papa, who has not only caught up with the bandwagon, but is sitting on the seat with the driver. They all gasp in surprise, and young Wilkins takes a wreath of laurel from a statue and places it on old Wilkins' brow, saying: \"Pop, you are the candy.\"",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Mack Sennett, Harry Solter, George Gebhardt",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0000653",
      "title": "A Calamitous Elopement",
      "year": 1908,
      "imdbRating": "4.5",
      "imdbVotes": "225",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000641",
      "title": "Balked at the Altar",
      "year": 1908,
      "imdbRating": "4.7",
      "imdbVotes": "178",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001002",
      "title": "The Politician's Love Story",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "103",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000946",
      "title": "The Lure of the Gown",
      "year": 1909,
      "imdbRating": "4.6",
      "imdbVotes": "79",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000640",
      "title": "An Awful Moment",
      "year": 1908,
      "imdbRating": "4.4",
      "imdbVotes": "146",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000728",
      "title": "Money Mad",
      "year": 1908,
      "imdbRating": "5.9",
      "imdbVotes": "131",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000789",
      "title": "The Zulu's Heart",
      "year": 1908,
      "imdbRating": "5.0",
      "imdbVotes": "63",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000770",
      "title": "The Taming of the Shrew",
      "year": 1908,
      "imdbRating": "5.4",
      "imdbVotes": "172",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001062",
      "title": "Those Awful Hats",
      "year": 1909,
      "imdbRating": "6.2",
      "imdbVotes": "1,256",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000877",
      "title": "Getting Even",
      "year": 1909,
      "imdbRating": "4.8",
      "imdbVotes": "107",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000892",
      "title": "Her First Biscuits",
      "year": 1909,
      "imdbRating": "5.6",
      "imdbVotes": "83",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000800",
      "title": "The Awakening",
      "year": 1909,
      "imdbRating": "5.3",
      "imdbVotes": "115",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:25.398Z"
}