{
  "movieId": "tt0045769",
  "title": "The Final Test",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tfintes0997",
      "id": "tfintes0997",
      "title": "The Final Test",
      "description": "Title: The Final Test Summary: Sam Palmer is a cricket player who is playing the last Test match of his career. His schoolboy son, Reggie, is a budding poet who disappoints Sam by not attending the penultimate day's play... Directed by: Anthony Asquith Actors: Jack Warner, Robert Morley, George Relph Production Company: J. Arthur Rank Organisation Release Date: 5 January 1954 (USA) Aspect Ratio: 1.37 : 1 Sam Palmer is a cricket player who is playing the last Test match of his career. His schoolboy son, Reggie, is a budding poet who disappoints Sam by not attending the penultimate day's play. Then Reggie is suddenly invited to the home of poet and writer Alexander Whitehead. Reggie fears he will also miss the final day - and therefore Sam's last innings - but it turns out that Alexander is a cricket fan.",
      "fileSize": 682810382,
      "addedAt": "2026-01-07T00:11:46.531Z",
      "thumbnail": "https://archive.org/services/img/tfintes0997",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 2048
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": 6.6,
    "imdbVotes": 243,
    "Genre": "Comedy, Drama, Sport",
    "Plot": "Sam Palmer is a cricket player who is playing the last test match of his career. His schoolboy son Reggie is a budding poet who disappoints him by not attending the penultimate day's play. Then Reggie is suddenly invited to the home of poet and writer Alexander Whitehead. Reggie fears he will also miss the final day--and therefore Sam's last innings--but it turns out that Alexander is a cricket fan.",
    "Director": "Anthony Asquith",
    "Writer": "Terence Rattigan",
    "Actors": "Jack Warner, Robert Morley, George Relph",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0054086",
    "tt0059927",
    "tt0043362",
    "tt0017765",
    "tt0035089",
    "tt0046384",
    "tt0033144",
    "tt0010635",
    "tt0183491",
    "tt0251415",
    "tt2464690",
    "tt0046359"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}