{
  "imdbId": "tt0029019",
  "title": "Hoosier Schoolboy",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hoosier_schoolboy",
      "id": "hoosier_schoolboy",
      "title": "Hoosier Schoolboy",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 3629634153,
      "addedAt": "2026-01-07T00:08:46.613Z",
      "thumbnail": "https://archive.org/services/img/hoosier_schoolboy",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 57710
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hoosier_schoolboy_ipod",
      "id": "hoosier_schoolboy_ipod",
      "title": "Hoosier Schoolboy",
      "description": "A schoolteacher comes to a new town and finds herself caught up in the town's problems and disputes.",
      "fileSize": 1230336915,
      "addedAt": "2026-01-07T00:08:46.613Z",
      "thumbnail": "https://archive.org/services/img/hoosier_schoolboy_ipod",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 34445
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xp16kpB8w7k",
      "id": "Xp16kpB8w7k",
      "title": "Hoosier Schoolboy (1937) | Colorized Public Domain Classic Drama with Mickey Rooney and Anne Nagel",
      "description": "Hoosier Schoolboy (1937) is an American drama film directed by William Nigh and distributed by Republic Pictures. Starring Mickey Rooney in one of his early performances alongside Anne Nagel and Frank Shields, the film blends themes of childhood, education, poverty, and resilience against the backdrop of small-town America during the Great Depression. Restored and colorized by Colorized Public Domain, this edition brings new life to a long-overlooked drama, making it more accessible and visually engaging for audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe story follows Shockey Carter (Mickey Rooney), a troubled but spirited schoolboy whose rebellious behavior hides the struggles of a difficult home life. His father, Captain Fred Carter (Edward Pawley), is a war veteran grappling with the lingering effects of trauma and alcoholism, leaving Shockey to fend for himself emotionally. When new schoolteacher Mary Evans (Anne Nagel) arrives in town, she sees through Shockey’s rough exterior and becomes determined to help him find stability and purpose.\n\nShockey’s defiance often puts him at odds with classmates and authority figures, but Mary’s patience and compassion gradually earn his trust. Their relationship is challenged when the community questions Shockey’s upbringing and his father’s reputation. As tension builds, Shockey must navigate loyalty to his troubled father, his own reputation as a misfit, and the possibility of a brighter future. The film delivers an emotional story of redemption, hardship, and the power of understanding in shaping young lives.\n\nCast and Crew:\n• Director: William Nigh\n• Producer: Nat Levine\n• Screenplay: Samuel Ornitz\n• Cinematography: Jack A. Marta\n• Editing: Ernest J. Nims\n\nStarring:\n• Mickey Rooney as Shockey Carter\n• Anne Nagel as Mary Evans\n• Frank Shields as John Clinton\n• Edward Pawley as Captain Fred Carter\n• Harry Davenport as Professor\n• Lionel Stander as George Brant\n• Forrester Harvey as Mr. Potter\n\nFilm Significance:\nHoosier Schoolboy is remembered as one of Mickey Rooney’s early dramatic roles, showcasing his range before becoming one of Hollywood’s most famous stars of the 1930s and 1940s. The film’s small-town setting and heartfelt exploration of childhood struggles reflected broader social realities of Depression-era America, where many families faced hardship and instability. Republic Pictures, often known for Westerns and B-films, offered a different kind of story here, aiming to tug at the emotions of audiences through Rooney’s powerful performance. While not as widely known today, it stands as an important piece of cinematic history, capturing both the struggles and resilience of working-class America.\n\nEnhanced Public Domain Explanation:\nHoosier Schoolboy is now in the public domain, meaning it is free of copyright restrictions and can be legally viewed, shared, studied, and preserved. At Colorized Public Domain, we restore and colorize these historic films to enhance their quality for modern audiences. The goal is to keep overlooked classics alive for generations to come, ensuring they remain discoverable, visually engaging, and culturally relevant. By adding color, details that were once muted in black-and-white cinematography now stand out, breathing new life into films like this and allowing viewers to experience the performances, sets, and atmosphere in ways that resonate today.\n\nWhy Watch This Colorized Edition:\nThe original 1937 release was filmed in black and white, which reflected both the budget limitations of Republic Pictures and the industry standard of the time. This colorized edition preserves the authentic performances and storytelling while enhancing the visual experience for modern audiences. The story’s emotional impact becomes more immersive with color, highlighting the nuances of Rooney’s performance and the small-town Americana setting. For fans of vintage cinema, family dramas, and early Mickey Rooney performances, this restored edition is a chance to rediscover an underappreciated classic.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood, ensuring that forgotten gems remain alive and appreciated by audiences across the USA, Europe, and beyond.\n\n#HoosierSchoolboy #MickeyRooney #AnneNagel #ClassicDrama #1930sCinema #PublicDomainMovie #ColorizedClassic #RepublicPictures #VintageHollywood #FilmRestoration",
      "addedAt": "2025-12-24T00:47:10.269Z",
      "thumbnail": "https://i.ytimg.com/vi/Xp16kpB8w7k/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBcKE8wDw==&rs=AOn4CLBwCOU-wBDl66_D79yTPq4MdFZquQ",
      "duration": 3584,
      "language": "en",
      "year": 1937,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "62 min",
    "imdbRating": 5.7,
    "imdbVotes": 203,
    "Genre": "Drama",
    "Plot": "A new schoolteacher arrives in the town of Ainsley, which is in the middle of a milk strike that has caused heated feelings among the local dairy farmers. One of the teacher's new students is a cynical boy who is prone to fighting. When she takes an interest in him, she learns that he lives with his father, a shell-shocked war veteran. Meanwhile, the son of the hard-line dairy owner is pursuing her, despite her resistance to his attentions.",
    "Director": "William Nigh",
    "Writer": "Edward Eggleston, Robert Lee Johnson",
    "Actors": "Mickey Rooney, Anne Nagel, Frank Shields Sr.",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028592",
    "tt0028634",
    "tt0029941",
    "tt0030126",
    "tt0030170",
    "tt0030473",
    "tt0030692",
    "tt0030253",
    "tt0026458",
    "tt0031680",
    "tt0031690",
    "tt0031987"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.613Z"
}