{
  "imdbId": "tt0054709",
  "title": "Pigs and Battleships",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pigs-and-battleships",
      "id": "pigs-and-battleships",
      "title": "Pigs And Battleships",
      "description": "A dazzling, unruly portrait of postwar Japan,  Pigs and Battleships  details, with escalating absurdity, the desperate power struggles between small-time gangsters in the port town of Yokosuka. Shot in gorgeously composed, bustling CinemaScope, the film follows a young couple as they try to navigate Yokosuka’s corrupt businessmen,  chimpira , and their own unsure future together. With its breakneck pacing and constantly inventive cinematography, this film marked Shohei Imamura as a major voice in Japanese cinema.",
      "fileSize": 8880267111,
      "addedAt": "2026-01-07T00:10:12.700Z",
      "thumbnail": "https://archive.org/services/img/pigs-and-battleships",
      "language": "jpn",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 7094
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "108 min",
    "imdbRating": 7.4,
    "imdbVotes": 2663,
    "Genre": "Comedy, Crime, Drama",
    "Plot": "In Yukosuka, many are able to benefit financially, legally and illegally, by the presence of the American naval base established after the war. Kinta, who is low level thug within the Himori yakuza, takes care of the yakuza's pig farm but provides some muscle in shaking down among others shopkeepers who cater and this benefit from the lucrative American military trade. Kinta is often asked to sacrifice himself for the yakuza, the promise being that the yakuza will ultimately recognize the sacrifice with bonuses and promotion within the organization. Kinta's girlfriend, Haruko, a barmaid, doesn't like his life and would prefer that they escape Yukosuka to Kawasaki where they could get jobs in her uncle's factory, something that Kinta continually resists in not wanting to be a \"wage slave\". Haruko is also continually pressured by her mother to prostitute herself, Mr. Gordon who is willing to pay top dollar to be his kept mistress. Kinta and Haruko's fates will be partly affected by the power struggle within the yakuza, Kinta's cohorts who may be willing to give him up for their own benefit, his boss, Tetsuji, who believes he is dying, and Himori who will do whatever necessary to retain control.",
    "Director": "Shôhei Imamura",
    "Writer": "Hisashi Yamanouchi, Gisashi Yamauchi, Kazu Ôtsuka",
    "Actors": "Hiroyuki Nagato, Jitsuko Yoshimura, Masao Mishima",
    "Language": "Japanese, English",
    "Country": "Japan",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0053354",
    "tt0060560",
    "tt0057363",
    "tt0028346",
    "tt0068519",
    "tt0032343",
    "tt0038418",
    "tt0033871",
    "tt0029199",
    "tt0066856",
    "tt0024985",
    "tt0033805"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.700Z"
}