{
  "movieId": "tt0031267",
  "title": "El Diablo Rides",
  "year": 1939,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XQ4gcRedk4k",
      "id": "XQ4gcRedk4k",
      "title": "El Diablo Rides (1939) Bob Steele | Action, Adventure, Western",
      "description": "Bob rides into a border town where he runs into trouble with Lambert and his gang. Herb arrests him claiming he is the outlaw El Diablo. But it was just to save him from Lambert's gang and the two now plan to trap the outlaws.\n\nDirector: Ira Webb\nWriters: Harry Gordon, Rose Gordon, Carl Krusada, \nStars: Bob Steele, Claire Rochelle, Kit Guard\nGenres: Classics, Action, Adventure, Western\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics\nhttps://www.twitch.tv/cultcinemaclassics",
      "addedAt": "2025-12-27T00:46:59.397Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/XQ4gcRedk4k/maxresdefault.webp?v=6272a533",
      "duration": 3256,
      "language": "en",
      "year": 1939,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "57 min",
    "imdbRating": 3,
    "imdbVotes": 40,
    "Genre": "Romance, Western",
    "Plot": "Enroute to Borderville, looking for his father's killer, Bob (Bob Steele) stops a runaway horse carrying Mary (Claire Rochelle.) His pal Dan (Kit Guard), who has followed Bob against his orders not to, has a fight with one of Lambert's henchmen, Frank (Bob Walker) which Bob stops. In a Borderville tavern owned by Buck Lambert (Ted Adams),who is engaged in smuggling contraband across the border, Bob is taken prisoner by Lambert's men. Notified by Mart, Herbert Crenshaw (Carleton Young) and his men arrive and claim that Bob is a cattle rustler known as \"El Diablo\" and take him to the Crenshaw ranch. He is released as this was a ruse to save him from Lambert. Mary, working as a cashier at the tavern, informs Crenshaw that Lambert is preparing to run contraband across the border. Bob, seeing Crenshaw embrace Mary, believes they are sweethearts but they are brother and sister working as federal agents. Lambert discovers Mary writing a note to Crenshaw and Bob arrives just as she is making a break. Bob, having discovered that Lambert was his father's killer, captures him and leaves him guarded by Dan while he and Crenshaw ride to intercept Lambert's men henchmen in the pass. But Lambert escapes and takes Mary as a prisoner.",
    "Director": "Ira Webb",
    "Writer": "Harry Gordon, Rose Gordon, Carl Krusada",
    "Actors": "Bob Steele, Claire Rochelle, Kit Guard",
    "Language": "Spanish, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029487",
    "tt0031165",
    "tt0031861",
    "tt0032972",
    "tt0033808",
    "tt0132951",
    "tt0029055",
    "tt0031940",
    "tt0031301",
    "tt0032312",
    "tt0135805",
    "tt0133763"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:52:46.223Z"
}