{
  "imdbId": "tt0042898",
  "title": "The Rocking Horse Winner",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/trhw6654329",
      "id": "trhw6654329",
      "title": "The Rocking Horse Winner",
      "description": "Title: The Rocking Horse Winner Summary: A young boy receives a rocking horse for Christmas and soon learns that he is able to pick the winning horse at the races. Directed by: Anthony Pelissier Actors: Valerie Hobson, John Howard Davies, Ronald Squire Production Company: J. Arthur Rank Organisation Release Date: 30 November 1949 (UK) Aspect Ratio: 1.37 : 1 In London, the young Paul Grahame lives with his upper class, but financially broken family. His wasteful mother Hester Grahame is a compulsive buyer, spending all the family money on new expensive dresses, jewels, and objects for their house. His father Richard Grahame is a gambler, losing money in the horse races. His uncle Oscar Cresswell is permanently covering the Grahame family debts. When the servant Bassett is hired, Paul finds that he can predict the winner of the horse races by rocking his wooden horse. Paul asks Bassett to become his partner. The two of them bet their money on the races. Paul wants to prove that he is lucky in order to silence the house, which perpetually whispers to him that it needs more money.",
      "fileSize": 931784662,
      "addedAt": "2026-01-07T00:12:55.129Z",
      "thumbnail": "https://archive.org/services/img/trhw6654329",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 3204
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "91 min",
    "imdbRating": 7.3,
    "imdbVotes": 1426,
    "Genre": "Drama, Fantasy",
    "Plot": "In London, the young Paul Grahame lives with his upper class, but financially broken family. His wasteful mother Hester Grahame is a compulsive buyer, spending all the family money on new expensive dresses, jewels, and objects for their home. His father Richard Grahame is a gambler, losing money in the horse races. His uncle Oscar Cresswell is permanently covering the Grahame family debts. After the servant Bassett is hired, Paul finds that he can predict the winner of the horse races by rocking his wooden horse. Paul asks Bassett to become his partner. The two of them bet their money on the races. Paul wants to prove that he is lucky in order to silence the house, which perpetually whispers to him that it needs more money.",
    "Director": "Anthony Pelissier",
    "Writer": "D.H. Lawrence, Anthony Pelissier",
    "Actors": "Valerie Hobson, John Howard Davies, Ronald Squire",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041469",
    "tt0040643",
    "tt0201548",
    "tt0042472",
    "tt0042546",
    "tt0046060",
    "tt0039340",
    "tt0038733",
    "tt0191823",
    "tt0046478",
    "tt0037635",
    "tt0041503"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.129Z"
}