{
  "movieId": "tt0002421",
  "title": "The Passer-by",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-passer-by",
      "id": "silent-the-passer-by",
      "title": "The Passer-By",
      "fileSize": 317822767,
      "addedAt": "2026-01-07T00:11:24.923Z",
      "thumbnail": "https://archive.org/services/img/silent-the-passer-by",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 306
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "15 min",
    "imdbRating": 6.1,
    "imdbVotes": 122,
    "Genre": "Short, Drama",
    "Plot": "A young man, giving a farewell bachelor dinner, receives a note at the last moment saying that one of his guests is obliged to leave town and cannot attend. Rather than allow his place to remain empty he sends two of his friends to the street to bring in the first man who passes. They enter into the spirit of the idea descend to the street and pounce upon a poorly dressed old man and, in spite of his protests, drag him in to the dinner. At the finish of the dinner he is called upon for a story and in answer to their insistent demands proceeds to tell them the story of his life. Years ago he too was giving a farewell bachelor dinner, surrounded by his friends, happy in the love of a woman who was to be his wife the next day. He was the life and gaiety of the party. In the midst of merriment he was handed a note from the woman saying that she had married another man an hour before. Completely crushed, his first thoughts were of suicide but his manhood revolting at this, he decided to fight down his love and forget her if possible. He plunged into speculation and with several friends formed a pool to corner a certain stock. While the fight for control was raging furiously and when the victory was within his grasp, he suddenly caught sight of the woman in the balcony of the Stock Exchange. Her husband was his opponent. Her mute appeal so unnerved him that the tide set in against him and he went down to utter ruin. Time passed and he was now only the confidential clerk of one of his former associates. In this position a momentary abstraction was brought about by a newspaper item in reference to the woman which caused him to commit a serious blunder, resulting in his discharge. Years later we see him a prematurely aged man, employed as bookkeeper. His employer, receiving an urgent call from a friend for funds, entrusts him with a number of securities to be delivered at once. Hurrying along Wall Street he meets the woman alighting from her car. Forgetting his errand he stares vacantly after her and finally returns to the office without delivering the securities. His seeming carelessness is rewarded by immediate discharge. Thereafter his decline on the social ladder is very rapid until he has become merely a hanger-on in the great world of frenzied finance, an object of jest to strangers and of pity and charity to his former friends. And that is the story of the passer-by invited to the feast. History has a chastening effect upon the merry crowd. The host hands him his card, saying that if he will call he will help him. The passer-by bids them goodnight, but as he turns to go he comes face to face with the portrait of a beautiful woman which is hanging over the mantel. Clutching a chair he hoarsely asks his host who she is and is told that she is his mother. Glancing at the card his young host has given him he reads the name for the first time. It is that of the woman's son. He cannot accept any favors from such a source. He slowly tears up the card, pulls himself together and goes out to become again merely a passer-by.",
    "Director": "Oscar Apfel",
    "Writer": "Marion Brooks",
    "Actors": "George Lessey, Miriam Nesbitt, Marc McDermott",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002621",
    "tt0002098",
    "tt0132221",
    "tt0002523",
    "tt0234953",
    "tt0123245",
    "tt0001544",
    "tt0002381",
    "tt0002054",
    "tt0002082",
    "tt0002143",
    "tt0002121"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.923Z"
}