{
  "imdbId": "tt0003419",
  "title": "The Student of Prague",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-student-of-prague",
      "title": "The Student of Prague",
      "id": "silent-the-student-of-prague"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "83 min",
    "imdbRating": "6.4",
    "imdbVotes": "2,612",
    "Genre": "Drama, Fantasy, Horror",
    "Plot": "Balduin, a student of Prague, leaves his roystering companions in the beer garden, when he finds he has reached the end of his resources. He is scarcely seated in a quiet corner when a hideous, shriveled-up old man taps him upon the shoulder and whispers vaguely of a big inheritance for Prague's finest swordsman and wildest student if he will enter into a certain agreement. Balduin rebuffs him, satirically asking his weird companion to procure him \"the luckiest ticket in a lottery or a doweried wife.\" The old man goes off chuckling and thence onward persistently shadows Balduin, exerting a sinister influence over him, while Balduin is still disconsolate under the frowns of fortune. The Countess Margit Schwarzenberg, hunting with her cousin, to whom her father has betrothed her, meets with an accident. She is thrown over her horse's head into a river, but Balduin, who has been directed to the spot by his evil genius, plunges in and rescues her. Subsequently Balduin calls to inquire as to her condition at the castle of her father, the count, but be makes a hurried departure when Baron Waldis arrives, the contrast in their appearance discrediting him. His desire to win the countess and to humiliate the baron becomes so pronounced that he readily accedes to the compact suggested by Scapinelli, the old man, who has so pertinaciously dogged his footsteps, particularly when he learns that untold wealth and power will be his when he assigns to the other the right to take from his room whatever he chooses for his own use as he desires. The agreement is signed. Balduin receives a shower of gold and notes as his portion; Scapinelli takes Balduin's soul exposed in concrete form by his shadow. Balduin prosecutes his love affair assiduously and with apparent success, till the baron is informed of it by a jealous gypsy girl. He challenges Balduin to a duel, and the latter, assured of his superiority as a fencer, readily agrees. Count Schwarzenberg learns of the impending duel and appeals to Balduin not to kill \"my sister's child, my daughter's future husband, and my heir.\" Balduin gives his promise, but when he goes to the venue of the duel he meets, his own counterpart stalking away derisively wiping his gory sword on his cloak. Balduin turns and in the far distance sees the dying victim of the deed he swore he would not do. He rushes from the spot horror-stricken. When he regains sufficient composure he makes his way to the castle of the count, but is refused admission. Determined to explain that he had no complicity in the death of the baron, Balduin climbs into a room in which the countess is seated. She receives him coldly, but soon succumbs to his ardent wooing. Just as he seeks to leave her she notices he has no shadow and that the mirror gives no reflection of him; and she drops back affrighted, the ghastly apparition of himself which takes shape in the corner of the room sends Balduin scuttling away from the castle in a paroxysm of terror. He makes a frenzied flight through a woodland estate and the streets of Prague, but wherever he stops to recover his breath he is haunted by the counterpart of himself. He reaches his rooms and draws a murderous looking fire-arm from its case. As the phantasmagorical figure strides towards him with a sinister grin, he fires, and in a few minutes the blood gushes from his own side from a fatal wound.",
    "Director": "Hanns Heinz Ewers, Stellan Rye",
    "Writer": "Hanns Heinz Ewers, Alfred de Musset",
    "Actors": "Paul Wegener, Grete Berger, Lyda Salmonova",
    "Language": "German, English",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0017103",
      "title": "The Magician",
      "year": 1926,
      "imdbRating": "6.7",
      "imdbVotes": "797",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005951",
      "title": "Satan's Rhapsody",
      "year": 1917,
      "imdbRating": "6.7",
      "imdbVotes": "887",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2784936",
      "title": "Backtrack",
      "year": 2015,
      "imdbRating": "5.9",
      "imdbVotes": "14,476",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt14292086",
      "title": "Nix",
      "year": 2022,
      "imdbRating": "3.8",
      "imdbVotes": "3,337",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0062453",
      "title": "Viy",
      "year": 1967,
      "imdbRating": "7.2",
      "imdbVotes": "10,735",
      "language": "Russian, Ukrainian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0018770",
      "title": "The Fall of the House of Usher",
      "year": 1928,
      "imdbRating": "7.2",
      "imdbVotes": "4,830",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0003516",
      "title": "The Wanderer",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "65",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054807",
      "title": "The Devil's Messenger",
      "year": 1962,
      "imdbRating": "4.7",
      "imdbVotes": "541",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0470339",
      "title": "The Haunted Bedroom",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "27",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012364",
      "title": "The Phantom Carriage",
      "year": 1921,
      "imdbRating": "8.0",
      "imdbVotes": "15,311",
      "language": "None, Swedish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037635",
      "title": "Dead of Night",
      "year": 1945,
      "imdbRating": "7.5",
      "imdbVotes": "15,012",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021814",
      "title": "Dracula",
      "year": 1931,
      "imdbRating": "7.3",
      "imdbVotes": "62,918",
      "language": "English, Hungarian, Latin",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}