{
  "imdbId": "tt0070820",
  "title": "Touki Bouki",
  "year": 1973,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/touki-bouki",
      "id": "touki-bouki",
      "title": "Touki bouki",
      "description": "With a stunning mix of the surreal and the naturalistic, Djibril Diop Mambéty paints a fractured portrait of the disenchantment of postindependence Senegal in the early 1970s. In this picaresque fantasy-drama, the disaffected young lovers Anta and Mory, fed up with Dakar, long to escape to the glamour and comforts they imagine France has to offer, but their plan is confounded by obstacles both practical and mystical. Alternately manic and meditative,  Touki bouki  has an avant-garde sensibility characterized by vivid imagery, bleak humor, unconventional editing, and jagged soundscapes, and it demonstrates Mambéty’s commitment to telling African stories in new ways. Touki bouki  was restored in 2008 by the Cineteca di Bologna/L’Immagine Ritrovata laboratory, in association with The Film Foundation’s World Cinema Project and the family of director Djibril Diop Mambéty. Restoration funded by Armani, Cartier, Qatar Airways, and Qatar Museum Authority.",
      "fileSize": 7429509827,
      "addedAt": "2026-01-07T00:12:44.285Z",
      "thumbnail": "https://archive.org/services/img/touki-bouki",
      "language": "wol",
      "year": 1973,
      "collection": "feature_films",
      "downloads": 16422
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "85 min",
    "imdbRating": 7,
    "imdbVotes": 4356,
    "Genre": "Drama",
    "Plot": "Mory, a cowherd who rides a motorcycle mounted with a cow's skull, and Anta, a university student, have met in Dakar, Senegal's capital. Alienated and disaffected with Senegal and Africa, they long to go to Paris and work up different con schemes to raise the money. Mory steals clothing and money from a wealthy gay man who had brought him home, and he and Anta book passage on a ship to France.",
    "Director": "Djibril Diop Mambéty",
    "Writer": "Djibril Diop Mambéty",
    "Actors": "Magaye Niang, Myriam Niang, Christoph Colomb",
    "Language": "Wolof, Arabic, French",
    "Country": "Senegal",
    "Awards": "2 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0072651",
    "tt0070578",
    "tt0170826",
    "tt0070809",
    "tt0290418",
    "tt0070030",
    "tt0070250",
    "tt0158714",
    "tt0193602",
    "tt0143428",
    "tt0070188",
    "tt0069059"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}