{
  "imdbId": "tt0033613",
  "title": "Flying Wild",
  "year": 1941,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0B85XLn5ePw",
      "title": "Flying Wild (1941) [Comedy] [Drama]",
      "description": "While pals Skinny (Donald Haines), Danny Graham (Bobby Jordan), Peewee (David Gorcey), Algy Reynolds (Eugene Francis), and Scruno (Sunshine Sammy Morrison) all work at the Reynolds Aviation Company, which is run by Algy's father (Herbert Rawlinson), Muggs (Leo Gorcey), the only one of the kids who refuses to work, spends his time flirting with an ambulance nurse named Helen (Joan Barclay). Helen, though, is in love with her test pilot boyfriend Tom (Dave O'Brien). One day, when Tom's plane crashes onto the plant airstrip, Reynolds suspects that the crash may have been the work of saboteurs. Later, on the airfield tarmac, Muggs jokingly appoints himself as the new operator of Dr. Richard Nagel (George Pembroke)'s ambulance plane and gives his pals a tour of the aircraft. Their playful games are soon brought to a halt by Nagel, the secret leader of a spy ring, who catches the boys on his plane and angrily orders them off.\n\nMr. Reynolds, certain that spies are working at the plant, asks Danny to act as a decoy so that the spies can be identified, and has him deliver to a downtown office a fake set of plans for a new bomb site. As Reynolds predicted, Nagel's men ambush Danny on his way to the office, but the plan goes awry when the detectives sent to trail Danny lose him. Danny eventually turns up unharmed some time later. When Muggs reports to Reynolds his suspicions that Nagel is behind the espionage ring, Reynolds dismisses the accusation as a product of the boy's imagination. Not convinced by Reynolds that Nagel is innocent, Muggs and Danny begin their own investigation into Nagel, starting with a visit to the doctor on the pretext of a fake ailment. The visit turns up nothing, however, and when Danny and Muggs return to the hangar, a suspicious \"accident\" that was apparently meant to harm them leaves Peewee injured. While Peewee recovers at the hospital, Tom nearly loses his life when he is unable to make contact with the control tower for a landing. The controller is later found bound and gagged in the tower, prompting the kids to resume their investigation in earnest.\n\nHelen provides the gang with further clues when she confirms that the ambulance plane was being flown on many unusual trips to Mexico, supposedly to deliver patients. When Helen tells the East Side Kids that a man named Forbes is the next \"patient\" to be transported, they rush to his house, where they find secret plans hidden in his head bandage. Disguising Danny as the transportee, the kids send Danny and Muggs on the flight to learn who is behind the espionage ring. Danny and Muggs soon find themselves in trouble, however, when Nagel, having found Forbes locked in his closet, tries to warn the pilot of the boys' ruse. Meanwhile, Tom learns of the dangerous mission and goes after the ambulance plane in his own plane. Tom arrives in Mexico in time to save Danny and Muggs, and all the spies are arrested. Back at the plant, Reynolds rewards Muggs for his heroism by giving him a job, but his stint there is short-lived as he is soon distracted by a pretty woman and crashes a plane.\n\n---\n\nDirected by William West, produced by Sam Katzman, written by Al Martin, starring Leo Gorcey as Muggs McGinnis, Bobby Jordan as Danny Graham, Sunshine Sammy Morrison as Scruno, David Gorcey as Peewee, Donald Haines as Skinny, Eugene Francis as Algy Reynolds, Bobby Stone as Louie, Joan Barclay as Helen Munson, Dave O'Brien as Tom Lawson, George Pembroke as Dr. Richard Nagel III, Herbert Rawlinson as Mr. Reynolds, Dennis Moore as George, Forrest Taylor as Forbes, Robert F. Hill as Woodward, Mary Bovard as Mazie, , George Eldredge as Man, Alden \"Stephen\" Chase as Jack, Henchman, \nAl Ferguson, Jack Kenny, Carey Loftin, Bud Osborne, Eddie Parker, and Dick Scott as Henchmen.\n\n---\n\nSource: \"Flying Wild\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 August 2013. Web. 26 August 2013. http://en.wikipedia.org/wiki/Flying_Wild.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "0B85XLn5ePw",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/flying_wild",
      "title": "Flying Wild",
      "description": "Da East Side Kids get jobs at a airplane factory, and discover that one of the employees is a spy.",
      "id": "flying_wild"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rSScr8aM57Y",
      "title": "Flying Wild (1941) THE EAST SIDE KIDS",
      "description": "Stars: Leo Gorcey, Bobby Jordan, Joan Barclay\nDirector: William West\n\nA group of young men who work at an aviation factory begin to suspect that a doctor who runs an air ambulance service is secretly a spy transporting secret information from the plant to enemy agents.",
      "id": "rSScr8aM57Y",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4xqJ_gy44OY",
      "title": "Flying Wild (1941) East Side Kids | Comedy, Action, Spy | Full Length Movie",
      "description": "A group of young men who work at an aviation factory begin to suspect that a doctor who runs an air ambulance service is secretly a spy transporting secret information from the plant to enemy agents.\n \nDirector: William West\nWriters: Al Martin \nStars: Leo Gorcey, Bobby Jordan, Joan Barclay\nGenres: Classics, Action, Comedy, Drama\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "id": "4xqJ_gy44OY",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": "5.4",
    "imdbVotes": "538",
    "Genre": "Comedy, Mystery",
    "Plot": "A group of young men who work at an aviation factory begin to suspect that a doctor who runs an air ambulance service is secretly a spy transporting secret information from the plant to enemy agents.",
    "Director": "William Beaudine",
    "Writer": "Al Martin",
    "Actors": "Leo Gorcey, Bobby Jordan, Joan Barclay",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0035939",
      "title": "Ghosts on the Loose",
      "year": 1943,
      "imdbRating": "5.0",
      "imdbVotes": "1,583",
      "language": "English, Yiddish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035741",
      "title": "Clancy Street Boys",
      "year": 1943,
      "imdbRating": "6.0",
      "imdbVotes": "548",
      "language": "English, French, Spanish, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0207407",
      "title": "Detective Kitty O'Day",
      "year": 1944,
      "imdbRating": "5.3",
      "imdbVotes": "331",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032277",
      "title": "Boys of the City",
      "year": 1940,
      "imdbRating": "5.6",
      "imdbVotes": "660",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035089",
      "title": "Mr. Celebrity",
      "year": 1941,
      "imdbRating": "5.4",
      "imdbVotes": "44",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035067",
      "title": "The Miracle Kid",
      "year": 1941,
      "imdbRating": "5.6",
      "imdbVotes": "47",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033595",
      "title": "Federal Fugitives",
      "year": 1941,
      "imdbRating": "5.0",
      "imdbVotes": "75",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033856",
      "title": "Lucky Ghost",
      "year": 1942,
      "imdbRating": "5.8",
      "imdbVotes": "230",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032799",
      "title": "Misbehaving Husbands",
      "year": 1940,
      "imdbRating": "5.2",
      "imdbVotes": "171",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034985",
      "title": "The Living Ghost",
      "year": 1942,
      "imdbRating": "5.3",
      "imdbVotes": "695",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0035171",
      "title": "The Panther's Claw",
      "year": 1942,
      "imdbRating": "5.8",
      "imdbVotes": "324",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036382",
      "title": "Spotlight Scandals",
      "year": 1943,
      "imdbRating": "5.6",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:24.397Z"
}