{
  "imdbId": "tt0048424",
  "title": "The Night of the Hunter",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-night-of-the-hunter-1955_202508",
      "id": "the-night-of-the-hunter-1955_202508",
      "title": "The Night Of The Hunter (1955) Robert Mitchum · Shelley Winters",
      "description": "The two innocent children of an executed robber are tormented and persecuted by his cellmate, a demented itinerant preacher who murdered their mother while searching for the hidden loot. An old woman takes them under her wing and bravely defends them. Influenced by German Expressionism, the film uses evocative light and sound effects to create an unreal, oppressive, and at times shocking atmosphere. Laughton described his only directorial work as a \"nightmarish fairy tale.\" The film initially met with little response but was later rediscovered as a work with an original cinematic language.",
      "fileSize": 1100912189,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-night-of-the-hunter-1955_202508",
      "language": "eng",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 292
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1955-the-night-of-the-hunter-la-noche-del-cazador-charles-laughton",
      "id": "1955-the-night-of-the-hunter-la-noche-del-cazador-charles-laughton",
      "title": "1955 - The Night of The Hunter (La noche del cazador) w/Spanish Subtitles",
      "description": "1955 - The Night of The Hunter - La noche del cazador - Charles Laughton English language version of the film subtitled in Spanish.",
      "fileSize": 936223989,
      "addedAt": "2026-01-07T00:06:06.563Z",
      "thumbnail": "https://archive.org/services/img/1955-the-night-of-the-hunter-la-noche-del-cazador-charles-laughton",
      "language": "English",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 11828
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "92 min",
    "imdbRating": 8,
    "imdbVotes": 105187,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "It's the Great Depression. In the process of robbing a bank of $10,000, Ben Harper kills two people. Before he is captured, he is able to convince his adolescent son John and his daughter Pearl not to tell anyone, including their mother Willa, where he hid the money, namely in Pearl's favorite toy, a doll that she carries everywhere with her. Ben, who is captured, tried and convicted, is sentenced to death. But before he is executed, Ben is in the state penitentiary with a cell mate, a man by the name of Harry Powell, a self-professed man of the cloth, who is really a con man and murderer, swindling lonely women, primarily rich widows, of their money before he kills them. Harry does whatever he can, unsuccessfully, to find out the location of the $10,000 from Ben. After Ben's execution, Harry decides that Willa will be his next mark, figuring that someone in the family knows where the money is hidden. Despite vowing not to remarry, Willa ends up being easy prey for Harry's outward evangelicalism; she is a pious woman who feels she needs to atone for her sins which led to Ben doing what he did, especially as Harry presents himself as the preacher who worked at the prison and provided salvation to Ben before his death. Harry quickly figures out that John and Pearl know where the money is. Conversely, John doesn't trust Harry, John who first tries not to show to Harry that he indeed does know where the money is, and then second constantly reminds a more-trusting Pearl of their promise to their now-deceased father. With Willa devoted to her new husband, John and Pearl need some other adult assistance in evading Harry's veiled threats, an adult who not only can see the honesty and goodness in children but who can also see a true wolf in sheep's clothing like Harry.",
    "Director": "Charles Laughton",
    "Writer": "Davis Grubb, James Agee, Charles Laughton",
    "Actors": "Robert Mitchum, Shelley Winters, Lillian Gish",
    "Language": "English",
    "Country": "United States",
    "Awards": "2 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0047878",
    "tt0047934",
    "tt0047958",
    "tt0047904",
    "tt0049204",
    "tt0048064",
    "tt0048182",
    "tt0048254",
    "tt0048261",
    "tt0049801",
    "tt0047880",
    "tt0047985"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "film-noir",
      "name": "Film Noir"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T17:44:52.804Z"
}