{
  "imdbId": "tt0011953",
  "title": "Beau Revel",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewBeauRevel",
      "id": "PreviewBeauRevel",
      "title": "\"Beau Revel\" (1921)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Beau Revel\" is an acclaimed society drama. A middle-aged man's only purpose in life are numerous amorous conquests. One day he meets the next object of his desires and then finds out that the woman is his son's girlfriend.   Directed by               John Griffith Wray Produced by             Thomas H. Ince Productions Scenario                      Luther Reed Based on                    a screen story by Louis Joseph Vance Starring                     Lewis Stone, Florence Vidor, Kathleen Kirkham, Lloyd Hughes Cinematography        Henry Sharp Distributed by           Paramount Pictures Release date               March 20, 1921 Running time             69 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 83856362,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewBeauRevel",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 4100
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "69 min",
    "imdbRating": 5.1,
    "imdbVotes": 56,
    "Genre": "Drama",
    "Plot": "Lawrence Revel, celebrated in society circles for his success with women, is devoted to his son Dick and objects to his marrying Nellie, a cabaret dancer. To prove her unworthiness, Beau asks his son not to see her for 2 weeks. Unwittingly, Beau falls in love with the girl, but his attentions are refused. When Nellie's brother gets involved with the law, she seeks Beau's aid, but Dick arrives and a stormy scene ensues. Following his son's reproach, Beau leaps from the window to his death, and Dick seeks Nellie's forgiveness.",
    "Director": "John Griffith Wray",
    "Writer": "Luther Reed, Louis Joseph Vance",
    "Actors": "Lewis Stone, Florence Vidor, Lloyd Hughes",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0014496",
    "tt0012409",
    "tt0011513",
    "tt0013662",
    "tt0010534",
    "tt0011904",
    "tt0012027",
    "tt0012190",
    "tt0012397",
    "tt0012465",
    "tt0012532",
    "tt0011907"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}