{
  "imdbId": "tt0022291",
  "title": "Quick Trigger Lee",
  "year": 1931,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uzC0OaSWhd0",
      "id": "uzC0OaSWhd0",
      "title": "Quick Trigger Lee (1931) BOB CUSTER",
      "description": "🍕First Time on YouTube🍕\nStars: Bob Custer, Caryl Lincoln, Monte Montague\nDirector: J.P. McGowan\n\nQuick Trigger Lee features a film within a film. A film crew interrupts the Wales gang before it can ambush Lee, who is on his way to help an old prospector. Lee manages to get the gang jailed while becoming romantically involved with the film company's leading lady (Campbell), and he discovers that she is the prospector's long-lost niece.\n\nTRIVIA: Born Raymond Anthony Glenn on October 18, 1898, in Frankfort, Kentucky, Bob Custer made his film debut in the 1920s and quickly became a popular figure in the B-Western genre. His rugged good looks and ability to perform his own stunts helped him stand out among the many cowboy stars of the era.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join",
      "addedAt": "2025-12-24T01:05:20.628Z",
      "thumbnail": "https://i.ytimg.com/vi/uzC0OaSWhd0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAhWmuTgTzYB4RbQ-nF_0tK_1t6dg",
      "duration": 3211,
      "language": "en",
      "year": 1931,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "57 min",
    "imdbRating": 4.1,
    "imdbVotes": 27,
    "Genre": "Western",
    "Plot": "Jeremy Wales, a crook who stays on the safe side of the law but bends it whenever possible,has tricked short-sighted John 'Dad\" Saunders to sign a note for ten thousand dollars instead of the one thousand that Saunders borrowed to work his \"Rose o' My Heart\" mine. Saunders tells his problem to Phil Lee, a prosperous young rancher, whose method of settling problems has gained him the nickname of \"Quick Trigger.\" Lee ambles over to the Wales office and battles it out with Jeremy's son, Sam, and two henchmen and comes away with the note. Leaving the office, he rescues a girl from what is apparently a holdup and subsequent run-away team --- only to find that he has interrupted a scene which a motion picture company is filming. Rose Campbell, the actress in the scene, is impressed anyway and invites him to a dance at the hotel. Sam Wales has already met Rose and isn't too happy about seeing Lee with her. In a moonlight conversation, Rose tells Lee that she is searching for her grandfather, who she has not seen since her mother's death when Rose was a young child.She says his name is John Saunders and Lee says he knows him well, and Rose says take me to him after I change clothes and Lee says okay. While Rose is changing clothes, Sam and his two henchmen capture Lee and tie him up. Sam, driving a touring car longer than an 18-wheeler trailer, meets Rose and says he will take her to her grandfather because Lee is tied up and, besides that, Lee is just a two-bit swindler out to beat her old granpappy out of his mine. Rose buys that and gets in his convertible bus. But Lee has gotten free and he and his horse are on the way.",
    "Director": "J.P. McGowan",
    "Writer": "George Morgan",
    "Actors": "Bob Custer, Caryl Lincoln, Monte Montague",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021502",
    "tt0023428",
    "tt0023191",
    "tt0018654",
    "tt0021176",
    "tt0023967",
    "tt0024766",
    "tt0023934",
    "tt0021945",
    "tt0030970",
    "tt0022060",
    "tt0022413"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:35:21.765Z"
}