{
  "imdbId": "tt0041600",
  "title": "Lost Boundaries",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LostBoundaries",
      "title": "LostBoundaries",
      "description": "Title: Lost Boundaries Summary: This story is a true account of the lives of Scott and Marsha Carter. Having graduated from medical school, Scott Carter, a fair-skinned African American, marries Marsha Mitchell and moves ... Directed by: Alfred L. Werker Actors: Production Company: Louis De Rochemont Associates Release Date: 2 July 1949 (USA) Aspect Ratio: 1.37 : 1 This story is a true account of the lives of Scott and Marsha Carter. Having graduated from medical school, Scott Carter, a fair-skinned African American, marries Marsha Mitchell and moves to Georgia. When he arrives at the black clinic in Georgia, he discovers that the job must inconveniently go to a Southerner. Discussions between two nurses at this clinic suggest that Scott's light skin may have some bearing on the decision not to hire him. Defeated but not conquered, Scott returns to Massachusetts to live with his in-laws until he can get employment. He tries unsuccessfully to obtain employment as an African American. Because Marsha is pregnant, Scott decides to take a job at Portsmouth Hospital, but he reluctantly does so as a white man. While there, he manages to save the life of Dr. Bracket, who encourages him to take a postion in Keenham, New Hampshire. Scott decides to continue \"passing\" for white. In Keenham, Dr. Scott Carter proves to be quite a success for the town. For ...",
      "id": "LostBoundaries"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "99 min",
    "imdbRating": "7.0",
    "imdbVotes": "491",
    "Genre": "Drama",
    "Plot": "This story is a true account of the lives of Scott and Marsha Carter. Having graduated from medical school, Scott Carter, a fair-skinned African American, marries Marsha Mitchell and moves to Georgia. When he arrives at the black clinic in Georgia, he discovers that the job must inconveniently go to a Southerner. Discussions between two nurses at this clinic suggest that Scott's light skin may have some bearing on the decision not to hire him. Defeated but not conquered, Scott returns to Massachusetts to live with his in-laws until he can get employment. He tries unsuccessfully to obtain employment as an African American. Because Marsha is pregnant, Scott decides to take a job at Portsmouth Hospital, but he reluctantly does so as a white man. While there, he manages to save the life of Dr. Bracket, who encourages him to take a postion in Keenham, New Hampshire. Scott decides to continue \"passing\" for white. In Keenham, Dr. Scott Carter proves to be quite a success for the town. For twenty years, Dr. and Mrs. Carter live peacefully in Keenham with son, Howard and daughter, Shelley. All goes well until Scott and Howard decide to enter the military during World War II. When Scott applies for officer status with the Navy, an investigation reveals his black heritage, and he is barred from receiving a commission.",
    "Director": "Alfred L. Werker",
    "Writer": "Ormonde Dekay Jr., Maxime Furlaud, Eugene Ling",
    "Actors": "Beatrice Pearson, Mel Ferrer, Susan Douglas Rubes",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 3 nominations"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0038937",
      "title": "Shock",
      "year": 1946,
      "imdbRating": "6.3",
      "imdbVotes": "3,476",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045309",
      "title": "Walk East on Beacon!",
      "year": 1952,
      "imdbRating": "5.7",
      "imdbVotes": "584",
      "language": "English, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047917",
      "title": "Canyon Crossroads",
      "year": 1955,
      "imdbRating": "5.9",
      "imdbVotes": "111",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040366",
      "title": "Force of Evil",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "8,043",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041503",
      "title": "Impact",
      "year": 1949,
      "imdbRating": "7.0",
      "imdbVotes": "5,035",
      "language": "English, Cantonese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041109",
      "title": "Alimony",
      "year": 1949,
      "imdbRating": "5.3",
      "imdbVotes": "175",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041125",
      "title": "Anna Lucasta",
      "year": 1949,
      "imdbRating": "6.2",
      "imdbVotes": "173",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041221",
      "title": "Call of the Forest",
      "year": 1949,
      "imdbRating": "5.4",
      "imdbVotes": "111",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041239",
      "title": "Champion",
      "year": 1949,
      "imdbRating": "7.3",
      "imdbVotes": "4,948",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041113",
      "title": "All the King's Men",
      "year": 1949,
      "imdbRating": "7.4",
      "imdbVotes": "17,850",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041268",
      "title": "Criss Cross",
      "year": 1949,
      "imdbRating": "7.4",
      "imdbVotes": "10,070",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041555",
      "title": "Knock on Any Door",
      "year": 1949,
      "imdbRating": "6.6",
      "imdbVotes": "4,414",
      "language": "English, Italian, Latin",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T18:33:22.927Z"
}