{
  "imdbId": "tt0002098",
  "title": "Children Who Labor",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ChildrenWhoLabor1912",
      "title": "\"Children Who Labor\" (1912)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Children Who Labor\" is a short social drama produced for The National Child Labor Committee. We have included this film in our program to illustrate the work and contributions of our star Shirley Mason, a star of Silent Hall of Fame. Directed by               Ashley Miller (uncredited) Written by                Ethel Browning Starring                    Robert Conness, Miriam Nesbitt, Shirley Mason (as Leonie Flugrath), John Sturgeon, Mary Fuller, Viola Dana Produced by             Edison Company Distributed by          General Film Company Release date               February 23, 1912 Running time            13 m. Country                     United States Language                    Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "ChildrenWhoLabor1912"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-children-who-labor",
      "title": "Children Who Labor",
      "id": "silent-children-who-labor"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "13 min",
    "imdbRating": "5.9",
    "imdbVotes": "152",
    "Genre": "Drama, Short",
    "Plot": "A foreigner who does not understand the ways of this country, applies for work at a mill, but is sent away with the intimation that if has a child at home there will be work for it, but none for himself. We then travel in vision to New York to the home of a wealthy mill owner, to whom an appeal is being made to use his influence against child labor. He indicates that he can do nothing about it, and resents the insinuation that his own child might be one of the unfortunate except for her birth and his protection. His wife shows her interest in the project. We turn to the mill again and find that the foreigner, pushed by his poverty and unable get work himself, finally yields and puts his daughter to work, as the family must have bread. The next thing we see is that Hanscomb, the rich mill owner, has sent his wife and child on a journey, and the little one, getting off the train in a spirit of mischief, is left behind in a small town, which happens to be the same one in which the foreigner, aforementioned, and his family live. The child is found by them, and as they cannot understand each other, his kindly wife takes her home and shares her poor cottage with her. Of course Hanscomb and his wife are frantic and put detectives to work on the case, but without success. Meanwhile things go badly with the foreigner, and he feels that it is necessary to put the stranger to work with his own child. Hanscomb buys the mill and so unconsciously becomes the employer of his own child. Going to look over the new property, he enters the mill just as his own child has fainted and is cared for by her little companion, and so he misses her. She is carried past her own mother at the gate, and Mrs. Hanscomb, touched by the incident, though not knowing, of course, who the strange child is, gets her address and in the evening is there with the footman with a basket of food for the little sufferer. Of course there is a reunion. Mr. Hanscomb is sent for and finds that his little daughter has learned a lesson that he has not as yet. She refuses to be taken away by herself and insists that all the other little children be set free from their slavery. He is unable to refuse her request and the film story closes with the better conditions put into effect, though we are reminded at the end that the condition called \"Child Labor\" still exists and demands our attention.",
    "Director": "Ashley Miller",
    "Writer": "Ethel Browning",
    "Actors": "Robert Conness, Miriam Nesbitt, Shirley Mason",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0326223",
      "title": "A Suffragette in Spite of Himself",
      "year": 1912,
      "imdbRating": "5.7",
      "imdbVotes": "88",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002421",
      "title": "The Passer-by",
      "year": 1912,
      "imdbRating": "6.1",
      "imdbVotes": "122",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002621",
      "title": "The Ambassador's Daughter",
      "year": 1913,
      "imdbRating": "5.3",
      "imdbVotes": "84",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0477316",
      "title": "How Bumptious Papered the Parlor",
      "year": 1910,
      "imdbRating": "5.1",
      "imdbVotes": "124",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0234390",
      "title": "One Touch of Nature",
      "year": 1914,
      "imdbRating": "5.6",
      "imdbVotes": "81",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002381",
      "title": "The Musketeers of Pig Alley",
      "year": 1912,
      "imdbRating": "6.6",
      "imdbVotes": "2,540",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002054",
      "title": "A Beast at Bay",
      "year": 1912,
      "imdbRating": "5.8",
      "imdbVotes": "220",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002082",
      "title": "The Burglar's Dilemma",
      "year": 1912,
      "imdbRating": "6.0",
      "imdbVotes": "429",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002143",
      "title": "Dr. Jekyll and Mr. Hyde",
      "year": 1912,
      "imdbRating": "6.0",
      "imdbVotes": "893",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002121",
      "title": "A Cry for Help",
      "year": 1912,
      "imdbRating": "4.9",
      "imdbVotes": "49",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002342",
      "title": "Man's Genesis",
      "year": 1912,
      "imdbRating": "5.7",
      "imdbVotes": "112",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002400",
      "title": "The Old Actor",
      "year": 1912,
      "imdbRating": "5.7",
      "imdbVotes": "264",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}