{
  "movieId": "tt0026684",
  "title": "The Marines Are Coming",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMarinesareComing",
      "id": "TheMarinesareComing",
      "title": "The Marines Are Coming",
      "description": "When Lt. \"Wild Bill\" Traynor (William Haines), bad boy of the Marine Corps, arrives at a San Diego Marine Base, he is surprised to discover he has been assigned to duty under his old rival, Captain Benton (Conrad Nagel). While eluding the advances of Rosita (Armida), a Latin dancer, Bill becomes involved with Benton's fiancee, Dorothy Manning (Esther Ralston), whom he quickly wins and Benton accepts the impending marriage.",
      "fileSize": 1833967232,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheMarinesareComing",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 109926
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XEL8xSzFmuI",
      "id": "XEL8xSzFmuI",
      "title": "The Marines Are Coming (1934) DRAMA",
      "description": "Stars: William Haines, Conrad Nagel, Esther Ralston \n Director: David Howard\n\n Expelled from his lieutenancy in the Marine Corps, Bill Traylor reenlists as a private. His unit is sent to a Latin American country where a rebel leader called The Torch promotes insurrection. There Traylor encounters again Captain Benton, the man responsible for his disgrace and his rival for the love of a girl.",
      "addedAt": "2025-12-26T23:52:29.452Z",
      "thumbnail": "https://i.ytimg.com/vi/XEL8xSzFmuI/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLD4wnZRulwnoDzUpPwy-Qp4Av9AlA",
      "duration": 4253,
      "language": "en",
      "year": 1934,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "74 min",
    "imdbRating": 5.2,
    "imdbVotes": 247,
    "Genre": "Action, Drama, Romance",
    "Plot": "When Lt. \"Wild Bill\" Traynor, bad boy of the Marine Corps, arrives at a San Diego Marine Base, he is surprised to discover he has been assigned to duty under his old rival, Captain Benton (Conrad Nagel). While eluding the advances of Rosita (Armida), a Latin dancer, Bill becomes involved with Benton's fiancee, Dorothy Manning (Esther Ralston), whom he quickly wins and Benton accepts the impending marriage. On his wedding eve, Bill, in the company of Rosita, becomes involved in a fracas in a gambling joint in nearby Tia Juana. Rosita disappears and Dorothy calls off the wedding. As Dorthy sails for Latin America, Bill resigns in disgrace from the Marines, but re-enters as a Private. Ordered to duty in Ponta Miguel, Bill discovers that Dorothy's father (Hale Hamilton) is the governor. His old nemesis Benton has Bill sent to the guardhouse and Bill is vowing revenge when he is released, only to find that Benton is being held prisoner by a jungle bandit known as The Torch (George Regas.) Posing as a drunk and renegade, Bill enters the bandit's camp and, by mending a disabled machine gun, wins the confidence of the bandit leader. Bill later mans the gun against the bandits who have prepared a trap for the Marine patrol searching for Benton.",
    "Director": "David Howard",
    "Writer": "James Gruen, John Rathmell, Colbert Clark",
    "Actors": "William Haines, Esther Ralston, Conrad Nagel",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029376",
    "tt0025011",
    "tt0025220",
    "tt0026489",
    "tt0027008",
    "tt0027057",
    "tt0027366",
    "tt0030023",
    "tt0029830",
    "tt0029701",
    "tt0016690",
    "tt0028592"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}