{
  "imdbId": "tt0031427",
  "title": "Hitler: Beast of Berlin",
  "year": 1939,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=K_3U2vjfziw",
      "title": "Beast of Berlin (1939) ALAN LADD",
      "description": "Stars: Roland Drew, Steffi Duna, Greta Granstedt\nDirector: Sherman Scott\n\nSet in Germany during Hitler's rise to power, a few courageous opponents of fascism risk their lives to overthrow the Nazi regime. Co-stars Alan Ladd in his first role large enough to receive a screen credit.  (a.k.a. Hitler-Beast of Berlin)",
      "id": "K_3U2vjfziw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "87 min",
    "imdbRating": 5,
    "imdbVotes": 150,
    "Genre": "Drama, War",
    "Plot": "Hans Memling, a young intellectual, patriotic German, is secretly opposed to the Nazi regime. With the aid of Gustav Schultz, Father Pommer, Anna Wahl and others, he is gleaning accurate information from foreign radio broadcasts and distributing it through Germany with an underground-press operation. He convinces his brother-in-law Karl Bach, the brother of his wife Elsa, that Hitler is leading Germany toward a second world war. Karl, in love with Anna, joins the movement, determined to restore German culture and save the people from the brutality of the Storm Troopers and the Gestapo. The group has an inside link through Albert Stalhelm, a Storm Trooper and one of Hitler's Elite Guards. Albert is sickened by the brutalities he sees and wants to resign and flee Germany, but Hans persuades him to remain until they can find a replacement. He agrees, but warns the group that he is forced to join in the Nazi orgies and liquor loosens his tongue. Elsa is about to have a baby and lives in terror that her husband's activities will be discovered, and she tries to persuade Hans to immigrate to the United States as she does not want their child to grow up as a Nazi. He decides to stay because his duty to his country and civilization can not be put aside, and Elsa refuses to leave without him. Warned by Lustig, a beer-garden bartender, that the Gestapo is watching them, Hans and Erlich, another active anti-Nazi, escape. Lustig is jailed and tortured but can not be made to talk. Hans is later captured and turned over to Albert and two other SS men to be tortured, and Albert does not dare move to save his friend. Sickened by the brutality, Albert tries to go home, but is forced to join a party, where he gets drunk and says he has to go warn his friends. The SS men listen to him reveal the names of the group members, then shoot him. Hans, Lustig, Schultz, Karl and Father Pommer are thrown into a concentration camp, where the commandant is Hans' friend from World War I, Colonel Hess, who orders that Hans be treated decently, but the others do not fare well, as they are beaten, humiliated and forced to praise Hitler. Erlich, who has escaped the dragnet, tells Elsa and Anna that Lippert, a crooked Nazi lawyer, can secure Hans' release for a thousand marks. Hans and the others are sold out as slave labor by the camp guards who only see the oppressed prisoners as a means of personal profit. Hans bitterly tells Hess that Hitler is strangling Germany and that he will never submit to the rule of a lunatic. Hess orders him beaten and refuses to release him when Lippert's order comes through. Through the help of a guard, Braun, Hans escapes and he and Elsa reach the border, but Hans decides he can not leave Germany while the Nazis rule and he returns to help Erlich rebuild the anti-Nazi organization. Elsa stays with him.",
    "Director": "Sam Newfield",
    "Writer": "Shepard Traube, Fred Myton",
    "Actors": "Roland Drew, Steffi Duna, Greta Granstedt",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0031164",
      "title": "Code of the Cactus",
      "year": 1939,
      "imdbRating": 6.2,
      "imdbVotes": 106,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031318",
      "title": "Flaming Lead",
      "year": 1939,
      "imdbRating": 7,
      "imdbVotes": 71,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0031769",
      "title": "Outlaws' Paradise",
      "year": 1939,
      "imdbRating": 6.1,
      "imdbVotes": 58,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031929",
      "title": "Six-Gun Rhythm",
      "year": 1939,
      "imdbRating": 5.7,
      "imdbVotes": 82,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031305",
      "title": "Fighting Mad",
      "year": 1939,
      "imdbRating": 5.2,
      "imdbVotes": 90,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030159",
      "title": "Frontier Scout",
      "year": 1938,
      "imdbRating": 5.7,
      "imdbVotes": 107,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0135805",
      "title": "Billy the Kid's Gun Justice",
      "year": 1940,
      "imdbRating": 6,
      "imdbVotes": 117,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0133763",
      "title": "The Feud Maker",
      "year": 1938,
      "imdbRating": 5.4,
      "imdbVotes": 103,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032618",
      "title": "I Take This Oath",
      "year": 1940,
      "imdbRating": 5.1,
      "imdbVotes": 142,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033033",
      "title": "Secrets of a Model",
      "year": 1940,
      "imdbRating": 6.1,
      "imdbVotes": 29,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030870",
      "title": "Thunder in the Desert",
      "year": 1938,
      "imdbRating": 5.9,
      "imdbVotes": 67,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030556",
      "title": "Paroled - To Die",
      "year": 1938,
      "imdbRating": 5.3,
      "imdbVotes": 123,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:29:38.599Z"
}