{
  "movieId": "tt0064747",
  "title": "The Oblong Box",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-oblong-box-1969",
      "id": "the-oblong-box-1969",
      "title": "The Oblong Box (1969)",
      "description": "The Oblong Box is a 1969 British gothic horror film directed by Gordon Hessler, starring Vincent Price, Christopher Lee and Alister Williamson. The film is about Sir Edward Markham, who is disfigured in an African voodoo ceremony and kept locked away by his brother, Julian. Tired of his captivity, Edward fakes his death but is instead buried alive; he is later resurrected by graverobbers and embarks on a vengeful killing spree while wearing a crimson hood to conceal his appearance.",
      "fileSize": 2571139616,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-oblong-box-1969",
      "language": "eng",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 708
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "96 min",
    "imdbRating": 6,
    "imdbVotes": 4203,
    "Genre": "Horror",
    "Plot": "In the end of the Nineteenth Century, the aristocrat Edward Markham is disfigured by sorcery in Africa by the natives. His brother Julian Markham brings him back to the Markham Manor in England and keeps him prisoner in the attic. The mad Edward asks his lawyer Trench and his partner to bring the African sorcerer N'Galo in secret to heal him but Julian does not allow any contact with his brother. Trench and N'Galo simulate the death of Edward to remove him from the attic in a coffin. However, body snatchers bring his body to the unscrupulous Dr. Newhartt for his research. Edward offers a large amount to Dr. Newhartt to stay hidden in his house and wears a crimson hood to hide his face. When Edward goes to the town, his mask brings problem to him and he begins a series of murders. When he finally meets N'Galo, he finds why the natives have deformed him and he seeks revenge.",
    "Director": "Gordon Hessler",
    "Writer": "Edgar Allan Poe, Lawrence Huntington, Christopher Wicking",
    "Actors": "Vincent Price, Alister Williamson, Christopher Lee",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0067713",
    "tt0063285",
    "tt0066740",
    "tt0060536",
    "tt0063145",
    "tt0064240",
    "tt0168503",
    "tt0063242",
    "tt0065206",
    "tt0062957",
    "tt0064186",
    "tt0068713"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}