{
  "movieId": "tt0023749",
  "title": "Air Hostess",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/air-hostess-1933-",
      "id": "air-hostess-1933-",
      "title": "Air Hostess (1933)",
      "description": "Evelyn Knapp, Thelma Todd",
      "fileSize": 1051734614,
      "addedAt": "2026-01-07T00:07:24.994Z",
      "thumbnail": "https://archive.org/services/img/air-hostess-1933-",
      "collection": "feature_films",
      "downloads": 1268
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "67 min",
    "imdbRating": 5.8,
    "imdbVotes": 154,
    "Genre": "Drama",
    "Plot": "In World War I, pilot Bob King is shot and killed in France. His friends Ted \"Lucky\" Hunter (James Murray) and Pa Kearns (J.M. Kerrigan) pledge to look after his daughter, Kitty (Evalyn Knapp).[Note 3] Years later, after the war, Kearns, now blind, works at an airport as an engine expert while Kitty is a TWA stewardess. Her father's friends still look after her as meddling chaperones. A grandstanding Ted flies over the airport, meeting Kitty who is enamored with him. After a night on the town, he flies her back to the airport, but is met by angry mechanics and pilot Dick Miller (Arthur Pierson), who is in love with Kitty and ends up in a fight. Ted soon announces his marriage to Kitty and forces her to quit her job. Dick gets her her job back when Ted is unable to make a living. Rich, three-time divorcee Sylvia Carleton (Thelma Todd) offers Ted a chance to build a radical new aircraft that can fly across the Pacific. A tête-à-tête between Ted and Sylvia in Albuquerque turns into a fiasco when Kitty and Dick arrive to find them both drunk. Kitty leaves angrily for home, boarding a train that Ted and Dick learn is headed for a collapsing bridge. Both men try to save Kitty by flying to warn the engineer. Ted crash-lands on the tracks and wrecks his aircraft, but stops the train in time. Dick flies him back to the hospital with Kitty, as the couple reunites.",
    "Director": "Albert S. Rogell",
    "Writer": "Grace Perkins, Milton Raison, Keene Thompson",
    "Actors": "Evalyn Knapp, James Murray, Arthur Pierson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026047",
    "tt0028525",
    "tt0023537",
    "tt0025303",
    "tt0023381",
    "tt0026593",
    "tt0026360",
    "tt0026231",
    "tt0026085",
    "tt0022484",
    "tt0024055",
    "tt0024300"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.994Z"
}