{
  "movieId": "tt0044000",
  "title": "The White Sheik",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-white-sheik",
      "id": "the-white-sheik",
      "title": "The White Sheik",
      "description": "Federico Fellini drew upon his background as a cartoonist for his first solo feature, a charming comic fable about the lure of fantasy and the pitfalls of temptation. In Rome for her honeymoon, a wide-eyed newlywed (Brunella Bovo) sneaks away from her straitlaced groom (Leopoldo Trieste) and goes in search of the White Sheik (Alberto Sordi), the dashing hero of a photographed comic strip of which she is enamored—but soon discovers that her romantic ideal may be only an illusion. Featuring a memorable appearance by Giulietta Masina (playing the character she would reprise in  Nights of Cabiria ) and Fellini’s first collaboration with composer Nino Rota,  The White Sheik  finds the director already taking up one of his favorite themes: the alchemical interplay between life and art, imagination and reality.",
      "fileSize": 7072211075,
      "addedAt": "2026-01-07T00:12:33.206Z",
      "thumbnail": "https://archive.org/services/img/the-white-sheik",
      "language": "ita",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 10168
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "83 min",
    "imdbRating": 7.2,
    "imdbVotes": 7087,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Incredibly, only moments after arriving in Rome for their honeymoon, pure young bride Wanda sneaks out of her room, leaving her fastidious groom Ivan all alone. Obsessed with the very masculine Fernando Rivoli--the hero of her favorite romantic photo-novel, The White Sheik--Wanda plucks up the courage to meet him in person, only to be seduced by the arrogant protagonist, so far away from the hotel and her husband. As a result--perplexed by Wanda's strange disappearance, and unable to disclose the news to his family--Ivan meanders through the ill-lit Roman streets in search of his wife, on pins and needles, waiting for their 11:00 appointment with his uncle and the Papal Audience at the Vatican. What does the new day have in store for the separated newlyweds?",
    "Director": "Federico Fellini",
    "Writer": "Michelangelo Antonioni, Federico Fellini, Tullio Pinelli",
    "Actors": "Alberto Sordi, Giulietta Masina, Brunella Bovo",
    "Language": "Italian",
    "Country": "Italy",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0043651",
    "tt0043313",
    "tt0043526",
    "tt0178749",
    "tt0042665",
    "tt0047437",
    "tt0041587",
    "tt0048370",
    "tt0040762",
    "tt0040395",
    "tt0040474",
    "tt0032599"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.206Z"
}