{
  "imdbId": "tt0020516",
  "title": "The Trial of Mary Dugan",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-trial-of-mary-dugan-1929",
      "id": "the-trial-of-mary-dugan-1929",
      "title": "The Trial Of Mary Dugan (1929)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The Trial of Mary Dugan was the first sound picture for prolific actress Norma Shearer, and it was an  important success for her. This drama based on a play showed that she could not only lead a talkie, but that she was extremely suited for the format. Unfortunately, the plot was considered so risqué at the time that it was cited as one of the catalysts that led to the formation of the Hays Code.  Regrettably, the best copy of this film that I could find has numerous visual issues and suddenly cuts off at the end before the end card can be shown. Still, this is the highest quality version that I could find through my research. ",
      "fileSize": 1758730514,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-trial-of-mary-dugan-1929",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 101
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "113 min",
    "imdbRating": 6.3,
    "imdbVotes": 144,
    "Genre": "Drama",
    "Plot": "Mary Dugan, a Broadway showgirl, is charged with murder in the knifing death of her wealthy lover, and goes on trial for her life. When her defense counsel appears to bungle his job, Mary's brother Jimmy, a newly licensed attorney, jumps into the case to defend his sister. Jimmy's courtroom style is unconventional, but he seems to be holding his own against the prosecuting attorney... until a surprise testimony changes the course of the trial.",
    "Director": "Bayard Veiller",
    "Writer": "Becky Gardiner, Bayard Veiller",
    "Actors": "Norma Shearer, Lewis Stone, H.B. Warner",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0020488",
    "tt0020126",
    "tt0020081",
    "tt0020589",
    "tt0019067",
    "tt0019591",
    "tt0019824",
    "tt0020686",
    "tt0018054",
    "tt0020030",
    "tt0019644",
    "tt0019765"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}