{
  "movieId": "tt0056277",
  "title": "Night Creatures",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night-creatures",
      "id": "night-creatures",
      "title": "Night Creatures",
      "description": "In 18th-century England, the Royal Crown sends Royal Navy Captain Collier and his crew to investigate reports of illegal smuggling and bootlegging in a coastal town where locals believe in Marsh Phantoms.",
      "fileSize": 6731283471,
      "addedAt": "2026-01-07T00:10:02.897Z",
      "thumbnail": "https://archive.org/services/img/night-creatures",
      "language": "eng",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 6889
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/night.-creatures.-1962",
      "id": "night.-creatures.-1962",
      "title": "Night Creatures (1962)",
      "description": "Night Creatures , also known as Captain Clegg , is a British horror film released in 1962 by Hammer Film Productions. Directed by Peter Graham Scott , the film stars Peter Cushing in the role of Reverend Doctor Blyss and features Oliver Reed , Yvonne Romain , and Patrick Allen in prominent roles. The movie intertwines elements of pirate adventure and supernatural themes, based on Russell Thorndike's novel, Dr. Syn: A Tale of the Romney Marsh . The plot revolves around Reverend Doctor Blyss , who is not just a pious church leader but also conceals a darker identity as the notorious pirate Captain Clegg . The story is set against the backdrop of Dymchurch, where Blyss must navigate the tensions created by the arrival of naval officers investigating reports of local smuggling. Blyss's double life unfolds amidst the eerie marshes where supernatural occurrences, notably spectral marsh phantoms, intensify the mystery. Those glowing skeletons on ghostly horses are a representation of the film's unique blend of horror and adventure.",
      "fileSize": 1333104328,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/night.-creatures.-1962",
      "language": "eng",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 304
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "82 min",
    "imdbRating": 6.6,
    "imdbVotes": 3741,
    "Genre": "Adventure, Drama",
    "Plot": "In this engaging costume melodrama of skulduggery on the low seas set back in the 18th-century, the Royal Crown suspects a bit of smuggling is going on in this locale, and they send Captain Collier and his crew to check it out. As the Captain gets into his investigation, mysterious swamp phantoms cloud up the real issue which seems plain enough to see. Captain Collier suspects that the odd village vicar might be hiding something, and what better way to do that than by fortuitous ghosts to scare away the curious, or by posing as someone he is not?",
    "Director": "Peter Graham Scott",
    "Writer": "Anthony Hinds, Barbara S. Harper, Russell Thorndike",
    "Actors": "Peter Cushing, Yvonne Romain, Patrick Allen",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0057105",
    "tt0056211",
    "tt0056063",
    "tt2461750",
    "tt0056556",
    "tt0055719",
    "tt0056676",
    "tt0055323",
    "tt0178515",
    "tt0055117",
    "tt0055867",
    "tt0054953"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.898Z"
}