{
  "movieId": "tt0050225",
  "title": "Campbell's Kingdom",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/campbells-kingdom-1957",
      "id": "campbells-kingdom-1957",
      "title": "Campbell's Kingdom (1957)",
      "description": "Given only six months to live, Englishman Bruce Campbell goes to Canada to claim \"Campbell's Kingdom\", the land he inherited from his grandfather. In order to clear his grandfather's name and prove there is oil on the land, Campbell must face up to a ruthless contractor and work against the clock to find oil before \"Campbell's Kingdom\" is flooded by a new power dam. Watch on RetroFlix:  https://retroflix.org/campbells-kingdom-1957/",
      "fileSize": 2512409570,
      "addedAt": "2026-01-07T00:07:45.166Z",
      "thumbnail": "https://archive.org/services/img/campbells-kingdom-1957",
      "language": "eng",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 131
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "102 min",
    "imdbRating": 6.3,
    "imdbVotes": 954,
    "Genre": "Adventure, Drama",
    "Plot": "Bruce Campbell (Dirk Bogarde) arrives in Canada to take over his grandfather's inheritance, an area on the Rockies known as Campbell's Kingdom. Told by doctors he has a short time to live, he just a wants to live quietly up at his grandfather's house in peace. But he soon learns that a dam is being built that will flood Campbell's Kingdom. After locals, who gave money to his grandfather believing there to be oil, but losing their money, they all want the dam to be built to give them jobs. Bruce is given a letter from his grandfather that says he believes there is oil in Campbell's Kingdom, which would stop the work on the dam. Bruce decides to try and clear his grandfather's name and his claim about the oil. In the process, he has to face the forces of nature and ruthless contractor Owen Morgan (Stanley Baker).",
    "Director": "Ralph Thomas",
    "Writer": "Hammond Innes, Robin Estridge",
    "Actors": "Dirk Bogarde, Stanley Baker, Michael Craig",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0052270",
    "tt0049357",
    "tt0052170",
    "tt0053354",
    "tt0050803",
    "tt0050208",
    "tt0050431",
    "tt0050579",
    "tt0050629",
    "tt0050649",
    "tt0050212",
    "tt0050356"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.166Z"
}