{
  "movieId": "tt0067595",
  "title": "The Point",
  "year": 1971,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=264BO4SKXn4",
      "id": "264BO4SKXn4",
      "title": "The POINT (1971) HARRY NILSSON🍕 RINGO STARR NARRATION🍕 FULL MOVIE",
      "description": "CHARLIE BROWN takes a trip on THE YELLOW SUBMARINE\nSongs: Harry Nilsson (Words & Music)\nDirector/Animator: Fred Wolf\nVoices: Ringo Starr, Mike Lookinland, Paul Frees\nWriters: Harry Nilsson (story), Norm Lenzer (screenplay)\n🍕 NEW HD RESTORATION🍕 \nHarry Nilsson’s metaphorical tale of our society's resistance to those who are different and for staying true to your own beliefs. The Brady Bunch’s Mike Lookinland is the voice of Oblio, a young boy who is banished from the fantastical Pointed kingdom for having no point. Ringo Starr is the voice of Oblio’s father and the narrator. \n\nTrivia: Paul Frees is best remembered as \"The Man of a Thousand Voices.\" He worked for Metro-Goldwyn-Mayer, Walter Lantz, Rankin/Bass, Jay Ward Productions, and Walt Disney during the Golden Age of Animation. He provided the voices of many characters, including Boris Badenov of The Rocky and Bullwinkle Show.",
      "addedAt": "2025-12-24T01:10:03.249Z",
      "thumbnail": "https://i.ytimg.com/vi/264BO4SKXn4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBV82ZPrn4jWJw5JIPJ7-LvikJ_pA",
      "duration": 4657,
      "language": "en",
      "year": 1971,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "74 min",
    "imdbRating": 7.5,
    "imdbVotes": 3130,
    "Genre": "Animation, Adventure, Family",
    "Plot": "An animated story of an unusual kingdom in which everything and everybody is pointed, except for a young boy named Oblio (Mike Lookinland). Despite his round head, Oblio has many friends. But an evil Count (Lennie Weinrib), jealous that Oblio is more popular than his own son (Buddy Foster), says that without a pointed head, Oblio is an outlaw. Along with his faithful dog Arrow, Oblio is exiled to the Pointless Forest. There, he has many fantastic experiences (including encounters with a three-headed man, giant bees, a tree in the leaf-selling business (Paul Frees), and a good-humored old rock (Bill Martin)). From his adventures, Oblio learns that it is not at all necessary to be pointed to have a point in life. Music composed and performed by Harry Nilsson (\"Me and My Arrow\"), who also wrote the story.",
    "Director": "Fred Wolf",
    "Writer": "Harry Nilsson, Carole Beers, Norm Lenzer",
    "Actors": "Ringo Starr, Dustin Hoffman, Paul Frees",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0126189",
    "tt6181728",
    "tt0885415",
    "tt0158780",
    "tt0066328",
    "tt0068190",
    "tt0068311",
    "tt0178401",
    "tt0152240",
    "tt0070814",
    "tt0064360",
    "tt0073686"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    },
    {
      "id": "1970s",
      "name": "1970s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:41:33.677Z"
}