{
  "movieId": "tt0041113",
  "title": "All the King's Men",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1949-all-the-kings-men-el-politico-robert-rossen-vose",
      "id": "1949-all-the-kings-men-el-politico-robert-rossen-vose",
      "title": "1949 - All The King's Men - El político - Rossen - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com t.me/agendasociocultural",
      "fileSize": 756880934,
      "addedAt": "2026-01-07T00:06:06.561Z",
      "thumbnail": "https://archive.org/services/img/1949-all-the-kings-men-el-politico-robert-rossen-vose",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 4216
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/all-the-kings-men-1949-directed-by-robert-rossen-starting-broderick-crawford-joh",
      "id": "all-the-kings-men-1949-directed-by-robert-rossen-starting-broderick-crawford-joh",
      "title": "All The King's Men (1949) Directed By Robert Rossen Starting Broderick Crawford, John Ireland, Mercedes McCambridge, Joanne Dru",
      "description": "All the King's Men is a 1949 American FILM NOlR written, produced, and directed by Robert Rossen. It is based on the 1946 Robert Penn Warren novel of the same name. The film stars Broderick Crawford, John Ireland, Mercedes McCambridge, and Joanne Dru. The plot focuses on the rise and fall of the ambitious and ruthless politician, Willie Stark (Crawford) in the American South. Though a fictional character, Stark strongly resembles Louisiana governor Huey Long.   The movie won three Academy Awards, including the Academy Award for Best Picture, the award for Best Actor, which went to Broderick Crawford, and the award for Best Supporting Actress, won by Mercedes McCambridge.   In 2001, \"All the King's Men\" was deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress and was selected for preservation in the United States National Film Registry.   You can find out more about this movie from Wikipedia .",
      "fileSize": 1910045652,
      "addedAt": "2026-01-07T00:07:24.998Z",
      "thumbnail": "https://archive.org/services/img/all-the-kings-men-1949-directed-by-robert-rossen-starting-broderick-crawford-joh",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 20020
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "110 min",
    "imdbRating": 7.4,
    "imdbVotes": 17850,
    "Genre": "Drama, Film-Noir",
    "Plot": "Jack Burden is a newspaper reporter who first hears of Willie Stark when his editor sends him to Kanoma County to cover the man. What's special about this nobody running for county treasurer? He's supposedly an honest man. Burden discovers this to be true when he sees Stark delivering a speech and having his son pass out handbills, while the local politicians do their best to intimidate him. Willie Stark is honest and brave. He's also a know-nothing hick whose schoolteacher wife has given him what little education he has. Stark loses the race for treasurer, but later makes his way through law school, becoming an idealistic attorney who fights for what is good. Someone in the governor's employ remembers Stark when the governor needs a patsy to run against him and split the vote of his rival. The fat cats underestimate Stark; but Jack Burden, Stark's biggest supporter, overestimates the man's idealism. To get where he wants to go, Willie Stark is willing to crack a few eggs - which include his tough-talking assistant, Sadie Burke; Jack's poised and elegant fiancée, Anne Stanton; and even Jack Burden himself.",
    "Director": "Robert Rossen",
    "Writer": "Robert Penn Warren, Robert Rossen",
    "Actors": "Broderick Crawford, John Ireland, Joanne Dru",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 3 Oscars. 16 wins & 10 nominations total"
  },
  "relatedMovies": [
    "tt0039515",
    "tt0039204",
    "tt0041125",
    "tt0040671",
    "tt0043998",
    "tt0043320",
    "tt0039748",
    "tt0043812",
    "tt0041503",
    "tt0041239",
    "tt0041268",
    "tt0041555"
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.998Z"
}