{
  "imdbId": "tt0039914",
  "title": "The Trespasser",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-trespasser-1947",
      "id": "the-trespasser-1947",
      "title": "The Trespasser",
      "description": "Title: The Trespasser Summary: Stevie Carson, a newspaper reporter, and Denny Butler, the feature editor on the same newspaper, set out to track down a gang of literary forgers who are making a fortune off of selling fake first editions. Directed by: George Blair Actors: Dale Evans, Warren Douglas, Janet Martin Production Company: Republic Pictures (I) Release Date: 3 July 1947 (USA) Aspect Ratio: 1.37 : 1 \"Stevie' Carson (Janet Martin (I)'), daughter of a famous newspaperman, has ambitions to follow in her father's footsteps and visits the City Room of \"The Gazette\" in search of a job. There, Danny Butler (Warren Douglas), in charge of the newspaper morgue, plays a mean trick on her but, through a fluke, she is befriended by Bill Monroe ('Dougls Fowley'), the paper's feature editor, who introduces her to the paper's publisher, Channing Bliss ('Francis PIerlot'), and she is hired and assigned to Danny's department. She learns that Bliss is a collector of rare books which he buys through the paper's literary editor, Bruce Coleman (William Bakewell), and she accidentally learns that Bliss' latest acquisition is a phony first-edition. She tells Bill who confronts Coleman. The latter admits the forgery but stalls Bill, promising to make amends. Coleman visits the bookshop of E.Charles (Gregory Gaye), forger of the book, and tells him the jig is up. ",
      "fileSize": 4885817407,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-trespasser-1947",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 2618
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 6.3,
    "imdbVotes": 61,
    "Genre": "Action, Adventure, Crime",
    "Plot": "\"Stevie' Carson (Janet Martin (I)'), daughter of a famous newspaperman, has ambitions to follow in her father's footsteps and visits the City Room of \"The Gazette\" in search of a job. There, Danny Butler (Warren Douglas), in charge of the newspaper morgue, plays a mean trick on her but, through a fluke, she is befriended by Bill Monroe ('Dougls Fowley' )qv)), the paper's feature editor, who introduces her to the paper's publisher, Channing Bliss ('Francis PIerlot'), and she is hired and assigned to Danny's department. She learns that Bliss is a collector of rare books which he buys through the paper's literary editor, Bruce Coleman (William Bakewell), and she accidentally learns that Bliss' latest acquisition is a phony first-edition. She tells Bill who confronts Coleman. The latter admits the forgery but stalls Bill, promising to make amends. Coleman visits the bookshop of E.Charles (Gregory Gaye), forger of the book, and tells him the jig is up. Charles plots to kill Bill to prevent any further inquiries. Coleman then goes to his sister, Linda (Dale Evans), who is engaged to Bill and tells her a lie that Bill is mixed up with a forgery gang and that Bill is taking him to the gang's hideout. The car he and Bill are riding in is forced off the road and Coleman is killed and Bill injured. Linda thinks Bill had her brother hilled. Bill, in an effort to clear his name enlists the aid of \"Stevie.\" Linda still suspects Bill but since her brother mentioned Charles' bookshop, she and \"Stevie\" go there to investigate. The forger promptly makes prisoners of the two girls. Bill learns from Danny that the two girls are canvassing the city's bookstore but does not know which one, and his search for the two damsels-in-distress is hindered by Detective-Lieutenant Kirk (Grant Withers) who is suspicious of Bill.",
    "Director": "George Blair",
    "Writer": "Jerry Sackheim, Erwin Gelsey, Dorrell McGowan",
    "Actors": "Dale Evans, Warren Douglas, Janet Martin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040447",
    "tt0042453",
    "tt0040269",
    "tt0041108",
    "tt0038058",
    "tt0039972",
    "tt0040500",
    "tt0041547",
    "tt0037694",
    "tt0041822",
    "tt0041765",
    "tt0039361"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}