{
  "movieId": "tt0010321",
  "title": "Just Neighbors",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Just_Neighbors",
      "id": "Just_Neighbors",
      "title": "Just Neighbors",
      "description": "From IMDb : Suburban neighbors (Lloyd and Pollard) join together to build a garden shed, but through carelessness, wind up ruining the garden, as well as the laundry, which is drying in the yard. Further mayhem ensues when chickens are set loose. Stars: Harold Lloyd, Bebe Daniels, and Harry Pollard",
      "fileSize": 210696157,
      "addedAt": "2026-01-07T00:06:30.621Z",
      "thumbnail": "https://archive.org/services/img/Just_Neighbors",
      "language": "English",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 14601
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/harold-lloyd-just-neighbors-1919-directed-by-harold-lloyd-frank-terry",
      "id": "harold-lloyd-just-neighbors-1919-directed-by-harold-lloyd-frank-terry",
      "title": "Just Neighbors (1919) Directed By Harold Lloyd, Frank Terry",
      "description": "Just Neighbors Directed by Harold Lloyd Frank Terry Produced by Hal Roach Starring Harold Lloyd Cinematography Fred Guiol Release date July 13, 1919 Running time 13 minutes Country United States Language Silent (English intertitles ) Just Neighbors is a 1919 American silent short comedy film featuring Harold Lloyd . Prints of the film survive in the film archives at George Eastman House , the UCLA Film and Television Archive , Filmoteca Española , and Library and Archives Canada . [ 1 ] Plot Harold and Snub are friendly neighbors who have adjoining backyards. Harold's good-natured attempt to help Snub build a chicken coop in his backyard leads a series of destructive mishaps. They culminate in the two men fighting even though they are separated by a fence. Their friendship is restored when Snub's toddler daughter, who has wandered into a busy street, is rescued. Cast Harold Lloyd as The Boy Bebe Daniels as The Bride Snub Pollard as The Neighbor Sammy Brooks as Short man in bank (uncredited) Helen Gilmore as Old woman with packages (uncredited) Margaret Joslin as Neighbor's Wife (uncredited) Gus Leonard as Bearded bank teller / Vegetable vendor (uncredited) Gaylord Lloyd as Man in Line at Bank (uncredited) Marie Mosquini (uncredited) Charles Stevenson as Postman (uncredited) Noah Young (uncredited) See also Harold Lloyd filmography References \"Progressive Silent Film List: Just Neighbors \" . silentera.com . Retrieved March 16, 2008 .",
      "fileSize": 141025365,
      "addedAt": "2026-01-07T00:08:39.344Z",
      "thumbnail": "https://archive.org/services/img/harold-lloyd-just-neighbors-1919-directed-by-harold-lloyd-frank-terry",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 66
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "9 min",
    "imdbRating": 6.2,
    "imdbVotes": 591,
    "Genre": "Short, Comedy",
    "Plot": "Suburban neighbors (Lloyd and Pollard) join together to build a garden shed, but through carelessness, wind up ruining the garden, as well as the laundry, which is drying in the yard. Further mayhem ensues when chickens are set loose.",
    "Director": "Harold Lloyd, Frank Terry",
    "Writer": "N/A",
    "Actors": "Harold Lloyd, Bebe Daniels, 'Snub' Pollard",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010311",
    "tt0010656",
    "tt0009887",
    "tt0008860",
    "tt0009932",
    "tt0009973",
    "tt0009986",
    "tt0010006",
    "tt0010023",
    "tt0010181",
    "tt0010279",
    "tt0010382"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.344Z"
}