{
  "imdbId": "tt0001016",
  "title": "Resurrection",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Resurrection_201401",
      "title": "\"Resurrection\" (1909) starring Arthur V. Johnson and Florence Lawrence",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Resurrection\" is a short drama based on the novel Resurrection by Leo Tolstoy. The film is included in our program to illustrate the work of three of our stars: actress Florence Lawrence, actor Arthur V. Johnson and cinematographer Billy Bitzer. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Arthur V. Johnson, Florence Lawrence Distributed by                   Biograph Company Release date                      May 20, 1909 Country                             United States Running time                    12 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "Resurrection_201401"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-resurrection",
      "title": "Resurrection",
      "id": "silent-resurrection"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "12 min",
    "imdbRating": "5.1",
    "imdbVotes": "152",
    "Genre": "Drama, Short",
    "Plot": "Free adaptation of Leo Tolstoy's powerful novel. The subject opens with the return home of Prince Dimitri, who meets the maid Katusha, a little peasant girl, and is instantly charmed with her beauty. Young, artless and innocent, as pretty as a rose, she unwittingly fascinates the prince. His noble bearing likewise impresses her, and his little attentions flatter her, until at length she is unable to resist his advances. The poor girl is meted the usual fate. An alliance is out of the question. The disparity of their ranks even forbids it, and soon the prince must cast her aside. Five years later we find that the girl, who is now a loathsome sight, has learned the bitter lesson of the eternal truth, \"The wages of sin is death.\" It is death to the soul at all events. She has gone down to the lowest depths and is arrested in a low Russian tavern. As she is carried to the tribunal she passes Prince Dimitri, who now sees the terrible result of his sins. He grows repentant and attempts to plead her cause before the jury, but they are a callous lot and pay no attention to the arguments for nor against, and by force of habit vote to send her to Siberia. She is dragged out to the pen of detention and herded with a lot of poor unfortunates, who scarcely bear any resemblance to human beings. The repentant prince determines to give up his life to right the wrong he has done, and visits her here with a view of turning her now vicious nature, handing her a copy of the Bible. She does not recognize him at first, but when she does she flies into fury, beating his body and face with her fists and the book. He leaves her and she sits moodily on the bench with the book on her lap. Shortly she turns its pages and lo, the Resurrection! Her eyes fall on the passage (John xi, 25), \"And Jesus said unto her: I am the resurrection and the life: he that believeth in me, though he were dead yet shall he live.\" In an instant her whole being changes. There is hope for her salvation, and she reads on. The guards arrive and we next see her with the poor unfortunates trudging over the snow-clad steppes toward the goal from whence few return. She becomes the ministering angel, sharing her comforts with them. The prince, meanwhile, has secured her pardon and hastens after her. Giving her the welcome notice, he begs her to return with him as his wife: but no, she prefers to work out her salvation helping those poor souls to whom a kindness is an indescribable blessing, and bidding him farewell, she renounces the world for the path of duty, so we leave her kneeling on the snow at the foot of the Holy Cross.",
    "Director": "D.W. Griffith",
    "Writer": "Lev Tolstoy, Frank E. Woods",
    "Actors": "Arthur V. Johnson, Florence Lawrence, Marion Leonard",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001032",
      "title": "The Sealed Room",
      "year": 1909,
      "imdbRating": "6.0",
      "imdbVotes": "985",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000828",
      "title": "Confidence",
      "year": 1909,
      "imdbRating": "5.3",
      "imdbVotes": "114",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000986",
      "title": "Nursing a Viper",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "120",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000946",
      "title": "The Lure of the Gown",
      "year": 1909,
      "imdbRating": "4.6",
      "imdbVotes": "79",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001088",
      "title": "The Way of Man",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "78",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000852",
      "title": "A Drunkard's Reformation",
      "year": 1909,
      "imdbRating": "5.7",
      "imdbVotes": "261",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001050",
      "title": "A Strange Meeting",
      "year": 1909,
      "imdbRating": "4.9",
      "imdbVotes": "90",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001072",
      "title": "A Trap for Santa Claus",
      "year": 1909,
      "imdbRating": "5.6",
      "imdbVotes": "409",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000797",
      "title": "At the Altar",
      "year": 1909,
      "imdbRating": "5.4",
      "imdbVotes": "177",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000854",
      "title": "Edgar Allan Poe",
      "year": 1909,
      "imdbRating": "5.9",
      "imdbVotes": "573",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000871",
      "title": "Fools of Fate",
      "year": 1909,
      "imdbRating": "5.7",
      "imdbVotes": "119",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000942",
      "title": "The Lonely Villa",
      "year": 1909,
      "imdbRating": "6.1",
      "imdbVotes": "1,054",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}