{
  "movieId": "tt0001333",
  "title": "Muggsy's First Sweetheart",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewMuggsysFirstSweetheart",
      "id": "PreviewMuggsysFirstSweetheart",
      "title": "\"Muggsy's First Sweetheart\" (1910) director D. W. Griffith with Mary Pickford",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Muggsy's First Sweetheart\" is a short comedy, included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame. A young fellow visits a girl's home with unpredictable complications. Directed by               D. W. Griffith Produced by             Biograph Company Scenario by                Frank E. Woods      Starring                     Billy Quirk, Mary Pickford, Clara T. Bracy, Flora Finch, George Nichols Cinematography        Billy Bitzer Distributed by           Biograph Company Release date               June 3, 1910 Running time             13 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 24332022,
      "addedAt": "2026-01-07T00:06:45.467Z",
      "thumbnail": "https://archive.org/services/img/PreviewMuggsysFirstSweetheart",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 4756
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "16 min",
    "imdbRating": 5.6,
    "imdbVotes": 54,
    "Genre": "Short, Comedy",
    "Plot": "Muggsy is in a susceptible mood when little Mabel Brown passes. Kids together, they always experienced an attraction one for the other, and now, before he realizes it, Muggsy is in love, as is also Mabel. He braves the derision of his youthful companions, who have not as yet been stung by Cupid's dart, and escorts her home. Arriving at the Brown domicile, Muggsy asks if he might call in the evening; to this she gives consent. During the afternoon Mr. Brown, Mabel's father, has varnished a chair and it is in the reception room, he thinks, out of harm's way. A Muggsy's home there are great doing dressing Muggsy up in his new spring suit. He is mother's own dear boy and she wants him to look well. The fates conspire against poor Muggsy for he is ushered into the sitting room and, of course, sits on the varnished chair, so when he arises he leaves his coat and a portion of his trousers fixed thereto. The father helps him out with a suit of his clothes which are about three times too large for him. Thus attired, he reaches home gloomy indeed, for he feels that he has lost Mabel forever. However, there is a ray of sunshine in a letter from Mabel, for she sees that Muggsy has been cruelly victimized. On his way to the house he meets Mabel, and together they enter just after the National Uplift Committee has called. This Committee is on a crusade against all things that are degenerating, vulgar or harmful to the young, and Mrs. Brown joins the movement and consents that they remove anything of that character from her home. They have just started the uplift when the young lovers enter. Seeing these strangers packing the tabooed articles into baskets, they are mistaken fur burglars and Muggsy throws them out bodily. When he learns the real identity of his victims, Muggsy feels he is in bad again, but the Browns, upon looking through the baskets and finding some of their most treasured articles lifted in the uplift, consider Muggsy the hero of the day.",
    "Director": "D.W. Griffith",
    "Writer": "Frank E. Woods",
    "Actors": "Billy Quirk, Mary Pickford, Clara T. Bracy",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001458",
    "tt0000877",
    "tt0000800",
    "tt0000938",
    "tt0002478",
    "tt0001062",
    "tt0001002",
    "tt0000892",
    "tt0001054",
    "tt0000878",
    "tt0000922",
    "tt0000946"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.467Z"
}