{
  "imdbId": "tt0029102",
  "title": "Lady Behave!",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lady_behave",
      "title": "Lady Behave",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "lady_behave"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sjps-6E8Ge0",
      "title": "Lady Behave! (1937) | Colorized Public Domain Screwball Comedy with Sally Eilers and Neil Hamilton",
      "description": "Lady Behave! (1937) is a lively American screwball comedy directed by Lloyd Corrigan and released during Hollywood’s golden era of fast-talking romantic farces. This colorized and digitally restored edition revives the film’s playful energy and sharp humor, originally captured in black and white, and makes it fresh and accessible for today’s audiences across the United States, Europe, and worldwide. Featuring Sally Eilers, Neil Hamilton, and Joseph Schildkraut, this public domain gem exemplifies the witty chaos and romantic entanglements that made 1930s comedies a lasting part of cinema history.\n\nPlot Summary:\nThe story revolves around two very different sisters: Clarice (Sally Eilers), a carefree socialite whose impulsive behavior constantly sparks scandal, and Paula (Patricia Farr), her more level-headed sibling. When Clarice suddenly and secretly marries a Southern aristocrat, Michael Andrews (Neil Hamilton), chaos erupts as their whirlwind romance collides with social expectations and family politics. Complicating matters further is the charming and devious Count de Guyon (Joseph Schildkraut), whose schemes add another layer of mischief.\n\nAs Clarice’s actions threaten to damage reputations and trigger misunderstandings, Paula must intervene to protect both her sister and their family’s standing. The comedic tension builds through mistaken identities, sly dialogue, and outrageous situations that reflect the screwball comedy formula of high society mixing with personal follies. The resolution ties together romance, family bonds, and a sly critique of class and propriety.\n\nCast and Crew:\n• Director: Lloyd Corrigan\n• Producers: Nat Levine\n• Cinematography: Ernest Miller\n• Editing: William Morgan\nStarring:\n• Sally Eilers as Clarice Fillmore\n• Neil Hamilton as Michael Andrews\n• Joseph Schildkraut as Count de Guyon\n• Patricia Farr as Paula Fillmore\n• Marjorie Gateson as Aunt Isabel\n• Thurston Hall as Senator\n• Frank Jenks as Handy\n• Luis Alberni as Gustave\n\nFilm Significance:\n“Lady Behave!” embodies the screwball comedy style that surged in popularity during the 1930s, combining romantic entanglements with witty satire on class and social norms. Sally Eilers, known for her lively charm, headlines with a performance that balances reckless spontaneity and comedic timing. Joseph Schildkraut, later famous for his Academy Award-winning role in “The Life of Emile Zola” (1937), adds depth and charisma as the scheming Count. While not a major studio blockbuster, this film captures the spirited energy of Depression-era audiences seeking humor, romance, and escapism.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Lady Behave! remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1937 release was in black and white, typical for comedies of its time. While historically authentic, black-and-white films often fail to attract modern streaming audiences who prefer the visual richness of color. This edition bridges that gap by presenting the same witty humor and fast-paced story in vibrant, restored color. Enhanced audio and image quality also improve the overall experience, especially for audiences watching on TVs and digital devices.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, spanning forgotten comedies, Westerns, dramas, and culturally significant works. Our channel ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#LadyBehave #SallyEilers #NeilHamilton #JosephSchildkraut #1930sComedy #ScrewballComedy #PublicDomainMovie #ColorizedClassic #ClassicCinema #GoldenAgeHollywood",
      "id": "sjps-6E8Ge0",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QFlixd8XDVc",
      "title": "Lady Behave! (1937) ROMANTIC COMEDY",
      "description": "Stars: Sally Eilers, Neil Hamilton, Joseph Schildkraut \nDirector: Lloyd Corrigan\n\nWhile drunk at a party, millionaire Stephens Cormack playfully marries footloose Clarice Andrews. Sobering up the next morning, Cormack hurriedly tells his lawyer to arrange for an annulment, then retreats to South America. What Cormack doesn't know is that Clarice was already married, making him a bigamist in the eyes of the law should anyone find out. Clarice's helpful sister Paula offers to pose as her sibling for appearance's sake, moving into Cormack's mansion until the annulment is finalized.",
      "id": "QFlixd8XDVc",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "70 min",
    "imdbRating": "6.1",
    "imdbVotes": "280",
    "Genre": "Comedy, Romance",
    "Plot": "It's bad enough that Clarice Kendall Andrews, Paula's irresponsible sister, comes home from celebrating Mardi Gras and drunkenly mentions that she got married during the festivities. What's worse is the fact that Paula knows that Clarice is still married to an equally irresponsible gigolo. Paula learns that the man Clarice married, Stephen Cormack, has skipped the country and his lawyer, thinking that Paula is Clarice, offers the older woman $5000 to annul the marriage. Paula's lawyer convinces her to pretend she's Cormack's husband until he can get Clarice's marriage annulled. Paula moves into Cormack's house and discovers he has two teen-aged children who consider her a gold-digger after their father's fortune. Meanwhile, Clarice's husband refuses to have their marriage annulled and tries to blackmail Paula into giving him to $10,000 for his silence.",
    "Director": "Lloyd Corrigan",
    "Writer": "Joseph Krumgold, Olive Cooper",
    "Actors": "Sally Eilers, Neil Hamilton, Joseph Schildkraut",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0027496",
      "title": "Dancing Pirate",
      "year": 1936,
      "imdbRating": "5.2",
      "imdbVotes": "398",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0233667",
      "title": "Der Etappenhase",
      "year": 1937,
      "imdbRating": "4.9",
      "imdbVotes": "19",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029521",
      "title": "Der Schimmelkrieg in der Holledau",
      "year": 1937,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028999",
      "title": "High Hat",
      "year": 1937,
      "imdbRating": "6.2",
      "imdbVotes": "40",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029165",
      "title": "Love Is News",
      "year": 1937,
      "imdbRating": "6.9",
      "imdbVotes": "928",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029580",
      "title": "Small Town Boy",
      "year": 1937,
      "imdbRating": "5.6",
      "imdbVotes": "40",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029611",
      "title": "Storm in a Teacup",
      "year": 1937,
      "imdbRating": "6.5",
      "imdbVotes": "1,158",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029605",
      "title": "Stand-In",
      "year": 1937,
      "imdbRating": "6.7",
      "imdbVotes": "1,345",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028557",
      "title": "Affairs of Cappy Ricks",
      "year": 1937,
      "imdbRating": "5.5",
      "imdbVotes": "229",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028575",
      "title": "Angel",
      "year": 1937,
      "imdbRating": "7.2",
      "imdbVotes": "3,607",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028662",
      "title": "A Bride for Henry",
      "year": 1937,
      "imdbRating": "5.7",
      "imdbVotes": "313",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028816",
      "title": "Easy Living",
      "year": 1937,
      "imdbRating": "7.5",
      "imdbVotes": "4,342",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:24.703Z"
}