{
  "imdbId": "tt0023498",
  "title": "Speak Easily",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SpeakEasily",
      "title": "Speak Easily",
      "description": "Naive, bookish Professor Post (Buster Keaton) inherits a huge amount of money and decides that now he can afford to go out and enjoy life",
      "id": "SpeakEasily"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sjB8Ug6K13c",
      "title": "Speak Easily (1932) | Colorized Public Domain Comedy with Buster Keaton and Jimmy Durante",
      "description": "Speak Easily (1932) is an American pre-Code comedy directed by Edward Sedgwick, starring silent-era legend Buster Keaton alongside Jimmy Durante. This restored and colorized edition from Colorized Public Domain revives one of Keaton’s early sound-era films, giving modern audiences in the USA, Europe, and beyond a vibrant new way to experience his signature blend of physical comedy, timing, and awkward charm. Released during the turbulent early 1930s, the film captures the transition from silent to sound cinema while providing a satirical look at show business and the clash between intellectual ideals and popular entertainment.\n\nPlot Summary:\nProfessor Timothy Z. Post (Buster Keaton), a sheltered and socially awkward classics professor, suddenly inherits a fortune. Having spent his life buried in books, he decides to broaden his horizons by venturing into the real world. With newfound wealth and naivety in equal measure, Post stumbles into a struggling theatrical troupe led by James (Jimmy Durante) and Pansy Peets (Ruth Selwyn), a dancer with big dreams but little opportunity.\n\nConvinced he can help elevate their production, Post becomes the troupe’s unlikely backer, pouring his fortune into their low-budget stage show. His misguided attempts to apply academic logic to the chaos of show business create a series of comical blunders, misunderstandings, and physical gags that showcase Keaton’s signature deadpan brilliance.\n\nAs rehearsals spiral into absurdity, romantic subplots develop, with Post’s innocent affection for Pansy complicating matters further. The film crescendos in a disastrous yet hilarious theatrical performance that exemplifies both the strengths and weaknesses of Keaton’s early talkie career. Despite the troupe’s struggles, the film delivers a satirical commentary on ambition, money, and the unpredictable nature of show business.\n\nCast and Crew:\n• Director: Edward Sedgwick\n• Producer: Harry Rapf\n• Story: Clarence Budington Kelland\n• Screenplay: Ralph Spence, Edgar Allan Woolf\n• Cinematography: Harold Rosson\n• Editing: William LeVanway\n\nStarring:\n• Buster Keaton as Professor Timothy Z. Post\n• Jimmy Durante as James\n• Ruth Selwyn as Pansy Peets\n• Thelma Todd as Eleanor Espere\n• Hedda Hopper as Mrs. Peets\n• William Pawley as Stage Manager\n\nFilm Significance:\nSpeak Easily is one of Buster Keaton’s first talking comedies after his silent masterpieces of the 1920s. Though often overshadowed by his silent classics like The General (1926) and Sherlock Jr. (1924), this film offers valuable insight into Keaton’s transition to sound cinema. Partnered with the boisterous Jimmy Durante, Keaton’s deadpan style clashes with Durante’s loud, fast-talking humor, creating a unique comedic dynamic. While critics have debated its uneven tone, the film is historically significant for showing how early 1930s Hollywood grappled with sound, comedy, and the blending of theatrical traditions with cinematic storytelling.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Speak Easily remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1932 release was in black and white, reflecting both budgetary limitations and stylistic norms of early sound films. While authentic, black-and-white visuals often deter modern audiences from engaging with older works. This colorized edition revitalizes the film, allowing Keaton’s physical comedy and Durante’s high-energy performance to shine with renewed vibrancy, ensuring it resonates with contemporary viewers.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood, from pre-Code comedies and slapstick farces to forgotten dramas and significant cultural treasures. Our work ensures these films remain accessible, relevant, and appreciated by audiences in the USA, Europe, and worldwide.\n\n#SpeakEasily #BusterKeaton #JimmyDurante #1930sComedy #PreCodeHollywood #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #1932Movies #GoldenAgeHollywood",
      "id": "sjB8Ug6K13c",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/speak-easily-1932",
      "title": "Speak Easily (1932)",
      "description": "A professor gets mixed up with chorus girls in a Broadway musical. Watch on RetroFlix:  https://retroflix.org/speak-easily-1932/",
      "id": "speak-easily-1932"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/speak-easily-1932_202508",
      "title": "Speak Easily (1932)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. This comedy was a studio-led production starring comic actors Buster Keaton and Jimmy Durante. Thelma Todd also starred as a dancer and comedic foil for the duo. The film does not seem to have been an especially large success either financially or critically, although modern critics appreciate it more than Keaton's other films from this period. ",
      "id": "speak-easily-1932_202508"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/speak_easily",
      "title": "Speak Easily",
      "description": "Taken from IMDB: Naive, bookish Professor Post (of Potts College) inherits a huge amount of money and decides that now he can afford to go out and enjoy life. He falls for a dancer in a bad stage show, and with his new money decides to buy the show and take it to Broadway.",
      "id": "speak_easily"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=p8coEH1IJfc",
      "title": "Speak Easily (1932) Buster Keaton | Comedy | Full Length Movie",
      "description": "A timid professor inherits a large sum of money and decides to fund a terrible musical.\n\nDirector: Edward Sedgwick\nWriter: Clarence Budington Kelland (from the story by)\nStars: Buster Keaton, Jimmy Durante, Ruth Selwyn -\n\nFollow us on social media :\nhttps://www.facebook.com/CultCinemaClassics\nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "p8coEH1IJfc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "82 min",
    "imdbRating": "5.8",
    "imdbVotes": "1,245",
    "Genre": "Comedy",
    "Plot": "Naive, bookish Professor Post of Potts College inherits a huge amount of money and decides that he can now afford to go out and enjoy life. He falls for a dancer in a bad stage show, and with his new money he decides to buy the show and take it to Broadway. Will the Professor prove to be too nice to succeed in show business? Or will he triumph over bill-collectors, critics, and sexy vamp Eleanor Espere?",
    "Director": "Edward Sedgwick",
    "Writer": "Clarence Budington Kelland",
    "Actors": "Buster Keaton, Jimmy Durante, Ruth Selwyn",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0023322",
      "title": "The Passionate Plumber",
      "year": 1932,
      "imdbRating": "5.9",
      "imdbVotes": "599",
      "language": "English, French, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024762",
      "title": "What-No Beer?",
      "year": 1933,
      "imdbRating": "5.6",
      "imdbVotes": "603",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022254",
      "title": "Parlor, Bedroom and Bath",
      "year": 1931,
      "imdbRating": "6.1",
      "imdbVotes": "1,041",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020902",
      "title": "Free and Easy",
      "year": 1930,
      "imdbRating": "5.5",
      "imdbVotes": "1,057",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020838",
      "title": "Doughboys",
      "year": 1930,
      "imdbRating": "5.7",
      "imdbVotes": "525",
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029488",
      "title": "Riding on Air",
      "year": 1937,
      "imdbRating": "5.0",
      "imdbVotes": "131",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028876",
      "title": "Fit for a King",
      "year": 1937,
      "imdbRating": "5.6",
      "imdbVotes": "136",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018440",
      "title": "Spring Fever",
      "year": 1927,
      "imdbRating": "6.5",
      "imdbVotes": "1,050",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0025619",
      "title": "Palooka",
      "year": 1934,
      "imdbRating": "6.0",
      "imdbVotes": "404",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023243",
      "title": "Mr. Robinson Crusoe",
      "year": 1932,
      "imdbRating": "5.5",
      "imdbVotes": "520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023537",
      "title": "A Successful Calamity",
      "year": 1932,
      "imdbRating": "6.9",
      "imdbVotes": "528",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022628",
      "title": "The Animal Kingdom",
      "year": 1932,
      "imdbRating": "6.3",
      "imdbVotes": "1,353",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:35.626Z"
}