{
  "imdbId": "tt0023369",
  "title": "Rain",
  "year": 1932,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PJGWS2XgQyc",
      "title": "Rain (1932) | Colorized Public Domain Pre-Code Drama with Joan Crawford & Walter Huston",
      "description": "Rain (1932) is a pre-Code American drama directed by Lewis Milestone and adapted from W. Somerset Maugham’s short story Miss Thompson (later retitled Rain). This atmospheric and morally charged film stars Joan Crawford in one of her most daring early roles and Walter Huston as a missionary whose rigid morality collides with human desire and weakness. Presented here in a restored and colorized edition, this public domain classic regains visual depth and accessibility for modern audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nSet in Pago Pago on the island of Tutuila in American Samoa, the story follows Sadie Thompson (Joan Crawford), a free-spirited and independent woman who arrives at a boarding house during a tropical downpour. While she enjoys the company of American soldiers stationed on the island, her carefree lifestyle draws the ire of Alfred Davidson (Walter Huston), a stern and deeply religious missionary determined to reform her.\n\nDavidson pressures the authorities to deport Sadie to San Francisco, where her troubled past awaits. As the rain falls endlessly and tensions build within the confined space of the boarding house, Davidson’s self-righteous crusade turns into a battle of wills. Ultimately, his hypocrisy and repressed desires erupt in devastating consequences, leaving Sadie to face both tragedy and transformation.\n\nCast and Crew:\n• Director: Lewis Milestone\n• Screenplay: Maxwell Anderson, Luther Reed\n• Based on: “Miss Thompson” (short story, 1921) by W. Somerset Maugham\n• Cinematography: Oliver T. Marsh\n• Editing: George Hively\nStarring:\n• Joan Crawford as Sadie Thompson\n• Walter Huston as Alfred Davidson\n• William Gargan as Sergeant O’Hara\n• Guy Kibbee as Joe Horn\n• Beulah Bondi as Mrs. Davidson\n• Matt Moore as Dr. Macphail\n\nFilm Significance:\nRain (1932) is considered one of the boldest pre-Code films of its era, tackling themes of sexuality, hypocrisy, and repression years before the Hollywood Production Code strictly censored such content. Joan Crawford’s performance as Sadie Thompson showcased her ability to play complex, morally ambiguous characters and remains a standout role in her early career. Walter Huston’s portrayal of the fanatical missionary adds a haunting intensity, while Lewis Milestone’s direction brings a claustrophobic realism that highlights the tension between personal freedom and moral authority.\n\nAlthough earlier versions of Maugham’s story had been adapted to film — including the silent Sadie Thompson (1928) with Gloria Swanson — this 1932 sound version gave new dramatic power to the tale, cementing it as one of the most important pre-Code works. Today, Rain is preserved in the public domain and continues to resonate as both a provocative drama and a critique of rigid morality.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Rain remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1932 release was in black and white, reflecting the cinematic standard of the time. While historically significant, many modern viewers overlook black-and-white films. This colorized edition bridges that gap, highlighting the tropical atmosphere of Samoa, the oppressive rainfall, and the emotional tension in ways that connect with today’s audiences. By adding color while preserving the original performances and direction, we offer both historical authenticity and modern visual appeal.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from groundbreaking pre-Code dramas to forgotten gems. Our work ensures these treasures remain discoverable, engaging, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Rain1932 #JoanCrawford #WalterHuston #PreCodeHollywood #PublicDomainMovie #ColorizedClassic #GoldenAgeCinema #SomersetMaugham #FilmRestoration #ClassicDrama",
      "id": "PJGWS2XgQyc",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rain-1932_202312",
      "title": "Rain (1932)",
      "description": "Due to a possible cholera epidemic onboard, passengers on a ship are forced to disembark at Pago Pago, a small village on a Pacific island where it incessantly rains. Among the stranded passengers are Sadie Thompson, a prostitute, and Alfred Davidson, a fanatic missionary who will try to redeem her. Watch on RetroFlix:  https://retroflix.org/rain-1932/",
      "id": "rain-1932_202312"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rain-4-k",
      "title": "Rain (1932) [Colorized, 4k, 60fps]",
      "description": "Rain is a 1932 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "id": "rain-4-k"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rain1932",
      "title": "Rain",
      "description": "Sadie Thompson vs. The Puritans. Maxwell Anderson's screenplay of the W. Somerset Maugham story. Joan Crawford. Walter Huston, William Gargan For more info on this film see its IMDB.com entry",
      "id": "rain1932"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UC_WhEo77w0",
      "title": "Rain (1932) JOAN CRAWFORD",
      "description": "Stars: Joan Crawford, Walter Huston, Fred Howard\nDirector: Lewis Milestone\n\nIn this Pre-code Hollywood drama, a prostitute finds redemption in Pago Pago thanks to a hard missionary man.",
      "id": "UC_WhEo77w0",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AUBTXL28PGE",
      "title": "Rain (1932) Joan Crawford | Pre-Code Drama Full Film",
      "description": "A prostitute newly arrived in the South Pacific finds herself at odds with a stern missionary determined to save her soul.\n\nDirector: Lewis Milestone \nWriters: John Colton, Clemence Randolph \nStars: Joan Crawford, Walter Huston, Fred Howard\nGenres: Classics, Drama\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "AUBTXL28PGE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "94 min",
    "imdbRating": "6.9",
    "imdbVotes": "3,111",
    "Genre": "Drama",
    "Plot": "For residents on the idyllic South Seas island of Pago Pago, life is simple until a boat arrives carrying two couples, the Davidsons (who are missionaries), the MacPhails and a prostitute named Sadie Thompson. Davidson is more than just a religious zealot; he's a mad man. When the boat, which was en route to another port, is temporarily stranded on the island due to a possible Cholera outbreak on-board, Sadie spends her time \"partying\" with the American soldiers stationed on the island. Her behavior, however, is more than the Davidsons can stand and soon Mr. Davidson confronts Sadie about her evil ways and offers salvation. When Sadie rebels and the attempted redemption does not go as planned, Davidson arranges to have her sent back to San Francisco, where she fled some years ago due to mysterious personal issues. Davidson soon becomes unhinged and thus begins a series of surprising events which culminate in disaster.",
    "Director": "Lewis Milestone",
    "Writer": "John Colton, Clemence Randolph, W. Somerset Maugham",
    "Actors": "Joan Crawford, Walter Huston, Fred Howard",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0021890",
      "title": "The Front Page",
      "year": 1931,
      "imdbRating": "6.7",
      "imdbVotes": "3,541",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024083",
      "title": "Hallelujah I'm a Bum",
      "year": 1933,
      "imdbRating": "6.9",
      "imdbVotes": "858",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020629",
      "title": "All Quiet on the Western Front",
      "year": 1930,
      "imdbRating": "8.1",
      "imdbVotes": "70,816",
      "language": "English, French, German, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0036217",
      "title": "The North Star",
      "year": 1943,
      "imdbRating": "5.9",
      "imdbVotes": "1,832",
      "language": "English, German, Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020217",
      "title": "New York Nights",
      "year": 1929,
      "imdbRating": "5.5",
      "imdbVotes": "276",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0019304",
      "title": "The Racket",
      "year": 1928,
      "imdbRating": "6.6",
      "imdbVotes": "1,515",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038988",
      "title": "The Strange Love of Martha Ivers",
      "year": 1946,
      "imdbRating": "7.4",
      "imdbVotes": "11,780",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0040109",
      "title": "Arch of Triumph",
      "year": 1948,
      "imdbRating": "6.3",
      "imdbVotes": "1,964",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044788",
      "title": "Kangaroo",
      "year": 1952,
      "imdbRating": "5.6",
      "imdbVotes": "409",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0031742",
      "title": "Of Mice and Men",
      "year": 1939,
      "imdbRating": "7.8",
      "imdbVotes": "7,053",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053183",
      "title": "Pork Chop Hill",
      "year": 1959,
      "imdbRating": "7.0",
      "imdbVotes": "5,418",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038235",
      "title": "A Walk in the Sun",
      "year": 1945,
      "imdbRating": "6.9",
      "imdbVotes": "4,377",
      "language": "English, Italian",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    }
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:21.542Z"
}