{
  "movieId": "tt0010890",
  "title": "The Wicked Darling",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MyMovie_20180126",
      "id": "MyMovie_20180126",
      "title": "\"The Wicked Darling\" (1919) director Tod Browning featuring Lon Chaney",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"The Wicked Darling\" is a crime drama. A girl who steals for a living falls for a decent man and tries to break from her past. Directed by               Tod Browning Produced by             Universal Film Manufacturing Company Scenario by               Waldemar Young, writer Harvey Gates Based on                    the screen story “The Moth” by Evelyn Campbell Starring                     Priscilla Dean, Wellington A. Playter, Lon Chaney,  Spottiswoode Aitken, Gertrude Astor, Kalla Pasha Cinematography        Alfred Gosden Distributed by           Universal Film Manufacturing Company Release date               February 24, 1919 Running time             59 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 755805141,
      "addedAt": "2026-01-07T00:06:38.753Z",
      "thumbnail": "https://archive.org/services/img/MyMovie_20180126",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 5486
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "59 min",
    "imdbRating": 6.4,
    "imdbVotes": 474,
    "Genre": "Drama, Crime",
    "Plot": "Pickpockets 'Stoop' Connors and Mary Stevens often work together, but they are now having a falling out over a job that Connors had planned for the evening. Meanwhile, socialite Adele Hoyt breaks off her engagement with Kent Mortimer, who has lost the fortune that interested her in him. Then, as Adele is going out for the evening, her pearl necklace falls to the ground. Mary, standing nearby, quickly grabs it and runs off. As she is being pursued by police and others, Mary slips inside Kent's home to hide. As she then talks to Kent and learns of the patient way that he is dealing with his misfortunes, a change comes over Mary. She is now determined to make an honest living, and she and Kent become close. But 'Stoop' refuses to let her leave her old way of life, and he also insists on having the stolen pearls for himself.",
    "Director": "Tod Browning",
    "Writer": "Evelyn Campbell, Harvey Gates, Waldemar Young",
    "Actors": "Priscilla Dean, Wellington A. Playter, Lon Chaney",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0012538",
    "tt0016473",
    "tt0013719",
    "tt0014606",
    "tt0011904",
    "tt0010402",
    "tt0191263",
    "tt0018528",
    "tt0019563",
    "tt0010791",
    "tt0020581",
    "tt0011565"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.753Z"
}