{
  "imdbId": "tt0052604",
  "title": "The Giant of Marathon",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CCO__TheGiantofMarathon",
      "title": "The Giant of Marathon",
      "description": "A Greek Warrior engages in battle against the Persian Army See the IMDB page at http://imdb.com/title/tt0052604/ Watch this and other classic movies on line free at www.classiccinemaonline.com",
      "fileSize": 1997051526,
      "id": "CCO__TheGiantofMarathon"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cco_TheGiantofMarathon",
      "title": "The Giant of Marathon",
      "description": "A Greek Warrior engages in battle against the Persian Army",
      "fileSize": 1997041980,
      "id": "cco_TheGiantofMarathon"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dqRiIOy7A64",
      "title": "The Giant of Marathon (1959) [Action] [Adventure] [Drama]",
      "description": "This classical peplum tells a fictitious story set in 490 BC, the time of the Medic Wars during which Persian armies sweep the Ancient world. Having brought home to Athens the Olympic victor's laurel crown, Philippides joins as commander the Sacred Guard, which is expected to defend the city-state's liberty, a year after the chasing of the tyrant Hippias. Athenian supporters of Hippias conspire, hoping to side Philippides by marriage to Theocrites' expensive servant Charis, and thus neutralize the guard. She fails to seduce him, as his heart is already taken by a young girl before the learns her name is Andromeda, daughter of Creuso. Everything personal is likely to be put on hold when the news breaks that the Persian King of kings Darius's vast army is marching on Greece, hoping its internal division will make its conquest a walk-over. \n\nTheocrites reproaches Miltiades to hold back the sacred guard to defend the Pallas temple after a likely defeat, and proposes instead to negotiate terms with Darius, but is told an alliance with Sparta could save the Hellenic nation. Philippides makes the journey and survives a fiendish attempt on his life by conspirators; he returns with Sparta's engagement during the Persian attack in far greater numbers on Militiades valiant troops. Charis, left for dead after overhearing Darius's orders, reaches the camp to tell that the Persian fleet, now commanded by traitor Theocrites, is heading for Piraeus to take Athens. Miltiades sends Philippides ahead to hold out with the sacred guard until his hopefully victorious troops arrive, and after his perilous journey back they do a great job, proving superior athletes can do better than traditional naval ramming tactics.\n\n---\n\nDirected by Jacques Tourneur and Mario Bava, produced by Bruno Vailati, written by Alberto Barsanti (story), Ennio De Concini (writer), Augusto Frassinetti (writer), Raffaello Pacini (story) and Bruno Vailati (writer), starring Steve Reeves as Phillipides (Phidippides), Mylène Demongeot as Andromeda (Creuso's daughter), Sergio Fantoni as Theocritus, Daniela Rocca as Charis, Philippe Hersent as Callimachus, Alberto Lupo as Miltiades, Daniele Vargas as Darius I (King of Persia), Miranda Campa as Andromeda's handmaid, Gianni Loti as Teucro, Anita Todesco as Andromeda's friend, Ivo Garrani as Creuso, Sergio Ciani as Euros, Franco Fantasia, Carlo Lombardi, Ignazio Balsamo, Gian Paolo Rosmino and Walter Grant.\n\n---\n\nSource: \"The Giant of Marathon\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 March 2013. Web. 22 July 2013. http://en.wikipedia.org/wiki/The_Giant_of_Marathon.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "id": "dqRiIOy7A64",
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB",
          "IT"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 5.1,
    "imdbVotes": 1112,
    "Genre": "Action, Adventure, Drama",
    "Plot": "This classical peplum tells a fictitious story set in 490 BC, the time of the Medic Wars during which Persian armies sweep the Ancient world. Having brought home to Athens the Olympic victor's laurel crown, Philippides joins as commander the Sacred Guard, which is expected to defend the city-state's liberty, a year after the chasing of the tyrant Hippias. Athenian supporters of Hippias conspire, hoping to side Philippides by marriage to Theocrites' expensive servant Charis, and thus neutralize the guard. She fails to seduce him, as his heart is already taken by a young girl before the learns her name is Andromeda, daughter of Creuso. Everything personal is likely to be put on hold when the news breaks that the Persian King of kings Darius's vast army is marching on Greece, hoping its internal division will make its conquest a walk-over. Theocrites reproaches Miltiades to hold back the sacred guard to defend the Pallas temple after a likely defeat, and proposes instead to negotiate terms with Darius, but is told an alliance with Sparta could save the Hellenic nation. Philippides makes the journey and survives a fiendish attempt on his life by conspirators; he returns with Sparta's engagement during the Persian attack in far greater numbers on Militiades valiant troops. Charis, left for dead after overhearing Darius's orders, reaches the camp to tell that the Persian fleet, now commanded by traitor Theocrites, is heading for Piraeus to take Athens. Miltiades sends Philippides ahead to hold out with the sacred guard until his hopefully victorious troops arrive, and after his perilous journey back they do a great job, proving superior athletes can do better then traditional naval ramming tactics ...",
    "Director": "Jacques Tourneur, Bruno Vailati, Mario Bava",
    "Writer": "Alberto Barsanti, Raffaello Pacini, Ennio De Concini",
    "Actors": "Steve Reeves, Mylène Demongeot, Sergio Fantoni",
    "Language": "English",
    "Country": "Italy, France, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0052538",
      "title": "The White Warrior",
      "year": 1959,
      "imdbRating": 5.2,
      "imdbVotes": 328,
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052170",
      "title": "Sea Fury",
      "year": 1958,
      "imdbRating": 6,
      "imdbVotes": 228,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051702",
      "title": "Harry Black and the Tiger",
      "year": 1958,
      "imdbRating": 6.2,
      "imdbVotes": 346,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054953",
      "title": "The Guns of Navarone",
      "year": 1961,
      "imdbRating": 7.5,
      "imdbVotes": 57924,
      "language": "English, Greek, German, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050579",
      "title": "Jungle Heat",
      "year": 1957,
      "imdbRating": 5.3,
      "imdbVotes": 175,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049357",
      "title": "Night Ambush",
      "year": 1957,
      "imdbRating": 6.5,
      "imdbVotes": 2008,
      "language": "English, Greek, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050356",
      "title": "The Enemy Below",
      "year": 1957,
      "imdbRating": 7.4,
      "imdbVotes": 12604,
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050858",
      "title": "The Pride and the Passion",
      "year": 1957,
      "imdbRating": 5.7,
      "imdbVotes": 3285,
      "language": "English, Spanish, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048983",
      "title": "Bandido!",
      "year": 1956,
      "imdbRating": 6,
      "imdbVotes": 1217,
      "language": "English, German, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0055323",
      "title": "Women of Devil's Island",
      "year": 1962,
      "imdbRating": 4.2,
      "imdbVotes": 294,
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0178515",
      "title": "Hercules and the Masked Rider",
      "year": 1963,
      "imdbRating": 4.3,
      "imdbVotes": 188,
      "language": "Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0056042",
      "title": "The Trojan Horse",
      "year": 1961,
      "imdbRating": 5.9,
      "imdbVotes": 675,
      "language": "Italian",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.167Z"
}