{
  "movieId": "tt0047681",
  "title": "World for Ransom",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1954-world-for-ransom-panico-en-singapur-robert-aldrich-vose",
      "id": "1954-world-for-ransom-panico-en-singapur-robert-aldrich-vose",
      "title": "1954 - World for Ransom - Pánico en Singapur - Robert Aldrich - VOSE",
      "description": "For Academic - Educational Use Only",
      "fileSize": 389246717,
      "addedAt": "2026-01-07T00:06:06.563Z",
      "thumbnail": "https://archive.org/services/img/1954-world-for-ransom-panico-en-singapur-robert-aldrich-vose",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 647
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/world-for-ransom-1954_202206",
      "id": "world-for-ransom-1954_202206",
      "title": "World For Ransom (1954) Dan Duryea, Patric Knowles, Gene Lockhart, Reginald Denny, Nigel Bruce, Marian Carr",
      "description": "World for Ransom is a 1954 American FILM NOlR drama directed by Robert Aldrich and starring Dan Duryea, Patric Knowles, Gene Lockhart, Reginald Denny, Nigel Bruce (in his final film role) and Marian Carr.   Many of the actors and sets used in the film were from the Dan Duryea television show China Smith. Aldrich and cinematographer Joseph Biroc also worked on the series.   You can find out more about this movie from Wikipedia and there is a review from the movie blog Where Danger Lives .",
      "fileSize": 489390456,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/world-for-ransom-1954_202206",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 2185
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "82 min",
    "imdbRating": 5.8,
    "imdbVotes": 654,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Director Robert Aldrich, one year before his post-modern Noir masterpiece Kiss Me, Deadly (1955), did his best with this atmospheric China Seas melodrama. Should chanteuse Frenesie (Marion Carr) stay glued to her weak-kneed but handsome husband (Patric Knowles) or wise up and take what tough but reliable Irish soldier of fortune Callahan (Dan Duryea) has to offer? The answer comes only after sterling character actors Gene Lockhart (evil mastermind), Nigel Bruce (colonial governor), Douglas Dumbrille (military cop) and once-handsome Reginald Denny (ditto) squabble and planify to restore order. Bonus: lovely brogue-wielding Arthur Shields, younger brother of icon Barry Fitzgerald, as the hydrogen bomb expert whose kidnap fuels the intrigue. Bad guys vs. good with the sublime, sweet-hearted, tough-tongued Duryea playing both ends against the middle. His face like carved rare roast beef, his hair slicked back, eternal glint in his eye, Duryea wriggles through sewers, sprints around enemy strongholds, and handles grenades with the best of 'em.",
    "Director": "Robert Aldrich",
    "Writer": "Lindsay Hardy, Hugo Butler",
    "Actors": "Dan Duryea, Gene Lockhart, Patric Knowles",
    "Language": "English, Cantonese",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0048261",
    "tt0047880",
    "tt0049801",
    "tt0047542",
    "tt0046969",
    "tt0046790",
    "tt0046885",
    "tt0046935",
    "tt0047127",
    "tt0047263",
    "tt0047370",
    "tt0047479"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}