{
  "imdbId": "tt0046438",
  "title": "Tokyo Story",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tokyo-story",
      "id": "tokyo-story",
      "title": "Tokyo Story",
      "description": "A profoundly stirring evocation of elemental humanity and universal heartbreak,  Tokyo Story  is the crowning achievement of the unparalleled Yasujiro Ozu. The film, which follows an aging couple’s journey to visit their grown children in bustling postwar Tokyo, surveys the rich and complex world of family life with the director’s customary delicacy and incisive perspective on social mores. Featuring lovely performances from Ozu regulars Chishu Ryu and Setsuko Hara,  Tokyo Story  plumbs and deepens the director’s recurring theme of generational conflict, creating what is without question one of cinema’s mightiest masterpieces.",
      "fileSize": 11193487576,
      "addedAt": "2026-01-07T00:12:44.285Z",
      "thumbnail": "https://archive.org/services/img/tokyo-story",
      "language": "jpn",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 43085
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "137 min",
    "imdbRating": 8.1,
    "imdbVotes": 76193,
    "Genre": "Drama",
    "Plot": "Elderly couple Shukishi and Tomi Hirayama live in the small coastal village of Onomichi, Japan with their youngest daughter, schoolteacher Kyoko Hirayama. Their other three surviving adult children, who they have not seen in quite some time, live either in Tokyo or Osaka. As such, Shukishi and Tomi make the unilateral decision to have an extended visit in Tokyo with their children, pediatrician Koichi Hirayama and beautician Shige Kaneko, and their respective families (which includes two grandchildren). In transit, they make an unexpected stop in Osaka and stay with their other son, Keiso Hirayama. All of their children treat the visit more as an obligation than a want, each trying to figure out what to do with their parents while they continue on with their own daily lives. At one point, they even decide to ship their parents off to an inexpensive resort at Atami Hot Springs rather than spend time with them. The only offspring who makes a concerted effort on this trip is Noriko Hirayama, their widowed daughter-in-law, whose husband, Shoji Hirayama, was killed eight years earlier in the war. Following the vacation, each child comes to some conclusion of their general behavior toward their parents, not only on this trip but throughout their entire adult lives. For some, this realization may come too late.",
    "Director": "Yasujirô Ozu",
    "Writer": "Kôgo Noda, Yasujirô Ozu",
    "Actors": "Chishû Ryû, Chieko Higashiyama, Sô Yamamura",
    "Language": "Japanese, English",
    "Country": "Japan",
    "Awards": "3 wins total"
  },
  "relatedMovies": [
    "tt0043313",
    "tt0044982",
    "tt0051093",
    "tt0056444",
    "tt0053134",
    "tt0021406",
    "tt0049784",
    "tt0040505",
    "tt0024120",
    "tt0051720",
    "tt0023634",
    "tt0053579"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}