{
  "imdbId": "tt0013367",
  "title": "The Man from Beyond",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/manfrombehind4k",
      "title": "Manfrombehind4k",
      "id": "manfrombehind4k"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gdWm9NlKXdI",
      "title": "The Man from Beyond (1922) | Colorized Public Domain Silent Fantasy Drama with Harry Houdini",
      "description": "The Man from Beyond (1922) is a silent fantasy drama film starring the legendary magician and escape artist Harry Houdini. Directed by Burton L. King and produced by Houdini Picture Corporation, this restored and colorized public domain classic offers audiences a rare opportunity to see Houdini not just as a master illusionist, but as a dramatic actor in a full-length feature film. Combining elements of science fiction, romance, and mysticism, the story explores themes of reincarnation, destiny, and eternal love. By reviving this silent-era spectacle in color, modern viewers in the United States, Europe, and beyond can rediscover both Houdini’s charisma and the unique cultural fascination with the supernatural during the 1920s.\n\nPlot Summary:\nThe film begins with the discovery of a man frozen in Arctic ice for over a century. When explorers bring him back to life, they learn he is Howard Hillary, a man from the early 19th century who vanished mysteriously. Awakening in the modern world of the 1920s, Howard finds himself bewildered by its customs but driven by a powerful sense of destiny. He encounters Felice, a young woman who bears a striking resemblance to the woman he loved a hundred years earlier, suggesting a reincarnated bond that transcends time.\n\nAs Howard struggles to adjust to modern life, he also confronts deceit, greed, and betrayal, especially from those who wish to manipulate Felice for their own gain. The story crescendos with Houdini’s trademark physical feats and daring escapes, showcasing the endurance and determination that made him world-famous. Ultimately, The Man from Beyond delivers a romantic and mystical message about love’s power to survive across lifetimes.\n\nCast and Crew:\n• Director: Burton L. King\n• Producer: Harry Houdini\n• Cinematography: William C. Thompson\nStarring:\n• Harry Houdini as Howard Hillary\n• Jane Connelly as Felice Strange\n• Arthur Maude as Dr. Gilbert Trent\n• Albert Tavernier as Dr. Gregory Sinclair\n• Erwin Connelly as Professor Crawford Strange\n\nFilm Significance:\nThe Man from Beyond is one of only a handful of surviving films featuring Harry Houdini in a leading role, making it an invaluable historical artifact for both film and magic enthusiasts. Unlike his better-known shorts and newsreels, this feature allowed Houdini to demonstrate not only his physical prowess but also his ability to engage with narrative drama. The film reflects the early 20th-century fascination with reincarnation, spirituality, and scientific discovery, while also serving as a vehicle to showcase Houdini’s unparalleled physicality. Though critics at the time were mixed on his acting, modern audiences value the film as a cultural treasure that preserves Houdini’s larger-than-life presence on screen.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Man from Beyond remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1922 release was silent and black and white, reflecting the filmmaking conventions of its time. While historically authentic, many modern audiences often skip silent films because of outdated visuals. By offering a colorized and restored edition, we make Harry Houdini’s rare feature performance accessible to a contemporary audience that may not otherwise experience his work in cinema. The colorization process highlights details of Houdini’s expressions, costumes, and dramatic stunts, adding an immersive layer for modern viewers while preserving the integrity of the original production.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheManFromBeyond #HarryHoudini #SilentDrama #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentFilmEra #FilmRestoration #ClassicDrama #GoldenAgeHollywood",
      "id": "gdWm9NlKXdI",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-man-from-beyond",
      "title": "The Man from Beyond",
      "id": "silent-the-man-from-beyond"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-man-from-beyond-1922",
      "title": "The Man From Beyond (1922)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. One of the few motion pictures starring Harry Houdini before his untimely death, The Man from Beyond is a mystery picture that features Houdini as a man frozen in ice for one hundred years. He is eventually miraculously defrosted, only to claim that one of the first people he meets is a reincarnation of his true love. Reviewers from the time of release don't seem to have been terribly impressed by the film, and modern viewers tend to agree, though some view it as worth watching to see Houdini's acting. ",
      "id": "the-man-from-beyond-1922"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-man-from-beyond-1922-mystery-1i-2-tinx-xboc",
      "title": "The Man From Beyond (1922)",
      "description": "The Arctic, 1922. After being buried under the ice for a hundred years, Howard Hillary is thawed and revived. When he meets Felice Strange, he recognizes in her the same woman he once loved deeply. But is it really her?",
      "id": "the-man-from-beyond-1922-mystery-1i-2-tinx-xboc"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "74 min",
    "imdbRating": "5.4",
    "imdbVotes": "348",
    "Genre": "Mystery, Sci-Fi",
    "Plot": "The body of a man, Howard Hillary, frozen for a hundred years, is found in the Arctic ice. Thawed out and awakened, Hillary insists that a young woman, Felice, is his fiancée from a century before. Hillary is interned in a mental institution but escapes and realizes the truth of where he is and that Felice is actually the descendant of his own Felice from long ago. Hillary joins her in searching for her father, who has been abducted by someone known to them both.",
    "Director": "Burton L. King",
    "Writer": "Harry Houdini, Coolidge Streeter",
    "Actors": "Harry Houdini, Arthur Maude, Albert Tavernier",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0011753",
      "title": "Terror Island",
      "year": 1920,
      "imdbRating": "5.4",
      "imdbVotes": "248",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047149",
      "title": "Killers from Space",
      "year": 1954,
      "imdbRating": "3.5",
      "imdbVotes": "2,632",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0343449",
      "title": "The Bone Snatcher",
      "year": 2003,
      "imdbRating": "4.4",
      "imdbVotes": "2,967",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    },
    {
      "imdbId": "tt0047594",
      "title": "The Invisible Avenger",
      "year": 1954,
      "imdbRating": "5.8",
      "imdbVotes": "161",
      "language": "Japanese",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0075990",
      "title": "End of the World",
      "year": 1977,
      "imdbRating": "3.1",
      "imdbVotes": "1,255",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013458",
      "title": "One Exciting Night",
      "year": 1922,
      "imdbRating": "5.3",
      "imdbVotes": "198",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0071426",
      "title": "The Disappearance of Flight 412",
      "year": 1974,
      "imdbRating": "4.6",
      "imdbVotes": "791",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051881",
      "title": "The Lost Missile",
      "year": 1958,
      "imdbRating": "5.1",
      "imdbVotes": "1,072",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt13975458",
      "title": "Cube",
      "year": 2021,
      "imdbRating": "4.5",
      "imdbVotes": "2,992",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0068615",
      "title": "Frogs",
      "year": 1972,
      "imdbRating": "4.4",
      "imdbVotes": "8,258",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0058084",
      "title": "Frozen Alive",
      "year": 1964,
      "imdbRating": "4.0",
      "imdbVotes": "655",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1362264",
      "title": "Missy and the Maxinator",
      "year": 2009,
      "imdbRating": "4.5",
      "imdbVotes": "96",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T21:38:30.041Z"
}