{
  "imdbId": "tt0044796",
  "title": "Kid Monk Baroni",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Kid_Monk_Baroni",
      "title": "Kid Monk Baroni",
      "description": "From IMDb : Leonard Nimoy is \"Kid\" Monk Baroni, the leader of a street gang who becomes a professional boxer to escape his life in \"Little Italy\" New York. Also Starring: Richard Rober, Bruce Cabot, Allene Roberts, and Mona Knox",
      "id": "Kid_Monk_Baroni"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kid-monk-baroni-1952",
      "title": "Kid Monk Baroni",
      "description": "Leonard Nimoy is \"Kid\" Monk Baroni, the leader of a street gang who becomes a professional boxer to escape his life in \"Little Italy\" New York. Watch on RetroFlix:  https://retroflix.org/kid-monk-baroni-1952/",
      "id": "kid-monk-baroni-1952"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8nxBrDr57b0",
      "title": "Kid Monk Baroni (1952) | Colorized Public Domain Boxing and Crime Drama with Leonard Nimoy",
      "description": "Kid Monk Baroni (1952) is an American boxing and crime drama film directed by Harold D. Schuster and produced by Jack Schwarz Productions. Best remembered as Leonard Nimoy’s first credited screen role, this gritty story captures the struggle of a troubled street youth who finds a chance at redemption inside the boxing ring. Restored and colorized by Colorized Public Domain, this edition revives the film for modern audiences in the United States, Europe, and beyond, preserving its cultural value while making it more engaging for today’s viewers.\n\nPlot Summary:\nMonk Baroni (Leonard Nimoy) is the angry young leader of a small New York street gang. Insecure about his scarred face and consumed by resentment, Monk directs his frustrations into violence and petty crime. After a violent clash, his path crosses with Father Callahan, a priest who believes Monk has the potential for a better life. Recognizing that the boy’s strength can be channeled into discipline, Callahan introduces him to boxing as a way to escape his self-destructive cycle.\n\nWith the guidance of Jerry Harris (Bruce Cabot), a veteran boxing manager, Monk begins his rise in the sport. His skill and determination earn him respect, but his personal battles remain just as fierce. Emily Brooks (Allene Roberts), a young woman who sees past his rough exterior, becomes a crucial figure in his transformation, offering both compassion and stability. Alongside her support, Monk undergoes facial surgery to repair his scars, but this leads to deeper questions about identity and self-worth.\n\nAs Monk moves up the boxing ranks, he is forced to confront not only powerful opponents in the ring but also his own inner demons. The story builds toward a climax where he must decide if he will allow his anger to define him or if he will choose redemption, love, and self-respect. The film’s resolution reinforces the timeless theme that true strength comes not from fists, but from the courage to change.\n\nCast and Crew:\n• Director: Harold D. Schuster\n• Producer: Jack Schwarz\n• Screenplay: Jack DeWitt\n• Cinematography: William A. Sickner\n• Editing: Ace Herman\n\nStarring:\n• Leonard Nimoy as Monk Baroni\n• Allene Roberts as Emily Brooks\n• Bruce Cabot as Jerry Harris\n• Jack Larson as Chuck Henderson\n• Mona Knox as Iris\n• Joe Abdullah as Gang Member\n• Dick Crockett as Pete\n\nFilm Significance:\nKid Monk Baroni is notable for its raw depiction of postwar urban struggles and the challenges facing disillusioned youth in the 1950s. While a modestly budgeted production, it represents the type of morality tale that Hollywood frequently told in this era, combining crime, boxing, and social commentary. Its greatest legacy lies in introducing Leonard Nimoy, years before he achieved international fame as Spock in Star Trek. His performance offers a rare look at his early talent, portraying a tough, vulnerable, and misunderstood youth. For fans of classic cinema and television history, the film stands as an important artifact of both the boxing genre and Nimoy’s career.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Kid Monk Baroni remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1952 release was in black and white, typical of low-budget productions of its time. While authentic to its era, many modern viewers overlook black-and-white films. By offering a restored and colorized version, this edition bridges the gap between historical preservation and contemporary viewing habits. The colorization enhances the gritty realism of the boxing sequences and the urban backdrop while retaining the film’s dramatic tone. For fans of Leonard Nimoy, this is a rare opportunity to experience his earliest role brought to life in color.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#KidMonkBaroni #LeonardNimoy #1950sDrama #PublicDomainMovie #ColorizedClassic #ClassicBoxingMovie #CrimeDrama #FilmRestoration #1952Movies #GoldenAgeHollywoo",
      "id": "8nxBrDr57b0",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g0pJ73RiQBY",
      "title": "Kid Monk Baroni (1952) LEONARD NIMOY",
      "description": "Stars: Richard Rober, Bruce Cabot, Allene Roberts \nDirector: Harold D. Schuster\n\nLeonard Nimoy stars as Kid Monk Baroni, the leader of a street gang who becomes a professional boxer to escape his life in Little Italy New York.",
      "id": "g0pJ73RiQBY",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "79 min",
    "imdbRating": "6.1",
    "imdbVotes": "196",
    "Genre": "Action, Drama, Sport",
    "Plot": "Paul Baroni, known as Monk because of his misshapen face, is part of a New York street gang. Under the influence of his parish priest, Father Callahan, Paul learns to box and becomes a success. But his insecurities over how he looks lead him to throw away both success and his relationships...until a sudden change shows him a new way of looking at himself.",
    "Director": "Harold D. Schuster",
    "Writer": "Aben Kandel, Dick Conway",
    "Actors": "Richard Rober, Bruce Cabot, Allene Roberts",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0047465",
      "title": "Security Risk",
      "year": 1954,
      "imdbRating": "5.9",
      "imdbVotes": "81",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044333",
      "title": "Against All Flags",
      "year": 1952,
      "imdbRating": "6.5",
      "imdbVotes": "3,038",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044371",
      "title": "Arctic Flight",
      "year": 1952,
      "imdbRating": "5.4",
      "imdbVotes": "162",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044382",
      "title": "The Atomic City",
      "year": 1952,
      "imdbRating": "6.1",
      "imdbVotes": "539",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt7036540",
      "title": "The Savant",
      "year": 2019,
      "imdbRating": "4.2",
      "imdbVotes": "86",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0467003",
      "title": "Challenge",
      "year": 2004,
      "imdbRating": "7.4",
      "imdbVotes": "2,685",
      "language": "Telugu",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0054385",
      "title": "Thunder in Carolina",
      "year": 1960,
      "imdbRating": "4.5",
      "imdbVotes": "447",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0059641",
      "title": "Red Line 7000",
      "year": 1965,
      "imdbRating": "5.6",
      "imdbVotes": "1,193",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045075",
      "title": "Red Snow",
      "year": 1952,
      "imdbRating": "6.6",
      "imdbVotes": "76",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0045282",
      "title": "Untamed Women",
      "year": 1952,
      "imdbRating": "3.6",
      "imdbVotes": "299",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0044622",
      "title": "Flesh and Fury",
      "year": 1952,
      "imdbRating": "6.6",
      "imdbVotes": "595",
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0044614",
      "title": "The Fighter",
      "year": 1952,
      "imdbRating": "5.8",
      "imdbVotes": "177",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:31:50.809Z"
}