{
  "movieId": "tt0021509",
  "title": "The Utah Kid",
  "year": 1930,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2VpoBWDm0js",
      "id": "2VpoBWDm0js",
      "title": "The Utah Kid (1930) BORIS KARLOFF ♠ REX LEASE",
      "description": "1st Time on YouTube!\nStars: Rex Lease, Boris Karloff, Dorothy Dorothy Sebastian\nDirector: Richard Thorpe\n\nTo rescue a beautiful gal kidnapped by his gang, wanted outlaw The Utah Kid marries the distressed damsel and decides to go straight.\n\nTRIVIA:  A year after his supporting role in \"The Utah Kid, \" Boris Karloff would rise to international super-stardom in James Whale's 1931 horror classic, Frankenstein.",
      "addedAt": "2025-12-24T01:08:18.800Z",
      "thumbnail": "https://i.ytimg.com/vi/2VpoBWDm0js/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDENk8EHIxHAX9X23NoJykwHh82bA",
      "duration": 2765,
      "language": "en",
      "year": 1930,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "57 min",
    "imdbRating": 5.5,
    "imdbVotes": 65,
    "Genre": "Action, Romance, Western",
    "Plot": "Cal Reynolds, known as The Utah Kid eludes a sheriff's posse and takes refuge in Robber's Roost, a hideout for outlaws running from the law complete with its own dirt-floor saloon. Jennie Lee, a school teacher from a nearby town is out sight-seeing and is picked up by a couple of the boys and brought into the saloon. Since they aren't gentleman and don't believe in \"finders-keepers\", a brawl breaks out over who gets the girl until Cal steps forward and claims she is his fiancée who had followed him there and hands off, thank you. Some of the boys, including Baxter aren't buying and, just to prove Cal's claim is true, trot out Parson Joe to tie the knot. Jennie also forgets to mention she is engaged to town Sheriff Bentley. Cal, realizing that he is now really married, decides to reform but he isn't far along in his program before Sheriff Bentley and a posse of deputies show up looking for Jennie, and the outlaws think Cal has gone too far too fast reference his reformation and blame him. To prove otherwise Cal joins the gang in a battle against the law and wounds the sheriff, but later saves his life. Gang leader Butch is killed in a duel with Cal, and Jennie decides that Cal is the man for her.",
    "Director": "Richard Thorpe",
    "Writer": "Frank Howard Clark",
    "Actors": "Rex Lease, Dorothy Sebastian, Tom Santschi",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0021555",
    "tt0022028",
    "tt0021083",
    "tt0023967",
    "tt0019711",
    "tt0022399",
    "tt0065520",
    "tt0059114",
    "tt0027217",
    "tt0132951",
    "tt0029055",
    "tt0020809"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:39:16.490Z"
}