{
  "imdbId": "tt0040257",
  "title": "Cry of the City",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1948-cry-of-the-city-una-vida-marcada-robert-siodmak-vose",
      "id": "1948-cry-of-the-city-una-vida-marcada-robert-siodmak-vose",
      "title": "1948 - Cry of the City - Una vida marcada - Robert Siodmak - VOSE",
      "description": "For Academic / Educational Use Only derechonoir.wordpress.com",
      "fileSize": 637414244,
      "addedAt": "2026-01-07T00:06:03.999Z",
      "thumbnail": "https://archive.org/services/img/1948-cry-of-the-city-una-vida-marcada-robert-siodmak-vose",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 1917
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cry-of-the-city-1948_202008",
      "id": "cry-of-the-city-1948_202008",
      "title": "Cry Of The City (1948)",
      "description": "UMA VIDA MARCADA (Cry of the City, 1948 - USA) (Filme Completo / Legendado em Português) Data de Lançamento: 29 September 1948 (New York City, New York) » SINOPSE: Nova York. Os detetives da polícia Collins (Fred Clark) e Candella (Victor Mature) observam um trapaceiro insignificante, Martin Rome (Richard Conte), que matou um policial, receber a extrema unção, pois acabou sendo baleado. No entanto Martin se recupera e planeja enganar Collins e Candella, pois só assim irá escapar do seu destino, que é a pena de morte. Rome recebe duas visitas no hospital: Teena Riconti (Debra Paget), sua namorada e a única mulher que realmente amou, que foi secretamente visitá-lo, e Niles (Berry Kroeger), um advogado corrupto que tenta fazer Rome assinar uma confissão dizendo que participou de um grande roubo de jóias, pois confessando ou não ele irá para a cadeira elétrica e em troca Teena receberia 10 mil dólares para começar a vida em outro lugar. Rome se recusa a assinar e Niles ameaça incriminar Teena como seu cúmplice. Preocupado que Candella, que foi seu amigo de infância, possa encontrar Teena, Rome foge da prisão e vai ao escritório de Niles para aparentemente aceitar a oferta, mas na verdade planeja deixar o país com Teena. » » SOBRE O FILME: Muito bom Noir! Adaptado do romance The Chair for Martin Rome de Henry Edward Helseth, o filme conta a história de um criminoso carismático e seu inimigo, o tenente Candella… A profundidade psicológica dos personagens é interessante, sendo muito ambíguos a maior parte do tempo, como é de costume do estilo. Com atenção especial para as femme fatales, que roubam a cena algumas vezes. » » DIREÇÃO: Robert Siodmak ROTEIRO: Richard Murphy (screenplay), Henry Edward Helseth (novel) GÊNERO: Crime, Drama, Film-Noir  ORIGEM: USA DURAÇÃO: 1h 35min » » ELENCO PRINCIPAL: John Hodiak … George W. Taylor Nancy Guild … Christy Smith Lloyd Nolan … Tenente Policial Donald Kendall Richard Conte … Mel Phillips Josephine Hutchinson … Elizabeth Conroy Fritz Kortner … Anzelmo Margo Woode … Phyllis Sheldon Leonard … Sam Lou Nova … Hubert John Ireland … Voz John Russell … Capitão da marinha » » Fontes de Pesquisa/Textos: IMDb, Filmow, Cine Players.",
      "fileSize": 3666959446,
      "addedAt": "2026-01-07T00:07:51.626Z",
      "thumbnail": "https://archive.org/services/img/cry-of-the-city-1948_202008",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 8109
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cry-of-the-city-1948_202507",
      "id": "cry-of-the-city-1948_202507",
      "title": "Cry of the City (1948)",
      "description": "Petty crook and cop-killer Martin Rome, in bad shape from wounds in the hospital prison ward, still refuses to help slimy lawyer Niles clear his client by confessing to another crime. Police Lt. Candella must check Niles' allegation; a friend of the Rome family, he walks a tightrope between sentiment and cynicism. When Martin fears Candella will implicate his girlfriend Teena, he'll do anything to protect her. How many others will he drag down to disaster with him? Watch on RetroFlix:  https://retroflix.org/cry-of-the-city-1948/",
      "fileSize": 537594713,
      "addedAt": "2026-01-07T00:07:51.626Z",
      "thumbnail": "https://archive.org/services/img/cry-of-the-city-1948_202507",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 110
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cry-of-the-city-1948",
      "id": "cry-of-the-city-1948",
      "title": "Cry Of The City [1948] Dir. Robert Siodmak, Starring Richard Conte, Shelley Winters, Victor Mature",
      "description": "You can find out more about this movie from Wikipedia and Film Nolr of the Week .   Cry of the City is a 1948 black-and-white Film Noir directed by Robert Siodmak, based on the novel by Henry Edward Helseth, The Chair for Martin Rome. The screenwriter Ben Hecht worked on the film's script, but is not credited. The film was partly shot on location in New York City and stars Richard Conte, Shelley Winters and Victor Mature",
      "fileSize": 926608779,
      "addedAt": "2026-01-07T00:07:51.626Z",
      "thumbnail": "https://archive.org/services/img/cry-of-the-city-1948",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 2599
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "95 min",
    "imdbRating": 7.2,
    "imdbVotes": 3838,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Petty crook and cop-killer Martin Rome, in bad shape from wounds in the hospital prison ward, still refuses to help slimy lawyer Niles clear his client by confessing to another crime. Police Lt. Candella must check Niles' allegation; a friend of the Rome family, he walks a tightrope between sentiment and cynicism. When Martin fears Candella will implicate his girlfriend Teena, he'll do anything to protect her. How many others will he drag down to disaster with him?",
    "Director": "Robert Siodmak",
    "Writer": "Richard Murphy, Henry Edward Helseth, Ben Hecht",
    "Actors": "Victor Mature, Richard Conte, Fred Clark",
    "Language": "English, Italian, Latin",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0041268",
    "tt0041368",
    "tt0038455",
    "tt0038669",
    "tt0036260",
    "tt0036711",
    "tt0039536",
    "tt0041958",
    "tt0041487",
    "tt0042039",
    "tt0040779",
    "tt0039220"
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:13:42.269Z"
}