{
  "imdbId": "tt0003755",
  "title": "The Car of Death",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheCarOfDeath1914",
      "id": "TheCarOfDeath1914",
      "title": "\"The Car of Death\" (1914) starring Helen Holmes",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Car of Death\" is a short action drama, included in our program to illustrate the contributions of our stars Helen Holmes and Jack Hoxie. In this film Helen Holmes was clearly rehearsing for the role that brought to her fame and recognition in a serial that started getting released two months later.  She became the audacious star of \"The Hazards of Helen\", acting as the heroine of numerous railroad adventures. Jack Hoxie plays a lineman and gets credit with the name Hart Hoxie, which he used in the first decade of his acting career. He would change it five years later when he was on his way to becoming a leading luminary of Westerns. \"The Car of Death\" is the earliest surviving film with Jack Hoxie that we have, so we can see the beginning of his illustrious career. Jack Hoxie and Helen Holmes partnered again in two Westerns, which probably don't survive - \"Fighting Fury\" (1924) and \"The Sign of the Cactus\" (1925). If you have any information about these films, please let us know. Directed by                J.P. McGowan Scenario                     Edward T. Matlack Starring                      Helen Holmes, Jack Hoxie Release date               August 29, 1914 Running time             12 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 5938597,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheCarOfDeath1914",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 2816
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": 10,
    "Genre": "Short, Drama",
    "Plot": "Deeming Kate of too frivolous a disposition, the Hopeville School Committee, headed by Rev. Haskins, request the girl's resignation as teacher of the village school. Fond of her work and loving her little charges, Kate feels keenly the action of the narrow-minded members of the committee. Kate plans to attend the outing of the Hopeville Sunday School. The attitude of the people in charge is so plainly hostile, that the girl decides to stay home. Filled with bitterness, Kate imparts her grievances to her sweetheart, Ira, who is employed as a lineman. While the two are conversing, Adams, the station agent informs Ira that a break in the telegraph wires down the line demands immediate attention. While Ira searches for the break, the picnic train carrying the children of the Sunday School leaves Hopeville. A dynamite car breaks loose from a freight train and runs wild. Ira sees the death car rushing to meet the picnic train. Cutting in on the line, he wires Adams to sidetrack the runaway. Terrified, Adams endeavors to reach the switch in time. Old and stiff, the man realizes he cannot make the switch, which is some distance down the track. Calling Kate, he apprises her of the situation. With the speed of a deer, the girl runs down the track and pulls the switch lever, sending the runaway along a sidetrack just as the picnic train flashes by. The dynamite car is derailed and a terrific explosion ensues. The picnic train comes to a halt and the members of the school committee rush to learn the cause of the explosion. Adams tells them of Kate's bravery. Filled with gratitude the men beg Kate to return to her old position. The girl is about to accept when Ira arrives and interposes an objection. According to the lineman, Kate is about to assume more important duties; she is to become his wife.",
    "Director": "J.P. McGowan",
    "Writer": "Edward T. Matlack",
    "Actors": "Helen Holmes, Jack Hoxie, George A. Williams",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1488145",
    "tt1488156",
    "tt1487926",
    "tt1316468",
    "tt0351988",
    "tt0004028",
    "tt0004209",
    "tt0003734",
    "tt1275552",
    "tt2160081",
    "tt1223220",
    "tt1198545"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.273Z"
}