{
  "imdbId": "tt0001044",
  "title": "The Son's Return",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheSonsReturn",
      "id": "TheSonsReturn",
      "title": "\"The Son's Return\" (1909) director D. W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Son's Return\"  is a short drama directed by D.W. Griffith.  The film is included in our program to illustrate the work of our stars cinematographer Billy Bitzer and Arthur V. Johnson. Billy Bitzer shares the cinematography credit with Arthur Marvin. The son returns to the country after making it rich in the big city. He decides to conceal his identity in order to surprise his folks, but this leads to unexpected consequences. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Charles West, Herbert Prior, Anita Hendrie, Mary Pickford, Arthur V. Johnson Distributed by                   Biograph Company Release date                      June 14, 1909 Country                             United States Running time                    11 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 148324688,
      "addedAt": "2026-01-07T00:07:05.036Z",
      "thumbnail": "https://archive.org/services/img/TheSonsReturn",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 1238
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-sons-return",
      "id": "silent-the-sons-return",
      "title": "The Son's Return",
      "fileSize": 207064306,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-sons-return",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 241
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.7,
    "imdbVotes": 115,
    "Genre": "Short, Drama",
    "Plot": "Will Sanderson's father kept the village inn, but Will being deeply enamored of pretty Mary Clark had aspirations above the plebeian and rather impecunious calling of village boniface, and so decided to go to the big city and fight for fortune, having read the glowing lines of the biographers of great men who invariably start them on their career as poor country lads. Bidding his sweetheart Mary a fond, but tearful farewell, he then takes his leave of his dear old parents, his mother presenting him with a miniature of herself, as a memento to guide him along the path of righteousness. He is not long in the metropolis when his bright, alert manner appeals to the manager of a banking house and he obtains employment. He had resolved not to return home until he has made a name for himself, and five years later we find him holding a position of responsibility with good salary in the concern. His appearance has somewhat changed, owing to his growing a beard, and one day, taking his mother's picture from his pocket he decides to pay them a visit. The decision is coincident with a letter he receives later during the day. It is from his sweetheart Mary and tells him of his parents' dire straits, which they, through pride, have kept from him. But as they are on the eve of eviction she asks that he help them. Back he goes with his savings, ample to relieve their difficulties, and to surprise them enters the inn and engages a room incog. He has displayed his well-filled wallet in their presence, and their extreme desperation makes them covetous. When the boy lies down for a nap the old father cannot resist, and in securing the wallet arouses the boy, and is forced to knock him on the head. Thinking he had killed his guest, he takes his inert body out and deposits him in the field under the bushes, where he is found later by Mary, who, calling help, assists him to her home nearby, he recovering from the blow on the way. Meanwhile the old couple have gone back to the inn and upon opening the wallet what a revelation: \"My God, we have murdered our own boy.\" They find therein the mother's picture. They are paralyzed with fear and sorrow, so in an almost maniacal condition they go to Mary's home to confess their awful deed. You may imagine their feelings when they are brought face to face with their boy, and dropping on their knees in humble contrition they thank God for the deliverance.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith, Guy de Maupassant",
    "Actors": "Charles West, Herbert Prior, Anita Hendrie",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001083",
    "tt0000882",
    "tt0001265",
    "tt0001315",
    "tt0001753",
    "tt0001499",
    "tt0001741",
    "tt0001978",
    "tt0001032",
    "tt0000832",
    "tt0000852",
    "tt0001050"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}