{
  "imdbId": "tt0003323",
  "title": "The Reformers; or, the Lost Art of Minding One's Business",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheReformersForYT",
      "id": "TheReformersForYT",
      "title": "\"The Reformers\" (1913) director D. W. Griffith cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Reformers\" is a short drama, included in our program to illustrate the work of  Robert Harron and Billy Bitzer, stars of Silent Hall of Fame. A man joins the League of Civic Purity to reform society, but will he be able to rein his own household? Directed by               D. W. Griffith Produced by             Biograph Company Scenario by               D. W. Griffith         Starring                     Charles Hill Mailes, Robert Harron,  Mae Marsh, Walter Miller, Jennie Lee, Kate Bruce Cinematography        Billy Bitzer Distributed by           The General Film Company, Incorporated Release date               July 6, 1913 Running time             20 min. Country                      United States Language                    Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 26993826,
      "addedAt": "2026-01-07T00:07:05.035Z",
      "thumbnail": "https://archive.org/services/img/TheReformersForYT",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 4907
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "33 min",
    "imdbRating": 6.5,
    "imdbVotes": 33,
    "Genre": "Short, Comedy, Drama",
    "Plot": "Behold in this film the Uplifter, a peculiarity of the human species, quite convinced that all that is, is wrong. Forth to the uplift he minds everybody's business but his own, until that business is as clean, pure and spotless as himself. Verily in these later days is there no school of art named, \"Minding One's Business.\"",
    "Director": "D.W. Griffith",
    "Writer": "Frank E. Woods",
    "Actors": "Charles Hill Mailes, Jennie Lee, Robert Harron",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002478",
    "tt0003497",
    "tt0003516",
    "tt0002968",
    "tt0002082",
    "tt0002342",
    "tt0002386",
    "tt0002391",
    "tt0002415",
    "tt0002190",
    "tt0000800",
    "tt0000946"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.035Z"
}