{
  "imdbId": "tt0038492",
  "title": "Dragonwyck",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dragonwyck-1946",
      "id": "dragonwyck-1946",
      "title": "Dragonwyck (1946)",
      "description": "For Miranda Wells, moving to New York to live in Dragonwyck Manor with her rich cousin, Nicholas, seems like a dream. However, the situation gradually becomes nightmarish. She observes Nicholas' troubled relationship with his tenant farmers, as well as with his daughter, to whom Miranda serves as governess. Her relationship with Nicholas intensifies after his wife dies, but his mental imbalance threatens any hope of happiness. Watch on RetroFlix:  https://retroflix.org/dragonwyck-1946/",
      "fileSize": 1267157742,
      "addedAt": "2026-01-07T00:08:15.375Z",
      "thumbnail": "https://archive.org/services/img/dragonwyck-1946",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 323
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dragonwyck.-1946",
      "id": "dragonwyck.-1946",
      "title": "Dragonwyck (1946)",
      "description": "\" Dragonwyck \" is a 1946 film directed by Joseph L. Mankiewicz . The movie is based on Anya Seton's novel of the same name and features themes of gothic romance, societal expectations, and moral dilemmas .The story revolves around Margaret (played by Gene Tierney ), who is invited to stay at the grand estate of her distant cousin, Nicholas Van Ryn (played by Vincent Price ). As she becomes entangled in the enigmatic world of Dragonwyck, she finds herself drawn to Nicholas, whose dark and brooding nature hides more than just charm. The gothic atmosphere and supernatural elements blend with themes of unrequited love and betrayal, ultimately leading to dramatic consequences.\"Dragonwyck\" received mixed reviews upon its release, with praise often directed at Tierney's performance and the film's cinematography. Vincent Price's portrayal of the tormented Nicholas is also frequently noted as a highlight.",
      "fileSize": 1664666066,
      "addedAt": "2026-01-07T00:08:15.375Z",
      "thumbnail": "https://archive.org/services/img/dragonwyck.-1946",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 179
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dragonwyck-colorized-1946-720p",
      "id": "dragonwyck-colorized-1946-720p",
      "title": "Dragonwyck ( Colorized, 1946) 720p",
      "description": "Dragonwyck (1946) colorized with HAVC",
      "fileSize": 3276887740,
      "addedAt": "2026-01-07T00:08:15.375Z",
      "thumbnail": "https://archive.org/services/img/dragonwyck-colorized-1946-720p",
      "language": [
        "eng",
        "Italian"
      ],
      "year": 1946,
      "collection": "feature_films",
      "downloads": 273
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "103 min",
    "imdbRating": 6.9,
    "imdbVotes": 5595,
    "Genre": "Drama, Mystery, Romance",
    "Plot": "In 1844, the Wells family lives in a small farm of their own in Greenwich, Connecticut and the sons and daughters have a rigid discipline and religious education from the patriarch Ephraim Wells. When his wife Abigail Wells receives a letter from her wealthy distant cousin Nicholas \"Nick\" Van Ryn inviting one of her daughters to live with his wife Johanna Van Ryn and him nursing their daughter Katrine Van Ryn, the naive Miranda Wells gets excited with the perspective of traveling. Her mother convinces Ephraim to let her go and Miranda travels with her father to New York. They meet Nick and they learn that he is a patroon of farmers at the Hudson Valley. Then Miranda travels to the Dragonwyck mansion where she is introduced to the voracious Johanna and the sweet Katrine and to the housekeeper Magda. Miranda also meets Dr. Jeff Turner, who is a sort of leader of the farmers that work for Nicholas, in a party and befriends him. Soon she notes that Katrine is neglected by her parents. When Johanna gets mysteriously ill and dies, Miranda returns home. But the atheistic Nick visits her family to propose to marry her. Now Miranda's dream comes true and she gets married with him and moves to Dragonwyck. Will they live happily ever after?",
    "Director": "Joseph L. Mankiewicz",
    "Writer": "Anya Seton, Joseph L. Mankiewicz, Jacques Monteux",
    "Actors": "Gene Tierney, Walter Huston, Vincent Price",
    "Language": "English, French, Dutch",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0041587",
    "tt0044314",
    "tt0038965",
    "tt0053318",
    "tt0052106",
    "tt0038873",
    "tt0041616",
    "tt0041182",
    "tt0037865",
    "tt0037515",
    "tt0035378",
    "tt0037008"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:26:41.337Z"
}