{
  "movieId": "tt0027053",
  "title": "Streamline Express",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/StreamlineExpress1935",
      "id": "StreamlineExpress1935",
      "title": "Streamline Express",
      "description": "As of 202 there is now a better restored copy of this movie from Grapevinevideo.com, but it still has some missing video that had to be filled in with stills or other video.  The Grapevine original DVD had incorrect telecining which prevents the best restoration, but it is still better than this copy from VHS.  Restoration is best done from a proper telecined version or still better from a 24fps raw digital transfer. This is an amusing public domain video which was ripped from an old VHS recording. All of the available copies of this video came from the same deteriorated film. The original film may have been recorded from a collector's copy, or possibly from an old late night movie program. Various vendors have marketed copies all coming from the same source, and possibly from the same VHS copy. At last count there are several vendors, Alpha, Nostalgia Family Video, Anchor Videos, Vci Home Video and others. The older Nostalgia version is available in VHS while the Alpha version is a DVD. The Alpha DVD has slightly better black and white definition which gives the impression of more detail, but it has much much more noise. Both versions have the identical jumps, blackouts during scene changes, and film spots. But the Alpha DVD has enlarged the picture slightly which cuts off important details, and it has cut out parts of several scenes because of bad framing or blank picture. The Nostalgia video is a more complete version and appears to have slightly sharper picture with less noise. The original source was poorly transferred to VHS, or broadcast using old technology. In particular the video was poorly copied and the technician did not pay attention to the framing. The copy available here has been carefully transferred from a fairly complete VHS version. Using VirtualDub the video was stabilized and a large amount of the obtrusive noise was removed. The audio was carefully denoised with care taken to preserve the train sound effects. Obtrusive noises due to the deteriorated film were removed by hand. Some video jumps and the scene blackouts were corrected by hand, but some jumps due to missing frames can not be fixed. Blank video was filled in with adjacent frames or reasonable stills captured from adjacent frames. The bad framing was partially fixed, but could not be completely fixed with the available technology. A more carefully transferred version would be welcome. The result is a much more watchable copy of this movie. It may not be considered a \"classic\" film, but it has a number of good actors and is representative of Hollywood films of the mid '30s. It could even classify as an early science fiction because of the futuristic high speed monorail train. While the âtrainâ looked streamlined, the bloated size would cause large wind resistance, and severely limit its speed. Actually it was not really a train because it only had one car, so it might be considered to be a high speed street car. The futuristic interior design later appeared in many other science fiction films. The basic story concerns a tiff between a producer played by Victor Jory and his runaway star actress played by Evelyn Venable. The action mainly takes place on the Streamline Express, a high speed coast to coast monorail. Other stories are intertwined with the main story, and the usual Hollywood happy ending ensues, after some comical and suspenseful scenes. Enjoy!",
      "fileSize": 1958497642,
      "addedAt": "2026-01-07T00:06:58.269Z",
      "thumbnail": "https://archive.org/services/img/StreamlineExpress1935",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 52174
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=74Z18UELYs8",
      "id": "74Z18UELYs8",
      "title": "Streamline Express (1935) [Comedy] [Drama] [Mystery]",
      "description": "Broadway star Patricia Wallis (Evelyn Venable), after a quarrel, leaves the new show produced by Jimmy Hart (Victor Jory) and, not realizing that Hart is in love with her, she runs off to California with the wealthy, stodgy Freddy Arnold (Theodore von Eltz) with the announced intention of getting married. Jimmy discovers that Pat and Freddy will be aboard the crack new Streamline Express and he also boards, only to become involved in what appears to be a diamond theft. When Jimmy is falsely accused of the \"theft\" by blackmailer Gilbert Landon (Sidney Blackmer), Pat comes to her senses, precipitating a hasty and starling conclusion to the mystery of the missing diamond.\n\n---\n\nDirected by Leonard Fields, produced by Nat Levine (producer) and George Yohalem (supervising producer), written by Wellyn Totman (story), Leonard Fields (screenplay), David Silverstein (screenplay) and Olive Cooper (screenplay), starring Victor Jory as Jimmy Hart, Evelyn Venable as Patricia Wallace, Esther Ralston as Elaine Vincent, Erin O'Brien-Moore as Mary Forbes, Ralph Forbes as Fred Arnold, Sidney Blackmer as Gilbert Landon, Vince Barnett as Mr. Jones, Clay Clement as John Forbes, Bobby Watson as Gerald Wilson, Lee Moran as Larry Houston, Syd Saylor as Smith (Steward), Libby Taylor as Fawn (Patricia's Maid), Edward Hearn as Mack (Purser), Allan Cavan as Senior Conductor, Wade Boteler as Baggage Gateman, Harry Tyler as Steve, Tommy Bupp as Wilbur (Boy with Dog), Morgan Brown as Bartender, Jack Raymond as Baggage Man, C. Montague Shaw as Physician, Lynton Brent as Radio Operator and Theodore von Eltz as Freddy Arnold.\n\n---\n\nSource: \"Streamline Express\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 24 March 2013. Web. 28 July 2013. http://en.wikipedia.org/wiki/Streamline_Express.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:11.208Z",
      "thumbnail": "https://i.ytimg.com/vi/74Z18UELYs8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA1zp9MnSGAyMpj9YcyY4rhgtR02g",
      "duration": 4203,
      "language": "en",
      "year": 1935,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YrEBlKbeJcY",
      "id": "YrEBlKbeJcY",
      "title": "Streamline Express (1935) COMEDY-MYSTERY",
      "description": "Stars: Victor Jory, Evelyn Venable, Esther Ralston\n Writer/Director: Leonard Fields\n\n A disparate group of people meet as passengers on a super-speed train: a seductive blackmailer, the stage director he intends to frame, his feisty leading lady, and a woman chasing her husband who is running away with the blackmail victim!",
      "addedAt": "2025-12-26T23:52:17.380Z",
      "thumbnail": "https://i.ytimg.com/vi/YrEBlKbeJcY/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBjAWAAuADigIMCAAQARhdIF0oXTAP&rs=AOn4CLAmHagowqQwYZ7CheObsHgXIo-d3A",
      "duration": 4202,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "71 min",
    "imdbRating": 5.3,
    "imdbVotes": 209,
    "Genre": "Comedy, Drama, Mystery",
    "Plot": "A disparate group of people meet as passengers on a super-speed train crossing the U.S. Aboard are a seductive confidence man, a stage director masquerading as a steward in hopes of stopping his feisty leading lady from eloping, and a woman trying to stop her husband from running away with his mistress.",
    "Director": "Leonard Fields",
    "Writer": "Wellyn Totman, Leonard Fields, David Silverstein",
    "Actors": "Victor Jory, Evelyn Venable, Esther Ralston",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0025463",
    "tt0030359",
    "tt0025349",
    "tt0025064",
    "tt0031831",
    "tt0024159",
    "tt0036695",
    "tt0026085",
    "tt0045620",
    "tt0026593",
    "tt0026819",
    "tt0037267"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.269Z"
}