{
  "imdbId": "tt0008060",
  "title": "The Heart of Texas Ryan",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheHeartOfTexasRyan",
      "id": "TheHeartOfTexasRyan",
      "title": "THE HEART of TEXAS RYAN",
      "description": "Plot has Bessie Eyton returning to Texas after two years away at school to join her ranch owner father Col. Ryan (George Fawcett) who nicknames her âTexasâ Ryan. The hard-riding gal becomes the idol of the ranch hands, especially Single-Shot Jack Parker (Tom Mix). At this juncture, itâs apparent Tomâs films, be it shorts or features, included strong comedy elements as well as he-man action. Here, a drunken Tom nearly burns down the town fooling around with fireworks on the 4th of July. In so doing, tom incurs the wrath of Sheriff Frank Campeau who is the secret rustler ally of Mexican bandit William Ryno who, coincidentally, also favorsâin a more lustful wayâTexas Ryanâs charms. Hoping for ransom money, Rynoâs gang kidnaps Texas but Tom rescues her. When Ryno and his rustlers strike back, Tom, in a raging storm, outwits them and captures Ryno. But he soon escapes, sending Tom on another chase into Mexico where Tom is captured by Rynoâs gang. As heâs about to be executed by the outlaws, the film takes an odd turn, having Texas, now realizing she loves Tom, simply pay a ransom for his release. On October 12, 1940, while driving his 1937 Cord Sportsman through the Arizona desert he took a turn too fast, a suitcase broke loose and struck him in the head and his car plunged into a ravine. The ravine was later named \"The Tom Mix Wash\" in his honor. A plaque at the location reads: \"TOM MIX January 6, 1880 - October 12, 1940 Whose spirit left his body on this spot and whose characterization and portrayals in life served to better fix memories of the old west in the minds of living men",
      "fileSize": 1551947356,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheHeartOfTexasRyan",
      "collection": "feature_films",
      "downloads": 6538
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wlrd7uza52U",
      "id": "wlrd7uza52U",
      "title": "The Heart of Texas Ryan (1917) aka Single Shoot Parker Western Silent Film",
      "description": "Colonel William Ryan, a ranch owner, in the Lone Star State, has named his only daughter Texas. Jack Parker, a devil-may-care cowpuncher,loves only two things, one is his horse and the other a photograph of Texas Ryan, whom he has never seen. He has named his horse \"Dream Girl\" after the girl of the photograph. \n\nDirector: E.A. Martin\nWriters: Zane Grey, Gilson Willets \nStars: Tom Mix, Bessie Eyton, Frank Campeau \nGenres: Silent, Western\n\n@CCC socials:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.instagram.com/cultcinemaclassics -\nhttps://www.twitch.tv/cultcinema",
      "addedAt": "2025-12-27T00:49:31.619Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/wlrd7uza52U/maxresdefault.webp?v=63850824",
      "duration": 5914,
      "language": "en",
      "year": 1917,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "60 min",
    "imdbRating": 5.1,
    "imdbVotes": 114,
    "Genre": "Western",
    "Plot": "Colonel William Ryan, a ranch owner, in the Lone Star State, has named his only daughter Texas. Jack Parker, a devil-may-care cowpuncher, loves only two things, one is his horse and the other a photograph of Texas Ryan, whom he has never seen. He has named his horse \"Dream Girl\" after the girl of the photograph. After several years in an eastern college, Texas return home. Her father is happy and she is idolized by the cowboys of the ranch. Antonio Moreno is the head of a band of cattle rustlers. His lieutenant, \"Dice\" McAllister, a former road agent, uses his office as marshal as a cloak for unlawful deeds. Moreno and McAllister have long plotted to secure Ryan's wealth, and Moreno resolves to pay court to the girl. In the \"Last Chance\" saloon and dance hall a shooting scrape occurs. Jack Parker, enemy of McAllister, is charged as being an accessory. Harsh words are exchanged and Parker overcomes McAllister in a desperate conflict, and then crosses the border until the disturbance blows over. He returns on the Fourth of July and proceeds to celebrate. Colonel Ryan and Texas meet him and Parker learns she is the girl of the photograph. Moreno and his gang, under pretense of friendship, visit the Ryan ranch during the round-up, and when Texas spurns the Mexican's offer of marriage, he threatens her, and is driven from the ranch. When Texas and her girlfriend, Marion Smith, are riding in the hills, they are seen by Moreno's men. Texas is pursued and made prisoner. Marion brings the news to Colonel Ryan. Jack Parker resolves to free the girl. By an offer of money, he persuades the bandits to free her. Moreno and McAllister rustle the Ryan cattle and are discovered by Parker. During a night of rain and wind he slips into the camp of the outlaws, takes Moreno a prisoner, and leaves a note telling McAllister of what he has done. When McAllister finds the note in the morning, he decides to leave the country. Moreno later makes his escape. Parker decides to go on the trail. He bids Texas farewell, telling her he is not worthy of her. As time passes Texas comes to understand that she loves the cowpuncher. Moreno continues his lawlessness. After a desperate conflict Parker is taken prisoner. Word is brought to Texas Ryan that he is to be shot that evening. The girl tells her father she believes the cattle thieves will spare Jack's life for money and starts in an automobile on her race with death. Moreno gloats over the revenge. The executioner awaits the order to fire. Just as Moreno is about to give the order, Texas arrives. The cupidity of the Mexican bandits is aroused by the gold, and the cowpuncher is freed and takes Texas into his arms.",
    "Director": "E.A. Martin",
    "Writer": "Zane Grey, Gilson Willets",
    "Actors": "Tom Mix, Bessie Eyton, Frank Campeau",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006913",
    "tt1072650",
    "tt0007610",
    "tt0008309",
    "tt0008319",
    "tt0007755",
    "tt0008571",
    "tt0008775",
    "tt0011758",
    "tt0008892",
    "tt0009466",
    "tt0006780"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}