{
  "imdbId": "tt0049210",
  "title": "Finger of Guilt",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/IntimageStranger56985",
      "id": "IntimageStranger56985",
      "title": "Finger of Guilt",
      "description": "Title: Finger of Guilt Summary: A married movie studio executive's life, starts to fall apart when he is intimately stalked by a beautiful woman he claims he does not know. Directed by: Joseph Losey, Alec C. Snowden Actors: Production Company: Anglo-Guild Productions Release Date: 17 October 1956 (USA) Aspect Ratio: 1.37 : 1 A married movie studio executive's life, starts to fall apart when he is intimately stalked by a beautiful woman he claims he does not know.",
      "fileSize": 701412621,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/IntimageStranger56985",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 1355
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "95 min",
    "imdbRating": 6.2,
    "imdbVotes": 778,
    "Genre": "Drama, Film-Noir",
    "Plot": "Reggie Wilson, a former Film Editor in Hollywood, left in a scandal in, as a ladies man, sleeping with the wrong woman. Wanting to stay in the business, he eventually moved to London to try and restart. Working up through the ranks at Commonwealth Pictures, Reggie was ultimately made Executive Producer at the studio by the studio chief, Ben Case, who, upon Reggie's ascension, is now more the studio figurehead. And while some have labeled the move more one to assume power, Reggie also married Ben's daughter, Lesley, in he trying to put his past behind him in truly loving her. He is working on what is arguably the biggest picture of his career, Eclipse - one that Ben admittedly has little faith in in he seeing it as being overblown - and as such calls in a favor from an old friend, Hollywood actress Kay Wallace, a former lover who would admit that the prospect of starting up again with Reggie was as much a draw in coming to London as working on the picture itself. It was about the time that he started working on this picture that Reggie also started receiving letters from an Evelyn Stewart, an American in Newcastle. Despite his claims that he doesn't know her, the letters are love letters of sorts, pleading for him to let her back into his life. The more letters he receives, the more he believes that what she is writing she at least believes is the truth, she able to back up her claims of \"their past\" with dates and places, places he admits he was at at the times listed. Going to Newcastle to confront her leads to even more confusion on his part as the stronger her conviction, the more he becomes convinced that she is indeed telling the truth. Is Reggie going crazy like he thinks he is, or is there something else at play behind her assertions?",
    "Director": "Joseph Losey, Alec C. Snowden",
    "Writer": "Howard Koch",
    "Actors": "Richard Basehart, Mary Murphy, Constance Cummings",
    "Language": "English, French",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0048160",
    "tt0047205",
    "tt0049291",
    "tt0049340",
    "tt0049406",
    "tt0049904",
    "tt0049955",
    "tt0049769",
    "tt0049636",
    "tt0050087",
    "tt0050271",
    "tt0049621"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}