{
  "movieId": "tt0049263",
  "title": "The Girl Can't Help It",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dipwad2_zoho_4041",
      "id": "dipwad2_zoho_4041",
      "title": "The Girl Can't Help It",
      "description": "\"The Girl Can't Help It\" is a 1956 musical comedy film directed by Frank Tashlin and features Jayne Mansfield, Tom Ewell, and Edmond O'Brien in leading roles. The film is particularly known for its rock and roll music, featuring performances by early rock music legends. The plot revolves around a retired mobster, Fats Murdock (played by Edmond O'Brien), who hires a down-and-out press agent, Tom Miller (played by Tom Ewell), to make a singing star out of his girlfriend, Jerri Jordan (played by Jayne Mansfield). The catch is that Jerri has no discernible singing talent. Throughout the film, Tom Miller attempts to navigate the challenges of this difficult task, all the while dealing with his growing attraction to Jerri. The movie is notable not only for its comedy but also for its vibrant musical performances by rock and roll pioneers like Little Richard, Fats Domino, Eddie Cochran, and Gene Vincent, among others. It provides a snapshot of the burgeoning rock and roll scene of the mid-1950s.",
      "fileSize": 5252172922,
      "addedAt": "2026-01-07T00:08:07.357Z",
      "thumbnail": "https://archive.org/services/img/dipwad2_zoho_4041",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 4600
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "98 min",
    "imdbRating": 6.8,
    "imdbVotes": 4260,
    "Genre": "Comedy, Music",
    "Plot": "A down-and-out gangster hires an alcoholic press agent to make his blonde bombshell girlfriend a recording star in 6 weeks. But what is he going to do when he finds out that she has no talent? And what is going to happen when the two fall in love?",
    "Director": "Frank Tashlin",
    "Writer": "Frank Tashlin, Herbert Baker, Garson Kanin",
    "Actors": "Tom Ewell, Jayne Mansfield, Edmond O'Brien",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0051196",
    "tt0049683",
    "tt0048700",
    "tt0048290",
    "tt0135630",
    "tt0044619",
    "tt0029430",
    "tt0029431",
    "tt0036334",
    "tt0148180",
    "tt0051815",
    "tt0053291"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.357Z"
}