{
  "imdbId": "tt0014532",
  "title": "The Ten Commandments",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-ten-commandments",
      "title": "The Ten Commandments",
      "fileSize": 39765071602,
      "id": "silent-the-ten-commandments"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aaqplGNtAIY",
      "title": "The Ten Commandments (1923) | Colorized Public Domain Epic Silent Film Directed by Cecil B. DeMille",
      "description": "The Ten Commandments (1923) is an American silent epic directed by Cecil B. DeMille and produced by Paramount Pictures. Unlike the better-known 1956 remake, this earlier version was one of the most ambitious silent-era productions, blending biblical spectacle with a modern morality tale. This restored and colorized edition revives the grandeur of DeMille’s original vision, making it accessible for contemporary audiences across the United States, Europe, and worldwide. With its monumental sets, large-scale crowd sequences, and groundbreaking effects for its time, the film remains a cornerstone of early Hollywood spectacle.\n\nPlot Summary:\nThe film is structured in two parts.\n\nThe first half dramatizes the biblical story of the Exodus. Moses (Theodore Roberts) receives the Ten Commandments from God on Mount Sinai and delivers them to the Israelites. The narrative focuses on the confrontation with Pharaoh, the dramatic plagues, and the parting of the Red Sea — staged with elaborate special effects that stunned 1920s audiences. This portion highlights DeMille’s eye for grandeur and his pioneering use of large sets and visual innovation in silent cinema.\n\nThe second half shifts to a modern setting of the 1920s, where two brothers, John and Dan McTavish (Richard Dix and Rod La Rocque), live under the shadow of the Commandments. John is a devout believer who respects moral law, while Dan is a skeptic who dismisses religion and pursues wealth and pleasure at any cost. Dan’s disregard leads him into corruption, adultery, and crime, culminating in tragedy that serves as a stark warning against violating God’s laws. This dual structure makes the 1923 film unique — both a biblical epic and a contemporary morality drama.\n\nCast and Crew:\n• Director: Cecil B. DeMille\n• Producer: Cecil B. DeMille\n• Writers: Jeanie MacPherson (screenplay)\n• Cinematography: Alvin Wyckoff, J. Peverell Marley\n• Studio: Famous Players–Lasky / Paramount Pictures\n\nStarring:\n• Theodore Roberts as Moses\n• Charles de Rochefort as Pharaoh\n• Estelle Taylor as Miriam\n• Richard Dix as John McTavish\n• Rod La Rocque as Dan McTavish\n• Leatrice Joy as Mary Leigh\n• Nita Naldi as Sally Lung\n\nFilm Significance:\nThe Ten Commandments (1923) was one of the first major Hollywood epics, setting a standard for biblical films and large-scale productions. Its monumental sets, some built on the California desert, became legendary — with remnants buried in the sand at Guadalupe, California, where archaeologists later uncovered pieces of DeMille’s “lost city.” While overshadowed today by the 1956 remake, the silent original deserves recognition for its innovation, ambition, and cultural influence. It captures both DeMille’s talent for spectacle and his belief in cinema as a tool for moral instruction. For silent film enthusiasts and students of cinema history, it is a milestone in early Hollywood storytelling.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Ten Commandments (1923) remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white or silent cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe 1923 version was originally a black-and-white silent feature, relying heavily on intertitles, music, and visual spectacle. While historically authentic, such presentation can feel distant to modern audiences. Our colorized edition enhances the grandeur of the biblical scenes and the emotional depth of the morality tale, making the film more visually engaging without diminishing its silent-era artistry. This version bridges the gap between cinematic history and contemporary viewing, offering audiences a chance to experience DeMille’s original epic in a revitalized format.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten silent epics and B-movies to culturally significant dramas and comedies. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheTenCommandments #1923SilentFilm #CecilBDeMille #PublicDomainMovie #ColorizedClassic #SilentCinema #FilmRestoration #BiblicalEpic #ClassicHollywood #RichardDix #RodLaRocque #TheodoreRoberts #LeatriceJoy #1920sMovies",
      "id": "aaqplGNtAIY",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "136 min",
    "imdbRating": 6.8,
    "imdbVotes": 2731,
    "Genre": "Biography, Drama, History",
    "Plot": "The first part tells the story of Moses leading the Jews from Egypt to the Promised Land, his receipt of the tablets and the worship of the golden calf. The second part shows the efficacy of the commandments in modern life through a story set in San Francisco. Two brothers, rivals for the love of Mary, also come into conflict when John discovers Dan used shoddy materials to construct a cathedral.",
    "Director": "Cecil B. DeMille",
    "Writer": "Jeanie Macpherson",
    "Actors": "Theodore Roberts, Charles de Rochefort, Estelle Taylor",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "2 wins & 1 nomination"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0013571",
      "title": "Salomé",
      "year": 1922,
      "imdbRating": 6.6,
      "imdbVotes": 1123,
      "language": "None",
      "sourceType": "youtube",
      "channelName": "Colorized Public Domain"
    },
    {
      "imdbId": "tt0018054",
      "title": "The King of Kings",
      "year": 1927,
      "imdbRating": 7.3,
      "imdbVotes": 2581,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0012187",
      "title": "Forbidden Fruit",
      "year": 1921,
      "imdbRating": 6.6,
      "imdbVotes": 203,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0008150",
      "title": "Joan the Woman",
      "year": 1916,
      "imdbRating": 6.4,
      "imdbVotes": 658,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0026249",
      "title": "The Crusades",
      "year": 1935,
      "imdbRating": 6.5,
      "imdbVotes": 1332,
      "language": "English, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0013372",
      "title": "Manslaughter",
      "year": 1922,
      "imdbRating": 6.4,
      "imdbVotes": 496,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0010418",
      "title": "Male and Female",
      "year": 1919,
      "imdbRating": 6.9,
      "imdbVotes": 1956,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011909",
      "title": "The Affairs of Anatol",
      "year": 1921,
      "imdbRating": 6.6,
      "imdbVotes": 1346,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016294",
      "title": "The Road to Yesterday",
      "year": 1925,
      "imdbRating": 6.3,
      "imdbVotes": 166,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1441953",
      "title": "Testament of Youth",
      "year": 2014,
      "imdbRating": 7.2,
      "imdbVotes": 31170,
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Moviedome"
    },
    {
      "imdbId": "tt0045473",
      "title": "Admiral Ushakov",
      "year": 1953,
      "imdbRating": 7.3,
      "imdbVotes": 224,
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0060107",
      "title": "Andrei Rublev",
      "year": 1966,
      "imdbRating": 8,
      "imdbVotes": 58379,
      "language": "Russian, Italian, Tatar",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}