{
  "imdbId": "tt0000797",
  "title": "At the Altar",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AtTheAltar",
      "id": "AtTheAltar",
      "title": "\"At the Altar\" (1909) director D. W. Griffith",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"At the Altar\"  is a short crime drama directed by D.W. Griffith.  We have a whole constellation of our stars taking part in this film: Billy Bitzer, Arthur V. Johnson, Robert Harron and Florence Lawrence. This is the third film with a similar theme created by D.W. Griffith in a short period of time. \"An Awful Moment\" (1908) and \"The Cord of Life\" (1909) were released a month or two before it. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer, Arthur Marvin Starring                             Marion Leonard, Charles Inslee, Barry O'Moore, Arthur V. Johnson, Robert Harron, Florence Lawrence Distributed by                   Biograph Company Release date                      February 25, 1909 Country                             United States Running time                    13 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 373697081,
      "addedAt": "2026-01-07T00:06:14.037Z",
      "thumbnail": "https://archive.org/services/img/AtTheAltar",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 12202
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-at-the-altar",
      "id": "silent-at-the-altar",
      "title": "At the Altar",
      "fileSize": 236572481,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-at-the-altar",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 271
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.4,
    "imdbVotes": 177,
    "Genre": "Short, Drama",
    "Plot": "At the Italian boarding house the male boarders were all smitten with the charms of Minnie, the landlady's pretty daughter, but she was of a poetic turn of mind and her soul soared above plebeianism and her aspirations were romantic. Most persistent among her suitors was Grigo, a coarse Sicilian, whose advances were odiously repulsive. The arrival at the boarding house from the old country of Giuseppe Cassella, the violinist, filled the void in her yearning heart. Romantic, poetic and a talented musician, Giuseppe was indeed a desirable husband for Minnie. All this, of course, filled Grigo with bitter hatred and he vows vengeance, which you may be sure he will work with extreme subtlety. All preparations are made for the wedding, and when the day arrives Grigo is ready for it. He has contrived an infernal machine with a pistol so arranged that its explosion means death to anyone standing in front of it. The little church is decorated in honor of the affair and Grigo, with subterfuge, gets the sexton out, leaving the place to himself. Sawing a hole in front of the altar step, he places his weapon in such a position that one step forward by the priest would mean death to the bride kneeling in front. Grigo rushes hack to his room, arriving just as the wedding party is leaving for the church. Here he becomes a victim of the frenzy of his mind, and appreciating the fact that the awful deed will he laid to him and his apprehension will be inevitable, he writes a gloating note and then takes poison. His fall is heard by the housemaid, who, discovering the note, gives it to a policeman, who rushes madly to the church. Fate, however, seems to conspire, and the officer falls, breaking his ankle, just outside the church. A newsboy, seeing his plight, runs up, and the policeman directs him hurriedly to the church, where he arrives just in time to save the couple, who start back at his yell, for the priest had just made the step which fires the gun, but with no harm done. The priest gives thanks to God for their deliverance and proceeds with the wedding.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Marion Leonard, Charles Inslee, Barry O'Moore",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000945",
    "tt0000831",
    "tt0001032",
    "tt0001072",
    "tt0000828",
    "tt0000854",
    "tt0000871",
    "tt0000942",
    "tt0000986",
    "tt0001016",
    "tt0000946",
    "tt0000640"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}