{
  "movieId": "tt0057062",
  "title": "Five Minutes to Love",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FiveMinutestoLove",
      "id": "FiveMinutestoLove",
      "title": "Five Minutes To Love",
      "description": "Ben, Edna and their baby daughter (Will Gregory, Gaye Gordon, Geraldine Leder) are headed to California when their car breaks down. Ben ventures off to the junkyard in search of a spare part to fix his car. Coincidentally, Harry (Paul Leder) the seedy junkyard owner has just been accused by the police of selling stolen auto parts, and claims that he gets his cars from someone else. Ben wanders into the junkyard just in time for Harry to frame him and use him as a scapegoat. When Ben doesn't return after quite a while, Edna goes looking for him. She is then chased around the junkyard by Harry's odd, dim-witted friend Blowhard (King Moody).",
      "fileSize": 1899668510,
      "addedAt": "2026-01-07T00:06:25.399Z",
      "thumbnail": "https://archive.org/services/img/FiveMinutestoLove",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 21900
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 4.4,
    "imdbVotes": 143,
    "Genre": "Drama",
    "Plot": "Ben, Edna, and their baby daughter are headed to California when their car breaks down and Ben ventures off to the junkyard in search of a spare part to fix it. Coincidentally, the police have just accused seedy junkyard owner Harry of selling stolen auto parts, and Harry claims he gets his cars from someone else. Ben wanders into the junkyard just in time for Harry to frame him and use him as a scapegoat. When Ben doesn't return after a long time, Edna goes looking for him and is chased around the junkyard by Harry's odd, dimwitted friend Blowhard.",
    "Director": "John Hayes",
    "Writer": "William W. Norton, Paul Leder",
    "Actors": "Rue McClanahan, King Moody, Will Gregory",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0155166",
    "tt0057415",
    "tt0056810",
    "tt0178515",
    "tt0057207",
    "tt12658952",
    "tt0056656",
    "tt0056937",
    "tt0315164",
    "tt0184086",
    "tt0057565",
    "tt0057225"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}