{
  "movieId": "tt0025468",
  "title": "Many Happy Returns",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/many-happy-returns-1934",
      "id": "many-happy-returns-1934",
      "title": "Many Happy Returns (1934)",
      "description": "George Burns, Gracie Allen, Ray Milland, Johnny Arthur, Franklin Pangborn, Guy Lombardo",
      "fileSize": 1585885617,
      "addedAt": "2026-01-07T00:09:46.427Z",
      "thumbnail": "https://archive.org/services/img/many-happy-returns-1934",
      "collection": "feature_films",
      "downloads": 1163
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "64 min",
    "imdbRating": 6,
    "imdbVotes": 68,
    "Genre": "Comedy, Music",
    "Plot": "Gracie Allen assumes the \"management\" of the shop owned by her papa Horatio Allen, turning it into a radio station and then an aviary, with the usual Gracie Allen logic. While distracted, Papa is trying to get younger daughter, beauty contest winner Florence, married before she can head to Hollywood and get into the movies. The story moves to Hollywood, where, with Gracie around, kidnappers get kidnapped and the chatter between her and George Burns even takes a few satirized shots at Filmland, in addition to their usual unusual routines. Guy Lombardo, top-billed on the ads and posters with Burns and Allen but not the cast listings, and dance team Frank Veloz and Yolanda, fill in where needed between the cracks of the mostly on-the-fly plot, and they don't seem to be taking their gigs all that seriously either. Burns and Allen Radio fans, the few of us that still remember \"radio\", will love it, while others are likely to give it a \"say what\" or \"duh\", especially if they were raised on television comedy of the past twenty years.",
    "Director": "Norman Z. McLeod",
    "Writer": "Lady Mary Cameron, J.P. McEvoy, Claude Binyon",
    "Actors": "George Burns, Gracie Allen, George Barbier",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0024808",
    "tt0025513",
    "tt0025619",
    "tt0026019",
    "tt0135175",
    "tt0025678",
    "tt0029682",
    "tt0279784",
    "tt0025194",
    "tt0026113",
    "tt0032043",
    "tt0022789"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.427Z"
}