{
  "imdbId": "tt0047417",
  "title": "Riot in Cell Block 11",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RiotinCellBlock",
      "id": "RiotinCellBlock",
      "title": "Riot in Cell Block 11",
      "description": "Title: Riot in Cell Block 11 Summary: Fed up with the inhumane prison living conditions, a general prison riot breaks out, leading to hostage-taking, a stand-off with the guards and eventual negotiations with the prison administration officials. Directed by: Don Siegel Actors: Neville Brand, Emile Meyer, Frank Faylen Production Company: Walter Wanger Productions Release Date: 28 February 1954 (USA) Aspect Ratio: 1.66 : 1 Producer Walter Wanger, who had just been released from a prison term after shooting a man he believed was having an affair with his wife, wanted to make a film about the appalling conditions he saw while he was incarcerated. He got together with director Don Siegel and they came up with this film, in which several prison inmates, to protest brutal guards, substandard food, overcrowding and barely livable conditions, stage an uprising, in which most of the inmates join, and take several guards hostage. Negotiations between the inmates and prison officials are stymied, however, by politicians interfering with the prison administration, and by dissension and infighting in the inmates' own ranks.",
      "fileSize": 650991125,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RiotinCellBlock",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 3099
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "80 min",
    "imdbRating": 7,
    "imdbVotes": 2518,
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "Producer, Walter Wanger, who'd just done time (4 mos after shooting a man he believed was having an affair with his wife), wanted to make a film which showed the appalling conditions he saw while incarcerated. Working with Don Siegel, they wrote this film. In protest to the brutal guards, substandard food, overcrowding and poor living conditions, inmates stage an uprising, and take several guards hostage. Negotiations between the inmates and prison officials are stymied by politicians interfering with the prison administration, and by dissension and infighting amongst the inmates.",
    "Director": "Don Siegel",
    "Writer": "Richard Collins",
    "Actors": "Neville Brand, Emile Meyer, Frank Faylen",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 2 BAFTA 3 nominations total"
  },
  "relatedMovies": [
    "tt0047370",
    "tt0051866",
    "tt0049836",
    "tt0047542",
    "tt0046969",
    "tt0046790",
    "tt0046885",
    "tt0046935",
    "tt0047127",
    "tt0047263",
    "tt0047479",
    "tt0047679"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}