{
  "movieId": "tt0024625",
  "title": "A Study in Scarlet",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AStudyInScarlet720p1933",
      "id": "AStudyInScarlet720p1933",
      "title": "A Study in Scarlet",
      "description": "Title: A Study in Scarlet Summary: In London, a secret society led by lawyer Thaddeus Merrydew collects the assets of any of its deceased members and divides them among the remaining members. Society members start dropping ... Directed by: Edwin L. Marin Actors: Production Company: K.B.S. Productions Inc. Release Date: 14 May 1933 (USA) Aspect Ratio: 1.37 : 1 Color: Black and White In London, a secret society led by lawyer Thaddeus Merrydew collects the assets of any of its deceased members and divides them among the remaining members. Society members start dropping like flies. Sherlock Holmes is approached by member James Murphy's widow, who is miffed at being left penniless by her husband. When Captain Pyke is shot, Holmes keys in on his mysterious Chinese widow as well as the shady Merrydew. Other members keep dying--Malcom Dearing first, then Mr. Baker. There is also an attempt on the life of young Eileen Forrester, who became a reluctant society member upon the death of her father. Holmes' uncanny observations and insights are put to the test.",
      "fileSize": 839283529,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/AStudyInScarlet720p1933",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 10574
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-study-in-scarlet-1933",
      "id": "a-study-in-scarlet-1933",
      "title": "A Study in Scarlet (1933)",
      "description": "In London, a secret society led by lawyer Thaddeus Merrydew collects the assets of any of its deceased members and divides them among the remaining members. Society members start dropping like flies. Sherlock Holmes is approached by member James Murphy's widow, who is miffed at being left penniless by her husband. When Captain Pyke is shot, Holmes keys in on his mysterious Chinese widow as well as the shady Merrydew. Other members keep dying: Malcom Dearing first, then Mr. Baker. There is also an attempt on the life of young Eileen Forrester, who became a reluctant society member upon the death of her father. Holmes' uncanny observations and insights are put to the test. Watch on RetroFlix:  https://retroflix.org/a-study-in-scarlet-1933/",
      "fileSize": 922563688,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-study-in-scarlet-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 306
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/A_Study_In_Scarlet",
      "id": "A_Study_In_Scarlet",
      "title": "A Study In Scarlet",
      "description": "From IMDb: In London, a secret society led by lawyer Thaddeus Merrydew collects the assets of any of its deceased members and divides them among the remaining members. Society members start dropping like flies. Sherlock Holmes is approached by member James Murphy's widow, who is miffed at being left penniless by her husband. When Captain Pyke is shot, Holmes keys in on his mysterious Chinese widow as well as the shady Merrydew. Other members keep dying--Malcom Dearing first, then Mr. Baker. There is also an attempt on the life of young Eileen Forrester, who became a reluctant society member upon the death of her father. Holmes' uncanny observations and insights are put to the test.",
      "fileSize": 4206059936,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/A_Study_In_Scarlet",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 94028
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/study_in_scarlet_ipod",
      "id": "study_in_scarlet_ipod",
      "title": "Study in Scarlet",
      "description": "Taken from IMDB : Members of a secret \"trust\" that meets in Limehouse are being murdered; a victim's widow enlists Sherlock Holmes' help.",
      "fileSize": 1691895167,
      "addedAt": "2026-01-07T00:11:35.630Z",
      "thumbnail": "https://archive.org/services/img/study_in_scarlet_ipod",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 55991
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rN6aHyl-fTA",
      "id": "rN6aHyl-fTA",
      "title": "A Study in Scarlet (1933) SHERLOCK HOLMES",
      "description": "Stars: Reginald Owen, Anna May Wong, June Clyde \nDirector: Edwin L. Marin\nWriter: \"Suggested\" by the novel of Sir Arthur Conan Doyle\n\nMembers of a band of jewel thieves are being murdered and their deaths announced by a nursery rhyme. A young widow of one of the crooks calls upon Holmes and Watson to unravel the mystery.",
      "addedAt": "2025-12-26T23:44:47.930Z",
      "thumbnail": "https://i.ytimg.com/vi/rN6aHyl-fTA/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBjAWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCVoam17gUGXvI6HG1_E-VdXBZEEQ",
      "duration": 4277,
      "language": "en",
      "year": 1933,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AFBGPaUAqyI",
      "id": "AFBGPaUAqyI",
      "title": "A Study in Scarlet (1933) | Sherlock Holmes | Mystery, Thriller | Full Length Movie",
      "description": "In London, a secret society led by lawyer Thaddeus Merrydew collects the assets of any of its deceased members and divides them among the remaining members. Society members start dropping like flies. Sherlock Holmes is approached by member James Murphy's widow, who is miffed at being left penniless by her husband.\n\nDirector: Edwin L. Marin\nWriters: Arthur Conan Doyle, Robert Florey\nStars: Reginald Owen, Anna May Wong, June Clyde\nGenre:  Classics, Cult Film, Crime, Mystery, Drama, Thriller\n\n@CultCinemaClassics:\nhttps://linktr.ee/cultcinemaclassics",
      "addedAt": "2025-12-27T00:52:17.037Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/AFBGPaUAqyI/maxresdefault.webp?v=6331eb9e",
      "duration": 4279,
      "language": "en",
      "year": 1933,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "72 min",
    "imdbRating": 5.6,
    "imdbVotes": 1237,
    "Genre": "Horror, Mystery, Thriller",
    "Plot": "In London, a secret society led by lawyer Thaddeus Merrydew collects the assets of any of its deceased members and divides them among the remaining members. Society members start dropping like flies. Sherlock Holmes is approached by member James Murphy's widow, who is miffed at being left penniless by her husband. When Captain Pyke is shot, Holmes keys in on his mysterious Chinese widow as well as the shady Merrydew. Other members keep dying--Malcom Dearing first, then Mr. Baker. There is also an attempt on the life of young Eileen Forrester, who became a reluctant society member upon the death of her father. Holmes' uncanny observations and insights are put to the test.",
    "Director": "Edwin L. Marin",
    "Writer": "Arthur Conan Doyle, Robert Florey, Reginald Owen",
    "Actors": "Reginald Owen, Anna May Wong, June Clyde",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0024382",
    "tt0024368",
    "tt0024631",
    "tt0025014",
    "tt0024904",
    "tt0020534",
    "tt0073582",
    "tt0185371",
    "tt0053719",
    "tt2364774",
    "tt0034985",
    "tt0052602"
  ],
  "collections": [
    {
      "id": "sherlock-holmes",
      "name": "Sherlock Holmes"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.630Z"
}