{
  "movieId": "tt0049729",
  "title": "The Search for Bridey Murphy",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tsfbm09345345",
      "id": "tsfbm09345345",
      "title": "The Search for Bridey Murphy",
      "description": "Title: The Search for Bridey Murphy Summary: After being shown what hypnotism can do, a Doctor sets out to study it in depth. When experimenting on his friend's wife, she regresses back to an earlier life- that of Bridey Murphy. ... Directed by: Noel Langley Actors: Teresa Wright, Louis Hayward, Nancy Gates Production Company: Paramount Pictures Release Date: 1 October 1956 (USA) Aspect Ratio: 1.85 : 1 After being shown what hypnotism can do, a Doctor sets out to study it in depth. When experimenting on his friend's wife, she regresses back to an earlier life- that of Bridey Murphy. Several hypnotic sessions explore the life and death of Murphy, a 19th Century Irish lady who lived in Cork and Belfast from 1798 to 1864. The Doctor then attempts to verify if Bridey Murphy really existed.",
      "fileSize": 601801334,
      "addedAt": "2026-01-07T00:12:55.130Z",
      "thumbnail": "https://archive.org/services/img/tsfbm09345345",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 1711
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": 6,
    "imdbVotes": 244,
    "Genre": "Drama",
    "Plot": "After being shown what hypnotism can do, a doctor starts to study it in depth. When he experiments on a friend's wife, she regresses into an early life--that of Bridey Murphy. Several hypnotic sessions explore the life and death of this 19th-century Irishwoman who lived in Cork and Belfast from 1978 until 1864, and the doctor attempts to verify that Bridey Murphy actually existed.",
    "Director": "Noel Langley",
    "Writer": "Morey Bernstein, Noel Langley",
    "Actors": "Teresa Wright, Louis Hayward, Nancy Gates",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0049783",
    "tt0049397",
    "tt0049871",
    "tt0048967",
    "tt0049291",
    "tt0049340",
    "tt0049406",
    "tt0049904",
    "tt0049955",
    "tt0049854",
    "tt0049769",
    "tt0049636"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.130Z"
}