{
  "imdbId": "tt0024122",
  "title": "His Double Life",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HisDoubleLife",
      "title": "HisDoubleLife",
      "description": "A charming movie and one of the first soundies with great Lillian Gish See details here: http://www.imdb.com/title/tt0024122/ I've used http://www.archive.org/details/his_double_life as a source and did the following: - trimmed it of 1/2 hour of the dead air in the end thus making the original 3Gb file smaller - compressed it using DivX codec thus making it even more small - normalized the sound (which originally was too low for some reason) - created and added Russian subtitles and Russian sountrack (with help of my wife who dubbed female voices) Beware that Russian and English soundtracks are #1 and #2 respectively.",
      "id": "HisDoubleLife"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/his_double_life",
      "title": "His Double Life",
      "id": "his_double_life"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2s7EXbDs6SQ",
      "title": "His Double Life (1933) | Colorized Public Domain Classic Comedy Drama with Roland Young",
      "description": "His Double Life (1933) is an American pre-Code comedy-drama directed by Arthur Hopkins and William C. deMille. Based on the novel Buried Caesars and play The Great Adventure by Arnold Bennett, the film blends satire, mistaken identity, and social commentary with the stylish charm of early 1930s cinema. This restored and colorized edition breathes new life into a film that highlights both the humor and melancholy of a man trapped between fame and anonymity.\n\nPlot Summary:\nRoland Young stars as Priam Farrel, a reclusive but world-renowned artist whose paintings command high prices and international acclaim. Despite his fame, Farrel despises public attention and craves a quiet, ordinary life. When his loyal valet Henry Leek suddenly dies, Farrel sees an unexpected opportunity: he assumes Leek’s identity and allows the world to believe that “Priam Farrel” has passed away.\n\nHowever, living as an anonymous man proves more complicated than he expected. Farrel — now “Leek” — finds himself entangled in a new life that includes a romantic relationship with Alice Chalice (Lillian Gish), a widow who had corresponded with the real Leek. As love blossoms, Farrel must balance his desire for normalcy with the mounting pressures of his false identity. Trouble escalates when legal disputes over Farrel’s estate and fortune draw unwanted scrutiny, threatening to expose the truth.\n\nThe story explores the comic ironies and poignant struggles of identity, reputation, and the cost of escape. The film’s sharp wit is matched by moments of emotional depth, particularly in the unlikely romance between Farrel and Alice, which gives the narrative its heart.\n\nCast and Crew:\n• Directors: Arthur Hopkins, William C. deMille\n• Producer: Jesse L. Lasky\n• Based on: Buried Caesars (novel) and The Great Adventure (play) by Arnold Bennett\n• Screenplay: Clara Beranger\n• Cinematography: Charles Rosher\n• Editing: Edward Curtiss\n\nStarring:\n• Roland Young as Priam Farrel / Henry Leek\n• Lillian Gish as Alice Chalice\n• Montagu Love as Oxford\n• Lucille La Verne as Lady Vale\n• Henry Stephenson as Duncan Farrel\n• Olaf Hytten as Henry Leek (deceased valet)\n\nFilm Significance:\nHis Double Life represents the transitional years of Hollywood between the silent era and the enforcement of the Production Code in 1934. It also showcases the understated charm of Roland Young, who would later become widely recognized for his role as Cosmo Topper in the Topper comedy series. Lillian Gish, one of silent cinema’s most enduring stars, brings grace and humanity to the role of Alice Chalice, further grounding the film’s emotional resonance.\n\nWhile not as famous as Gish’s silent masterpieces or Hollywood’s major studio releases, His Double Life offers a unique snapshot of early 1930s humor, romance, and character-driven storytelling. Its themes of identity and the burden of fame remain relevant even to modern audiences, making it a valuable rediscovery for fans of classic film.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like His Double Life remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1933 release was shot in black and white, standard for the era. While authentic to its time, black-and-white presentation often discourages modern audiences. By offering a colorized version, we maintain the film’s original artistic integrity while adapting it for contemporary viewing habits, especially for audiences in the United States and Europe who engage more readily with color storytelling. This edition provides a fresh way to experience Roland Young and Lillian Gish in a film that balances humor, romance, and social critique.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema — comedies, dramas, mysteries, westerns, and more. Our mission is to preserve and revive forgotten treasures for audiences in the USA, Europe, and worldwide.\n\n#HisDoubleLife #RolandYoung #LillianGish #1930sMovies #PublicDomainFilm #ColorizedClassic #ClassicComedyDrama #PreCodeHollywood #FilmRestoration #GoldenAgeCinema",
      "id": "2s7EXbDs6SQ",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MZ6d3P7Mqfs",
      "title": "His Double Life (1933) ROLAND YOUNG, LILLIAN GISH",
      "description": "Stars: Roland Young, Lillian Gish, Montagu Love\n Director: Arthur Hopkins\n\n Priam Farrel is a celebrated artist but a social recluse. When his valet dies of a sudden illness, a mix-up leads to the body being identified as Farrel's. The timid artist then assumes the identity of his former servant, but finds himself faced with constant dilemmas as a result.",
      "id": "MZ6d3P7Mqfs",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "68 min",
    "imdbRating": "6.4",
    "imdbVotes": "389",
    "Genre": "Comedy, Drama",
    "Plot": "Priam Farrel is a celebrated artist but a social recluse. When his valet dies of a sudden illness, a mix-up leads to the body being identified as Farrel's. The timid artist then assumes the identity of his former servant, but finds himself faced with constant dilemmas as a result.",
    "Director": "Arthur Hopkins",
    "Writer": "Arnold Bennett, Clara Beranger, Arthur Hopkins",
    "Actors": "Roland Young, Lillian Gish, Montagu Love",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0023845",
      "title": "Britannia of Billingsgate",
      "year": 1933,
      "imdbRating": "5.6",
      "imdbVotes": "77",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023955",
      "title": "Doctor Bull",
      "year": 1933,
      "imdbRating": "6.4",
      "imdbVotes": "721",
      "language": "Italian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024037",
      "title": "Friday the Thirteenth",
      "year": 1933,
      "imdbRating": "6.6",
      "imdbVotes": "392",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024421",
      "title": "Our Betters",
      "year": 1933,
      "imdbRating": "6.1",
      "imdbVotes": "850",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024436",
      "title": "Perfect Understanding",
      "year": 1933,
      "imdbRating": "5.6",
      "imdbVotes": "772",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024679",
      "title": "Tomorrow at Seven",
      "year": 1933,
      "imdbRating": "5.6",
      "imdbVotes": "393",
      "language": "English, American Sign ",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023896",
      "title": "Clear All Wires!",
      "year": 1933,
      "imdbRating": "6.0",
      "imdbVotes": "185",
      "language": "French, Russian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024083",
      "title": "Hallelujah I'm a Bum",
      "year": 1933,
      "imdbRating": "6.9",
      "imdbVotes": "858",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024159",
      "title": "I Loved You Wednesday",
      "year": 1933,
      "imdbRating": "5.5",
      "imdbVotes": "63",
      "language": "French, English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024240",
      "title": "Lady for a Day",
      "year": 1933,
      "imdbRating": "7.4",
      "imdbVotes": "4,946",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024548",
      "title": "She Done Him Wrong",
      "year": 1933,
      "imdbRating": "6.3",
      "imdbVotes": "7,252",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024610",
      "title": "State Fair",
      "year": 1933,
      "imdbRating": "6.7",
      "imdbVotes": "1,151",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:41:13.176Z"
}