{
  "imdbId": "tt0000878",
  "title": "The Gibson Goddess",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGibsonGoddess",
      "id": "TheGibsonGoddess",
      "title": "The Gibson Goddess",
      "description": "The Gibson Goddess was directed by D W Griffith in 1909. It is one of Griffith's few ventures into comedy with mixed results. The Gibson Girl was a very popular image at the time. Here, from IMDB is an anonymous description of the film. \"A pack of admirers won't leave a beautiful woman alone at a seaside resort, so she devises a plan. She appears in a leg-revealing swimsuit, but the stockings have been stuffed with cotton to make her limbs appear misshapen. All but one of the men is driven off, and regret it when she removes the misleading leggings.\" Because it is a comedy, I have taken liberties with the music on this one.",
      "fileSize": 176512720,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGibsonGoddess",
      "collection": "feature_films",
      "downloads": 1922
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGibsonGoddess1909",
      "id": "TheGibsonGoddess1909",
      "title": "\"The Gibson Goddess\" (1909) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"The Gibson Goddess\" is a short comedy directed by D. W. Griffith. This film illustrates the work of Arthur V. Johnson and Billy Bitzer, stars of Silent Hall of Fame. An attractive woman causes havoc at a beach resort when all mashers go wild. Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          D.W. Griffith Cinematography                G.W. Bitzer Starring                                Marion Leonard, Arthur V. Johnson, Mack Sennett, James Kirkwood Distributed by                     Biograph Company Release date                         November 1, 1909 Running time                       7 min. Country                                United States Language                              Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 89971835,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGibsonGoddess1909",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 1679
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.1,
    "imdbVotes": 182,
    "Genre": "Comedy, Short",
    "Plot": "A pack of admirers won't leave a beautiful woman alone at a seaside resort, so she devises a plan. She appears in a leg-revealing swimsuit, but the stockings have been stuffed with cotton to make her limbs appear misshapen. All but one of the men is driven off, and regret it when she removes the misleading leggings.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Marion Leonard, Anthony O'Sullivan, George Nichols",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001002",
    "tt0000946",
    "tt0000841",
    "tt0001062",
    "tt0000877",
    "tt0000892",
    "tt0000800",
    "tt0000922",
    "tt0000938",
    "tt0001000",
    "tt0000653",
    "tt0000641"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}