{
  "imdbId": "tt0023245",
  "title": "The Mummy",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-mummy_202105",
      "id": "the-mummy_202105",
      "title": "The Mummy (1932)",
      "description": "A team of British archaeologists led by Sir Joseph Whemple (Arthur Byron) discover the mummified remains of the ancient Egyptian prince Imhotep (Boris Karloff), along with the legendary scroll of Thoth. When one of the archaeologists recites the scroll aloud, Imhotep returns to life, but escapes. Several years later, Imhotep has taken on the guise of a wealthy man, as he searches Egypt for his lost love, who he believes has been reincarnated as the lovely Helen Grosvenor (Zita Johann).",
      "fileSize": 6012220495,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-mummy_202105",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 54131
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-mummy.-1932",
      "id": "the.-mummy.-1932",
      "title": "The Mummy (1932)",
      "description": "The Mummy is a 1932 American pre-Code supernatural horror film directed by Karl Freund, and starring Boris Karloff, Zita Johann, David Manners, Edward Van Sloan, and Arthur Byron. In te film,  an archaeological team led by Sir Joseph Whemple discovers the mummified remains of Imhotep, an ancient Egyptian priest. After accidentally reading a magical scroll, Imhotep is resurrected and seeks to reunite with the reincarnation of his lost love, Helen Grosvenor, leading to a tale of love, curses, and supernatural horror.",
      "fileSize": 602003957,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-mummy.-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 278
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "73 min",
    "imdbRating": 6.9,
    "imdbVotes": 32775,
    "Genre": "Fantasy, Horror",
    "Plot": "In 1921 a field expedition in Egypt discovers the mummy of ancient Egyptian prince Im-Ho-Tep, who was condemned and buried alive for sacrilege. Also found in the tomb is the Scroll of Thoth, which can bring the dead back to life. One night a young member of the expedition reads the Scroll out loud, and then goes insane, realizing that he has brought Im-Ho-Tep back to life. Ten years later, disguised as a modern Egyptian, the mummy attempts to reunite with his lost love, an ancient princess who has been reincarnated into a beautiful young woman.",
    "Director": "Karl Freund",
    "Writer": "Nina Wilcox Putnam, Richard Schayer, John L. Balderston",
    "Actors": "Boris Karloff, Zita Johann, David Manners",
    "Language": "English, Arabic, French, Egyptian (Ancient)",
    "Country": "United States",
    "Awards": "1 win & 4 nominations total"
  },
  "relatedMovies": [
    "tt0021814",
    "tt0023649",
    "tt0026663",
    "tt0024894",
    "tt0022663",
    "tt0020530",
    "tt0024055",
    "tt0018770",
    "tt0016039",
    "tt0001223",
    "tt2784936",
    "tt14292086"
  ],
  "collections": [
    {
      "id": "1930s",
      "name": "1930s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}