{
  "imdbId": "tt0040626",
  "title": "My Dear Secretary",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MyDearSecretary",
      "id": "MyDearSecretary",
      "title": "My Dear Secretary",
      "description": "IMDb Page",
      "fileSize": 927818035,
      "addedAt": "2026-01-07T00:06:38.753Z",
      "thumbnail": "https://archive.org/services/img/MyDearSecretary",
      "language": "English",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 2389
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dear-secretary-4-k",
      "id": "dear-secretary-4-k",
      "title": "My Dear Secretary (1948) [Colorized, 4K, 60FPS]",
      "description": "My Dear Secretary is a 1948 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 6799344079,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/dear-secretary-4-k",
      "collection": "feature_films",
      "downloads": 301
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-dear-secretary-1948",
      "id": "my-dear-secretary-1948",
      "title": "My Dear Secretary (1948)",
      "description": "A budding young writer thinks it's her lucky day when she is chosen to be the new secretary for Owen Waterbury, famous novelist. She is soon disppointed, however, when he turns out to be an erratic, immature playboy. Opposites attract, of course, but not without sub-plots that touch on competitiveness within marriage and responsibility. Watch on RetroFlix:  https://retroflix.org/my-dear-secretary-1948/",
      "fileSize": 907357706,
      "addedAt": "2026-01-07T00:09:54.333Z",
      "thumbnail": "https://archive.org/services/img/my-dear-secretary-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 231
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my_dear_secretary",
      "id": "my_dear_secretary",
      "title": "My Dear Secretary",
      "description": "Would-be writer Laraine Day takes a job as secretary to best-seller Kirk Douglas. You can find more information regarding this film on its IMDb page .",
      "fileSize": 5365834764,
      "addedAt": "2026-01-07T00:09:54.334Z",
      "thumbnail": "https://archive.org/services/img/my_dear_secretary",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 147268
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mydearsecretary1948kirkdouglas",
      "id": "mydearsecretary1948kirkdouglas",
      "title": "My Dear Secretary (1948) KIRK DOUGLAS",
      "description": "A romance novelist recruits an aspiring writer as his latest of many secretaries.",
      "fileSize": 455948397,
      "addedAt": "2026-01-07T00:09:54.334Z",
      "thumbnail": "https://archive.org/services/img/mydearsecretary1948kirkdouglas",
      "collection": "feature_films",
      "downloads": 6585
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LcKnxpe7maY",
      "id": "LcKnxpe7maY",
      "title": "My Dear Secretary (1948) | Colorized Public Domain Romantic Comedy | Laraine Day and Kirk Douglas",
      "description": "My Dear Secretary (1948) is an American romantic comedy directed by Charles Martin and starring Laraine Day and Kirk Douglas in one of his earliest leading roles. This restored and colorized public domain film revives a charming yet overlooked comedy that blends romance, wit, and Hollywood satire. Originally released in the late 1940s, the movie reflects post-war America’s fascination with both the glamour and absurdities of the writing profession. By presenting this rare gem in full color, modern audiences can experience the sharp banter and playful humor in a more vibrant and accessible way.\n\nPlot Summary:\nThe story centers on Owen Waterbury (Kirk Douglas), a successful novelist with a notorious reputation as a playboy and womanizer. In need of an assistant, he hires aspiring writer Stephanie Gaylord (Laraine Day) as his secretary. Initially charmed by Owen’s celebrity status, Stephanie quickly realizes that working for him is no ordinary office job. She must endure his constant flirtations, disorganization, and eccentric lifestyle. Despite his arrogance, Stephanie begins to see beyond Owen’s faults and discovers his genuine talent as a writer. Their relationship evolves from tension and comedic misunderstandings to romance, but not without numerous obstacles along the way. This lighthearted story combines screwball comedy tropes with a playful look at love, ambition, and the chaotic world of literary stardom.\n\nCast and Crew:\n• Director: Charles Martin\n• Producer: John Beck\n• Screenplay: Charles Martin\n• Cinematography: Henry Sharp\n• Editing: Harry Marker\n\nStarring:\n• Laraine Day as Stephanie Gaylord\n• Kirk Douglas as Owen Waterbury\n• Keenan Wynn as Ronnie Hastings\n• Helen Walker as Elsie\n• Rudy Vallée as Charles Harris\n• Florence Bates as Ethel Harris\n• Grady Sutton as Earl\n\nFilm Significance:\nMy Dear Secretary stands out as one of Kirk Douglas’s earliest leading performances, released just after his breakthrough role in Out of the Past (1947). Unlike his later dramatic roles, Douglas here displays comedic timing and a lighter screen presence. Laraine Day, already well-known from films like Mr. Lucky (1943), brings charm and sharp wit to her role. The film offers an amusing look at post-war Hollywood culture and the stereotypes surrounding creative professionals. Though it was a modest production and not a major studio release, the movie has gained renewed interest as a snapshot of late-1940s romantic comedy traditions. Its entry into the public domain has ensured that it remains accessible to modern viewers.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like My Dear Secretary remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1948 release was black and white, typical for romantic comedies of its era. While historically authentic, many modern audiences are less inclined to watch black-and-white cinema. By colorizing this film, the stylish costumes, Hollywood settings, and expressive performances gain new life. This edition highlights the early career of Kirk Douglas and showcases Laraine Day’s strength as a leading lady in a witty, fast-paced comedy. For fans of classic romance and screwball humor, this colorized restoration makes the film feel both nostalgic and fresh.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#MyDearSecretary #KirkDouglas #LaraineDay #1940sRomanticComedy #PublicDomainMovie #ColorizedClassic #ClassicCinema #FilmRestoration #GoldenAgeHollywood #1948Movies #RomanticComedyClassic",
      "addedAt": "2025-12-24T00:48:51.644Z",
      "thumbnail": "https://i.ytimg.com/vi/LcKnxpe7maY/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYYiBiKGIwDw==&rs=AOn4CLBmO0VVC47RAoKghcb319tXn76Yaw",
      "duration": 5614,
      "language": "en",
      "year": 1948,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=No9ISTMtDRM",
      "id": "No9ISTMtDRM",
      "title": "My Dear Secretary (1948) KIRK DOUGLAS",
      "description": "Stars: Kirk Douglas, Laraine Day, Keenan Wynn \nWriter/Director: Charles Martin\n\nA romance novelist recruits an aspiring writer as his latest of many secretaries. Watch for a young Irene Ryan - Granny from The Beverly Hillbillies!",
      "addedAt": "2025-12-26T23:45:22.644Z",
      "thumbnail": "https://i.ytimg.com/vi/No9ISTMtDRM/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBjAWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDIWrJTbQIjhBbJTwG-i_CpfxjVkQ",
      "duration": 5674,
      "language": "en",
      "year": 1948,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "94 min",
    "imdbRating": 5.7,
    "imdbVotes": 1215,
    "Genre": "Comedy, Romance",
    "Plot": "Owen Waterbury, bestselling novelist, recruits aspiring writer Stephanie 'Steve' Gaylord as his latest of many secretaries. The stars in her eyes fade when she finds she is to work in his apartment, with a constant parade of eccentric visitors and slapstick provided by klutzy roommate Ronnie. Moreover, Waterbury's idea of work looks a lot like play, his interest less in books than in blondes. She leaves; to get her back, he swallows his playboy principles and marries her. Can the leopard change his spots? Can Stephanie turn the tables?",
    "Director": "Charles Martin",
    "Writer": "Charles Martin",
    "Actors": "Laraine Day, Kirk Douglas, Keenan Wynn",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040762",
    "tt0040395",
    "tt0040551",
    "tt0040535",
    "tt0040868",
    "tt0040870",
    "tt0040474",
    "tt0040553",
    "tt0040919",
    "tt0041089",
    "tt0039219",
    "tt0039370"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.334Z"
}