{
  "imdbId": "tt0017128",
  "title": "Mother",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mother-1926-v-1",
      "id": "mother-1926-v-1",
      "title": "Mother (1926)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. This Soviet drama follows a mother whose son starts to become wrapped up in revolutionary fervor. Her son is a beacon of light in her life, and the more tragedy that she sees in her day-to-day, the more that she starts to become radicalized herself. Modern viewers appreciate that the story follows one woman, rather than an entire movement, and feel the acting is very well done.  I've uploaded two versions with different soundtracks as well as runtimes due to framerate. They both have similar quality, however, so I feel that the superior version likely comes down to a matter of preference. ",
      "fileSize": 3292725170,
      "addedAt": "2026-01-07T00:09:54.330Z",
      "thumbnail": "https://archive.org/services/img/mother-1926-v-1",
      "language": "eng",
      "year": 1926,
      "collection": "feature_films",
      "downloads": 68
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "89 min",
    "imdbRating": 7.4,
    "imdbVotes": 3122,
    "Genre": "Drama",
    "Plot": "Russian director Vsevolod I. Pudovkin's \"Mother\" is the chronicle of an individual's transformation from political naivete to Marxist awareness set during the 1905 Russian Revolution. Pudovkin uses innovative montage techniques and camera angles to tell this bold story of national unrest through the eyes of a working class woman.",
    "Director": "Vsevolod Pudovkin",
    "Writer": "Maxim Gorky, Nathan Zarkhi",
    "Actors": "Vera Baranovskaya, Nikolay Batalov, Aleksandr Chistyakov",
    "Language": "None",
    "Country": "Soviet Union",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019286",
    "tt0018505",
    "tt0017463",
    "tt0017014",
    "tt0017100",
    "tt0017226",
    "tt0317876",
    "tt0017457",
    "tt0337476",
    "tt0017048",
    "tt0016847",
    "tt0015883"
  ],
  "collections": [
    {
      "id": "1920s",
      "name": "1920s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.330Z"
}