{
  "movieId": "tt0030763",
  "title": "Slander House",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/slander-house-1938",
      "id": "slander-house-1938",
      "title": "Slander House (1938)",
      "description": "Owner of salon catering to fat society dames must deal with a dull fiance, a romantic stranger, the jealous blond who loves him, and the lecherous husband of a client. Watch on RetroFlix:  https://retroflix.org/slander-house-1938/",
      "fileSize": 410215656,
      "addedAt": "2026-01-07T00:11:24.929Z",
      "thumbnail": "https://archive.org/services/img/slander-house-1938",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 50
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/slander_house",
      "id": "slander_house",
      "title": "Slander House",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 4104405145,
      "addedAt": "2026-01-07T00:11:24.929Z",
      "thumbnail": "https://archive.org/services/img/slander_house",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 51884
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_8-kXeHunG0",
      "id": "_8-kXeHunG0",
      "title": "Slander House (1938) ROMANCE",
      "description": "Stars: Adrienne Ames, Craig Reynolds, Esther Ralston \nDirector: Charles Lamont\n\nThe Owner of a swank beauty salon must contend with a dull fiance, a romantic stranger, the jealous blond who loves him, and the lecherous husband of a client.",
      "addedAt": "2025-12-26T23:53:28.213Z",
      "thumbnail": "https://i.ytimg.com/vi/_8-kXeHunG0/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLA_05_KUgV3TNgU_Q2PusiQc7-vYA",
      "duration": 3936,
      "language": "en",
      "year": 1938,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "65 min",
    "imdbRating": 5.3,
    "imdbVotes": 86,
    "Genre": "Adventure, Crime, Drama",
    "Plot": "Madame Helene Smith operates a swanky salon for renovations of women's faces and bodies, with her partner Mazie Mason who grew up with Helene on New York's not-so-swank Tenth Avenue. Mazie is in love with newspaper columnist Terry Kent, who frequents the place for juicy items as the salon is a gathering place for the town's rich and near-rich ladies. Terry calls it a \"scandal house\" and, if he had known the title would be changed to \"Slander House\" before release, would have deemed it as such. Upper-crust Doctor Herbert Stallings, with mandatory pencil mustache, is in love with Helene, who isn't all that taken with him. Enter Ruth DeMilo, statuesque showgirl and gold-digger de luxe, quickly followed by Pat Fenton, dashing young man-about-town, who sees and quickly falls in love with Helene, despite the fact she uses Madame as a title. He takes her to a cabaret where she is insulted by Fenton's attorney, George Horton, who tells her that Fenton, the cad, has hired him to check her background. Fenton decks Horton in the ensuing brawl, and Helene, mortified and somewhat hacked, exits alone. Mazie makes Terry keep the brawl story out of his paper, but the other papers use the story and the fact that Horton was involved. Mrs. Horton, an obese middle-aged woman who has let herself go to pot over the years and has been trying to regain a measure of her former looks and figure at Helene's salon, is furious over the news, especially the news that Ruth DeMilo was also involved. Helene placates her by saying the Fenton is engaged to Miss DeMilo, and that her husband was merely keeping a business appointment, although in reality DeMilo is Horton's on-the-side sweetie. Still miffed at Pat, Helene accepts Dr. Stallings' always-standing offer to become engaged. In trying to avoid Fenton, whom she really loves, Helene inadvertently jumps in Horton's car, who, evidently always in the market for on-the-side sweeties, tries to make love to her, and there is a car wreck, with both Horton and Helene escaping uninjured. This second escapade involving Helene and her husband makes Mrs. Horton convinced that the two are having an affair and, in utter despair (it says here), she tries to commit suicide by gulping down a bottle of hair dye. Dr. Stallings pronounces her condition grave, and Pat,urged by Helene, brings her husband to her bedside, where a tender reconciliation between the ever-ready Horton and his stand-by-her-man wife takes place.",
    "Director": "Charles Lamont",
    "Writer": "Madeline Woods, John W. Krafft, Gertrude Orr",
    "Actors": "Adrienne Ames, Craig Reynolds, Esther Ralston",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029994",
    "tt0029745",
    "tt0027406",
    "tt0027501",
    "tt0027348",
    "tt0027863",
    "tt0030037",
    "tt0030473",
    "tt0030322",
    "tt0026412",
    "tt0031505",
    "tt0031680"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.929Z"
}