{
  "movieId": "tt0056938",
  "title": "Clémentine chérie",
  "year": 1964,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x8z18_yP_yw",
      "id": "x8z18_yP_yw",
      "title": "Clémentine Chérie (1964) Adrienne Servanti, France Anglade | French Comedy | Full Movie",
      "description": "A sensational discovery is made in the laboratory of a textile house: the elastic fabric. Which is used to manufacture new modern stretchable bathing suits, which are later found to also be permeable to the rays of the sun. Clementine, enters the beauty pageant to represent France for the swimsuit launch. But scandal ensues when the public discover, this new revolutionary material is completely invisible on photographs and live television.  A frivolous comedy that is characteristic of French cinema from the 50s and the early 60s.\n\nOriginal title: Clémentine Chérie (1964)\n\nThis film has French audio, and is subtitled in many languages\n\nDirector: Pierre Chevalier\nWriter: Jean Bellus\nCast: Adrienne Servanti, France Anglade, Philippe Noiret, Pierre Doris, Jean Richard\nGenres: French cinema, Classics, Comedy\n\n\n00:00 Full Movie (with subtitles)\n02:26 A French film involving a mix-up at a department store leading to humorous situations and misunderstandings.\n13:13 A series of comical events unfold in a laboratory due to a revolutionary invention involving a mysterious substance.\n27:27 A party with unexpected encounters and discussions about a secret formula.\n36:56 A comedic French film involving a mix-up and romantic entanglements among characters.\n44:00 Misunderstandings, dancing, driving lessons, and a sealed envelope.\n51:11 Event planning for an international beauty contest with a famous neighbor's help.\n55:48 A comedic French film involving a beauty pageant, misunderstandings, and espionage.\n1:04:50 International beauty pageant featuring contestants from various countries with a comedic twist.\n1:08:20 Beauty pageant results announced with comedic mishaps and technical difficulties.\n1:13:51 Comedic chaos ensues as a photo shoot for swimsuits goes awry, leading to confusion and hilarity.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:44:51.469Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/x8z18_yP_yw/maxresdefault.webp?v=63552241",
      "duration": 4776,
      "language": "en",
      "year": 1964,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 4.6,
    "imdbVotes": 52,
    "Genre": "Comedy",
    "Plot": "Based on a cartoon which was published in magazines ,this \"Clementine Chérie \" hits rock bottom,as far as French comedies are concerned . A false good idea :\" a man invents bathing suits the fabric of which is very special: women can get a tan even if they wear it;nevertheless,there is a big problem : the film is not exposed (by the magic fabric) ;so how funny it is,the women appear in their birthday's suit on the photographs and when they are filmed live on TV ,much to the viewers' surprise (and joy).With smart screenwriters and a decent director ,it could have been a hilarious comedy ,considering the talent of some of the actors involved (Philippe Noiret,Jean Tissier ,Jacques Dufilho,Michel Serrault )but the gags are heavy-handed ,the script is incoherent and the aforementioned thespians are left to their own devices :which is particularly atrocious for the poor Dufilho ,cast (you read well)as the Spanish maid -it was chic ,in the sixties ,for the bourgeois family to hire a Spanish domestic!- .Michel Serrault is cast as the bailiff ,coming to \"record that the women do get their tan under their bathing suit \".France Anglade ,the female star ,got lost in mediocrities and her career suffered accordingly ;this part may (or may not) help her get the part of \"Caroline Chérie\" ,the doomed remake of Richard Pottier's pleasant movie.Italian pop singer Rita Pavone -who made a short breakthrough in the early sixties in France- gets the guests twisting.",
    "Director": "Pierre Chevalier",
    "Writer": "Jean Bellus, Michel Fermaud, Jean-José Richer",
    "Actors": "Pierre Doris, Adrienne Servantie, France Anglade",
    "Language": "French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0058037",
    "tt0058022",
    "tt0381923",
    "tt0057055",
    "tt0058548",
    "tt0058605",
    "tt0057156",
    "tt0188479",
    "tt0057918",
    "tt0178339",
    "tt0198394",
    "tt0299763"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:51:05.520Z"
}