{
  "movieId": "tt0065179",
  "title": "Life Love Death",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LifeLoveDeath",
      "id": "LifeLoveDeath",
      "title": "Life Love Death",
      "description": "Life Love Death",
      "fileSize": 28916030,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LifeLoveDeath",
      "collection": "feature_films",
      "downloads": 1510
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "115 min",
    "imdbRating": 7,
    "imdbVotes": 161,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "\"Life, Love, Death\" was made before the abolition of capital punishment in France. Its central message is the inhumanity of the guillotine. The film, which is shot somewhat in a cinema verite style, divides roughly into three acts. In Act One, there is a series of murders of prostitutes in Paris. An obviously deeply disturbed man is hiring these prostitutes and then strangling them. Suspicion falls on François (Amidou), a married man with a child. The police put him under surveillance. (Viewers will recognize the inspector in charge of the team as Marcel Bozzuffi, who would play Popeye Doyle's nemesis in The French Connection a couple of years later.) Ironically, François is experiencing spiritual healing and renewal through the power of love---not with his wife, of course, this being a French film, but through an affair with a beautiful young woman he has met (not a prostitute). But just as this is happening and François seems to have lost the need to commit violent crimes, he is arrested. Act Two is the arraignment, trial and exposition of François's life and history. His recent transformation, of course, makes no impression on the court, and he is sentenced to death by guillotine. Act Three is a documentary-style record of François's last days in prison and his execution. The last scene in the film is an image of the guillotine's blade beginning its descent; it slows and freezes and there is a fade to black, as a voiceover issues a passionate plea for abolition of the guillotine.",
    "Director": "Claude Lelouch",
    "Writer": "Claude Lelouch, Claude Pinoteau, Pierre Uytterhoeven",
    "Actors": "Amidou, Caroline Cellier, Janine Magnan",
    "Language": "French",
    "Country": "France, Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0248088",
    "tt0064448",
    "tt0067835",
    "tt0067045",
    "tt0062038",
    "tt0068174",
    "tt0067670",
    "tt0069439",
    "tt0070578",
    "tt0059909",
    "tt0038494",
    "tt0028231"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.750Z"
}