{
  "imdbId": "tt0041503",
  "title": "Impact",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/impact",
      "title": "Impact",
      "description": "\"Wealthy businessman survives attempt by wife to have him killed, makes it look like she succeeded and starts a new life in small town as auto mechanic. Variation on idea elevated to noir importance by The Killers (1946), where victim of femme fatale tries to abandon the city and his past identity.\" - noir expert Spencer Selby",
      "id": "impact"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Impact720p",
      "title": "Impact",
      "description": "Title: Impact Summary: A unfaithful wife plots with her lover to kill her husband, but the lover is accidentally killed instead. The husband stays in hiding, and lets his wife be charged with conspiracy. Directed by: Arthur Lubin Actors: Brian Donlevy, Ella Raines, Charles Coburn Production Company: Harry Popkin Productions Release Date: 1 April 1949 (USA) Aspect Ratio: 1.37 : 1 In San Francisco, the successful self-made businessman Walter Williams has just bought three factories in Denver with the approval of the board of directors. His beloved wife Irene tells him that she is not feeling well enough to travel with him, and asks Walter to give a lift to her cousin Jim Torrance. On the highway, Jim, who is actually Irene's lover, tries to kill Walter hitting his head and throwing him off a cliff, and has a fatal fiery accident while escaping driving Walter's car. Walter is believed to be the driver and later his wife is sent to jail accused of plotting his murder. Meanwhile, the wounded Walter falls asleep in a moving van and eventually winds up in Larkspur, a small town in Idaho. He is hired as a mechanic in a gas station by the owner, Marsha Peters. For three months, Walter reads the news, expecting revenge with Irene sentenced to death, and he and Marsha fall in love for each other. When Walter discloses the truth to Marsha, she convinces him to return to ...",
      "id": "Impact720p"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Impact_1949",
      "title": "Impact",
      "description": "Brian Donlevy plays a hard-driving corporate executive whose death is plotted by his young wife and her lover.",
      "id": "Impact_1949"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/impact-1949",
      "title": "Impact (1949)",
      "description": "After surviving a murder attempt, an auto magnate goes into hiding so his wife can pay for the crime. Watch on RetroFlix:  https://retroflix.org/impact-1949/",
      "id": "impact-1949"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/impact_201710",
      "title": "Impact",
      "description": "A declared-dead man (Brian Donlevy) hides out with a widow (Ella Raines) after his wife and her lover botch his murder.",
      "id": "impact_201710"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MEbKETNmc4s",
      "title": "Impact (1949) | Colorized Public Domain Film Noir Classic with Brian Donlevy and Ella Raines",
      "description": "Impact (1949) is an American film noir directed by Arthur Lubin that blends crime, suspense, and psychological drama. This restored and colorized edition of the public domain classic reintroduces audiences to one of the most overlooked noirs of the late 1940s. With its tale of betrayal, attempted murder, and redemption, the film offers both gripping entertainment and a cultural snapshot of postwar America. By presenting this forgotten gem in vibrant color, Colorized Public Domain makes the story more immersive for today’s audiences in the United States, Europe, and beyond.\n\nPlot Summary:\nThe film follows Walter Williams (Brian Donlevy), a wealthy and respected San Francisco industrialist. Seemingly secure in both career and marriage, his life is shattered when his wife Irene (Helen Walker) plots his murder. She persuades her lover, Jim Torrence (Tony Barrett), to kill Walter during a supposed road trip. However, the plan backfires — Walter survives a brutal attack and car accident while Torrence is killed in the crash. Believed dead, Walter disappears into a small Idaho town where he starts a new life under an assumed identity.\n\nWhile recovering, he meets Marsha Peters (Ella Raines), a compassionate woman who gives him hope and teaches him the value of ordinary life. But when Walter eventually returns to San Francisco, he discovers that his wife is alive, has accused him of murder, and is using the law against him. The final act becomes a battle not only for justice, but for Walter’s redemption, dignity, and the possibility of a second chance.\n\nCast and Crew:\n• Director: Arthur Lubin\n• Producer: Harry Popkin\n• Screenplay: Jay Dratler, Dorothy Davenport (story contribution)\n• Cinematography: Ernest Laszlo\n• Music: Frank Skinner\n\nStarring:\n• Brian Donlevy as Walter Williams\n• Ella Raines as Marsha Peters\n• Helen Walker as Irene Williams\n• Charles Coburn as Lt. Quincy\n• Anna May Wong as Su Lin\n• Tony Barrett as Jim Torrence\n• Clarence Kolb as Capt. Callahan\n• Tom Greenway as Guthrie\n\nFilm Significance:\nImpact represents the classic noir themes of betrayal, identity crisis, and moral ambiguity. Its semi-rural setting and courtroom drama elements distinguish it from typical urban-set noirs. Notably, the film features Ella Raines, a noir icon known for her roles in Phantom Lady (1944) and The Suspect (1944). The inclusion of Asian American actress Anna May Wong, though brief, highlights one of her later screen appearances before her death in 1961. The film stands as an example of postwar anxieties where personal security, domestic betrayal, and corruption were constant cinematic themes.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Impact remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1949 release was filmed in black and white, a defining feature of film noir aesthetics. While historically authentic, modern audiences often skip past black-and-white films. By offering a colorized edition, this release bridges the gap between historical preservation and contemporary entertainment habits, making the suspense, drama, and moral weight of the story resonate more strongly today.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including noir thrillers, crime dramas, and forgotten classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#Impact1949 #FilmNoir #PublicDomainMovie #ColorizedClassic #BrianDonlevy #EllaRaines #HelenWalker #GoldenAgeHollywood #ClassicCrimeFilm #FilmRestoration #1949Movies",
      "id": "MEbKETNmc4s",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gu0pCB_gtgM",
      "title": "Impact (1949) BRIAN DONLEVY",
      "description": "Starring: Brian Donlevy, Helen Walker, Charles Colburn, Anna May Wong\nDirected by Arthur Lubin\n\nA wealthy industrialist survives a murder attempt by his wife when her lover meets a fiery death instead. He secretly recuperates, but a shocking twist pulls him back into the insidious plot!",
      "id": "gu0pCB_gtgM",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1949impactarthurlubin",
      "title": "1949 - Impact - Arthur Lubin",
      "description": "1949 - Impact - Arthur Lubin",
      "id": "1949impactarthurlubin"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "111 min",
    "imdbRating": "7.0",
    "imdbVotes": "5,035",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "In San Francisco, the successful self-made businessman Walter Williams has just bought three factories in Denver with the approval of the board of directors. His beloved wife Irene tells him that she is not feeling well enough to travel with him, and asks Walter to give a lift to her cousin Jim Torrance. On the highway, Jim, who is actually Irene's lover, tries to kill Walter hitting his head and throwing him off a cliff, and has a fatal fiery accident while escaping driving Walter's car. Walter is believed to be the driver and later his wife is sent to jail accused of plotting his murder. Meanwhile, the wounded Walter falls asleep in a moving van and eventually winds up in Larkspur, a small town in Idaho. He is hired as a mechanic in a gas station by the owner, Marsha Peters. For three months, Walter reads the news, expecting revenge with Irene sentenced to death, and he and Marsha fall in love for each other. When Walter discloses the truth to Marsha, she convinces him to return to San Francisco and save his unfaithful wife. The situation changes when Irene accuses him of plotting to kill her lover Jim, and Walter has to prove his innocence.",
    "Director": "Arthur Lubin",
    "Writer": "Dorothy Davenport, Jay Dratler",
    "Actors": "Brian Donlevy, Ella Raines, Charles Coburn",
    "Language": "English, Cantonese",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0032258",
      "title": "Black Friday",
      "year": 1940,
      "imdbRating": "6.3",
      "imdbVotes": "3,077",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042953",
      "title": "Shakedown",
      "year": 1950,
      "imdbRating": "7.1",
      "imdbVotes": "773",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039536",
      "title": "Kiss of Death",
      "year": 1947,
      "imdbRating": "7.4",
      "imdbVotes": "10,143",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0039973",
      "title": "The Web",
      "year": 1947,
      "imdbRating": "7.1",
      "imdbVotes": "1,524",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041268",
      "title": "Criss Cross",
      "year": 1949,
      "imdbRating": "7.4",
      "imdbVotes": "10,070",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041555",
      "title": "Knock on Any Door",
      "year": 1949,
      "imdbRating": "6.6",
      "imdbVotes": "4,414",
      "language": "English, Italian, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041761",
      "title": "Port of New York",
      "year": 1949,
      "imdbRating": "6.0",
      "imdbVotes": "1,105",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041269",
      "title": "The Crooked Way",
      "year": 1949,
      "imdbRating": "6.6",
      "imdbVotes": "1,671",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041786",
      "title": "The Reckless Moment",
      "year": 1949,
      "imdbRating": "7.1",
      "imdbVotes": "6,042",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0042006",
      "title": "The Undercover Man",
      "year": 1949,
      "imdbRating": "6.6",
      "imdbVotes": "1,454",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041958",
      "title": "Thieves' Highway",
      "year": 1949,
      "imdbRating": "7.5",
      "imdbVotes": "7,130",
      "language": "English, Italian, Greek",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041967",
      "title": "Tokyo Joe",
      "year": 1949,
      "imdbRating": "6.3",
      "imdbVotes": "2,918",
      "language": "English, Japanese",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "film-noir",
      "name": "Film Noir"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T17:43:03.100Z"
}