{
  "imdbId": "tt0001615",
  "title": "Fisher Folks",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PreviewFisherFolks",
      "title": "PreviewFisherFolks",
      "id": "PreviewFisherFolks"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "17 min",
    "imdbRating": "4.9",
    "imdbVotes": "39",
    "Genre": "Short, Drama",
    "Plot": "Steve Hardester, a handsome young fisherman, is infatuated with Cora, the village flirt. She, though really caring for him, must indulge her inclination to coquetry, laughingly flinging love back into his face, often making him the target of derision. Our story opens on the day of the Fair in the little fishing village. Bertha, a poor cripple, with a slightly deformed figure, but a pure sweet face, being too frail to undergo the toil of the fisher girl, ekes a livelihood selling flowers to the gallant fisher boys with which to deck their sweetheart's tresses. On this day Bertha starts out long before daybreak to gather the dewy blossoms and form them into nosegays for sale to the young swains before the opening of the Fair. This done long before the dawn, she reclines on the beach and dozes off through sheer fatigue and sleeps until the morning sun awakens her. Going through the village she meets Steve as he is about to enter his cottage. Offering her bouquets, he purchases one to give to the object of his affection, Cora. Sad of heart, poor Bertha wishes she had someone to show her those little attentions, particularly Steve, as she has always loved the handsome young fisherman. Cora, though, imagining that she can have her choice of the boys on account of her attractiveness, takes delight in holding Steve's little favors up to ridicule, and this occasion is no exception, for when he invites her to attend the Fair and presents her with the bunch of wildflowers, she pokes fun at it. This is the last straw and Steve snatched the flowers from her and crushes them under his heel, leaving her for good. This at first amuses Cora, for she thinks herself irresistible and he will come back. But not so, for as he dashes back to his cottage he meets again the little flower seller. Her sweet face at once appeals to him and in a moment of pique through wounded pride, rather than a tender feeling for Bertha, he asks her to attend the Fair with him. Her joy is ecstatic at this and she and Steve make their way to the Fairgrounds, much to the chagrin of Cora, who has from a distance witnessed their meeting. However, Cora assumes an indifferent mien, feeling that Steve's action is induced by a spirit of revenge. This is at first true, but Steve's association with Bertha cultivates something more serious. He now realized the worth of an affection born of a pure soul, and they become betrothed, their marriage following shortly after. Cora is now the one to suffer wounded pride. She realizes she has lost the best catch in the village, and to one whom she regards as so inferior. Obsessed by a desire for revenge, she determines at any cost to wreak it. Some time later she visits the young couple's cottage, ostensibly to congratulate them, but upon leaving slips a note to Steve to meet her at the old trysting place. More than mere curiosity impels him to see her, and on the eve of his departure on a long cruise he is there to bid her an adieu. More than a year passes and no word comes from the fishing crew, until late one afternoon their vessel is seen in the distance slowly nearing the shore. The little village is at once alive with excitement. Kindly fisherman inform Bertha of the approach of the long-absent fisher crew and she takes up her little charge, which had arrived in the meantime, to make her was as fast as possible to the landing place. Her heart is almost bursting with joy in the anticipation of Steve's surprise when she placed in his arms their little son. But what grief awaits her, for Cora arriving first lures him of to her cottage, Bertha arriving just in time to see them going hurriedly up the beach. Almost heart-broken and forlorn she wends her way homeward, when at a turn in the lane she comes face to face with Steve. What a shock! He now realizes what a contemptible brute he is and so has not the heart to face her. Bertha, however, has nothing but forgiveness and love portrayed in her countenance, so Steve takes the little one from her outstretched arms and together they go to their humble cottage, leaving Cora transfixed with suppressed rage on the sands.",
    "Director": "D.W. Griffith",
    "Writer": "Harriet Quimby",
    "Actors": "Wilfred Lucas, Linda Arvidson, Vivian Prescott",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001593",
      "title": "Enoch Arden: Part I",
      "year": 1911,
      "imdbRating": "6.3",
      "imdbVotes": "393",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001459",
      "title": "Winning Back His Love",
      "year": 1910,
      "imdbRating": "5.5",
      "imdbVotes": "65",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001987",
      "title": "A Woman Scorned",
      "year": 1911,
      "imdbRating": "6.2",
      "imdbVotes": "25",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001753",
      "title": "Love in the Hills",
      "year": 1911,
      "imdbRating": "6.0",
      "imdbVotes": "18",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001701",
      "title": "The Indian Brothers",
      "year": 1911,
      "imdbRating": "4.6",
      "imdbVotes": "80",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001949",
      "title": "The Two Paths",
      "year": 1911,
      "imdbRating": "5.6",
      "imdbVotes": "31",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001913",
      "title": "Swords and Hearts",
      "year": 1911,
      "imdbRating": "5.4",
      "imdbVotes": "253",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001789",
      "title": "The Miser's Heart",
      "year": 1911,
      "imdbRating": "6.3",
      "imdbVotes": "309",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001680",
      "title": "His Trust: The Faithful Devotion and Self-Sacrifice of an Old Negro Servant",
      "year": 1911,
      "imdbRating": "5.1",
      "imdbVotes": "661",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001681",
      "title": "His Trust Fulfilled",
      "year": 1911,
      "imdbRating": "4.8",
      "imdbVotes": "306",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001431",
      "title": "The Unchanging Sea",
      "year": 1910,
      "imdbRating": "6.3",
      "imdbVotes": "916",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002208",
      "title": "The Girl and Her Trust",
      "year": 1912,
      "imdbRating": "6.8",
      "imdbVotes": "1,279",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T19:04:22.790Z"
}