{
  "movieId": "tt0056042",
  "title": "The Trojan Horse",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-trojan-horse-1961",
      "id": "the-trojan-horse-1961",
      "title": "The Trojan Horse (1961)",
      "description": "The Trojan Horse (1961) is an Italian film that retells the events leading to the fall of Troy, focusing on the Trojan hero Aeneas during the final year of the Trojan War. The story highlights Aeneas's struggles against the Greek forces, particularly after the death of Hector, and culminates in the famous ruse of the wooden horse that leads to the city's downfall.",
      "fileSize": 1194621186,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-trojan-horse-1961",
      "language": "ita / English",
      "year": 1961,
      "collection": "feature_films",
      "downloads": 175
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "105 min",
    "imdbRating": 5.9,
    "imdbVotes": 675,
    "Genre": "Adventure, Drama, History",
    "Plot": "In the final year of the 10 year long Trojan War, Ulysses devises his infamous scheme to get into Troy. The Greeks build a colossal wooden horse which the Trojans take into their city, believing it is a gift from Poseidon. Hidden inside are the Greek warriors who open the city gates and allow the invaders to enter and destroy the city. Thus the phrase \"Beware of Greeks bearing gifts'. After a decade of bloodshed, the city is left in ruins only to be \"discovered\" again in 1893. The entire story focuses on Aeneas, played by Steve Reeves who is the star of the movie. Aeneas fights many battles during the movie. He even travels abroad and brings back an entire foreign army to defend his city. Aeneas leads the desperate final battle to defend Troy but all is lost. After the fall of the city, Aeneas leads the 600 survivors to Italy and founds the city of Rome. Many ancient Romans would take pride in their lineage to Aeneas. Steve Reeves also starred in the sequel, The Avenger (The last Glory of Troy). Larry Anderson.",
    "Director": "Giorgio Ferroni",
    "Writer": "Giorgio Ferroni, Ugo Liberatore, Giorgio Stegani",
    "Actors": "Steve Reeves, Juliette Mayniel, John Drew Barrymore",
    "Language": "Italian",
    "Country": "Italy, France, Yugoslavia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0055867",
    "tt0054756",
    "tt0056556",
    "tt0055719",
    "tt0053580",
    "tt0057225",
    "tt0062714",
    "tt0051398",
    "tt0052604",
    "tt0052538",
    "tt0020030",
    "tt0017667"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}