{
  "movieId": "tt0005078",
  "title": "The Cheat",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheCheat",
      "id": "TheCheat",
      "title": "The Cheat",
      "description": "1915 silent film directed by Cecil B Demille starring Fannie Ward. This film was selected for preservation in America's \"National Film Registry\". A desperate socialite turns to a Burnese Ivory trader after she is almost found out for embezzling funds from her charity.",
      "fileSize": 1193158087,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheCheat",
      "language": "eng",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 34941
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheCheat1915",
      "id": "TheCheat1915",
      "title": "The Cheat",
      "description": "Title: The Cheat Summary: A venal, spoiled stockbroker's wife impulsively embezzles $10,000 from the charity she chairs and desperately turns to a Burmese ivory trader to replace the stolen money. Directed by: Cecil B. DeMille Actors: Production Company: Jesse L. Lasky Feature Play Company Release Date: 13 December 1915 (USA) Aspect Ratio: 1.33 : 1 Edith Hardy uses charity funds for Wall Street investments in hopes of buying some new gowns. She loses all the money and borrows from wealthy oriental Tori. When her husband gives her the amount she borrowed, Tori won't take it back, branding her shoulder with a Japanese sign of his ownership. She shoots him. Her husband takes the blame. In court Edith reveals all to an angry mob.",
      "fileSize": 508698079,
      "addedAt": "2026-01-07T00:06:58.273Z",
      "thumbnail": "https://archive.org/services/img/TheCheat1915",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 2034
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Cheat",
      "id": "The_Cheat",
      "title": "The Cheat",
      "description": "From IMDb : A venal, spoiled stockbroker's wife impulsively embezzles $10,000 from the charity she chairs, and desperately turns to a Burmese ivory trader to replace the stolen money. Stars: Fannie Ward, Sessue Hayakawa, Jack Dean, James Neill, Yutaka Abe, Dana Ong, Hazel Childers, and Arthur H. Williams",
      "fileSize": 1127393887,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Cheat",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 17106
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CaPAyhxJ0LM",
      "id": "CaPAyhxJ0LM",
      "title": "The Cheat (1915) | Colorized Public Domain Silent Drama Classic with Fannie Ward and Sessue Hayakawa",
      "description": "The Cheat (1915) is a landmark American silent drama directed by Cecil B. DeMille and produced by Jesse L. Lasky for Paramount Pictures. Starring Fannie Ward, Sessue Hayakawa, and Jack Dean, the film runs approximately 59 minutes and remains one of the most influential dramas of the silent era. It is often credited with helping establish DeMille’s reputation as a master director and Sessue Hayakawa’s stardom as one of the first internationally recognized Asian actors in Hollywood. This restored and colorized edition revitalizes the visual power of DeMille’s early masterpiece, making it emotionally vivid and culturally significant for today’s audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nThe Cheat follows the story of Edith Hardy (Fannie Ward), a wealthy society woman living beyond her means. Desperate to cover her debts, she secretly “borrows” money entrusted to her by a charitable fund she manages. When her reckless spending catches up with her, she turns to the wealthy Japanese ivory merchant Hishuru Tori (Sessue Hayakawa) for financial assistance.\n\nTori agrees to help her but expects more than repayment—he demands Edith as his possession. When she attempts to resist, Tori brands her with a heated iron, marking her as his property. This shocking act, bold for its time, propels the film into a courtroom drama when Edith’s husband, Richard Hardy (Jack Dean), discovers the scandal. The courtroom sequence delivers a dramatic climax that questions morality, cultural prejudice, and the consequences of Edith’s choices.\n\nCast and Crew:\n• Director: Cecil B. DeMille\n• Producer: Jesse L. Lasky\n• Screenplay: Hector Turnbull, Jeanie Macpherson\n• Cinematography: Alvin Wyckoff\n\nStarring:\n• Fannie Ward as Edith Hardy\n• Sessue Hayakawa as Hishuru Tori\n• Jack Dean as Richard Hardy\n\nFilm Significance:\nThe Cheat is historically significant for multiple reasons. First, it showcased Cecil B. DeMille’s innovative use of lighting, composition, and visual storytelling, particularly his pioneering use of “Lasky lighting,” which used controlled shadows to create a dramatic, atmospheric effect. These techniques influenced the development of cinematic style for decades.\n\nSecond, Sessue Hayakawa’s role made him a global sensation. His portrayal of Tori—a wealthy, enigmatic, and morally ambiguous figure—was both groundbreaking and controversial. At a time when Hollywood offered few leading roles to non-white actors, Hayakawa became one of the first Asian actors to achieve international fame, paving the way for future stars.\n\nThe film also sparked controversy due to its racial overtones, with its portrayal of an interracial dynamic that was provocative for 1915 audiences. Despite this, or perhaps because of it, The Cheat gained widespread attention and remains a crucial cultural artifact in discussions of race and representation in early American cinema.\n\nEnhanced Public Domain Explanation:\nThe Cheat (1915) is in the public domain, free of copyright restrictions and available for preservation, restoration, and re-release worldwide. At Colorized Public Domain, we carefully restore the visual clarity of these early classics while adding respectful colorization. In this edition, the contrasts of wealth, seduction, and danger are heightened through color, emphasizing the opulence of Edith’s lifestyle, the intensity of Tori’s branding scene, and the stark drama of the courtroom climax.\n\nWhy Watch This Colorized Edition:\nOriginally released in black and white, The Cheat relied heavily on shadow and expression to convey its power. While historically important, the colorized edition provides new depth and accessibility, allowing modern viewers to fully experience the film’s tension and emotional impact. By enhancing its visual storytelling, this edition bridges the gap between silent-era artistry and contemporary cinematic expectations, ensuring the film continues to resonate with audiences today.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more restored and colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nAt Colorized Public Domain, we specialize in preserving and revitalizing silent dramas, comedies, and groundbreaking works from the early decades of film history. Our mission is to honor pioneers like Cecil B. DeMille and Sessue Hayakawa while introducing their artistry to new generations in the USA, Europe, and worldwide.\n\n#TheCheat1915 #CecilBDeMille #SessueHayakawa #SilentDrama #PublicDomainMovie #ColorizedClassic #SilentFilmHistory #GoldenAgeHollywood #FannieWard #ClassicCinema #FilmRestoration #1910sMovies",
      "addedAt": "2025-12-24T00:47:44.265Z",
      "thumbnail": "https://i.ytimg.com/vi/CaPAyhxJ0LM/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBlKGUwDw==&rs=AOn4CLBq2goSpj3rKti2m8TJmgVt2A4w7A",
      "duration": 3436,
      "language": "en",
      "year": 1915,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-cheat",
      "id": "silent-the-cheat",
      "title": "The Cheat",
      "fileSize": 1856056941,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-cheat",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 499
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-cheat-1915_202507",
      "id": "the-cheat-1915_202507",
      "title": "The Cheat (1915)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The Cheat is about a woman who gambles herself into a large debt, and who must ask a Japanese ivory merchant for a loan. He offers to pay the debt in exchange for sexual favors, to which she refuses. While the film contains racist overtones and plot points, it did firmly establish actor Sessue Hayakawa as a sex symbol and movie star. ",
      "fileSize": 2996469511,
      "addedAt": "2026-01-07T00:11:57.682Z",
      "thumbnail": "https://archive.org/services/img/the-cheat-1915_202507",
      "language": "eng",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 120
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "59 min",
    "imdbRating": 6.5,
    "imdbVotes": 2713,
    "Genre": "Drama, Romance",
    "Plot": "Edith Hardy uses charity funds for Wall Street investments in hopes of buying some new gowns. She loses all the money and borrows from wealthy oriental Tori. When her husband gives her the amount she borrowed, Tori won't take it back, branding her shoulder with a Japanese sign of his ownership. She shoots him. Her husband takes the blame. In court Edith reveals all to an angry mob.",
    "Director": "Cecil B. DeMille",
    "Writer": "Hector Turnbull, Jeanie Macpherson",
    "Actors": "Fannie Ward, Sessue Hayakawa, Jack Dean",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0005059",
    "tt0005060",
    "tt0016294",
    "tt0019935",
    "tt0024656",
    "tt0008150",
    "tt0004838",
    "tt0008519",
    "tt0008786",
    "tt0005460",
    "tt0228815",
    "tt0009796"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.682Z"
}