{
  "movieId": "tt0037267",
  "title": "Shake Hands with Murder",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ShakeHandsWithMurder",
      "id": "ShakeHandsWithMurder",
      "title": "Shake Hands with Murder",
      "description": "A tough-as-nails bail bondswoman helps an embezzler prove his innocence.",
      "fileSize": 990017168,
      "addedAt": "2026-01-07T00:06:51.868Z",
      "thumbnail": "https://archive.org/services/img/ShakeHandsWithMurder",
      "collection": "feature_films",
      "downloads": 9382
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 5.8,
    "imdbVotes": 119,
    "Genre": "Comedy, Drama, Mystery",
    "Plot": "Patsy Brent, bail-bond broker, finds that her partner, Eddie Jones, who is trying to acquire a better class clientèle has invested all of their capital to bail Steve Morgan, investment company executive who has been framed on an embezzlement charge out of jail. And Morgan has disappeared. Trying to find Morgan, Patsy stumbles across the body of John Clark, Morgan's ex-boss, not to mention now late boss. Patsy spots Morgan and catches up with him at a mountain lodge, where he convinces her of his innocence. They spend a week searching together for the missing bonds Morgan was accused of stealing. They finally find the bonds hidden in a secret compartment which has been rigged as a booby trap. This booby trap is rigged so that when the panel is opened a wire leading from the panel to a suit of armor, causes the arm of the armor to raise and fire a gun hidden within it to fire at the person opening the panel. Morgan tricks the board of directors into coming to the lodge and, when they arrive, he asks them alone one by one to open the panel, telling them that's where the missing bonds are hidden. He knows the guilty person will, knowing the panel is still booby-trapped, refuse.",
    "Director": "Albert Herman",
    "Writer": "Martin Mooney, John T. Neville",
    "Actors": "Iris Adrian, Frank Jenks, Douglas Fowley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0037918",
    "tt0036695",
    "tt0038034",
    "tt0036753",
    "tt0037847",
    "tt0037985",
    "tt0032608",
    "tt0032686",
    "tt0035573",
    "tt0034637",
    "tt0036164",
    "tt0045620"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.868Z"
}