{
  "movieId": "tt0048657",
  "title": "Stella",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/stella_1955_202110",
      "id": "stella_1955_202110",
      "title": "Stella (1955)",
      "description": "Proud and independent, Stella, an unconventional Rebetico singer who cherishes her freedom, finds herself in an intense whirlwind romance. Everything points to a tragic ending, and in the aftermath of passion, there can be no winners.",
      "fileSize": 2132300614,
      "addedAt": "2026-01-07T00:11:35.629Z",
      "thumbnail": "https://archive.org/services/img/stella_1955_202110",
      "language": "gre",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 5947
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 7.9,
    "imdbVotes": 2980,
    "Genre": "Drama, Music, Romance",
    "Plot": "Fiercely proud and unapologetically independent, Stella--the blonde Rebetico diva and flamboyant entertainer of a small nightclub named Paradise--is. above all, a woman who cherishes her freedom. Choosing to give in to desire without ever committing herself to one man, the feisty vocalist stays true to her ideals, but a fateful encounter with explosive, egotistic football player Miltos, paves the way for an unexpected, all-consuming whirlwind romance. Up until now, no one has ever managed to control Stella and rob her of her precious autonomy, but Miltos is the inadvertent catalyst in an already-volatile relationship, and he demands total surrender. Undoubtedly, love is grand but it can be dangerous--and as everything points to a tragic ending, only a paradoxical act of carnivorous devotion can provide catharsis. And in the aftermath of passion, there can be no winners.",
    "Director": "Michael Cacoyannis",
    "Writer": "Michael Cacoyannis, Iakovos Kabanellis",
    "Actors": "Melina Mercouri, Giorgos Foundas, Alekos Alexandrakis",
    "Language": "Greek",
    "Country": "Greece",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    "tt0053270",
    "tt0047974",
    "tt0020866",
    "tt0026367",
    "tt0028216",
    "tt0023128",
    "tt0055278",
    "tt0047860",
    "tt0032411",
    "tt0047823",
    "tt0048347",
    "tt0048121"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-13T19:12:46.496Z"
}