{
  "imdbId": "tt0019557",
  "title": "Weary River",
  "year": 1929,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hafWdYnZFkk",
      "id": "hafWdYnZFkk",
      "title": "Weary River (1929) RICHARD BARTHELMESS🍕 BETTY COMPSON🍕 PRE-CODE GANGSTER CLASSIC",
      "description": "It's Friday @PizzaFLIX \nStars: Richard Barthelmess, Betty Compson, William Holden\nDirector: Frank Lloyd\nWriter: Courtney Ryley Cooper (story by)\n🍕Oscar Nominee Best Directing🍕\nTonight, “The Jazz Singer” goes “Underworld.” From First National Pictures, it’s a gritty, Pre-Code Crime flick at the crossroads of sound. Part-Silent, part -Talkie, 100% Gangster. Starring a haunting Richard Barthelmess and a devoted Betty Compson, with an Oscar nomination for director Frank Lloyd.\n\nA Mob Boss sentenced to Sing Sing—turns his prison blues into music, writing and performing a song that captures the heart of the nation. Can he make a killing in the music biz, or will temptation lure him back to his wicked old ways? Find out and watch this Pre-Code Crime Classic. Until the next time, may the Sauce be with you.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nSubscribe to PizzaFLIX for more Pre-Code Hollywood crime thrillers, gangster movies, and vintage classics! Don’t forget to like, comment, and share to keep classic cinema alive! \n\n #Prison movies #Weary River 1929 #Richard Barthelmess #Betty Compson #Pre-Code Hollywood #classic gangster movie #early talkies #Frank Lloyd #First National Pictures #Frank Lloyd #Oscar nominated director #1929 movies #Pre-Code crime films #classic crime movies #Sing Sing prison #old Hollywood #early sound films #pizzaflix",
      "addedAt": "2025-12-24T01:04:36.799Z",
      "thumbnail": "https://i.ytimg.com/vi/hafWdYnZFkk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAHUCr6MCLW5RLXnoO1sKn_ol_ROg",
      "duration": 5240,
      "language": "en",
      "year": 1929,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/weary-river_1929",
      "id": "weary-river_1929",
      "title": "Weary River",
      "fileSize": 4462514584,
      "addedAt": "2026-01-07T00:13:06.701Z",
      "thumbnail": "https://archive.org/services/img/weary-river_1929",
      "language": "English",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 4074
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "86 min",
    "imdbRating": 6.1,
    "imdbVotes": 527,
    "Genre": "Drama, Romance",
    "Plot": "Jerry Larabee (Richard Barthelmess)is a gangster who can play piano and sing, mostly to entertain his girl Alice (Betty Compson), who is quite visibly thrilled by his crooning. But as the result of a gangland shootout he had with rival mobster Spadoni (Louis Natheaux), Larabee must do a stretch in prison. The kindly warden (William Holden) sees a potential for redemption in him, and talks Mary into giving him up, so he will break all contact with his previous life. Through his musical talents, Jerry is soon doing radio broadcasts with the prison orchestra, and one of his own compositions, \"Weary River\" is a smash hit with listeners. In no time, he's released, with a concert tour lined up. unfortunately, hecklers cause the overly sensitive ex-gunman to lose his confidence and he's a flop. Down on his luck, he drifts back to his old gang buddies and Mary, who's never stopped loving him. After learning that his stint up the river was a frame-up by Spadoni, a showdown is arranged at their hangout, a small café. A grim wait until the agreed minute is interrupted by the appearance of the Warden, who's been tipped off by Mary. He saves Jerry from the resulting shootout and arrival of the police force. Spadoni's dead, and now avenged, and apparently reformed as well, the warden's happy to let Larabee go free to marry Mary.",
    "Director": "Frank Lloyd",
    "Writer": "Courtney Ryley Cooper, Bradley King, Paul Perez",
    "Actors": "Richard Barthelmess, Betty Compson, William Holden",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 Oscar. 1 nomination total"
  },
  "relatedMovies": [
    "tt0019824",
    "tt0037547",
    "tt0020602",
    "tt0019946",
    "tt0015310",
    "tt0020458",
    "tt0014721",
    "tt0022046",
    "tt0018253",
    "tt0019644",
    "tt0019957",
    "tt0019979"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.701Z"
}