{
  "imdbId": "tt0036999",
  "title": "The Lady and the Monster",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/theladyandthemonster",
      "id": "theladyandthemonster",
      "title": "The Lady and the Monster",
      "description": "“An entertaining ‘40s thriller” “Unfortunately titled, but it is a good film” “Not a bad little sci-fi thriller” (IMDB reviews quotes). A malevolent millionaire’s brain is kept alive after his death. Which is fine and dandy until the brain starts controlling people. Good production values and a good cast -- that is with the exception of Vera Ralston. Remade in 1953 as “Donovan’s Brain” and in 1962 as “The Brain.” Save this sci-fi/horror for a dull Friday night when there is nothing happening on the cocktail party circuit. IMDB rating 5.6. Produced and directed by George Sherman. Released in 1944. Complete print AKA “The Lady and the Doctor” (UK). TRIVIA: Longtime Republic director George Sherman quit Republic so he wouldn’t have to direct Vera Ralston again. True story.",
      "fileSize": 853393719,
      "addedAt": "2026-01-07T00:12:44.281Z",
      "thumbnail": "https://archive.org/services/img/theladyandthemonster",
      "collection": "feature_films",
      "downloads": 8657
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "86 min",
    "imdbRating": 5.6,
    "imdbVotes": 420,
    "Genre": "Horror, Sci-Fi, Thriller",
    "Plot": "Prof. Franz Mueller is trying to sustain brain activity to keep important people's minds beyond their deaths. A fortuitous plane crash allows a Mueller to remove and preserve the victim's brain in a special solution he has been developing. As the brain is treated with plasma, it begins to telepathically take control of the scientist's assistant, Patrick Cory. The longer this continues, the stronger the connection to Patrick's mind. In fact, his whole personality takes on aspects of Henry Donovan, a ruthless millionaire financial wizard. Donovan wants Patrick to win freedom for Roger Collins who has wrongfully imprisoned for a murder he didn't commit. Mueller's other assistant, lovely Janice Farrell, is conflicted. She knows that Mueller has eyes for her, but is repulsed by him as a person. She is sweet on Patrick. The two plan to run away together until Donovan's personality takes over.",
    "Director": "George Sherman",
    "Writer": "Dane Lussier, Frederick Kohner, Curt Siodmak",
    "Actors": "Vera Ralston, Erich von Stroheim, Richard Arlen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0036125",
    "tt0053337",
    "tt0036653",
    "tt0060536",
    "tt0052228",
    "tt0052846",
    "tt0037084",
    "tt0080354",
    "tt0050210",
    "tt1789724",
    "tt1386583",
    "tt0055058"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.281Z"
}