{
  "movieId": "tt0050097",
  "title": "Across the Bridge",
  "year": 1957,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AcrossTheBrigde",
      "id": "AcrossTheBrigde",
      "title": "Across the Bridge",
      "description": "Title: Across the Bridge Summary: A wealthy businessman attempts to run to Mexico to escape capture for embezzlement. On the way, he switches identities for a visa but that only complicates matters. Directed by: Ken Annakin Actors: Rod Steiger, David Knight, Bernard Lee Production Company: Independent Film Producers (IFP) Release Date: 6 September 1957 (Denmark) Aspect Ratio: 1.75: 1 Color: Black and White On the run from the US police after being charged with embezzlement, a billionaire attempts to flee to Mexico by stealing the identity of a stranger. However, his life is made much more difficult when he finds out that that man is a wanted Mexican criminal. Corporate executive Carl Schaffner is a German-born British industrialist in New York on business. After he gets word that Scotland Yard is investigating a $3,000,000 embezzlement he has committed, the imperious, mean-spirited Schaffner thinks he has sufficient time to take an inconspicuous train to Mexico where he can escape extradition. He miscalculates, and his crime has become headline news before he can cross the border. He drugs and switches identities with fellow train passenger Paul Scarff, who looks like him and has a Mexican passport. He throws him off the train but later discovers that Scarff is wanted in Mexico as a political assassin. Schaffner must double back and track down Scarff to get his original passport back. He allows himself to be taken to Mexico as Scarff, where he declares his true identity to local police because as Schaffner he is not wanted there. The local police chief and Scotland Yard inspector Hadden conspire to keep him trapped in the Mexican border town of Katrina in an effort to get him to cross the bridge back into the U.S. and face justice. The misanthropic Schaffner has grown attached to Scarff's pet spaniel and is tricked into going across the dividing line of the bridge to get the dog. He is accidentally killed trying to escape the authorities. The final irony is that the discovery his own humanity has cost the cynical, friendless Schaffner his life.",
      "fileSize": 802989193,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AcrossTheBrigde",
      "year": 1957,
      "collection": "feature_films",
      "downloads": 7330
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/across-the-bridge-1957-colorized-movie-720p-hd",
      "id": "across-the-bridge-1957-colorized-movie-720p-hd",
      "title": "Across the Bridge (restored, colorized) (1957, thriller, imdb score: 7.2)",
      "description": "Across the Bridge is a 1957 British thriller film directed by Ken Annakin and starring Rod Steiger and Bernard Lee. It is based on the 1938 short story \"Across the Bridge\" by Graham Greene. According to his obituary, it was director Annakin's favourite film.",
      "fileSize": 1350089354,
      "addedAt": "2026-01-07T00:07:18.439Z",
      "thumbnail": "https://archive.org/services/img/across-the-bridge-1957-colorized-movie-720p-hd",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 314
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "103 min",
    "imdbRating": 7.2,
    "imdbVotes": 961,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "On the run from the US police after being charged with embezzlement, a billionaire attempts to flee to Mexico by stealing the identity of a stranger. However, his life is made much more difficult when he finds out that that man is a wanted Mexican criminal.",
    "Director": "Ken Annakin",
    "Writer": "Graham Greene, Guy Elmes, Denis Freeman",
    "Actors": "Rod Steiger, David Knight, Bernard Lee",
    "Language": "English, Spanish",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0221319",
    "tt0127562",
    "tt0232137",
    "tt0054295",
    "tt0049854",
    "tt0051500",
    "tt0049288",
    "tt0051378",
    "tt0053133",
    "tt0053850",
    "tt0052862",
    "tt0053361"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:47:32.451Z"
}