{
  "imdbId": "tt0054807",
  "title": "The Devil's Messenger",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheDevilsMessenger",
      "id": "TheDevilsMessenger",
      "title": "The Devil's Messenger",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 1457366925,
      "addedAt": "2026-01-07T00:06:58.274Z",
      "thumbnail": "https://archive.org/services/img/TheDevilsMessenger",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 10377
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XTCwM1dRH6o",
      "id": "XTCwM1dRH6o",
      "title": "The Devil's Messenger (1962) LON CHANEY, JR.",
      "description": "Rare 1:85 Theatrical Wide-Screen Print!\nStars: Lon Chaney Jr., Karen Kadler, John Crawford \nDirectors: Herbert L. Strock, Curt Siodmak (uncredited)\n\nThe basis of this film is three episodes of “13 Demon Street,” written, directed, and created by Curt Siodmak. The original prologues and codas by Lon Chaney are replaced with new ones filmed by Herbert L. Strock, director of “I was a Teenage Werewolf.” Here, instead of a tormented soul in limbo, Chaney plays Satan who strikes a bargain with a lovely new arrival to his fiery domain.\n\nTRIVIA: This movie reunites Lon Chaney, Jr. with Curt Siodmak, the writer of his monster classic THE WOLFMAN.\n\n13 DEMON STREET is a horror anthology TV series that aired between 1959 and 1960. Thirteen 25-minute episodes were produced in Sweden, although the language, and cast, are English. Episodes featured in this movie are:\n(1) The Photograph -- A photographer takes a number of powerful images, none more so than a lonely farmhouse and a beautiful woman framed by a bleak landscape. \n(2) The Girl in the Glacier -- An archaeologist becomes obsessed with the beautiful naked female found frozen in time inside a glacier.\n(3) Condemned in the Crystal -- A man obsessed by an uncertain future, has his fears exacerbated when a fortune teller predicts a dire fate.",
      "addedAt": "2025-12-26T23:42:26.112Z",
      "thumbnail": "https://i.ytimg.com/vi/XTCwM1dRH6o/maxresdefault.jpg",
      "duration": 4310,
      "language": "en",
      "year": 1962,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 4.7,
    "imdbVotes": 541,
    "Genre": "Drama, Fantasy, Horror",
    "Plot": "Satan enlists the help of a suicide victim in Hell to lure unsuspecting earthly victims to their eternal doom. Contains three somewhat unrelated Twilight Zone-esque stories (A photographer goes insane after raping a mysterious girl in the snow, a 50,000 year-old woman found frozen in an ice field is fought over by scientists, and a man's death is foretold in dreams).",
    "Director": "Herbert L. Strock, Curt Siodmak",
    "Writer": "Leo Guild, Dory Previn, Curt Siodmak",
    "Actors": "Lon Chaney Jr., Karen Kadler, Michael Hinn",
    "Language": "English",
    "Country": "Sweden, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0058279",
    "tt0035096",
    "tt2784936",
    "tt14292086",
    "tt0062453",
    "tt0018770",
    "tt0055478",
    "tt0056211",
    "tt0012364",
    "tt0055609",
    "tt0037635",
    "tt0021814"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.274Z"
}