{
  "imdbId": "tt0016654",
  "title": "The Black Pirate",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBlackPirate1926DouglasFairbanksSRAndy",
      "title": "The Black Pirate",
      "description": "A nobleman vows to avenge the death of his father at the hands of pirates. To this end he infiltrates the pirate band. Acting in character he is instrumental in the capture of a ship, but things are complicated when he finds that there is a young woman on board whom he wishes to protect from the threat of a fate worse than death. http://www.imdb.com/title/tt0016654/",
      "id": "TheBlackPirate1926DouglasFairbanksSRAndy"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBlackPirate720p1926",
      "title": "The Black Pirate",
      "description": "Title: The Black Pirate Summary: Seeking revenge, an athletic young man joins the pirate band responsible for his father's death. Directed by: Albert Parker Actors: Douglas Fairbanks, Billie Dove, Tempe Pigott Production Company: Elton Corporation Release Date: 8 March 1926 (USA) Aspect Ratio: 1.33 : 1 A nobleman vows to avenge the death of his father at the hands of pirates. To this end he infiltrates the pirate band. Acting in character he is instrumental in the capture of a ship, but things are complicated when he finds that there is a young woman on board whom he wishes to protect from the threat of rape.",
      "id": "TheBlackPirate720p1926"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FogAS1CB__A",
      "title": "The Black Pirate (1926) | Colorized Public Domain Silent Adventure with Douglas Fairbanks | Pirates",
      "description": "The Black Pirate (1926) is an American silent swashbuckler directed by Albert Parker and produced by and starring Douglas Fairbanks. This restored and colorized public domain edition brings back one of the most ambitious and visually groundbreaking films of the silent era. Combining breathtaking stunts, romantic adventure, and the sheer charisma of Fairbanks, The Black Pirate stands as a milestone in cinematic history and remains one of the greatest silent adventure films ever made.\n\nPlot Summary:\nThe story begins when a ship is attacked by ruthless pirates, leaving only one survivor — the young nobleman played by Douglas Fairbanks. Seeking revenge, he infiltrates the pirates’ ranks by demonstrating his courage and cunning, soon earning their respect as “The Black Pirate.” Through a series of daring feats, including sword fights, swashbuckling duels, and the now-famous stunt of sliding down a ship’s sail with a dagger, he rises among the crew while secretly plotting to destroy them.\n\nComplicating his quest is the presence of a kidnapped princess, portrayed by Billie Dove, whose life hangs in the balance. Torn between revenge and love, the Black Pirate must find a way to outwit the cutthroat pirates, free the captives, and redeem his honor. The climax combines romance, heroic sacrifice, and explosive action, culminating in one of the most memorable endings of the silent adventure genre.\n\nCast and Crew:\n• Director: Albert Parker\n• Producer: Douglas Fairbanks\n• Cinematography: Henry Sharp\n• Studio: Douglas Fairbanks Pictures, distributed by United Artists\n\nStarring:\n• Douglas Fairbanks as The Black Pirate\n• Billie Dove as The Princess\n• Anders Randolf as Chief Pirate\n• Donald Crisp as MacTavish\n• Sam De Grasse as Pirate Lieutenant\n\nFilm Significance:\nThe Black Pirate is widely regarded as one of the greatest swashbucklers ever filmed. Douglas Fairbanks, already the era’s most bankable action star, performed nearly all of his own stunts, cementing his reputation as Hollywood’s original action hero. The film’s influence stretched far beyond the 1920s, inspiring later pirate adventures, including Errol Flynn’s Captain Blood and countless modern interpretations of the pirate genre.\n\nIts combination of dynamic storytelling, and Fairbanks’s athleticism made it an international hit, solidifying both Fairbanks’s star power and the commercial viability of color filmmaking. Today, it remains not just entertainment but an essential cultural artifact of cinema’s Golden Age.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Black Pirate remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1926 release was so successful, but prints often faded over time, leaving modern audiences with degraded or incomplete visuals. By offering a restored and colorized version, we bring back the film’s original spirit of spectacle while enhancing it for the modern viewer. Older audiences in the United States and Europe — who form the core of this channel’s demographic — will appreciate the nostalgic value combined with modern clarity, while younger generations gain access to an engaging and accessible entry point into silent cinema.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the silent era through Hollywood’s Golden Age, covering legendary swashbucklers, forgotten comedies, and culturally significant dramas. Our channel ensures these cinematic treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheBlackPirate #DouglasFairbanks #SilentFilm #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentAdventure #SwashbucklerFilm #ClassicHollywood #FilmRestoration #1926Movies",
      "id": "FogAS1CB__A",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-black-pirate-1926_202505",
      "title": "The Black Pirate (1926)",
      "description": "A nobleman vows to avenge the death of his father by the hands of pirates. To this end, he infiltrates the pirate band; Acting in character, he single-handedly captures a merchant vessel, but things are complicated when he finds that there is a beautiful young woman of royal blood aboard. Watch on RetroFlix:  https://retroflix.org/the-black-pirate-1926/",
      "id": "the-black-pirate-1926_202505"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-black.-pirate.-1926.720p",
      "title": "The Black Pirate (1926)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. This technicolor adventure film stars Douglas Fairbanks as an avenging pirate who vows to destroy a pirate crew. This was only the third film to use two-tone technicolor, and was a minor hit. The budget was very high for the time, leading to limited profits.  I've uploaded the two versions where I couldn't decide what was the higher picture quality.",
      "id": "the.-black.-pirate.-1926.720p"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9vkqZSzJiZc",
      "title": "The Black Pirate (1926) Douglas Fairbanks | Adventure, Action | Silent Film",
      "description": "Seeking revenge, an athletic young man joins the pirate band responsible for his father's death.\n\nDirector: Albert Parker\nWriters: Douglas Fairbanks, Jack Cunningham\nStars: Douglas Fairbanks, Billie Dove, Tempe Pigott \nGenre: Classics, Cult Film, Comedy, Action, Adventure, Silent \nBudget: $1,300,000.\n\nJoin us on social media :\nhttps://www.facebook.com/CultCinemaClassics\nhttps://www.instagram.com/cultcinemaclassics \nhttps://www.twitch.tv/cultcinemaclassics",
      "id": "9vkqZSzJiZc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blackpirate4k",
      "title": "The Black Pirate 1926 [Colorized, 4K, 60FPS]",
      "description": "The Black Pirate 1926 is a black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2021 using Artificial Intelligence (A.I) and Google Colab colab.research.google.com/ Technologies used: A.I. Colorizing: //github.com/jantic/DeOldify A.I. Increasing frame rate 60 FPS: //rife-vfi.github.io A.I. Upscaling to 4K: ffmpeg.org GPU: Google Colab",
      "id": "blackpirate4k"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "88 min",
    "imdbRating": "7.0",
    "imdbVotes": "2,190",
    "Genre": "Adventure, Action",
    "Plot": "Seeking revenge, an athletic young man joins the pirate band responsible for his father's death.",
    "Director": "Albert Parker",
    "Writer": "Douglas Fairbanks, Jack Cunningham",
    "Actors": "Douglas Fairbanks, Billie Dove, Tempe Pigott",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 wins"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0017925",
      "title": "The General",
      "year": 1926,
      "imdbRating": "8.1",
      "imdbVotes": "104,099",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016749",
      "title": "Crossed Signals",
      "year": 1926,
      "imdbRating": "5.7",
      "imdbVotes": "51",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0129928",
      "title": "The Flying Ace",
      "year": 1926,
      "imdbRating": "6.1",
      "imdbVotes": "296",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015772",
      "title": "The Eagle",
      "year": 1925,
      "imdbRating": "6.6",
      "imdbVotes": "2,212",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0016641",
      "title": "Ben-Hur: A Tale of the Christ",
      "year": 1925,
      "imdbRating": "7.8",
      "imdbVotes": "8,047",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018464",
      "title": "Tarzan and the Golden Lion",
      "year": 1927,
      "imdbRating": "5.2",
      "imdbVotes": "240",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019596",
      "title": "Won in the Clouds",
      "year": 1928,
      "imdbRating": "5.6",
      "imdbVotes": "55",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018937",
      "title": "A Girl in Every Port",
      "year": 1928,
      "imdbRating": "6.5",
      "imdbVotes": "864",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015163",
      "title": "The Navigator",
      "year": 1924,
      "imdbRating": "7.5",
      "imdbVotes": "11,273",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019194",
      "title": "The Mysterious Airman",
      "year": 1928,
      "imdbRating": "6.5",
      "imdbVotes": "43",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0014734",
      "title": "Branded a Bandit",
      "year": 1924,
      "imdbRating": "5.7",
      "imdbVotes": "50",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019434",
      "title": "Submarine",
      "year": 1928,
      "imdbRating": "6.3",
      "imdbVotes": "319",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T19:07:33.000Z"
}