{
  "imdbId": "tt0053114",
  "title": "The Human Condition I: No Greater Love",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-human-condition-no-greater-love-1959ja",
      "id": "the-human-condition-no-greater-love-1959ja",
      "title": "The Human Condition No Greater Love (1959)",
      "description": "The Human Condition I: No Greater Love is a 1959 Japanese epic war drama film directed by Masaki Kobayashi. It is the first part of The Human Condition trilogy. It follows a  Japanese pacifist, unable to face the dire consequences of conscientious objection, is transformed by his attempts to compromise with the demands of war-time Japan.",
      "fileSize": 5151568311,
      "addedAt": "2026-01-07T00:12:10.588Z",
      "thumbnail": "https://archive.org/services/img/the-human-condition-no-greater-love-1959ja",
      "language": "jpn (English subtitles)",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 219
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "208 min",
    "imdbRating": 8.5,
    "imdbVotes": 10536,
    "Genre": "Drama, History, War",
    "Plot": "In the World War II, the pacifist and humanist Japanese Kaji accepts to travel with his wife Michiko to the tiny Manchurian village Loh Hu Liong to work as supervisor in an iron ore mine to avoid to be summoned to the military service. Kaji works with Okishima (Sô Yamamura) and he implements a better treatment to the laborers and improves the mine production. When the feared Kempetai (The \"Military Police Corps\", the military police arm of the Imperial Japanese Army from 1881 to 1945) brings six hundred Chinese POWs to the mine, Kaji negotiates with their leaders expecting them to control their comrades. However the methods of Kaji upset the corrupt system in the site, and the foreman Furuya (Kôji Mitsui) plots a scheme to use the naive Chen (Akira Ishihama) to turn off the electrical power of the barbwire fences to allow the prisoners to escape. When seven prisoners are falsely accused of an attempt of fleeing, a cruel Kempetai sergeant uses his sword to behead the prisoners. When Kaji protests, the POWs react sparing the lives of four prisoners but Kaji is arrested and tortured. When he is released, he is summoned to join the army and accused of being Red.",
    "Director": "Masaki Kobayashi",
    "Writer": "Zenzô Matsuyama, Masaki Kobayashi, Jumpei Gomikawa",
    "Actors": "Tatsuya Nakadai, Michiyo Aratama, Chikage Awashima",
    "Language": "Japanese, Mandarin",
    "Country": "Japan",
    "Awards": "5 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt0053140",
    "tt0134771",
    "tt0055031",
    "tt0080979",
    "tt0049302",
    "tt0056447",
    "tt0056135",
    "tt0056907",
    "tt0092978",
    "tt0052600",
    "tt0057811",
    "tt0044400"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T00:12:10.588Z"
}