{
  "movieId": "tt0042333",
  "title": "The Clouded Yellow",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/KamiliIlivyoZa",
      "id": "KamiliIlivyoZa",
      "title": "The Clouded Yellow",
      "description": "Title: The Clouded Yellow Summary: A former British agent is employed at the Fenton country estate where he aids Fenton's niece elude the police when she's unjustly accused of murdering a local gamekeeper. Directed by: Ralph Thomas Actors: Jean Simmons, Trevor Howard, Sonia Dresdel Production Company: Carillon Films Release Date: 25 December 1950 (UK) Aspect Ratio: 1.37 : 1 When Secret Service agent David Somers is fired, he takes a quiet job with the Fentons at their country estate - cataloging butterflies, hence the title insect. David grows fond of Jess Fenton's niece, a fragile, fey young woman named Sophie. Because he hates traps of any kind, he reacts quickly when Sophie is framed for the murder of Hick, the nasty handyman. He helps her escape London by using his agent's skills and a network of old friends. The pair lead the police and David's ex-employers an exciting chase, from Newcastle to the Lake District to Liverpool. As the fugitives try to catch a ship for France, everyone, including the murderer, join in the finale.",
      "fileSize": 691146338,
      "addedAt": "2026-01-07T00:06:30.621Z",
      "thumbnail": "https://archive.org/services/img/KamiliIlivyoZa",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 4945
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/clouded-yellow-1950",
      "id": "clouded-yellow-1950",
      "title": "The Clouded Yellow 1950 colorized (Jean Simmons, Trevor Howard)",
      "description": "A former British secret agent, who has gotten a quiet job cataloguing butterfies for the Fentons at their country estate, falls in love with their niece. So when she is framed for the murder of their groundskeeper, he helps her escape by using the skills and contacts from his years as a spy. They are hotly pursued by both the police and the real murderer. Jean Simmons as Sophie Malraux Trevor Howard as Maj. David Somers Sonia Dresdel as Jess Fenton Barry Jones as Nicholas Fenton Kenneth More as Willy Shepley Geoffrey Keen as Police Inspector André Morell as Secret Service Chief Chubb I colorized this using AI software that doesn't always get the colors right, but I think it looks fairly natural. Hopefully a more professional job will be done someday.",
      "fileSize": 757876601,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/clouded-yellow-1950",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 3687
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "95 min",
    "imdbRating": 6.9,
    "imdbVotes": 956,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "After Secret Service agent David Somers is fired, he takes a quiet job with the Fentons at their country estate - cataloging butterflies, hence the title insect. David grows fond of Jess Fenton's niece, a fragile, fey young woman named Sophie. Because he hates traps of any kind, he reacts quickly after Sophie is framed for the murder of Hick, the nasty handyman. He helps her escape London by using his agent's skills and a network of old friends. The pair lead the police and David's ex-employers an exciting chase, from Newcastle to the Lake District to Liverpool. As the fugitives try to catch a ship for France, everyone, including the murderer, join in the finale.",
    "Director": "Ralph Thomas",
    "Writer": "Janet Green",
    "Actors": "Jean Simmons, Trevor Howard, Sonia Dresdel",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0044128",
    "tt0044928",
    "tt0042724",
    "tt0041699",
    "tt0043782",
    "tt0041095",
    "tt0044314",
    "tt0044673",
    "tt0045256",
    "tt0201074",
    "tt0040687",
    "tt0040799"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T19:12:25.880Z"
}