{
  "imdbId": "tt0062645",
  "title": "Beyond the Law",
  "year": 1968,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/beyond.-the.-law.-1968",
      "id": "beyond.-the.-law.-1968",
      "title": "Beyond the Law (1968)",
      "description": "\"Beyond the Law\" is a 1968 Spaghetti Western film directed by Giorgio Stegani, featuring Lee Van Cleef as a bandit who becomes a sheriff after robbing a stagecoach carrying miners' wages. The film explores themes of loyalty and morality as the protagonist navigates his conflicting roles as a criminal and a lawman.",
      "fileSize": 1076586651,
      "addedAt": "2026-01-07T00:07:38.716Z",
      "thumbnail": "https://archive.org/services/img/beyond.-the.-law.-1968",
      "language": "eng",
      "year": 1968,
      "collection": "feature_films",
      "downloads": 150
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "90 min",
    "imdbRating": 6.1,
    "imdbVotes": 1525,
    "Genre": "Western",
    "Plot": "After the Civil War, a trio of drifters find an ingenious way of stealing a mine's payroll from a moving stagecoach. The payroll belongs to the silver mine in Silvertown. The three drifter thieves are Billy Joe Cuddler, Preacher and his assistant, an African-American demobilized soldier. The payroll is in the care of mine engineer Ben Novack who just arrived from Europe and must report for work at the mine in Silvertown. After the theft of the payroll is discovered at the stagecoach's arrival in Silvertown, everyone is puzzled about its disappearance but the money is insured and a replacement payroll is sent for. After grumbling about the delay in receiving their wages, the miners return to work. However, the mine owner, James Cooper, orders Ben Novack to work with town sheriff John Ferguson in finding the culprits. Happy at not being suspected of theft, Billy Joe Cuddler and his two pals plan another payroll theft. They also plan to steal the mine's silver shipment en route to the federal silver depository. In the meantime, the three drifter pals ingratiate themselves with the townsfolk. They even become heroes of sorts when they save the stagecoach from an attack by a numerous gang of bandits led by notorious cut-throat outlaw Burton. When Sheriff John Ferguson is wounded during the attack, drifter Billy Joe Cuddler is asked to temporarily fill-in the job of lawman, to the surprise and amusement of his two pals. Billy Joe Cuddler becomes temporary sheriff but he still plans to steal the next mine payroll and the mine's silver shipment at the first opportunity. Unknown to all of them is the fact that outlaw Burton and his gang plan to attack the town in force during the upcoming town fiesta and seize the mine's silver shipment.",
    "Director": "Giorgio Stegani",
    "Writer": "Warren Kiefer, Mino Roli, Giorgio Stegani",
    "Actors": "Lee Van Cleef, Antonio Sabato, Lionel Stander",
    "Language": "Italian",
    "Country": "Italy, West Germany, Monaco",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0063008",
    "tt0060067",
    "tt0061709",
    "tt0064208",
    "tt0063501",
    "tt0065451",
    "tt0061981",
    "tt0062825",
    "tt0198859",
    "tt0063557",
    "tt0065032",
    "tt0063032"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.716Z"
}