{
  "imdbId": "tt0009659",
  "title": "The Stranger",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-stranger",
      "id": "silent-the-stranger",
      "title": "The Stranger",
      "fileSize": 344120133,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-stranger",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 255
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "20 min",
    "imdbRating": 5.9,
    "imdbVotes": 28,
    "Genre": "Short, Comedy, Western",
    "Plot": "After a luckless prospecting trip, Billy starts homeward across the desert, mounted on his little burro with his pick, shovel and pack strapped up behind him. Finally he comes in sight of Red Dog Gulch and, hungry and thirsty, he pushes on toward the city. Susie is the daughter of the town drunkard. She starts out on her horse for a little ride, and a little way from town is attacked by Pedro and Little Casino, two Mexicans, who try to steal her horse. Billy happens along, runs the Mexicans off and takes Susie back to town. Arriving in town, Billy's first thought is for food. Being without a cent, he hocks the burro in the local pawnshop and goes at once to the restaurant, where he orders a large feed. In the midst of his dinner, he remembers the burro, and knowing that he must be hungry, too, Billy gathers the rest of his dinner and goes to feed his little pal. The pawnshop is closed for the night, and Billy breaks in a window and feeds the burro. He is discovered by the pawnbroker and arrested for burglary, though with Susie to vouch for him, the court soon releases him. Billy then wanders into the main saloon, gambling room, dance hall, where he has many exciting adventures with the roulette wheels with a dance-hall vampire and with the local bad man. He finally gets into such a mess that he is forced to run for his life. He breaks into the pawnshop again and steals his burro out to escape on. Then with most of the town in pursuit, he starts out across the desert. Meanwhile, Oliver, who is the owner of the saloon, has been making love to Susie, who resents it and will have nothing to do with him. Oliver then engages Pedro and Little Casino to kidnap the girl. They do, and are just taking her to their den in the mountains when Billy, in trying to escape from the posse, blunders into them and makes the capture. The posse arrives, bent on hanging Billy, but when they find that he has rescued the pet of the town, they give him three cheers and hang the Mexicans instead. Billy then beats up Oliver for his share in the proceedings, and Susie rewards him in the best approved style.",
    "Director": "Arvid E. Gillstrom",
    "Writer": "Rex Taylor",
    "Actors": "Billy West, Leatrice Joy, Bud Ross",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0009558",
    "tt0006796",
    "tt0009764",
    "tt0009466",
    "tt0009732",
    "tt0009932",
    "tt0006801",
    "tt0006913",
    "tt0251116",
    "tt0012543",
    "tt0003943",
    "tt0013158"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}