{
  "imdbId": "tt0005044",
  "title": "By the Sea",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ByTheSea_201501",
      "title": "Charlie Chaplin's \"By the Sea\" (1915)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"By the Sea\" is one of Charlie Chaplin's Essanay short comedies, featuring Edna Purviance, a star of Silent Hall of Fame. Directed by               Charlie Chaplin Produced by             Essanay Film Manufacturing Company Scenario by                Charlie Chaplin      Starring                     Charlie Chaplin, Edna Purviance, Bud Jamison Cinematography        Harry Ensign Distributed by           General Film Company Release date               April 29, 1915 Running time             14 min. Country                      United States Language                    Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "id": "ByTheSea_201501"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/by-the-sea-1915-directed-by-charlie-chaplin",
      "title": "By The Sea (1915) Directed By Charlie Chaplin",
      "description": "By the Sea Theatrical release poster to By the Sea Directed by Charlie Chaplin Written by Charlie Chaplin Produced by Jess Robbins Starring Charlie Chaplin Billy Armstrong Margie Reiger Bud Jamison Edna Purviance Paddy McGuire Cinematography Harry Ensign Edited by Charlie Chaplin Distributed by General Film Company Release date April 29, 1915 Running time 20 minutes Country United States Language Silent (English intertitles ) By the Sea is a 1915 American silent comedy film Charlie Chaplin made while waiting for a studio to work in Los Angeles . He had just left Niles Essanay Studio after doing five films at that location. By the Sea was filmed all on location in Santa Monica on the beach near Ocean Park Pier and on Crystal Pier in April 1915. The story centers on Charlie's Little Tramp character and how he gets into trouble trying to grab the attention of women on the beach. Edna Purviance plays one of the wives in whom he shows interest. It is said to be the first film to incorporate the classic gag of a man slipping on a banana skin. Synopsis The film starts with a drunk being told to stay where he is by his wife. Charlie enters about thirty seconds into the film, eating a banana while wandering along the seashore on the Crystal Pier. He nonchalantly throws the banana peel away and quickly slips on it. Shortly thereafter Charlie encounters the aforementioned drunk. Heavy wind blows off their hats and results in confusion as to whose hat is whose. Chaplin mixes up the drunk's white hat with his own bowler hat, and they fight and kick over the issue. They run to the beach, where they collide with each other, and the drunk seems to have won the fight when he grab Charlie by the neck. However, Charlie makes a clever comeback by kicking the drunk over. Another fight ensues, where Charlie tears up his adversary's hat and another battle ensues. Charlie makes a hasty escape to a nearby pole holding a lifebelt , where he challenges the drunk. The man's drunkenness gets the better of him, and he barely manages to stand. After a mini-fight, Charlie knocks him out. To appear less conspicuous, he pretends the man is his friend, ruffling up his hair and grinning at the passers-by, all the while punching him discreetly. Just then, the wife of a dandy, played by Edna Purviance, passes Charlie and the drunk. She sees what Charlie has done to him. Charlie plays along, soon forgetting about Edna's husband and sitting on him multiple times. However, the knocked-out man could not take Charlie's weight, and eventually, gave way, making Charlie fall down and raising a few chuckles from Edna and a six-foot dandy. The drunk recovers, and when he realising what Charlie had done to him, is understandably furious. The fight is on the brink of escalation when a policeman comes. However, in spite of his presence, the fight escalates, and a poorly-aimed punch by the drunk hits the policeman in the face, knocking him out. Soon, they become weary of fighting and decide to be pals. They agree to have ice cream cones together. However, an argument ensues over which man will pay for them. Their battle restarts. They smear the ice cream over each other's face, and that soon blows over to a full-fledged fight again. The dandy keeps chuckling and goes over closer to see the fight in detail. However, that, he soon realizes, was a false move, because the drunk, originally intending to throw his ice-cream (well, what was left of it, anyway!) at Charlie, aims poorly, and thus, throws his cone over the six-foot dandy. A second battle begins but Charlie slips away and starts flirting with the dandy's wife. The dandy recognizes Charlie when he comes back, however, and, his blood boiling, sits down on the bench. Charlie hurriedly scuttles away - towards his drunk adversary, where he was fighting the policeman. However, the drunk recognizes him, and runs after him. Charlie sits himself on a bench on the beach where the drunk's wife from the first scene is waiting. He is soon surrounded by his enemies: the drunk who wants to continue the fight, the angry dandy, and the dandy's wife. Thinking fast, Charlie cleverly tips the bench backwards, toppling everyone and allowing himself to hastily escape. Location The movie was the first of Chaplin's Essanay films to be shot in southern California. At Chaplin's insistence, all his remaining Essanay films were made there in the rented Majestic Studios. Chaplin had found the facilities at the Essanay Studios in Niles, California to be unsatisfactory. Review A reviewer from the British film periodical Bioscope wrote, \"More irresistible absurdities by the inimitable Charles, with the broad Pacific Ocean as a background. Chaplin's humor needs neither description nor recommendation.\" Cast Charlie Chaplin as the tramp Billy Armstrong as the man in straw hat Margie Reiger as Man in straw hat's wife Bud Jamison as Man in top hat Edna Purviance as Man in top hat's sweetheart Paddy McGuire as First cop Ernest Van Pelt as Second cop From Wikipedia, the free encyclopedia",
      "id": "by-the-sea-1915-directed-by-charlie-chaplin"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/by-the-sea-1915_202304",
      "title": "By The Sea (1915)",
      "description": "By the Sea is a 1915 American silent comedy film Charlie Chaplin made while waiting for a studio to work in Los Angeles. He had just left Niles Essanay Studio after doing five films at that location. By the Sea was filmed all on location at Crystal Pier in April 1915. The story centers on Charlie’s Little Tramp character and how he gets into trouble trying to grab the attention of women on the beach. Edna Purviance plays one of the wives in whom he shows interest. Watch on RetroFlix.org:  https://retroflix.org/by-the-sea-1915/",
      "id": "by-the-sea-1915_202304"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-by-the-sea",
      "title": "By the Sea",
      "id": "silent-by-the-sea"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "20 min",
    "imdbRating": "5.7",
    "imdbVotes": "1,967",
    "Genre": "Short, Comedy",
    "Plot": "Charles Chaplin, with his big feet performing their usual mirth-provoking perambulations, wanders down to the sea shore. There is some wind blowing, so Chaplin anchors his hat to his head with a cable. He meets a pedestrian whose hat is similarly attached. The two bump, their hats fly off and they scramble for them. When the hats finally are recovered, each has the wrong one. This causes considerable embarrassment when the two cables go taut as the two men separate. Anger soon takes the place of embarrassment when the cables become hopelessly entangled, and they battle all over the beach. After they have fought themselves weary, they shake hands and decide to have a drink. They get ice cream cones and each insists the other have the honor of paying for them. This is unsatisfactory to the drug clerk and another row starts. They smear each other with ice cream and incidentally bespatter a six-foot dandy, which precipitates still more trouble. While the battle is still in progress Chaplin leaves his new-found pal in the lurch and slips off to flirt with the sweetheart of the dandy. His perfidy is discovered, however, and the result would stir the risibilities of the most forlorn gloom.",
    "Director": "Charles Chaplin",
    "Writer": "Charles Chaplin",
    "Actors": "Charles Chaplin, Billy Armstrong, Ed Armstrong",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0004936",
      "title": "The Bank",
      "year": 1915,
      "imdbRating": "6.6",
      "imdbVotes": "2,325",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006309",
      "title": "A Woman",
      "year": 1915,
      "imdbRating": "6.4",
      "imdbVotes": "1,990",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005489",
      "title": "His New Job",
      "year": 1915,
      "imdbRating": "6.0",
      "imdbVotes": "2,089",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005542",
      "title": "In the Park",
      "year": 1915,
      "imdbRating": "5.6",
      "imdbVotes": "1,782",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006313",
      "title": "Work",
      "year": 1915,
      "imdbRating": "6.2",
      "imdbVotes": "1,891",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006177",
      "title": "The Tramp",
      "year": 1915,
      "imdbRating": "6.9",
      "imdbVotes": "3,953",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006032",
      "title": "Shanghaied",
      "year": 1915,
      "imdbRating": "6.1",
      "imdbVotes": "1,732",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005812",
      "title": "A Night in the Show",
      "year": 1915,
      "imdbRating": "6.4",
      "imdbVotes": "2,446",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005571",
      "title": "A Jitney Elopement",
      "year": 1915,
      "imdbRating": "5.9",
      "imdbVotes": "1,464",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005810",
      "title": "A Night Out",
      "year": 1915,
      "imdbRating": "5.9",
      "imdbVotes": "1,915",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0005074",
      "title": "The Champion",
      "year": 1915,
      "imdbRating": "6.7",
      "imdbVotes": "2,846",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0006414",
      "title": "Behind the Screen",
      "year": 1916,
      "imdbRating": "6.9",
      "imdbVotes": "3,173",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}