{
  "imdbId": "tt0047898",
  "title": "Bride of the Monster",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=p41kESTMp54",
      "id": "p41kESTMp54",
      "title": "Bride of the Monster (1955) Bela Lugosi, Tor Johnson | Colorized Movie | Horror, Sci-Fi | Subtitles",
      "description": "A mad doctor attempts to create atomic supermen.\nRumours abound about what may go on at a creepy mansion just out of town... The house is owned by Dr. Eric Vornoff who is conducting experiments to turn people into super-beings through the use of atomic power. Reporter Janet Lawton decides to look into what is going there and its possible connection to men that have disappeared in the area. When Vornoff takes her prisoner, he has definite plans for her.\n\nOriginal title: Bride of the Monster AKA The Atomic Monster / Bride of the Atom \n\n\nBlack and white version: https://youtu.be/M0sjBKTUSp8\n\nDirector: Edward D. Wood Jr.\nWriters: Edward D. Wood Jr., Alex Gordon\nStars: Bela Lugosi, Tor Johnson, Tony McCoy, Loretta King\nGenres: B Movie, Horror, Sci-Fi, Psychotronic film\n\n00:00 Full length movie.\n01:40 A group seeks shelter in a mysterious deserted house during a storm, encountering a mad scientist experimenting on humans.\n07:05 Guest of Dr Eric Vornnoff.\n12:25 Discussion on disappearances at Lake Marsh leads to debate over existence of monsters.\n20:45 Investigation into mysterious disappearances linked to Loch Ness monster theory.\n22:06 Mysterious events unfold in a swamp as characters search for missing individuals.\n38:55 A scientist named Vornoff conducts controversial experiments in atomic energy, creating super beings against societal norms.\n00:39:12 Strowski & Vornoff.\n41:45 A scientist plans to create a race of supermen to conquer the world, using human experimentation.\n49:29 A ravishing bride.\n53:29 A scientist conducts dangerous experiments, leading to chaos and destruction in a horror sci-fi movie.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYT_Zk0DHuuOUVtCef1TewS\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:43:11.703Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/p41kESTMp54/maxresdefault.webp?v=64438795",
      "duration": 4121,
      "language": "en",
      "year": 1955,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "69 min",
    "imdbRating": 4.1,
    "imdbVotes": 7816,
    "Genre": "Horror, Sci-Fi",
    "Plot": "Rumours abound about what may go on at a creepy mansion just out of town. The house is owned by Dr. Eric Vornoff who is conducting experiments to turn people into super-beings through the use of atomic power. Reporter Janet Lawton decides to look into what is going there and its possible connection to men that have disappeared in the area. When Vornoff takes her prisoner, he has definite plans for her.",
    "Director": "Edward D. Wood Jr.",
    "Writer": "Edward D. Wood Jr., Alex Gordon",
    "Actors": "Bela Lugosi, Tor Johnson, Tony McCoy",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0052077",
    "tt0045826",
    "tt35667868",
    "tt0048127",
    "tt0048215",
    "tt0049615",
    "tt0048256",
    "tt0048554",
    "tt0048696",
    "tt0049646",
    "tt0044406",
    "tt0047149"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:49:35.308Z"
}