{
  "imdbId": "tt0016548",
  "title": "A Woman of the World",
  "year": 1925,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ohgZEAU1Owg",
      "title": "A Woman of the World (1925) | Colorized Public Domain Silent Drama Comedy with Pola Negri",
      "description": "A Woman of the World (1925) is a silent drama-comedy directed by Malcolm St. Clair and produced by Famous Players–Lasky Corporation, released through Paramount Pictures. This restored and colorized public domain edition brings new life to one of Pola Negri’s most fascinating Hollywood roles. Known as one of the great European stars of the silent era, Negri transitioned into American cinema with her unique blend of exotic allure, dramatic depth, and comedic timing. This film captures her in a story that explores cultural clashes, morality, and romance in small-town America. By presenting the movie in color, Colorized Public Domain ensures modern audiences across the United States, Europe, and beyond can rediscover this forgotten gem of 1920s cinema.\n\nPlot Summary:\nThe story follows Countess Natatorini (Pola Negri), a worldly European aristocrat who travels to a conservative small town in the American Midwest to recover from heartbreak. Her sophistication and liberated ways immediately clash with the town’s rigid morals and gossiping residents. She smokes, wears daring fashions, and shocks the locals with her unapologetic confidence.\n\nThe Countess’s presence disrupts the quiet community, attracting admiration from some and scandal from others. She soon encounters Attorney Gareth Johns (Holmes Herbert), a stern and judgmental man who initially condemns her lifestyle. As they spend more time together, however, his disapproval gives way to respect and affection. Their relationship forces both to confront prejudice, cultural differences, and the possibility of love that transcends societal expectations.\n\nCast and Crew:\n• Director: Malcolm St. Clair\n• Producer: Adolph Zukor\n• Writers: Forrest Halsey (story), Walter Woods (scenario)\n• Cinematography: Bert Glennon\nStarring:\n• Pola Negri as Countess Natatorini\n• Holmes Herbert as Gareth Johns\n• Chester Conklin as Tobby\n• Clarence Burton as Horace\n• May Foster as Aunt Emma\n• Lucien Littlefield as Uncle John\n\nFilm Significance:\nA Woman of the World highlights Pola Negri’s ability to combine sophistication with charm, bringing European elegance to American silent screens. At a time when cinema often explored moral conflicts, this film offered commentary on cultural differences between Old World aristocracy and small-town America’s strict values. Its mix of humor, drama, and romance made it a showcase for Negri’s versatility. Today, it remains an important example of how Hollywood used international stars to appeal to both domestic and global audiences.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like A Woman of the World remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1925 release was a black-and-white silent feature. While groundbreaking at the time, silent films are often overlooked by modern viewers, particularly those watching on TV or streaming devices. By colorizing A Woman of the World, we highlight Pola Negri’s screen presence in a way that resonates with contemporary audiences. For older viewers in the United States and Europe, this edition offers nostalgia for silent-era artistry. For new audiences, it provides a more accessible entry point into early Hollywood’s fascinating history.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including silent dramas, comedies, and internationally significant works. Our goal is to keep these treasures discoverable, enjoyable, and preserved for audiences worldwide.\n\n#AWomanOfTheWorld #PolaNegri #SilentFilm #PublicDomainMovie #ColorizedClassic #1920sCinema #SilentDrama #SilentComedy #ClassicMovies #FilmRestoration",
      "id": "ohgZEAU1Owg",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-woman-of-the-world",
      "title": "A Woman of the World",
      "fileSize": 1549556280,
      "id": "silent-a-woman-of-the-world"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/woman-of-the-world-una-mujer-de-mundo-1925-ee.-uu.-malcom-st.-clair.-j-an-dung-gqea",
      "title": "Woman Of The World (1925)",
      "description": "A European countess, after being betrayed by her lover, goes to live in small town Middle America with her cousins and causes havoc among the rather puritanical community members.",
      "fileSize": 902688465,
      "id": "woman-of-the-world-una-mujer-de-mundo-1925-ee.-uu.-malcom-st.-clair.-j-an-dung-gqea"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/womantheworld4k",
      "title": "A Woman Of The World (1925) [Colorized, 4K, 60FPS]",
      "description": "A Woman Of The World is a 1925 black and white movie film which has been colorised, upscaled to 4K, and frames per second boosted to 60 FPS in 2022 using Artificial Intelligence (A.I) and Google Colab @  https://colab.research.google.com   Technologies used: A.I. Colorizing:  https://github.com/jantic/DeOldify  A.I. Increasing frame rate 60 FPS:  https://rife-vfi.github.io   A.I. Upscaling to 4K:  https://ffmpeg.org   GPU: Google Colab. This movie is in public domain category and it is Copyright free.",
      "fileSize": 4757643459,
      "id": "womantheworld4k"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-woman-of-the-world-1925-colorized-movie-576p-sd",
      "title": "A Woman of the World (restored, colorized) (1925, drama, imdb score: 6.9)",
      "description": "A Woman of the World is a 1925 American silent comedy-drama film starring Pola Negri , directed by Mal St. Clair , produced by Famous Players–Lasky , and distributed by Paramount Pictures .",
      "fileSize": 836006887,
      "id": "a-woman-of-the-world-1925-colorized-movie-576p-sd"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "70 min",
    "imdbRating": 6.8,
    "imdbVotes": 189,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "A sensual European countess arrives at a small American town where she quickly provokes moral outrage from the community. Upon arriving, even before she steps out of her taxi a district attorney informs her that loose women aren't welcome here. Donning a cigarette holder she explains with a seductive smile that she comes from Italy and asks for directions to her cousins château. The femme fatales exploits include drinking, smoking in public, enticing men, wearing extravagant garments and boasting a tattoo of a skull on her forearm.",
    "Director": "Malcolm St. Clair",
    "Writer": "Malcolm Stuart Boylan, Pierre Collings, Carl Van Vechten",
    "Actors": "Pola Negri, Charles Emmett Mack, Holmes Herbert",
    "Language": "None",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0016251",
      "title": "Proud Flesh",
      "year": 1925,
      "imdbRating": 5.1,
      "imdbVotes": 215,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018471",
      "title": "Tell It to the Marines",
      "year": 1926,
      "imdbRating": 7.1,
      "imdbVotes": 1677,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011960",
      "title": "The Wildcat",
      "year": 1921,
      "imdbRating": 6.9,
      "imdbVotes": 1336,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012122",
      "title": "Dream Street",
      "year": 1921,
      "imdbRating": 5.5,
      "imdbVotes": 205,
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018297",
      "title": "Quality Street",
      "year": 1927,
      "imdbRating": 6.6,
      "imdbVotes": 803,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0014497",
      "title": "Souls for Sale",
      "year": 1923,
      "imdbRating": 7,
      "imdbVotes": 1133,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020809",
      "title": "Dangerous Nan McGrew",
      "year": 1930,
      "imdbRating": 4.7,
      "imdbVotes": 80,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0015577",
      "title": "Are Parents People?",
      "year": 1925,
      "imdbRating": 6.6,
      "imdbVotes": 80,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0012928",
      "title": "Beauty's Worth",
      "year": 1922,
      "imdbRating": 6.4,
      "imdbVotes": 911,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019067",
      "title": "A Lady of Chance",
      "year": 1928,
      "imdbRating": 6.9,
      "imdbVotes": 547,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019109",
      "title": "Lonesome",
      "year": 1928,
      "imdbRating": 7.7,
      "imdbVotes": 2694,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019258",
      "title": "The Patsy",
      "year": 1928,
      "imdbRating": 7.5,
      "imdbVotes": 2728,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:45:36.716Z"
}