{
  "imdbId": "tt0041431",
  "title": "The Green Promise",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Green_Promise",
      "id": "The_Green_Promise",
      "title": "The Green Promise",
      "description": "Walter Brennan plays the part of a father raising four children, but has his own ideas about how to run a farm.",
      "fileSize": 2113014239,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Green_Promise",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 78462
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9XcQKdIkRY8",
      "id": "9XcQKdIkRY8",
      "title": "The Green Promise (1949) | Colorized Public Domain Classic Drama with Natalie Wood & Walter Brennan",
      "description": "The Green Promise (1949) is an American drama film directed by William D. Russell, produced by Monte Collins, and distributed by RKO Radio Pictures. This restored and colorized public domain classic revives a forgotten yet emotionally powerful story of rural life, resilience, and the struggles between tradition and modernity. With strong performances from Walter Brennan and an early appearance by Natalie Wood, the film delivers both nostalgic charm and timeless themes. By presenting this film in color, Colorized Public Domain ensures that today’s audiences in the United States, Europe, and worldwide can rediscover this cinematic treasure in an engaging, modern format.\n\nPlot Summary:\nSet in post-war rural America, The Green Promise follows Matthew Conlon (Walter Brennan), a stubborn widowed farmer determined to raise his four children in line with his own values of self-reliance and tradition. Among them is Susan Conlon (Marguerite Chapman), his eldest daughter, who balances her duty to the family with her own aspirations. The arrival of a progressive agricultural agent, David Barkley (Robert Paige), introduces tension as he encourages the Conlon family to adopt new farming methods that clash with Matthew’s old-fashioned ways.\n\nThe heart of the story lies with young Susan and her siblings, including the youngest daughter played by Natalie Wood in one of her earliest film roles. The children, particularly Wood’s character, yearn for hope, growth, and a better life beyond the confines of their father’s rigidity. Central to the film is the “green promise” itself — a symbolic pledge made during a 4-H Club ceremony that represents the children’s dreams for the future. When tragedy and challenges strike, Matthew must confront the limits of his authority and recognize the importance of change, compromise, and love in holding his family together.\n\nCast and Crew:\n• Director: William D. Russell\n• Producer: Monte Collins\n• Screenplay: Monte Collins, Robert Blees\n• Cinematography: Harry Neumann\n• Editing: William F. Claxton\n• Distributor: RKO Radio Pictures\n\nStarring:\n• Walter Brennan as Matthew Conlon\n• Marguerite Chapman as Susan Conlon\n• Robert Paige as David Barkley\n• Natalie Wood as Susan’s younger sister\n• Ted Donaldson as Phineas Conlon\n• Connie Marshall as Deborah Conlon\n• Erin O’Brien-Moore as Mrs. Barkley\n\nFilm Significance:\nThe Green Promise is remembered not only for its themes of family resilience and the clash between tradition and modernity, but also for featuring Natalie Wood in an early role before her rise to stardom in classics like Rebel Without a Cause (1955) and West Side Story (1961). Walter Brennan’s performance adds gravitas, capturing the stubborn pride and vulnerability of a man trying to balance family, tradition, and progress. Although not a major box office hit at its release, the film stands as a cultural snapshot of late 1940s American life and remains valuable today as both entertainment and historical record.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like The Green Promise remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1949 release was filmed in black and white, typical of modestly budgeted productions of its era. While historically authentic, black-and-white films are often ignored by modern audiences. By offering a colorized version, we preserve the original performances while making the story visually appealing to contemporary viewers accustomed to color media. This color restoration bridges the gap between classic film preservation and modern entertainment standards.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of Hollywood — from forgotten gems to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#TheGreenPromise #NatalieWood #WalterBrennan #1940sDrama #ClassicHollywood #PublicDomainMovie #ColorizedClassic #RuralDrama #FilmRestoration #GoldenAgeCinema #1949Movies",
      "addedAt": "2025-12-24T00:47:25.222Z",
      "thumbnail": "https://i.ytimg.com/vi/9XcQKdIkRY8/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYPiBQKGUwDw==&rs=AOn4CLCTFOLel99mjzHRzWx7j0qXDZxQag",
      "duration": 5554,
      "language": "en",
      "year": 1949,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8_dt3jBVohY",
      "id": "8_dt3jBVohY",
      "title": "The Green Promise (1949) NATALIE WOOD",
      "description": "A CLASSIC TIME CAPSULE OF THE AMERICAN SPIRIT\nStars: Walter Brennan, Marguerite Chapman, Natalie Wood\nDirector: William D. Russell\n\nFollowing the ecological demise of his last farm, an aging widower buys a new farm but refuses the advice of his four children to adapt to modern ways. An adorable Natalie Wood, just 2 years after her unforgettable performance in \"Miracle on 34th Street,\" steals almost scene as the youngest daughter who believes the 4-H club will be their salvation.",
      "addedAt": "2025-12-24T01:09:24.964Z",
      "thumbnail": "https://i.ytimg.com/vi/8_dt3jBVohY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBtTBtjurBvsLz3IrC6skKQ_bHT9Q",
      "duration": 5644,
      "language": "en",
      "year": 1949,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-green-promise-1949_202508",
      "id": "the-green-promise-1949_202508",
      "title": "The Green Promise (1949)",
      "description": "A stubborn farmer is raising his children alone. When his oldest daughter gets a suitor, the father nearly goes on the rampage, but he is forced to change his tune when he is injured, leaving her in charge of the farm. Watch on RetroFlix:  https://retroflix.org/the-green-promise-1949/",
      "fileSize": 1068577580,
      "addedAt": "2026-01-07T00:12:10.587Z",
      "thumbnail": "https://archive.org/services/img/the-green-promise-1949_202508",
      "language": "eng",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 124
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "93 min",
    "imdbRating": 6.5,
    "imdbVotes": 746,
    "Genre": "Drama",
    "Plot": "Widowed Old Man Matthews, who has lived his entire life as a farmer, has moved his family of himself and his four young adult to adolescent offspring - Deborah, Phineas, Abigail and Susan - to a just purchased farm in Millwood, following the ecological demise of their last farm on which he was able to collect insurance. He has a \"my way or the high way\" mentality about most things in life, most specifically about running a farm, he believing his experience trumping everything else. He, however, likes to portray himself as being fair and democratic, all important family matters which are decided on by a family vote. He has these votes as he and the other family members know that Abby and Phin will always vote with him, the former to retain his favor and the latter out of fear regardless of Phin's true thoughts as their father always convinces out of coercion. Such ideas against his include Debbie believing the farm too expensive for the many deficiencies it has, and Susie wanting a few dollars to purchase two lambs to raise as something all her own, her father who characterizes her wants as selfish in light of his want to buy a tractor as oppose to renting one with less money. David Barkley, the local agricultural county agent, tries to advise Matthews about certain aspects of the farm, from dealing with the different climate compared to their former farm site, to topographical and geological issues, all that advice falling on Matthews' deaf ears. David also becomes Susie's ally as he is a supporter of and adviser for the local 4H club, the lamb project which would be a perfect fit if Susie were to become a member, which she desperately wants. David and Debbie, who have an unspoken attraction for each other, try to do whatever they can to make a go of the farm despite Matthews' actions, and before those actions irreparably damage the land and/or worse kill someone.",
    "Director": "William D. Russell",
    "Writer": "Monte Collins",
    "Actors": "Marguerite Chapman, Walter Brennan, Robert Paige",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040762",
    "tt0041187",
    "tt0043017",
    "tt0039341",
    "tt0039386",
    "tt0039325",
    "tt0041503",
    "tt0041109",
    "tt0041125",
    "tt0041221",
    "tt0041239",
    "tt0041113"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.587Z"
}