{
  "imdbId": "tt0000938",
  "title": "The Little Darling",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheLittleDarling",
      "id": "TheLittleDarling",
      "title": "\"The Little Darling\" (1909) director D. W. Griffith, cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     \"The Little Darling\" is a very short comedy directed by D.W. Griffith.  The film is included in our program to illustrate the work of two of our stars: actor Arthur Johnson and cinematographer Billy Bitzer. A bunch of bachelors in a boarding house receive the news that a little girl will pay a visit.  However, after all buy toys, they get a big surprise. Directed by                       D.W. Griffith Cinematography by         Billy Bitzer Starring                             Mary Pickford, Mack Sennett, Arthur V. Johnson Distributed by                   Biograph Company Release date                      September 2, 1909 Country                             United States Running time                    2 m. 22 s. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 42550759,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheLittleDarling",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 2199
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "2 min",
    "imdbRating": 4.6,
    "imdbVotes": 197,
    "Genre": "Short, Comedy",
    "Plot": "This might be termed a comedy of errors, for the overzealousness of a lot of good-hearted simple folks places them in a rather embarrassing position. Lillie Green, who keeps a boarding house, receives a letter from her old school chum, Polly Brown, whom sin hasn't seen in years, to the effect that as Lillie has never seen her little darling daughter, she will send her for a few days' visit, asking that someone meet the child at the 3:40 train. Lillie's boarders are a bunch of kind-hearted bachelors, who at once prepare to give the \"Little Darling\" the time of her life, buying a load of toys, etc., for her amusement, also procuring a baby carriage with which to meet her at the train. You may imagine their embarrassment when they find that Tootsie, instead of being a baby, proves to be a handsome young lady of seventeen, whose tastes run rather to garden gates, shady lanes and quiet nooks, than toys.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "Mary Pickford, Charles Avery, Verner Clarges",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000877",
    "tt0000800",
    "tt0001333",
    "tt0001458",
    "tt0001062",
    "tt0001002",
    "tt0000892",
    "tt0000878",
    "tt0000922",
    "tt0000946",
    "tt0001000",
    "tt0000841"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}