{
  "movieId": "tt0033061",
  "title": "Slap Happy Pappy",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/slap-happy-pappy-1940",
      "id": "slap-happy-pappy-1940",
      "title": "Slap Happy Pappy (1940)",
      "description": "Porky runs a farm; we see him plowing the fields. But it's primarily a poultry farm; as the sign says, \"For sale: Miracle eggs if it's a good egg, it's a miracle.\" A rabbit, doing a  Jack Benny  impression (Jack Bunny), paints and inspects eggs. He starts to smash and reject a black egg, but it hatches into a black baby bird doing a Rochester impression. We next visit the Eddie Cackler family, ( Eddie Cantor ) who have been trying without success to have a son; the next five eggs hatch, and they are again all girls. A  Bing Crosby  lookalike comes by with a stroller full of sons, and Eddie asks for his secret; he demonstrates by crooning to a chick, who lays dozens of eggs with boys names on them. Eddie croons to his wife, but in a higher pitch, then dances out singing the theme song to other caricatures. The egg hatches, but in answer to Eddie's question, is it really a boy? \"Mmmm... could be.\" This is a Computer Colorized version from 1995.",
      "fileSize": 813274893,
      "addedAt": "2026-01-07T00:11:24.929Z",
      "thumbnail": "https://archive.org/services/img/slap-happy-pappy-1940",
      "language": "eng",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 315
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 6.3,
    "imdbVotes": 206,
    "Genre": "Animation, Family, Short",
    "Plot": "Porky runs a farm; we see him plowing the fields. But it's primarily a poultry farm; as the sign says, \"For sale: Miracle eggs if it's a good egg, it's a miracle.\" A rabbit, doing a Jack Benny impression (Jack Bunny), paints and inspects eggs. He starts to smash and reject a black egg, but it hatches into a black baby bird doing a Rochester impression. We next visit the Eddie Cackler family, (Eddie Cantor) who have been trying without success to have a son; the next five eggs hatch, and they are again all girls. A Bing Crosby lookalike comes by with a stroller full of sons, and Eddie asks for his secret; he demonstrates by crooning to a chick, who lays dozens of eggs with boys names on them. Eddie croons to his wife, but in a higher pitch, then dances out singing the theme song to other caricatures. The egg hatches, but in answer to Eddie's question, is it really a boy? \"Mmmm... could be.\"",
    "Director": "Robert Clampett",
    "Writer": "Warren Foster",
    "Actors": "Mel Blanc, Kay Kyser, Jack Lescoulie",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032190",
    "tt0032895",
    "tt0032932",
    "tt0032933",
    "tt0032941",
    "tt0032331",
    "tt0033496",
    "tt0031153",
    "tt0033589",
    "tt0031713",
    "tt0031799",
    "tt0031813"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.929Z"
}