{
  "movieId": "tt0061451",
  "title": "House of 1,000 Dolls",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/house.-of.-1-000.-dolls.-1967.1080p.-blu-ray.x-264-yts.-ag",
      "id": "house.-of.-1-000.-dolls.-1967.1080p.-blu-ray.x-264-yts.-ag",
      "title": "House Of 1,000 Dolls(1967)",
      "description": "Original Title: La casa de mil mu ñecas Plot: Two professional illusionists Felix Manderville (Vincent Price, Madhouse) and his wife Rebecca (Martha Hyer, Houseboat) help abduct unsuspecting female victims with their magic tricks for an international ring of white slave traders. While vacationing in Tangiers, American businessman (George Nader, The Million Eyes of Su-Muru) and his wife (Anne Smyrner, Reptilicus) are drawn into a kidnapping plot when their friend (Maria Rohm, Count Dracula) becomes the underground ring's latest victim. Running against time, they only have a couple of days to find her before she's gone for good. Harry Alan Towers (The Mangler) under his usual pseudonym Peter Welbeck wrote the screenplay for this top-notch thriller directed by Jeremy Summers (The Vengeance of Fu Manchu).",
      "fileSize": 1563559924,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/house.-of.-1-000.-dolls.-1967.1080p.-blu-ray.x-264-yts.-ag",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 23042
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "79 min",
    "imdbRating": 5,
    "imdbVotes": 646,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "When a vacationing couple in Tangiers run into an old friend there, they discover that he is searching for his missing girlfriend who has been kidnapped by an international gang of white slavers. Nader investigates but before he can come up with anything, his friend is murdered. Meanwhile, nightclub magician Price and his mentalist partner continue their nefarious activities--they hypnotize and kidnap young women for the white slavers, and spirit them to the \"House of 1000 Dolls.\"",
    "Director": "Jeremy Summers, Hans Billian",
    "Writer": "Harry Alan Towers, María del Carmen Martínez Román",
    "Actors": "Vincent Price, Martha Hyer, George Nader",
    "Language": "English",
    "Country": "West Germany, Spain",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0061956",
    "tt0062347",
    "tt1440120",
    "tt0307956",
    "tt0062287",
    "tt0065531",
    "tt0058754",
    "tt0057207",
    "tt2543702",
    "tt0116374",
    "tt0086877",
    "tt0050097"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.614Z"
}