{
  "movieId": "tt0024989",
  "title": "The Clairvoyant",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.clairvoyant.1935",
      "id": "the.clairvoyant.1935",
      "title": "The Clairvoyant (1935)",
      "description": "\"The Clairvoyant\" is a 1935 British drama film directed by Maurice Elvey, featuring Claude Rains as a mind reader who discovers he has genuine psychic abilities. The film is based on a novel by Ernst Lothar and features a cast that includes Claude Rains, Fay Wray, and Jane Baxter. It follows Maximus, played by Claude Rains, who performs a mind-reading act with his wife, Rene (Fay Wray). During a train journey, Maximus has a premonition of an impending crash. He manages to convince Christine Shawn (Jane Baxter) to leave the train, which subsequently crashes. This event brings him fame, but he soon discovers that his psychic abilities are linked to Christine's presence.",
      "fileSize": 2287905131,
      "addedAt": "2026-01-07T00:12:44.279Z",
      "thumbnail": "https://archive.org/services/img/the.clairvoyant.1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 452
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "81 min",
    "imdbRating": 6.6,
    "imdbVotes": 1252,
    "Genre": "Drama, Mystery, Romance",
    "Plot": "Maximus, a small-time music hall mind reader, has frightening flashes of precognition; but he cannot predict or control them ...until he realizes he has them in the presence of Christine, attractive daughter of a publisher, who makes Rene, his equally lovely wife, wretchedly jealous. But worse trouble comes to Maximus when he's accused of causing a disaster he predicted.",
    "Director": "Maurice Elvey",
    "Writer": "Charles Bennett, Ernst Lothar, Bryan Edgar Wallace",
    "Actors": "Claude Rains, Fay Wray, Mary Clare",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0026124",
    "tt0011907",
    "tt0017998",
    "tt0027131",
    "tt0029855",
    "tt0022989",
    "tt0030727",
    "tt0022651",
    "tt0025678",
    "tt0032077",
    "tt0024727",
    "tt0024157"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.279Z"
}