{
  "movieId": "tt0053220",
  "title": "Ride Lonesome",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ride-lonesome-1959",
      "id": "ride-lonesome-1959",
      "title": "Ride Lonesome (1959)",
      "description": "Ride Lonesome is a classic Western film directed by Budd Boetticher, featuring Randolph Scott as the central character, Ben Brigade. The film revolves around themes of justice, vengeance, and the complexity of human relationships in the wild West.The story follows Ben Brigade, a bounty hunter who is on a mission to capture a notorious outlaw, Frank well-known for his violent exploits. Brigade is determined to bring him to justice and is motivated by personal ties to the outlaw.Brigade captures an outlaw named Billy John (portrayed by James Best) and enlists him as a guide to find Frank. They embark on a perilous journey across the desert, highlighting the harsh realities of the frontier. Along the Way : Along their route, Brigade encounters a young woman named Karen (played by Teri Garr), who demonstrates the fragile nature of morality and loyalty in this rugged landscape. The tension escalates when Brigade finally confronts Frank and his gang, leading to a fierce showdown. The film explores the duality of law and those who break it, emphasizing the gray areas of morality.The conclusion reflects Brigade’s personal growth and his understanding of justice, leaving audiences with a nuanced perspective on the Western genre.",
      "fileSize": 632704040,
      "addedAt": "2026-01-07T00:10:30.754Z",
      "thumbnail": "https://archive.org/services/img/ride-lonesome-1959",
      "language": "eng",
      "year": 1959,
      "collection": "feature_films",
      "downloads": 290
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "73 min",
    "imdbRating": 7.1,
    "imdbVotes": 7233,
    "Genre": "Western",
    "Plot": "A wanted murderer, Billy John, is captured by Ben Brigade, a bounty hunter, who intends to take him to Santa Cruz to be hanged. Brigade stops at a staging post, where he saves the manager's wife from an Indian attack, and enlists the help of two outlaws to continue his journey more safely. However, the Indian attacks persist, the outlaws plan to take Billy for themselves, tempted by the offer of amnesty for his captor, and Billy's brother Frank is in hot pursuit to rescue him. But Brigade has plans of his own ...",
    "Director": "Budd Boetticher",
    "Writer": "Burt Kennedy",
    "Actors": "Randolph Scott, Karen Steele, Pernell Roberts",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0054243",
    "tt0044722",
    "tt0043408",
    "tt0058660",
    "tt0178864",
    "tt0053461",
    "tt0052724",
    "tt0052993",
    "tt0053221",
    "tt0053145",
    "tt0053453",
    "tt0053457"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "western",
      "name": "Western"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.754Z"
}