{
  "imdbId": "tt0091702",
  "title": "Otra historia de amor",
  "year": 1986,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/otra-historia-de-amor-1986",
      "id": "otra-historia-de-amor-1986",
      "title": "Otra Historia De Amor (1986)",
      "description": "Otra historia de amor  es una  película   argentina  estrenada el 12 de junio del año 1986, 1 ​ bajo la dirección de  Américo Ortiz de Zárate  y con guion de  Juan Carlos Brown . (Wikipedia) Argumento Con tan solo un mes en la empresa, Jorge Castro le dice directamente a su jefe, Raúl Loberas, que le gusta y quiere acostarse con él. Su sorprendido jefe, un hombre casado y con hijos, rechaza inicialmente su proposición, pero días más tarde y tras muchas dudas la acepta, y así empiezan una relación amorosa clandestina. Tras varios meses encontrándose en apartamentos de los amigos de Jorge, ya que este vive con su madre, deciden alquilar un apartamento propio para poder estar juntos. Cuando ambos están enamorados y felices son descubiertos por una secretaria de la empresa, que aspiraba al puesto que había conseguido Jorge, y se lo cuenta a la esposa de Raúl. Esta acude al apartamento y los sorprende juntos. Raúl intenta explicarle que los quiere a los dos, pero al día siguiente la mujer intenta  suicidarse . Su hijo, Beto, la encuentra a tiempo y la lleva al hospital, pero descubre por la nota de despedida la relación  homosexual  de su padre. Todo esto hace que se desate un escándalo cuyo eco llega hasta la empresa, lo que provoca que trasladen a Raúl como gerente a la sucursal de  Madrid  y despidan a Jorge, por lo que van a tener que separarse. La tía de Raúl, en cuya casa se aloja tras la separación, le aconseja que no desaproveche el amor que es algo que pasa pocas veces y que defienda lo suyo. Jorge acompaña a Raúl al aeropuerto para despedirse y cuando regresa al coche descubre que Raúl se ha quedado en tierra para poder vivir juntos. Reparto Actor Personaje Arturo Bonín Raúl Loveras Mario Pasik Jorge Castro Héctor Bidonde Block Carlos Muñoz Don Juan María José Demare Prostituta Nelly Prono Tía Ofelia Alicia Aller Matilde Roxana Berco Mona Daniel Galarza Beto Susana Cart Nora Alejandro Vanelli Martín Patricio Gago Gaby Oscar Ortiz Felipe Alejandro Triguero Gladys José María Carballo Terapeuta",
      "fileSize": 1248710318,
      "addedAt": "2026-01-07T00:10:12.693Z",
      "thumbnail": "https://archive.org/services/img/otra-historia-de-amor-1986",
      "language": "spa",
      "year": 1986,
      "collection": "feature_films",
      "downloads": 172
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "88 min",
    "imdbRating": 6.9,
    "imdbVotes": 186,
    "Genre": "Drama, Romance",
    "Plot": "Dynamic young man falls in love with his own boss, a married businessman, with two children.",
    "Director": "Américo Ortiz de Zárate",
    "Writer": "Juan Carlos Brown, Américo Ortiz de Zárate",
    "Actors": "Arturo Bonín, Mario Pasik, Carlos Muñoz",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0091364",
    "tt0096492",
    "tt0092819",
    "tt0311144",
    "tt0087650",
    "tt0087821",
    "tt0090368",
    "tt0088734",
    "tt0087071",
    "tt0087910",
    "tt0084873",
    "tt0096926"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.693Z"
}