{
  "imdbId": "tt0042552",
  "title": "High Lonesome",
  "year": 1950,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HighLonesome",
      "id": "HighLonesome",
      "title": "High Lonesome",
      "description": "When there is a sudden outbreak of mysterious murders in the Texas Big Bend country, a young drifter new to the area, played by John Barrymore, is the prime suspect. Captured and held for the murders, the rancher who is holding Barrymore does not realize that he has been set up to take the fall for these murders by some men who were thought to have been killed years before in a range war. Now these despicable men are back and are getting their own revenge on those who were involved in the range war which left them wounded.",
      "fileSize": 1945944065,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HighLonesome",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 55810
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/high-lonesome-1950",
      "id": "high-lonesome-1950",
      "title": "High Lonesome (1950)",
      "description": "When a sudden spurt of murders occurs in the Big Bend country, suspicion immediately falls on a young drifter who just moved to the area. Watch on RetroFlix:  https://retroflix.org/high-lonesome-1950/",
      "fileSize": 481900649,
      "addedAt": "2026-01-07T00:08:39.346Z",
      "thumbnail": "https://archive.org/services/img/high-lonesome-1950",
      "language": "eng",
      "year": 1950,
      "collection": "feature_films",
      "downloads": 195
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=w5qNCz7b6j8",
      "id": "w5qNCz7b6j8",
      "title": "High Lonesome (1950) [Western]",
      "description": "A boy is found stealing food at Horse Davis' ranch by Boatwhistle, the cook. Another rancher, Pat Farrell, who is engaged to Horse's daughter Abby, believes the boy to also be a horse thief and possibly worse. Given the nickname Cooncat by the cook, the boy explains that he was wrongfully accused of murdering a man named Shell and has fled from the law. Shell owed him money, he says, and two strangers known as Smiling Man and Roper gave him a gun to confront Shell. He wound up unconscious and next to Shell's bullet-riddled body.\n\nHorse doubts the boy's story, though youngest daughter Meagan believes it. At an engagement party for Pat and Abby, word comes that Pat's parents have been found murdered. A livid Pat is ready to hang Cooncat for the crime. Horse talks him out of it, creating a rift between the two old friends. Smiling Man and Roper turn up in the bunkhouse. They laugh at Cooncat's predicament and call him their lucky charm. Boatwhistle is shot by Smiling Man, and just as Horse is about to be ambushed, Cooncat calls out to warn him and is wounded. Pat rides up just in time to save Horse's life. The two ranchers agree to take Cooncat under their wing.\n\n---\n\nDirected by Alfonso Brescia, produced by Luigi Alessi, written by Alfonso Brescia and Aldo Crudo, starring John Drew Barrymore as Cooncat, Chill Wills as Boatwhistle, John Archer as Pat Farrell, Lois Butler as Meagan Davis, Kristine Miller as Abby Davis, Basil Ruysdael as \"Horse\" Davis, Jack Elam as Smiling Man, Dave Kashner as Roper, Frank Cordell as Frank, Clem Fuller as Dixie, Hugh Aiken as Art Simms, Howard Joslin as Jim Shell.\n\n---\n\nSource: \"High Lonesome (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 27 September 2013. Web. 29 December 2013. http://en.wikipedia.org/wiki/High_Lonesome_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/atJwQv",
      "addedAt": "2025-12-26T00:26:13.402Z",
      "thumbnail": "https://i.ytimg.com/vi/w5qNCz7b6j8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAjbt_v_hfnMPrdQ6_43VETenntxw",
      "duration": 4800,
      "language": "en",
      "year": 1950,
      "channelName": "Timeless Classic Films",
      "channelId": "UCWlLgwn2nfjnefINARfcquA",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "81 min",
    "imdbRating": 5.3,
    "imdbVotes": 322,
    "Genre": "Western",
    "Plot": "In Texas' Big Bend country, a young drifter is caught stealing food at the Davis ranch. The Davis clan and the hired hands are immediately suspicious of the young runaway. They nickname him Cooncat. They all suspect Cooncat of running from the law for some crime he committed but he claims to have only run-away from an abusive father who beat him. Nevertheless, the ranch hired hands rough him up until he admits he has committed a murder. Cooncat reveals he killed Jim Shell, the owner of a trading post because the man stole Cooncat's money. He claims that two drifters hiding in the nearby ruins of a house egged him on and even gave him a revolver to commit the murder. However, his recollection is hazy since he was hit over the head by the trading post owner right when he was about to shoot him. No one at the Davis ranch believes his story, except Meagan Davis, the daughter of the Davis patriarch. Cooncat offers to take the men to the trading post to see the body of the murdered owner. When they all go there, no body is found inside the abandoned trading post. The place looks like it has been abandoned for months. Cooncat is asked to describe the two drifters who pushed him to murder. After the boy describes the drifters, whom he calls Smiling Man and Roper, his hosts are shocked. The description fits that of two Jessup family members who were killed 15 years before, during a range and fence war with the Davis clan. Cooncat's captors wonder whether the boy is lying or is crazy. Rancher Pat Farrell, engaged to Abby Davis, Meagan's sister, wants to deliver the boy to the sheriff but the Davis family offers to lodge him at their ranch until his story can be checked out in more detail. During the following days, Cooncat escapes his hosts several times but he is re-captured. He claims that all their lives are in danger because he keeps sighting the two drifters, Smiling Man and Roper, snooping around the Davis' ranch. No one believes his strange claims, except for Meagan, of course, who took a liking to him. Next, rancher Pat Farrell' parents are found murdered and circumstances point to Cooncat. Farrell wants to lynch Cooncat but old man Davis saves him, arguing that more evidence is needed. A temporary rift between Farrell and Davis is thus born. Later, when Boatwhistle, the ramrod of the Davis ranch and direct custodian of Cooncat, is found shot to death, they all assume Cooncat to be responsible. Cooncat is missing and so is the revolver that was kept in the old man Davis' office desk drawer. Old man Davis suspects that a bent-on-revenge Cooncat actually is the youngest son of the rival Jessup clan, eliminated 15 years before. A manhunt for Cooncat ensues, but he secretly returns to the ranch to convince Meagan of his innocence. His aim is to find Smiling Man and Roper who are the real killers. With the Davis and the Farrell crews after him, Cooncat races against time to find the real killers before he is caught and lynched.",
    "Director": "Alan Le May",
    "Writer": "Alan Le May",
    "Actors": "John Drew Barrymore, Chill Wills, John Archer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0043013",
    "tt0040543",
    "tt0042232",
    "tt0042383",
    "tt0042782",
    "tt0042313",
    "tt0042286",
    "tt0042372",
    "tt0042224",
    "tt0042506",
    "tt0042447",
    "tt0042912"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.346Z"
}