{
  "movieId": "tt0031278",
  "title": "Escape to Paradise",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/escape_to_paradise",
      "id": "escape_to_paradise",
      "title": "Escape To Paradise",
      "description": "You can find more information regarding this film on its IMDb page .",
      "fileSize": 3789023694,
      "addedAt": "2026-01-07T00:08:24.392Z",
      "thumbnail": "https://archive.org/services/img/escape_to_paradise",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 63599
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/escape_to_paradise_ipod",
      "id": "escape_to_paradise_ipod",
      "title": "Escape to Paradise",
      "description": "You can find more information regarding this film on it's IMDB page. http://www.imdb.com/title/tt0031278/",
      "fileSize": 834064734,
      "addedAt": "2026-01-07T00:08:24.392Z",
      "thumbnail": "https://archive.org/services/img/escape_to_paradise_ipod",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 17627
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "60 min",
    "imdbRating": 4.7,
    "imdbVotes": 84,
    "Genre": "Comedy, Musical, Romance",
    "Plot": "While on a pleasure cruise to South America, Richard Fleming, an idle playboy, docks in Rosarita. There he hails a motorcycle taxi owned by Roberto, who then drives him into a canteen, where the beautiful señorita Juanita is seated. Deciding to remain in Rosarita to court Juanita, Richard hires Roberto to drive him to her father's maté plantation. There he meets Alexander Komac, a buyer who is trying to corner the maté market and force the planters to accept his low price. Pretending to be a maté buyer himself, Richard approaches Don Miguel, Juanita's father, who formally introduces the American to his beautiful daughter. Richard agrees to buy a small quantity of maté from Don Miguel, but when his father refuses to provide him with the funds to make the purchase, he arranges for friends in New York to import the maté. Meanwhile, Roberto brags to the planters that Richard intends to buy all the maté in Rosarita, and they plan a surprise dinner in his honor. At the dinner, Richard learns that he has been anointed maté king of Rosarita and is forced to confess his deception. Learning the truth, Juanita spurns Richard, and as he plans to leave the town in defeat, a cablegram arrives from New York pleading for more maté. Roberto tricks Juanita into coming with him to prevent Richard from leaving, and the three return to town to begin Richard's new career as maté importer.",
    "Director": "Erle C. Kenton",
    "Writer": "Ian McLellan Hunter, Herbert Clyde Lewis, Weldon Melick",
    "Actors": "Bobby Breen, Kent Taylor, Marla Shelton",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032980",
    "tt0029193",
    "tt0031763",
    "tt0031716",
    "tt0030540",
    "tt0029885",
    "tt0032624",
    "tt0033029",
    "tt0033632",
    "tt0033878",
    "tt0034265",
    "tt0034055"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.392Z"
}