{
  "imdbId": "tt0049406",
  "title": "The Killing",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1956-the-killing-atraco-perfecto-stanley-kubrick-vose",
      "title": "1956 The Killing Atraco Perfecto Stanley Kubrick Vose",
      "id": "1956-the-killing-atraco-perfecto-stanley-kubrick-vose"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-killing-1956_202404",
      "title": "The Killing: 1956 HD Film-Noir [1:24:20]",
      "description": "Celebrated as Stanley Kubrick’s first mature film and made when he was only twenty-eight years old. A Classic Film Noir that exposes the myths by which we fulfil our desires. Sex, Murder and the family unit. Career criminal Johnny Clay (Sterling Hayden) recruits a sharpshooter (Timothy Carey), a crooked police officer (Ted de Corsia), a bartender (Joe Sawyer) and a betting teller named George (Elisha Cook Jr.), among others, for one last job before he goes straight and marries his fiancee, Fay (Coleen Gray). But when George tells his restless wife, Sherry (Marie Windsor), about the scheme to steal millions from the racetrack where he works, she hatches a plot of her own. While playing chess in Washington Square, Kubrick met producer James B. Harris, who was looking for a young new talent to produce for, having sold his film distribution company. Harris considered Kubrick \"the most intelligent, most creative person he had ever come in contact with\", and the two formed the Harris-Kubrick Pictures Corporation in 1955.Harris purchased the rights to Lionel White's novel Clean Break for $10,000, beating United Artists, which was interested in the film as a vehicle for Frank Sinatra. At Kubrick's suggestion they hired hardboiled fiction novelist Jim Thompson to write the script. United Artists told the pair that it would help finance the picture if Harris and Kubrick could find a high-profile actor to star. They signed Sterling Hayden, who agreed to accept $40,000. But Hayden wasn't a big enough star for UA, which wound up providing only $200,000 for the film; Harris financed the rest using $80,000 of his own money and a $50,000 loan from his father.",
      "id": "the-killing-1956_202404"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-killing.-1956",
      "title": "The Killing (1956)",
      "description": "\"The Killing,\" directed by Stanley Kubrick, is a classic film noir that revolves around a meticulously planned racetrack heist. The film follows Johnny Clay, a seasoned criminal, who is planning an elaborate robbery at a horse race track. His goal is to steal $2 million from the track’s betting room.",
      "id": "the.-killing.-1956"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thekilling1956",
      "title": "The Killing (1956)",
      "description": "The Killing is a 1956 film noir directed by Stanley Kubrick and produced by James B. Harris. It was written by Kubrick and Jim Thompson and based on the novel Clean Break by Lionel White. The drama stars Sterling Hayden, Coleen Gray, and Vince Edwards, and features Marie Windsor, Elisha Cook Jr., Jay C. Flippen and Timothy Carey.",
      "id": "thekilling1956"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "84 min",
    "imdbRating": "7.9",
    "imdbVotes": "102,237",
    "Genre": "Crime, Drama, Film-Noir",
    "Plot": "After just being released from a five-year stint in prison, Johnny Clay has assembled a five-man team, including two insiders, to carry out what he estimates will be a $2 million heist at Lansdowne Racetrack, the take to be split five ways, minus expenses. Besides Johnny, none of the men truly are criminals in the typical sense. In addition to the other four team members, Johnny has hired two men outside of the team to carry out specific functions for a flat fee; the other four will not meet the two men for hire or know who they are, while the two men for hire will not be told of the bigger picture of the heist. None involved are to tell anyone, even their loved ones, about the job. Each of the five have a specific reason for wanting his share of the money: Johnny, in wanting to get married to his longtime girlfriend Fay, the two who have known each other since they were kids, realizes that to live comfortably, he has to shoot for the moon instead of carrying out the penny-ante stuff that put him behind bars; Marvin Unger, a bookkeeper who is bankrolling the plan, is doing it out of his friendship and loyalty to Johnny; Randy Kennan, a crooked police officer, is already late with his repayment to a loan shark; Mike O'Reilly, one of the track's bartenders, wants to be able to provide better overall care, most importantly medical, to his bedridden wife, Ruthie O'Reilly; and milquetoast George Peatty, one of the track's ticket clerks, is trying to buy back the love of his shrew of a wife of five years, Sherry Peatty, if he ever had her love at all. The elaborate plan requires meticulous timing by all seven men. Beyond any unforeseen problems causing the plan to fail, what the other four team members are unaware of is that weak-minded George told Sherry of the broad issue that he will be involved in a heist in an effort to hold on to her emotionally; she, in turn, told her boyfriend Val Cannon, with Sherry and Val having their own ideas of absconding with the entire take of the heist after the fact.",
    "Director": "Stanley Kubrick",
    "Writer": "Stanley Kubrick, Jim Thompson, Lionel White",
    "Actors": "Sterling Hayden, Coleen Gray, Vince Edwards",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 1 BAFTA Award1 nomination total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0048254",
      "title": "Killer's Kiss",
      "year": 1955,
      "imdbRating": "6.5",
      "imdbVotes": "27,240",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050087",
      "title": "5 Steps to Danger",
      "year": 1956,
      "imdbRating": "6.3",
      "imdbVotes": "1,183",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050271",
      "title": "Crime of Passion",
      "year": 1956,
      "imdbRating": "6.4",
      "imdbVotes": "3,102",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0050512",
      "title": "Hit and Run",
      "year": 1957,
      "imdbRating": "6.3",
      "imdbVotes": "576",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0048423",
      "title": "The Night Holds Terror",
      "year": 1955,
      "imdbRating": "6.3",
      "imdbVotes": "1,074",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047542",
      "title": "Suddenly",
      "year": 1954,
      "imdbRating": "6.8",
      "imdbVotes": "7,583",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0047263",
      "title": "Naked Alibi",
      "year": 1954,
      "imdbRating": "6.5",
      "imdbVotes": "1,585",
      "language": "English, Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051959",
      "title": "Murder by Contract",
      "year": 1958,
      "imdbRating": "7.2",
      "imdbVotes": "4,824",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051800",
      "title": "Johnny Rocco",
      "year": 1958,
      "imdbRating": "6.2",
      "imdbVotes": "82",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049340",
      "title": "The Houston Story",
      "year": 1956,
      "imdbRating": "6.1",
      "imdbVotes": "448",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049904",
      "title": "The Unguarded Moment",
      "year": 1956,
      "imdbRating": "6.3",
      "imdbVotes": "528",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0049955",
      "title": "The Wild Party",
      "year": 1956,
      "imdbRating": "5.8",
      "imdbVotes": "302",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T21:52:04.023Z"
}