{
  "imdbId": "tt0021877",
  "title": "The Fly Guy",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-fly-guy-1931",
      "title": "The Fly Guy (1931)",
      "description": "An Aesop's Fables cartoon about a musical fly. Watch on RetroFlix:  https://retroflix.org/the-fly-guy-1931/",
      "id": "the-fly-guy-1931"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": "5.2",
    "imdbVotes": "28",
    "Genre": "Animation, Short",
    "Plot": "Van Beuren cartoons are extremely variable, especially in the number of gags and whether the absurdist humour shines through enough (sometimes it does, other times it doesn't), but are strangely interesting. Although they are often poorly animated with barely existent stories and less than compelling lead characters, they are also often outstandingly scored, there can be some fun support characters and some are well-timed and amusing.'The Fly Guy' is for me among the worst of the 1931 batch and one of the worst Aesop's Fables/Van Beuren cartoons. It tries too hard to be cutesy which Van Beuren have rarely been successful at, and there is very little of the absurdist and surreal humour that can be seen in their best efforts, or at least it's not done right. There are a couple of decent things but they are far overshadowed by everything else that 'The Fly Guy' does badly wrong.Best asset about 'The Fly Guy' is the music score, pretty much the best thing consistently of Van Beuren's output. Sometimes even the only good thing. It is so beautifully and cleverly orchestrated, is great fun to listen to and full of lively energy, doing so well with enhancing the action. A few neatly synchronised sound effects here and there and the visuals are not as out of sync with the audio as much as other cartoons in the series. Coming onto the numerous criticisms, the animation is not good, in fact it is downright bad most of the time with erratically sloppy character designs in particular while the simplistic background detail and lack of fluidity and crispness are just as difficult to ignore.Story is very slight to the point of non-existence and suffers from very sluggish timing, the pace was in serious need of a kick in places. It feels aimless and also random and disjointed. It is not as senseless as a lot of the worst of the series, but that still doesn't stop it from being very bland. Likewise with endearing or memorable characters, the characters here are neither. Not to mention very poorly animated and the designs are so similar the characters are never distinct from one another and telling them apart or figuring out who the main character is is very difficult. Generally the cartoon is very low on laughs, actually none of it is remotely amusing and it all feels rather disorganised. Nothing is inventive, never rising above the forgettable and there is not much absurdist about them. As said it tries too hard to be cute, to the point of being sickly sweet, and it sucks out the energy and humour. This is a reiteration of a lot of the average and less Aesops Fables/Van Beuren cartoons that have been reviewed by me, but this is due to them having the same strengths and drawbacks.On the whole, doesn't fly and not a good cartoon. 3/10 Bethany Cox",
    "Director": "Harry Bailey, John Foster",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0146570",
      "title": "College Capers",
      "year": 1931,
      "imdbRating": "4.3",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022301",
      "title": "Red Riding Hood",
      "year": 1931,
      "imdbRating": "6.1",
      "imdbVotes": "96",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020767",
      "title": "Circus Capers",
      "year": 1930,
      "imdbRating": "5.4",
      "imdbVotes": "108",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146759",
      "title": "Fly Frolic",
      "year": 1932,
      "imdbRating": "5.2",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020907",
      "title": "Frozen Frolics",
      "year": 1930,
      "imdbRating": "4.3",
      "imdbVotes": "122",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146910",
      "title": "Hot Tamale",
      "year": 1930,
      "imdbRating": "5.1",
      "imdbVotes": "39",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0161580",
      "title": "The Fly's Bride",
      "year": 1929,
      "imdbRating": "5.2",
      "imdbVotes": "63",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024702",
      "title": "Tumble Down Town",
      "year": 1933,
      "imdbRating": "5.1",
      "imdbVotes": "22",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146738",
      "title": "The Farmerette",
      "year": 1932,
      "imdbRating": "5.7",
      "imdbVotes": "108",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146563",
      "title": "A Close Call",
      "year": 1929,
      "imdbRating": "5.0",
      "imdbVotes": "68",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0022199",
      "title": "The New Car",
      "year": 1931,
      "imdbRating": "6.2",
      "imdbVotes": "105",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152780",
      "title": "A Swiss Trick",
      "year": 1931,
      "imdbRating": "5.7",
      "imdbVotes": "151",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T16:57:12.856Z"
}