{
  "imdbId": "tt0051378",
  "title": "Elevator to the Gallows",
  "year": 1958,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/elevator-to-the-gallows-58",
      "id": "elevator-to-the-gallows-58",
      "title": "Elevator to the Gallows (1958)",
      "description": "For his feature debut, twenty-four-year-old Louis Malle brought together a mesmerizing performance by Jeanne Moreau, evocative cinematography by Henri Decaë, and a now legendary jazz score by Miles Davis. Taking place over the course of one restless Paris night, Malle’s richly atmospheric crime thriller stars Moreau and Maurice Ronet as lovers whose plan to murder her husband (his boss) goes awry, setting off a chain of events that seals their fate. A career touchstone for its director and female star, Elevator to the Gallows was an astonishing beginning to Malle’s eclectic body of work, and it established Moreau as one of the most captivating actors ever to grace the screen. Directed by Louis Malle Screenplay by Louis Malle and Roger Nimier Based on the novel by Noël Calef Produced by Jean Thuillier Cinematography by Henri Decaë Camera Operators: Jean Rabier and André Villard Music by Miles Davis Editing by Léonide Azar Production Design by Jean Mandaroux and Rino Mondellini Makeup by Boris de Fast Sound by Raymond Gauguier Starring Jeanne Moreau, Maurice Ronet, Georges Poujouly, Yori Bertin, Jean Wall, Lino Ventura, Iván Petrovich, and Elga Andersen",
      "fileSize": 1624676881,
      "addedAt": "2026-01-07T00:08:15.379Z",
      "thumbnail": "https://archive.org/services/img/elevator-to-the-gallows-58",
      "language": "fre",
      "year": 1958,
      "collection": "feature_films",
      "downloads": 7615
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "91 min",
    "imdbRating": 7.9,
    "imdbVotes": 31016,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "Florence Carala and her lover, Julien Tavernier, want to murder her husband - Julien's boss - by faking his suicide. But after Julien's killed him, and had left, he remembers he's forgotten the rope outside the window which could implicate him, and he returns to the building to remove it",
    "Director": "Louis Malle",
    "Writer": "Roger Nimier, Louis Malle, Noël Calef",
    "Actors": "Jeanne Moreau, Maurice Ronet, Georges Poujouly",
    "Language": "French, German",
    "Country": "France",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0051500",
    "tt0050097",
    "tt0053133",
    "tt0053850",
    "tt0221319",
    "tt0052862",
    "tt0053361",
    "tt0052696",
    "tt0127562",
    "tt0052870",
    "tt0052943",
    "tt0232137"
  ],
  "collections": [
    {
      "id": "criterion-collection",
      "name": "The Criterion Collection"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "1950s",
      "name": "1950s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.379Z"
}