{
  "movieId": "tt0053810",
  "title": "The Facts of Life",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tfol60778",
      "id": "tfol60778",
      "title": "The Facts of Life",
      "description": "Title: The Facts of Life Summary: Larry and Kitty are two middle-class suburbanites who find themselves growing bored with their lives and respective marriages. Although each always found the other grating in manner, they ... Directed by: Melvin Frank Actors: Bob Hope, Lucille Ball, Ruth Hussey Production Company: HLP Release Date: 14 November 1960 (USA) Aspect Ratio: 1.66 : 1 Larry and Kitty are two middle-class suburbanites who find themselves growing bored with their lives and respective marriages. Although each always found the other grating in manner, they find themselves falling in love when thrown together without their spouses on a vacation. After returning home, they try to break things off, but always seem to grow closer. A holiday together will finally settle whether they should end their marriages.",
      "fileSize": 1551626575,
      "addedAt": "2026-01-07T00:11:46.531Z",
      "thumbnail": "https://archive.org/services/img/tfol60778",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 4979
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "103 min",
    "imdbRating": 6.3,
    "imdbVotes": 1760,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Middle-class suburbanites Larry and Kitty grow bored with their lives and respective marriages. Although each always found the other's manner grating, they fall in love when thrown together--without their spouses--on vacation. On returning home they try to break things off, only to grow closer. A holiday together will finally settle whether they should end their marriages.",
    "Director": "Melvin Frank",
    "Writer": "Norman Panama, Melvin Frank",
    "Actors": "Bob Hope, Lucille Ball, Ruth Hussey",
    "Language": "English",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 1 win & 11 nominations total"
  },
  "relatedMovies": [
    "tt0054230",
    "tt0144150",
    "tt0054086",
    "tt0054698",
    "tt0051666",
    "tt0199395",
    "tt0052941",
    "tt0059927",
    "tt0032599",
    "tt0027311",
    "tt0033891",
    "tt0027286"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.531Z"
}