{
  "imdbId": "tt0024019",
  "title": "The Flaming Signal",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheFlamingSignal",
      "id": "TheFlamingSignal",
      "title": "The Flaming Signal.",
      "description": "Yeah it's a flaming turkey with bad dialog (much of it ad libbed), awful acting, primitive screenplay and screwy editing. BUT it also has a wonder dog, a pre-code skinny-dipping blonde - and wait until you see what raises witchdoctor Mischa Auer from the dead! This one ranks high on the must be seen to be believed list. Directed by George Jeske and C Edwards Roberts Released in 1933 Complete print",
      "fileSize": 891378919,
      "addedAt": "2026-01-07T00:06:58.274Z",
      "thumbnail": "https://archive.org/services/img/TheFlamingSignal",
      "collection": "feature_films",
      "downloads": 13888
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "64 min",
    "imdbRating": 4.2,
    "imdbVotes": 66,
    "Genre": "Action, Drama",
    "Plot": "Army flyer Lt. James Robbins plans to fly his famous endurance plane - \"The Spirit of '76\" - from Los Angeles to Hawaii, and though his dog Flash always accompanies him on his flights, the need for each gallon of gas is so much that he has to - he thinks - leave Flash behind. Flying through a night-long storm, Jim realizes he is off course, just as a fire starts in the fuselage of the plane. Flash comes out of his hiding place and warns his master. Jim puts his parachute on Flash who - trust me - is a trained jumper and Jim crash-lands the plane in the ocean where he is rescued by Flash. They make their way to a strange island, known as Tabu, which is divided between Sally James and her missionary father on one side with Von Krantz, a bestial trader who operates the only store and trading post (which in no way resembles the above-reported motel), and his woman Molly who, as they were wont to say in those days, had known better times. Von Krantz plays his trade by cheating the natives out of their pearls in exchange for rot-gut liquor. Not content with just making an honest living, Von Krantz inflames the natives by attacking a native girl and also shooting the very mortal \"immortal\" high priest. The whites are taken captive to a place of high worship where the natives chant themselves into a frenzy of fanatical emotion while a virgin dances sensuously before the stricken priest and finally he is - as they were wont to say in those days - \"risen.\" The missionary is brokering a truce with the natives when the ever-rotten Von Krantz fires a few rounds into the peace parley and hits the missionary who, unlike the priest, does not rise. Some more stuff happens before Flash, who has been kind of quiet since Jim may be thinking he was responsible for the airplane fire, hikes himself off up a mountain and lights the funeral pyre - no problem at all for a parachuting dog - that signals the rescue ship searching for Jim.",
    "Director": "George Jeske, Charles E. Roberts",
    "Writer": "William G. Steuer, Charles E. Roberts, Thomas Hughes",
    "Actors": "Flash the Dog, John David Horsley, Marceline Day",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0022957",
    "tt0022990",
    "tt0023117",
    "tt0023427",
    "tt0136560",
    "tt0023309",
    "tt0024055",
    "tt0023938",
    "tt0022836",
    "tt0024176",
    "tt0023984",
    "tt0023893"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.274Z"
}