{
  "movieId": "tt0019824",
  "title": "The Divine Lady",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-divine-lady-1929_202507",
      "id": "the-divine-lady-1929_202507",
      "title": "The Divine Lady (1929)",
      "description": "I've been researching newly public domain films from 1929 and earlier, so I'm uploading the best possible copies that I can find. The only film to ever win a Best Director award at the Oscars without being nominated for Best Picture, The Divine Lady is about a lady and a lord who love each other, but marriages of convenience and political interference force them to either stay apart, or to be in a dangerous affair. Overall critics felt positive about the film, but far from ecstatic. ",
      "fileSize": 1285373267,
      "addedAt": "2026-01-07T00:11:57.684Z",
      "thumbnail": "https://archive.org/services/img/the-divine-lady-1929_202507",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 64
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "99 min",
    "imdbRating": 6.2,
    "imdbVotes": 957,
    "Genre": "Drama, History, Romance",
    "Plot": "A partly fictionalized account of history begins with the arrival of slatternly Emma Hart, a cook's daughter, at the home of Charles Greville. Greville takes her as his lover and grooms her until their relationship becomes an inconvenience. Greville then dupes Emma into traveling to Naples to live with his uncle, Lord Hamilton, ambassador to the court at Naples. Realizing that Greville has abandoned her, Emma agrees to marry Lord Hamilton. Soon, however, she meets Admiral Horatio Nelson of the British Navy. Emma plays a crucial role in convincing Naples to open its ports to Nelson during his campaign against Napoleon's French fleet. Soon, Emma and the married Nelson become romantically involved -- a relationship which will have consequences for them both.",
    "Director": "Frank Lloyd",
    "Writer": "E. Barrington, Forrest Halsey, Harry Carr",
    "Actors": "Corinne Griffith, Victor Varconi, H.B. Warner",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 2 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt0019557",
    "tt0309977",
    "tt0019374",
    "tt0014721",
    "tt0019589",
    "tt0018218",
    "tt0015310",
    "tt0037547",
    "tt0019852",
    "tt0014854",
    "tt0015022",
    "tt0014702"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.684Z"
}