{
  "imdbId": "tt0021726",
  "title": "Cavalier of the West",
  "year": 1931,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sKnxZqaWgnM",
      "id": "sKnxZqaWgnM",
      "title": "Cavalier of the West (1931) HARRY CAREY",
      "description": "Stars: Harry Carey, Carmen Laroux, Kane Richmond\nDirector: John P. McCarthy\n\nAn Army captain declares martial law on account of corrupt deputies.\n\nMovie Class by PizzaFLIX: Harry Carey (1878–1947) began acting in 1910 to become one of Silent Film's earliest superstars and successfully transitioned into \"talkies.\" He made 260 films and is best remembered as a cowboy. So much so, John Ford and John Wayne closed their iconic western THE SEARCHERS (1956) with a visual homage to Harry Carey.",
      "addedAt": "2025-12-26T23:43:22.736Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/sKnxZqaWgnM/maxresdefault.webp",
      "duration": 3929,
      "language": "en",
      "year": 1931,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "75 min",
    "imdbRating": 5.9,
    "imdbVotes": 92,
    "Genre": "Western",
    "Plot": "Captain John Allister of the U.S. Cavalry catches deputy sheriff \"Red'Greeley and four henchmen in the act of attacking White Feather and two other Indians.The men accuse the Indians of stealing their horses but Allister, using a ruse, proves this false. He knows the four men were planning on stealing the gold the Indians were taking to El Rio. Allister arrests the men, charges them with theft and the murder of Indians a week before, and turns then over to Sheriff Bill Ryan. Greeley gets word to gang-leader Lee Burgess, foreman of the Fernandez ranch that his men have been arrested. Ryan and Allister ride to the ranch to look over some horses for Army purchase, where the open admiration of Dolores Fernandez for Allister triggers a jealous reaction in Burgess. Back at the jail, the four prisoners escape and Greeley is suspected of complicity in their escape. Fearing an Indian uprising, Allister declares martial law and threatens the firing squad for anyone interfering with the Indians.Discarding his uniform, Allister joins the Indians, who are moving their gold at night. They are attacked, but repulsed, and Sheriff Ryan accuses Greeley who alone knew of the plan to ship by night.During a fiesta held by Dolores, Burgess has his men attack the stage, kill the paymaster and seriously wound the guard, Army Lieutenant Wilbur Allister, the son of John Allister. Wilbur recovers but his weakness for gambling, liquor and women put him in a circumstance where Burgess kills a Mexican named Manuel and he, saloon owner Jim Slade and bar-girl Chiquita frame the young Allister for the killing. Captain Allenby's task is now to prove the innocence of his son and the guilt of Burgess, Slade, Greeley and company, and he doesn't have much too work with. Might as well start with Chiquita.",
    "Director": "John P. McCarthy",
    "Writer": "John P. McCarthy, Harry L. Fraser",
    "Actors": "Harry Carey, Carmen Laroux, Kane Richmond",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0022195",
    "tt0022450",
    "tt0021046",
    "tt0021202",
    "tt0023164",
    "tt0020955",
    "tt0022884",
    "tt0023914",
    "tt0024690",
    "tt0026612",
    "tt0037050",
    "tt0037600"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:29:03.721Z"
}