{
  "imdbId": "tt0001000",
  "title": "The Peachbasket Hat",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-movie_20210228",
      "title": "\"The Peachbasket Hat\" (1909) director D. W. Griffith starring Florence Lawrence",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Peachbasket Hat\" is a short comedy directed by D. W. Griffith. This film illustrates the work of Florence Lawrence, Arthur V. Johnson and Billy Bitzer, stars of Silent Hall of Fame. Directed by                          D.W. Griffith Produced by                        Biograph Company Scenario by                          D.W. Griffith Cinematography                G.W. Bitzer, Arthur Marvin Starring                                Florence Lawrence, John R. Cumpson, Anita Hendrie, Arthur V. Johnson, Mack Sennett, Mary Pickford Distributed by                     Biograph Company Release date                         June 24, 1909 Running time                       11 min. Country                                United States Language                              Silent, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"",
      "id": "my-movie_20210228"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "5.5",
    "imdbVotes": "64",
    "Genre": "Short, Comedy",
    "Plot": "No more popular fad has ever struck the feminine fancy than the peachbasket hat. This is a creation of headgear that for size outstrips anything yet designed by the disordered mind of the modiste. As a \"skypiece\" it is a \"skyscraper,\" and in decoration it looks like a combination horticultural and food exhibition. Nevertheless, this mammoth \"lid\" was seized onto by the feminine world with the avidity of a boy for his first baseball suit. It is only natural that our friend, Mrs. Jones, should experience this obsession, and what woe it preambled! The Jones family are seated at breakfast. Mr. Jones is reading the morning paper. An account of a kidnapping by gypsies engages his attention, and he is filled with horror at the anticipation of the possible abduction of his young hopeful, a baby one year old. He tries to impress Mrs. J., but she is fascinated by the millinery \"ads.\" The situation for Jones becomes more tense when on going outside he sees a couple of the odious gypsies with a child. Mrs. Jones takes herself off to buy a peachbasket, leaving baby in charge of the nurse, who, being of a romantic nature, enlists the services of the gypsies to tell her fortune. Mrs. Jones returns and almost catches the nursemaid, who is quite beside herself at her near discovery. Mrs. Jones places the huge box containing the hat on the table, while the nurse, placing the baby on the floor, assists in extricating the hat from its crate. Putting on the hat, Mrs. J. goes into the next room, followed by the maid, to view the effect in the mirror. .Mr. Jones now arrives, and his first thought is for baby; he cares naught for the peachbasket hat. Baby is nowhere to be seen. The nurse, in her excitement, does not remember where she placed it. Through the house they rush fruitlessly; out on the road and on after the disappearing gypsies, who are overtaken only to find that the baby the woman carries is not a Jones. The clouds of despair o'ershadow the couple in their dining-room, when suddenly the hat box on the floor is seen to move. There, under the hollow cube of pasteboard, is found baby Jones, the box having been blown by a gust of wind off the table over the child.",
    "Director": "D.W. Griffith",
    "Writer": "D.W. Griffith",
    "Actors": "John R. Cumpson, Florence Lawrence, Anita Hendrie",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0000892",
      "title": "Her First Biscuits",
      "year": 1909,
      "imdbRating": "5.6",
      "imdbVotes": "83",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000922",
      "title": "The Joneses Have Amateur Theatricals",
      "year": 1909,
      "imdbRating": "5.5",
      "imdbVotes": "112",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001062",
      "title": "Those Awful Hats",
      "year": 1909,
      "imdbRating": "6.2",
      "imdbVotes": "1,256",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000946",
      "title": "The Lure of the Gown",
      "year": 1909,
      "imdbRating": "4.6",
      "imdbVotes": "79",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000770",
      "title": "The Taming of the Shrew",
      "year": 1908,
      "imdbRating": "5.4",
      "imdbVotes": "172",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000877",
      "title": "Getting Even",
      "year": 1909,
      "imdbRating": "4.8",
      "imdbVotes": "107",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001002",
      "title": "The Politician's Love Story",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "103",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000800",
      "title": "The Awakening",
      "year": 1909,
      "imdbRating": "5.3",
      "imdbVotes": "115",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000878",
      "title": "The Gibson Goddess",
      "year": 1909,
      "imdbRating": "5.1",
      "imdbVotes": "182",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000938",
      "title": "The Little Darling",
      "year": 1909,
      "imdbRating": "4.6",
      "imdbVotes": "197",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000841",
      "title": "The Day After",
      "year": 1909,
      "imdbRating": "5.2",
      "imdbVotes": "81",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000653",
      "title": "A Calamitous Elopement",
      "year": 1908,
      "imdbRating": "4.5",
      "imdbVotes": "225",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:54.333Z"
}