{
  "imdbId": "tt0063371",
  "title": "A Report on the Party and Guests",
  "year": 1966,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-report-on-the-party-and-guests",
      "id": "a-report-on-the-party-and-guests",
      "title": "A Report On The Party And Guests",
      "description": "In Jan Němec’s surreal fable, a picnic is rudely transformed into a lesson in political hierarchy when a handful of mysterious authority figures show up. This allegory about oppression and conformity was banned in its home country but became an international success after it premiered at the New York Film Festival.",
      "fileSize": 5772209495,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-report-on-the-party-and-guests",
      "language": "cze",
      "year": 1966,
      "collection": "feature_films",
      "downloads": 3071
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "71 min",
    "imdbRating": 7.1,
    "imdbVotes": 1866,
    "Genre": "Comedy, Drama",
    "Plot": "A small group of adult bourgeois friends are on a day outing in the country, that outing which includes having a picnic. While they are going for a walk after the picnic, they encounter a group of officious looking men who commandeer them to a small clearing. Although there is no direct threat and the picnickers are not scared, they nonetheless feel the need to do what the men say. The men, led by one called Rudolph, set the rules of \"the game\". Ultimately, the picnickers learn that Rudolph was supposed to invite them to a party nearby. Much like the game, the party's host sets the rules for the party to which the picnickers and all the other guests must abide. Order in the eyes of the host seems to be paramount. Although the picnickers and the other guests enjoy many aspects of the party, some just do not want to be there, such thinking which cannot be tolerated.",
    "Director": "Jan Nemec",
    "Writer": "Ester Krumbachová, Jan Nemec",
    "Actors": "Helena Pejsková, Jana Pracharová, Zdena Skvorecka",
    "Language": "Czech",
    "Country": "Czechoslovakia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0309401",
    "tt0060802",
    "tt0060586",
    "tt0060560",
    "tt0060584",
    "tt0060304",
    "tt0061407",
    "tt0060201",
    "tt0320675",
    "tt0059581",
    "tt0178850",
    "tt0062994"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}