{
  "imdbId": "tt0022021",
  "title": "Kept Husbands",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/KeptHusbands",
      "id": "KeptHusbands",
      "title": "Kept Husbands",
      "description": "Blue collar steelworker Richard Brunton (Joel McCrea) saves two of his fellow workers after an accident at a factory. In gratitude, his boss, millionaire Arthur Parker (Robert McWade) invites Richard for dinner with his family. Arthur's daughter Dot (Dorothy Mackaill) is instantly impressed and infatuated with Richard She vows to marry him within a month.",
      "fileSize": 1902949135,
      "addedAt": "2026-01-07T00:06:30.621Z",
      "thumbnail": "https://archive.org/services/img/KeptHusbands",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 67191
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/KeptHusbands1931-02-22",
      "id": "KeptHusbands1931-02-22",
      "title": "Kept Husbands",
      "description": "* Released 1931-02-22 * Comedy/Romance (Eng US) * 1930s Pre-Code B&W Film * RKO Radio Pictures * RCA Photophone System * PRODUCER: William LeBaron; Louis Sarecky (Assoc Prod) * DIRECTOR: Lloyd Bacon * WRITERS: Louis Sarecky (By); Forrest Halsey and Alfred Jackson (Adaptation & Dialogue) * STARRING: Dorothy MacKaill; Joel McCrea; Ned Sparks; Mary Carr; Clara Kimball Young; Robert McWade; Bryant Washburn; Florence Roberts; Freeman Wood * SYNOPSIS: After saving the lives of two fellow employees, a blue-collar worker is invited to dinner at the home of his boss. Over dinner, the spoiled debutante daughter of employer becomes instantly infatuated with the worker, making a bet with her father to marry this stranger within a month. * SOURCE: 1) Wikipedia 2) IMDb * I own zero rights to this film, financially or otherwise and upload purely for Educational purposes only, for present and future generations. Doreen (def gp ddh)",
      "fileSize": 606675125,
      "addedAt": "2026-01-07T00:06:30.621Z",
      "thumbnail": "https://archive.org/services/img/KeptHusbands1931-02-22",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 5789
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kept-husbands-1931",
      "id": "kept-husbands-1931",
      "title": "Kept Husbands (1931)",
      "description": "A former All-American football star, now working as a steel mill supervisor in New Jersey, falls in love with the mill owner's wealthy, very spoiled daughter. Watch on RetroFlix:  https://retroflix.org/kept-husbands-1931/",
      "fileSize": 3122945809,
      "addedAt": "2026-01-07T00:09:16.000Z",
      "thumbnail": "https://archive.org/services/img/kept-husbands-1931",
      "language": "eng",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 165
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Es2bvs9esRI",
      "id": "Es2bvs9esRI",
      "title": "Kept Husbands (1931) | Colorized Public Domain Pre-Code Drama with Dorothy Mackaill and Joel McCrea",
      "description": "Kept Husbands (1931) is an American pre-Code drama directed by Lloyd Bacon and distributed by RKO Radio Pictures. This restored and colorized edition breathes new life into a fascinating early talkie that deals with class conflict, gender roles, and marital power struggles during the Great Depression. With Dorothy Mackaill and Joel McCrea leading the cast, the film captures both the glamour and anxieties of its era, showcasing a provocative storyline that reflected the shifting social norms of the early 1930s.\n\nPlot Summary:\nRuth Chatterton (Dorothy Mackaill) is the privileged daughter of steel magnate Arthur Parker. Used to getting what she wants, she becomes infatuated with Dick Brunton (Joel McCrea), a hardworking and honorable steelworker. After Dick performs a heroic act during a factory accident, Ruth insists on pursuing him, despite their vast differences in wealth and background.\n\nDick is swept into her world of luxury, but the marriage is anything but simple. Ruth expects Dick to adapt to her elite lifestyle, while Dick struggles with the feeling that he is being treated less as a husband and more as a possession. The title reflects the film’s central tension — is Dick truly a partner in marriage, or is he merely a “kept husband” supported and controlled by his wife’s fortune? As tensions escalate, the story confronts issues of pride, love, social class, and the definition of masculinity during a time when traditional roles were already under strain.\n\nCast and Crew:\n• Director: Lloyd Bacon\n• Producer: Ray Rockett\n• Screenplay: George Abbott\n• Cinematography: Norbert Brodine\n• Editing: William Hamilton\n\nStarring:\n• Dorothy Mackaill as Ruth Chatterton\n• Joel McCrea as Dick Brunton\n• Ned Sparks as John Bence\n• Mary Carr as Mrs. Brunton\n• Florence Roberts as Mrs. Parker\n• Robert McWade as Arthur Parker\n\nFilm Significance:\nKept Husbands is a classic example of pre-Code Hollywood — a period when studios produced bold, socially provocative films before the enforcement of the Hays Code in 1934. The movie touches on themes of gender politics, financial independence, and the social discomfort surrounding women in positions of power. Dorothy Mackaill delivers a strong performance as a wealthy woman unafraid to break conventions, while Joel McCrea, still in the early stages of his career, brings charm and grit to the role of an honest man trapped between love and pride.\n\nThe film’s honest depiction of marital strife and its reversal of traditional gender dynamics make it stand out as more daring than many studio dramas of its time. It also serves as a cultural artifact, revealing the anxieties and aspirations of Depression-era America, when wealth disparity and shifting gender roles were pressing issues in real life.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Kept Husbands remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1931 release was in black and white, typical of pre-Code dramas of the era. While historically significant, many modern viewers skip past monochrome films. By offering a colorized edition, Kept Husbands gains renewed vitality, allowing audiences to better appreciate its sets, costumes, and performances. The film’s tension between wealth, love, and independence is now easier for contemporary audiences to connect with in this restored and colorized version.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten pre-Code dramas to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#KeptHusbands #PreCodeHollywood #DorothyMackaill #JoelMcCrea #1930sDrama #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #FilmRestoration #ClassConflictDrama",
      "addedAt": "2025-12-24T00:49:55.444Z",
      "thumbnail": "https://i.ytimg.com/vi/Es2bvs9esRI/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYciBRKEEwDw==&rs=AOn4CLBPRoLNb33gG_PxoDFtsHilCIhgig",
      "duration": 4478,
      "language": "en",
      "year": 1931,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6MiRhq_42O8",
      "id": "6MiRhq_42O8",
      "title": "Kept Husbands (1931) PRE-CODE HOLLYWOOD",
      "description": "Stars: Clara Kimball Young, Joel McCrea, Dorothy Mackaill\n Director: Lloyd Bacon\n\n A steelworker Richard saves two of fellow workers after a factory accident. In gratitude, his millionaire boss invites him for dinner, where his daughter is instantly infatuated and vows to marry him.Unfortunately, he finds her appetite for extravagances begins to wear him down, financially and emotionally until he becomes a 'kept husband.'",
      "addedAt": "2025-12-26T23:52:08.549Z",
      "thumbnail": "https://i.ytimg.com/vi/6MiRhq_42O8/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1gSAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLDJ_dWqDgGxt9Xa9xC1b9G7NGkFJA",
      "duration": 4516,
      "language": "en",
      "year": 1931,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "76 min",
    "imdbRating": 5.8,
    "imdbVotes": 647,
    "Genre": "Drama, Romance",
    "Plot": "Blue collar steelworker Richard Brunton (McCrea) saves two of his fellow workers after an accident at a factory. In gratitude, his boss, millionaire Arthur Parker invites Richard for dinner with his family. Arthur's daughter Dot (Mackaill) is instantly impressed and infatuated with Richard She vows to marry him within a month.She does but Richard's seeming good luck is short-lived when he discovers how spoiled and selfish Dot really is, draining his finances dry in her greed, and he becomes Dot's \"kept husband.\" Richard eventually convinces her to settle down and be happy on his humble salary.",
    "Director": "Lloyd Bacon",
    "Writer": "Louis Sarecky, Forrest Halsey, Alfred Jackson",
    "Actors": "Clara Kimball Young, Joel McCrea, Dorothy Mackaill",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0022689",
    "tt0022789",
    "tt0020366",
    "tt0021635",
    "tt0021649",
    "tt0021770",
    "tt0022149",
    "tt0022436",
    "tt0022454",
    "tt0022469",
    "tt0022046",
    "tt0021659"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:16.000Z"
}