{
  "movieId": "tt0007361",
  "title": "Snow White",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-snow-white",
      "id": "silent-snow-white",
      "title": "Snow White",
      "fileSize": 1417342110,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-snow-white",
      "language": "English",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 1705
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/snow-white-1916_202507",
      "id": "snow-white-1916_202507",
      "title": "Snow White (1916)",
      "description": "I've been researching newly public domain films from 1929 and earlier, along with other pictures of the era that I find interesting, so I'm uploading the best possible copies that I can find. This classic fairy tale was legendarily cited as the picture that inspired Walt Disney to adapt classic Brothers Grimm tales. It was lost for decades because of a vault fire that destroyed a print. Fortunately, in 1992 a copy was found in Amsterdam and was restored. Contemporary reviews and box office numbers do not seem to have survived, though it obviously made an impact in many ways. ",
      "fileSize": 2139915633,
      "addedAt": "2026-01-07T00:11:24.929Z",
      "thumbnail": "https://archive.org/services/img/snow-white-1916_202507",
      "language": "eng",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 130
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "63 min",
    "imdbRating": 6.3,
    "imdbVotes": 457,
    "Genre": "Fantasy, Romance",
    "Plot": "Snow White is a motherless princess, who arouses the jealousy and hatred of Mary Jane, her mother's former lady-in-waiting, who is the ugliest woman in the kingdom, but aspires to the throne. She gives her heart to the witch, Hex, in return for which she becomes beautiful and wins the love of the king. While hunting, the king falls from his horse and is killed, leaving Mary Jane, who has been rechristened Brangomar, upon the throne. Brangomar forces Snow White to work in the kitchen and takes her lovely clothes away from her. When Snow White accidentally meets a young hunter she becomes interested in him and he is fascinated, though neither has any idea who the other is. So they are dumbfounded when he comes to Snow White's castle and presents a letter to the queen, asking for the hand of Snow White, for he is the Prince Florimund, who has been sent to ask for the hard of the little princess, whom he has never seen. Brangomar, who believed that the prince was coming to sue for her hand, is furious. She decides to kill the little girl and forces old Berthold, a hunter, and Snow White's devoted slave, to promise to kill the child. He is to bring her the heart of Snow White as proof of his act. Berthold takes Snow White into the woods and tells her what he has been forced to promise and she tells him to kill a pig and take its heart back to the queen. While he is doing this, a bird leads Snow White to the cabin of the seven little dwarfs, where she wins their undying gratitude. When the queen discovers that Snow White has escaped her, she tries to kill her with a magic comb and then inveigles her into biting a poisoned apple. Snow White falls prostrate and is discovered by the dwarfs, who carry her body in state to the palace, where the queen rejoices until the furious Prince Florimund threatens to kill her. In the excitement the dwarfs drop the casket, in which there lies the body of Snow White, and she awakens. The apple had stuck in her throat and she had not swallowed it. The witch turns Brangomar into a peacock and all ends happily.",
    "Director": "J. Searle Dawley",
    "Writer": "Winthrop Ames, Jacob Grimm, Wilhelm Grimm",
    "Actors": "Dorothy Cumming, Creighton Hale, Lionel Braham",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001223",
    "tt0000669",
    "tt0002302",
    "tt0011221",
    "tt0000966",
    "tt0032247",
    "tt0036962",
    "tt0034881",
    "tt0014249",
    "tt0056293",
    "tt0038733",
    "tt0033414"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.929Z"
}