{
  "movieId": "tt0000524",
  "title": "New York Subway",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/new-york-subway-1905-directed-by-g.-w.-bitzer",
      "id": "new-york-subway-1905-directed-by-g.-w.-bitzer",
      "title": "New York Subway (1905) Directed By G. W. Bitzer",
      "description": "New York Subway (1905) Director: G.W. Bitzer \"This film documented New York City’s newest marvel, the subway, less than seven months after its opening. What would become the largest system in the world was inaugurated after decades of political wrangling and engineering challenges on October 27, 1904, and photographed by the Biograph cameras on May 21, 1905. The film is not as simple as it first appears. It required coordinating three trains: the one we watch, the one carrying the camera, and a third (glimpsed on the parallel track) to carry the bank of lights. Films that put the spectator at the front of a train had long been a popular novelty, and they became a brief craze later in 1905 with “Hale’s Tours,” which actually sat audiences in mock train carriages. Interior New York Subway, 14th Street to 42nd Street appears to consist of a single shot, although Billy Bitzer paused his camera at least once to shorten our journey. (Bitzer is best known for his later cinematography for D.W. Griffith’s films, including The Lonedale Operator). We travel beneath Manhattan’s East Side on the Interborough Rapid Transit (IRT) from Union Square at 14th Street to Grand Central Station at 42nd Street, where more elegantly dressed subway patrons must never have been recorded. The visual syncopation of the pillars in the subway tunnel was difficult to record—both on film and on our transfer to video—and was a cause for concern when the subway opened. “Is subway travel injurious to the eyes?” the New York Times asked in its opening day reportage, and it provided a practical answer: “A well known oculist says that looking at the rows of white columns is very straining. Therefore, don’t look at them.” —Scott Simmon About the Preservation This film was preserved by the Museum of Modern Art from the original Biograph camera negative.\" - From filmpreservation.org",
      "fileSize": 39961357,
      "addedAt": "2026-01-07T00:10:02.897Z",
      "thumbnail": "https://archive.org/services/img/new-york-subway-1905-directed-by-g.-w.-bitzer",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 148
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-new-york-subway",
      "id": "silent-new-york-subway",
      "title": "New York Subway",
      "fileSize": 90283303,
      "addedAt": "2026-01-07T00:11:07.410Z",
      "thumbnail": "https://archive.org/services/img/silent-new-york-subway",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 777
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "6 min",
    "imdbRating": 5.8,
    "imdbVotes": 819,
    "Genre": "Short, Documentary",
    "Plot": "Starting at Union Square, we are taken for an underground excursion, following the path of a subway train as it makes its way through New York City subway tunnels on its journey to the old Grand Central Station.",
    "Director": "G.W. Bitzer",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0431889",
    "tt0234904",
    "tt0308402",
    "tt1321836",
    "tt3369930",
    "tt0471083",
    "tt4386602",
    "tt0233479",
    "tt2977212",
    "tt0471190",
    "tt6668862",
    "tt4386704"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.410Z"
}