{
  "movieId": "tt0028968",
  "title": "The Gun Ranger",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGunRanger",
      "id": "TheGunRanger",
      "title": "The Gun Ranger",
      "description": "Ranger Dan Larsen (Bob Steele), after Wally Smeed (Ernie Adams) goes unconvicted of killing the father of Molly Pearson (Eleanor Stewart), resigning from the Rangers in order to work undercover to track down the leaders of the outlaw band that runs the town.",
      "fileSize": 1297691730,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGunRanger",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 5708
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RFqRLVx0FzE",
      "id": "RFqRLVx0FzE",
      "title": "The Gun Ranger (1936) BOB STEELE",
      "description": "Stars: Bob Steele, Eleanor Stewart, John Merton\nDirector: Robert N. Bradbury\n\nA lawman who brings in a killer only to see him freed because of corruption turns in his badge & sets out on his own to rid his town of killers & crooked politicians.",
      "addedAt": "2025-12-26T23:47:05.056Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/RFqRLVx0FzE/maxresdefault.webp",
      "duration": 3242,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "56 min",
    "imdbRating": 6.2,
    "imdbVotes": 55,
    "Genre": "Drama, Western",
    "Plot": "Ranger Dan Larsen, after Wally Smeed goes un-convicted of killing the father of Molly Pearson, resigns from the Rangers in order to work undercover to track down the leaders of the outlaw band that runs the town. Molly is made a ward of the Judge and District Attorney Kemper Mills is appointed her guardian. With the help of Carl Beeman, Dan escapes from town after a fight with gang member Bud Cooper. Dan follows Cooper to the cabin headquarters of the gang, where he listens in as the masked boss of the gang tells Smeed his plans to raid Molly's ranch. Dan is captured and the Boss tells Smeed to kill him, but Smeed lets Dan escape after telling Dan he was not the killer of Molly's father. Dan gets to Molly's ranch just as the guardianship papers are about to be signed and warns her against Mills. He is arrested and is been taken back to town by Mills and the Judge. The latter pair get into an argument, Mills shoots the Judge and escapes. Coming back, Dan finds Smeed near the body of the Judge, and Smeed tells Dan that the Judge was his father. Beeman and a group of riders come along and Dan sends them to Molly's ranch to defend it against the raiders. During the raid, the masked Boss captures Molly, and Dan and Smeed set out in pursuit.",
    "Director": "Robert N. Bradbury",
    "Writer": "Homer King Gordon, George H. Plympton",
    "Actors": "Bob Steele, Eleanor Stewart, John Merton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029696",
    "tt0024047",
    "tt0023839",
    "tt0027087",
    "tt0024883",
    "tt0026267",
    "tt0029005",
    "tt0026908",
    "tt0029694",
    "tt0028940",
    "tt0023183",
    "tt0023494"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}