{
  "movieId": "tt0167756",
  "title": "Addio giovinezza!",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/addio-giovinezza_1928",
      "id": "addio-giovinezza_1928",
      "title": "Addio giovinezza!",
      "fileSize": 6883953561,
      "addedAt": "2026-01-07T00:07:18.440Z",
      "thumbnail": "https://archive.org/services/img/addio-giovinezza_1928",
      "language": "Italian",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 377
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "87 min",
    "imdbRating": 5.8,
    "imdbVotes": 23,
    "Genre": "Drama",
    "Plot": "This was one of the key movies of the late Italian silent period, which is not as well-known as many of the spectacles of the mid-teens which had brought Italian cinema its international recognition. Based on a 1911 play by Camasio and Oxilia, this version by Augusto Genina is actually the third made of the work.  The first was in 1913. The second, in 1918, was also directed by Augusto Genina. A 1940 version by Ferdinando M. Poggioli also achieved some acclaim.The movie  is about a student in Turin during the 1920s (moved up from the earlier versions) and his love for a a seamstress.  The student, Mario,  is played by Walter Slezak; the girl Dorina by Carmen Boni.  The femme fatale Elena (Elena Sangro) threatens the relationship. When school days end, seen here as a kind of transitory idyll, it is \"farewell to youth\" as the title states, and a  melancholy goodbye to youthful romances as well to allow new lives to take form.Much of the film is done in interior settings that suggest the piece's theatrical origins.  There are some interesting exteriors as well of the Turin area.  It is an interesting piece of some genuine psychological insight and well performed by the principal actors.",
    "Director": "Augusto Genina",
    "Writer": "Sandro Camasio, Luciano Doria, Augusto Genina",
    "Actors": "Carmen Boni, Walter Slezak, Elena Sangro",
    "Language": "None, Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0248811",
    "tt0018379",
    "tt0017667",
    "tt0017765",
    "tt0018295",
    "tt0017899",
    "tt0336695",
    "tt0019339",
    "tt0017623",
    "tt0017632",
    "tt0017662",
    "tt0017735"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.440Z"
}