{
  "movieId": "tt0171968",
  "title": "The Rajah's Casket",
  "year": 1906,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-rajahs-casket",
      "id": "silent-the-rajahs-casket",
      "title": "The Rajah's Casket",
      "fileSize": 288290438,
      "addedAt": "2026-01-07T00:11:24.923Z",
      "thumbnail": "https://archive.org/services/img/silent-the-rajahs-casket",
      "language": "French",
      "year": 1906,
      "collection": "feature_films",
      "downloads": 341
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LcrinDuRaja",
      "id": "LcrinDuRaja",
      "title": "L'écrin du Raja",
      "description": "The Rajah's Casket A lush moorish or turkic-inspired set design & gorgeous costumes makes The Rajah's Casket a visual thrill. Sundry characters gather before the young rajah, presenting him with gifts, including a casket or treasure chest which is soon stolen by means of magic. A fakir is brought forth who does some sword & fire magic to help uncover the culprit who stole the treasure chest. The fakir leads the Rajah to a room with an enormous window, through which a horned djinn is seen flying by on a smoke-billowing wyvern, clutching the stolen casket. Investigating through a forboding ruin, the fakir & the rajah come upon the djinn's cavern. The rajah draws his sword & destroys the djinn. In the next chamber of the cavern they find the treasure chest, from which arises a beautiful queen dressed in gold & six dancing girls in green. They put on quite a colorful performance, showing a lot of thigh from under their long dresses. The treasure chest is brought to the rajah's palace where the rajah is enthroned with the queen, the maidens dance joyfully, & the vizier discovers the chest also has jewels within.",
      "fileSize": 82556678,
      "addedAt": "2026-01-07T00:06:30.623Z",
      "thumbnail": "https://archive.org/services/img/LcrinDuRaja",
      "language": "French",
      "year": 1906,
      "collection": "feature_films",
      "downloads": 23502
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 5.4,
    "imdbVotes": 127,
    "Genre": "Short, Fantasy",
    "Plot": "At his palace, the Rajah's casket of jewels is stolen by an evil sorcerer. The Rajah's henchmen go on a search for the valuable casket and find it hidden in a cave, and out of the casket rises a bevy of dancing girls who in turn dance for the delight of the Rajah to end the film.",
    "Director": "Gaston Velle",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0449181",
    "tt0449308",
    "tt0223340",
    "tt3100486",
    "tt0257889",
    "tt0298570",
    "tt0000546",
    "tt0135122",
    "tt0216016",
    "tt0215575",
    "tt0215749",
    "tt0000575"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:13:14.948Z"
}