{
  "movieId": "tt0151255",
  "title": "Krazy's Shoe Shop",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/krazys-shoe-shop-1939",
      "id": "krazys-shoe-shop-1939",
      "title": "Krazy's Shoe Shop (1939)",
      "description": "Shoe clerk Krazy gets beaned on the noggin, and the entire contents of his shoe shop comes to (musical) life! Features caricatures of Mae West, Charlie Chaplin and Laurel and Hardy - as shoes! The animated shoes sing, march and perform \"The Peanut Vendor,\" but hell breaks loose when Krazy awakens. A bit of throwback to the very snappiest early 1930s cartoon musicals. Watch on RetroFlix:  https://retroflix.org/krazys-shoe-shop-1939/",
      "fileSize": 88662886,
      "addedAt": "2026-01-07T00:09:24.701Z",
      "thumbnail": "https://archive.org/services/img/krazys-shoe-shop-1939",
      "language": "eng",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 116
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.7,
    "imdbVotes": 11,
    "Genre": "Animation, Short",
    "Plot": "When Krazy Kat is doing errands around the store, she knocks herself out. This merchandise proceeds to grow arms and legs and wander around the store in this late cartoon from Ben Harrison and Manny Gould.It's a fairly typical cartoon of its kind from the era, with lots of visual puns -- the shoes' tongues turn into literally rendered human tongues -- and a few Hollywood celebrities show up, including Mae West. The only point of note is that it's tied into an established series, one which required payment to an outside entity: King Features. Perhaps there was something in the contracts: the only cartoons from this team which do not involve Krazy Kat are Technicolor ones.It's a black and white cartoon. The background work is excellent. Columbia's cartoons in this period may have been chaotically produced, but the staff was always competent and turned out a good-looking product.",
    "Director": "Manny Gould, Ben Harrison, Allen Rose",
    "Writer": "George Herriman, Allen Rose",
    "Actors": "Mel Blanc",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150749",
    "tt0150803",
    "tt0151377",
    "tt0151251",
    "tt0150959",
    "tt0151256",
    "tt0151254",
    "tt0152136",
    "tt0150914",
    "tt0151253",
    "tt0151536",
    "tt0031213"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.701Z"
}