{
  "movieId": "tt0152017",
  "title": "Police Dogged",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/police-dogged-1956",
      "id": "police-dogged-1956",
      "title": "Police Dogged (1956)",
      "description": "Police Dogged is a Terrytoons cartoon directed by Connie Rasinski. Watch on RetroFlix:  https://retroflix.org/police-dogged-1956/",
      "fileSize": 36754035,
      "addedAt": "2026-01-07T00:10:21.537Z",
      "thumbnail": "https://archive.org/services/img/police-dogged-1956",
      "language": "eng",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 59
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "7 min",
    "imdbRating": 6.2,
    "imdbVotes": 12,
    "Genre": "Animation, Short",
    "Plot": "In spite of the fact that some Keyword contributor used 'Clancy the Bull' on this cartoon, the star is none other than Clancy the Bulldog, famed police-dog, and there isn't a bull anywhere in sight on this film. What there is is a master criminal named Shlobotka doing some after-hours midnight work at the bank and, being somewhat cocky, he places a call to the police station just to let them know what he is up to.Clancy (the bulldog) answers the phone and then crawls into the phone in pursuit of Shlobotka. Clancy gets tossed into a trunk and dumped into the river, escapes and keeps up his pursuit of Shlobotka and his gang. He gets them all but the master-mind. What Clancy (the bulldog) thinks is a \"living doll\" of the female-persuasion approaches him---she had already knocked him out before he got tossed in the trunk---, but sleuth that he is, Clancy (the bulldog), unmasks her as Shlobotka, and the cross-dressing transvestite wants to know how Clancy (the bulldog) knew he wasn't a girl. Clancy (the bulldog) has the lamest exit-line in the history of cartoons.",
    "Director": "Connie Rasinski",
    "Writer": "Tom Morrison (story)",
    "Actors": "Doug Moye",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149775",
    "tt0150408",
    "tt0150751",
    "tt0150989",
    "tt0150148",
    "tt0150890",
    "tt0151406",
    "tt0151794",
    "tt0151906",
    "tt0152315",
    "tt0150151",
    "tt0153469"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.537Z"
}