{
  "imdbId": "tt0193048",
  "title": "El centroforward murió al amanecer",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-centroforward-murio-al-amanecer-1961",
      "id": "el-centroforward-murio-al-amanecer-1961",
      "title": "El Centroforward Murio Al Amanecer(1961)",
      "description": "El centroforward murió al amanecer  es una  película argentina   dramática  en  blanco y negro  de 1961 dirigida por  René Mugica  y protagonizada por  Luis Medina Castro ,  Raúl Rossi ,  Enrique Fava ,  Didi Carli ,  Camilo Da Passano ,  Javier Portales  y  Pierina Dealessi . Fue escrita por  Agustín Cuzzani  y basada en  la obra teatral del mismo nombre , también de Cuzzani. La coreografía estuvo a cargo de  María Ruanova . Fue la  ópera prima  de Mugica, y representó a la Argentina en el  Festival Internacional de Cine de Cannes  en 1961 y por ella fue nominado al premio \" Palma de Oro \" al Mejor Director. Fue estrenada el 22 de junio de 1961. La película es fiel a la obra original y, en especial, al espíritu libertario de Agustín Cuzzani, surrealista a la criolla. La acción se divide en dos partes sucesivas y complementarias: la primera de intención realista, rica en detalles descriptivos y humor costumbrista, y la segunda, abiertamente volcada al terreno de la alegoría fantástica. El tono y el tratamiento formal cambia apropiadamente de un universo al otro, con un despliegue de imaginación visual que es atípico en el cine argentino de cualquier período. (Wikipedia) Sinopsis “Cacho” Garibaldi (Luis Medina Castro), habilidoso jugador de fútbol, es comprado por un millonario llamado Lupus (Raúl Rossi) y en una noche tormentosa es trasladado a la mansión de Lupus, una combinación de palacio, cárcel y fortaleza. Allí Cacho Garibaldi se entera de que Lupus es un coleccionista de seres humanos excepcionales, a los que Cacho conoce en ese momento, y que el futbolista nunca más podrá volver a jugar ni a salir del lugar. Cacho se enamora de otra prisionera, una bailarina, y tratan de escapar; no lo consiguen y Cacho mata a Lupus y termina fusilado por los guardias. Reparto Luis Medina Castro Raúl Rossi Enrique Fava Didí Carli Camilo Da Passano Javier Portales Pierina Dealessi Félix Daniel Frascara Lalo Hartich Roberto Maidana Arturo Arcari Francisco Pablo Donadío Víctor Martucci Eduardo Vargas",
      "fileSize": 1214591993,
      "addedAt": "2026-01-07T00:08:15.377Z",
      "thumbnail": "https://archive.org/services/img/el-centroforward-murio-al-amanecer-1961",
      "language": "spa",
      "year": 1961,
      "collection": "feature_films",
      "downloads": 64
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 7.9,
    "imdbVotes": 34,
    "Genre": "Drama",
    "Plot": "Cacho Garibaldi is the soccer player of the moment, his goals lead to delirium fans. When an eccentric millionaire named Lupus buys his transfer, he believes he has reached the pinnacle of fame.",
    "Director": "René Múgica",
    "Writer": "Agustín Cuzzani",
    "Actors": "Arturo Arcari, Didi Carli, Camilo Da Passano",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0320366",
    "tt0192994",
    "tt0054809",
    "tt0054817",
    "tt0053987",
    "tt0053712",
    "tt0054627",
    "tt0056027",
    "tt0055230",
    "tt0055117",
    "tt0055278",
    "tt0055867"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.377Z"
}