{
  "movieId": "tt0184223",
  "title": "Armiño negro",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/armino-negro-1953",
      "id": "armino-negro-1953",
      "title": "Armiño Negro( 1953)",
      "description": "Armiño negro  es una película en blanco y negro de  Argentina  dirigida por  Carlos Hugo Christensen  según el guion de  Pedro Juan Vignale  sobre la obra de  Rafael Maluenda  que se estrenó el 27 de agosto de 1953 y que tuvo como protagonistas a  Laura Hidalgo ,  Roberto Escalada ,  Néstor Zavarce  y  Nicolás Fregues . (Wikipedia) Sinopsis En la capital peruana de  Lima , una mujer atractiva mantiene un estilo de vida lujoso al tomar una serie de amantes adinerados. Cuando su hijo regresa de la escuela, lo lleva de vacaciones a Cuzco para visitar el sitio de  Machu Picchu  . Mientras que allí conoce y se enamora de un pintor argentino , a quien su hijo admira enormemente. Al regresar a Lima, se aleja de sus antiguos amantes, incluido un torero que está enamorado de ella. Pero, muy endeudada, decide pasar una última noche con uno de sus pretendientes para pagar sus cuentas, pero con trágicas consecuencias para su relación con su hijo Reparto Laura Hidalgo Roberto Escalada Néstor Zavarce Nicolás Fregues Bernardo Perrone Ricardo Galache Enrique Abeledo  …Marcial Gloria Ferrandiz Federico Mansilla Aurelia Ferrer Pascual Nacaratti Juan Villarreal  …Extra",
      "fileSize": 2089508359,
      "addedAt": "2026-01-07T00:07:25.000Z",
      "thumbnail": "https://archive.org/services/img/armino-negro-1953",
      "language": "spa",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 150
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "104 min",
    "imdbRating": 7,
    "imdbVotes": 80,
    "Genre": "Drama",
    "Plot": "Even when plot is quite old fashioned -a classy whore living on high class'money-, there's something that still works. Cinematography is beautiful and with a special texture framing Peruvian landscapes. On the other hand, director Christensen tries -and tries hard- to get some professional acting from the performers. He doesn't succeed. But there is something strange, perhaps the atmosphere, the repression, the sexual hypocrisy of the 50's that is extremely appealing to a postmodernist viewer. There is something to talk about from the doctoral point of view and it's the violence of star Laura Hidalgo as well as the warm personality of the then teenager Venezuelan Nestor Zavarce. But most of the characters are stereotypes. However, this movie shows how old studios could sell a product. And how people bought it!",
    "Director": "Carlos Hugo Christensen",
    "Writer": "Rafael Maluenda, Pedro Juan Vignalle",
    "Actors": "Laura Hidalgo, Roberto Escalada, Néstor Zavarce",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0185043",
    "tt0184326",
    "tt0158482",
    "tt0184960",
    "tt0184188",
    "tt0184612",
    "tt0038445",
    "tt0034592",
    "tt0178312",
    "tt0153331",
    "tt0047848",
    "tt0193798"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:25.000Z"
}