{
  "movieId": "tt0153890",
  "title": "The Wolf's Pardon",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-wolfs-pardon-1947",
      "id": "the-wolfs-pardon-1947",
      "title": "The Wolf's Pardon (1947)",
      "description": "In the last 10 years, much has changed in the world of Mother Goose. Little Boy Blue is now a hot jazz trumpeter; Little Tommy Tucker is a crooner; Tom Tom the Piper's Son is a cop; and the Big Bad Wolf is about to be paroled. He visits the three little pigs, but they're bigger than him now and run a construction company. Finally, he goes after Little Red Riding Hood; as expected, she's all grown up now, and as he approaches from behind, she's playing the piano, singing beautifully, and looks great until she turns around, wearing glasses, buck teeth, and looking just plain ugly. She's also man crazy, and chases after the wolf, who finally escapes into a soda shoppe where he's smothered with kisses from all the girls there. Watch on RetroFlix:  https://retroflix.org/the-wolfs-pardon-1947/",
      "fileSize": 38830551,
      "addedAt": "2026-01-07T00:12:33.206Z",
      "thumbnail": "https://archive.org/services/img/the-wolfs-pardon-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 119
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "6 min",
    "imdbRating": 6.6,
    "imdbVotes": 20,
    "Genre": "Animation, Comedy, Short",
    "Plot": "In the last 10 years, much has changed in the world of Mother Goose. Little Boy Blue is now a hot jazz trumpeter; Little Tommy Tucker is a crooner; Tom Tom the Piper's Son is a cop; and the Big Bad Wolf is about to be paroled. He visits the three little pigs, but they're bigger than him now and run a construction company. Finally, he goes after Little Red Riding Hood; as expected, she's all grown up now, and as he approaches from behind, she's playing the piano, singing beautifully, and looks great until she turns around, wearing glasses, buck teeth, and looking just plain ugly. She's also man crazy, and chases after the wolf, who finally escapes into a soda shoppe where he's smothered with kisses from all the girls there.",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0147188",
    "tt0147876",
    "tt0153916",
    "tt0148633",
    "tt0148143",
    "tt0151663",
    "tt0148117",
    "tt0150362",
    "tt0159281",
    "tt0150361",
    "tt0148128",
    "tt0146905"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.206Z"
}