{
  "movieId": "tt0182405",
  "title": "Sands of Sacrifice",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-sands-of-sacrifice",
      "id": "silent-sands-of-sacrifice",
      "title": "Sands of Sacrifice",
      "fileSize": 579163385,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-sands-of-sacrifice",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 292
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Drama",
    "Plot": "When the unruly drinking party at \"Big Bill\" Darcey's hunting lodge runs out of liquor, they move to the lodge of Darcey's agent, Enoch Foyle, and finding attractive Nora Farnes waiting alone, harass her. Bill, who previously was interested only in pleasure, with his consumptive friend Sammy Goode, protects Nora, who, armed with a revolver, intends to confront Foyle for swindling her mother. When Foyle returns, Nora wounds him slightly. Bill brings her to his lodge for the night, and falling in love, convinces her to marry him to protect her name. As he is preparing to leave on his honeymoon, Bill learns that Foyle fleeced him of his fortune. Finding Nora at Foyle's lodge, he loses faith in her, and leaves with Sammy for the desert because of Sammy's illness. Lost and exhausted, Sammy makes a dying request that Bill return and listen to Nora's explanation. After Bill's rescue, he finds Nora dining with Foyle, but upon learning that she has hidden detectives to overhear Foyle's confession, Bill is reconciled with Nora, and they finish the dinner.",
    "Director": "Edward Sloman",
    "Writer": "Harvey Gates",
    "Actors": "William Russell, Francelia Billington, George Periolat",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010729",
    "tt0018457",
    "tt0009937",
    "tt0008663",
    "tt0008519",
    "tt0008133",
    "tt0007801",
    "tt0008662",
    "tt0008188",
    "tt0008259",
    "tt0008443",
    "tt0007711"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}