{
  "movieId": "tt0152275",
  "title": "Salty McGuire",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/salty-mc-guire-1937",
      "id": "salty-mc-guire-1937",
      "title": "Salty McGuire (1937)",
      "description": "Salty McGuire is a Terrytoons cartoon directed by Mannie Davis, George Gordon. Watch on RetroFlix:  https://retroflix.org/salty-mcguire-1937/",
      "fileSize": 34256846,
      "addedAt": "2026-01-07T00:10:40.952Z",
      "thumbnail": "https://archive.org/services/img/salty-mc-guire-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 34
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4,
    "imdbVotes": 8,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1937, like all the other years for Terrytoons, saw a hit and miss batch, more so than the other years even. Of which 'Salty McGuire' is one of the middling ones ranking it in correlation with the rest of the Terrytoons and one of the middling 1937 cartoons. It is an unexceptional, nothing exactly special cartoon and has the same amount of problems as it has the amount of strengths. 'Salty McGuire' is also watchable, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see, as is the comparatively improved fluidity of drawing and movement, and some synchronisation is neat.A few amusing moments and there is some zest and natural charm. The hippo pirate is a fun antagonist, showing the most personality of the characters even if he is a fairly typical Terrytoons antagonist.Some of the transitions however are a touch crude.Likewise, the story is paper thin and formulaic, once again with nothing new to a melodramatic and old premise. Gags aren't enough, they are not always very organised (fairly scattershot), and there is not much especially memorable about some and some don't serve much point. The cartoon tends to veer towards being too cute and a lot of it is pretty predictable. Some choppiness too and the cartoon feels very old fashioned with the love interests being bland.Overall, watchable if unexceptional. 5/10 Bethany Cox",
    "Director": "Mannie Davis, George Gordon",
    "Writer": "Joseph Barbera, Dan Gordon, Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149974",
    "tt0150602",
    "tt0151876",
    "tt0152157",
    "tt0152298",
    "tt0149870",
    "tt0149929",
    "tt0150861",
    "tt0153103",
    "tt0153240",
    "tt0149808",
    "tt0149981"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.952Z"
}