{
  "imdbId": "tt0149364",
  "title": "When the West Was Young",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-when-the-west-was-young",
      "id": "silent-when-the-west-was-young",
      "title": "When the West Was Young",
      "fileSize": 215418362,
      "addedAt": "2026-01-07T00:11:24.927Z",
      "thumbnail": "https://archive.org/services/img/silent-when-the-west-was-young",
      "language": "English",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 519
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "13 min",
    "imdbRating": 4.7,
    "imdbVotes": 23,
    "Genre": "Short, Western",
    "Plot": "Hearing a noise outside the door of his cabin, Tom Bowles, a frontiersman, opens the door cautiously and sees outside an Indian, faint with hunger. After the man has been fed he leaves the cabin and continues on his way, his heart filled with gratitude. The Indian, Black Hawk, finds the tracks of other Indians, whom he judges to be on the warpath, and returns to warn the trapper to be on his guard. Bowles will not believe him, but insists on being shown the trail. He goes out with Black Hawk, but is caught in an ambush by the Indians and mortally wounded. Black Hawk assists him back to the cabin, where he dies. Before he passes away he commends his little daughter to the Indian's care. Having buried the trapper, Black Hawk sets out for the fort with the child. His trail is discovered by the hostile Indians, who follow him. When he finds that he is pursued, Black Hawk increases his speed, but is hampered by the slow progress of the little girl. For a short time he manages to throw his enemies off the trail but they catch up again within a short distance of the fort. An arrow fired by one of the Indians pierces him in the back, but he still struggles on. With the fort in sight he sinks to the ground, first pointing it out to the child and urging her to run there, at the same time giving her the bag of dust entrusted to his care. Soldiers rush out and take her into their arms, rushing with her to the assistance of the Indian, who is dying, and saving him from the scalping knife of his pursuers, who are easily frightened off. Black Hawk sinks lifeless upon the ground, faithful to his trust till death.",
    "Director": "William J. Bauman",
    "Writer": "Hanson Durham",
    "Actors": "George Holt, George Stanley, Maxine Elliott Hicks",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0003662",
    "tt0003578",
    "tt0233246",
    "tt0329121",
    "tt0003943",
    "tt0002521",
    "tt0002282",
    "tt0002585",
    "tt0002176",
    "tt0002281",
    "tt0004209",
    "tt0373736"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.927Z"
}