{
  "movieId": "tt0142333",
  "title": "The Gown of Destiny",
  "year": 1917,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mymovie_202003",
      "id": "mymovie_202003",
      "title": "\"The Gown of Destiny\" (1917)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Gown of Destiny\" is a war drama. The events in the film occur during World War I. A Frenchman is denied the chance to fight for his country as a soldier, but still makes an impact in the war effort.   Directed by                    Lynn Reynolds Produced by                  Triangle Film Corporation Starring                          Alma Rubens, Herrera Tejedde, Allan Sears, Lillian West, Bliss Chevalier, J. Barney Sherry, Frederick Vroom Release date                   December 30, 1917 Running time                 60 minutes Country                          USA Language                        Silent film, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 40565983,
      "addedAt": "2026-01-07T00:09:54.334Z",
      "thumbnail": "https://archive.org/services/img/mymovie_202003",
      "year": 1917,
      "collection": "feature_films",
      "downloads": 12611
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "50 min",
    "imdbRating": 6.6,
    "imdbVotes": 19,
    "Genre": "Drama, War",
    "Plot": "Rejected by the army because of his petite size, French dress designer Andre Leriche conceives the idea of designing a gown that will aid his country. His employer, Madame Felice, sells the gown to Mrs. Mortimer Reyton, a middle-aged woman who is gradually losing the love of her husband. The gown so transforms her that, in honor of their wedding anniversary, Reyton buys three ambulances for France. Mrs. Reyton then sends the gown to her cousin Natalie. The garment so inspires Englishman Neil Cunningham that, to win Natalie's love, he returns home to enlist. In France, Neil proves himself a hero and, while leading an attack on a German stronghold, saves Andre's father, the mayor of the town, from death. Thus, the gown made a reality of Andre's dream to serve his country.",
    "Director": "Lynn Reynolds",
    "Writer": "Earl Derr Biggers, Lynn Reynolds",
    "Actors": "Alma Rubens, Herrera Tejedde, Allan Sears",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005719",
    "tt0008663",
    "tt0008188",
    "tt0008359",
    "tt0011317",
    "tt0009150",
    "tt0009406",
    "tt0009737",
    "tt0009766",
    "tt0012775",
    "tt0004972",
    "tt0009915"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.334Z"
}