{
  "movieId": "tt0161590",
  "title": "The Frame-Up",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-frame-up-1938",
      "id": "the-frame-up-1938",
      "title": "The Frame-Up (1938)",
      "description": "The Frame-Up is a Terrytoons cartoon directed by Connie Rasinski. Watch on RetroFlix:  https://retroflix.org/the-frame-up-1938/",
      "fileSize": 39492012,
      "addedAt": "2026-01-07T00:11:57.687Z",
      "thumbnail": "https://archive.org/services/img/the-frame-up-1938",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 60
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4,
    "imdbVotes": 7,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1938, like all the other years for Terrytoons, saw a hit and miss batch, more so than the other years even. Of which 'The Frame Up' is one of the middling ones ranking it in correlation with the rest of the Terrytoons and one of the middling 1938 cartoons. It is an unexceptional, nothing exactly special cartoon and has the same amount of problems as it has the amount of strengths. 'The Frame Up' is also watchable, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see, as is the comparatively improved fluidity of drawing and movement, and some synchronisation in movement and sound is neat.A few amusing moments, some imaginative and there is some zest and natural charm, and parts of it and the basic set up are nicely done. The supporting characters are quite well done, the most interesting being the boxing champion, the ending is cute if obvious.Outside of the backgrounds and more fluidity than seen previously however, a few of the transitions are not always polished.Likewise, the story is paper thin and formulaic with not an awful lot to it (like the cartoon in general) and doing little with a premise that's hardly new. Gags aren't enough, they are not always very organised (fairly scattershot), and there is not much especially memorable about some and some don't serve much point. The cartoon tends to veer towards being too cute and a lot of it is pretty predictable from being a familiar premise for Terrytoons. Some choppiness too and the cartoon feels very old fashioned and basic with Gandy once again not being the most appealing of characters.All in all, watchable. 5/10 Bethany Cox",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Arthur Kay",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148083",
    "tt0153891",
    "tt0161719",
    "tt0152971",
    "tt0150835",
    "tt0150921",
    "tt0151300",
    "tt0149595",
    "tt0149799",
    "tt0149800",
    "tt0146780",
    "tt0151295"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.687Z"
}