{
  "movieId": "tt0161863",
  "title": "Noah's Outing",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/noahs-outing-1932",
      "id": "noahs-outing-1932",
      "title": "Noah's Outing (1932)",
      "description": "This short is largely a re-telling of the Noah's Ark story, with modifications, in the style of Terrytoons. Farmer Al Falfa is basically Noah here. Watch on RetroFlix:  https://retroflix.org/noahs-outing-1932/",
      "fileSize": 34910220,
      "addedAt": "2026-01-07T00:10:02.899Z",
      "thumbnail": "https://archive.org/services/img/noahs-outing-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 62
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.9,
    "imdbVotes": 33,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. 'Noah's Outing' is neither among the best or worst Terrytoons. Somewhere around average middle more like, and that is true also ranking it with the other Terrytoons batch from 1932. It is nonetheless a worthwhile enough outing. Its main reason for viewing is mainly for anybody striving to see every Terrytoons available like me. Again though that is not the sole reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. There is some nice detail and ambition in the backgrounds.Pacing is neither too hectic or dull generally, there is a natural charm and the gags are plenty, well timed, fun and a nice mix of absurdist and cute. Father Al Falfa is amusing.However, as is the case with a lot of the Terrytoons cartoons, the character designs are crude and simplistic.Story is very flimsy, obvious and choppy. The supporting characters are pretty bland and there are other parts where the pace needed more of a kick. Overall, decent if unexceptional. 6/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149979",
    "tt0149991",
    "tt0150160",
    "tt0150165",
    "tt0150515",
    "tt0161563",
    "tt0150516",
    "tt0150933",
    "tt0150945",
    "tt0151076",
    "tt0161913",
    "tt0151997"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.899Z"
}