{
  "imdbId": "tt0152480",
  "title": "Slow Beau",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/slow-beau-1930",
      "id": "slow-beau-1930",
      "title": "Slow Beau (1930)",
      "description": "An old-time Mississippi paddle-wheel showboat docks, and Krazy tries to serenade the girl that's the star attraction, but he has a hippo-faced rival. When the programme commences, She sings a long song with many gestures, though the song is a lot of holding long notes. Krazy and his rival are in balconies on either side of the stage. When her performance stops, Hippo guy does a dance, but Krazy sees to it he loses his trousers. Krazy then puts on a dance of his own, but slips up on banana skins. The audience pelts him with vegetables, shoes and irons. Watch on RetroFlix:  https://retroflix.org/slow-beau-1930/",
      "fileSize": 111571961,
      "addedAt": "2026-01-07T00:11:24.929Z",
      "thumbnail": "https://archive.org/services/img/slow-beau-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 84
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 4.8,
    "imdbVotes": 19,
    "Genre": "Animation, Short",
    "Plot": "An old-time Mississippi paddle-wheel showboat docks, and Krazy tries to serenade the girl that's the star attraction, but he has a hippo-faced rival. When the programme commences, She sings a long song with many gestures, though the song is a lot of holding long notes. Krazy and his rival are in balconies on either side of the stage. When her performance stops, Hippo guy does a dance, but Krazy sees to it he loses his trousers. Krazy then puts on a dance of his own, but slips up on banana skins. The audience pelts him with vegetables, shoes and irons.",
    "Director": "Manny Gould, Ben Harrison",
    "Writer": "George Herriman",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150944",
    "tt0151115",
    "tt0151290",
    "tt0149785",
    "tt0150334",
    "tt0150513",
    "tt0150850",
    "tt0152219",
    "tt0152506",
    "tt0152717",
    "tt0152862",
    "tt0152598"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.929Z"
}