{
  "imdbId": "tt0178979",
  "title": "Welding the Big Ring",
  "year": 1904,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WeldingTheBigRing1904",
      "id": "WeldingTheBigRing1904",
      "title": "\"Welding the Big Ring\" (1904) cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   \"Welding the Big Ring\" is a very short documentary.  The film is included in our program to illustrate the work of Billy Bitzer, a star of Silent Hall of Fame. The film is part of the series \"Westinghouse Works\" (1904), which was added to the National Film Registry in 1998 as being deemed \"culturally, historically, or aesthetically significant\". Let's all give our thanks to the Library of Congress for preserving this film and making it available to the public. Directed by                       unknown Cinematography by         Billy Bitzer Starring                             unknown Distributed by                   Biograph Company Release date                      April 28, 1904 Country                             United States Running time                    6 m. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 82721523,
      "addedAt": "2026-01-07T00:07:11.888Z",
      "thumbnail": "https://archive.org/services/img/WeldingTheBigRing1904",
      "year": 1904,
      "collection": "feature_films",
      "downloads": 1260
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.9,
    "imdbVotes": 135,
    "Genre": "Documentary, Short",
    "Plot": "A group of men weld one area of a large ring in a fire. They lift the ring, which is hanging horizontally on chains, out of the fire. Four men hammer the hot area on the ring into shape while the remaining men hold the ring. They put the ring into the fire again, take it out, and take it over to a machine which continuously hammers down on that area of the ring. The men then take it away from the machine and hammer it themselves into shape. The ring is presumably a piece of a generator.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0178247",
    "tt0334912",
    "tt3100486",
    "tt0178309",
    "tt0178981",
    "tt3112348",
    "tt0178341",
    "tt0178492",
    "tt0178813",
    "tt0178812",
    "tt0178914",
    "tt0178933"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.888Z"
}