{
  "movieId": "tt0145536",
  "title": "A Tray Full of Trouble",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-payment-in-full",
      "id": "silent-payment-in-full",
      "title": "Payment in Full",
      "fileSize": 1026772783,
      "addedAt": "2026-01-07T00:11:15.971Z",
      "thumbnail": "https://archive.org/services/img/silent-payment-in-full",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 339
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "20 min",
    "imdbRating": 4.7,
    "imdbVotes": 14,
    "Genre": "Short, Comedy",
    "Plot": "While I didn't hate this silent comedy as much as the other review, I certainly could see how this could make people wince here in the 21st century--especially PETA-types. However, my concern was much less for the animals being tortured but the safety of the baby! While a kitten was practically drowned and man-handled by the baby and the chimp did come crazy stuff (smoking, playing with guns, etc.), I kept thinking how irresponsible it was to allow a chimp to be so close to an infant. While this chimp seemed very gentle and sweet, this species has been known to eat babies--I am NOT exaggerating! Any parent that would let the kid play with the chimp was just nuts! Perhaps the folks at Educational Films had a huge supply of throwaway kids and animals--so when they DID get killed or maimed they had a backup!! As for the film itself, despite the animal and child torment, the movie is actually pretty cute and well made for a silent. Sure, with today's sensibilities it all seems terribly campy and silly--for 1920, it was better than the average comedy. Some of the scenes with the chimp were pretty funny, I hate to admit.By the way, if you know any sanctimonious vegans or PETA members, show this film to them and pretend you like it and see no problem with the way they treated the animals! Then, sit back and watch their heads explode!! What fun.",
    "Director": "William Campbell",
    "Writer": "N/A",
    "Actors": "Snooky, Harry Burns, Ida Mae McKenzie",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0011656",
    "tt0011071",
    "tt0367898",
    "tt1598572",
    "tt0011508",
    "tt0011521",
    "tt0011541",
    "tt0011263",
    "tt0011293",
    "tt0010258",
    "tt0011144",
    "tt0011129"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.971Z"
}