{
  "movieId": "tt0141994",
  "title": "Wolf Riders",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2RZ0WinpdNI",
      "id": "2RZ0WinpdNI",
      "title": "Wolf Riders (1935) JACK PERRIN",
      "description": "Stars: Jack Perrin, Lillian Gilmore, Lafe McKee\nDirector: Harry S. Webb\n\nDeputy Indian Agent is framed for the murder of a captured fur thief actually killed by his boss in rivalry for affections of a saloon girl.",
      "addedAt": "2025-12-24T01:07:05.693Z",
      "thumbnail": "https://i.ytimg.com/vi/2RZ0WinpdNI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB9E5lSPg0l6P_kuS7_6uVQ1uglfg",
      "duration": 3429,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "56 min",
    "imdbRating": 6.1,
    "imdbVotes": 27,
    "Genre": "Western",
    "Plot": "A friendly Indian, Red Wolf is entrusted by a dying settler, killed by white renegades, to take his baby boy. When the boy is five, Red Wolf turns him over to Frank Clark, the Wolfville Indian Agent, to make certain he will be with his own race and receive a white man's education. The boy, Jack Jennings grows up and is given a commission as Inspector of the Indian Agency, and is in love with Clark's daughter, Mary. He is kept busy fighting the outlaws who are stealing furs from his Indian friends. The gang leader, Al Pierce, has a fight with saloon owner Butch Weldon, organizer and brains behind the fur-theft gang, over the favors of dance hall queen Peggy Packard, and Al threatens to reveal the gang's entire operation to Jack unless Butch keeps away from Peggy. Killing two birds with one stone, Butch kills Al and frames Jack for the murder. Jack is jailed. Jack escapes when the revenge-seeking Peggy shoots at him and misses as he is being taken to the County Seat to get away from a Weldon-led lynch mob. Jack returns, disguised as an Indian who hates Red Wolf, and involves Weldon in a fur robbery scheme in order to trap him and clear his own name. A posse is riding after the tricked fur thieves, with Peggy in the lead intent on shooting Jack, who she still thinks killed her lover. Red Wolf, making Weldon think he is trying to help him escape, talks him into changing clothes with Jack.",
    "Director": "Harry S. Webb",
    "Writer": "Carl Krusada, Lewie C. Borden",
    "Actors": "Jack Perrin, Lillian Gilmore, Lafe McKee",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0024942",
    "tt0026790",
    "tt0026130",
    "tt0026602",
    "tt0028218",
    "tt0027084",
    "tt0027610",
    "tt0031861",
    "tt0031301",
    "tt0026650",
    "tt0022555",
    "tt0026999"
  ],
  "collections": [],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-21T03:48:31.821Z"
}