{
  "imdbId": "tt0162496",
  "title": "Nobleza gaucha",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nobleza-gaucha-1915",
      "id": "nobleza-gaucha-1915",
      "title": "Nobleza Gaucha (1915)",
      "description": "Nobleza gaucha  es una película  argentina  muda, en blanco y negro, dirigida por  Humberto Cairo , jefe de producción de la empresa de  Julián de Ajuria , [ 1 ] ​  Ernesto Gunche  y  Eduardo Martínez de la Pera , con guion de  José González Castillo  sobre los poemas  Martín Fierro  de  José Hernández  y  Santos Vega   de  Rafael Obligado . Se estrenó en 1915 y tuvo como protagonistas a  Orfilia Rico , Arturo Mario, María Padín, Celestino Petray y Julio Scarcella. En 1937 se realizó una nueva versión con sonido. Fragmentos de este filme fueron incluidos en la película  Aller simple (Tres historias del Río de la Plata)  (1998). [ 2 ] ​(Wikipedia) Sinopsis Don José Gran, un rico empresario porteño, viaja a  La Pampa  en busca de caballos. Contrata a Juan, un noble  gaucho  que se gana la vida domesticando caballos, para que le ayude en su búsqueda. Ese mismo día, Juan rescata a una  damisela en apuros , María, de un caballo enloquecido. Don José Gran luego secuestra a María y regresa con ella a Buenos Aires. Juan decide ir al centro y rescatarla; un compañero del rancho, Don Genaro, lo acompaña. Juan y Don Genaro intentan ir en carreta a Buenos Aires, pero el vehículo se atasca, por lo que toman el tren. Una vez en Buenos Aires, piden direcciones y terminan persiguiendo un tranvía que huye y los lleva hasta la mansión de la abuela. Don Genaro se mete en problemas por fumar en el tranvía y decide no involucrarse en el rescate de María, prefiriendo ir a comprar provisiones. Juan se infiltra en la mansión y espera que llegue Don Gran; luego lucha contra Gran y lo domina. Juan supone que María, que había sido agredida previamente por Gran, está muerta y él la llora. Cuando María se despierta, Gran se acerca sigilosamente detrás de Juan, listo para matarlo, pero Juan bloquea la puñalada y lo vence una vez más. Cuando Juan está a punto de matar a Gran, María lo detiene, alegando que un gaucho nunca mataría a un hombre indefenso. Se escapan de la mansión y abordan felices el tren a casa. El último plano muestra a Don Genaro camino al tren, perdiendo el paso y esparciendo sus provisiones por la calle. Los levanta, hace un gesto con la mano a los niños para que se alejen y sigue su camino. Después de que María y Juan regresan al campo, Gran planea una venganza. Habla con el comisario y acusa falsamente a Juan de ser un \"cuatrero\". El comisario inicia la búsqueda de Juan. María le dice a Juan que escape. Juan encuentra a Gran y comienza una persecución a caballo. Gran alcanza una zanja y cae. Juan baja y trata de ayudarlo, pero Gran muere. La justicia gana. Produccion Las escenas de exteriores fueron filmadas en la estancia “La Armonía” y las de interior sobre la escenografía construida en la terraza de una mueblería y en otros escenarios auténticos de Buenos Aires. Su estreno fue un fracaso, pero José González Castillo tuvo la feliz idea de sustituir casi todas las leyendas explicativas del filme con fragmentos de los poemas  Martín Fierro  y  Santos Vega , obteniendo en su segundo estreno un éxito clamoroso que permitió que los $20,000.00 pesos que costó la película se convirtieran en $600,000.00 pesos de ingresos. Una idea de la popularidad del filme la da el hecho de que llegó a darse simultáneamente en 25 cines porteños y además que fue vista en  España ,  Brasil  y otros países latinoamericanos. Una compañía  yerbatera  aprovechó para utilizar la marca “Nobleza gaucha” para su producto y la continúa usando hasta la fecha. Comentario El hecho de que la acción se desarrollara tanto en el campo como en la ciudad permitió contrastar la vida en uno y otro ambiente, y mostrar a los habitantes de la ciudad aspectos típicos de la campaña, como domas, canciones, arreos, ranchos, asados y sobre todo, transformarse en un filme de denuncia social sobre la explotación de que era objeto el trabajador rural. En las escenas de la ciudad, aparece el barrio de  Constitución , la  Avenida de Mayo , el edificio del  Congreso , así como los recién llegados automóviles y personajes como canillitas, vigilantes, sacerdotes, etc. Las actuaciones fueron medias, sin exageraciones. Para el crítico  Di Núbila  “todo esto dio a  Nobleza gaucha  interés, calidad, encanto y autenticidad. La inteligencia de su concepción y el acierto de la ejecución deben atribuirse a la capacidad combinada de Caito, Martínez, Gunche y González Castillo, que jamás volvieron a trabajar juntos y que, separados, jamás pudieron repetir la hazaña. En realidad nunca se repitió el fenómeno de  Nobleza gaucha , que pese a lo temprano de su aparición, permaneció como campeona de boletería del cine argentino hasta el advenimiento del sonoro”. [ 3 ] ​ La película fue exhibida en el Festival de Cine Latinoamericano de Polonia el 28 de junio de 2003 y en el   Festival Internacional de Cine de Mar del Plata   de 8 de noviembre de 2008 Reparto Arauco Radal Margot Segré Ángel Boyano Arturo Mario María Padín Celestino Petray Orfilia Rico Julio Scarcella",
      "fileSize": 967862491,
      "addedAt": "2026-01-07T00:10:02.899Z",
      "thumbnail": "https://archive.org/services/img/nobleza-gaucha-1915",
      "language": "spa",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 72
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "60 min",
    "imdbRating": 6.3,
    "imdbVotes": 92,
    "Genre": "Drama, History, Western",
    "Plot": "A licentious patron takes a beautiful stand to his palace in Buenos Aires, after abducting her. When the gaucho who wants to go to rescue her, the field owner uses a corrupt commissary to falsely accuse him of a thief.",
    "Director": "Humberto Cairo, Ernesto Gunche, Eduardo Martinez de la Pera",
    "Writer": "José González Castillo, José Hernández, Rafael Obligado",
    "Actors": "Arturo Mario, María Padín, Celestino Petray",
    "Language": "None",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0008319",
    "tt0039181",
    "tt0005719",
    "tt0037969",
    "tt0005460",
    "tt0201906",
    "tt0464185",
    "tt0005149",
    "tt0211075",
    "tt0048805",
    "tt0003740",
    "tt0006864"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.899Z"
}