{
  "imdbId": "tt0146464",
  "title": "Barking Dogs",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/barking-dogs-1933",
      "id": "barking-dogs-1933",
      "title": "Barking Dogs (1933)",
      "description": "Cubby the Bear has to save his girls home and money from the evil banker. Watch on RetroFlix:  https://retroflix.org/barking-dogs-1933/",
      "fileSize": 174519582,
      "addedAt": "2026-01-07T00:07:31.713Z",
      "thumbnail": "https://archive.org/services/img/barking-dogs-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 40
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.9,
    "imdbVotes": 27,
    "Genre": "Animation, Short",
    "Plot": "Van Bueren Studios' Cubby the Bear series comprised of just 19 cartoons made between 1933-1934. As much as it pains me to say it, speaking as a big animation fan, it is not hard to see why the character and the series weren't so popular and didn't last long.'Barking Dogs' is not one of the series' worst (there's been worse before and since) but it's hardly one of the best or a particularly good cartoon. The best thing about it, and this is true of a lot of Van Bueren's output, is the music score. It is so beautifully and cleverly orchestrated and full of lively energy that is sorely lacking elsewhere, doing so well with enhancing the action.The best characters are the dogs and along with the music score they are what make 'Barking Dogs' more watchable than it could have been. They are elegantly designed (the only element in the animation that works or looks good) and actually have a personality that's fun or endearing, one may question the point of them but by the end of the cartoon are grateful for their presence. The wolf is decently menacing and also has a fun personality, but reduced to a stock villain role with not much to it.However, the animation is really not good even for a cartoon not made on a high budget, and it is true for the Cubby the Bear series and Van Bueren in general on the whole. It's static in movement, simplistic in background detail and sloppy in drawing, with the character expressions being pretty expressionless. The sole exceptions are the dogs.Another major problem is Cubby himself, on top of being poorly animated he is one of the blandest, most personality-deprived and most motivation-less characters ever to exist. He also fares worse than he usually does here, but he is completely lazy and his heroics are not put to use, one questions the point of him even being there. Honey is not much better, think the love interests for similar early male characters from Disney and Looney Tunes except much blander and with significantly less charm or personality and you have Honey.Like in 'Bubbles and Troubles', the gags here are too few and none of what there is are funny, remotely amusing even, or well timed. The absurdity again also felt overdone, because even for a Cubby cartoon, which is also very flimsy and predictable, the story fails to make much sense. Much of it is random and weird and then it all resolves in a way that is as easily pat as one can get.In short, lacklustre and only the music score and the dogs properly rise above that. 4/10 Bethany Cox",
    "Director": "Mannie Davis",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0161331",
    "tt0146938",
    "tt0147123",
    "tt0146978",
    "tt0147102",
    "tt0150152",
    "tt0161903",
    "tt0153101",
    "tt0150163",
    "tt0148463",
    "tt0151638",
    "tt0148487"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.713Z"
}