{
  "imdbId": "tt0178962",
  "title": "La valija",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-valija-1971",
      "id": "la-valija-1971",
      "title": "La Valija (1971)",
      "description": "La valija  es una  película   argentina , dirigida por  Enrique Carreras  sobre un guion de  Julio Mauricio  según su propia obra de teatro homónima, protagonizada por  Luis Sandrini  y  Malvina Pastorino . La obra teatral había sido estrenada en Buenos Aires en 1969, con la actuación de  Héctor Alterio  y  Elsa Berenguer  en los principales papeles. El filme, que fue estrenado en Buenos Aires el 3 de junio de 1971, fue galardonado al año siguiente con el premio  Cóndor de Plata  como mejor película. (Wikipedia) Sinopsis El relato trata de una pareja casada de  clase media  que realmente se ama, pero que son incapaces de transmtirse los sentimientos, en tanto la rutina va corroyendo su relación. Produccion En su versión original termina con el divorcio de la pareja protagónica (Luis Sandrini y Malvina Pastorino), quienes en la vida real estaban efectivamente casados, pero la censura del gobierno militar gobernante en ese momento. consideró que era un final inmoral -el divorcio no estaba admitido- e impuso al director la obligación de filmar un \"final feliz\" haciendo parecer que todo había sido una pesadilla. A pesar de ello, en los cines céntricos de Buenos Aires la película fue exhibida con su final original en tanto en el resto del país lo fue con el final modificado, lo que causó un polémico escándalo en la época. [ 1 ] ​ Actores Luis Sandrini Malvina Pastorino Alberto Martín Edith Boado Ernesto Raquén Isidro Fernán Valdez Rodolfo López Ervilha Aurora del Mar Estela Vidal Francisco Martino Roberto Braceras",
      "fileSize": 1221932646,
      "addedAt": "2026-01-07T00:09:24.702Z",
      "thumbnail": "https://archive.org/services/img/la-valija-1971",
      "language": "spa",
      "year": 1971,
      "collection": "feature_films",
      "downloads": 143
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 4.5,
    "imdbVotes": 24,
    "Genre": "Drama, Comedy",
    "Plot": "Once a happy couple, Osvaldo and Luisa have succumbed to frustration and boredom. The routine is broken when a younger neighbor shows interest in Luisa.",
    "Director": "Enrique Carreras",
    "Writer": "Julio Mauricio",
    "Actors": "Luis Sandrini, Malvina Pastorino, Alberto Martín",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "3 wins"
  },
  "relatedMovies": [
    "tt0182701",
    "tt0178325",
    "tt0183491",
    "tt0183017",
    "tt0067937",
    "tt0183067",
    "tt0068670",
    "tt0178907",
    "tt0183538",
    "tt0200250",
    "tt0178599",
    "tt0183537"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}