{
  "movieId": "tt0146315",
  "title": "Tom's Midnight Garden",
  "year": 1999,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IC9Wn4Gwa08",
      "id": "IC9Wn4Gwa08",
      "title": "Tom's Midnight Garden (ABENTEUERFILM auf Deutsch komplett, Fantasyfilme in voller Länge, Family)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein wundervolles Abenteuer für die ganze Familie nach der bekannten Buchvorlage: In dieser Geschichte über Verzauberung, Schatten und verlorene Erinnerungen reist ein kleiner Junge über die Grenzen der Realität hinweg an einen geheimen, verwunschenen Ort, der ein halbes Jahrhundert in der Vergangenheit liegt...\n\nTOM'S MIDNIGHT GARDEN (1999)\nOriginaltitel: Tom's Midnight Garden\nMit: Greta Scacchi, Caroline Carver, David Bradley, Liz Smith, Joan Plowright\nRegie: Willard Carroll\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nAls sein Bruder an Masern erkrankt, wird der Junge Tom für die Ferien zu seinem Onkel und seiner Tante geschickt. Enttäuscht muss er feststellen, dass zu deren Wohnung kein Garten gehört, in dem er spielen könnte. Doch als mitten in der Nacht die alte Standuhr 13 schlägt und Tom loszieht, um zu sehen, was es damit auf sich hat, findet er heraus, dass der Hintereingang des Hauses nun in einen großen Garten führt. Dort trifft er das Mädchen Hatty, die in den folgenden Nächten zu seiner Spielkameradin wird.\n#Netzkino #ganzerFilm #Fantasyfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:44:36.337Z",
      "thumbnail": "https://i.ytimg.com/vi/IC9Wn4Gwa08/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDHEv1R38ByneNEMHm6_f1-YBWobA",
      "duration": 6422,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "107 min",
    "imdbRating": 6.5,
    "imdbVotes": 901,
    "Genre": "Adventure, Family, Fantasy",
    "Plot": "Young Tom Long is forced to stay with his kindly Aunt and Uncle while his brother recovers from a bout of the measles. At their flat, he is, disappointed to find there is no garden in which to play, but his disappointment turns to wonder when he discovers a magical garden which only appears at night when an old grandfather clock strikes thirteen. His nightly excursions to this beautiful garden become even more interesting when he realizes that the people he meets cannot see him, except one young girl named Hatty.",
    "Director": "Willard Carroll",
    "Writer": "Willard Carroll, Philippa Pearce",
    "Actors": "Nigel Le Vaillant, Marlene Sidaway, Serena Gordon",
    "Language": "English",
    "Country": "United Kingdom, United States, Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0119782",
    "tt0050084",
    "tt0004873",
    "tt0089961",
    "tt0004099",
    "tt0004457",
    "tt0015400",
    "tt0068190",
    "tt0290406",
    "tt0052948",
    "tt0243462",
    "tt0104522"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:22:20.838Z"
}