{
  "movieId": "tt0127389",
  "title": "Nothing Too Good for a Cowboy",
  "year": 1998,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X4SstcqNqZU",
      "id": "X4SstcqNqZU",
      "title": "Nothing Too Good for a Cowboy",
      "description": "In the wilderness of British Columbia in 1940, 3 spirited, but very different, adults struggle to carve out their independence on the worlds largest cattle ranch. With Ryan Gosling, Sarah Chalke.\n\n#freemovies #fullmovies #westerns #cowboys #ranch #90s",
      "addedAt": "2025-12-23T22:45:25.710Z",
      "thumbnail": "https://i.ytimg.com/vi/X4SstcqNqZU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBZkALd4uiddG1qiBu8Q3ONzjM6yw",
      "duration": 5524,
      "language": "en",
      "channelName": "FilmRise Movies",
      "channelId": "UC8IHAQMuiJdY6ALuhG7iU8Q",
      "regionRestriction": {
        "blocked": [
          "CA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 5.4,
    "imdbVotes": 411,
    "Genre": "Comedy, Romance",
    "Plot": "In 1939, former New York City stock broker Richmond Hobson, a man with a privileged past, has become a cowboy, which is his dream job. With his partner, an experienced but sarcastic cowpoke named Panhandle Phillips, Rich has a three-year old fledgling ranch in northern British Columbia near Vanderhoof. Beyond the grief he gets from local banker Roland Tewkesbury who wants to ruin Rich so that he can buy the land for a pittance, Rich may be facing difficult times with the onset of the war. Of late, he has been having dreams of an unknown beautiful blond woman. His dreams become reality when he spots her. She is headstrong Gloria McIntosh, a Vancouver aspiring débutante who is the dream girl of many a man in her own social circle, most specifically Connor McCann. But Gloria is literally swept off her feet by first sight of the mysterious cowboy. Impetuously, they get married as Gloria is willing to give up her current life to become a rancher's wife, something about which she knows nothing, except perhaps riding a horse English-styled. But with all the young men being sent to war, Rich is forced to hire boys, inexperienced as cowboys at that, and use Gloria as a cowgirl if he and Pan and now Gloria are to survive financially on this ranch. One of the young hands, Kit, is keeping a secret. And one of his more experienced new hired hands, Robert McDaniels, is a black man with a rumored infamous past.",
    "Director": "Kari Skogland",
    "Writer": "Richmond P. Hobson Jr., David Barlow, Charles Lazer",
    "Actors": "Chad Willett, Ted Atherton, Falconer Abraham",
    "Language": "English",
    "Country": "Canada",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0191821",
    "tt0119717",
    "tt0157053",
    "tt0185125",
    "tt0173957",
    "tt0118566",
    "tt0140379",
    "tt0206742",
    "tt0303243",
    "tt0229397",
    "tt0116102",
    "tt0199744"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:19:10.976Z"
}