{
  "imdbId": "tt0151806",
  "title": "Oh! Susanna",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/oh-susanna-1933",
      "id": "oh-susanna-1933",
      "title": "Oh! Susanna (1933)",
      "description": "Oh! Susanna is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/oh-susanna-1933/",
      "fileSize": 27761063,
      "addedAt": "2026-01-07T00:10:02.900Z",
      "thumbnail": "https://archive.org/services/img/oh-susanna-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 53
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 3.1,
    "imdbVotes": 8,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1933 was again a hit and miss year for Terrytoons. 'Oh! Susanna' is one of the lacklustre ones, but has enough to it to stop it from being down there among the worst. It's another one of those cartoons that is worth a one-time watch, mainly for Terrytoons completests, but there is not much special here.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Some of the backgrounds are detailed and ambitious enough and it's a little more elaborate looking than the previous 1933 cartoons.There are a few amusing moments and there is a little charm every now and again.However, the animation is still, outside of the backgrounds, primitive at best with a fair bit of crudeness, over-simplicity and choppiness.Likewise, the story is paper thin and formulaic with a big air of over-familiarity due to doing very little new with a premise that was feeling old well before this was made. More gags would have helped, the cartoon is not devoid of them but it's hardly littered with them and generally the humour was pretty bland, and livelier pacing likewise. The pace did feel erratic at times, rushed as a result of the cartoon again being too short and then a bit dull when the timing wasn't sharp enough and the content not having an awful lot to it. Not much memorable about the characters, other than that they are not well drawn and that the stereotypes may not bode well, one has seen similar characters before and with far stronger personalities. In summary, lacklustre but a long way from unwatchable. 4/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150804",
    "tt0149817",
    "tt0150130",
    "tt0150382",
    "tt0150504",
    "tt0146721",
    "tt0150774",
    "tt0150820",
    "tt0151001",
    "tt0151046",
    "tt0151118",
    "tt0151217"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.900Z"
}