{
  "imdbId": "tt0150899",
  "title": "Hero for a Day",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hero-for-a-day-1952",
      "id": "hero-for-a-day-1952",
      "title": "Hero for a Day (1952)",
      "description": "Little Herky Mouse is jealous because his girlfriend, Little Susie Mouse, is smitten with Mighty Mouse. Herky goes into a store that sells Mighty-Mouse dolls, and helps himself to a Mighty Mouse costume, which he pads and fills out with some balloons. The cats chase him and deflate the balloons, but the real Mighty Mouse---the big red cheese, himself---shows up, beats up the cats and stacks them in a neat pile one on top of the other. Herky finds them that way when he comes to and Susie thinks he did it, although Herky says he didn't think he had it in him. Susie and the other little girl mice are fawning over Herky, as Mighty Mouse gives a big wink and flies away. Watch on RetroFlix:  https://retroflix.org/hero-for-a-day-1952/",
      "fileSize": 37365867,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/hero-for-a-day-1952",
      "language": "eng",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 64
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbVotes": 20,
    "Genre": "Animation, Short, Romance",
    "Plot": "Little Herky Mouse is jealous because his girlfriend, Little Susie Mouse, is smitten with Might Mouse. Herky goes into a store that sells Mighty-Mouse dolls, and helps himself to a Might Mouse costume, which he pads and fills out with some balloons. The cats chase him and deflate the balloons, but the real Might Mouse---the big red cheese, himself---shows up, beats up the cats and stacks them in a neat pile one on top of the other. Herky finds them that way when he comes to and Susie thinks he did it, although Herky says he didn't think he had it in him. Susie and the other little girl mice are fawning over Herky, as Mighty Mouse gives a big wink and flies away.",
    "Director": "Mannie Davis",
    "Writer": "Tom Morrison",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148486",
    "tt0148158",
    "tt0148168",
    "tt0151694",
    "tt0152349",
    "tt0150452",
    "tt0149383",
    "tt0151402",
    "tt0148463",
    "tt0149683",
    "tt0161865",
    "tt0152581"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}