{
  "movieId": "tt0150780",
  "title": "The Great Experiment",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-great-experiment-1934",
      "id": "the-great-experiment-1934",
      "title": "The Great Experiment (1934)",
      "description": "Scrappy cartoon from Charles Mintz of Columbia Pictures. In this one, mad scientist Hugo Plotz experiments on the boy character in a water bowl by first turning him into a fish and then an old man. When his little brother comes in, Hugo then turns them into babies. And then when they go back to normal, they travel into the future, all the way to 1990. There they encounter people in propeller hats and attempt to rescue a girl from Plotz. Watch on RetroFlix:  https://retroflix.org/the-great-experiment-1934/",
      "fileSize": 404700148,
      "addedAt": "2026-01-07T00:12:10.587Z",
      "thumbnail": "https://archive.org/services/img/the-great-experiment-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 131
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 6,
    "imdbVotes": 23,
    "Genre": "Animation, Short, Comedy",
    "Plot": "I am not a fan of the Scrappy series of cartoons made for Columbia from 1931 through 1941. They seem made for small children without a clear understanding of what children find interesting.This one, however, starts off with an extravagantly terrifying opening as Scrappy finds himself in a laboratory, where a scientist keeps injecting him with serums, changing him into various weird life forms. The dark ambiance and better-than usual in-betweening lend an eerie air of nightmarish reality to the entire proceedings.Unfortunately, the second half of the cartoon moves into a science-fictional but relatively banal story in which Scrappy and a bad guy chase each other around for a while. So this is not a great cartoon, but for those first three minutes it is first rate.",
    "Director": "Sid Marcus",
    "Writer": "Sid Marcus",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150181",
    "tt0150824",
    "tt0149747",
    "tt0152321",
    "tt0152327",
    "tt0152335",
    "tt0152338",
    "tt0152339",
    "tt0152340",
    "tt0152341",
    "tt0150744",
    "tt0148629"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.587Z"
}