{
  "imdbId": "tt0152308",
  "title": "Scotch Highball",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/scotch-highball-1930",
      "id": "scotch-highball-1930",
      "title": "Scotch Highball (1930)",
      "description": "Various anthropomorphic animals flock to the stadium to watch a horse race. Released November 16, 1930. Watch on RetroFlix:  https://retroflix.org/scotch-highball-1930/",
      "fileSize": 34721100,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/scotch-highball-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 48
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.4,
    "imdbVotes": 28,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. Of the 1930 Terrytoons up to this cartoon, 'Scotch Highball' is the best of them and among the better 1930 Terrytoons overall. Instead of the mostly watchable but unexceptional standard of the previous cartoons, with a few exceptions (especially 'Bully Beef), 'Scotch Highball' is pretty good, and along with 'Hungarian Goulash' the best of the 1930 batch. Will say though that a large part of me does wish the French prints with German subtitles and a silhouetted orchestra opening sequence was still available, the opening titles for the US (?) prints, like here, are nowhere near as inspired.'Scotch Highball's' story is basic and formulaic. It also gets off to a slightly slow start with standard action that in correlation with the rest of the cartoon didn't seem to fit.With all that being said, 'Scotch Highball' actually manages to be one of the better-looking 1930 Terrytoons, with some typically ambitious backgrounds (and even more lavish and more detailed than in your average Terrytoon) but also remarkably witty drawings, more inventiveness than can be usually found and no repetition or crudeness. It also boasts some of the sharpest and neatest synchronisation of the early Terrytoons, quite an accomplishment. Also a standout is the music, typically outstanding. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action.Despite the story not being much special, it is carried along by a lively pace, natural charm and numerous pretty amusing absurdist gags. The characters may not have significant development to them but are not annoying or personality deprived.In conclusion, well done, good effort. 7/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149980",
    "tt0150161",
    "tt0150425",
    "tt0161623",
    "tt0145828",
    "tt0151158",
    "tt0151617",
    "tt0161222",
    "tt0150028",
    "tt0150155",
    "tt0151114",
    "tt0151129"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.954Z"
}