{
  "imdbId": "tt0146596",
  "title": "Custard Pies",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/custard-pies-1929",
      "id": "custard-pies-1929",
      "title": "Custard Pies (1929)",
      "description": "Animals take on human characteristics in this good-natured comedy. Watch on RetroFlix:  https://retroflix.org/custard-pies-1929/",
      "fileSize": 51737039,
      "addedAt": "2026-01-07T00:07:51.627Z",
      "thumbnail": "https://archive.org/services/img/custard-pies-1929",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 41
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/custard-pies_1929",
      "id": "custard-pies_1929",
      "title": "Custard Pies",
      "fileSize": 940726329,
      "addedAt": "2026-01-07T00:07:51.627Z",
      "thumbnail": "https://archive.org/services/img/custard-pies_1929",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 116
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4,
    "imdbVotes": 30,
    "Genre": "Animation, Short, Comedy",
    "Plot": "Van Beuren cartoons are extremely variable, especially in the number of gags and whether the absurdist humour shines through enough (sometimes it does, other times it doesn't), but are strangely interesting. Although they are often poorly animated with barely existent stories and less than compelling lead characters, they are also often outstandingly scored, there can be some fun support characters and some are well-timed and amusing.'Custard Pies' has to be one of their worst and any succeeding Aesop's Fables cartoon has to be really awful to be as bad or worse than this. Love custard pies as much as the next person, but 'Custard Pies' has only one delicious creamy aspect and everything else has a lot of lumps and curdled cream. The one good delicious aspect is the music score, which is typically peppy. It is so beautifully and cleverly orchestrated, adds a good deal and full of lively energy, against all this other Van Beuren cartoons have done a better job having music that enhances and fits the action because the action and music seemed to go at a different pace to each other. Everything else is very lumpy. The animation is at best very primitive, with erratically sloppy character designs in particular while the simplistic background detail and lack of fluidity and crispness are just as difficult to ignore.Story is very slight to the point of non-existence (just a string of gags) not only doesn't go very far it feels random at times. On top of being poorly animated none of the characters are particularly memorable, likeable or engaging. The old man actually was pretty annoying and the rest were forgettable. Did like the concept and what 'Custard Pies' was going for, it just executed this concept badly with paper thin story execution and a lot of randomness and not much coherence.'Custard Pies' is basically a stringing along of gags, and generally, while having a fair bit going on, it is very low on laughs. In terms of quality none of the gags are amusing or inventive, never rising above the forgettable and there is not much absurdist about them. The cartoon felt very rushed to me and the action was very confused and failed to make much sense.On the whole, very poor, very lumpy and not delicious at all apart from one aspect (and even that has been done better in other Van Beuren cartoons). 2/10 Bethany Cox",
    "Director": "Paul Terry",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "N/A",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0146913",
    "tt0402854",
    "tt0146849",
    "tt0146423",
    "tt0150513",
    "tt0019014",
    "tt0142419",
    "tt0136324",
    "tt0146975",
    "tt0141664",
    "tt0147193",
    "tt1058754"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.627Z"
}