{
  "movieId": "tt0151773",
  "title": "No Sleep for Percy",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/no-sleep-for-percy-1955",
      "id": "no-sleep-for-percy-1955",
      "title": "No Sleep for Percy (1955)",
      "description": "Little Roquefort is enjoying the music from a car-radio to the dismay of Percy Puss who is trying to sleep nearby. Percy takes off after Roquefort and manages to imprison him between the car door-frame and the window. The mouse gets free and falls on the car horn which gets stuck and is blaring loudly. Percy tears the car apart and again goes after Roquefort, and the pair wind up in a runaway car and crashes. The cat winds up in bandages and the hospital but is happy as he foresees a noiseless sleep. His dream is shattered by his hospital room-mate, Roquefort, who turns on the table radio. Watch on RetroFlix:  https://retroflix.org/no-sleep-for-percy-1955/",
      "fileSize": 36761629,
      "addedAt": "2026-01-07T00:10:02.898Z",
      "thumbnail": "https://archive.org/services/img/no-sleep-for-percy-1955",
      "language": "eng",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 92
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbVotes": null,
    "Genre": "Animation, Short",
    "Plot": "Little Roquefort is enjoying the music from a car-radio to the dismay of Percy Puss who is trying to sleep nearby. Percy takes off after Roquefort and manages to imprison him between the car door-frame and the window. The mouse gets free and falls on the car horn which gets stuck and is blaring loudly. Percy tears the car apart and again goes after Roquefort, and the pair wind up in a runaway car and crashes. The cat winds up in bandages and the hospital but is happy as he foresees a noiseless sleep. His dream is shattered by his hospital room-mate, Roquefort, who turns on the table radio.",
    "Director": "Connie Rasinski",
    "Writer": "Tom Morrison (story)",
    "Actors": "Tom Morrison",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0147872",
    "tt0148469",
    "tt0150989",
    "tt0150890",
    "tt0151906",
    "tt0152889",
    "tt0149596",
    "tt0150985",
    "tt0152552",
    "tt0153986",
    "tt0149590",
    "tt0151030"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.899Z"
}