{
  "movieId": "tt0151932",
  "title": "A Pee-kool-yar Sit-chee-ay-shun",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-pee-kool-yar-sit-chee-ay-shun-1944",
      "id": "a-pee-kool-yar-sit-chee-ay-shun-1944",
      "title": "A Pee-kool-yar Sit-chee-ay-shun (1944)",
      "description": "Li'l Abner, tired of being constantly pursued by Daisy Mae, decides to run away from home but drops by to inform her that he is leaving. But she doesn't care as she informs Li'l Abner that she has a new suitor, Disgustin' Jones, cousin of Available Jones. He takes a train, airplane, ocean liner and gets as far as the Egypitian pyramids before he realizes what she told him and, while Abner doesn't want the delectable Miss Scragg---at least as drawn in the comic strip---he ain't hankerin' fer anybody else to be wooing her, and he returns to Dogpatch to put an end to any hanky-panky that might be going on in them thar hills. But Disgustin', disgusting character that he is, has about a thousand bodyguards hired to keep Abner away. They do but, then Mammy Yokum, takes a hand and quickly makes short work of the bodyguards. Watch on RetroFlix:  https://retroflix.org/a-pee-kool-yar-sit-chee-ay-shun-1944/",
      "fileSize": 192573135,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-pee-kool-yar-sit-chee-ay-shun-1944",
      "language": "eng",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 190
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 4.7,
    "imdbVotes": 31,
    "Genre": "Animation, Short, Romance",
    "Plot": "Li'l Abner, tired of being constantly pursued by Daisy Mae, decides to run away from home but drops by to inform her that he is leaving. But she doesn't care as she informs Li'l Abner that she has a new suitor, Disgustin' Jones, cousin of Available Jones. He takes a train, airplane, ocean liner and gets as far as the Egypitian pyramids before he realizes what she told him and, while Abner doesn't want the delectable Miss Scragg---at least as drawn in the comic strip---he ain't hankerin' fer anybody else to be wooing her, and he returns to Dogpatch to put an end to any hanky-panky that might be going on in them thar hills. But Disgustin', disgusting character that he is, has about a thousand bodyguards hired to keep Abner away. They do but, then Mammy Yokum, takes a hand and quickly makes short work of the bodyguards.",
    "Director": "Sid Marcus",
    "Writer": "Alec Geiss, Sid Marcus, Al Capp",
    "Actors": "Frank Graham, John McLeish, Lurene Tuttle",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149709",
    "tt0150763",
    "tt0147957",
    "tt0152040",
    "tt0152262",
    "tt0148100",
    "tt0148190",
    "tt0148270",
    "tt0162424",
    "tt0148665",
    "tt0150235",
    "tt0149270"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}