{
  "imdbId": "tt0150841",
  "title": "Hare and the Hounds",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hare-and-the-hounds-1940",
      "id": "hare-and-the-hounds-1940",
      "title": "Hare and the Hounds (1940)",
      "description": "Hare and the Hounds is a Terrytoons cartoon directed by Eddie Donnelly. Watch on RetroFlix:  https://retroflix.org/hare-and-the-hounds-1940/",
      "fileSize": 33965643,
      "addedAt": "2026-01-07T00:08:39.344Z",
      "thumbnail": "https://archive.org/services/img/hare-and-the-hounds-1940",
      "language": "eng",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 58
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.5,
    "imdbVotes": 7,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1940, like all the other years for Terrytoons, saw a hit and miss batch. Of which 'Hare and the Hounds' is one of the high middle ones ranking it in correlation with the rest of the Terrytoons and one of the better 1940 cartoons. It is a decent if unexceptional cartoon with a lot of strengths and some problems as well. 'Hare and the Hounds' is also worth the look, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see, as is the comparatively improved fluidity of drawing and movement, and some synchronisation in movement and sound is neat. Colour is vibrant.A number of well timed and amusing moments in the second half, some imaginative and there is some zest and natural charm, and parts of it and the basic set up are nicely done. The characters are fun, if perhaps not distinctive. After a slow start, 'Hare and the Hounds' does pick up with the last act being surprisingly very funny and energetic, some of the funniest material of any Terrytoons cartoon in a while.A few of the transitions are not always polished on the other hand.Likewise, the story is paper thin and formulaic with not an awful lot to it (like the cartoon in general). In terms of gags, a few lack freshness and wit to work properly. It is predictable to start with and the first third or so is rather slow and bland, veering towards being too cute.Summing up, above average and not bad at all, though also not great. 6/10 Bethany Cox",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Tom Morrison, Al Stahl",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0159281",
    "tt0150361",
    "tt0161998",
    "tt0150362",
    "tt0149765",
    "tt0146905",
    "tt0151020",
    "tt0153345",
    "tt0149801",
    "tt0150895",
    "tt0150981",
    "tt0147063"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.344Z"
}