{
  "movieId": "tt0147958",
  "title": "The Carpenters",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-carpenters-1941",
      "id": "the-carpenters-1941",
      "title": "The Carpenters (1941)",
      "description": "Carpenters Clancy, Mr. Teewilliger and Herman bumblingly struggle to build a house with disastrous results. Watch on RetroFlix:  https://retroflix.org/the-carpenters-1941/",
      "fileSize": 210672129,
      "addedAt": "2026-01-07T00:11:57.681Z",
      "thumbnail": "https://archive.org/services/img/the-carpenters-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 102
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 6,
    "imdbVotes": 20,
    "Genre": "Animation, Short",
    "Plot": "With the death of Charles Mintz, Columbia Pictures was left without a source of cartoons to package to their markets. They gave Paul Fennell a trial and he produced this cartoon and two short current events cartoons before Columbia gave up on him or he left -- there's no way to be sure. Columbia's cartoon production went through at least four regimes before they settled on a longterm contract with UPA in the late 1940s.THE CARPENTERS is a well-executed if standard cartoon for the era. It concerns two carpenters building a house under the eye of their short-tempered contractor. There's a big, dumb guy, a short smart guy and a plethora of the usual gags, from polishing a pane of glass that isn't there to drawing a door on a wall and then opening and walking through it. The gags are well timed and it was clearly intended as the start of a series, since the three characters are shown in portrait and named before the action starts. It's not great, but it was a solid start for a new studio. It's a pity it got no further.",
    "Director": "Paul Fennell, Ub Iwerks",
    "Writer": "Paul Fennell, Ub Iwerks",
    "Actors": "Mel Blanc",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033496",
    "tt0148270",
    "tt0033324",
    "tt0148091",
    "tt0033589",
    "tt0148342",
    "tt0033773",
    "tt0148382",
    "tt0033892",
    "tt0033962",
    "tt0151893",
    "tt0034046"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.682Z"
}