{
  "movieId": "tt0151935",
  "title": "Pencil Mania",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pencil-mania-1932",
      "id": "pencil-mania-1932",
      "title": "Pencil Mania (1932)",
      "description": "This Tom and Jerry cartoon (the human versions, not the cat and mouse) is an opportunity for the animators to have fun with the medium. There is no specific plot. One of the boys uses a pencil to create a myriad number of animated illusions that could only work in a cartoon. For example, a short vertical line is drawn, which when held by both ends suddenly becomes a saxophone. When played, the notes pop out of the bell of the instrument to suddenly grow legs and transform into ducks. After the song, the saxophone itself quickly follows suit and becomes a goose. The entire short consists of these disjointed, though often creative and humorously unlikely events. Watch on RetroFlix:  https://retroflix.org/pencil-mania-1932/",
      "fileSize": 30281721,
      "addedAt": "2026-01-07T00:10:12.698Z",
      "thumbnail": "https://archive.org/services/img/pencil-mania-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 49
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.7,
    "imdbVotes": 140,
    "Genre": "Family, Animation, Short",
    "Plot": "This Tom and Jerry cartoon (the human versions, not the cat and mouse) is an opportunity for the animators to have fun with the medium. There is no specific plot. One of the boys uses a pencil to create a myriad number of animated illusions that could only work in a cartoon. For example, a short vertical line is drawn, which when held by both ends suddenly becomes a saxophone. When played, the notes pop out of the bell of the instrument to suddenly grow legs and transform into ducks. After the song, the saxophone itself quickly follows suit and becomes a goose. The entire short consists of these disjointed, though often creative and humorously unlikely events.",
    "Director": "John Foster, Vernon Stallings",
    "Writer": "N/A",
    "Actors": "Margie Hines",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0152550",
    "tt0151146",
    "tt0023078",
    "tt0152123",
    "tt0152780",
    "tt0153306",
    "tt0153942",
    "tt0151440",
    "tt0152162",
    "tt0153325",
    "tt0022741",
    "tt0023595"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.698Z"
}