{
  "imdbId": "tt0157053",
  "title": "Some Prefer Cake",
  "year": 1997,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/some-prefer-cake",
      "title": "Some Prefer Cake (1997) - Desi del Valle Film",
      "description": "Heidi Arnesen is a Norwegian filmmaker that directed the 1991 short Dual of the Senses , the first queer Norwegian short. She would later do 7 more shorts throughout the 90s. Her most recent short Night Ride  was nominated for an Oscar. In 1997, she would make her first & only feature with Some Prefer Cake . The film combines the world of stand-up and lgbt themes in the backdrop of San Francisco in the late 90s. It was written by Jeannie Kahaney, who also co-directed the movie; according to the film's credit.  Local SF comics appeared in the film, which includes: Julia Jackson, Doug Holsclaw, Mimi Gonzalez, Pola Mazursky & Aundre the Wonderwoman (offscreen voice). They have written and performed their materials in the movie except for Pola Mazursky, who plays a wacky character in the story. Local clubs were utilized in the film, such as Josie's Cabaret and Juice Joint & the Coco Club, which closed its doors in 1999 and 2000. Most of the actors in the film are local SF performers, with the only known actor being Desi del Valle ( Mod Fuck Explosion , Costa Brava ) playing Robin, the love interest for the main character Kira. However, the standout in the movie is Machiko Saito, who plays Katie; a needy stalker who goes after the main character and her friends. Machiko Saito is an interesting individual she's a filmmaker who directed 3 short films ( Premenstrual Spotting , 15 Minutes of Femme & Pink Eye ) and created a TV show called Femme TV . Pink Eye is the only one available, while the other two and Femme TV are considered lost media. She is also a photographer, costume designer, make-up artist, acting workshop leader, educator of drug and alcohol recovery, tutor, and teacher's assistant. It seems she's done it all lol. She may or may not be transgender, at least according to the Transgender Media Portal. But given that she doesn't have any online presence and not too much information about her, outside her work; it's all speculation. The film debuted in 1997 at the San Francisco International Lesbian and Gay Film Festival & a year later in 1998 at the New York Lesbian and Gay Film Festival. What happened to the cast & crew after the movie: -Heidi Arnesen went on to be a director for the Norwegian soap opera Hotel Cæsar  directing more than 140 episodes & would later start producing in the mid-2010s. -Jeannie Kahaney is a director at The New School in New York. -Kathleen Fontaine is a part of the San Francisco sketch comedy group Nude Coffee . She would do multiple one-person shows: Learning To Stay & Kathleen Fontaine: The Man, The Mystery! In 2017, Kathleen Fontaine transitioned to Quinn Fontaine and wrote a memoir documenting his new life as a transguy. -Desi del Valle left her position as a distribution director for Frameline in 2004 to focus on her career. She and Tara Howley collaborated again in the film Nightfall (2001), now considered lost media. She has attended various events for Columbia University (her alma mater), but it is unclear if she works for the Columbia Alumni Association or something else. -Machiko Saito appeared in a play called Contagion  in 2001. She would later be a program director, editor, and publisher for Roaddawgz, a drop-in center for homeless youth who are struggling writers, artists, and musicians. Is it unknown if Roaddawgz still operates or not? -Leon Acord created and starred in his show Old Dogs & New Tricks  with Fontaine being one of the producers. -Pola Mazursky goes by Pola Mazur these days so as not to be confused with Paul Mazursky. -Mimi Gonzalez is friends with Jessica Kirson, and they sure look alike! The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org, are for educational purposes. I have uploaded each movie for posterity, with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws.",
      "fileSize": 12473704822,
      "id": "some-prefer-cake"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "94 min",
    "imdbRating": 4.6,
    "imdbVotes": 107,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "In San Francisco, Kira has a day job at a warehouse, writes jokes for her sister (who does stand-up back East), wants to perform her own material, hangs out with best friend Sydney (who writes food reviews), and sleeps once with every woman she can. Then, her roommate sets her up with Robin - who's recently come out and hasn't had a serious relationship yet - and her friendship with Sydney gets rocky. Meanwhile, Kira's being stalked by one of her one-night stands, her sister isn't showing any appreciation, and a night at an open microphone goes badly. Is this all life can offer?",
    "Director": "Heidi Arnesen",
    "Writer": "Jeannie Kahaney",
    "Actors": "Kathleen Fontaine, Tara Howley, Desi del Valle",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0118566",
      "title": "Afterglow",
      "year": 1997,
      "imdbRating": 6,
      "imdbVotes": 3884,
      "language": "English, French",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0116102",
      "title": "Different for Girls",
      "year": 1996,
      "imdbRating": 7,
      "imdbVotes": 2070,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    },
    {
      "imdbId": "tt0191821",
      "title": "The White Suit",
      "year": 1999,
      "imdbRating": 5.8,
      "imdbVotes": 1028,
      "language": "Serbian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0185125",
      "title": "All About My Mother",
      "year": 1999,
      "imdbRating": 7.8,
      "imdbVotes": 107945,
      "language": "Spanish, Catalan",
      "sourceType": "youtube",
      "channelName": "Moviedome"
    },
    {
      "imdbId": "tt0114095",
      "title": "Party Girl",
      "year": 1995,
      "imdbRating": 6.5,
      "imdbVotes": 7321,
      "language": "English, Arabic",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    },
    {
      "imdbId": "tt0111415",
      "title": "This Can't Be Love",
      "year": 1994,
      "imdbRating": 6.2,
      "imdbVotes": 445,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0303243",
      "title": "Happy Times",
      "year": 2000,
      "imdbRating": 7.3,
      "imdbVotes": 4215,
      "language": "Mandarin",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0229397",
      "title": "Forgive and Forget",
      "year": 2000,
      "imdbRating": 6.1,
      "imdbVotes": 689,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0199744",
      "title": "Mambo Café",
      "year": 2000,
      "imdbRating": 5.1,
      "imdbVotes": 408,
      "language": "English, Spanish",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    },
    {
      "imdbId": "tt0107273",
      "title": "Joey Breaker",
      "year": 1993,
      "imdbRating": 4.4,
      "imdbVotes": 200,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0106941",
      "title": "For Love or Money",
      "year": 1993,
      "imdbRating": 6.2,
      "imdbVotes": 16130,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0108160",
      "title": "Sleepless in Seattle",
      "year": 1993,
      "imdbRating": 6.8,
      "imdbVotes": 202088,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.623Z"
}