{
  "movieId": "tt0153299",
  "title": "Triple Trouble",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/triple-trouble-1948",
      "id": "triple-trouble-1948",
      "title": "Triple Trouble (1948)",
      "description": "Oil Can Harry captures Mighty Mouse and traps him in the Mohave desert about to be eaten by vultures. Harry kidnaps Pearl Pureheart's father, the Colonel, ties him with a boulder and drops him off the Brooklyn Bridge and into the East river teeming with hungry crocodiles, then he goes after Pearl. The cops were too late to stop him as Harry absconds with Pearl. Meanwhile, Mighty Mouse breaks free and clobbers the vultures, rescues the colonel and his daughter and defeats Harry once again. Lots of singing in this operetta! This cartoon was produced in that old radio serial style, with the announcer setting the scene and interjecting throughout. Watch on RetroFlix:  https://retroflix.org/triple-trouble-1948/",
      "fileSize": 38768911,
      "addedAt": "2026-01-07T00:12:55.130Z",
      "thumbnail": "https://archive.org/services/img/triple-trouble-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 81
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 7.6,
    "imdbVotes": 62,
    "Genre": "Animation, Short",
    "Plot": "Mighty Mouse is bound and gagged on the Mojave Desert, surrounded by vultures and Colonel Pureheart has been thrown off the Brooklyn Bridge into the East River swarming with crocodiles - all so the villainous Oil Can Harry can plight his troth to the pretty Pearl Pureheart without outside interference. But Pearl's no shrinking violet - she punches Harry, pummeling him with vases, irons and flower pots and then saws off the flag pole from which the villain is dangling. When the slimy villain finally gets the upper-hand, abducting Pearl and flying off into the sunset, Mighty Mouse rallies his last reserves of strength to defeat the villains and rescue Pearl and her father.",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148443",
    "tt0148633",
    "tt0151315",
    "tt0151663",
    "tt0150072",
    "tt0148339",
    "tt0148407",
    "tt0149212",
    "tt0151314",
    "tt0150215",
    "tt0150354",
    "tt0150974"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.130Z"
}