{
  "imdbId": "tt0143357",
  "title": "Lady Godiva",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-lady-godiva",
      "id": "silent-lady-godiva",
      "title": "Lady Godiva",
      "fileSize": 484443056,
      "addedAt": "2026-01-07T00:11:07.407Z",
      "thumbnail": "https://archive.org/services/img/silent-lady-godiva",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 1328
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 5,
    "imdbVotes": 108,
    "Genre": "Short, Drama",
    "Plot": "Earl Leofric, of Coventry. England, placed a grievous tax upon his townspeople, who have already been so heavily levied upon that they are on the verge of starvation. Lady Godiva, the Earl's wife, pleads with him to revoke the tax and relieve the sufferings of the people. He answers in a spirit half in jest, and whole in earnest, thinking that she will not agree to such a proposition, that if she will ride naked through the town, he will repeal the tax. Her heart is wrung with the sufferings of her people, and she is neither contented in mind, nor easy in spirit, until she replies she will pay the price of their freedom and perform the undertaking, cost what it may. She sends heralds forth through the town, saying that she will free the people from their bonds according to the edict of her husband, by riding unclothed through the town. Nature has blessed her with an abundant growth of hair, which hangs far below her waist and covers her as with a mantle. But notwithstanding, a notice is posted that at the hour of midday, on the day set for the payment of her debt of devotion, that all the people shall stay within closed doors and no eye shall look upon her. Her task done, the debt paid, she returns to her home and only one curious person disobeys the injunction that \"no eye shall look upon her.\" That person was ever afterward called \"Peeping Tom,\" and in punishment for his disobedience, he is struck blind and Lady Godiva is worshiped as a saint unto this day in the minds of the grateful inhabitants of Coventry.",
    "Director": "J. Stuart Blackton",
    "Writer": "Alfred Lord Tennyson, Eugene Mullin",
    "Actors": "Julia Swayne Gordon, Robert Gaillard, Kate Price",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000724",
    "tt0125564",
    "tt0001009",
    "tt0001987",
    "tt0001510",
    "tt0001593",
    "tt0001915",
    "tt1207008",
    "tt0001615",
    "tt0001753",
    "tt0001499",
    "tt0001701"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.407Z"
}