{
  "imdbId": "tt0148278",
  "title": "Hide and Shriek",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hide-and-shriek-1955",
      "title": "Hide And Shriek",
      "description": "Casper the Friendly Ghost's cousin Spooky comes for a visit. Watch on RetroFlix:  https://retroflix.org/hide-and-shriek-1955/",
      "id": "hide-and-shriek-1955"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": "5.8",
    "imdbVotes": "51",
    "Genre": "Animation, Short",
    "Plot": "The late-40s to the early/mid-50s Casper the Friendly Ghost cartoons had a higher budget and overall the overall quality was much better. Onwards, the quality did diminish quite significantly though the overall cartoons varied, some decent, many mediocre.Famous Studios' cartoons are not for all tastes, but my opinion is that their early stuff and some of the early 50s output are good. While they were very formulaic they were always well animated and voiced with some funny parts, some poignancy and decent characters and their regular composer Winston Sharples could always be relied on to write a great and often outstanding score.Admittedly though, by the mid-50s through to the late-60s Famous Studios' cartoons did get repetitive. While Sharples' music still shone and the voice actors did their best the animation suffered due to lower budgets and tighter deadlines, the humour became more tired and slow in timing than sharp and funny, the stories became increasingly predictable and rehashed and some characters started losing their initial spark, this is particularly true of most of the later Herman and Katnip cartoons.After 'Boo Moon' (the last great Casper cartoons), many of the Casper cartoons were at best average, compensated by mainly the always outstanding music but hampered by being too twee and repetitive primarily. 'Hide and Shriek', signalling the debut of Cousin Spooky, is one of the better later cartoons, though not among the best of the series.Spooky's design and personality is evidently still evolving, as his character design is pretty ugly and goofy here and he is rather annoying and fails being funny or cute, perhaps he was meant to be like that but it did feel like it was taken too far here. The dialogue is cloying and at best very forgettable, and the \"teaching him a lesson\" ending just seemed extreme and out of character for Casper, it was most likely desperation and he meant well but it just came over as too mean and against what Casper stands out (which is to be friendly and kind).Best thing about 'Hide and Shriek' is the music score. Experimenting more with a more mellow horn and string sound at this point, Winston Sharples' music score here is typically merry and whimsical, it's beautifully orchestrated, energetic and adds so much to the mood, his music has always been one of the best assets of the Famous Studios cartoons and it's not an exception here. In fact how it's composed and how it meshes so well with everything going on in the animation, story and action contributes to it being the best thing about the cartoon.While he is a character that won't click with everybody, Casper does win me over with his friendly nature and kindness for much of the cartoon. While barely in the cartoon, it was nice to see Casper's mother and what a compassionate and gentle figure she is. While there are elements of the usual plot elements in a Casper cartoon, 'Hide and Shriek' is significantly less repetitive and recycled than most Casper cartoons (and even Famous Studios cartoons in general) of this period.'Hide and Shriek's' animation on the whole was well done, and an improvement on the animation in the previous Casper cartoons, where budget and time constraints were clearly starting to show. There is a lack of finesse in the drawing sometimes, but it is less hasty-looking and scrappy, and there are some nice detailed backgrounds and lively colours (apart from the odd overly bright one). Casper and Spooky have nice chemistry, which is less twee and typical than most of the previous Casper cartoons.In summary, the debut cartoon of Cousin Spooky, despite the character himself still evolving and not really making much of an impression, is a decent one. 7/10 Bethany Cox",
    "Director": "Seymour Kneitel, Myron Waldman",
    "Writer": "Carl Meyer",
    "Actors": "Jack Mercer, Mae Questel, Alan Shay",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0147915",
      "title": "Boos and Arrows",
      "year": 1954,
      "imdbRating": "4.9",
      "imdbVotes": "34",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147934",
      "title": "Bull Fright",
      "year": 1955,
      "imdbRating": "5.1",
      "imdbVotes": "26",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149087",
      "title": "Spooking with a Brogue",
      "year": 1955,
      "imdbRating": "5.5",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148406",
      "title": "Line of Screammage",
      "year": 1956,
      "imdbRating": "5.6",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148646",
      "title": "Puss 'n' Boos",
      "year": 1954,
      "imdbRating": "5.9",
      "imdbVotes": "40",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147944",
      "title": "By the Old Mill Scream",
      "year": 1953,
      "imdbRating": "5.4",
      "imdbVotes": "42",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148323",
      "title": "Ice Scream",
      "year": 1957,
      "imdbRating": "5.4",
      "imdbVotes": "27",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148409",
      "title": "Little Boo-Peep",
      "year": 1953,
      "imdbRating": "5.3",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148591",
      "title": "Peek-a-Boo",
      "year": 1957,
      "imdbRating": "5.9",
      "imdbVotes": "28",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149083",
      "title": "Spook No Evil",
      "year": 1953,
      "imdbRating": "5.5",
      "imdbVotes": "34",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147948",
      "title": "Casper the Friendly Ghost - Cage Fright",
      "year": 1952,
      "imdbRating": "6.1",
      "imdbVotes": "43",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149084",
      "title": "Spook and Span",
      "year": 1958,
      "imdbRating": "5.6",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T06:23:23.162Z"
}