{
  "imdbId": "tt0146910",
  "title": "Hot Tamale",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hot-tamale-1930",
      "id": "hot-tamale-1930",
      "title": "Hot Tamale (1930)",
      "description": "In that \"cute\" beginning, we see some funny sight gags with our hero serenading his girl down south in Mexico, strumming his guitar in a unique matter and then literally getting \"cold feet.\" However, his fantasies give him the nerve to go inside and play for her where we see more tricks with his guitar and some humorous dancing by the girl, who dances like Pee Wee Herman in a few spots. This goes on and on and finally he laves and another suitor comes by, but the girl obviously doesn't like this guy.... Watch on RetroFlix:  https://retroflix.org/hot-tamale-1930/",
      "fileSize": 122909570,
      "addedAt": "2026-01-07T00:08:46.613Z",
      "thumbnail": "https://archive.org/services/img/hot-tamale-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 55
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 5.1,
    "imdbVotes": 39,
    "Genre": "Animation, Short",
    "Plot": "The first three minutes of this eight minute cartoon held some real promise, but it turned out to be pretty lame overall.In that \"cute\" beginning, we see some funny sight gags with our hero serenading his girl down south in Mexico, strumming his guitar in a unique matter and then literally getting \"cold feet.\" However, his fantasies give him the nerve to go inside and play for her where we see more tricks with his guitar and some humorous dancing by the girl, who dances like Pee Wee Herman in a few spots.This goes on and on and finally he laves and another suitor comes by, but the girl obviously doesn't like this guy. How the first \"senor\" deals with him and his horse takes up the final four minutes which is too slow and repetitive with one joke. It would also be very offensive to animal rights people as this idiot beats up his horse.",
    "Director": "Harry Bailey, John Foster",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020767",
    "tt0020907",
    "tt0146570",
    "tt0022301",
    "tt0021877",
    "tt0161580",
    "tt0146759",
    "tt0024702",
    "tt0146563",
    "tt0146738",
    "tt0147274",
    "tt0149980"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.613Z"
}