{
  "movieId": "tt0144191",
  "title": "A Face in the Fog",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Face_in_the_Fog_1936",
      "id": "Face_in_the_Fog_1936",
      "title": "A Face in the Fog",
      "description": "Multiple murders are being committed by The Fiend.",
      "fileSize": 1722023898,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/Face_in_the_Fog_1936",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 38639
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vKdzncvOLRY",
      "id": "vKdzncvOLRY",
      "title": "A Face in the Fog (1936) MYSTERY",
      "description": "Stars: June Collyer, Lloyd Hughes, Lawrence Gray\nDirector: Robert F. Hill\n\nA mysterious killer known as The Fiend uses an unusual bullet as his trademark for his murders.",
      "addedAt": "2025-12-26T23:50:53.835Z",
      "thumbnail": "https://i.ytimg.com/vi/vKdzncvOLRY/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBgAWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLC5CsYi5ynXJCPqNOqS9JWarNxYtQ",
      "duration": 3312,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "61 min",
    "imdbRating": 4.5,
    "imdbVotes": 245,
    "Genre": "Mystery, Thriller",
    "Plot": "Cast members of a show at the Alden theatre are being terrorized by a hunchback killer known as the Fiend, using frozen bullets, and two have been killed. Newspaper reporters Jean Monroe, drama editor, and Frank Gordon, accompanied by a dumb photographer, Elmer are on the story. Jean receives a note from Ted Wallington, the star of the play,\"Satan's Bride\", to meet him. From him, she learns the note was a fake, the lights go out and the Fiend strikes again as Wallington slumps to the floor dead. Peter Fortune, the author of the show, who has helped the police solve previous cases, agrees to assist on this case, but insists on working alone. Jean and Frank have taken rooms at the Globe Hotel, where Reardon, an actor, is also a resident. A telephone message for Frank turns out to be a ruse in the hopes of getting him out of the hotel. Reardon suggests calling the police but, while phoning, his finger is holding the receiver hook down. Meanwhile, Elmer calls Frank and the reporter is dumbfounded to hear his phone ring while Reardon is apparently talking to Police Captain Davis. A fight ensues and Reardon escapes. This gives the hunchbacked terror a chance to slip in the room to make another attempt on Jean's life, but the shot misses. Fortune has some pictures of Reardon donning the Fiend's flowing robe, and Reardon is taken into custody. During an re-enactment of the Wallington murder, Reardon is killed and another theory is exploded. Frank discovers a cigarette case, belonging to Fortune, and his investigation reveals the Fortune's brother had been killed in a fire in a theatre owned by Cooke and Baker, the producers of the show.",
    "Director": "Robert F. Hill",
    "Writer": "Peter B. Kyne, Al Martin",
    "Actors": "June Collyer, Lloyd Hughes, Lawrence Gray",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027839",
    "tt0028200",
    "tt0026740",
    "tt0027384",
    "tt0027504",
    "tt0027136",
    "tt0026975",
    "tt0026029",
    "tt0026868",
    "tt0026971",
    "tt0025531",
    "tt0025564"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.398Z"
}