{
  "movieId": "tt0150357",
  "title": "The Dog Snatcher",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-dog-snatcher-1952",
      "id": "the-dog-snatcher-1952",
      "title": "The Dog Snatcher (1952)",
      "description": "Mr. Magoo's dog is threatened by the dog catcher (who Magoo takes for a policeman). He's given until noon to license it. As he's preparing to leave, a circus goes by; he hitches a ride in a clown car (thinking it's a taxi) and, after a digress through the big top and into the gorilla cage (mayor's office), he ends up in the panther cage. He thinks the panther is his dog, and that he's been captured by the dog catcher, so he slips on the collar and takes it home. When Magoo gets home, the dogcatcher is waiting for him, but at the sight of the panther, he gives Magoo the license and traps the panther under a washtub. As the circus people cart it away, Magoo slips the license onto his tigerskin rug's head. Watch on RetroFlix:  https://retroflix.org/the-dog-snatcher-1952/",
      "fileSize": 39640701,
      "addedAt": "2026-01-07T00:11:57.684Z",
      "thumbnail": "https://archive.org/services/img/the-dog-snatcher-1952",
      "language": "eng",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 109
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "6 min",
    "imdbRating": 6.5,
    "imdbVotes": 51,
    "Genre": "Family, Animation, Short",
    "Plot": "Mr. Magoo's dog is threatened by the dog catcher (who Magoo takes for a policeman). He's given until noon to license it. As he's preparing to leave, a circus goes by; he hitches a ride in a clown car (thinking it's a taxi) and, after a digress through the big top and into the gorilla cage (mayor's office), he ends up in the panther cage. He thinks the panther is his dog, and that he's been captured by the dog catcher, so he slips on the collar and takes it home. When Magoo gets home, the dogcatcher is waiting for him, but at the sight of the panther, he gives Magoo the license and traps the panther under a washtub. As the circus people cart it away, Magoo slips the license onto his tigerskin rug's head.",
    "Director": "Pete Burness",
    "Writer": "Paul Schneider, Bill Scott",
    "Actors": "Jim Backus, Billy Bletcher, Jerry Hausner",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150039",
    "tt0045033",
    "tt0150308",
    "tt0151179",
    "tt0151449",
    "tt0151432",
    "tt0162458",
    "tt0151451",
    "tt0151454",
    "tt0152266",
    "tt0150019",
    "tt0151446"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.684Z"
}