{
  "imdbId": "tt0191263",
  "title": "The Man Beneath",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mymovie_201907",
      "id": "mymovie_201907",
      "title": "\"The Man Beneath\" (1919) Sessue Hayakawa, John Gilbert",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"The Man Beneath\" is a crime drama. An Asian man, who sees his romance with a European woman hindered by racial prejudices, uses his talents to save a white man in trouble. Directed by                    William Worthington Produced by                  Haworth Pictures Corporation Starring                          Sessue Hayakawa, Helen Jerome Eddy, John Gilbert, Pauline Curley Release date                   July 6, 1919 Running time                 60 minutes Country                          USA Language                        Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"  ",
      "fileSize": 116075036,
      "addedAt": "2026-01-07T00:09:54.334Z",
      "thumbnail": "https://archive.org/services/img/mymovie_201907",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 1549
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "58 min",
    "imdbRating": 6.2,
    "imdbVotes": 53,
    "Genre": "Crime, Drama",
    "Plot": "The renown Hindu scientist, Dr. Chindi Ashutor, who has conquered plague in India, visits Scotland and falls in love with Kate Erskine, whose sister Mary is engaged to Ashutor's college friend, James Bassett. Although Kate loves Ashutor, she says marriage would make them social outcasts. Several months later, Bassett comes to Ashutor in India for help in eluding members of the Black Hand. Bassett became involved with them out of curiosity, and now they demand that he commit a murder. On a boat bound for Italy, Ashutor gives Bassett an injection to make him appear dead. In view of the Black Hand agents, François and Countess Petite Florence, a dummy is then buried at sea. In Scotland, after the agents overhear Ashutor tell the Erskines that Bassett is all right, Ashutor bribes François, who is then murdered by the countess. For his silence, Ashutor demands that Bassett be left alone. He then bids another farewell to Kate saying he will always love her.",
    "Director": "William Worthington",
    "Writer": "Edmund Mitchell, L.V. Jefferson",
    "Actors": "Sessue Hayakawa, Helen Jerome Eddy, Pauline Curley",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010791",
    "tt0150388",
    "tt0184572",
    "tt0010402",
    "tt0010890",
    "tt0011565",
    "tt0011881",
    "tt0011904",
    "tt0012651",
    "tt0021785",
    "tt0138507",
    "tt0005529"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.334Z"
}