{
  "imdbId": "tt0161948",
  "title": "Runaway Blackie",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/runaway-blackie-1933",
      "id": "runaway-blackie-1933",
      "title": "Runaway Blackie (1933)",
      "description": "In the cartoon, the lead character is a sheep named Blackie. While this sheep does bear a slight resemblance to Cubby, it has horns and cloven hoofs for hands... but Blackie runs away from home and gets caught and put in a chain gang.... Watch on RetroFlix:  https://retroflix.org/runaway-blackie-1933/",
      "fileSize": 91659729,
      "addedAt": "2026-01-07T00:10:40.951Z",
      "thumbnail": "https://archive.org/services/img/runaway-blackie-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 36
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.6,
    "imdbVotes": 16,
    "Genre": "Animation, Short",
    "Plot": "Although the techniques used in this cartoon are simple for the era, this cartoon, about a black sheep who runs away from home and gets flung onto a chain gang, is well put together in terms of gag construction, which also drives the plot. Although it may take some few minutes before the jokes overwhelm the bad animation, it turns out to be a good cartoon in the end.Given that this came out in 1933, this is a -- technically anyway --very primitive cartoon. It is, except for a brief bit involving a talking moon, a synchronized cartoon and the backgrounding is a watery gouache.Synchronization was a stage between silent and talking animation. In it the cartoon comes with its own soundtrack and the actions are coordinated to it --the process, carried to an extreme, is called \"Mickey-Mousing\" for a reason. It is simpler and hence cheaper than work used in animating characters' mouths to match dialogue.",
    "Director": "Harry Bailey",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0146629",
    "tt0150804",
    "tt0149684",
    "tt0146464",
    "tt0149817",
    "tt0161331",
    "tt0149988",
    "tt0023889",
    "tt0150130",
    "tt0148026",
    "tt0148036",
    "tt0146594"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.951Z"
}