{
  "imdbId": "tt0178288",
  "title": "La calle del pecado",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-calle-del-pecado-1954",
      "id": "la-calle-del-pecado-1954",
      "title": "La Calle Del Pecado (1954)",
      "description": "La calle del pecado  es una película de  Argentina  del género del drama filmada en blanco y negro dirigida por  Ernesto Arancibia  sobre su propio guion escrito en colaboración con Wassen Eisen –uno de los seudónimos utilizados por Alexis de Arancibia- que se estrenó en Argentina el 8 de abril de 1954 y que tuvo como protagonistas a  Héctor Armendáriz ,  Sofía Bozán ,  Alberto de Mendoza ,  Florindo Ferrario ,  Santiago Gómez Cou ,  Jacinto Herrera  y  Zully Moreno . Último filme de  Sofía Bozán . (Wikipedia) Sinopsis La historia de una joven ambiciosa de origen humilde que oscila entre el amor interesado por un empresario y la pasión por su hijo. Reparto Juan Alighieri Héctor Armendáriz Cayetano Biondo Sofía Bozán Alberto de Mendoza  ... Alberto Salazar jr. Rodolfo Díaz Soler Mercedes Escribano Florindo Ferrario Carlos Fioriti Luis García Bosch Santiago Gómez Cou Jacinto Herrera Zully Moreno  ... Ruby Colmeiro Arsenio Perdiguero Nino Persello Félix Rivero Alita Román Sarita Rudoy Alfredo Santacruz Fernando Siro Mariano Vidal Molina Leda Zanda Nené Cao Rafael Diserio",
      "fileSize": 1463853208,
      "addedAt": "2026-01-07T00:09:24.701Z",
      "thumbnail": "https://archive.org/services/img/la-calle-del-pecado-1954",
      "language": "spa",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 49
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "107 min",
    "imdbVotes": null,
    "Genre": "Drama",
    "Plot": "The incredible amount of 58 years have gone by since the making of this movie and today I saw it for the first time. It is unjust to criticized such an old movie by nowadays standards, since the world has changed so drastically during these six decades. Nothing we see in this movie can relate to our current living standards, starting with the city streets (mainly studio sets) cars, clothes, behaviors, etc. but surprisingly, the tone and the tempo of the scenes with an excellent editing make the viewing a pleasant experience.The acting is old fashioned and emphatic, save maybe Alberto de Mendoza, quite fresh and spontaneous as the secondary actors, all quite reliable, but Zully Moreno, the Queen of the Argentinian movies at the time and our main character, was too stiff and too self conscious about her persona, all the time dressed to kill with Haute Couture creations even when she was a humble girl and coiffed to death, carefully lighted in a sort of Marlene Dietrich way, something that Marlene could very well control but our Zully couldn't, because she always looked self-aware; we knew she was posing on her best side to the camera all the time and wondering how gorgeous she was looking, never getting into the character no matter the circumstances, she only wanted to look sensational, as sensational as possible (she did).The script is quite trivial and it had been portrayed too many times in the cinema by now, specially in the Latin cinema of that time: The girl from the wrong side of the tracks, ambitious and without scruples that leaves the humble neighborhood in exchange for the sinful lights of the downtown dens of SIN. She climbs up the ladder of success towards big money through her acquaintance with wealthier and wealthier \"friends\".To make the story short, she finds the right candidate that wants to marry her, to make her a \"respectable woman\" in \"normal\" society but, dismissing the fatal consequences (consider her background) she goes and falls in love with this man's son... The end is so predictable we don't have to deal with it.***SPOILERS AHEAD***The last scene is too much: She digresses about her downfall (all her original plans for a better --moneyed-- future collapsed when the old man finds out about her torrid crush for the young guy, his own son) while walking down a nightmarish surreal decor -- dressed in an incredible mix of a couture creation that resembles some oriental belly dancer rags, blended with an eccentric deshabillé and ending with a Phillys Diller outfit ages before Pillys Diller (maybe that costume meant her mind snapped, her dress designer was slightly inebriated or they run out of budget to end the production)-- and all of a sudden one of her ex lovers appears from a dark alley shooting her pointblank a fatal shot. This is not an obstacle for her to keep walking, although she is dying, arriving at the stadium (The Luna Park in Buenos Aires) where the love of her life (a boxer) was fighting that night, having a brief dialog with him, wishing him good luck and when he turns his back, dropping dead, impeccably coiffed. End of the movie. End of my review and your patience.",
    "Director": "Ernesto Arancibia",
    "Writer": "Alexis de Arancibia, Ernesto Arancibia",
    "Actors": "Zully Moreno, Santiago Gómez Cou, Alberto de Mendoza",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0178806",
    "tt0178856",
    "tt0178870",
    "tt0178312",
    "tt0178303",
    "tt0201413",
    "tt0200560",
    "tt0047823",
    "tt0200605",
    "tt0193905",
    "tt0187587",
    "tt0121665"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.701Z"
}