{
  "movieId": "tt0148594",
  "title": "Penguin for Your Thoughts",
  "year": 1956,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/penguin-for-your-thoughts-1956",
      "id": "penguin-for-your-thoughts-1956",
      "title": "Penguin for Your Thoughts (1956)",
      "description": "After startling a stork who drops his package, Casper the Friendly Ghost delivers a baby penguin to its parents at the South Pole. Watch on RetroFlix:  https://retroflix.org/penguin-for-your-thoughts-1956/",
      "fileSize": 38858353,
      "addedAt": "2026-01-07T00:10:12.698Z",
      "thumbnail": "https://archive.org/services/img/penguin-for-your-thoughts-1956",
      "language": "eng",
      "year": 1956,
      "collection": "feature_films",
      "downloads": 56
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.4,
    "imdbVotes": 39,
    "Genre": "Animation, Short",
    "Plot": "The late-40s to the early/mid-50s Casper the Friendly Ghost cartoons had a higher budget and overall the overall quality was much better. Onwards, the quality did diminish quite significantly though the overall cartoons varied, some decent, many mediocre.Famous Studios' cartoons are not for all tastes, but my opinion is that their early stuff and some of the early 50s output are good. While they were very formulaic they were always well animated and voiced with some funny parts, some poignancy and decent characters and their regular composer Winston Sharples could always be relied on to write a great and often outstanding score.Admittedly though, by the mid-50s through to the late-60s Famous Studios' cartoons did get repetitive. While Sharples' music still shone and the voice actors did their best the animation suffered due to lower budgets and tighter deadlines, the humour became more tired and slow in timing than sharp and funny, the stories became increasingly predictable and rehashed and some characters started losing their initial spark, this is particularly true of most of the later Herman and Katnip cartoons.Best thing about 'Penguin for Your Thoughts' is the music score. Starting to experiment more with a more mellow horn and string sound, Winston Sharples' music score here is typically merry and whimsical, it's beautifully orchestrated, energetic and adds so much to the mood, his music has always been one of the best assets of the Famous Studios cartoons and it's not an exception here. In fact how it's composed and how it meshes so well with everything going on in the animation, story and action contributes to it being the best thing about the cartoon.And who can't help love that adorable baby penguin? The cartoon is worth seeing for him alone. Also love Casper's love and kindness and friendship, and this is one of few 50s Casper cartoons to be cute and heart-warming without being too twee, especially Casper and the penguin's friendship which is beautifully realised. Voice acting, although dialogue is reasonably minimal, is dependable.Where 'Penguin for Your Thoughts' isn't so good is the animation, which has been much better before. 'Casper Genie' saw a significant decline in quality as a result of lower budget and tighter time constraints, and the series hasn't recovered since. Some of the colours are vibrant, but the backgrounds and drawings have lost their meticulousness and instead look hastily drawn and scrappy. The reactions to Casper are pretty unimaginative too, and not particularly funny.It's a pretty predictable cartoon too, not as repetitive as most Casper cartoons but no surprises, and while the dialogue is minimal there is nothing memorable about it and it's not particularly good either being too sugary. Lastly, the penguin saving Casper from drowning was unnecessary seeing as Casper is already a ghost.Overall, nice enough, Sharples' score is outstanding and the baby penguin adorable with a capital 'A' but it is a shame that the animation has taken such a nosedive. 7/10 Bethany Cox",
    "Director": "Seymour Kneitel, Tom Golden",
    "Writer": "Larz Bourne",
    "Actors": "Jack Mercer, Mae Questel, Sid Raymond",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0147961",
    "tt0148187",
    "tt0147909",
    "tt0148406",
    "tt0148093",
    "tt0147916",
    "tt0148409",
    "tt0147934",
    "tt0148214",
    "tt0148278",
    "tt0148309",
    "tt0148323"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.698Z"
}