{
  "imdbId": "tt0148929",
  "title": "A Sleepless Night",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-sleepless-night-1948",
      "id": "a-sleepless-night-1948",
      "title": "A Sleepless Night (1948)",
      "description": "Heckle and Jeckle wind up blowing out a tire on the car they are in and go up to a bear's cave to try and find a place to stay for the night. Watch on RetroFlix:  https://retroflix.org/a-sleepless-night-1948/",
      "fileSize": 31756709,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-sleepless-night-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 96
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "6 min",
    "imdbRating": 5.9,
    "imdbVotes": 23,
    "Genre": "Animation, Short",
    "Plot": "In my opinion, the Heckle and Jeckle theatrical series is generally the best of Terrytoons Studios' regular character theatrical series (do like enough cartoons from that of Gandy/Sourpuss too). Which generally were interesting watches, if more the earlier ones than the later ones, but not all of them did much for me. It does help too that Heckle and Jeckle themselves are compelling lead characters in the way that some of the studio's other recurring characters weren't.1948's 'A Sleepless Night' is towards being one of their best and another example of the earlier Heckle and Jeckle cartoons being consistently good, the best of them very good. 'A Sleepless Night' is one of the very good ones and one of the better 1948 Terrytoons cartoons. It does deserve to be better known, as does the whole series (although not all their later outings were great they were still better than most of the other Terrytoons theatrical series at their worst).'A Sleepless Night's' story admittedly is not very original and at times does feel a little too much like a series of gags. Some of which being quite familiar.So much works in 'A Sleepless Night's' favour though. Despite their low ratings, personally have found not an awful lot to fault most of Heckle and Jeckle's cartoons and think that they have a lot to like about them. The music, a consistent good thing, is so lovely to listen to and there is such an uplifting vibe hearing it because of the snappy character it has. The animation is every bit as great. It is vibrantly coloured, quite smooth in drawing and transitions, doesn't look static or simplistic and the attention to detail is good.When it comes to the gags, 'A Sleepless Night' scores very highly. The cartoon is filled with them and they all range from amusing to hilarious. While the ending is very predictable it is also a lot of fun and classic Heckle and Jeckle. The dialogue avoids being too corny and the action is deliciously anarchic, sometimes darkly so when the two get more malicious. The pace is fast and furious and the action and increasing anarchy is wonderfully chaotic, yet remarkably it doesn't feel too much of an overload. The story is not novel, but the character interaction, constant entertainment value and eventful content helped always make it interesting still.Once again, Heckle and Jeckle are highly entertaining characters, their movements, the way they talk (in the use of language and the voices themselves) and their expressions make them quite unique characters for Terrytoons. The bear is one of their most sympathetic adversaries and is an interesting and amusing one as well, sympathy is almost entirely with him. The interaction between them is great and has tension even though it's not much different from similar conflicts.Concluding, very well done. 8/10.",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen, Doug Moye",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148292",
    "tt0148223",
    "tt0148568",
    "tt0149234",
    "tt0147966",
    "tt0150232",
    "tt0150596",
    "tt0151420",
    "tt0149160",
    "tt0149621",
    "tt0148172",
    "tt0153196"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}