{
  "movieId": "tt0162411",
  "title": "Isadora Duncan: Movement from the Soul",
  "year": 1989,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/IsadoraDuncan",
      "id": "IsadoraDuncan",
      "title": "Isadora Duncan",
      "description": "Isadora Duncan Vanessa Redgrave Sparks 'The Loves of Isadora': Karel Reisz's Picture By VINCENT CANBY, nytimes.com Published: April 28, 1969 Karel Reisz' biographical portrait of Isadora Duncan stars Vanessa Redgrave as the famed modern dancer, who gained notoriety for her revolutionary performances and public romantic life.",
      "fileSize": 17947420,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/IsadoraDuncan",
      "collection": "feature_films",
      "downloads": 1425
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "58 min",
    "imdbRating": 6.1,
    "imdbVotes": 21,
    "Genre": "Documentary",
    "Plot": "This unsentimental portrait of the complex and charismatic \"Mother of Modern Dance\" traces the life and artistic development of San Francisco-born Isadora Duncan (1877-1927). Duncan raised dance from mere vaudeville entertainment to a legitimate art form, laying the foundation for today's modern dance. The first American performing artist to gain worldwide acclaim, she dared to use her medium for political purposes: creating the first choreography to call people to arms, to express the plight of repressed workers, and to agitate for the freedom of women. Set against the social tapestry of turn-of-the-century America and Europe, Isadora Duncan: Movement From the Soul is a study of a revolutionary and iconoclast, a woman who dared to defy Victorian mores through both her art and the way she lived. Illuminating and gracefully crafted, the documentary interweaves the details of Isadora Duncan's tumultuous life with re-creations of twelve of her dances. Spanning the entire range of her career, these dances illuminate Duncan's personal and artistic development. Viewers witness the evolution of Duncan's early lyrical compositions into her later dramatic and politically motivated work. An essential film for dance students and scholars, Isadora Duncan: Movement From the Soul is also appropriate for American studies, cultural history, art history, and women's studies classes, and will be of interest to anyone who wants to know more about this singular woman and her art.",
    "Director": "Daniel Geller, Dayna Goldfine",
    "Writer": "N/A",
    "Actors": "Lori Belilove, Isadora Duncan, Julie Harris",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0201829",
    "tt0173731",
    "tt0104312",
    "tt0376917",
    "tt6658312",
    "tt0800129",
    "tt2116884",
    "tt0106944",
    "tt0091134",
    "tt0268602",
    "tt0438487",
    "tt0247568"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}