{
  "imdbId": "tt0151429",
  "title": "The Mad King",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-mad-king-1932",
      "id": "the-mad-king-1932",
      "title": "The Mad King (1932)",
      "description": "The Mad King is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/the-mad-king-1932/",
      "fileSize": 33456443,
      "addedAt": "2026-01-07T00:12:10.592Z",
      "thumbnail": "https://archive.org/services/img/the-mad-king-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 47
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.2,
    "imdbVotes": 17,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.Of the 1932 Terrytoons, 'The Mad King' for me is one of the worst. Also, again from personal opinion, among the lesser Terrytoons. Not irredeemably awful, but very weak. Its main reason to see it is, as has said a number of times by me already, if you are on a quest to watch every Terrytoon available (most are but not all).Its best asset is the music, which is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action.Also saving 'The Mad King' from total doom is the character of the cat, who is a good antagonistic threat, without being frightening, and deserving of heroes with stronger personalities than the pallid ones here to play off against. However, the animation is not good. It's stiff and crude with choppy transitions, static drawing and even the overly-simplistic backgrounds underwhelm (background work-wise, 'The Mad King' has to be one of the least detailed and ambitious Terrytoons).Very little is fun or interesting. The story is flimsy and formulaic, with a premise done to death long before this cartoon and it shows badly in its very stale execution. The pace is dull often, and gags are too few and have nothing to them. Likewise with the mice heroes, the only interesting character is the cat.In summary, weak. 3/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149979",
    "tt0149991",
    "tt0150160",
    "tt0150165",
    "tt0150515",
    "tt0161563",
    "tt0150516",
    "tt0150933",
    "tt0150945",
    "tt0151076",
    "tt0161863",
    "tt0161913"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}