{
  "imdbId": "tt0150532",
  "title": "Felix the Fox",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/felix-the-fox-1948",
      "title": "Felix the Fox (1948)",
      "description": "Felix the Fox is a Terrytoons cartoon directed by Mannie Davis. Watch on RetroFlix:  https://retroflix.org/felix-the-fox-1948/",
      "id": "felix-the-fox-1948"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "5.9",
    "imdbVotes": "15",
    "Genre": "Animation, Short",
    "Plot": "It is very interesting to see Dimwit partnered with a character other than Heckle and Jeckle, this time in the shape of a fox named Felix. And one that is just as much as more than a match for him as they are. Very nearly did say that 'Felix the Fox' is one of three 1948 cartoons to not have a recurring character. Before reminding myself that that isn't true, if one counts Dimwit as a recurring supporting/co-lead character (personally do). So 1948 is another year to be low on cartoons to not have a recurring lead character, as well as being heavy on Mighty Mouse and Heckle and Jeckle.'Felix the Fox' is not a bad cartoon at all and is worth the look, which is true for most of Terrytoons' 1948 output. Again being consistently good with the Heckle and Jeckle theatrical series, but variable with Mighty Mouse's. Personally do think though that it is uneven, with the second half being a lot better than the first. Like the previous reviewer, to me the first half was pretty uninspired, whereas the second was very good. There are the usual good things in 'Felix the Fox', while also with some similar not so good things.The good things are going to be started off with. Music is fantastic and as ever with Terrytoons the best thing about 'Felix the Fox'. It is beautifully and cleverly orchestrated and arranged, is terrific fun to listen to and the lively energy is present throughout, doing so well with adding to the action. Close behind was the animation, as said more than once this component has come on considerably since the Terrytoons Studio first started. Overall, it is nicely detailed, lively and colourful, with nice attention to detail and vibrant colours that don't look garish.As said, the second half is well done. There are some clever and very funny gags and while some familiarity may need to be in order the impressions of Groucho Marx and Charles Boyer are a lot of fun to witness. The ending is very amusing. Both Dimwit and especially Felix are good characters, Dimwit is one one roots for while not being bland and even more interesting is increasingly crafty Felix. The conflict between them has nice comic timing and tension, although it is not unfamiliar territory. Dayton Allen voices both characters beautifully and makes them individual enough from one another.Having said all of that, the story is very paper thin and takes a while to get going, not uncommon for Terrytoons it has to be said. The first half does drag quite badly somewhat and humour-wise is very bland. From the gags being not enough and all of them being barely amusing at best and very predictable rehashes.It is also fairly derivative, from it being a familiar premise already done to death executed with not much originality in the first half before picking up by a lot in the second. Some of the writing is quite corny.Concluding, above average and enjoyable enough although it takes a bit of time to improve from a shaky start. 6/10.",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0148184",
      "title": "Free Enterprise",
      "year": 1948,
      "imdbRating": "5.9",
      "imdbVotes": "26",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151443",
      "title": "The Magic Slipper",
      "year": 1948,
      "imdbRating": "6.5",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152124",
      "title": "The Racket Buster",
      "year": 1948,
      "imdbRating": "6.4",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148042",
      "title": "Dancing Shoes",
      "year": 1949,
      "imdbRating": "5.7",
      "imdbVotes": "26",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148253",
      "title": "Happy Landing",
      "year": 1949,
      "imdbRating": "4.8",
      "imdbVotes": "17",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148319",
      "title": "Hula Hula Land",
      "year": 1949,
      "imdbRating": "5.8",
      "imdbVotes": "28",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148458",
      "title": "McDougal's Rest Farm",
      "year": 1947,
      "imdbRating": "5.9",
      "imdbVotes": "25",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148378",
      "title": "King Tut's Tomb",
      "year": 1950,
      "imdbRating": "5.7",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148588",
      "title": "Peace Time Football",
      "year": 1946,
      "imdbRating": "4.5",
      "imdbVotes": "16",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152533",
      "title": "Sour Grapes",
      "year": 1950,
      "imdbRating": "5.1",
      "imdbVotes": "11",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152161",
      "title": "The Red-Headed Monkey",
      "year": 1950,
      "imdbRating": "5.0",
      "imdbVotes": "9",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146300",
      "title": "The Talking Magpies",
      "year": 1946,
      "imdbRating": "6.1",
      "imdbVotes": "222",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:08:24.394Z"
}