{
  "movieId": "tt0148603",
  "title": "Pickled Puss",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pickled-puss",
      "id": "pickled-puss",
      "title": "Pickled Puss",
      "description": "The cat and mouse are in their usual game of chase-and-pursue until the mouse hides in a pickled-herring barrel. The cat gets intoxicated from inhaling the fumes and immediately becomes the mouse's newest best friend. He defends the mouse from a mean alley cat, and the mouse invites him to come home with him. There, the mouse takes care of him and sobers him up, and the cat immediately begins to chase him again. He reaches the barrel again and regains his newest best friend.",
      "fileSize": 82858711,
      "addedAt": "2026-01-07T00:10:12.700Z",
      "thumbnail": "https://archive.org/services/img/pickled-puss",
      "collection": "feature_films",
      "downloads": 372
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pickled-puss-1948",
      "id": "pickled-puss-1948",
      "title": "Pickled Puss (1948)",
      "description": "The cat and mouse are in their usual game of chase-and-pursue until the mouse hides in a pickled-herring barrel. The cat gets intoxicated from inhaling the fumes and immediately becomes the mouse's newest best friend. He defends the mouse from a mean alley cat, and the mouse invites him to come home with him. There, the mouse takes care of him and sobers him up, and the cat immediately begins to chase him again. He reaches the barrel again and regains his newest best friend. Charlie Chaplin deserves an (uncredited) story listing. Watch on RetroFlix:  https://retroflix.org/pickled-puss-1948/",
      "fileSize": 82834407,
      "addedAt": "2026-01-07T00:10:12.700Z",
      "thumbnail": "https://archive.org/services/img/pickled-puss-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 199
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 5.7,
    "imdbVotes": 23,
    "Genre": "Animation, Short, Family",
    "Plot": "The cat and mouse are in their usual game of chase-and-pursue until the mouse hides in a pickled-herring barrel. The cat gets intoxicated from inhaling the fumes and immediately becomes the mouse's newest best friend. He defends the mouse from a mean alley cat, and the mouse invites him to come home with him. There, the mouse takes care of him and sobers him up, and the cat immediately begins to chase him again. He reaches the barrel again and regains his newest best friend. Charlie Chaplin deserves an (uncredited) story listing.",
    "Director": "Howard Swift",
    "Writer": "Cal Howard, Dave Monahan",
    "Actors": "Mel Blanc, Stan Freberg, Cal Howard",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0151321",
    "tt0148419",
    "tt0149273",
    "tt0147949",
    "tt0036764",
    "tt0148310",
    "tt0045258",
    "tt0148627",
    "tt0043082",
    "tt0149316",
    "tt0029502",
    "tt0147957"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.700Z"
}