{
  "imdbId": "tt0151339",
  "title": "Lil' Ainjil",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lil-ainjil-1936",
      "title": "Lil Ainjil",
      "description": "In the lone Charles Mintz-produced (and Columbia Pictures-released) entry that was modeled from Krazy Kat's creator George Herriman's original designs, Ignatz Mouse devises several means of hurling bricks at Krazy, who considers this a term of affection. Besides Ignatz, Offissa Bull Pupp and Mrs. Kwakk Wakk also make their only Mintz-era appearances. Watch on RetroFlix:  https://retroflix.org/lil-ainjil-1936/",
      "id": "lil-ainjil-1936"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": "4.2",
    "imdbVotes": "30",
    "Genre": "Animation, Short",
    "Plot": "George Herriman created his Krazy Kat comic strip around 1910, soon hit his stride, and then kept drawing the strip right up until his death in 1944. While it was never as popular as such contemporaries as the Katzenjammer Kids or Barney Google, the strip always had a dedicated following, thanks largely to Herriman's wild imagination, his unique brand of whimsy, and his facility for language. Attempts to adapt Krazy Kat to the screen began as early as 1916, under the auspices of Herriman's employer William Randolph Hearst. In some of the early efforts (such as The Great Cheese Robbery) the animators made an effort to capture the style of the source material, but as time went by the screen versions had less and less to do with the newsprint version. By the early '30s, the title character had been reduced to a feline version of Mickey Mouse, the strip's surreal desert landscape disappeared, and Herriman's other characters vanished.Producer Charles Mintz of Columbia Pictures was responsible for the '30s shorts. Like any other series some entries are better than others, but none of them had anything to do with Herriman until 1936, when Lil' Ainjil was released. This cartoon represented a departure from the usual output, a fresh attempt to return to the actual, quirky source material. The androgynous Krazy Kat of this cartoon looks like the elfin figure from the strip, while the other characters, such as Offissa Pup, Ignatz Mouse, and Mrs. Kwakk Wakk the Duck, have been revived. Most noticeable of all, the backgrounds in this cartoon closely resemble the desert mesas of Herriman's Coconino County.It would be nice to say that Lil' Ainjil is a great cartoon, a forgotten classic, but somehow it doesn't quite work. It kicks off an a promising note, as Offisa Pup and Mrs. Kwakk Wakk march along in tandem, and Pup announces in song that he represents the forces of law and order here in Coconino. The backgrounds certainly look right, and Pup's distinctive voice is provided by raspy Billy Costello, best remembered for voicing Popeye in his early Fleischer cartoon appearances. Krazy Kat enters and dances crazily; her voice identifies her as female. Before long, she's poking her head through a hole in a carnival booth, and Ignatz Mouse is pummeling her with bricks fired Gatling gun style. When Pup intervenes, Ignatz disguises himself with a beard and pretends to collect alms for the Christmas fund. The mouse winds up in the familiar jailhouse of Coconino County.So far so good; we do seem to be in Herriman's world, at least. But at this point the filmmakers apparently ran out of gas, or inspiration, and brought in a villain figure wearing an eye-patch, a knock-off of Mickey Mouse's perennial nemesis Pegleg Pete. It was decided we required a \"plot,\" so a halfhearted story about this bad guy was concocted. It doesn't amount to much. In the end he's thwarted, Krazy gets clobbered with another brick, and Offisa Pup chases Ignatz away. The End.It appears that animator Isadore Klein was the driving force behind this cartoon, the one who suggested following the style of the strip more closely. In a later interview he indicated that he was disappointed with the final product. No follow-ups were made. The Powers That Be at the studio must have figured it wasn't worth the effort, and in Columbia's subsequent \"Krazy Kat\" cartoons the title character resumed his generic, Mickey Mouse-like antics. Perhaps that was inevitable. George Herriman's style was unique, and so unusual it would be practically impossible to translate to the world of animation, rather like trying to capture lightning in a bottle. Lil' Ainjil is a valiant attempt to do so, and a respectable one. But if you want the real Krazy Kat, the place to look is on the page, not on the screen.",
    "Director": "Manny Gould, Ben Harrison",
    "Writer": "Ben Harrison, George Herriman",
    "Actors": "William Costello, Danny Webb",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0149885",
      "title": "The Bird Stuffer",
      "year": 1936,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150828",
      "title": "A Happy Family",
      "year": 1935,
      "imdbRating": "5.1",
      "imdbVotes": "20",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149884",
      "title": "Bird Man",
      "year": 1935,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151182",
      "title": "Kannibal Kapers",
      "year": 1935,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151220",
      "title": "King's Jester",
      "year": 1935,
      "imdbRating": "5.7",
      "imdbVotes": "8",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152329",
      "title": "Scrappy's Ghost Story",
      "year": 1935,
      "imdbRating": "5.9",
      "imdbVotes": "33",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150968",
      "title": "The Hot Cha Melody",
      "year": 1935,
      "imdbRating": "4.9",
      "imdbVotes": "29",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151925",
      "title": "The Peace Conference",
      "year": 1935,
      "imdbRating": "4.9",
      "imdbVotes": "18",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150761",
      "title": "Goofy Gondolas",
      "year": 1934,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149737",
      "title": "The Autograph Hunter",
      "year": 1934,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149684",
      "title": "Antique Antics",
      "year": 1933,
      "imdbRating": "6.6",
      "imdbVotes": "10",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149988",
      "title": "Bunnies and Bonnets",
      "year": 1933,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T06:58:03.658Z"
}