{
  "imdbId": "tt0134289",
  "title": "Anything for a Thrill",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AnythingForAThrill",
      "id": "AnythingForAThrill",
      "title": "Anything for a Thrill",
      "description": "The low-budget adventures of newsreel cameramen costarring Frankie Darro and Kane Richmond. Be prepared for a nonsensical plot with attempts at juvenile humor and direction to match. Nevertheless it's worth a look if you're in the mood for silly fun. Directed by Leslie Goodwins (as Les Goodwins). Released in 1937. 4 minutes are missing. PRODUCTION NOTE: Conn Pictures Corporation was a poverty row Producer/distributor active between 1934 and 1938, during which they cranked out 39 feature films, most of them B-westerns",
      "fileSize": 830110630,
      "addedAt": "2026-01-07T00:06:09.635Z",
      "thumbnail": "https://archive.org/services/img/AnythingForAThrill",
      "collection": "feature_films",
      "downloads": 4937
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "62 min",
    "imdbRating": 6.1,
    "imdbVotes": 41,
    "Genre": "Drama",
    "Plot": "Don Mallory is the younger brother of ace newsreel photographer Cliff Mallory, and is continually urging Cliff to let him become a cameraman rather than going to college. Cliff refuses. He is assigned to get some newsreel footage of heiress Betty Kelley, who has never been shot. She arrives at the airport accompanied by a phony Earl, to whom she is reportedly engaged, eludes the cameraman by dressing as the pilot and drives off before Cliff discovers the deception. She also destroys the film he shoots of her by sneaking into the Kelley's heavily-guarded estate. Don, with the help of his girl friend, Jean Roberts, fares better and while Jean attracts the attention of the guards, Don sneaks into the estate and makes off with the film, arriving back at the newsreel office in time to pass it off as Cliff's. When the film is released, Betty threatens a libel suit and finally buys the newsreel company as a compromise. She assigns Cliff to cover a baby parade. Meanwhile, the \"Earl\" finds himself in a dilemma. Instead of extracting money from the family, he is approached by Betty's father on a huge stock deal and, since the Earl is allegedly wealthy, he finds himself on the spot when Mr. Kelley marks him down for a $25,000 investment. His method of raising the money is to arrange for his confederates to rob a bank and he will go along as the gang leader. Don is in the vicinity and manages to film the robbery, and then eludes the gang. As the film is being ran in the projection room, disclosing the Earl as the robbery leader, the Earl and his henchmen arrive. A fast and furious battle ensues between the newsreel men and the gangsters, but Don and Cliff subdue them just as the police arrive. Cliff decides that Don's true calling is as a newsreel photographer. Fade to relief.",
    "Director": "Leslie Goodwins",
    "Writer": "Peter B. Kyne, Joseph O'Donnell, Stanley Lowenstein",
    "Actors": "Frankie Darro, Kane Richmond, June Johnson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029810",
    "tt0027517",
    "tt0030025",
    "tt0030648",
    "tt0029787",
    "tt0034000",
    "tt0037098",
    "tt0027366",
    "tt0329531",
    "tt0031119",
    "tt0026700",
    "tt0026867"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.635Z"
}