{
  "imdbId": "tt0146719",
  "title": "The Family Shoe",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-family-shoe-1931",
      "title": "The Family Shoe (1931)",
      "description": "This is about the little old lady who lived in a shoe and had so many kids she's didn't know what to do....or something like that. One day, one of her kids - Jack - says \"I know what to do,\" and takes off with a sack of beans. Well, to make a long story short, we wind up seeing \"Jack And The Beanstalk\" and mom winds up a rich woman in the end. The show goes from a beat-old boot to a glittery high heel shoe! Watch on RetroFlix:  https://retroflix.org/the-family-shoe-1931/",
      "id": "the-family-shoe-1931"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "5.1",
    "imdbVotes": "31",
    "Genre": "Animation, Short",
    "Plot": "Van Beuren cartoons are extremely variable, especially in the number of gags and whether the absurdist humour shines through enough (sometimes it does, other times it doesn't), but are strangely interesting. Although they are often poorly animated with barely existent stories and less than compelling lead characters, they are also often outstandingly scored, there can be some fun support characters and some are well-timed and amusing.'The Family Shoe' is a watchable cartoon of theirs, after seeing a lot of average and less 1930=1931 efforts from the Aesop's Fables/Van Beuren series with a few exceptions it was good for this and particularly 'Making Em Move' to be much better than expected. Is it great? No, even the best Van Beuren cartoons have yet from me to receive above an 8. Does it avoid the potential traps that it faced considering the kind of cartoon it was? On the most part yes.It was a danger for 'The Family Shoe', as a cartoon that took on two fairy-tales instead of one to be disjointed. 'The Family Shoe' is not that, the two stories are executed so that they become one and like 'Jack and the Beanstalk' was part of 'There Was an Old Woman Who Lived in a Shoe'. It is also not a case of two halves where one half takes one tone and the other another polar opposite one, other Van Beuren cartoons to try and do two stories in one have fallen into that trap.Unlike many Van Beuren cartoons, there actually feels like a story, one that is organised rather than random and is actually cohesive and tries to make some kind of sense. 'The Family Shoe' has some charm and the characters are more memorable, engaging and likeable than most cartoons from the studio, one feels sorry for the Old Woman and understands why she feels the way she does. The ending agreed is a good one..Best of all is the music score which agreed has always been an essential part of a Van Beuren cartoon and the one asset that is consistently outstanding and what stops the worst efforts from being worse. It is typically peppy and great fun to listen to. It is so beautifully and cleverly orchestrated and full of lively energy, doing so well with enhancing the action.However there are drawbacks. As to be expected, seeing as it is nearly always the case (with a few exceptions) even in their best efforts with Aesop's Fables/Van Beuren, the animation is less than great, most of the time with erratically sloppy character designs in particular while the simplistic background detail and lack of fluidity and crispness are just as difficult to ignore. Gags are too few and the execution of those present feel too bland, no absurdity or surrealism here, and cutesy, too much so to find it amusing. Synchronisation tends to be sloppy and the pace is not always lively, the beginning feels like set up and not much else.Overall, watchable and executes potential pitfalls far better than expected, if bland, too low on laughs and poorly animated. 5/10 Bethany Cox",
    "Director": "Mannie Davis, John Foster",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0147620",
      "title": "A Toytown Tale",
      "year": 1931,
      "imdbRating": "4.8",
      "imdbVotes": "66",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146582",
      "title": "Cowboy Cabaret",
      "year": 1931,
      "imdbRating": "4.3",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147274",
      "title": "A Romeo Robin",
      "year": 1930,
      "imdbRating": "4.9",
      "imdbVotes": "47",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0161433",
      "title": "Chinese Jinks",
      "year": 1932,
      "imdbRating": "4.5",
      "imdbVotes": "27",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146845",
      "title": "Gypped in Egypt",
      "year": 1930,
      "imdbRating": "6.0",
      "imdbVotes": "59",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0161750",
      "title": "Laundry Blues",
      "year": 1930,
      "imdbRating": "4.1",
      "imdbVotes": "52",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0161805",
      "title": "Midnight",
      "year": 1930,
      "imdbRating": "5.2",
      "imdbVotes": "28",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147096",
      "title": "Noah Knew His Ark",
      "year": 1930,
      "imdbRating": "4.9",
      "imdbVotes": "43",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147506",
      "title": "Singing Saps",
      "year": 1930,
      "imdbRating": "4.2",
      "imdbVotes": "34",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147534",
      "title": "Spring Antics",
      "year": 1932,
      "imdbRating": "4.6",
      "imdbVotes": "18",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021722",
      "title": "The Cat's Canary",
      "year": 1932,
      "imdbRating": "5.7",
      "imdbVotes": "68",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147017",
      "title": "Love's Labor Won",
      "year": 1933,
      "imdbRating": "4.4",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:57.686Z"
}