{
  "imdbId": "tt0152262",
  "title": "Sadie Hawkins Day",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sadie-hawkins-day-1944",
      "id": "sadie-hawkins-day-1944",
      "title": "Sadie Hawkins Day (1944)",
      "description": "It is approaching mid-November in Dogpatch and this his bad news for all the bachelors, including Li'l Abner, as \"Sadie Hawkins Day\" is nearing. That is the day that all the bachelors in Dogpatch have to run in the race in which all the unmarried homely gals---which is all of them except Daisy Mae Scragg and Moonbeam McSwine--and old maids and grass widows then chase the bachelors and can marry the one they catch before sundown. Confirmed-bachelor Li'l Abner, as always, is the prime-target as the prize catch and Daisy Mae, as always, has a new plan that will ensure she catches him. Watch on RetroFlix:  https://retroflix.org/sadie-hawkins-day-1944/",
      "fileSize": 98514563,
      "addedAt": "2026-01-07T00:10:40.951Z",
      "thumbnail": "https://archive.org/services/img/sadie-hawkins-day-1944",
      "language": "eng",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 126
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 5.8,
    "imdbVotes": 47,
    "Genre": "Animation, Short",
    "Plot": "It is approaching mid-November in Dogpatch and this his bad news for all the bachelors, including Li'l Abner, as \"Sadie Hawkins Day\" is nearing. That is the day that all the bachelors in Dogpatch have to run in the race in which all the unmarried homely gals---which is all of them except Daisy Mae Scragg and Moonbeam McSwine--and old maids and grass widows then chase the bachelors and can marry the one they catch before sundown. Confirmed-bachelor Li'l Abner, as always, is the prime-target as the prize catch and Daisy Mae, as always, has a new plan that will ensure she catches him.",
    "Director": "Bob Wickersham",
    "Writer": "Alec Geiss, Al Capp",
    "Actors": "Frank Graham, Lurene Tuttle",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0152040",
    "tt0147875",
    "tt0162226",
    "tt0148502",
    "tt0148088",
    "tt0148100",
    "tt0147804",
    "tt0148133",
    "tt0148387",
    "tt0148602",
    "tt0148623",
    "tt0147277"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.951Z"
}