{
  "imdbId": "tt0177707",
  "title": "Dickson Experimental Sound Film",
  "year": 1894,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dicksonfilmtwo",
      "id": "dicksonfilmtwo",
      "title": "Dickson Experimental Sound Film",
      "description": "This short film was a test for Edison's \"Kinetophone\" project, the first attempt in history to record sound and moving image in synchronization. This was an experiment by William Dickson to put sound and film together either in 1894 or 1895. Unfortunately, this experiment failed because they didn't understand synchronization of sound and film. The large cone on the left hand side of the frame is the \"microphone\" for the wax cylinder recorder (off-camera). The Library of Congress had the film. The wax cylinder soundtrack, however, was believed lost for many years. Tantalizingly, a broken cylinder labeled \"Violin by WKL Dickson with Kineto\" was catalogued in the 1964 inventory at the Edison National Historic Site. In 1998, Patrick Loughney, curator of Film and Television at the Library of Congress, retrieved the cylinder and had it repaired and re-recorded at the Rodgers and Hammerstein Archive of Recorded Sound, Lincoln Center, New York. Since the Library did not possess the necessary synchronizing technology, Loughney - at the suggestion of producer Rick Schmidlin - sent multi-Oscar winner Walter Murch a videotape of the 17 seconds of film and an audiocassette of 3 minutes and 20 seconds of sound with a request to marry the two. By digitizing the media and using digital editing software, Murch was able to synchronize them and complete the failed experiment 105 years later. This 35mm film was generously made available to the Internet Archive by Walter Murch and Sean Cullen.",
      "fileSize": 155820441,
      "addedAt": "2026-01-07T00:08:07.355Z",
      "thumbnail": "https://archive.org/services/img/dicksonfilmtwo",
      "collection": "feature_films",
      "downloads": 30640
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "1 min",
    "imdbRating": 6.7,
    "imdbVotes": 2516,
    "Genre": "Short, Music",
    "Plot": "The earliest extant sound film. William K.L. Dickson stands in the background next to a huge sound pickup horn connected to a Thomas Edison phonograph recorder. As he plays a violin, two men dance in the foreground. This film was made to demonstrate a new Thomas Edison machine, the Kinetophone. These machines were Kinetoscope peepshow viewers mated with Thomas Edison wax cylinder phonographs. But the Kinetophone never caught on and this film was never released. The film still exists, but the phonograph soundtrack has been lost.",
    "Director": "William K.L. Dickson",
    "Writer": "N/A",
    "Actors": "William K.L. Dickson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0000001",
    "tt0279784",
    "tt13576174",
    "tt0135630",
    "tt0326158",
    "tt0037792",
    "tt1503085",
    "tt0017268",
    "tt0017896",
    "tt1706294",
    "tt1698474",
    "tt8312534"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.355Z"
}