{
  "imdbId": "tt0150632",
  "title": "Frankenstein's Cat",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/frankensteins-cat-1942",
      "title": "Frankensteins Cat",
      "description": "In this one, a community of mice and birds are living and playing peacefully until the arrival of the title character: a mechanical cat who wants to eat so he picks a bird to take to his castle. Watch on RetroFlix:  https://retroflix.org/frankensteins-cat-1942/",
      "id": "frankensteins-cat-1942"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "6.7",
    "imdbVotes": "84",
    "Genre": "Animation, Short",
    "Plot": "The quality of the Terrytoons cartoons is inconsistent. The music is always one of the best assets, while the animation became a strength over-time. Meanwhile, being hit and miss in the characterisation and content. My main reason for seeing them was for completest sake, to see as many of their overall output as possible. Another reason was for being interested in seeing older cartoons from lower-budget and comparitively lesser known studios.1942 saw all of the above, cartoons being better than others, the music and animation being merits and characterisation and content being hit and miss. This was not unexpected, given that from 1929 onwards hit and miss has been the general standard for Terrytoons, but some years fared worse than others. 1942 was actually somewhat one of the better years, a few bad and mediocre cartoons but most ranged from average to decent while none being great. The second cartoon to feature Super Mouse, 'Frankenstein's Cat' for me is in the better half of the 1942 cartoons and of Terrytoons' output overall, also one of the more interesting along with Super Mouse's debut 'The Mouse of Tomorrow'.As said, 'Frankenstein's Cat' saw Super Mouse's second appearance. He was later re-named Mighty Mouse after seven cartoons and went on to become Terrytoons' most prolific lead character up until 'Cat Alarm' in 1961. Was not a fan of all his cartoons and Mighty Mouse has never been one of my favourite characters in animation, but as far as Terrytoons go even the weakest cartoons when the series became increasingly repetitive were quite a bit better than when the studio was at its worst, if that makes sense.Like 'The Mouse of Tomorrow', 'Frankenstein's Cat' is a pretty slight and predictable cartoon in terms of the story. How things are resolved are foreseeable quite early on and some of it is a touch corny.It was not easy to tell what my overall stance on Mighty/Super Mouse was, and certainly at this stage. He tended to be a cute and likeable character although fairly limited at the same time for a lead and his cartoons did tend to be quite formulaic and at times repetitive, especially early on.However, 'Frankenstein's Cat' is well animated. Which was not a surprise as this aspect had come on enormously by this point with Terrytoons. It is nicely detailed, lively and colourful without being garish. Again, the music, the thing that was the most consistently good thing from the very beginning with Terrytoons, is a big strength. It is beautifully and cleverly orchestrated and arranged, is terrific fun to listen to and the lively energy is present throughout, doing so well with adding to the action.While never what one calls hilarious, there are plenty of humorous and atmospheric touches, the cat's reflection indeed is a standout. As well as a lot of energy, lively action and an unforced charm throughout. The supporting character before Super Mouse appears are cute and not too bland, but the best character easily is the titular character, the most interesting, the most amusing and the one with the most personality.On the whole, not a great cartoon but definitely worth a look. 7/10",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Isadore Klein, Donald McKee",
    "Actors": "Gus Wicke",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0034448",
      "title": "All Out for 'V'",
      "year": 1942,
      "imdbRating": "5.2",
      "imdbVotes": "128",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150062",
      "title": "Cat Meets Mouse",
      "year": 1942,
      "imdbRating": "4.8",
      "imdbVotes": "15",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151525",
      "title": "Eat Me Kitty, Eight to the Bar",
      "year": 1942,
      "imdbRating": "4.1",
      "imdbVotes": "20",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149863",
      "title": "The Big Build-Up",
      "year": 1942,
      "imdbRating": "4.6",
      "imdbVotes": "10",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149798",
      "title": "Barnyard Blackout",
      "year": 1943,
      "imdbRating": "4.3",
      "imdbVotes": "17",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149959",
      "title": "Bringing Home the Bacon",
      "year": 1941,
      "imdbRating": "5.2",
      "imdbVotes": "14",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150598",
      "title": "Flying Fever",
      "year": 1941,
      "imdbRating": "4.8",
      "imdbVotes": "17",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151197",
      "title": "Keep 'Em Growing",
      "year": 1943,
      "imdbRating": "4.5",
      "imdbVotes": "16",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148998",
      "title": "Somewhere in Egypt",
      "year": 1943,
      "imdbRating": "5.6",
      "imdbVotes": "23",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152673",
      "title": "Super Mouse Rides Again",
      "year": 1943,
      "imdbRating": "6.4",
      "imdbVotes": "61",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149887",
      "title": "The Bird Tower",
      "year": 1941,
      "imdbRating": "5.4",
      "imdbVotes": "19",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148300",
      "title": "The Home Guard",
      "year": 1941,
      "imdbRating": "6.5",
      "imdbVotes": "21",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T06:14:38.148Z"
}