{
  "movieId": "tt0149801",
  "title": "Barnyard Waac",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/barnyard-waac-1942",
      "id": "barnyard-waac-1942",
      "title": "Barnyard WAAC (1942)",
      "description": "A Rooster finds that none of the housework, cooking or chick-minding is going on when the hens join the WAACs. Throwing themselves into a first-aid course, they manage to tie up the Rooster with bandages and nearly run him down with a jeep. Watch on RetroFlix: ",
      "fileSize": 39143450,
      "addedAt": "2026-01-07T00:07:31.713Z",
      "thumbnail": "https://archive.org/services/img/barnyard-waac-1942",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 39
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 5.6,
    "imdbVotes": 5,
    "Genre": "Animation, Short",
    "Plot": "A First Aid class takes place and Hank the Rooster gets bandaged up when a female chicken in a WAAC uniform arrives. All the chickens want to join her. They're given cards saying: \"Join The Women's Army Auxiliary Corps\" and they run to the barracks for military training. When Hank comes home and finds that all the chickens - including his 4 wives - disappeared, he's shocked. After reading the letter his 4 wives left him about joining the WAAC and to take care of the chicks, he is furious. He sees everyone in WAAC uniforms and tries to tell them to come back, but to no avail. When all the chicks hatch at the same time and try to sit under his behind, Hank ends up flying in the air. Thankfully, when cats arrive, he protects his chicks. The cats \"kidnap\" Hank and the chicks, and the WAAC soldiers arrive in vehicles with machine guns. They stop the cats, and after they swim, they find their tails are gone. The soldiers have the cats' tails tied to their vehicles and Hank congratulates and thanks them. An ambulance arrives and Hank is places in it and when it leaves, Hank falls out covered in bandages, and his chicks surround him.",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster",
    "Actors": "N/A",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0152301",
    "tt0152601",
    "tt0150362",
    "tt0149765",
    "tt0146905",
    "tt0151020",
    "tt0152406",
    "tt0153345",
    "tt0153985",
    "tt0150279",
    "tt0149726",
    "tt0159281"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:31.713Z"
}