{
  "movieId": "tt0148922",
  "title": "Slay It with Flowers",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/slay-it-with-flowers-1943",
      "id": "slay-it-with-flowers-1943",
      "title": "Slay It with Flowers (1943)",
      "description": "The Fox arrives at his penthouse apartment with an assortment of seeds and vegetables to plant in his garden. Naturally, the crow notices his haul and immediately tries to steal some for himself. The fox discovers the crow and evicts him by replacing the seeds with hot peppers. The crow returns to encounter a Hitler-esque scarecrow planted by the fox but the crow dresses as Stalin to frighten the scarecrow away! The fox puts salt on the crow's tail and throws him from the building but the crow discovers salt has no effect on a bird's ability to fly and returns to the penthouse to tussle with the fox some more. Finally, the fox reveals he is using the seeds to plant a victory garden at which point the patriotic crow finally promises to leave the fox alone and the two shake hands (with a joy buzzer). Watch on RetroFlix:  https://retroflix.org/slay-it-with-flowers-1943/",
      "fileSize": 198938819,
      "addedAt": "2026-01-07T00:11:24.929Z",
      "thumbnail": "https://archive.org/services/img/slay-it-with-flowers-1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 145
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 5.4,
    "imdbVotes": 36,
    "Genre": "Animation, Short, Comedy",
    "Plot": "The Fox arrives at his penthouse apartment with an assortment of seeds and vegetables to plant in his garden. Naturally, the crow notices his haul and immediately tries to steal some for himself. The fox discovers the crow and evicts him by replacing the seeds with hot peppers. The crow returns to encounter a Hitler-esque scarecrow planted by the fox but the crow dresses as Stalin to frighten the scarecrow away! The fox puts salt on the crow's tail and throws him from the building but the crow discovers salt has no effect on a bird's ability to fly and returns to the penthouse to tussle with the fox some more. Finally, the fox reveals he is using the seeds to plant a victory garden at which point the patriotic crow finally promises to leave the fox alone and the two shake hands (with a joy buzzer).",
    "Director": "Bob Wickersham",
    "Writer": "Leo Salkin",
    "Actors": "Pinto Colvig, Frank Graham, Kent Rogers",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0147804",
    "tt0148623",
    "tt0147277",
    "tt0149348",
    "tt0147875",
    "tt0148502",
    "tt0152040",
    "tt0148088",
    "tt0148100",
    "tt0148387",
    "tt0148602",
    "tt0148181"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.929Z"
}