{
  "imdbId": "tt0180301",
  "title": "The Weekend",
  "year": 1999,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-weekend-1999",
      "title": "The Weekend (1999) - Brian Skeet Film",
      "description": "Peter Cameron is an American novelist and short-story writer. He published his first short story for The New Yorker in 1983 & would later contribute to the magazine for many years. His first book, One Way or Another , is a short story compilation that was published in 1986. His debut novel, Leap Year , was published at the start of the 1990s. His follow-up, The Weekend , was published in 1994 & received much acclaim, so much so that it was adapted into a film directed by Brian Skeet. Brian Skeet is an English director who started out working for the BBC, directing multiple episodes in the documentary series Omnibus . He collaborated with Simon Curtis & Peter Sellars on directing various theater productions:   Performance , starring John Malkovich & The Merchant of Venice , starring Philip Seymour Hoffman After leaving the BBC, he made his first short, The Boy Who Fell In Love . He would later make his first feature, The Misadventures of Margaret , a musical comedy starring Parker Posey, which was featured at the Sundance Film Festival. The Weekend would be his follow-up film, and he managed to assemble quite a cast: Gena Rowlands, Brooke Shields, Deborah Kara Unger, Jared Harris, D.B. Sweeney & James Duval. The film was at the festival circuit in 1999, & managed to win an award at the Seattle International Film Festival for Best Ensemble Cast. The film was released on November 22, 2000, in LA & New York. Over the years, the film has languished in obscurity, with its only cultural relevance being its appearance in an episode of Ebert & Roeper's At the Movies. It's an interesting watch, primarily because of its cast. Gena Rowlands & Brooke Shields have a passive-aggressive mother-daughter relationship, which is interesting to observe. Deborah Kara Unger is solid as the primary female character where all the backstories and drama transpire, & James Duval is surprisingly good here, bringing the gay ingenue from the Araki films and applying it in a standard drama like this. My favorite parts are where he interacts with Gena Rowlands; they have a tender relationship throughout the film, which is very sweet by the end. James Duval commented on the film in 2022, stating that the cast all lived in a bed and breakfast for 3 months. He was paired with Rowlands, Shields, and Sweeney to live in one house, while the other cast members lived in another home. He stated that Gena Rowlands was his favorite person he had ever worked with, not only because he was a big fan of her work, but also gracious to him & helped him through a bad breakup at the time. Other interesting factoids: -The production company behind the film is Granada Film Productions ( Ghost World , The Queen , etc ). -Strand Releasing is the distributor of the film, responsible for distributing a lot of Gregg Araki's films. -Brooke Shields's second collaboration with Brian Skeet, the first one being on The Misadventures of Margaret . -This is James Duval's fifth time playing a gay character (The other times were in Araki's Teen Apocalypse Trilogy & A River Made to Drown In ). -The dinner scene was done around four to five 12-hour days. -The cast all split a 20-year-old bottle of whiskey at the wrap party. The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org, are for educational purposes. I have uploaded each movie for posterity, with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws.",
      "id": "the-weekend-1999"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "97 min",
    "imdbRating": "6.3",
    "imdbVotes": "325",
    "Genre": "Drama",
    "Plot": "Marian (Deborah Kara Unger) and John Kerr (Jared Harris) are expecting an old friend, Lyle (David Conrad) for a weekend visit to their beautiful upstate New York home. Emotions run high since it is the one-year anniversary of the death of John's brother, the handsome and charismatic Tony (D.B. Sweeney), who had also been Lyle's lover. Marian, who is still inconsolable after losing Tony to AIDS, is upset when Lyle brings his new boyfriend, a young artist, Robert (James Duval). Meanwhile, the situation is just as tense at the Kerrs' neighbors' house, where oft-widowed, free spirit Laura Ponti (Gena Rowlands) gets a surprise visit from her resentful, angry daughter, Nina (Brooke Shields), and her married lover, Thierry (Gary Dourdan). Matters worsen when the battling mother-daughter duo joins the Kerr household for a dinner party, where the pain-riddled diners engage in a messy emotional showdown.",
    "Director": "Brian Skeet",
    "Writer": "Peter Cameron, Brian Skeet",
    "Actors": "Gena Rowlands, Deborah Kara Unger, Brooke Shields",
    "Language": "English",
    "Country": "United Kingdom, United States",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0191821",
      "title": "The White Suit",
      "year": 1999,
      "imdbRating": "5.8",
      "imdbVotes": "1,028",
      "language": "Serbian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0161023",
      "title": "Tumbleweeds",
      "year": 1999,
      "imdbRating": "6.7",
      "imdbVotes": "3,703",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0169989",
      "title": "Hard Time: Hostage Hotel",
      "year": 1999,
      "imdbRating": "5.0",
      "imdbVotes": "496",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0179182",
      "title": "Forever Mine",
      "year": 1999,
      "imdbRating": "5.3",
      "imdbVotes": "2,801",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0150992",
      "title": "Straight from the Heart",
      "year": 1999,
      "imdbRating": "7.4",
      "imdbVotes": "20,475",
      "language": "Hindi",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0155722",
      "title": "Gloomy Sunday",
      "year": 1999,
      "imdbRating": "7.8",
      "imdbVotes": "8,525",
      "language": "German, English, Hungarian",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0229625",
      "title": "One More Kiss",
      "year": 1999,
      "imdbRating": "5.8",
      "imdbVotes": "774",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0164085",
      "title": "Limbo",
      "year": 1999,
      "imdbRating": "7.0",
      "imdbVotes": "6,522",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0151281",
      "title": "Ladies Room",
      "year": 1999,
      "imdbRating": "4.6",
      "imdbVotes": "630",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0222368",
      "title": "The Nameless",
      "year": 1999,
      "imdbRating": "5.8",
      "imdbVotes": "7,918",
      "language": "Spanish",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0184503",
      "title": "Gamera 3: Revenge of Iris",
      "year": 1999,
      "imdbRating": "7.1",
      "imdbVotes": "3,402",
      "language": "Japanese",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0161010",
      "title": "The Trench",
      "year": 1999,
      "imdbRating": "5.9",
      "imdbVotes": "4,304",
      "language": "English, German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:12:33.206Z"
}