{
  "imdbId": "tt0196063",
  "title": "O Saci",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/o-saci-1953",
      "id": "o-saci-1953",
      "title": "O Saci (1953)",
      "description": "O Saci : O filme mostra as aventuras de Narizinho e Emília no Sítio do Picapau Amarelo, junto de Pedrinho que quer capturar um Saci em uma garrafa, seguindo as instruções do Tio Barnabé . O Saci depois de capturado e solto novamente, irá ajudar Pedrinho a desfazer uma bruxaria que a Cuca jogou em Narizinho, transformando-a em pedra. No Sítio vivem ainda Dona Benta e Tia Nastácia , que cuidam das crianças e se divertem com suas reinações. As legendas foram retiradas do OpenSubtitles. O Saci: At the peaceful Sítio do Picapau Amarelo (Yellow Woodpecker Ranch), two kids, Pedrinho and Lúcia (Narizinho), and Lúcia's talkative and rough doll Emília , attempt to capture the Saci , advised by the wise Uncle Barnabé. After Lúcia is cursed by the demonic, reptilian witch Cuca , the brave and bold Pedrinho starts a journey through the forest with the Saci, in order to make the evil hag bring the girl back.",
      "fileSize": 188270760,
      "addedAt": "2026-01-07T00:10:02.900Z",
      "thumbnail": "https://archive.org/services/img/o-saci-1953",
      "language": "por",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 5798
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "65 min",
    "imdbRating": 7,
    "imdbVotes": 82,
    "Genre": "Adventure, Family",
    "Plot": "Two kids and a living, talkative doll attempt to catch a mulatto boy-like, supernatural one legged figure known as the Saci-Pererê, that enjoys playing pranks to the farms.",
    "Director": "Rodolfo Nanni",
    "Writer": "Monteiro Lobato, Rodolfo Nanni, Arthur Neves",
    "Actors": "Otávio Araújo, Aristéia Paula de Souza, Raimundo Duprat",
    "Language": "Portuguese",
    "Country": "Brazil",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0046672",
    "tt0044355",
    "tt0045553",
    "tt0045655",
    "tt0047590",
    "tt0046316",
    "tt3776510",
    "tt0046965",
    "tt0044104",
    "tt0247746",
    "tt0043067",
    "tt0048960"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.900Z"
}