{
  "movieId": "tt0152941",
  "title": "Technoracket",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/technoracket-1933",
      "id": "technoracket-1933",
      "title": "Technoracket (1933)",
      "description": "Scrappy runs a farm where Oopie is a farmhand. He sees a front-page newspaper article about \"Technocracy,\" and he decides to fire everybody. Scrappy then builds mechanical robot farm workers and livestock with predictably disastrous results. Watch on RetroFlix:  https://retroflix.org/technoracket-1933/",
      "fileSize": 480528343,
      "addedAt": "2026-01-07T00:11:46.528Z",
      "thumbnail": "https://archive.org/services/img/technoracket-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 141
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.1,
    "imdbVotes": 9,
    "Genre": "Animation, Short",
    "Plot": "Scrappy has all the animals and Oopie working hard on his farm. However, he reads in the paper that the future holds mechanical farm implements, so he fires everyone and replaces them with robots in this excellent cartoon from the series.Many of the Scrappy cartoons have a great start -- and so does this one, with a rooster crowing the sun over the horizon -- but tend to sag in the second half. That doesn't happen here! Instead the second half is studded with great gags that offer a childish view of how farming and manufacturing works and how it can go horribly wrong.Many series tried to paint portraits of children and their world-views. Only the silent OUR GANG series under Robert McGowan did so consistently. Dick Huemer's Scrappy did so occasionally. This is one of its real successes.",
    "Director": "Dick Huemer, Sid Marcus",
    "Writer": "Sid Marcus",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150932",
    "tt0151652",
    "tt0152280",
    "tt0151506",
    "tt0153937",
    "tt0146629",
    "tt0150804",
    "tt0149684",
    "tt0146464",
    "tt0149817",
    "tt0161331",
    "tt0149988"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.528Z"
}