{
  "imdbId": "tt0157894",
  "title": "The Killing of America",
  "year": 1981,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-killing.of.-america.-1981.1080p.-blu-ray.-h-264.-aac-rarbg",
      "id": "the.-killing.of.-america.-1981.1080p.-blu-ray.-h-264.-aac-rarbg",
      "title": "The Killing Of America(1981)",
      "description": "IMPORTANT BACKGROUND NOTE: ACCORDING TO IMDB,  THIS FILM WAS NEVER DISTRIBUTED, TELEVISED, OR MADE AVAILABLE FOR SALE IN THE USA UNTIL 10/26/2016.  THIS IS A CO PRODUCTION BETWEEN THE U.S.A. AND JAPAN IMPORTANT CONTEXT FOR THE FILM: THIS DOCUMENTARY FEATURES REAL FOOTAGE OF RACE RIOTS, REAL ARCHIVAL FOOTAGE FEATURING SERIAL KILLERS, AND REAL CRIMES! WARNING: DISTURBING CONTENT AND DISTURBING THEMES!  REAL LIFE FOOTAGE OF RACE RIOTS, CRIMES AND MURDERS ARE DEPICTED IN THE FILM! VIEWER DISCRETION IS STRONGLY ADVISED! ADULTS ONLY! 18+ PLOT:   In 1982, filmmakers  Seldon Renan  and Academy Award® nominee  Leonard Schrader (KISS OF THE SPIDER WOMAN, MISHIMA, BLUE COLLAR)  created a graphic and provocative examination of America's history with and penchant for senseless violence, mass shootings and cold-blooded murder. It was condemned as exploitive and obscene (The New York Times), acclaimed as among the most controversial documentaries in the history of cinema (Fantasia Festival), and never distributed, televised or made available for sale in the United States.",
      "fileSize": 3899722447,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-killing.of.-america.-1981.1080p.-blu-ray.-h-264.-aac-rarbg",
      "language": "eng",
      "year": 1981,
      "collection": "feature_films",
      "downloads": 27286
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "90 min",
    "imdbRating": 7.5,
    "imdbVotes": 2716,
    "Genre": "Documentary, Crime",
    "Plot": "Composed of archival material and exclusive footage, Sheldon Renan and Leonard Schrader's shocking and eye-opening documentary of carnage, madness, and mayhem focuses, with an unapologetic sincerity, on the factual depiction of violence in the industrialised nation of the United States. Featuring a juxtaposition of detailed accounts of terrible acts, brutal behaviour, and interviews from experts and convicted serial killers alike, this grim collection of pain doesn't shy away from real-life, in-your-face, horrifying imagery, and the escalating levels of crime and murder in the United States. The Killing of America also documents two shocking murders: the assassination of John F. Kennedy, which marks the beginning of a new era of violence, and the murder of John Lennon on the evening of December 8, 1980.",
    "Director": "Sheldon Renan",
    "Writer": "Leonard Schrader, Chieko Schrader",
    "Actors": "Chuck Riley, Ed Dorris, Thomas Noguchi",
    "Language": "English",
    "Country": "Japan, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt6323518",
    "tt1935826",
    "tt14825238",
    "tt13649700",
    "tt0949880",
    "tt32308418",
    "tt14552076",
    "tt14583726",
    "tt0082516",
    "tt0323649",
    "tt0082332",
    "tt0230904"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}