{
  "movieId": "tt0148692",
  "title": "Safar",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Beizai_karnamehsafar",
      "id": "Beizai_karnamehsafar",
      "title": "Beizai_Karnameh (Safar)",
      "description": "Beizai_Karnameh (Safar)",
      "fileSize": 31231589,
      "addedAt": "2026-01-07T00:06:14.038Z",
      "thumbnail": "https://archive.org/services/img/Beizai_karnamehsafar",
      "collection": "feature_films",
      "downloads": 150
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "137 min",
    "imdbRating": 7.2,
    "imdbVotes": 451,
    "Genre": "Drama, Romance",
    "Plot": "Neela and Avinash are medical students, and are attracted to each other. But Avinash is poor and wants Neela to live a comfortable life. When Neela, who tutors Monto Kappor, meets his elder businessman brother, Shekhar, he instantly falls in love with her. He goes to propose marriage with her and meets her brother, Kalidas, but is told that he should instead meet with Avinash. So Shekhar introduces himself to Avinash, tells him of his intentions, and Avinash instantly approves of him, and subsequently Shekhar and Neela are married. Both are concerned that Avinash did not attend the marriage. After a harmonious honeymoon, both return to their lives, and Shekhar would like Neela to continue with her medical studies. It is then he finds that Neela has been meeting on the sly with Avinash, and asks Monto to follow her everywhere and report to him, which he does. After considering all the facts, Shekhar comes to the conclusion that Neela is in love with Avinash and confronts her, they quarrel, he drinks his medicine, and passes out. The next day the police arrest Neela on the charge of murder. With Avinash nowhere to be found, Neela has now to face life behind bars - or even the death sentence.",
    "Director": "Asit Sen",
    "Writer": "Anil Ahuja, Inder Raj Anand, Ashutosh Mukherjee",
    "Actors": "Rajesh Khanna, Sharmila Tagore, Feroz Khan",
    "Language": "Hindi",
    "Country": "India",
    "Awards": "2 wins & 2 nominations"
  },
  "relatedMovies": [
    "tt0194709",
    "tt0168822",
    "tt0064268",
    "tt0188586",
    "tt0334192",
    "tt0189091",
    "tt0064397",
    "tt0063518",
    "tt0348451",
    "tt0357962",
    "tt0068278",
    "tt3311950"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.038Z"
}