{
  "movieId": "tt0188011",
  "title": "Los jóvenes viejos",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/los-jovenes-viejos-1962",
      "id": "los-jovenes-viejos-1962",
      "title": "Los Jovenes Viejos(1962)",
      "description": "Los jóvenes viejos   es una película de Argentina en blanco y negro dirigida por Rodolfo Kuhn y protagonizada por María Vaner y Alberto Argibay . Fue estrenada en Buenos Aires el 5 de junio de 1962 y resultó ganadora del Cóndor de Plata como mejor película de 1963. Gran parte de la película se filmó en la ciudad de Mar del Plata , con escenas de exteriores en Playa Grande, la Barranca de los Lobos,etc.                         En una encuesta de las 100 mejores películas del cine argentino llevada a cabo por el Museo del Cine Pablo Ducrós Hicken en el año 2000, la película alcanzó el puesto 38         (Wikipedia) Tematica y contexto Los jóvenes viejos   es una película precursora de lo que en esa década habría de llamarse \"el nuevo cine Hispanoamericano\". Rodolfo Kuhn, junto a otros directores de cine argentinos como Manuel Antín , Fernando Ayala y Leopoldo Torre Nilsson , plantearon por ese entonces un cine más denso y concentrado en los conflictos existenciales urbanos, el abordaje estaba muy influido por la filosofía existencialista , por la Nueva Moral Sexual , el psicoanálisis y la consolidación en Argentina de una gran clase media urbana aunque nativa de muy recientes orígenes europeos.                     Esta película aborda, precisamente, la emergencia desde fines de la década de 1950 de la juventud como sector social con dinámica y conflictos específicos, en todo el mundo, y el modo en que ese proceso se desarrolló en la Argentina. Asimismo se arroja una mirada sobre la cultura de masas con algunas secuencias en un estudio de televisión (Canal 7 de Buenos Aires) y sets publicitarios, motivadas por el trabajo de los protagonistas; es un tema sobre el que volverá más decididamente la siguiente película de Kuhn, Pajarito Gómez (1965), que constituye una poderosa sátira de la industria discográfica.             Reparto María Vaner  ___ Sônia Alberto Argibay  ___ Roberto Emilio Alfaro  ___ Carlos Hugo Jorge Rivera López  ___ Ricardo Marcela López Rey  ___ Chiche Graciela Dufau  ___ Beatriz Matar  ___ Beatriz Anita Larronde  ___ Marilu Horacio Nicolai María Eugenia Daguerre Santángelo Enrique García Fuertes Blanca Victorica Flora Blum Alejandra Kliment Sarita Rodríguez",
      "fileSize": 1306752976,
      "addedAt": "2026-01-07T00:09:38.892Z",
      "thumbnail": "https://archive.org/services/img/los-jovenes-viejos-1962",
      "language": "spa",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 181
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "106 min",
    "imdbRating": 7.2,
    "imdbVotes": 99,
    "Genre": "Drama",
    "Plot": "The frustrations felt by certain middle class youth in 1960s Argentina under the new presidency of Arturo Frondizi, one of whom works in the media, a criticism of the false moral values of that time.",
    "Director": "Rodolfo Kuhn",
    "Writer": "Rodolfo Kuhn",
    "Actors": "María Vaner, Alberto Argibay, Marcela López Rey",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "4 wins & 1 nomination"
  },
  "relatedMovies": [
    "tt0189606",
    "tt0063722",
    "tt0194467",
    "tt0189583",
    "tt0055736",
    "tt0184086",
    "tt0144556",
    "tt0178335",
    "tt0054162",
    "tt0199145",
    "tt0054803",
    "tt0057105"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.892Z"
}