{
  "imdbId": "tt0122159",
  "title": "The Louisiana Hussy",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LouisianaHussy_319",
      "id": "LouisianaHussy_319",
      "title": "Louisiana Hussy",
      "description": "Cajun newlyweds must deal with the jealousy of his brother, who also loved her, and the arrival of a mysterious seductress in their bayou backwater",
      "fileSize": 985794152,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LouisianaHussy_319",
      "collection": "feature_films",
      "downloads": 115250
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "85 min",
    "imdbRating": 5.4,
    "imdbVotes": 145,
    "Genre": "Crime, Drama",
    "Plot": "Brothers Pierre and Jacques Guillot are partners in trading furs and Spanish Moss and Jacques is mad at his brother because Pierre is about to marry Lily and Jacques thought he had the inside track on her. Jacques refuses to attend the wedding, and is out gathering moss with his assistant Cob when Callie, an old Gris-Gris woman, leads them to where she has found a badly beaten and unconscious young woman. They take her to Doc Opie just as Pierre and Lily are being escorted to their new home by friends following their wedding. The doctor asks Jacques to carry the beautiful stranger into the newlywed's house where he has her put to bed. Pierre takes an instant dislike to this girl who calls herself Minette. He steps into the bedroom and tells her she has to go but she throws her arms around him and kisses him...just as brother Jacques passes the bedroom window. Later, Minette tells him that Pierre had forced his attention on her while she was ill. Jacques moves her into his shack to protect her from Pierre. The doctor brings Pierre and Lily a New Orleans newspaper showing a very beautiful woman identified as Mrs. Minette Lanier who had recently committed suicide in the neighboring exclusive community of Grange Hill. They go to New Orleans and look up Clay Lanier,who has been on a prolonged binge ever since his wife's suicide. His servant, Burt, tells them that the real Minette had been crippled after falling off a horse, and Clay had brought Nina Duprez to his home as a companion for Minette. Nina is more interested at being Clay's companion and pulls a few tricks and incidents that convinces Minette that Clay is carrying' on with Nina, and she commits suicide. Clay knows her suicide was engineered by Nina, almost kills her and tries to kill himself, but Burt interferes and, during the fight, Nina manages to escape and collapses from the beating and exhaustion at the spot where Callie found her. Clay sobers up and decides he will go after Nina and finish the job.",
    "Director": "Lee Sholem",
    "Writer": "Charles Lang, William Rowland",
    "Actors": "Nan Peterson, Robert Richards, Peter Coe",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0052634",
    "tt0052713",
    "tt0053374",
    "tt0053133",
    "tt0053850",
    "tt0052891",
    "tt0052862",
    "tt0052637",
    "tt0053213",
    "tt0053361",
    "tt0052696",
    "tt0052850"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.751Z"
}