{
  "movieId": "tt0151807",
  "title": "Oh, Gentle Spring",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/oh-gentle-spring-1942",
      "id": "oh-gentle-spring-1942",
      "title": "Oh, Gentle Spring (1942)",
      "description": "Oh, Gentle Spring is a Terrytoons cartoon directed by Connie Rasinski. Watch on RetroFlix:  https://retroflix.org/oh-gentle-spring-1942/",
      "fileSize": 32678309,
      "addedAt": "2026-01-07T00:10:02.900Z",
      "thumbnail": "https://archive.org/services/img/oh-gentle-spring-1942",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 53
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.4,
    "imdbVotes": 10,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons cartoons wildly varied in quality, though for anybody intrigued by older low-budget animation they are an interesting watch. Some were better than others, often with outstanding music and with some mild amusement and charm and the animation quality improved significantly from the late 30s onwards. Yet variable in characterisation (which tended to be bland leads and pretty fun supporting characters, especially villains) and content. There was not much originality and a lot of their cartoons contained recycled premises and material.1942's Terrytoons output was a hit and miss batch, most ranging from average to decent, none great, although with a few lacklustre or less ones. 'Oh Gentle Spring' is an example of the latter, of the 1942 cartoons while better than 'Eat Me Kitty, Eight to the Bar' it is one of the weaker ones and just missing out of being one of the weaker Terrytoons overall. My main reason for seeing 'Oh Gentle Spring' was for completest sake in seeing as many of the available Terrytoons as possible.'Oh Gentle Spring's' best asset is the music, it was always one of the best, quite a lot of the time the best, assets of the Terrytoons, even the lesser ones. As usual, the lushness of orchestration and merry energy are here, as is the ability to add to the action and even enhance it. The animation is every bit as good, as said this component significantly improved over time and that can be seen in the attention to detail in the more elaborate backgrounds, smoother drawings and transitions and lovely use of shading and colour.There are also a few amusing moments, though mildly, and the synchronisation is neat.However, 'Oh Gentle Spring' has many big issues. It is practically plot-less, basically nothing more than a series of gags and scenes that don't really connect when structuring them together, with a mishmash of themes. The gags are too few and while the cartoon isn't completely humourless there are not enough laughs. Once again there is the sense of the studio having run out of ideas at this point and too much of the material is not very compelling.Pacing could have been much tighter, a pretty dull cartoon this was, and there could have been more charm and more of a gentle touch, both of which mostly absent which makes the predictability and thinness less forgivable. The characters have little personality for them to be interesting and connecting with them was not easy because of this.In conclusion, mediocre. 4/10 Bethany Cox",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Isadore Klein, Donald McKee",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149616",
    "tt0150825",
    "tt0151023",
    "tt0148402",
    "tt0153844",
    "tt0153977",
    "tt0145751",
    "tt0151596",
    "tt0145954",
    "tt0151823",
    "tt0149352",
    "tt0150847"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.900Z"
}