{
  "movieId": "tt0150118",
  "title": "Cholly Polly",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cholly-polly-1942",
      "id": "cholly-polly-1942",
      "title": "Cholly Polly (1942)",
      "description": "A cat and dog sleep together peacefully. The parrot, seeing this, can't stand it, so he pulls out his copy of Mein Kramp, where the first tip is to sow suspicion to divide and conquer. If that wasn't obvious enough, the parrot does a quick Hitler impression. He suggests the dog bite the cat; the dog just goes back to sleep. Next, the parrot claws the dog and whispers to both - still no fight. He feeds Myrtle the Cat a bowl of catnip and they finally start fighting, until they knock the book down; when they realize what the parrot has done, they turn on him. Watch on RetroFlix:  https://retroflix.org/cholly-polly-1942/",
      "fileSize": 89480261,
      "addedAt": "2026-01-07T00:07:51.622Z",
      "thumbnail": "https://archive.org/services/img/cholly-polly-1942",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 93
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbVotes": 18,
    "Genre": "Animation, Comedy, Short",
    "Plot": "A cat and dog sleep together peacefully. The parrot, seeing this, can't stand it, so he pulls out his copy of Mein Kramp, where the first tip is to sow suspicion to divide and conquer. If that wasn't obvious enough, the parrot does a quick Hitler impression. He suggests the dog bite the cat; the dog just goes back to sleep. Next, the parrot claws the dog and whispers to both - still no fight. He feeds Myrtle the Cat a bowl of catnip and they finally start fighting, until they knock the book down; when they realize what the parrot has done, they turn on him.",
    "Director": "Alec Geiss",
    "Writer": "Jack Cosgriff",
    "Actors": "Frank Graham, Jerry Mann",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148294",
    "tt0034744",
    "tt0149268",
    "tt0149387",
    "tt0147804",
    "tt0151214",
    "tt0148623",
    "tt0147277",
    "tt0148922",
    "tt0149348",
    "tt10284276",
    "tt0147875"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.622Z"
}