{
  "movieId": "tt0154377",
  "title": "La dame masquée",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-la-dame-masque",
      "id": "silent-la-dame-masque",
      "title": "La dame masquée",
      "fileSize": 1597341367,
      "addedAt": "2026-01-07T00:11:07.407Z",
      "thumbnail": "https://archive.org/services/img/silent-la-dame-masque",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 263
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "97 min",
    "imdbRating": 6.3,
    "imdbVotes": 22,
    "Genre": "N/A",
    "Plot": "Nathalie Kovanko's mother burns to death in their small home in rural France, leaving her an orphan. She goes to live with her aunt and uncle; Nicolas Koline is sympathetic to the orphaned girl; Madame Alama, discovering the poor child will inherit a million francs or so, tells her impoverished lover, Sylvio De Pedrelli, to marry the foolish girl. Koline and Miss Kovanko only discover this after the ceremony when it is too late. A year later, during a masquerade ball, she snaps and shoots the guy. However, loathsome Oriental Nicolas Rimsky, who lusts for her, has witnessed all, and orders her to come to his restaurant the next afternoon.If all this sounds highly unlikely and at least slightly melodramatic, that's how it struck me. What I found most unlikely about this movie was the set design. Eduardo Gosch and Alexandre Lochakoff decorated the sets, and not only did they leave a lot of bare walls with just a little scrim in the wallpaper, but they seem to think that every room in Paris has a ceiling that is at least thirty feet high, even if the camera set outside the building indicates that would take up three or sometimes four floors.",
    "Director": "Viktor Tourjansky",
    "Writer": "Viktor Tourjansky",
    "Actors": "Nathalie Kovanko, René Maupré, Jeanne Brindeau",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015375",
    "tt0015739",
    "tt0196220",
    "tt0136214",
    "tt0018380",
    "tt0345330",
    "tt0188993",
    "tt0012219",
    "tt0011503",
    "tt0259120",
    "tt0018977",
    "tt0011273"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.407Z"
}