{
  "imdbId": "tt0138560",
  "title": "Korkein voitto",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/korkein-voitto_1929",
      "title": "Korkein voitto",
      "id": "korkein-voitto_1929"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "89 min",
    "imdbRating": "5.9",
    "imdbVotes": "76",
    "Genre": "Drama, Romance, Thriller",
    "Plot": "The Baron Henrik von Hagen is an idle Finn bourgeois ( as you can see, decadent people are all over the world? ); after eleven years, he meets again an old acquaintance ,Madame Vasilevna, a foreigner who during her youthful days was a ballet dancer while Herr Baron was her faithful cavalier. Once they are reunited again in Helsinki, Herr Baron discovers that Madame Vasilevna earns her living with a new hobby: she likes very much painting frozen Finn landscapes but especially the ones around military bases.\"Korkein Voitto\" ( The Highest Triumph ) was directed by Herr Carl von Haartman in the silent year of 1929 and it was the first film directed by this peculiar Finnish director, although previously Herr Haartman had a very interesting life and career.During his youthful days, Herr Haartman had a military career and he participated in the Finnish civil war of 1918. During the mid 20's he went to Hollywood where he collaborated or played with very important directors of the time, namely Herr William Wellman with whom Herr Haartman, a military expert, supervised every flying sequence of \"Wings\" (1927) and Herr Erich von Stroheim's \"The Wedding March\" (1928) wherein Haartman played what is supposed to be a German officer, a role that was his speciality during his acting days in Hollywood (though he was often un-credited).With such important film background experience, Herr Haartman was selected by the most important Finland film studio, \"Suomi-Filmi\" to direct \"Korkein Voitto\" and certainly the Hollywood experience can be appreciated in the impeccable and excellent film direction. The art direction and cinematography demonstrate an appreciation for film classicism, a high finish film made by a Finnish director, ja wohl!.Herr Haartman has a fluid film narrative ( travelling, air scenes ) constructing a story of romance and political schemes in which stereotypes are used proportionally and in a light way ( an idle Baron, a mysterious woman, a suspicious Jew, an expensive taxi driver? ) adding action and a slight sense of humour, achieving finally a very interesting although uneven film.The main characters of the picture, Herr Baron und Madame Vasilevna, played by Herr Haartman himself und Frau Kerstin Nylander, go all over Finland, combining in this way urban scenes together with others of the wild and frozen Finnish landscapes (there's even some seal hunting, a peculiar pastime for Finns). The dramatic intensity of this story of hidden intrigues works well, even though the characters are rather clichéd. Everything is done \"Hollywood style\" but well adapted to the Finnish setting and circumstances. And now, if you'll allow me, I must temporarily take my leave because this German Count must go Teutonic seal hunting.",
    "Director": "Carl von Haartman",
    "Writer": "Carl von Haartman",
    "Actors": "Carl von Haartman, Kerstin Nylander, Aku Korhonen",
    "Language": "None",
    "Country": "Finland",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0020581",
      "title": "Where East Is East",
      "year": 1929,
      "imdbRating": "6.6",
      "imdbVotes": "710",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0018972",
      "title": "Hangman's House",
      "year": 1928,
      "imdbRating": "6.6",
      "imdbVotes": "549",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019585",
      "title": "The Wind",
      "year": 1928,
      "imdbRating": "8.0",
      "imdbVotes": "7,309",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037547",
      "title": "Blood on the Sun",
      "year": 1945,
      "imdbRating": "6.0",
      "imdbVotes": "2,330",
      "language": "English, Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt16156352",
      "title": "Vladivostok",
      "year": 2021,
      "imdbRating": "5.4",
      "imdbVotes": "108",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0035612",
      "title": "The Adventures of Tartu",
      "year": 1943,
      "imdbRating": "6.9",
      "imdbVotes": "1,095",
      "language": "German, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019644",
      "title": "Applause",
      "year": 1929,
      "imdbRating": "7.1",
      "imdbVotes": "1,519",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0038990",
      "title": "The Strange Woman",
      "year": 1946,
      "imdbRating": "6.5",
      "imdbVotes": "2,520",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019957",
      "title": "Half Marriage",
      "year": 1929,
      "imdbRating": "5.5",
      "imdbVotes": "159",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019979",
      "title": "Her Private Affair",
      "year": 1929,
      "imdbRating": "5.1",
      "imdbVotes": "159",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0025472",
      "title": "Marie Galante",
      "year": 1934,
      "imdbRating": "5.6",
      "imdbVotes": "398",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032842",
      "title": "Night Train to Munich",
      "year": 1940,
      "imdbRating": "7.2",
      "imdbVotes": "5,888",
      "language": "English, German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:24.700Z"
}