{
  "movieId": "tt0135805",
  "title": "Billy the Kid's Gun Justice",
  "year": 1940,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/GunJustice",
      "id": "GunJustice",
      "title": "Billy the Kid's Gun Justice",
      "description": "Billy (Bob Steele) and his sidekick Fuzzy (Al St. John) trying to unravel the mystery of a friend's missing uncle and bring to justice the criminals behind the disappearance whom they suspect are also behind a related land swindle.",
      "fileSize": 1674226855,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/GunJustice",
      "year": 1940,
      "collection": "feature_films",
      "downloads": 25393
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NxP6e_eYZKY",
      "id": "NxP6e_eYZKY",
      "title": "Billy The Kid's Gun Justice (1940) BOB STEELE",
      "description": "Stars: Bob Steele, Al St. John, Louise Currie\nDirector: Sam Newfield\n\nEscaping from the law once again, Billy, Fuzzy, and Jeff ride to the ranch of Jeff's uncle only to find another family living their. They soon learn of Cobb Allen's scheme where he sells a ranch, makes sure the rancher can't pay off his note, kicks him out, and resells the ranch. But Billy has a plan to recover the ranchers' money and he sends Fuzzy to town with a fake map to a gold treasure.",
      "addedAt": "2025-12-26T23:58:02.736Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/NxP6e_eYZKY/maxresdefault.webp",
      "duration": 3691,
      "language": "en",
      "year": 1940,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "57 min",
    "imdbRating": 6,
    "imdbVotes": 117,
    "Genre": "Drama, Western",
    "Plot": "The third in the series of six PRC westerns starring Bob Steele as Billy the Kid (Bob Steele, finds Billy and his pals, Jeff Blanchard (Carleton Young) and Fuzzy Jones (Al St. John) ambushed in a cabin and, as they are making their getaway, Jeff is wounded. They go to Little Bend Valley where Jim Blanchard, Jeff's uncle, has a ranch. On their way, there see Ed Baker (Charles King0 and Buck Mason (Rex Lease) stop the wagon driven by Ann Roberts (Louise Currie). Billy stops the two henchmen from throwing the supplies from the wagon. Ann tells Billy that she and her father, Tom Roberts (Forrest Taylor), have bought a ranch but that someone is trying to run them out of the valley. They ride with Ann and Jeff is surprised to see that the Roberts' are living on what was formerly his uncle's ranch. The Roberts had only been there a short time, had never met Jim Blanchard, and after buying the ranch from Cobb Allen (Al Ferguson) learned they had no water rights. Billy also learns that other ranchers such as Dave Barlow (Edward Peil Sr.) had also bought ranches from Cobb, but that Cobb had diverted the stream that ran through the ranches and was now trying to force them to buy water from him. Billy and Jeff go to the barricade Cobb has around the water and after a fight with Allen-henchmen Bragg (Kenne Duncan), Mason and Baker, the water is turned back into its original channel.",
    "Director": "Sam Newfield",
    "Writer": "Tom Gibson, Joseph O'Donnell",
    "Actors": "Bob Steele, Al St. John, Louise Currie",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0033393",
    "tt0033394",
    "tt0033391",
    "tt0033845",
    "tt0030159",
    "tt0035106",
    "tt0133763",
    "tt0035162",
    "tt0030870",
    "tt0030556",
    "tt0035723",
    "tt0035804"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}