{
  "movieId": "tt0192409",
  "title": "Out Yonder",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OutYonderForArch",
      "id": "OutYonderForArch",
      "title": "\"Out Yonder\" (1919) starring Olive Thomas",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   \"Out Yonder\" is a moving drama included this film in our program to illustrate the work and contributions of Olive Thomas, a star of Silent Hall of Fame. This rare film lets us enjoy one of very few surviving performances of Olive Thomas, who died the year after its release at 25. The heroine of Olive Thomas falls in love with the right man, but her father's dark secret may prevent her happiness. Directed by                  Ralph Ince Written by                  Edward J. Montague Starring                      Olive Thomas, Huntley Gordon, John Smiley, Edward Ellis Cinematography        Harold Sintzenich Distributed by            Select Pictures Corporation Release date                December 21, 1919 Running time              58 min Country                       United States Language                     Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 38186102,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/OutYonderForArch",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 2537
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "65 min",
    "imdbRating": 6.4,
    "imdbVotes": 110,
    "Genre": "Drama",
    "Plot": "Flotsam, the daughter of lighthouse keeper Amos Bart, uses her experience maneuvering in the perilous New England reefs to save Mrs. Elmer, who is vacationing with her son Edward and friends on their yacht, from drowning. Edward and Flotsam spend much time together and fall in love, but when he proposes, Amos' helper, the brutish Joey Clark, who wants Flotsam, reveals that years earlier Amos murdered Edward's father. Amos, who believes that he committed the crime while intoxicated, confesses that Flotsam is not his daughter, but that of a dying woman who brought her to his wife to raise. After he tells Flotsam to go with the Elmers, Edward's jealous former sweetheart tells her about the murder that Amos committed. Flotsam returns, followed by the yacht, and she and Edward see Clark taunt Amos by confessing that he murdered Edward's father. After Amos chases Clark up the lighthouse steps, their struggle causes the light to go out. Flotsam carries a flaming torch to save the yacht from dashing onto the rocks. She and Edward then plan to marry.",
    "Director": "Ralph Ince",
    "Writer": "Pauline Phelps, Marion Short, Edward J. Montagne",
    "Actors": "Olive Thomas, Huntley Gordon, Marie Coverdale",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0010402",
    "tt0010178",
    "tt0007903",
    "tt0009559",
    "tt0009968",
    "tt0010103",
    "tt0010137",
    "tt0010208",
    "tt0010316",
    "tt0010418",
    "tt0010890",
    "tt0010680"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.465Z"
}