{
  "imdbId": "tt0148489",
  "title": "Mother Goose Nightmare",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mother-goose-nightmare-1945",
      "title": "Mother Goose Nightmare (1945)",
      "description": "A Terrytoons cartoon released 11 May 1945. Gandy and Sourpuss take a trip to Mother Goose Land, where they meet the many famous characters who live there. But things aren't what they seem, and this trip winds up as a nightmare of epic proportions. Watch on RetroFlix:  https://retroflix.org/mother-goose-nightmare-1945/",
      "id": "mother-goose-nightmare-1945"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": "5.3",
    "imdbVotes": "20",
    "Genre": "Animation, Short",
    "Plot": "When Gandy Goose was first introduced in 1938's 'Gandy the Goose', a watchable enough if rather average cartoon, he didn't really do it for me as a character on his own and struck me as being one that needed a stronger and funnier character as a partner. He got that in Sourpuss the Cat, their first appearance together being in 1939's 'Hook, Line and Sinker', and by 1941's 'The Magic Pencil' he had come on by quite some way and their chemistry gelled surprisingly well.1945 was a relatively prolific year, like it was too for the Mighty Mouse series which was already starting to get on the tired side in my view, for Gandy and Sourpuss. While certainly a watchable cartoon and a middling effort of Terrytoons' 1945 output, 'Mother Goose Nightmare' is not one of their best and one of Terrytoons' not bad but nothing special efforts. Also found it a letdown after 'Post War Inventions' from the same year, a contender for the best Gandy and Sourpuss cartoon and one of the studio's best.Don't think any of the Terrytoons cartoons are irredeemable, even the weak ones and there are quite a lot of those out there. 'Mother Goose Nightmare' certainly isn't that and am going to start with what it does good. The consistent high point for Terrytoons' output was always the music, which doesn't disappoint and is actually pretty incredible. Being typically lush and full of character. The animation is also great, so many lovely colours, loving attention to detail in the backgrounds and the drawing is fluid.Gandy and Sourpuss both come off well. Gandy has come on so much as a character, he has a more compelling personality, he's amusing and he works and contrasts well with the funnier and more interesting Sourpuss. Their chemistry on paper sounds like a very odd coupling and had the danger of not gelling at all, somehow though it works. Have seen far more senseless pairings in animation, Daffy Duck and Speedy Gonzales anyone? There are amusing and charming moments and the ending is interesting, the most compelling and inventive part.Somehow on the other hand, 'Mother Goose Nightmare' doesn't come over as particularly inspired. Really loved the idea of being based around Mother Goose-based nightmares and child/nursery rhyme themes, but not near enough is done with it. It may not be a typical Gandy and Sourpuss in the army cartoon but it is a quite typical example of their dream ones, and it is not particularly imaginative, amusing moments are too few and it does border on too cute. Also feel that fatigue was starting to kick in in their series and there is that feel here.This feeling is apparent in the too few gags, which feel over-familiar. It has been said it's a one-joke cartoon and it is basically, and that particular joke needed more variety and freshness to make it work to the end instead of running out of steam a little too early like it does here. The story is barely there and a livelier pace, that there is not enough of that further adds to the tiredness, and less of a cutesy feel would have helped.Overall, one of those not bad but nothing special cartoons. As said, neither dream-like or nightmarish. 5/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Donald McKee, Tom Morrison",
    "Actors": "Tom Morrison",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0037912",
      "title": "Gypsy Life",
      "year": 1945,
      "imdbRating": "5.8",
      "imdbVotes": "191",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148632",
      "title": "Post War Inventions",
      "year": 1945,
      "imdbRating": "7.1",
      "imdbVotes": "35",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153892",
      "title": "A Wolf's Tale",
      "year": 1944,
      "imdbRating": "5.8",
      "imdbVotes": "16",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150455",
      "title": "Eliza on the Ice",
      "year": 1944,
      "imdbRating": "5.3",
      "imdbVotes": "59",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148172",
      "title": "Fortune Hunters",
      "year": 1946,
      "imdbRating": "5.1",
      "imdbVotes": "19",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148343",
      "title": "It's All in the Stars",
      "year": 1946,
      "imdbRating": "4.7",
      "imdbVotes": "15",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150546",
      "title": "A Fight to the Finish",
      "year": 1947,
      "imdbRating": "6.4",
      "imdbVotes": "40",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150232",
      "title": "Crying Wolf",
      "year": 1947,
      "imdbRating": "6.3",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151566",
      "title": "Mighty Mouse in Krakatoa",
      "year": 1945,
      "imdbRating": "7.6",
      "imdbVotes": "90",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152134",
      "title": "Raiding the Raiders",
      "year": 1945,
      "imdbRating": "5.5",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152484",
      "title": "Smoky Joe",
      "year": 1945,
      "imdbRating": "5.2",
      "imdbVotes": "17",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152787",
      "title": "Swooning the Swooners",
      "year": 1945,
      "imdbRating": "7.5",
      "imdbVotes": "35",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:54.330Z"
}