{
  "movieId": "tt0151443",
  "title": "The Magic Slipper",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-magic-slipper-1948",
      "id": "the-magic-slipper-1948",
      "title": "The Magic Slipper (1948)",
      "description": "Cinderella, through the help of her fairy godmother, is able to go to the ball to meet the prince. Complcations arise when midnight strikes, and she must leave before the spell wears off. The prince must find the person whose foot fits the glass slipper left behind. Watch on RetroFlix:  https://retroflix.org/the-magic-slipper-1948/",
      "fileSize": 36679985,
      "addedAt": "2026-01-07T00:12:10.592Z",
      "thumbnail": "https://archive.org/services/img/the-magic-slipper-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 94
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.5,
    "imdbVotes": 32,
    "Genre": "Animation, Short",
    "Plot": "Although the story of 'Cinderella' has been adapted and parodied in animation numerous times, it had not been done before in the Mighty Mouse theatrical series. One would understandably not think that to be the case, as the story in 'The Magic Slipper' is basically the relatively typical Mighty Mouse formula with some elements of 'Cinderella'. Most of the 1948 Mighty Mouse cartoons were either quite good if far from perfect or decent but unexceptional.'The Magic Slipper' belongs in the latter category. Did like the basic premise, but it ended up feeling too much like typical Mighty Mouse with splashes of the 'Cinderella' story and not quite enough to make it a tale of its own. As far as the Mighty Mouse cartoons go, it is not one of the best or one of the worst. Personally would put 'The Magic Slipper' somewhere in the middle, and the same goes for when ranking it with Terrytoons' other 1948 cartoons.Once again, the animation and music are the best things and are so good that they are worth more than a star each. 'The Magic Slipper' is beautifully animated, especially early on where there are some quite magical visuals. It is gorgeously detailed, lively and colourful without being garish and is really quite sumptuous. Again, the music is a big strength, being again quite incredible. It is beautifully and cleverly orchestrated and arranged, is terrific fun to listen to and the lively energy is present throughout, doing so well with adding to the action. Had no problem personally with the opening song and the jazzy musical number at the ball is very catchy.Generally the character writing was less than great, but there is one character that makes a big impression and that's the wolf. Keep continuing to notice that it is always the villain that steals the show in the Mighty Mouse cartoons, here this wolf has great comic timing while also being quite sinister. The cartoon does pick up significantly when he is introduced and in his entertaining encounters with the prince and Cinderella (two of the cartoon's highlights when it comes to the material). Did like Cinderella too, she has a lot of allure and charm. There is some nice energy in the latter portions.Actually didn't think that Mighty Mouse was necessary in 'The Magic Slipper', basically he is a supporting character despite meaning to be a lead (common in his cartoons) shoehorned in in the last two or so minutes for plot device reasons in a very hastily paced, too neat and quite repetitive climax. One that is so obvious from the very beginning, due to it being pretty much the same as how what feels like every Mighty Mouse cartoon ends.The story is very flimsy and very predictable, nothing new being done with familiar ground. The gags are too few, the best all belonging to the wolf in the second half, and generally they are very uninspired, with too much of a reused feel, and not too funny. The rest of the characters are bland, with the prince also an idiot, and yes the caricatures are not the most tasteful in the world.In summary, unexceptional but a decent one-time watch. 6/10.",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150532",
    "tt0148184",
    "tt0152124",
    "tt0148042",
    "tt0148253",
    "tt0148319",
    "tt0148458",
    "tt0148378",
    "tt0148588",
    "tt0152533",
    "tt0152161",
    "tt0146300"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.592Z"
}