{
  "imdbId": "tt0151197",
  "title": "Keep 'Em Growing",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/keep-em-growing-1943",
      "id": "keep-em-growing-1943",
      "title": "Keep 'Em Growing (1943)",
      "description": "Keep 'Em Growing is a Terrytoons cartoon directed by Mannie Davis. Watch on RetroFlix:  https://retroflix.org/keep-em-growing-1943/",
      "fileSize": 39030565,
      "addedAt": "2026-01-07T00:09:15.999Z",
      "thumbnail": "https://archive.org/services/img/keep-em-growing-1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 69
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.5,
    "imdbVotes": 16,
    "Genre": "Animation, Short",
    "Plot": "Terrytoons Studios' output is not consistently bad. A long way from that, it started pretty rough but improved steadily and surely over-time, until by the late 30s most of the cartoons were watchable, though very rarely above decent level and mediocre and less efforts were still seen. Even if some of the same mistakes were consistently made when the studio's output very steadily got better, significant improvements were also made too. As one can probably guess, actually find it inconsistent.1943's Terrytoons cartoons can be described as inconsistent too, none unwatchable, none great and most ranging from very mediocre to decent. 'Keep Em Growing' is one of the mediocre ones and is one of the weaker 1943 cartoons for the studio, though nowhere near overall really. Nicely made and outstandingly scored, but too cutesy, rather bland and very dull with nowhere near enough gags and uninteresting characters. That's the basic outline of my thoughts on 'Keep Em Growing', am now going to try and elaborate (am not always good at it and am at risk of re-inforcing).What stops 'Keep Em Growing' from being a complete bust are two main things, the same plus point components that have been present in Terrytoons cartoons from around the late-30s onwards. One of them has always been even in the weak cartoons and the other being the most improved asset overtime. The most outstanding asset is the music. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with adding to the action. The big overtime improvement is the animation, on the most part. The ambitious, elaborate detail in the backgrounds is still great to see, as is the comparatively improved fluidity of drawing and movement, and the synchronisation in movement and sound is neat.Do agree that the caterpillars gag came over quite nicely. Some sporadic charm here and there.Unfortunately, the story is non-existent, if there was a basic story it was paper thin, and that would have been forgivable if the pacing had energy or if the material was interesting. That was not to be on both counts. Much of the pacing is very dull which makes the cartoon feel lifeless, the lack of freshness had much to do with it. There are nowhere near enough gags, what there are too are not very funny or imaginative, not much different to what has been seen before in other plot-less cartoons centred around animals doing jobs and being cheerful amidst difficult times.'Keep Em Growing' tries too hard to be cute that it comes over as quite saccharine instead, there is no depth to the cartoon which gives off a blandness and everything related to the war is so been there done that. None of the characters have engaging enough personalities, basically cute looking animals with little personality beyond that.In conclusion, mediocre. 4/10",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Isadore Klein, Tom Morrison",
    "Actors": "Tom Morrison",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149798",
    "tt0148998",
    "tt0152673",
    "tt0150950",
    "tt0151306",
    "tt0151561",
    "tt0148212",
    "tt0153889",
    "tt0150625",
    "tt0148300",
    "tt0151343",
    "tt0147628"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.999Z"
}