{
  "imdbId": "tt0145954",
  "title": "Pandora's Box",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pandoras-box-1943",
      "id": "pandoras-box-1943",
      "title": "Pandora's Box (1943)",
      "description": "A Terrytoons cartoon released 11 June 1943. As the story unfolds, viewers are introduced to the valiant Super Mouse, whose courage knows no bounds. When a mysterious box descends from the heavens, chaos ensues as bat-like cats emerge, threatening to unleash havoc upon the land. Amidst the turmoil, a female mouse finds herself in peril, her fate hanging in the balance. Watch on RetroFlix:  https://retroflix.org/pandoras-box-1943/",
      "fileSize": 36363278,
      "addedAt": "2026-01-07T00:10:12.695Z",
      "thumbnail": "https://archive.org/services/img/pandoras-box-1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 93
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6,
    "imdbVotes": 30,
    "Genre": "Animation, Short",
    "Plot": "Terrytoons Studios' output has always been inconsistent when it comes to quality. The most consistent asset has always been the music, in a great way, while the animation was something that was less than great before but the improvement over-time has been enormous. Where the studio is most inconsistent is in the characters and material/story (described by me before as content). See their cartoons really to see as many of their overall output as possible. Another reason was for being interested in seeing older cartoons from lower-budget and comparitively lesser known studios.1943 saw all of the above though it was a case like all the previous years of cartoons being better than others, the music and animation being merits and characterisation and content being hit and miss. This was not unexpected, given that from 1929 onwards hit and miss has been the general standard for Terrytoons, but some years fared worse than others. Like the previous year, 1943 was one of Terrytoons' better years, none really being terrible and most ranged from average to decent while none being great. Super Mouse's fourth cartoon 'Pandora's Box' is a step down from his previous three cartoons, which despite my mixed thoughts on the character himself there were a lot of big merits to them, but as far as the 1943 Terrytoons cartoons go it is one of the better and most interesting ones despite drawbacks.Super Mouse was later re-named Mighty Mouse after seven cartoons and went on to become Terrytoons' most prolific lead character up until 'Cat Alarm' in 1961. Was not a fan of all his cartoons and Mighty Mouse has never been one of my favourite characters in animation, but as far as Terrytoons go even the weakest cartoons when the series became increasingly repetitive were quite a bit better than when the studio was at its worst, if that makes sense.'Pandora's Box', which is something of an alternate origins story perhaps for Super/Migty Mouse, has a very slight and at times predictable (especially at the end) story, though by Super/Mighty Mouse standards it's one of the more original ones conceptually. Same goes for Terrytoons too. It also takes too long to get going and the first two minutes or so are not very interesting from personal opinion.Did find Super Mouse bland here until the last minute and a half, and the female lead character is a little more interesting but is too derivative of other similar female characters in a Terrytoons cartoon.However, 'Pandora's Box' is very well animated. Which was not a surprise as this aspect had come on enormously by this point with Terrytoons. It is nicely detailed, lively and colourful without being garish, but halfway through the visuals got very imaginative (some of the most imaginative visuals Terrytoons ever did) and at its best remarkably freaky. Again, the music, the thing that was the most consistently good thing from the very beginning with Terrytoons, is a big strength. It is beautifully and cleverly orchestrated and arranged, is terrific fun to listen to and the lively energy is present throughout, doing so well with adding to the action.It is a very atmospheric cartoon once it gets going after the box is opened, is at times humorous and really quite nightmarish in the middle two minutes. Where things really get going and the supporting characters from the Pandora's Box are memorably creepy.Overall, not a bad cartoon but not a great one either. 6/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Isadore Klein, Donald McKee",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0145751",
    "tt0149616",
    "tt0150825",
    "tt0151023",
    "tt0148402",
    "tt0151807",
    "tt0150059",
    "tt0153844",
    "tt0153977",
    "tt0151566",
    "tt0151596",
    "tt0152134"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.695Z"
}