{
  "imdbId": "tt0140524",
  "title": "Running a Cinema",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-running-a-cinema",
      "id": "silent-running-a-cinema",
      "title": "Running a Cinema",
      "fileSize": 157772358,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-running-a-cinema",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 371
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.2,
    "imdbVotes": 9,
    "Genre": "Animation, Short",
    "Plot": "This animated insight into silent cinema-going is more fanciful than factual, and relishes in poking fun at the films of its time. Ever wondered what it was like to run a cinema in the 1920s? Well it was probably nothing like how it is shown in this film, but who cares when it is such great fun? Dudley Buxton was a comic illustrator and postcard artist who started making cartoon propaganda films in WW1. His \"Memoirs of Miffy\" series was an attempt to continue his success into the 1920s, but like most other British animators the competition of American animation proved too strong. Dudley Buxton's contribution to the development of film cartoons in Britain is sadly little known. He tried to move the industry on from cut-out animation to using the cel technique so common in the US. However lack of investment in the UK and favourable distribution terms for American series like Felix the Cat made it impossible to compete on level terms. Buxton continued as a key but anonymous figure in British animation into the mid-1930s, but is today better known for his saucy postcards.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0166609",
    "tt1496023",
    "tt0159700",
    "tt0419883",
    "tt1496006",
    "tt0148531",
    "tt14091630",
    "tt12305226",
    "tt12304756",
    "tt1020989",
    "tt0146584",
    "tt0150344"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}