{
  "movieId": "tt0100740",
  "title": "Tales from the Darkside: The Movie",
  "year": 1990,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tales-from-the-darkside-1990_202511",
      "id": "tales-from-the-darkside-1990_202511",
      "title": "Tales from the Darkside",
      "description": "\"Tales from the Darkside\" is a horror anthology film that consists of three main stories, woven together by a framing narrative. The film explores themes of horror, morality, and the supernatural.he film begins with a young boy who is being held captive by an elderly woman. To distract her from his escape attempt, he tells her terrifying stories. Story Segments Lot 249 : A college student discovers an ancient Egyptian mummy and uses it to exact revenge on his classmates. However, the resurrection of the mummy leads to unforeseen consequences that spiral out of his control. The Cat from Hell : A hitman is hired to kill an ostensibly evil cat that has been linked to the deaths of multiple people. As he attempts to carry out his mission, he learns that the cat harbors dark powers. The Foolish Virgin : A young woman is drawn into a fatal encounter with a vampire while exploring her sexuality. Her naive choices lead to dire consequences as she discovers the true nature of the monster lurking nearby. The stories intertwine with the boy's escape attempt, culminating in a surprise twist that highlights the overarching themes of horror and wickedness. The film concludes with a reflection on storytelling and the nature of fear itself.",
      "fileSize": 902054143,
      "addedAt": "2026-01-07T00:11:46.527Z",
      "thumbnail": "https://archive.org/services/img/tales-from-the-darkside-1990_202511",
      "language": "eng",
      "year": 1990,
      "collection": "feature_films",
      "downloads": 444
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "93 min",
    "imdbRating": 6.2,
    "imdbVotes": 19833,
    "Genre": "Comedy, Fantasy, Horror",
    "Plot": "This is really three shorter movies, bound together by a fourth tale in which the other three stories are read. The first segment features an animated mummy stalking selected student victims; the second tale tells the story of a \"cat from Hell\" who cannot be killed and leaves a trail of victims behind it; the third story is about a man who witnesses a bizarre killing and promises never to tell what he saw, and the \"in-between\" bit is the story of a woman preparing to cook her newspaper boy for supper.",
    "Director": "John Harrison",
    "Writer": "Michael McDowell, Arthur Conan Doyle, Stephen King",
    "Actors": "Debbie Harry, Matthew Lawrence, Christian Slater",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0213865",
    "tt0094332",
    "tt0083767",
    "tt0038270",
    "tt0090196",
    "tt0787495",
    "tt0843873",
    "tt0104418",
    "tt0103016",
    "tt0097136",
    "tt0092610",
    "tt0254554"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.527Z"
}