{
  "imdbId": "tt0147206",
  "title": "Radio Racket",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/radio-racket-1931",
      "id": "radio-racket-1931",
      "title": "Radio Racket (1931)",
      "description": "Radio Racket is an Aesop Fables cartoon directed by John Foster. Watch on RetroFlix:  https://retroflix.org/radio-racket-1931/",
      "fileSize": 127023880,
      "addedAt": "2026-01-07T00:10:21.541Z",
      "thumbnail": "https://archive.org/services/img/radio-racket-1931",
      "language": "eng",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 37
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 4.5,
    "imdbVotes": 30,
    "Genre": "Animation, Short",
    "Plot": "Van Beuren cartoons are extremely variable, especially in the number of gags and whether the absurdist humour shines through enough (sometimes it does, other times it doesn't), but are strangely interesting. Although they are often poorly animated with barely existent stories and less than compelling lead characters, they are also often outstandingly scored, there can be some fun support characters and some are well-timed and amusing.'Radio Racket' is another one of the weak Aesop's Fables/Van Beuren cartoons and towards the bottom end of their 1931 batch. They could have done a good deal with a good idea, but it doesn't do anything with it and it was instead a case of having a few good things and a lot of the usual flaws in the Aesop's Fables/Van Beuren series.Best asset about 'Radio Racket' is the music score, pretty much the best thing consistently of Van Beuren's output. Sometimes even the only good thing. It is so beautifully and cleverly orchestrated, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Second best thing about 'Radio Racket' is the ending, which is unexpected, surprisingly funny and the closest the cartoon ever gets to being absurdist. There are a couple of parts where synchronisation is neat.Coming onto the numerous criticisms, the animation is not good, in fact it is downright bad most of the time with erratically sloppy character designs in particular while the simplistic background detail and lack of fluidity and crispness are just as difficult to ignore.Story is very slight to the point of non-existence and suffers from far too erratic pacing a vast majority of the time, something that affects the visuals a lot of the time because most of it is out of sync. It feels aimless and also random and disjointed. If you are looking for sense too, look elsewhere. Likewise with endearing or memorable characters, the characters here are neither, not to mention very poorly animated.Basically 'Radio Racket' is a stringing along of gags structured in a way that's disorganised and random. Generally it is very low on laughs, actually very little of it is remotely amusing, apart from the ending. Apart from that, nothing is inventive, never rising above the forgettable and there is not much absurdist about them, timing is really sluggish too. This is a reiteration of a lot of the average and less Aesops Fables/Van Beuren cartoons that have been reviewed by me, but this is due to them having the same strengths and drawbacks.Overall, weak apart from the music and the ending. 3/10 Bethany Cox",
    "Director": "John Foster",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0146851",
    "tt0161496",
    "tt0152207",
    "tt0149879",
    "tt0150266",
    "tt0148226",
    "tt0022199",
    "tt0152780",
    "tt0147620",
    "tt0161222",
    "tt0150028",
    "tt0150155"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.541Z"
}