{
  "movieId": "tt0151967",
  "title": "The Picnic Panic",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-picnic-panic-1935",
      "id": "the-picnic-panic-1935",
      "title": "The Picnic Panic (1935)",
      "description": "The Picnic Panic is a Rainbow Parade cartoon directed by Burt Gillett, Tom Palmer. Watch on RetroFlix:  https://retroflix.org/the-picnic-panic-1935/",
      "fileSize": 75307105,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-picnic-panic-1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 82
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "8 min",
    "imdbRating": 5.3,
    "imdbVotes": 65,
    "Genre": "Animation, Short",
    "Plot": "Wow, this is a curiosity piece more than anything else. It's 70 years old but looks even older! It's very primitive stuff, not good or very funny, but not terrible either. It's an odd mix of animation in that most of it is animation but a small part shows three actual little girls. The girls are watching and listening to three kettles or pots on the stove singing. When the latter stops, the girls are entertained by a story from the coffeepot. He tells them about a picnic they had one time, which is then illustrated. In the cartoon, you see all the little cups, saucers, salt and pepper shakers, etc., playing and having a good time. Some of the things are clever, as the cups filling themselves with water from a stream, or dishing out sugar, cream, etc.Then a cow comes by and interrupts the picnic by eating some of the food. All the cups, pots, etc., combine to use what they have to get rid of the cow. That's it. As I said, very primitive looking but it IS in color and it isn't stupid....but not something you'd watch a lot of times, either.",
    "Director": "Burt Gillett, Tom Palmer",
    "Writer": "N/A",
    "Actors": "Gus Wicke",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026118",
    "tt0151610",
    "tt0026726",
    "tt0151609",
    "tt0026851",
    "tt0151910",
    "tt0152130",
    "tt0152309",
    "tt0152560",
    "tt0150996",
    "tt0151608",
    "tt0141654"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}