{
  "imdbId": "tt0159286",
  "title": "Black Oxfords",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/preview-Black-Oxfords-1924",
      "id": "preview-Black-Oxfords-1924",
      "title": "\"Black Oxfords\" (1924) with Marceline Day",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   We have included this film in our program to illustrate the work and contributions of our star Marceline Day. \"Black Oxfords\" is an entertaining Mack Sennett short comedy.  The film is significant for Marceline Day's first leading role, in which we can see the very beginning of her illustrious career. \"Black Oxfords\" was released only days after her 16th birthday.  In just a couple years Marceline Day's meteoric rise through the movie star ranks would take her to partnerships with Buster Keaton, Lon Chaney, J. Barrymore, Norman Kerry, Lars Hanson and other male screen luminaries.  Directed by                      Del Lord Produced by                    Mack Sennett Comedies Starring                           Sid Smith, Vernon Dent, Marceline Day, Anna Hernandez, Jack Richardson Cinematography             George Spear, George Unholz Distributed by                 Pathé Exchange, Inc. Release date                      May 18, 1924 Running time                   19 minutes Country                            United States Language                          Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 32148209,
      "addedAt": "2026-01-07T00:10:21.539Z",
      "thumbnail": "https://archive.org/services/img/preview-Black-Oxfords-1924",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 4146
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "19 min",
    "imdbRating": 5.8,
    "imdbVotes": 117,
    "Genre": "Comedy, Short",
    "Plot": "A mother and daughter are in a fix because their mortgage payment is due and they can't make it--and the heartless landlord is about to foreclose on their house and throw them in the street. Their son Jack, who is in jail, finds out about their plight and breaks out in order to enter his horse in the steeplechase race to win enough money to pay the mortgage.",
    "Director": "Del Lord",
    "Writer": "John A. Waldron, Jack Wagner",
    "Actors": "Sidney Smith, Vernon Dent, Marceline Day",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0015076",
    "tt0015390",
    "tt0015657",
    "tt0016375",
    "tt0467029",
    "tt0014967",
    "tt0015096",
    "tt0027097",
    "tt0014667",
    "tt0031065",
    "tt0015477",
    "tt0014664"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.539Z"
}