{
  "movieId": "tt0149373",
  "title": "Who's Who in the Jungle",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/whos-who-in-the-jungle-1945",
      "id": "whos-who-in-the-jungle-1945",
      "title": "Who's Who in the Jungle (1945)",
      "description": "A Terrytoons cartoon released 19 October 1945. Gandy Goose and Sourpuss are flown in to hunt big game. The two have something else in mind. They can't get out of there fast enough! Watch on RetroFlix:  https://retroflix.org/whos-who-in-the-jungle-1945/",
      "fileSize": 38878482,
      "addedAt": "2026-01-07T00:13:06.704Z",
      "thumbnail": "https://archive.org/services/img/whos-who-in-the-jungle-1945",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 73
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.8,
    "imdbVotes": 22,
    "Genre": "Animation, Short",
    "Plot": "Judging from my below average rating here, one would think that my feelings on Gandy and Sourpuss and their cartoons are negative. Not so on the whole actually. Actually like their pairing, which is not near as senseless as it appears on paper, and both characters engage and amuse (Gandy definitely works better paired with another character than on his own). Their cartoons were predictable and did start to get relatively tired at this stage, but a good deal of them were quite nice.1945 was quite a big year for Gandy and Sourpuss, one of their most prolific years. Along with Mighty Mouse, they dominated it and only a small handful of cartoons from the year starred miscallanous/relatively obscure characters. Personally quite enjoyed all their previous 1945 outings, especially 'Post War Inventions', but 'Who's Who in the Jungle' was a stumbling block for them and one of their worst cartoons which is on the same level actually as the worst of Gandy's solo cartoons (not a good sign). For me too it was one of the worst cartoons from that year for Terrytoons Studios, which generally was one of their better even if still uneven years.Every Terrytoons cartoon has good things, yes even the ones that did absolutely nothing for me. The music doesn't disappoint in any shape or form, it never did throughout Terrytoons' vast output. The lively character, lush and clever orchestration and how much it adds to the action helps give 'Who's Who in the Jungle' a little more energy that isn't there anywhere near. Well, actually the animation impresses as well, colourful, fluid, lovingly detailed.The purposefully annoying ape/Sourpuss and rhino scenes are agreed the best parts, generating some minor amusement.Unfortunately, that's where the praise ends. Occasional minor amusement aside, 'Who's Who in the Jungle' is severely devoid of laughs/humour. The gags are far too few in number and they generally are as stale as seedless grapes left in the fridge for too long and as old as decades old wallpaper. There is just a badly fatigued feel throughout, not just from being near-humourless but also from doing nothing fresh with such a done to death and quite repetitive premise and pacing that is the complete opposite (as far away from that as you can go) as energetic.Neither Gandy or Sourpuss work particularly well here and their chemistry, of which there is not enough of, fails to sparkle. Sourpuss at least has one nice bit but his personality has been far more interesting before and he has too little to work with. Gandy though is every bit as bland as he was in his late-30s solo outings, which is quite a major step backwards for a character that actually advanced by some bit paired with Sourpuss. Even the jungle characters don't engage very much and are not particularly memorable.In conclusion, very, very lacklustre and that's being fairly kind. 4/10",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Tom Morrison",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148143",
    "tt0148190",
    "tt0150275",
    "tt0147829",
    "tt0150865",
    "tt0151315",
    "tt0151565",
    "tt0148117",
    "tt0147188",
    "tt0152445",
    "tt0150974",
    "tt0148404"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}