{
  "imdbId": "tt0185244",
  "title": "Cosa de locos",
  "year": 1981,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cosa-de-locos-1981",
      "id": "cosa-de-locos-1981",
      "title": "Cosa De Locos(1981)",
      "description": "Cosa de locos  es una película de  Argentina  filmada en  Eastmancolor  dirigida por  Enrique Dawi  sobre el guion de  José Dominiani  que se estrenó el 16 de julio de 1981 y que tuvo como actores principales a  Palito Ortega ,  Carlos Balá ,  Luis Tasca  y  María Rosa Loiácono  (Wikipedia) Sinopsis Sin quererlo, un torpe representante de un actor famoso queda envuelto con una banda de mafiosos que quieren imponerle a una bailarina para una película Reparto Palito Ortega Carlos Balá Luis Tasca María Rosa Loiácono Vicente La Russa Alberto Irízar Esther Ferrando Juan Carlos de Seta Silvia Pérez Miguel Bosé Juan Alberto Mateyko Enzo Bai Lalo Fransen Rosalba Villar Miriam Cóppola Trío San Javier María Celeste Juan Marcelo Cuarteto Imperial Gustavo Garzón Antonio Ugo",
      "fileSize": 1409958211,
      "addedAt": "2026-01-07T00:07:51.625Z",
      "thumbnail": "https://archive.org/services/img/cosa-de-locos-1981",
      "language": "spa",
      "year": 1981,
      "collection": "feature_films",
      "downloads": 495
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 4.5,
    "imdbVotes": 24,
    "Genre": "Musical, Comedy",
    "Plot": "The genuine \"film maldit\" of its generation, this picture is a rare mixture of hidden social criticism and superb film-making. All centers around Mateyko's character, named \"Beto\", a sort of decadent dandy trapped between his mundane existence behind the counter of the family's grocery store, and his feverishly passion for the play \"Waiting for Godot\". One day a stranger enters the store, a guy named Godot (a miscast Carlos Balá), who immediately sees in Beto's worshiping an opportunity for quick cash and a hide-out from the infamous Argentine secret police. When Beto's father, an hilarious Luis Tasca, figure's Godot real intentions, he orchestrates an original way to torture the poor adventurer by the means of endless playback concerts by Miguel Bosé and Juan Marcelo. There's also a love interest portrayed by a Bovarian Silvia Perez, some slapstick by the regular Alberto Irizar -if Buster Keaton were a waiter, he would have been Alberto Irizar, and a unexpected ending with Palito Ortega playing a Dantesque Extermination Angel. Mike Rivas' score adds an element of tension, and Dawi's angles and use of chiaroscuro reminds the mannerism of Murnau. I hope this film get the recognition it deserves and gets DVD distribution in its original cut. There's a version regularly shown on South American TV where the initial and final reels are inverted.",
    "Director": "Enrique Dawi",
    "Writer": "José P. Dominiani",
    "Actors": "Palito Ortega, Carlos Balá, Enzo Bai",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0185434",
    "tt0185262",
    "tt0193109",
    "tt0175022",
    "tt0301947",
    "tt0200516",
    "tt0084290",
    "tt0178306",
    "tt0194738",
    "tt0085959",
    "tt0130103",
    "tt0183067"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.625Z"
}