{
  "imdbId": "tt0178335",
  "title": "Circe",
  "year": 1964,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/circe-1964",
      "id": "circe-1964",
      "title": "Circe( 1964)",
      "description": "Circe  es una película en blanco y negro de  Argentina  dirigida por  Manuel Antin  según su propio guion escrito en colaboración  Héctor Grossi  y  Julio Cortázar  sobre el cuento homónimo de Julio Cortázar que se estrenó el 30 de abril de 1964 y que tuvo como protagonistas a  Graciela Borges ,  Alberto Argibay ,  Walter Vidarte  y  Sergio Renán . (Wikipedia) Sinopsis La protagonista Delia (Graciela Borges), una jovencita de familia burguesa que vive con sus padres en un barrio de Buenos Aires, tuvo dos novios (Renán y Vidarte) que murieron (uno de un sincope y otro por suicidio). Su tercer novio (Argibay) trata de destruir la coraza de frialdad con que ella se protege o se esconde, pero fracasa Reparto Graciela Borges  …Delia Alberto Argibay Walter Vidarte Sergio Renán Lydia Lamaison Beatriz Matar Alberto Barcel Josefina Boneo Víctor Martucci Juan Carlos Lima Claudia Sánchez Raúl Aubel",
      "fileSize": 1170485164,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/circe-1964",
      "language": "spa",
      "year": 1964,
      "collection": "feature_films",
      "downloads": 103
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6.5,
    "imdbVotes": 79,
    "Genre": "Drama",
    "Plot": "About perverse sexual gratification in a repressed Catholic environment. Delia Mañara is notorious in her quarter of Buenos Aires for the mysterious deaths of two of her fiancés. She lives in a twilight world and gains most satisfaction through the exercise of power over others. It emerges that she killed the two men by poisoning them with the sweets she makes; when this fails with her third fiancé, he is freed from her fatal attraction by the knowledge.",
    "Director": "Manuel Antin",
    "Writer": "Manuel Antin, Julio Cortázar, Héctor Grossi",
    "Actors": "Graciela Borges, Raúl Aubel, Alberto Argibay",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0178638",
    "tt0178308",
    "tt0178333",
    "tt0069223",
    "tt0178643",
    "tt0201819",
    "tt0178850",
    "tt0189606",
    "tt0188011",
    "tt0200983",
    "tt0058604",
    "tt0057811"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.623Z"
}