{
  "imdbId": "tt0152639",
  "title": "Sultan Pepper",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/sultan-pepper-1934_202502",
      "id": "sultan-pepper-1934_202502",
      "title": "Sultan Pepper (1934)",
      "description": "The Little King tries to teach his dog some tricks to perform in honor of a visiting sultan and his harem, who are arriving at the castle for an evening of merriment and surprises. Watch on RetroFlix:  https://retroflix.org/sultan-pepper-1934/",
      "fileSize": 115436518,
      "addedAt": "2026-01-07T00:11:35.633Z",
      "thumbnail": "https://archive.org/services/img/sultan-pepper-1934_202502",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 48
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6,
    "imdbVotes": 69,
    "Genre": "Animation, Short",
    "Plot": "Who remembers \"The Little King\" from the comic strips? I do, but until I saw this, I had never seen him in a animated short (cartoon). I guess they made less than a dozen of these, with one of them being with Betty Boop.Some of the gags I enjoyed seeing included the king doing everything himself that he asked his dog to do, such as fetch a stick; an elephant's trunk turning into an escalator; the king serving dinner to the sultan via an auto-mat; the keyhole removed from the Sultan's bedroom after the Little King was trying to get a glimpse of the women in bedYou see some shocking things in these pre-code cartoons and several of them were in here. I'm referring to sex and violence. Our Little King couldn't wait to jump in the sack with the Sultan's harem! Yes, cartoons were monitored after 1934, such like the feature films.. If you want to see some of these pre-code cartoons, and a whole bunch of other 1930s and early 1940s ones, check out the DVD called \"150 Cartoon Classic\" by Mill Creek Entertainment.",
    "Director": "Vernon Stallings",
    "Writer": "Oscar E. Soglow",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0152236",
    "tt0024839",
    "tt0150013",
    "tt0148037",
    "tt0148132",
    "tt0025728",
    "tt0148318",
    "tt0025328",
    "tt0151147",
    "tt0148470",
    "tt0150523",
    "tt0151428"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:35.633Z"
}