{
  "imdbId": "tt0152201",
  "title": "Robin Hood",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/robin-hood-1933",
      "id": "robin-hood-1933",
      "title": "Robin Hood (1933)",
      "description": "Robin Hood is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/robin-hood-1933/",
      "fileSize": 30998654,
      "addedAt": "2026-01-07T00:10:30.755Z",
      "thumbnail": "https://archive.org/services/img/robin-hood-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 88
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.5,
    "imdbVotes": 14,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. 1933 was again a hit and miss year for Terrytoons. Like 'Jealous Lover' though, 'Robin Hood' is one of the best and above average ones. Actually it's pretty good. It does not blow the mind, but one has come to expect that from Terrytoons except that 'Robin Hood' has more to it than just Terrytoons completest sake.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Some of the backgrounds are detailed and ambitious enough and it's suitably elaborate. Synchronisation is pretty neat.There is, like the best Terrytoons, a natural and never unforced natural charm, there are amusing and sharp moments, it rarely gets dull and while the gags are standard they are fun and well-timed. The characters are good fun in personality.'Robin Hood' however is still, outside of the backgrounds (although it actually is one of the best-looking Terrytoons), a bit crude in the drawing.Story is not much of time at all and is very predictable when there is signs of one. A few of the gags are on the random side and it at times affect the cohesiveness. Overall, pretty good. 7/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150804",
    "tt0149817",
    "tt0150130",
    "tt0150382",
    "tt0150504",
    "tt0146721",
    "tt0150774",
    "tt0150820",
    "tt0151001",
    "tt0151046",
    "tt0151118",
    "tt0151217"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.755Z"
}