{
  "movieId": "tt0149387",
  "title": "Woodman, Spare That Tree",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/woodman-spare-that-tree-1942",
      "id": "woodman-spare-that-tree-1942",
      "title": "Woodman, Spare That Tree (1942)",
      "description": "The Fox, a lumberjack, sets off to chop down his daily tree. He decides on the Crow's but the Crow is determined to save his home. He tries appealing to the Fox's sympathies with poetry and singing but the Fox pays no heed. After agreeing to let the Crow move out his possessions first (getting the Fox crushed by an elevator and piano in the process), the Fox sets to work chopping the tree. The Crow removes the blade from his axe so the Fox then uses a saw which the Crow uses to propel the fox into orbit. Next he tries bashing down the tree with an elephant but the Crow scares the pachyderm away with a toy mouse. Finally, the Fox plans to crash a train into the tree but it turns out the tree is petrified (or is it?). Watch on RetroFlix:  https://retroflix.org/woodman-spare-that-tree-1942/",
      "fileSize": 187882586,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/woodman-spare-that-tree-1942",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 172
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 7,
    "imdbVotes": 49,
    "Genre": "Animation, Short, Comedy",
    "Plot": "The Fox, a lumberjack, sets off to chop down his daily tree. He decides on the Crow's but the Crow is determined to save his home. He tries appealing to the Fox's sympathies with poetry and singing but the Fox pays no heed. After agreeing to let the Crow move out his possessions first (getting the Fox crushed by an elevator and piano in the process), the Fox sets to work chopping the tree. The Crow removes the blade from his axe so the Fox then uses a saw which the Crow uses to propel the fox into orbit. Next he tries bashing down the tree with an elephant but the Crow scares the pachyderm away with a toy mouse. Finally, the Fox plans to crash a train into the tree but it turns out the tree is petrified (or is it?).",
    "Director": "Frank Tashlin, Bob Wickersham",
    "Writer": "Jack Cosgriff",
    "Actors": "Frank Graham",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148294",
    "tt0150118",
    "tt0034744",
    "tt0149268",
    "tt0147804",
    "tt0148623",
    "tt0147277",
    "tt0148922",
    "tt0149348",
    "tt10284276",
    "tt0147875",
    "tt0154346"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}