{
  "movieId": "tt0121587",
  "title": "Narcotic",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Narcotic_201902",
      "id": "Narcotic_201902",
      "title": "Narcotic",
      "description": "“There are few films like it” “Strange and disquieting” “Worth watching at least once” (IMDB reviews quotes). Early illicit drug use exploitation from the producer who would later give us the infamous “Reefer Madness.” It definitely is, as one reviewer commented, “strange and disquieting.” A fascinating curiosity. IMDB rating 3.9. Directed by Dwain Esper & Vival Sodar’t. Released in 1933. Complete print (minus a few missing frames). AKA “Narcotic Racket”  ",
      "fileSize": 615439282,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/Narcotic_201902",
      "collection": "feature_films",
      "downloads": 14439
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XpGSK3R6-ys",
      "id": "XpGSK3R6-ys",
      "title": "Narcotic (1933) PRE-CODE HOLLYWOOD",
      "description": "Stars: Harry Cording, Joan Dix, Patricia Farley\nDirector: Dwain Esper\n\nAs the opening scroll tells us, Narcotic was \"presented in the hope that the public may become aware of the terrific struggle to rid the world of drug addiction.\" The movie itself is a salacious plunge into a world of sordid pleasures.",
      "addedAt": "2025-12-26T23:56:05.705Z",
      "thumbnail": "https://i.ytimg.com/vi/XpGSK3R6-ys/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBzgWAAuADigIMCAAQARhlIGUoZTAP&rs=AOn4CLCpbvx5EmSue71WqLKHi6yB317h3w",
      "duration": 3436,
      "language": "en",
      "year": 1933,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "57 min",
    "imdbRating": 3.9,
    "imdbVotes": 452,
    "Genre": "Biography, Drama, Horror",
    "Plot": "As the opening scroll tells us, Narcotic was \"presented in the hope that the public may become aware of the terrific struggle to rid the world of drug addiction.\" The movie itself is a salacious plunge into a world of sordid pleasures. It tells us the story of Dr. William G. Davies, an infamous snake-oil salesman who started his career as a promising medical student. In the opening sequence he saves an unborn baby by performing a cesarean operation after the mother was killed in an automobile accident. Stock medical footage shows a woman's stomach being sliced open like a ripe watermelon and the baby popping out like a jack-in-a-box. But the allure of opium proves too strong for the doctor to resist. After a single night of relaxation in a Chinatown opium den, Davies becomes a slave to drugs. As his medical practice deteriorates, he shifts his attention to \"selling medicine by demonstration.\" He says to his nurse/fiancee, \"I can't see anything wrong if my preparation has merit.\" However, his \"preparation\" is one of the great quack cure-alls: \"Tiger-Fat.\" Davies soon becomes one of the leading sideshow attractions for a carnival. His success as a carnival huckster initially allows him to run with a fast crowd. In the movie's most shocking episode, Davies and his ritzy friends retire to a hotel room together for a drug party. \"We're gonna get lit,\" says a woman. A buffet of drugs is spread out on a table and each guest takes their drug of choice. \"It takes a needle for me to get a bang,\" says a woman. As each participant indulges, the party quickly turns into an orgy of excesses, one woman hikes up her skirts, another laughs hysterically, a man pontificates, another man becomes paranoid. The movie provides a litany of different reactions to drugs. Ultimately, Davies' drug addiction leaves him gaunt and stooped, living in a hovel with no hope of returning to his previous life.",
    "Director": "Dwain Esper, Vival Sodar't",
    "Writer": "A.J. Karnopp, Hildegarde Stadie",
    "Actors": "Harry Cording, Joan Dix, Patricia Farley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0024473",
    "tt0023888",
    "tt0024055",
    "tt0024727",
    "tt0023790",
    "tt0024538",
    "tt0024966",
    "tt0024962",
    "tt0025272",
    "tt0025391",
    "tt0023247",
    "tt0023583"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.464Z"
}