{
  "movieId": "tt0169088",
  "title": "Nothing Venture",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/nv8845354388",
      "id": "nv8845354388",
      "title": "Nothing Venture",
      "description": "Title: Nothing Venture Summary: Directed by: John Baxter Actors: Peter Artemus, Philip Artemus, Jackie Artemus Production Company: Elstree Independent Films Ltd. Release Date: 29 January 1948 (UK) Aspect Ratio: 1.37 : 1 Add Full Plot",
      "fileSize": 532377746,
      "addedAt": "2026-01-07T00:10:02.900Z",
      "thumbnail": "https://archive.org/services/img/nv8845354388",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 894
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "73 min",
    "imdbRating": 4.5,
    "imdbVotes": 25,
    "Genre": "Comedy, Family",
    "Plot": "Patric Curwen is writing an adventure story for boys, when the Artemus Boys come into his garden and ask what they are to do this time. He sends them to a Norman tower, where some one takes a shot at some one, Terry Randal's horse bolts and Michael Aldredge rescues them. Then they all go off on an adventure which involves mysterious spies, a horse race and a ray which can knock planes out of the sky -- with occasional mild asides to the audience about the subject at hand.Quite clearly, this was meant to be the sort of adventure story for boys that appeared in magazines for the period, in which adults put children into deadly danger with never a second thought, and the boys cleverly figure out things to thwart the baddie. Compared to movies like HUE AND CRY, which came out the same year, it is very silly, and not in a good sense. While it must have pleased its audience at the time, except for the cinematography of rural Sussex, it has not aged particularly well.This was the second of three movies starring the Artemus Boys. Aside from these, they seem to have vanished from history. At least, there's nothing else about them on Google.",
    "Director": "John Baxter",
    "Writer": "Geoffrey Orme",
    "Actors": "Peter Artemus, Philip Artemus, Jackie Artemus",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0040966",
    "tt0040068",
    "tt0040795",
    "tt0040679",
    "tt0039566",
    "tt0041514",
    "tt0041473",
    "tt0039292",
    "tt0038704",
    "tt0042524",
    "tt0049655",
    "tt0043255"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.900Z"
}