{
  "movieId": "tt0141101",
  "title": "The Foxy Pup",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-foxy-pup-1937",
      "id": "the-foxy-pup-1937",
      "title": "The Foxy Pup (1937)",
      "description": "The technicalities are topnotch, with some excellent Technicolor work, but this vaguely anti-foxhunting story has some basset pups winding up chasing a fox by accident, and one of them gets into all sorts of trouble when the fox captures him and takes him home to his kits in a sack. Watch on RetroFlix:  https://retroflix.org/the-foxy-pup-1937/",
      "fileSize": 199580271,
      "addedAt": "2026-01-07T00:11:57.687Z",
      "thumbnail": "https://archive.org/services/img/the-foxy-pup-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 121
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.1,
    "imdbVotes": 42,
    "Genre": "Animation, Short",
    "Plot": "Ub Iwerks bounced around various cartoon factories after he lost the backing for his own studio in 1936, including stints at Schlesinger, Fleischer and even a year spent in Britain. None of his works were particularly distinguished, but were aimed at small children with frequently cloying sentimentality in the script and artwork to match. This is another of those efforts. The technicalities are topnotch, with some excellent Technicolor work, but this vaguely anti-foxhunting story has some basset pups winding up chasing a fox by accident, and one of them gets into all sorts of trouble when the fox captures him and takes him home to his kits in a sack.Eventually Iwerks went back to Disney and wound up in the back room, working on technical matters. I suspect he was sadder but wiser by then, like the basset pup here.",
    "Director": "Ub Iwerks",
    "Writer": "Ub Iwerks",
    "Actors": "Mel Blanc, Robert Winkler",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029421",
    "tt0029432",
    "tt0141169",
    "tt0141108",
    "tt0140921",
    "tt0141652",
    "tt0141136",
    "tt0141600",
    "tt0141831",
    "tt0140855",
    "tt0141992",
    "tt0181010"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.687Z"
}