{
  "movieId": "tt0148568",
  "title": "Out Again, in Again",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/out-again-in-again-1948",
      "id": "out-again-in-again-1948",
      "title": "Out Again, in Again (1948)",
      "description": "A few weeks before this epic was released, the two magpies had starred in 'Free Enterprise', a cartoon that ended with them both in prison. 'Out Again, in Again' begins like the latest chapter of a serial in progress, with a nasal-voiced narrator informing the audience that \"in our last episode\" Heckle and Jeckle were in prison, and then picking up the action from there. Watch on RetroFlix:  https://retroflix.org/out-again-in-again-1948/",
      "fileSize": 35980469,
      "addedAt": "2026-01-07T00:10:12.693Z",
      "thumbnail": "https://archive.org/services/img/out-again-in-again-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 71
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.3,
    "imdbVotes": 16,
    "Genre": "Animation, Short",
    "Plot": "'Out Again, in Again' is one of the funniest Heckle &amp; Jeckle cartoons. This toon begins in a surprising way. A few weeks before this epic was released, the two magpies had starred in 'Free Enterprise', a cartoon that ended with them both in prison. 'Out Again, in Again' begins like the latest chapter of a serial in progress, with a nasal-voiced narrator informing the audience that \"in our last episode\" Heckle and Jeckle were in prison, and then picking up the action from there. So 'Out Again, in Again' is explicitly a sequel to 'Free Enterprise'.The magpies were strongly influenced by the Marx Brothers, and they just occasionally acknowledged that debt ... as in their cartoon 'King Tut's Tomb', which features a brief appearance by a cartoon version of Harpo Marx. Here in 'Out Again, in Again', when the two boids break out of bird, they hide out aboard a moving train, on which they disguise themselves as Groucho and Harpo. Heckle does a devastating vocal impression of Groucho, getting off a couple of wisecracks that are worthy of Groucho himself. It's a shame that the voice artist who did this impersonation is uncredited.The gags are fast, funny and unexpected in 'Out Again, in Again'. My only complaint is that the toon's title gives away the ending. My rating: 10 out of 10.",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148929",
    "tt0148223",
    "tt0149234",
    "tt0147966",
    "tt0150232",
    "tt0150596",
    "tt0148292",
    "tt0151420",
    "tt0149160",
    "tt0149621",
    "tt0153196",
    "tt0149313"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.693Z"
}