{
  "imdbId": "tt0148144",
  "title": "Fishing by the Sea",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/fishing-by-the-sea-1947",
      "id": "fishing-by-the-sea-1947",
      "title": "Fishing by the Sea (1947)",
      "description": "Dimwit the hound is going fishing. Heckle and Jeckle are roommates in this one, sharing a single large birdhouse. They taunt Dimwit for no particular reason, then try to steal his catch of fish. Watch on RetroFlix:  https://retroflix.org/fishing-by-the-sea-1947/",
      "fileSize": 37073661,
      "addedAt": "2026-01-07T00:08:24.395Z",
      "thumbnail": "https://archive.org/services/img/fishing-by-the-sea-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 76
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "6 min",
    "imdbRating": 5,
    "imdbVotes": 26,
    "Genre": "Animation, Short",
    "Plot": "After having a couple of cartoons where Heckle and Jeckle are the rootable ones, meaning 'The Intruders' and particularly 'Flying South', they are back to the more malicious characters seen in their first three cartoons in 'Fishing by the Sea'. It is great to have Dimwit back after making a good impression in his previous outings, with the series back to having an opponent that is the one that one feels sorry for rather than the more antagonistic ones of the previous two cartoons.1947's 'Fishing by the Sea' is not one of the best Heckle and Jeckle cartoons, with there being more inspired ones in the series. It's not one of the funniest or one with the highest number of gags, but the character interaction is still great, enough of the material entertains, the conflict is believable and the characters carry the cartoon very well indeed. While it may not be my definition of a great cartoon, 'Fishing by the Sea' is worth seeing and somewhere in the high middle ranking the 1947 Terrytoons batch.Like most of the Heckle and Jeckle cartoons, the story is nothing special. If anybody has seen the stories for the previous Dimwit versus the magpie outings, the story here is very similar to them other than the setting. Which doesn't make the cartoon feel very fresh, only one part comes over as different to usual. It does start off a little bland and tame, with the premise taking some getting used to at first.Do agree that the voice acting is somewhat off here, as well as quite odd (it was fine in their previous outings), and despite 'Fishing by the Sea' being actually the sixth Heckle and Jeckle cartoon it was like Dayton Allen (the credited voice actor) had not found his groove or was experimenting. So too much of a debut cartoon feel, which was not the cases and their debut cartoon 'The Uninvited Pests' is actually a superior cartoon, especially with Jeckle.However, 'Fishing by the Sea' is a long way from a bad cartoon. The opposite, and there are a lot of things done well. The animation is fine. Vibrant colours, nice attention to detail, far from static or simplistic backgrounds, the drawing is so much smoother than when the studio first started and the transitions are much more fluid and less choppy, nowhere near as much recycling or cutting corners either. The music never disappointed with Terrytoons, always the best asset of their worst efforts and it is one of the best things here still. Actually would go as far to say that it's even better than the animation. It is so lovely to listen to and there is such an uplifting vibe hearing it because of the snappy character it has.We are far from gag deprived in 'Fishing by the Sea', and they are mostly very well timed with a good deal of energy and range from very amusing to hilarious without getting too corny. While not having the same amount of energy as the previous Heckle and Jeckle cartoon the energy is still there and it increased the more anarchic things got. The ending is the most original part and felt very satisfying. Although the story is flawed, the character interaction is great as is the energy. Despite the patchy voice acting, Heckle and Jeckle are a lot of fun as characters and Dimwit not only takes the butt of the laughs well he is well worth rooting for.Overall, good fun if not great. 7/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Sid Raymond",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148252",
    "tt0161889",
    "tt0151420",
    "tt0150546",
    "tt0147966",
    "tt0150232",
    "tt0151560",
    "tt0148292",
    "tt0148929",
    "tt0148172",
    "tt0148223",
    "tt0148343"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.395Z"
}