{
  "movieId": "tt0151217",
  "title": "King Zilch",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/king-zilch-1933",
      "id": "king-zilch-1933",
      "title": "King Zilch (1933)",
      "description": "Exceedingly bizarre cartoon with the second appearance of the title character. Watch on RetroFlix:  https://retroflix.org/king-zilch-1933/",
      "fileSize": 31924082,
      "addedAt": "2026-01-07T00:09:24.700Z",
      "thumbnail": "https://archive.org/services/img/king-zilch-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 41
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.2,
    "imdbVotes": 23,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1933 was again a hit and miss year for Terrytoons. 'King Zilch' may not be great but it is one of the best of the batch. It's mainly to be seen as part of a Terrytoons completest quest, which is happening with me at the moment, but has a little more to it than that (something that one doesn't say about a fair share of Terrytoons) if not warranting of repeat viewings.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. For Terrytoons, 'King Zilch' is one of their best-looking cartoons, the backgrounds have nearly always been well done at this point and they show signs of detail and ambition here, among their most elaborate ever in fact.'King Zilch' never feels forced in its charm, there are some of the series' most amusing and surprisingly ahead of their time gags, pacing is energetic and the characters are pretty colourful and entertaining to watch.On the other hand, the character designs are crude and the looping is excessively used and looks cheap.Story is flimsy at best, at times stale and is pretty predictable. To give less of a choppy feel to some of the structure, a minute longer or so would have helped even if only by a little. The ending is somewhat strange.In summary, decent and above average. 6/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150804",
    "tt0149817",
    "tt0150130",
    "tt0150382",
    "tt0150504",
    "tt0146721",
    "tt0150774",
    "tt0150820",
    "tt0151001",
    "tt0151046",
    "tt0151118",
    "tt0151353"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.700Z"
}