{
  "imdbId": "tt0151560",
  "title": "Mighty Mouse Meets Deadeye Dick",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/mighty-mouse-meets-deadeye-dick-1947",
      "title": "Mighty Mouse Meets Deadeye Dick (1947)",
      "description": "Classic satire on the Western genre, with the sheriff fighting the bad guy. Then a mysterious stranger enters. It's Mighty Mouse! Watch on RetroFlix:  https://retroflix.org/mighty-mouse-meets-deadeye-dick-1947/",
      "fileSize": 37161221,
      "id": "mighty-mouse-meets-deadeye-dick-1947"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 7.4,
    "imdbVotes": 58,
    "Genre": "Animation, Short",
    "Plot": "Will admit to not being the mightiest of fans of Mighty Mouse, pleasant enough if limited and not always used very well. His cartoons, 80 between 1942 and 1961 (though he was first named Super Mouse for the first seven, until 'The Lion and the Mouse'), were quite mixed and followed a formula that tended to be on the repetitive side. Some were pretty good, others were very weak. Most of them were in between of those, mostly of the watchable but average distinction.'Mighty Mouse Meets Deadeye Dick' is a little above that and is definitely worth seeing, but it is not an essential. Terrytoons and Mighty Mouse did a lot worse, but there were better on both counts too. As far as the 1947 Terrytoons cartoons go, this is neither one of the best or one of the worst. Something of a somewhere in the middle sort of effort, and it would have been a better cartoon if it wasn't too closely indebted to 'Mighty Mouse Meets Bad Bill Bunion' structurally and in conflict.A lot of things are done well. Best asset as ever is the music, which is its usual lush and characterful self. Also excelling in enhancing everything going on between the cats and mice. The animation is equally great in quality, especially the backgrounds and landscapes, though the colours are also very attractive and never drab or garish. Mighty Mouse and Deadeye work well together and it is interesting seeing him interact with humans in alternative to cats and mice, why not a change in the formula once in a while.While nothing is completely hilarious, there are gags that are amusing. Including the likes of how wolves react to a very attractive lady mouse, a very overused trope but somewhat effective and understandable. There is a good deal of energy here and the conflict has tension, thanks to Deadeye himself being a suitably formidable opponent though with good comic timing, and the first half generates some suspense.On the other hand, there are shortcomings and big ones. Story-wise it is not particularly surprising, having seen elements of what happens before a good deal, and the ending can be smelt from miles off being a typical sort of Mighty Mouse cartoon ending. The final third may have some excitement but not all the gags come off, being quite corny, and it felt a little disconnected from the rest of the cartoon.It did feel that Deadeye was the lead character here and Mighty Mouse was plot-device supporting when really it should have been the other way around in my view, at least he feels necessary though here. That was something that quite a fair few Mighty Mouse cartoons made the mistake of doing. Mighty Mouse's character design can be a little inconsistent in size.Summing up, above average but not great. 6/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0150837",
      "title": "The Hard Boiled Egg",
      "year": 1948,
      "imdbRating": 5.6,
      "imdbVotes": 14,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151145",
      "title": "The Johnstown Flood",
      "year": 1946,
      "imdbRating": 6.8,
      "imdbVotes": 68,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153913",
      "title": "The Wooden Indian",
      "year": 1948,
      "imdbRating": 4,
      "imdbVotes": 17,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153316",
      "title": "A Truckload of Trouble",
      "year": 1949,
      "imdbRating": 4.7,
      "imdbVotes": 12,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151566",
      "title": "Mighty Mouse in Krakatoa",
      "year": 1945,
      "imdbRating": 7.6,
      "imdbVotes": 90,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151880",
      "title": "Paint Pot Symphony",
      "year": 1949,
      "imdbRating": 6.1,
      "imdbVotes": 20,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152134",
      "title": "Raiding the Raiders",
      "year": 1945,
      "imdbRating": 5.5,
      "imdbVotes": 31,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152484",
      "title": "Smoky Joe",
      "year": 1945,
      "imdbRating": 5.2,
      "imdbVotes": 17,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152787",
      "title": "Swooning the Swooners",
      "year": 1945,
      "imdbRating": 7.5,
      "imdbVotes": 35,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150546",
      "title": "A Fight to the Finish",
      "year": 1947,
      "imdbRating": 6.4,
      "imdbVotes": 40,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147966",
      "title": "Cat Trouble",
      "year": 1947,
      "imdbRating": 5.6,
      "imdbVotes": 19,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150232",
      "title": "Crying Wolf",
      "year": 1947,
      "imdbRating": 6.3,
      "imdbVotes": 32,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.327Z"
}