{
  "imdbId": "tt0174450",
  "title": "Africa Speaks!",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/africa_speaks",
      "title": "Africa Speaks",
      "id": "africa_speaks"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GU4mOWTcuKA",
      "title": "Africa Speaks! (1930) | Colorized Public Domain Documentary Adventure Classic Restored in HD",
      "description": "Africa Speaks! (1930) is an American documentary-adventure film directed by Walter Futter, produced during an era when Western audiences were captivated by cinematic explorations of the “exotic” world. This restored and colorized public domain classic presents the groundbreaking footage shot by explorer Paul L. Hoefler during his 1928–1929 expedition through Africa. Combining authentic wildlife encounters, tribal rituals, and staged sequences typical of early ethnographic filmmaking, this film stands as a vivid historical artifact of early 20th-century documentary cinema. The colorized edition enhances the experience for modern audiences while retaining its cultural and historical context.\n\nPlot Summary:\nAfrica Speaks! follows the journey of African expedition leader Paul L. Hoefler and his crew as they traverse thousands of miles across the African continent, from the deserts to the jungles, capturing encounters with both wildlife and indigenous peoples. The film is presented with dramatic narration that reflects the attitudes of its time — emphasizing both awe and sensationalism. Viewers witness scenes of wild animal hunts, interactions with native tribes, and depictions of African landscapes rarely seen by Western audiences in 1930. While some scenes were genuinely filmed on location, others were staged or dramatized in Hollywood, blending fact and fiction in a style typical of early travel documentaries. The result is a film that fascinated Depression-era audiences while also revealing the complex, and sometimes problematic, perspectives of colonial-era filmmaking.\n\nCast and Crew:\n• Director: Walter Futter\n• Producer: Walter Futter\n• Cinematography: Paul L. Hoefler\n• Narration: Lowell Thomas (uncredited voice-over narration)\n• Editor: Paul L. Hoefler\n• Production Company: Walter Futter Productions\n• Distributor: Educational Film Exchanges, Inc.\n\nFilm Significance:\nAfrica Speaks! holds a unique place in cinema history as one of the first full-length documentary films about Africa produced for American audiences. It predates later ethnographic and wildlife documentaries by decades, combining travelogue, adventure, and pseudo-scientific spectacle. Though controversial by modern standards for its colonial perspective, it remains an essential cultural record of early sound-era filmmaking, technological ambition, and public fascination with exploration. For historians and film enthusiasts, it offers insight into the evolution of documentary ethics, editing, and narrative construction. For audiences aged 55–64 in the USA and Europe, it also provides a nostalgic look at the early sound era when filmmaking innovation collided with global curiosity.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Africa Speaks! remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1930 version of Africa Speaks! was filmed in black and white and released during the early sound film era. This colorized edition revitalizes its striking imagery — from landscapes to wildlife — while preserving the historical authenticity of the footage. Modern audiences, especially those watching on large-screen TVs, will experience this early documentary with greater clarity, depth, and vibrancy. The film serves as both a thrilling adventure and an important visual time capsule, showing how early 20th-century filmmakers sought to document and dramatize cultures far from the Western world. By adding color, this edition bridges the gap between historical preservation and modern visual engagement, appealing to viewers in the USA, Europe, and other first-world regions with strong interest in classic cinema and world history.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten B-movies to culturally significant classics. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#AfricaSpeaks #1930Documentary #PublicDomainMovie #ColorizedClassic #VintageAdventure #ClassicCinema #WildlifeDocumentary #EarlySoundFilm #GoldenAgeHollywood #FilmRestoration",
      "id": "GU4mOWTcuKA",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MD3vHETLlEM",
      "title": "Africa Speaks! (1930) JUNGLE ADVENTURE",
      "description": "Stars: Harald Austin, Paul L. Hoefler, Lowell Thomas\nWriter/Director: Walter Futter\n\nExplorer Paul Hoefler leads a safari into central Africa and what was then called the Belgian Congo, in the regions inhabited by the Wassara and the famous Ubangi tribes.",
      "id": "MD3vHETLlEM",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "75 min",
    "imdbRating": "5.1",
    "imdbVotes": "143",
    "Genre": "Documentary, Adventure, History",
    "Plot": "Hear the hoof-beats of the gnus and see a young boy chased down and killed by a lion (sans the screams)was what \"Africa Speaks!\" promised, and delivered. Filmed on the Colorado African Expedition of 1928, headed by Paul L. Hoefler, this film rose above the 'jungle-graph' films of the past---\"Chang\" excepted---because of the sound and not the views of the Dark Continent offered, albeit most of these were new views that some of the critics debated over whether or not some of them were staged. It contained: a locust swarm that devoured everything but the expedition camera; a visit to the duck-billed pygmy tribe in which the females of the tribe had discs inserted beneath their lips when very young and, as they grow older, larger discs replace the previous discs; an antelope---called and spelled illampa in the film---that jumps forty feet backward or forward when frightened and some slow-motion shots are used. \"Africa Speaks!\" showed Africa to be both dangerous and noisy.",
    "Director": "Walter Futter",
    "Writer": "Walter Futter",
    "Actors": "Harald Austin, Paul L. Hoefler, Lowell Thomas",
    "Language": "English, French",
    "Country": "United States, France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0219671",
      "title": "The Epic of Everest",
      "year": 1924,
      "imdbRating": "7.6",
      "imdbVotes": "683",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020030",
      "title": "The Iron Mask",
      "year": 1929,
      "imdbRating": "7.0",
      "imdbVotes": "1,491",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019639",
      "title": "Andreas Hofer",
      "year": 1929,
      "imdbRating": "3.6",
      "imdbVotes": "18",
      "language": "None, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0250464",
      "title": "Kastus Kalinovskiy",
      "year": 1928,
      "imdbRating": "7.1",
      "imdbVotes": "30",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0019532",
      "title": "The Viking",
      "year": 1928,
      "imdbRating": "6.6",
      "imdbVotes": "468",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017743",
      "title": "Chang: A Drama of the Wilderness",
      "year": 1927,
      "imdbRating": "6.9",
      "imdbVotes": "1,152",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017667",
      "title": "The Beloved Rogue",
      "year": 1927,
      "imdbRating": "7.0",
      "imdbVotes": "887",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1268864",
      "title": "The Blonde Captive",
      "year": 1931,
      "imdbRating": "4.4",
      "imdbVotes": "85",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0247568",
      "title": "Nazi Concentration and Prison Camps",
      "year": 1945,
      "imdbRating": "8.3",
      "imdbVotes": "1,690",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0059529",
      "title": "Triumph Over Violence",
      "year": 1965,
      "imdbRating": "8.1",
      "imdbVotes": "2,137",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0021576",
      "title": "À Propos de Nice",
      "year": 1930,
      "imdbRating": "7.4",
      "imdbVotes": "4,591",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1475191",
      "title": "American Radical: The Trials of Norman Finkelstein",
      "year": 2009,
      "imdbRating": "7.8",
      "imdbVotes": "833",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:37:34.942Z"
}