{
  "imdbId": "tt0150028",
  "title": "Canadian Capers",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/canadian-capers-1931",
      "id": "canadian-capers-1931",
      "title": "Canadian Capers (1931)",
      "description": "“Canadian Capers” was produced by Terrytoons and released on August 23, 1931. It was directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/canadian-capers-1931/",
      "fileSize": 24123826,
      "addedAt": "2026-01-07T00:07:45.166Z",
      "thumbnail": "https://archive.org/services/img/canadian-capers-1931",
      "language": "eng",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 49
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.9,
    "imdbVotes": 18,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. 'Canadian Capers' is another 1931 Terrytoon that is decent and worth watching but doesn't blow the mind. Its main reason is mainly for anybody striving to see every Terrytoons available like me. Again though that is not the sole reason, there is much more to 'Canadian Capers' than that. It does start off very bland with too few gags with very little to them, let alone funny or imaginative, and a lack of energy. Story is slight and derivative and budget costs are evident in some less than great, or even good, animation. It's too crude and too simple, even the backgrounds have been more detailed before and since.Farmer Al Falfa however is an amusing lead and the animal characters are neither annoying or personality deprived. The chemistry between the characters is also fun. Once 'Canadian Capers' gets going, the gags increase in quantity and are fun and well-timed. Pace-wise, the cartoon is lively and it's naturally charming throughout with some neat synchronisation and some witty drawing here and there.Best component is the music, not surprising as it was true for all of Terrytoons' output, which is outstanding. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Overall, not mind-blowing but decent fun. 7/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0161222",
    "tt0150155",
    "tt0151114",
    "tt0151129",
    "tt0147211",
    "tt0146681",
    "tt0149979",
    "tt0149980",
    "tt0149991",
    "tt0150160",
    "tt0150161",
    "tt0150165"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.166Z"
}