{
  "movieId": "tt0146537",
  "title": "Carmen's Veranda",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/carmens-veranda-1944",
      "id": "carmens-veranda-1944",
      "title": "Carmen's Veranda (1944)",
      "description": "A Terrytoons cartoon released 28 July 1944. In this spoof of opera, a sexy senorita seeks after her love and rescues him from an evil king (Sourpuss). Her knight in shining armor is none other than Gandy Goose (as Tyrone the Hero). Watch on RetroFlix:  https://retroflix.org/carmens-veranda-1944/",
      "fileSize": 38313356,
      "addedAt": "2026-01-07T00:07:45.166Z",
      "thumbnail": "https://archive.org/services/img/carmens-veranda-1944",
      "language": "eng",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 95
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 7.3,
    "imdbVotes": 35,
    "Genre": "Animation, Comedy, Short",
    "Plot": "Terrytoons never were properly consistent. Very seldom awful, apart from very early on when the quality was much lower in a cheap way and some of the later output, but very rarely was it great, the best of Heckle and Jeckle coming closest in this regard, either. Most of their output ranges between mediocre and pretty good/decent, with all their output from individual years being hit and miss but generally watchable.1944 was not an exception to this, none of the individual years really were exempt. It was mostly one of Terrytoons' better years though and was a relatively big year for the Mighty Mouse series. Even though still inconsistent, there were improvements in a couple of respects. 'Carmen's Veranda' to me is one of Terrytoons' better 1944 cartoons. The premise is familiar melodrama territory, for Terrytoons and animation in general, but it was intriguing to see Gandy not being partnered with Sourpuss, that it is not a cartoon set in an army setting and that is in a different kind of role for him.As said, the story is familiar with not an awful lot new. The outcome is never really in doubt, being a fairly typical ending for the Terrytoons cartoons that go the melodrama route. Though yes it is the opposite of most endings in opera.Usually in Terrytoons' melodrama-type cartoons, the villain tends to be the most interesting character. Count Dodo is surprisingly an exception, he doesn't do much different than all the other archetypal villains in this type of cartoon and he didn't seem either threatening or amusing that much. Gandy and Carmen stick in the mind more.It was great, coming onto the good things, to see Gandy in a solo role but a different type of solo role (he's pretty against type here). He fills it well and one can pleasantly see how after being paired with Sourpuss for a while how far he's come on since the late 30s, found him bland at that point, not here. The most memorable character though is sultry Carmen and despite bow it sounds their chemistry/relationship does make sense.The music again is outstanding, lush, full of character and adds so much to the action. It is also like its own character and the main reason actually as to why 'Carmen's Veranda' works so well. The animation is another great asset, the drawing has so much more finesse and neatness than Terrytoons in the 30s, the backgrounds have become richer in detail over time and the colours are very easy on the eye. There are more gags than most other Terrytoons cartoons and they are all amusing and more, one of the funnier Terrytoons cartoons of the early 40s to me. There is a lot of charm too and a wonderful strangeness at times. The pace is suitably lively.On the whole, more than decent and one of Gandy's better overall cartoons and certainly one of his solo efforts. 7/10",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Isadore Klein, Tom Morrison",
    "Actors": "Roy Halee",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0146300",
    "tt0153889",
    "tt0150625",
    "tt0151306",
    "tt0151525",
    "tt0147871",
    "tt0148468",
    "tt0152465",
    "tt0150437",
    "tt0153808",
    "tt0148158",
    "tt0148204"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.166Z"
}