{
  "movieId": "tt0150122",
  "title": "Chris Columbo",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/chris-columbo-1938",
      "id": "chris-columbo-1938",
      "title": "Chris Columbo (1938)",
      "description": "A fun, tune-filled retelling of the legendary Christopher Columbus telling of  the world being round, and going on his ocean voyage. Watch on RetroFlix: https://retroflix.org/chris-columbo-1938/",
      "fileSize": 34250407,
      "addedAt": "2026-01-07T00:07:51.622Z",
      "thumbnail": "https://archive.org/services/img/chris-columbo-1938",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 178
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.4,
    "imdbVotes": 21,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1938, like all the other years for Terrytoons, saw a hit and miss batch. Of which 'Chris Columbo' is one of the low middle ones ranking it in correlation with the rest of the Terrytoons, and one of the lesser ones of the 1938 batch. It is an unexceptional, nothing exactly special and somewhat lacklustre cartoon and has the same amount of problems as it has the amount of strengths. Completest sake is the main reason to see it.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds in places is still great to see and some synchronisation is neat.A little charm here and there and the occasional mildly amusing touch.Transitions in the animation are still a bit crude and lacking in smoothness and the lack of finesse shows in some of the drawing too, even though generally the quality in comparison to previous years has improved.Likewise, the story is paper thin and formulaic, a familiar story with very over-familiar execution. It's also pretty dull, due to a lot of padding and not enough content. None of the characters are memorable let alone particularly funny or endearing, the conflict is stale and parts try too hard to be cute.Gags are scarce, or at least nowhere near enough, and what there is is nothing to write home about, too much of it is very stale. The charm isn't enough either, neither is the tension, and some of it is structured in a choppy manner. Too much is too saccharine like at the start.All in all, mediocre. 4/10 Bethany Cox",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Donald McKee, Tom Morrison",
    "Actors": "Roy Halee",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0161729",
    "tt0150895",
    "tt0150981",
    "tt0147063",
    "tt0161333",
    "tt0148308",
    "tt0159281",
    "tt0150361",
    "tt0150841",
    "tt0150983",
    "tt0151994",
    "tt0161998"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.622Z"
}