{
  "imdbId": "tt0197551",
  "title": "Historia de crímenes",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/historia-de-crimenes-1942",
      "title": "Historia De Crimenes (1942)",
      "description": "Historia de crímenes  es una película argentina estrenada el 9 de noviembre de 1942, con dirección y guion de  Manuel Romero  y que tuvo como protagonistas principales a  Narciso Ibáñez Menta ,  Zully Moreno ,  Severo Fernández ,  Nury Montsé  y  Osvaldo Miranda . Se trata de una película de suspense que narra la historia de un banquero que comete una serie de crímenes (Wikipedia) Sinopsis Al conocer a Lucy Torres, una bailarina del teatro de revistas, el banquero Enrique Mendel, soltero de edad mediana, comienza a dilapidar la fortuna que él administra como tutor de su sobrina de 19 años que vive con él y a descuidar los negocios al punto tal que comienzan a correr rumores de insolvencia. María, la empleada doméstica que vive con ellos desde hace muchos años sospecha lo que está sucediendo y le advierte que si no cambia convencerá a su sobrina, que está ignorante de la situación, que tome una acción. Mendel propone a Lucy que huyan juntos pero ella se niega. Entonces mata a María aparentando un accidente y luego se lo revela a Lucy advirtiéndole que si lo denuncia dirá que el crimen lo cometieron entre los dos. La muerte de María hace postergar el casamiento de su sobrina con su novio, que es el gerente del Banco administrado por Mendel y con ello se dilata la rendición de cuentas que debe efectuar y que revelará sus maniobras. Tres meses después su sobrina y Ricardo, su novio, deciden realizar su casamiento y Mendel no manifiesta objeciones pero altera los libros del Banco de manera tal que parezca que las maniobras fraudulentas las realizó Ricardo. Una semana antes del casamiento consigue con amenazas que Lucy con pretextos obtenga que Ricardo la espere en el Banco después de la hora de cierre. En lugar de Lucy va Mendel y mata a Ricardo simulando un suicidio que luego la policía vincula con los desfalcos que surgen de los libros. Gervasio, un antiguo empleado del Banco adicto a las novelas policiales, era quien había pasado a Ricardo el llamado de Lucy, por lo cual acude a contarlo a la policía, sin embargo cuando la policía interroga a Lucy ella a instancias de Mendel niega que hubiera tenido una cita con Ricardo. La muerte de Ricardo trastorna a su sobrina que cae en un estado de nerviosismo que le dificulta dormir. Gervasio aprovechando que conoce a la sobrina la visita y la incita a que vea a Lucy. Cuando lo hace ésta reconoce que tenía la cita con Ricardo pero le hace jurar que no se lo dirá a nadie porque peligran sus vidas. La sobrina se lo cuenta a Gervasio y por consejo de este le pide a Mendel que en 48 horas haga la rendición de cuentas. El banquero visita a Lucy y le dice que eliminará a su sobrina y que ella nada puede hacer para evitarlo porque está comprometida con los otros dos crímenes. Para cumplir su propósito, sin que nadie lo advierta eleva a un nivel mortal la dosis de la medicina que la empleada le da a su sobrina para dormir y a la mañana siguiente se marcha al Banco como de costumbre. En tanto Lucy, asustada, acude a la policía con Gervasio y relata todo lo ocurrido, por lo que al día siguiente todos van a la casa de Mendel. Llegan cuando el mismo ya se había ido pero justo a tiempo para salvar a su sobrina. Como no hay pruebas de la autoría de los crímenes hacen que Lucy acuda al escritorio de Mendel y le exija dinero. Mientras conversan le hace reconocer sus delitos, lo que era escuchado mediante un micrófono por la policía que entra en el escritorio justo a tiempo para impedir que mate a Lucy. Pese a que no reconoció sus crímenes, Mendel es condenado y, sabiendo que padece una enfermedad que pronto ocasionará su muerte pide hacer una confesión delante del juez y todos los interesados. Había planificado matar a Lucy al terminar su relato pero Gervasio se lo impide, con lo que termina la película. Reparto Intervinieron en el filme los siguientes intérpretes: 1 ​ Narciso Ibáñez Menta  ... Enrique Mendel Zully Moreno  ... Lucy Torres Severo Fernández  ... Gervasio Nuri Montsé  ... Esther Osvaldo Miranda  ... Pedro Alfredo Jordán  ... Ricardo María Esther Buschiazzo  ... María Bernardo Perrone  ... Inspector de policía Amalia Bernabé  ... Mucama Mecha Corbo  ... Encargada de la pensión Elvira Remet  ... Amiga de Lucy Torres Jorge Villoldo  ... Portero del teatro. Sarita Armas Antonia González Rafael Diserio",
      "fileSize": 1033626155,
      "id": "historia-de-crimenes-1942"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "94 min",
    "imdbRating": 7.9,
    "imdbVotes": 24,
    "Genre": "Thriller",
    "Plot": "The crimes of a banker who turned a sudden passion for a woman into a motive for horrible crimes, the execution of which he meets with incredible cynicism.",
    "Director": "Manuel Romero",
    "Writer": "Manuel Romero",
    "Actors": "Narciso Ibáñez Menta, Zully Moreno, Severo Fernández",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0197651",
      "title": "Una luz en la ventana",
      "year": 1942,
      "imdbRating": 6.1,
      "imdbVotes": 57,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0316747",
      "title": "El tesoro de la isla Maciel",
      "year": 1941,
      "imdbVotes": 11,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0197681",
      "title": "Mi amor eres tú",
      "year": 1941,
      "imdbVotes": 13,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0121570",
      "title": "Morir en su ley",
      "year": 1949,
      "imdbRating": 5.9,
      "imdbVotes": 19,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0197446",
      "title": "El fabricante de estrellas",
      "year": 1943,
      "imdbRating": 6.2,
      "imdbVotes": 10,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0178995",
      "title": "Yo quiero ser bataclana",
      "year": 1941,
      "imdbRating": 7.4,
      "imdbVotes": 39,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0032309",
      "title": "Carnaval de antaño",
      "year": 1940,
      "imdbRating": 6.2,
      "imdbVotes": 27,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0178307",
      "title": "Casamiento en Buenos Aires",
      "year": 1940,
      "imdbRating": 6.5,
      "imdbVotes": 33,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0197541",
      "title": "Hay que casar a Paulina",
      "year": 1944,
      "imdbRating": 6.8,
      "imdbVotes": 15,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0197593",
      "title": "Isabelita",
      "year": 1940,
      "imdbRating": 7.9,
      "imdbVotes": 49,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0178724",
      "title": "Luna de miel en Río",
      "year": 1940,
      "imdbRating": 7.4,
      "imdbVotes": 21,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0034521",
      "title": "Black Dragons",
      "year": 1942,
      "imdbRating": 4.3,
      "imdbVotes": 1324,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.612Z"
}