{
  "imdbId": "tt0148201",
  "title": "Galloping Fanny",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/galloping-fanny-1933",
      "id": "galloping-fanny-1933",
      "title": "Galloping Fanny (1933)",
      "description": "Cubby The Bear is a jockey and prepares to race.... Watch on RetroFlix:  https://retroflix.org/galloping-fanny-1933/",
      "fileSize": 171906596,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/galloping-fanny-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 48
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.4,
    "imdbVotes": 27,
    "Genre": "Animation, Short",
    "Plot": "Van Bueren Studios' Cubby the Bear series comprised of just 19 (not the 17 as initially thought, having worked from an incomplete list listing the cartoons) cartoons made between 1933-1934. As much as it pains me to say it, speaking as a big animation fan, it is not hard to see why the character and the series weren't so popular and didn't last long.Despite my love for animation, there are a few above mediocre Cubby cartoons but sadly 'Galloping Fanny' isn't one of them. There are a few salvageable elements. The best thing about it, and this is true of a lot of Van Bueren's output, is the music score. It is so beautifully and cleverly orchestrated and full of lively energy that is sorely lacking elsewhere, doing so well with enhancing the action.'Galloping Fanny's' best character is Fanny Lou with a pretty well done caricature of Mae West.However, the animation is really not good even for a cartoon not made on a high budget, and it is true for the Cubby the Bear series and Van Bueren in general on the whole. It's static in movement, simplistic in background detail and sloppy in drawing, with the character expressions being pretty expressionless.Another major problem is Cubby himself, on top of being poorly animated he is one of the blandest, most personality-deprived and most motivation-less characters ever to exist.Nothing here is funny, instead it is rather saccharine, too low on laughs/gags and sloppy in timing. The story is barely existent and doesn't go aimless, even for a Cubby or Van Bueren cartoon it's very disjointed and fails to make any kind of sense. The direction is hardly there either.Overall, weak. 3/10 Bethany Cox",
    "Director": "Eddie Donnelly, Steve Muffati",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148036",
    "tt0146629",
    "tt0150804",
    "tt0149684",
    "tt0146464",
    "tt0149817",
    "tt0161331",
    "tt0149988",
    "tt0023889",
    "tt0150130",
    "tt0148026",
    "tt0146594"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.017Z"
}