{
  "imdbId": "tt0150865",
  "title": "He Dood It Again",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/he-dood-it-again-1943",
      "title": "He Dood It Again",
      "description": "Mighty Mouse animated short, although here he is still called Super Mouse. Saul's Lunch Wagon is quiet during the day. At night, all the mice hold a jitterbug dance party! Super Mouse battles a gang of pesky cats who are trying to eat the mice who hang out after hours in the diner. A sequence with hot jazz music is featured as the mice swing and dance to the beat. Watch on RetroFlix:  https://retroflix.org/he-dood-it-again-1943/",
      "id": "he-dood-it-again-1943"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "6.5",
    "imdbVotes": "43",
    "Genre": "Animation, Short",
    "Plot": "The quality of the Terrytoons cartoons is inconsistent. The music is always one of the best assets, while the animation became a strength over-time. Meanwhile, being hit and miss in the characterisation and content. My main reason for seeing them was for completest sake, to see as many of their overall output as possible. Another reason was for being interested in seeing older cartoons from lower-budget and comparitively lesser known studios.1943 saw all of the above, cartoons being better than others, the music and animation being merits and characterisation and content being hit and miss. This was not unexpected, given that from 1929 onwards hit and miss has been the general standard for Terrytoons, but some years fared worse than others. Like the previous year, 1943 was one of Terrytoons' best years, none really being terrible and most ranged from average to decent while none being great. The third cartoon to feature Super Mouse, 'He Dood It Again' for me is in the better half of the 1943 cartoons and of Terrytoons' output overall, also one of the more interesting along with Super Mouse's debut 'The Mouse of Tomorrow' and one of the best early Super/Mighty Mouse cartoons (actually overall).As said, 'He Dood It Again' saw Super Mouse's third appearance. He was later re-named Mighty Mouse after seven cartoons and went on to become Terrytoons' most prolific lead character up until 'Cat Alarm' in 1961. Was not a fan of all his cartoons and Mighty Mouse has never been one of my favourite characters in animation, but as far as Terrytoons go even the weakest cartoons when the series became increasingly repetitive were quite a bit better than when the studio was at its worst, if that makes sense.Like the previous two Super Mouse cartoons, 'He Dood It Again' is a pretty slight and predictable cartoon in terms of the story. How things are resolved are foreseeable quite early on and some of it is a touch corny.It was not easy to tell what my overall stance on Mighty/Super Mouse was, and certainly at this stage. He tended to be a cute and likeable character although fairly limited at the same time for a lead and his cartoons did tend to be quite formulaic and at times repetitive, especially early on.However, 'He Dood It Again' is well animated. Which was not a surprise as this aspect had come on enormously by this point with Terrytoons. It is nicely detailed, lively and colourful without being garish. Again, the music, the thing that was the most consistently good thing from the very beginning with Terrytoons, is a big strength. It is beautifully and cleverly orchestrated and arranged, is terrific fun to listen to and the lively energy is present throughout, doing so well with adding to the action. It perfectly captures the jitterbug dance atmosphere.While never what one calls hilarious, there are plenty of humorous and atmospheric touches. As well as a lot of energy, lively action and an unforced charm throughout. Super Mouse may be a limited character somewhat but he is likeable in a way, but the supporting characters have always been far more interesting in personality and that's the case in 'He Dood It Again'On the whole, not a great cartoon but definitely worth a look. 7/10",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Isadore Klein, Donald McKee",
    "Actors": "Tom Morrison",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0147829",
      "title": "Aladdin's Lamp",
      "year": 1943,
      "imdbRating": "5.7",
      "imdbVotes": "27",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148404",
      "title": "Lights Out",
      "year": 1942,
      "imdbRating": "4.7",
      "imdbVotes": "25",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148190",
      "title": "The Frog and the Princess",
      "year": 1944,
      "imdbRating": "5.8",
      "imdbVotes": "25",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0145913",
      "title": "The Mouse of Tomorrow",
      "year": 1942,
      "imdbRating": "6.5",
      "imdbVotes": "84",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149293",
      "title": "Tricky Business",
      "year": 1942,
      "imdbRating": "5.4",
      "imdbVotes": "13",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148143",
      "title": "Fisherman's Luck",
      "year": 1945,
      "imdbRating": "5.5",
      "imdbVotes": "25",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150569",
      "title": "Fishing Made Easy",
      "year": 1941,
      "imdbRating": "4.7",
      "imdbVotes": "9",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148905",
      "title": "Slap Happy Hunters",
      "year": 1941,
      "imdbRating": "4.7",
      "imdbVotes": "16",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149373",
      "title": "Who's Who in the Jungle",
      "year": 1945,
      "imdbRating": "4.8",
      "imdbVotes": "22",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152406",
      "title": "Shipyard Symphony",
      "year": 1943,
      "imdbRating": "5.3",
      "imdbVotes": "12",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153985",
      "title": "Yokel Ducks Makes Good",
      "year": 1943,
      "imdbRating": "5.1",
      "imdbVotes": "16",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151994",
      "title": "Plane Goofy",
      "year": 1940,
      "imdbRating": "5.4",
      "imdbVotes": "22",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T06:22:05.862Z"
}