{
  "movieId": "tt0147017",
  "title": "Love's Labor Won",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/loves-labor-won-1933",
      "id": "loves-labor-won-1933",
      "title": "Love's Labor Won (1933)",
      "description": "Cubby the Bear is in move and sings about it.... Watch on RetroFlix:  https://retroflix.org/loves-labor-won-1933/",
      "fileSize": 144795012,
      "addedAt": "2026-01-07T00:09:38.894Z",
      "thumbnail": "https://archive.org/services/img/loves-labor-won-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 45
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.4,
    "imdbVotes": 31,
    "Genre": "Animation, Short",
    "Plot": "Van Bueren Studios' Cubby the Bear series comprised of just 17 cartoons made between 1933-1934. As much as it pains me to say it, speaking as a big animation fan, it is not hard to see why the character and the series weren't so popular and didn't last long.Sadly am not feeling much love in and for 'Love's Labour Won' (no surprises which Shakespeare play the title is a play-on of). A few things save it from total doom but generally 'Love's Labour Won' is in the weaker half in a series where most of the cartoons to me were not very good. It could have been good actually, it has a joyful setting and it is hard not to dislike a cartoon containing music and dance. Unfortunately for 'Love's Labour Won' cartoons before and since did this so much better.The best thing about it, and this is true of a lot of Van Bueren's output, is the music score. It is so beautifully and cleverly orchestrated and full of lively energy that is sorely lacking elsewhere, doing so well with enhancing the action.'Love's Labour Won' comes to life ever so slightly towards the end when some kind of story does kick in. The best character in the cartoon by far is the wolf, the only one to resemble any kind of personality.However, the animation is really not good even for a cartoon not made on a high budget, and it is true for the Cubby the Bear series and Van Bueren in general on the whole. It's static in movement, simplistic in background detail and sloppy in drawing, with the character expressions being pretty expressionless. Another major problem is Cubby himself, on top of being poorly animated he is one of the blandest, most personality-deprived and most motivation-less characters ever to exist. Honey is not much better, think the love interests for similar early male characters from Disney and Looney Tunes except much blander and with significantly less charm or personality and you have Honey.With the two leads being so poorly defined, it is hard to engage with the music and dance interludes that forms most of the cartoon. 'Love's Labour Won' is also rather saccharine, too low on laughs/gags, sloppy in timing and there are times where Cubby tries too hard to be Mickey Mouse and fails. While a little credit is due that the story makes a little more sense than most Cubby cartoons, it's not enough to stop the story from being non-existent for most of the duration and aimless. It picks up a little when something resembling a story comes in and the wolf antagonises the two leads but the action is just far too derivative of other rescue cartoons made at the same time for this section to completely redeem the cartoon.Overall, weak. 3/10 Bethany Cox",
    "Director": "Mannie Davis, John Foster",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0161433",
    "tt0147534",
    "tt0021722",
    "tt0147620",
    "tt0146582",
    "tt0146719",
    "tt0022741",
    "tt0147274",
    "tt0146845",
    "tt0161750",
    "tt0161805",
    "tt0147096"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.894Z"
}