{
  "imdbId": "tt0107273",
  "title": "Joey Breaker",
  "year": 1993,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/joey-breaker-24fps",
      "id": "joey-breaker-24fps",
      "title": "Joey Breaker (1993) - Richard Edson Film",
      "description": "Steven Starr was an agent at William Morris Agency, heading the New York Motion Picture department under legendary talent agent Sue Mengers. His clients over the years included Larry David, Sandra Bernhard, Kids In The Hall, Tim Robbins, Ang Lee, Andy Warhol, and many more. He left the agency in 1991 to produce  Johnny Suede  and then 2 years later would write, direct, and produce  Joey Breaker . The film contains some autobiographical elements of his time as an agent. It was co-produced by legendary indie director Amos Poe. The film is known to have before they were famous stars acting in it: Philip Seymour Hoffman, Gina Gershon, Michael Imperioli, Erik King, Parker Posey, and Seth Gilliam. The film has a lot of Bob Marley's music and his daughter Cedalla Marley played the lead love interest Cyan in the movie, making me wonder how Mr. Starr managed to do this. He was a concert promoter for  Bob Marley & The Wailers  back in college and was a client of Ziggy Marley. Mr. Starr collaborated with the Marley family on a variety of estate projects down the line. The film also tackled the topic of AIDS, a prevalent issue at that time, and is represented in two different characters, Fred Fondren's Alfred and Erik King's Hip Hop Hank. And in the twist of irony, Fred Fondren would wind up passing away of AIDS after the movie's completion. The film is dedicated to him and Jessica Haston (costume designer of the film) who passed away from melanoma. After the film, Mr. Starr would co-create and produce  The State  for MTV & produced some documentaries here and there. Then he focused full-time on media democratization in 1999 and co-founded various companies.  Other interesting factoids about the film: -The sketch comedy show that Joey was referring to Hank may be a reference to  The State . -Laurence Mason who played Hank's boyfriend Lester is most known for his role as Lord Nikon in  Hackers  (1995) -Bill Bellamy and Lewis Black are allegedly in the movie. They either got cut out of the movie but are credited or have barely noticeable minor roles. I would not be surprised if Bill Bellamy were the one who provided the jokes for the Hip Hop Hank character. Make sense why he was involved in this movie Plot Synopsis: Joey is a player and a hot-shot movie agent in New York. If a deal can be made, he'll make it. If a rising talent can be snapped up, he'll be the first in line. And when it comes to luring Hollywood into a bidding war for a script nobody's read, Joey is your man. Joey's cruising in the fast lane. But there's one thing Joey has never taken the time to do... live. Joey's programmed life is turned topsy-turvy by a series of unexpected events that culminate in a serendipitous romance with a thoroughly remarkable young Jamaican woman. Sidenote: Footage came from a VHS screener I had. It it set at 24fps. The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org, are for educational purposes. I have uploaded each movie for posterity, with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws.",
      "fileSize": 3826519111,
      "addedAt": "2026-01-07T00:09:15.996Z",
      "thumbnail": "https://archive.org/services/img/joey-breaker-24fps",
      "language": "eng",
      "year": 1993,
      "collection": "feature_films",
      "downloads": 10859
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "92 min",
    "imdbRating": 4.4,
    "imdbVotes": 200,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Joey Breaker is a fast-talking, ambitious, workaholic agent representing actors, screenwriters, and comedians for the New York firm of Morgan Creative. He is callous and intolerant, but when he unexpectedly falls in love, he begins to see that he has been missing much of what is important in life. His demeanor mellows and he learns to be more tolerant of others. Suddenly, he is faced with a difficult choice when his girlfriend graduates from nursing school and returns to Jamaica.",
    "Director": "Steven Starr",
    "Writer": "Steven Starr",
    "Actors": "Richard Edson, Cedella Marley, Fred Fondren",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0106941",
    "tt0111415",
    "tt0114095",
    "tt0116102",
    "tt0096926",
    "tt0157053",
    "tt0118566",
    "tt0032599",
    "tt0027311",
    "tt0033891",
    "tt0027286",
    "tt3101386"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.996Z"
}