{
  "imdbId": "tt0151095",
  "title": "The Jail Break",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-jail-break-1946",
      "id": "the-jail-break-1946",
      "title": "The Jail Break (1946)",
      "description": "In this classic Western cartoon, Bad Bill Bunion's horse helps his master escape from Alcatraz Island Prison. Free again, the wily crook commits a series of crimes, including the theft of a football during a championship Army vs. Navy playoff. Mighty Mouse returns to clobber his arch-foe, sending him flying back to Alcatraz. Mighty Mouse even returns the football to the game! There's a great gag at the end involving Frankenstein's Monster, Count Dracula and lawyers! Watch on RetroFlix:  https://retroflix.org/the-jail-break-1946/",
      "fileSize": 36246377,
      "addedAt": "2026-01-07T00:12:10.589Z",
      "thumbnail": "https://archive.org/services/img/the-jail-break-1946",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 131
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6,
    "imdbVotes": 30,
    "Genre": "Animation, Short",
    "Plot": "I actually enjoyed this Mighty Mouse cartoon, which may mean that it is brilliant. I freely admit that I was overexposed to MM as a child -- although it seemed that every time I saw one, it was the one where he rescued Pearl Pureheart from the buzz saw as everyone sang bad operetta, Mighty Mouse was, of course, a tenor. As a result I have been unable to enjoy them ever since. Their repetitious plotting and made-for-the-kiddies scripting never helped.But this one, directed by old Terry hand Mannie Davis is amusing. The villain, Bad Bill Bunyan and his horse, steal surprising things, and that makes me laugh. Until Mighty Mouse shows up and then it's the same old stuff. But he doesn't show up before I had fun.",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Tom Morrison",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0147628",
    "tt0148218",
    "tt0150889",
    "tt0146300",
    "tt0150625",
    "tt0151561",
    "tt0148212",
    "tt0151697",
    "tt0153889",
    "tt0148588",
    "tt0150450",
    "tt0150976"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.589Z"
}