{
  "imdbId": "tt0151402",
  "title": "Loves Labor Won",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/loves-labor-won-1948",
      "title": "Loves Labor Won (1948)",
      "description": "Many sight gags find their way into this story of Mighty Mouse coming to the rescue of a fair maiden. Oil Can Harry is determined to marry Pearl Pureheart. Mighty Mouse can't stop him because he is tied in front of a big cannon. Pearl manages to escape from Oil Can Harry, singing opera all the while. This cartoon is played like a chapter from a cliffhanger serial, with lots of action and suspense (and singing). Watch on RetroFlix:  https://retroflix.org/loves-labor-won-1948/",
      "id": "loves-labor-won-1948"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "7.4",
    "imdbVotes": "44",
    "Genre": "Animation, Short, Romance",
    "Plot": "Operetta-style melodrama is not a new premise for Terrytoons Studios, or any animation studio at this time and before. It was quite old territory already in the 30s, well before Mighty Mouse appeared on the scene, and was very variable in execution. It was a premise used more than once in the Mighty Mouse theatrical series and varied in success there too, mostly not too bad at all. While some 1948 Mighty Mouse cartoons were better than others there were a lot less misfires (not really any this year actually).'Love's Labor Won' is no exception to that. While not a complete winner, it is a long way from a misfire. It's neither one of the best 1948 Terrytoons cartoons (pretty much all the Heckle and Jeckle outings) or one of the worst ('Mystery in the Moonlight' being the weakest for me of the previous cartoons in the batch). As far as Mighty Mouse's outings that year go, 'Love's Labor Won' is again not one of the best or worst, somewhere around the middle.Admittedly, there is nothing original about the story, if you have seen any of Terrytoons' operetta-style melodrama-like cartoons there is nothing surprising about what happens and how it all quite too neatly ends, which makes the story feel too over-familiar and recycled. Also thought that in the earlier parts of the cartoon it could have been tighter in the pace, it takes a little too long to set up.It is a little saccharine to begin with as well, and it is agreed that there are a few too many idiotic decisions serving the purpose of padding out the events.Conversely, once the conflict kicks in 'Love's Labor Won' becomes a lot more interesting, is lively and is good fun as long as one doesn't expect too much. Mighty Mouse at least serves some sort of point here and his role is less repetitive than usual and not as much of an underused plot device, he actually feels more of a lead here. Really liked his resourcefulness and he was likeable. Did find the supporting characters more memorable though, common with the Mighty Mouse series. Pearl Pureheart is alluring with a lot of charm and not too much sugar and it is not hard to see why anybody would fall for her. Like with a lot of these operetta-style melodrama cartoons though, the best character for me was the villain Oil Can Harry, who was both amusing and menacing. The conflict did have tension and a sense of fun, although predictable.The gags, and the cartoon is not short-changed in this respect, are timed well and are funny. The final third is suitably chaotic without being rushed or overdone, it doesn't feel too much like a different cartoon like too many Mighty Mouse cartoons are. The animation is colourful and neat and it is great that the backgrounds increasingly became more ambitious and more detailed. Other than Oil Can Harry, the star though is the music. Like an essential character of its own and so infectious and cleverly constructed, some smile-inducing lyric writing too. It is well sung too and the ending is indeed very sweet without being too much so.On the whole, decent if unexceptional. 6/10.",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Roy Halee, Ken Schoen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0148486",
      "title": "Moose on the Loose",
      "year": 1952,
      "imdbRating": "5.3",
      "imdbVotes": "20",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150899",
      "title": "Hero for a Day",
      "year": 1952,
      "imdbRating": "N/A",
      "imdbVotes": "20",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146300",
      "title": "The Talking Magpies",
      "year": 1946,
      "imdbRating": "6.1",
      "imdbVotes": "222",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153808",
      "title": "The Wicked Wolf",
      "year": 1946,
      "imdbRating": "6.3",
      "imdbVotes": "41",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150532",
      "title": "Felix the Fox",
      "year": 1948,
      "imdbRating": "5.9",
      "imdbVotes": "15",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148184",
      "title": "Free Enterprise",
      "year": 1948,
      "imdbRating": "5.9",
      "imdbVotes": "26",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0161963",
      "title": "Seeing Ghosts",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "28",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147991",
      "title": "The Chipper Chipmunk",
      "year": 1948,
      "imdbRating": "6.1",
      "imdbVotes": "19",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151443",
      "title": "The Magic Slipper",
      "year": 1948,
      "imdbRating": "6.5",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151697",
      "title": "The Mysterious Stranger",
      "year": 1948,
      "imdbRating": "7.3",
      "imdbVotes": "52",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152124",
      "title": "The Racket Buster",
      "year": 1948,
      "imdbRating": "6.4",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153871",
      "title": "The Witch's Cat",
      "year": 1948,
      "imdbRating": "7.2",
      "imdbVotes": "73",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:38.894Z"
}