{
  "movieId": "tt0152317",
  "title": "Scrap for Victory",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/scrap-for-victory-1943",
      "id": "scrap-for-victory-1943",
      "title": "Scrap for Victory (1943)",
      "description": "The opening scene shows a battle going on, and a soldier tells his commanding officer that they're running low on artillery. The commanding officer phones in to headquarters, and he tells them of the situation. During the rest of the cartoon, a song tells how all scrap donations are needed for the war effort. Dump trucks and horsedrawn carts going up and down city streets, and people throw their scraps, such as old pots, pans and shoes, into the truck/wagon. At one point, someone throws a picture of Adolf Hitler into the back of one of the wagons. The song goes \"Have you got any scrap, have you got any wood, any iron, rubber, or tin? For we need all your might, Uncle Sam's in a fight, and he needs your help again.\" Watch on RetroFlix:  https://retroflix.org/scrap-for-victory-1943/",
      "fileSize": 39000808,
      "addedAt": "2026-01-07T00:10:40.954Z",
      "thumbnail": "https://archive.org/services/img/scrap-for-victory-1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 69
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.4,
    "imdbVotes": 18,
    "Genre": "Animation, Short",
    "Plot": "Gandy Goose and Sour Puss answered the call to arms during World War Two and seemed to have served in several branches of the armed forces and on numerous battlefields. In this one, they seem to be defending the Philippines with machine guns. They need more supplies, so they send word back and all the animals in the cartoon start a scrap drive in this Terrytoon propaganda film.It's nicely done, with some good gags in it and some extensive and loving color work. These Terrytoon propaganda films are hard to find, but they do feature some of the best work of that studio during the War. It's definitely worth seeing if you can find it.",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Isadore Klein, Tom Morrison",
    "Actors": "Arthur Kay",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0145751",
    "tt0145954",
    "tt0161719",
    "tt0152971",
    "tt0153892",
    "tt0149616",
    "tt0161510",
    "tt0150455",
    "tt0150825",
    "tt0151023",
    "tt0148402",
    "tt0151807"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.954Z"
}