{
  "movieId": "tt0132951",
  "title": "The Fighting Texan",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KtXtqj7jtIc",
      "id": "KtXtqj7jtIc",
      "title": "The Fighting Texan (1937) KERMIT MAYNARD",
      "description": "Stars: Kermit Maynard, Elaine Shepard, Frank LaRue\nDirector: Charles Abbott\nWriter: James Oliver Curwood \n\nA rancher finds that his stock of horses is mysteriously being depleted, and discovers that a ranch near him has had a sudden upsurge in its horse population.\n\nMovie Class by PizzaFLIX: Kermit was the younger brother of actor Ken Maynard. Like his brother, he became a star in early cowboy movies and appeared in 280 films between 1927 and 1962.",
      "addedAt": "2025-12-24T01:06:51.318Z",
      "thumbnail": "https://i.ytimg.com/vi/KtXtqj7jtIc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAmDckHJBOScl-9QqWw2siGcQN8kQ",
      "duration": 3545,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 6.9,
    "imdbVotes": 16,
    "Genre": "Action, Romance, Western",
    "Plot": "Rancher Pete Hadley (Ed Cassidy) is after the property of his neighboring ranchers, Jim Perkins (Murdock MacQuarrie) and Joe Walton (Frank LaRue) and is having his henchman rustle horses belonging to Walton and putting the Perkins brand on them to stir up trouble and cause a feud. Glenn Oliver (Kermit Maynard) rides into the middle of this conflict as he has purchased a half-interest in the Perkins' ranch. Hadley incites Walton to check the inside of a changed brand and Walton learns it is is his stock, and rides to have a showdown with Perkins, but is stopped short of shooting him by Oliver. Later, Perkins is bushwhacked and Glenn finds proof that the shot was fired by Walton's 30-30 rifle, and he is convinced that either Walton or his daughter, Judy (Elaine Shephard), fired the fatal shot. When Oliver is framed for killing Walton cowhand/Hadley henchman Bart Green (Merrill McCormick), Hadley's plan to take over both ranches appears to be a success.",
    "Director": "Charles Abbott",
    "Writer": "James Oliver Curwood, Joseph O'Donnell",
    "Actors": "Kermit Maynard, Elaine Shepard, Frank LaRue",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0029055",
    "tt0027217",
    "tt0169357",
    "tt0023967",
    "tt0031023",
    "tt0028592",
    "tt0028634",
    "tt0029130",
    "tt0029376",
    "tt0140551",
    "tt0030839",
    "tt0065520"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:37:11.782Z"
}