{
  "movieId": "tt0150564",
  "title": "The First Robin",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-first-robin-1939",
      "id": "the-first-robin-1939",
      "title": "The First Robin (1939)",
      "description": "A young newlywed robin couple move into a tree apartment. After being brought over the threshold, she gets ignored by Hubby who wants to listen to the radio. Later, she bakes some biscuits, but they prove to be brick-like, one even crashing through the table and floor. He bravely downs one, but he can't pretend to enjoy it. she bursts into tears and leaves. He decides he can take over, putting on her apron and mobcap while incongruously smoking a cigar. Aparently lacking not only cookery skills, but common sense as well, he salts and boils a can of beans in a saucepan on the stove. Watch on RetroFlix:  https://retroflix.org/the-first-robin-1939/",
      "fileSize": 39686802,
      "addedAt": "2026-01-07T00:11:57.687Z",
      "thumbnail": "https://archive.org/services/img/the-first-robin-1939",
      "language": "eng",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 48
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5,
    "imdbVotes": 16,
    "Genre": "Animation, Short",
    "Plot": "A young newlywed robin couple move into a tree apartment. After being brought over the threshold, she gets ignored by Hubby who wants to listen to the radio. Later, she bakes some biscuits, but they prove to be brick-like, one even crashing through the table and floor. He bravely downs one, but he can't pretend to enjoy it. she bursts into tears and leaves. He decides he can take over, putting on her apron and mobcap while incongruously smoking a cigar. Aparently lacking not only cookery skills, but common sense as well, he salts and boils a can of beans in a saucepan on the stove. It explodes, leaving beans all splattered above. He mounts a stack of boxes and chairs to pick them off the ceiling one by one. Missus returns, and they have a screaming match, and now he leaves. Now out sitting (literally) in the dog house, he waits for her to cool down, but just then the stork has come calling, and their family is completed with a cradle full of hatching eggs.",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Donald McKee, Tom Morrison",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149595",
    "tt0149800",
    "tt0146780",
    "tt0151295",
    "tt0151749",
    "tt0148562",
    "tt0153386",
    "tt0153659",
    "tt0153736",
    "tt0150847",
    "tt0148503",
    "tt0151300"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.687Z"
}