{
  "movieId": "tt0139632",
  "title": "The Symbol of the Unconquered",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-symbol-of-the-unconquered",
      "id": "silent-the-symbol-of-the-unconquered",
      "title": "The Symbol of the Unconquered",
      "fileSize": 2724675378,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-symbol-of-the-unconquered",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 678
    }
  ],
  "metadata": {
    "Rated": "TV-PG",
    "Runtime": "54 min",
    "imdbRating": 5.8,
    "imdbVotes": 596,
    "Genre": "Drama, Romance",
    "Plot": "Eve Mason, a very light-skinned Negro, leaves Selma, Alabama for the northwest town of Oristown to occupy the land she inherited from her grandfather. There she meets kindly Hugh Van Allen, who turns out to be her neighbor, and he gives her a lift to her place outside of town. Jefferson Driscoll is another very light-skinned Negro who wants to be taken as white, and he hates the Negro race because his mother once interfered with his wooing a white girl. Driscoll gets in league with unsavory August Barr, an Indian fakir called Tugi, and horse thieves Bill Stanton and Philip Clark. When Driscoll intercepts a letter for Van Allen showing his land is on an oil field, the group posts notes on Van Allen's tent, threatening his life if he won't sell his land. Van Allen ignores the the notes, which are signed \"The Knights of the Black Cross\", leaves for town to buy furniture and won't be back for 48 hours. In his absence, the last note is posted, giving him 48 hours to sell. The group, led by Bill Stanton, plans a midnight attack and tells the others, \"In one hour we will have driven him mad and burned him in his lair.\" Barr's wife Mary, upset by the planned massacre, goes to warn Eve, who rides to town for help, just as Van Allen returns, unaware of the impending attack.",
    "Director": "Oscar Micheaux",
    "Writer": "Oscar Micheaux",
    "Actors": "Iris Hall, Walker Thompson, Lawrence Chenault",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0011870",
    "tt0021844",
    "tt0011741",
    "tt0139639",
    "tt0011841",
    "tt0015634",
    "tt0197917",
    "tt0011652",
    "tt0188237",
    "tt0009559",
    "tt0009968",
    "tt0012027"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}