{
  "movieId": "tt0116778",
  "title": "Kingpin",
  "year": 1996,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x4D2iLGrfls",
      "id": "x4D2iLGrfls",
      "title": "Kingpin - Two Idiots on the Bowling Alley (COMEDY with WOODY HARRELSON, Action Comedy in German)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 WOODY HARRELSON (\"Larry Flynt – Die nackte Wahrheit\") & BILLY MURRAY (\"Die Geister, die ich rief\"): Nachdem Roy Munson seine Wurfhand verliert, entdeckt er den Bowlingtalentierten Amish Ishmael – gemeinsam wollen sie ein großes Turnier rocken, doch zuerst müssen sie noch die skeptischen Eltern überzeugen.\n\nOriginaltitel: Kingpin (1996)\nMit: Woody Harrelson, Randy Quaid, Bill Murray, Lin Shaye\nRegie: Bobby Farrelly, Peter Farrelly\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nNachdem ihn ein mißgünstiger Kontrahent um die Wurfhand bringt, geht es bergab mit der einstigen Bowling-Hoffnung Roy Munson.\nEines Tages entdeckt er den Amish-Glücksritter Ishmael, der sich als riesiges Bowlingtalent entpuppt. Er soll Roy bei einem hochdotierten Turnier aus der Misere kegeln. Doch zuerst müssen Ishmaels Eltern von der Rechtschaffenheit der Unternehmung überzeugt werden.\n#Netzkino #ganzerFilm #woodyharrelson\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:35:12.644Z",
      "thumbnail": "https://i.ytimg.com/vi/x4D2iLGrfls/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCILF9KZlz-EGrgDW6ntCjV2mnv7w",
      "duration": 6829,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "114 min",
    "imdbRating": 6.9,
    "imdbVotes": 95150,
    "Genre": "Comedy, Sport",
    "Plot": "Roy Munson was raised to be the best bowler in the world (trained early on by his father). But a fellow bowler, Ernie McCracken and a misunderstanding with some rough punks, leaves poor Roy with the loss of his bowling hand! Not to let this get him down, he gets a prosthetic hand and becomes a travelling sales man. But it's really all down hill for him from that night on until ... One day he meets Ishmael who is Amish and sneaks away from the farm to bowl (his fellow Amish would disown him if they knew)! Roy convinces Ishmael to let him be his trainer and he'll make him the best bowler the world has ever seen. Reluctantly Ishmael agrees to go on the road and shortly afterwards actually finds that life outside the farm is quite fun. Soon their paths cross that of Ernie McCracken who is still a top ranking bowler. While Roy's career and life have landed in the toilet bowl, Ernie is still drawing huge crowds and all the babes! They both square off for the ultimate bowling championship ... to see which one truly IS the champion.",
    "Director": "Bobby Farrelly, Peter Farrelly",
    "Writer": "Barry Fanaro, Mort Nathan",
    "Actors": "Woody Harrelson, Randy Quaid, Bill Murray",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0116168",
    "tt0291832",
    "tt0129972",
    "tt0017765",
    "tt0020927",
    "tt0027969",
    "tt0035089",
    "tt0033144",
    "tt0005074",
    "tt0010635",
    "tt0003399",
    "tt0027097"
  ],
  "collections": [
    {
      "id": "1990s",
      "name": "1990s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-13T19:01:15.341Z"
}