{
  "imdbId": "tt0194880",
  "title": "La fiesta de todos",
  "year": 1979,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-fiesta-de-todos-1978",
      "id": "la-fiesta-de-todos-1978",
      "title": "La Fiesta De Todos (1978)",
      "description": "La fiesta de todos  es una  película argentina   documental - de comedia  de 1979 dirigida por  Sergio Renán , en torno a la  Copa Mundial de Fútbol de 1978 . Fue escrita por Renán,  Hugo Sofovich  y  Mario Sabato , este último bajo el seudónimo de \"Adrián Quiroga\". Los  sketches  de comedia del filme son protagonizados por un numeroso grupo de reconocidos actores argentinos y figuras de la cultura. Fue estrenada el 24 de mayo de ese año. El film es una reconstrucción mayormente documental de la victoria argentina en la Copa Mundial realizada en ese país, intercalada con distintos episodios ficticios que suceden durante la misma época. La película ha sido criticada como un intento de mostrar a un pueblo unido disfrutando de una \"fiesta de todos\", en momentos en que el país era gobernado por la violenta última  dictadura cívico-militar (1976-1983) , 1 ​ la cual había impuesto un régimen de  terrorismo de Estado a nivel nacional . 1 ​ Desde su estreno,  La fiesta de todos  es considerado por muchos críticos de cine como un film de propaganda y apoyo al régimen militar vigente por entonces, ya que este aborda el tema de la preparación y el desarrollo del Mundial de 1978 con una visión optimista y festiva, haciendo apología de un evento que la dictadura había desarrollado para funcionar como una  cortina de humo  que ocultara el  genocidio  que llevaba a cabo el  estado . 1 ​ (Wikipedia) Sinopsis El film es una reconstrucción mayormente documental de la victoria argentina en la  Copa Mundial de Fútbol de 1978 , realizada en ese país, intercalada con distintos episodios ficticios que suceden durante la misma época. Reparto Juan Carlos Calabró Mario Sánchez Ricardo Espalter Luis Landriscina Julio de Grazia Nélida Lobato Félix Luna Marta Lynch Roberto Maidana César Luis Menotti José María Muñoz Luis Sandrini Malvina Pastorino Gogó Andreu Aldo Barbero Elsa Berenguer Amalia Bernabé Rudy Chernicoff Alfonso De Grazia Graciela Dufau Ulises Dumont Alberto Irízar Susú Pecoraro Elena Sedova Silvina Rada Néstor Ibarra Enrique Macaya Márquez Ricardo Darín Roberto Ayala Héctor Drazer Diego Bonadeo Gustavo Garzón Gustavo Carfagna Miguel Jordán Jorge de la Riestra Margarita Luro Jesús Pamplonas Atilio Regaló Tacholas Tempo Jorge Villalba Memé Vigo Marcos Woinski",
      "fileSize": 1512538657,
      "addedAt": "2026-01-07T00:09:24.701Z",
      "thumbnail": "https://archive.org/services/img/la-fiesta-de-todos-1978",
      "language": "spa",
      "year": 1978,
      "collection": "feature_films",
      "downloads": 81
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "110 min",
    "imdbRating": 3.3,
    "imdbVotes": 96,
    "Genre": "Documentary, Comedy, Family",
    "Plot": "Documentary about Argentina 's victory in the 1978 FIFA World Cup, held in that country and in which important personalities in world football and culture involved.",
    "Director": "Sergio Renán",
    "Writer": "Sergio Renán, Hugo Sofovich, Mario Sábato",
    "Actors": "Juan Carlos Calabró, Mario Sánchez, Ricardo Espalter",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0338018",
    "tt0189123",
    "tt0335284",
    "tt0220221",
    "tt0076826",
    "tt0320261",
    "tt0182048",
    "tt0221306",
    "tt0084290",
    "tt0073076",
    "tt0179066",
    "tt0079020"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.701Z"
}