{
  "imdbId": "tt0153892",
  "title": "A Wolf's Tale",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-wolfs-tale-1944",
      "title": "A Wolfs Tale",
      "description": "Terrytoons animated short with voice of Jo Miller as Red and Grandma. Watch on RetroFlix:  https://retroflix.org/a-wolfs-tale-1944/",
      "id": "a-wolfs-tale-1944"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "5.8",
    "imdbVotes": "16",
    "Genre": "Animation, Short",
    "Plot": "Despite finding Terrytoons' output very variable, a vast majority ranging between lacklustre and pretty good along with a handful of both very good and very weak, the cartoons are always interesting for completest sake. It was also of much interest seeing how the studio would fare with putting its spin on a classic story, with it being adapted and parodied a lot in animation and often very well (like Looney Tunes and Tex Avery).1944 was a slightly more consistent year quality-wise compared to previous years for Terrytoons, though still uneven. For me, 'A Wolf's Tale' is one of the more interesting 1944 Terrytoons cartoons and towards the better end of that year's output. It does pretty well in its take on the story, with a valiant attempt at being racier than usual for Terrytoons and not being too cutesy, but also do think that more could have been done with this very promising idea.Like a vast majority of Terrytoons' output, well all of them actually at this point, the best thing about 'A Wolf's Tale' is the music. It is beautifully and cleverly orchestrated and arranged, is terrific fun to listen to and the lively energy is present throughout, doing so well with adding to the action. Close behind was the animation, as said more than once this component has come on considerably since the Terrytoons Studio first started. Overall, it is nicely detailed, lively and colourful, with a vividly rendered and not too cutesy setting and vibrant colours.There are some very humorous moments here, it is never dull and the dialogue avoids being too cute as well as being too overtly creepy. It features one of the more interesting depictions of Little Red Riding Hood in animation, only Avery's take on the character perhaps was more \"risque\". The grandmother is also intriguingly depicted, being very Mae West-like here which is a completely new thing to see for me. The wolf is perhaps the character with the standout personality, being amusing but not one one wants to mess with. The voice acting fits the characters well.More could have been done with the concept though. 'A Wolf's Tale' started off very promisingly and the more mature, bolder tone was a remarkably welcome change of pace for Terrytoons. It is a shame though that this was not carried all the way through, when the crew seemed to worry about going too adult and played it safe again. While the cartoon never gets too cute or anything, this did feel like a missed opportunity.When 'A Wolf's Tale' gets tamer, the momentum dipped too so when ideally the energy should get snappier with this kind of premise it sort of peters out.Overall, despite how this sounds this is not a bad cartoon at all. Did find a lot to like about it but fulll potential wasn't fully realised. 6.5/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster",
    "Actors": "Jo Miller, Tom Morrison",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0150455",
      "title": "Eliza on the Ice",
      "year": 1944,
      "imdbRating": "5.3",
      "imdbVotes": "59",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037912",
      "title": "Gypsy Life",
      "year": 1945,
      "imdbRating": "5.8",
      "imdbVotes": "191",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148489",
      "title": "Mother Goose Nightmare",
      "year": 1945,
      "imdbRating": "5.3",
      "imdbVotes": "20",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148632",
      "title": "Post War Inventions",
      "year": 1945,
      "imdbRating": "7.1",
      "imdbVotes": "35",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148172",
      "title": "Fortune Hunters",
      "year": 1946,
      "imdbRating": "5.1",
      "imdbVotes": "19",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148343",
      "title": "It's All in the Stars",
      "year": 1946,
      "imdbRating": "4.7",
      "imdbVotes": "15",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148782",
      "title": "Sham Battle Shenanigans",
      "year": 1942,
      "imdbRating": "4.9",
      "imdbVotes": "15",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150059",
      "title": "The Cat Came Back",
      "year": 1944,
      "imdbRating": "6.1",
      "imdbVotes": "30",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150546",
      "title": "A Fight to the Finish",
      "year": 1947,
      "imdbRating": "6.4",
      "imdbVotes": "40",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150232",
      "title": "Crying Wolf",
      "year": 1947,
      "imdbRating": "6.3",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150658",
      "title": "The Frozen North",
      "year": 1941,
      "imdbRating": "4.4",
      "imdbVotes": "14",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0145751",
      "title": "Down with Cats",
      "year": 1943,
      "imdbRating": "7.2",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T21:40:45.511Z"
}