{
  "movieId": "tt0150826",
  "title": "The Happy Cobblers",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-happy-cobblers-1952",
      "id": "the-happy-cobblers-1952",
      "title": "The Happy Cobblers (1952)",
      "description": "In a little village in a far-away mythical country lives an old cobble and his dog. The old man can no longer make good shoes and they have fallen upon hard times until, one night, the dog hears noise in the workshop. He finds a band of merry elves making a beautiful pair of shoes. The cobbler believes his dog made them and spreads the news. The King hears about it and orders the cobble to have the dog make 500 pairs of shoes, as the King is as fond of shoes as a former first lady of the Philippines was. The elves come to the rescue, make the shoes, and the shoe-loving King is highly pleased and makes the old cobbler a rich man. Watch on RetroFlix:  https://retroflix.org/the-happy-cobblers-1952/",
      "fileSize": 38348847,
      "addedAt": "2026-01-07T00:12:10.587Z",
      "thumbnail": "https://archive.org/services/img/the-happy-cobblers-1952",
      "language": "eng",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 77
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 5,
    "imdbVotes": 13,
    "Genre": "Animation, Short, Fantasy",
    "Plot": "In a little village in a far-away mythical country lives an old cobble and his dog. The old man can no longer make good shoes and they have fallen upon hard times until, one night, the dog hears noise in the workshop. He finds a band of merry elves making a beautiful pair of shoes. The cobbler believes his dog made them and spreads the news. The King hears about it and orders the cobble to have the dog make 500 pairs of shoes, as the King is as fond of shoes as a former first lady of the Philippines was. The elves come to the rescue, make the shoes, and the shoe-loving King is highly pleased and makes the old cobbler a rich man.",
    "Director": "Eddie Donnelly",
    "Writer": "Tom Morrison, Bob Kuwahara, Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0161646",
    "tt0149592",
    "tt0148128",
    "tt0151060",
    "tt0151519",
    "tt0148563",
    "tt0149263",
    "tt0149847",
    "tt0151029",
    "tt0161929",
    "tt0147876",
    "tt0153916"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.587Z"
}