{
  "movieId": "tt0151872",
  "title": "The Owl and the Pussycat",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-owl-and-the-pussycat-1934",
      "id": "the-owl-and-the-pussycat-1934",
      "title": "The Owl and the Pussycat (1934)",
      "description": "The Owl and the Pussycat is a Terrytoons cartoon directed by Frank Moser, Paul Terry. Watch on RetroFlix:  https://retroflix.org/the-owl-and-the-pussycat-1934/",
      "fileSize": 30584857,
      "addedAt": "2026-01-07T00:12:22.156Z",
      "thumbnail": "https://archive.org/services/img/the-owl-and-the-pussycat-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 78
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.2,
    "imdbVotes": 14,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1934, like all the other years for Terrytoons, saw a hit and miss batch. Of which 'The Owl and the Pussycat' is one of the low middle ones ranking it in correlation with the rest of the Terrytoons. It is an unexceptional, nothing exactly special and somewhat lacklustre cartoon and has the same amount of problems as it has the amount of strengths. Completest sake is the main reason to see it.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see and some synchronisation is neat.It is a real shame that 'The Owl and the Pussycat' wasn't better than it was, because it could have been one of the best. The first third, focusing on the classic poem and was pretty true to it, was great and the owl character is very charming.However, the last two thirds when the conflict appears were standard Terrytoons territory that felt like a different cartoon altogether. It made the cartoon disjointed after the promising start, if the poem was focused on more and expanded that it made up the entire cartoon, it would have made it a better and different effort for them.Outside of the backgrounds, the animation is primitive at best with a fair bit of crudeness, over-simplicity and choppiness.Story of the last two thirds is likewise paper thin and formulaic with a big air of over-familiarity due to doing very little new with a premise that was feeling old well before this was made. This was standard Terrytoons and was like the first third didn't happen. Loved the owl character, but the pussycat was blander and her voice fairly annoying, already diminishing the cuteness value. The rest of the characters are personality deprived and the human character that resembled a more antagonistic Farmer Al Falfa gave the sense that he was thrown in and with no thought on how to write him. The ending couldn't have been more predictable.Gags are too few and generally don't quite have the lustre and cleverness as others, due to too much of the material being stale from being used before, the charm is completely lacking in the last two thirds and the cartoon sometimes feels choppy, generally there is not enough charm, the pace is not tight enough and a minute longer wouldn't have hurt it.Altogether, has merits but lacking. Started off so well on the whole, apart from the crude character designs, but falls apart a third of the way through and doesn't recover. 4/10 Bethany Cox",
    "Director": "Frank Moser, Paul Terry",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0151428",
    "tt0150930",
    "tt0150964",
    "tt0151078",
    "tt0151092",
    "tt0151094",
    "tt0151141",
    "tt0151166",
    "tt0151552",
    "tt0151688",
    "tt0151887",
    "tt0152193"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.156Z"
}