{
  "imdbId": "tt0148531",
  "title": "The Night",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/EYES.IN.THE.NIGHT",
      "title": "EYES.IN.THE.NIGHT",
      "description": "Blind detective Duncan Maclain is visited by old friend Norma Lawry, looking for help in getting rid of one of her old beaus, who is courting Norma's 17-year old step-daughter.",
      "id": "EYES.IN.THE.NIGHT"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/EyesInTheNight720p1942",
      "title": "EyesInTheNight720p1942",
      "description": "Title: Eyes in the Night Summary: A blind detective and his seeing-eye dog investigate a murder and discover a Nazi plot. Directed by: Fred Zinnemann Actors: Edward Arnold, Ann Harding, Donna Reed Production Company: Metro-Goldwyn-Mayer (MGM) Release Date: 29 April 1943 (Mexico) Aspect Ratio: 1.37 : 1 Blind detective Duncan Maclain is visited by old friend Norma Lawry, looking for help in getting rid of one of her old beaus, who is courting Norma's 17-year old step-daughter. When the old beau is found murdered, Norma is the chief suspect until Duncan (aided by his guide-dog Friday) pays a visit to her home and uncovers a plot to steal her husband's military secrets for the enemy.",
      "id": "EyesInTheNight720p1942"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/eyes-in-the-night-1942-dvdrip-xvi-d",
      "title": "Eyes In The Night 1942 Dvdrip Xvi D",
      "description": "Edward Arnold, Mantan Moreland",
      "id": "eyes-in-the-night-1942-dvdrip-xvi-d"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/eyes-in-the-night-1942_202504",
      "title": "Eyes In The Night 1942 202504",
      "description": "Blind detective Duncan Maclain gets mixed up with enemy agents and murder when he tries to help an old friend with a rebellious stepdaughter. Watch on RetroFlix:  https://retroflix.org/eyes-in-the-night-1942/",
      "id": "eyes-in-the-night-1942_202504"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vi2IAdmz6V0",
      "title": "Eyes in the Night (1942) [Crime] [Mystery]",
      "description": "Captain Duncan \"Mac\" Maclain is a formidable private detective who happens to be blind; but his other senses are sharper than average. He copes with his sight deficiency by being accompanied by a dog named Friday and a human assistant named Marty.\nMac is asked by his friend Norma to break up a romantic relationship between her seventeen-year-old step-daughter Barbara and a fifty-year-old actor. Mac finds the lover has been murdered and detects his body has been removed from the scene of the crime. The murder leads him to an Axis spy ring.\n\n---\n\nDirected by Fred Zinnemann, produced by Jack Chertok, written by Baynard Kendrick (book The Odor of Violets), Guy Trosper (screenplay) and Howard Emmett Rogers (screenplay), starring Edward Arnold as Duncan \"Mac\" Maclain, Ann Harding as Norma Lawry, Donna Reed as Barbara Lawry, Stephen McNally as Gabriel Hoffman, Katherine Emery as Cheli Scott, Allen Jenkins as Marty, Stanley Ridges as Hansen, Lawry's butler, Reginald Denny as Stephen Lawry, John Emery as Paul Gerente, Rosemary DeCamp as Vera Hoffman, Lawry's maid, Erik Rolf as Boyd, Barry Nelson as Mr. Busch, Reginald Sheffield as Victor, Steven Geray as Mr. Anderson, Mantan Moreland as Alistair, Duncan's butler and Friday as Friday the dog.\n\n---\n\nSource: \"Eyes in the Night\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 3 July 2013. Web. 16 August 2013. http://en.wikipedia.org/wiki/Eyes_in_the_Night.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "Vi2IAdmz6V0",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4YMI8IrDqaY",
      "title": "Eyes in the Night (1942) | Colorized Public Domain Detective Thriller | Edward Arnold and Donna Reed",
      "description": "Eyes in the Night (1942) is an American detective thriller directed by Fred Zinnemann and distributed by Metro-Goldwyn-Mayer (MGM). This restored and colorized public domain classic combines mystery, espionage, and suspense with the unique twist of a blind detective solving crimes with the help of his loyal dog. Featuring Edward Arnold in the lead role and a young Donna Reed in one of her early performances, the film blends crime drama with patriotic wartime themes, reflecting the anxieties of a world at war while showcasing the ingenuity of American cinema during the 1940s.\n\nPlot Summary:\nDuncan Maclain (Edward Arnold) is a skilled private detective who, despite being blind, uses his sharp intellect, keen instincts, and faithful guide dog Friday to uncover the truth behind complex mysteries. When he is called to investigate the suspicious activities surrounding Norma Lawry (Ann Harding), a series of events pulls him into a web of espionage, betrayal, and wartime intrigue.\n\nThe plot thickens as Maclain becomes entangled in a dangerous scheme involving Nazi agents operating on American soil. With the support of his assistant Marty and his loyal dog, Maclain follows a trail of evidence leading to shocking revelations. Alongside Donna Lawry (Donna Reed), the spirited stepdaughter of Norma, Maclain must thwart the enemy’s plans while navigating personal loyalties, shifting motives, and escalating danger. The suspense builds toward a climactic confrontation where intelligence and courage triumph over treachery.\n\nCast and Crew:\n• Director: Fred Zinnemann\n• Screenplay: Guy Trosper, Howard Emmett Rogers\n• Based on: “Eyes in the Night” novel by Baynard Kendrick\n• Cinematography: Robert Surtees\n• Editing: Robert J. Kern\n\nStarring:\n• Edward Arnold as Duncan Maclain\n• Ann Harding as Norma Lawry\n• Donna Reed as Barbara Lawry\n• Reginald Denny as Stephen Lawry\n• John Emery as Paul Gerente\n• Allen Jenkins as Marty\n• Friday the Dog as Himself (Maclain’s loyal companion)\n\nFilm Significance:\nEyes in the Night is notable as one of MGM’s suspense films produced during World War II, combining the detective genre with espionage elements relevant to the global conflict. Directed by Fred Zinnemann, who would later gain acclaim for films such as High Noon (1952) and From Here to Eternity (1953), this film represents his early mastery of building atmosphere and tension. Edward Arnold’s performance as a blind detective broke ground by portraying disability with strength and intelligence, while Donna Reed’s role added youthful charm just before she rose to greater fame in later classics like It’s a Wonderful Life (1946).\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, meaning it is entirely free of copyright restrictions and can be legally shared, preserved, and restored. At Colorized Public Domain, we enhance and modernize such historic works by carefully cleaning, restoring, and colorizing them for contemporary audiences. While originally released in black and white, this colorized edition provides new vibrancy and accessibility, particularly for younger viewers who may overlook monochrome classics. Our work preserves film history while ensuring it remains relevant and engaging in the modern era.\n\nWhy Watch This Colorized Edition:\n• Unique detective story led by a blind investigator using intelligence and resourcefulness.\n• A rare early role for Donna Reed, later one of Hollywood’s beloved stars.\n• Direction by Fred Zinnemann, who went on to become one of cinema’s most respected filmmakers.\n• Tension-filled narrative combining crime, mystery, and wartime espionage.\n• Restored and colorized for today’s audiences while respecting the integrity of the original.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from Hollywood’s Golden Age, including thrillers, noir mysteries, wartime dramas, and forgotten B-movies. Our mission is to keep these treasures alive, engaging, and accessible for film lovers worldwide.\n\n#EyesInTheNight #EdwardArnold #DonnaReed #FredZinnemann #FilmNoir #ClassicMystery #PublicDomainMovie #ColorizedClassic #GoldenAgeHollywood #1942Movies #EspionageThriller #DetectiveStory",
      "id": "4YMI8IrDqaY",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XwKxHKZ-cnA",
      "title": "Eyes In The Night (1942) EDWARD ARNOLD",
      "description": "Stars: Edward Arnold, Ann Harding, Donna Reed\nDirector: Fred Zinnemann\n\nAfter a beautiful actress finds the lifeless body of her lover, a blind detective and his seeing-eye dog investigate the murder and discover a Nazi plot!",
      "id": "XwKxHKZ-cnA",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xBUFUaEcsa8",
      "title": "Eyes in the Night (1942) Starring Mantan Moreland - Director: Fred Zinnemann",
      "description": "Duo Movie with :\n00:00 Black & White version of Eyes in the Night (1942) \n1:19:41 Colorized version of Eyes in the Night  / Odor of Violets / Strange Shadows\n\nEyes in the Night is a 1942 American crime mystery.  Directed by Fred Zinnemann, it is based on Baynard Kendrick's 1941 novel The Odor of Violets.\n\nSummary:\n\nBlind detective Duncan Maclain is drawn into a dangerous web of espionage and murder when his friend, Norma Lawry asks for Mac's help.  Her stepdaughter Barbara is smitten with a manipulative actor, Paul Gerente, but when Barbara finds him dead, she accuses Norma of the crime. As Mac investigates, he uncovers a hidden spy ring plotting to steal her husband’s top-secret invention that could shift the course of the war. With his sharp instincts, loyal guide dog Friday, and a knack for turning the tables, Mac must outsmart ruthless enemies before it’s too late.\n\n\nMain cast:\n\nEdward Arnold as Duncan 'Mac\" Maclain \nMantan Moreland as Alistair\nAnn Harding as Norma Lawry\nDonna Reed as Barbara Lawry\nReginald Denny as Stephen Lawry\nStephen McNally as Gabriel Hoffman\nRosemary DeCamp as Vera Hoffman\nKatherine Emery as Cheli Scott\nAllen Jenkins as Marty\nJohn Emery as Paul Gerente",
      "id": "xBUFUaEcsa8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": "N/A",
    "imdbVotes": "N/A",
    "Genre": "Animation, Short",
    "Plot": "N/A",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt16899218",
      "title": "Protection Against Chemical Warfare",
      "year": 1942,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt12606824",
      "title": "Fog",
      "year": 1943,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt12305226",
      "title": "A Few Quick Facts: Japan",
      "year": 1945,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt12304756",
      "title": "A Few Quick Facts: Lend-Lease",
      "year": 1945,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2210558",
      "title": "The Princess and the Pauper",
      "year": 1939,
      "imdbRating": "5.3",
      "imdbVotes": "27",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0472483",
      "title": "Peg Leg Pedro",
      "year": 1938,
      "imdbRating": "5.7",
      "imdbVotes": "39",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt6240486",
      "title": "Voting for Service Men Overseas",
      "year": 1944,
      "imdbRating": "N/A",
      "imdbVotes": "20",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt14091630",
      "title": "Target You",
      "year": 1950,
      "imdbRating": "N/A",
      "imdbVotes": "6",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1020989",
      "title": "A Ride for Cinderella",
      "year": 1937,
      "imdbRating": "5.5",
      "imdbVotes": "44",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146584",
      "title": "Cracked Ice",
      "year": 1927,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150344",
      "title": "Dizzy Ducks",
      "year": 1937,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0475080",
      "title": "Exhibition Reel of Two Color Film",
      "year": 1929,
      "imdbRating": "4.9",
      "imdbVotes": "38",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-29T02:34:24.167Z"
}