{
  "movieId": "tt0150232",
  "title": "Crying Wolf",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/crying-wolf-1947",
      "id": "crying-wolf-1947",
      "title": "Crying Wolf (1947)",
      "description": "A Terrytoons cartoon released 10 January 1947. Amidst the rolling hills of a pastoral landscape, a faithful sheepdog diligently watches over his flock of lambs, ensuring their safety and well-being. However, trouble brews when the mischievous black sheep of the family decides to stir up chaos with his playful antics. Watch on RetroFlix:  https://retroflix.org/crying-wolf-1947/",
      "fileSize": 36611023,
      "addedAt": "2026-01-07T00:07:51.626Z",
      "thumbnail": "https://archive.org/services/img/crying-wolf-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 84
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.3,
    "imdbVotes": 32,
    "Genre": "Animation, Short",
    "Plot": "Mighty Mouse turned out to be Terrytoons' most prolific character and the series of cartoons for regular characters to last the longest. He is a serviceable enough character and likeable though a fairly limited one. Similarly his cartoons have interest value and are well made, but they are very formulaic and Mighty Mouse is in some of them too much of a supporting character rather than a lead that doesn't always add much or fit.1947 gets off to a very odd and watchable (marginally) but not much more than alright overall start with 'Crying Wolf', and it only just scrapes not being less than mediocre. It was another variable year for the studio (though a healthy dose of Heckle and Jeckle made it a little more consistent than a few of the previous years in the 40s period) and another Mighty Mouse heavy year, and 'Crying Wolf' completely epitomises what made 1947's Terrytoons cartoons variable. With all the things that were good and also with all the problems.'Crying Wolf' does by all means have things that are done quite well. The best components are the music and the animation which was always the case generally from the late 30s onwards. Well the music was a consistent redeeming trait, even in the mediocre and less Terrytoons (have never faulted it), whereas the animation for the studio started rough but the improvement seen from the late-30s or so as said quite a number of times was staggering. The music is typically lush in orchestration and rich in character, adding to and even enhancing the action brilliantly. The animation is every bit the music's equal here, the attention to detail in the backgrounds is as careful and precise as it should be, the drawing is neat and smooth and as good as that for the early Disney cartoons and the colours are vibrant.The supporting characters make a good impression. The best character, even managing to steal the show from under the wolf, is the dog. He has the best material, including providing the aforementioned most satisfying part, and is the character that for me was the most rootable, even despite not being very good at his guardian job, and that is actually saying a lot. The wolf is suitably menacing and does create some degree of tension. A good lesson in a way is taught to not tell lies for attention so that people actually believe you when trouble really happens, a lesson that's hardly out of date nowadays.It, 'Crying Wolf' that is, is a very uneven cartoon though which is what is meant by it being odd, hodge-podge sums it up well. Although two characters make a good impression, the rest do not. The little sheep that causes all the trouble in the first place, so the character that the title and famous crying wolf saying refers to, is such an obnoxious brat that sympathy is completely lost for him fast. The other sheep have little to do other than tease and be vacantly innocent. For a character who one thinks ideally should be the lead, Mighty Mouse feels much more like a supporting character and one that doesn't really fit with what goes on. His presence was not necessary and when he does appear, 'Crying Wolf' feels like a different cartoon and one that is not much better than before.Other than the music, animation and two characters, the first two so good that they are worth more than one star each, there is not a massive amount going for 'Crying Wolf'. There is not much of a story, or one that's interesting or cohesive, and most of what there is is dull and predictable. The pacing really lacks urgency and because it is so reliant on the typical Mighty Mouse formula figuring out what was going to happen next and not an original premise at all it feels really formulaic and tired. There is hardly any charm, the dog is the only character possible to get behind and there is a severe shortage of gags or certainly ones that work and don't have fatigue or corn all over them.All in all, odd. 5/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen, Roy Halee, Tom Morrison",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0151420",
    "tt0150546",
    "tt0147966",
    "tt0148292",
    "tt0148929",
    "tt0148172",
    "tt0148223",
    "tt0148343",
    "tt0148568",
    "tt0149234",
    "tt0150538",
    "tt0153196"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.626Z"
}