{
  "imdbId": "tt0134216",
  "title": "Wild Horse Round-Up",
  "year": 1936,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rofi2b4UdVs",
      "id": "rofi2b4UdVs",
      "title": "Wild Horse Round-Up (1936) KERMIT MAYNARD🍕 COWBOY WESTERN",
      "description": "First Time on YouTube!\nStars: Kermit Maynard, Beth Marion, Dickie Jones\nDirector: Alan James\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TU70mlZBH2osHskpnznWkQh\nStep into the rugged frontier with this classic Cowboy Western, produced by Ambassador Pictures and directed by Alan James. Adapted from a story by James Oliver Curwood, the film delivers action-packed adventure, set against the sweeping backdrop of the untamed West.\n\nKermit Maynard leads the cast as a determined cowboy caught in a dramatic struggle for justice and freedom. Supporting performances by Betty Lloyd, Dickie Jones, and John Merton add depth and tension to this high-stakes tale of loyalty, lawlessness, and wild mustangs. With fast-paced sequences and classic Western themes, this film captures the spirit of 1930s B-movie storytelling at its best.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🎬 Like, comment, and subscribe for more authentic Western adventures and rare public domain treasures brought back to life.\n\nIdeal for fans of vintage cinema, early Hollywood, and classic Westerns, this restored gem offers a nostalgic ride through a timeless genre. Experience a piece of film history that continues to inspire today’s storytellers and filmmakers.\n\n#WildHorseRoundUp #KermitMaynard #ClassicWestern #Beth Marion #Dickie Jones #JamesOliverCurwood #CowboyWesterns #pizzaflix",
      "addedAt": "2025-12-24T01:03:14.466Z",
      "thumbnail": "https://i.ytimg.com/vi/rofi2b4UdVs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLASeHS-SnVy6NRqxl3cAAFI9heRQQ",
      "duration": 3444,
      "language": "en",
      "year": 1936,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 6.4,
    "imdbVotes": 17,
    "Genre": "Western",
    "Plot": "The Standard Railroad Company plans to run a line through Wild Horse Valley, and this is known by Charlie Doan, who seeks to buy up all the land in the valley in order to make huge profits by reselling it to the railroad. Ranchers are forced to sell through fear of the \"Night Riders\", a group of henchmen hired by Doan. He has repeatedly tried to buy the Running M Ranch owned by Ruth Williams and her seven-year-old brother Dickie, but she refuses to sell. Roving cowhands Jack Benton and his pals Bill, Chuck and Mopey learn from Ruth about Doan's intimidating efforts to buy her ranch, and they hire on to help her with the wild horse roundup. Henchmen Steve and Pete burn the Running M's barn. Doan learns that Jack has bought an option on the Jim Green ranch and uses this information to turn Ruth against Jack. The latter tells Doan that he is a special investigator for the railroad and empowered to make property purchases for the right-of-way in his own name. Appearing to turn against Ruth and his employer, Jack makes a deal with Doan to acquire Ruth's property. But Jack has a different plan in mind that will put an end to Doan and his Night Riders.",
    "Director": "Alan James",
    "Writer": "James Oliver Curwood, Joseph O'Donnell",
    "Actors": "Kermit Maynard, Beth Marion, Dickie Jones",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027917",
    "tt0027165",
    "tt0025269",
    "tt0030959",
    "tt0024267",
    "tt0024444",
    "tt0023604",
    "tt0172155",
    "tt0036101",
    "tt0028508",
    "tt0027588",
    "tt0028098"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:25.630Z"
}