{
  "movieId": "tt0133850",
  "title": "Heroes of the Alamo",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cxT3rUsTRdQ",
      "id": "cxT3rUsTRdQ",
      "title": "Heroes of the Alamo (1937) LANE CHANDLER",
      "description": "Stars: Lane Chandler, Rex Lease, Earle Hodgins\nDirector: Harry L. Fraser\n\nIn 1833, Mexican General Antonia Santa Anna sets up border blockades to prevent American settlers from completing their frontier journeys into Texas. A fiery rabble-rouser, William H. Wharton, calls for an immediate war of independence against the general's regime. A brutal battle will lead to the historic showdown at an old Franciscan mission called the Alamo.",
      "addedAt": "2025-12-24T01:09:37.070Z",
      "thumbnail": "https://i.ytimg.com/vi/cxT3rUsTRdQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCplFLIJtVpku2UUESpe8dy3VonOQ",
      "duration": 4464,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SRJZJuBWqLI",
      "id": "SRJZJuBWqLI",
      "title": "Heroes of the Alamo (1937) Adventure, History, War Full Length Movie",
      "description": "Attempts to secure a vital Texas fortress result in a prolonged and bitter battle between Mexican and American forces.\n\nDirector: Harry L. Fraser \nWriter: Roby Wentz\nStars:  Earle Hodgins, Lane Chandler, Roger Williams\nGenres: Adventure, History, War, Western\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:50:21.468Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/SRJZJuBWqLI/maxresdefault.webp?v=63caaee7",
      "duration": 4452,
      "language": "en",
      "year": 1937,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "75 min",
    "imdbRating": 5.5,
    "imdbVotes": 88,
    "Genre": "Adventure, History, War",
    "Plot": "In early spring of 1833, the smoldering resentment of American settlers in Texas against their oppression by Mexico dictator General Santa Anna/Ana coming to a head. When a decree is issued that no more Americans may enter Texas, William H. Wharton, fiery head of a faction determined on independence or nothing, warns Stephen F. Austin that the time for half-measures is past. Austin, responsible for bringing the Americans to Texas as colonists, reminds Wharton that a settler's revolt against Mexico would dishonor his name and the arrangements he had with the Mexican government. He gets the \"Whartonites\" to agree to a general convention of all colonists. Almerian Dickinson, biggest land owner in the settlement of Gonzales, deeply in love with his wife Anne, warns Wharton that a bloody revolt would endanger every wife and mother in the colony. He proposes they send Austin to Mexico City to ask Santa Anna to grant Texans a voice in their own government. After months in Mexico City of waiting to see Santa Anna, Austin is granted a mock interview and then arrested and thrown into a dungeon. In Texas, the months pass with no news from Austin and Wharton goes to work in earnest in early 1835 to fan the fires of revolution. Santa Anna decides to march troops north and finish off the rebel \"gringos\" - a description that only came later in the conflict - once and for all, and frees Austin to serve as an example. The Texans, under Dickinson and William Barrett Travis, send the advance Mexican troops back across the border in retreat. Austin goes for help from the United States, and the Texans fortify themselves at the old Alamo mission in Bejar with Travis in command. And one February morning, his scouts bring news that Santa Anna is coming with an army of 5,000 men. Anne Dickinson takes her baby, rides for Bejar (San Antonio), slips through the Mexican lines and joins her husband in the beleaguered fort to his mingled joy and horror. The Mexican troops storm the walls day after day but are thrown back by the 183 defenders. At dawn, March 6, 1836, Santa Anna orders the buglers to sound the \"deguello\" (No quarter) and the final assault begins.",
    "Director": "Harry L. Fraser",
    "Writer": "Roby Wentz",
    "Actors": "Earle Hodgins, Lane Chandler, Roger Williams",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0169253",
    "tt0183796",
    "tt0028872",
    "tt0047146",
    "tt0029584",
    "tt0030265",
    "tt0033777",
    "tt0026249",
    "tt0031619",
    "tt0026857",
    "tt0023424",
    "tt0039987"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:57:24.249Z"
}