{
  "imdbId": "tt0151145",
  "title": "The Johnstown Flood",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-johnstown-flood-1946",
      "title": "The Johnstown Flood (1946)",
      "description": "Re-enactment of the famous May 31, 1889 Johnstown, Pennsylvania flood where the dam broke and flooded out an entire town! In this version, the town is occupied by mice and dogs. But Mighty Mouse comes to the rescue after drinking a bottle of \"Atomic Energy.\" He reverses the flood waters and puts everything back where it was. And in this cartoon, he uses magic lightning bolts coming off his hands like Merlin the Magician! Watch on RetroFlix:  https://retroflix.org/the-johnstown-flood-1946/",
      "fileSize": 34255095,
      "id": "the-johnstown-flood-1946"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.8,
    "imdbVotes": 68,
    "Genre": "Animation, Short, Comedy",
    "Plot": "Terrytoons Studios' output is very hit and miss but when seeing it as a completest it is also quite fascinating. Most of it ranges between mediocre and pretty decent, though there are cartoons of theirs that are more and also less. The Mighty Mouse cartoons up to this point of his series were generally watchable if very formulaic (though that is not the case for all), though there was yet to be one that was above very good level and Mighty Mouse himself is a pleasant enough if limited character.1946 was a patchy, well up and down, year for Mighty Mouse, despite it also being a prolific one. 'The Wicked Wolf' was by quite some way the best of the previous 1946 Mighty Mouse cartoons and a few others were quite decent too. 'My Old Kentucky Home' was very weak though and one of Mighty Mouse's worst. 'The Johnstown Flood' is not an awful lot better, for 1946 Terrytoons this was quite a lacklustre cartoon with enough halfway decent things to make it slightly watchable.Coming off best in 'The Johnstown Flood' is the music. Outstanding yet again and the component consistently good even in lesser outings such as this one. It is its usual lush and characterful self, not just adding to the action but enhancing it as well and also love how wild it is. The animation is equally great in quality, especially the backgrounds and landscapes, the characters are well drawn and the colours are really beautiful on the eye. Everything with the flood is vividly animated.Did think that the final third, or more the last two minutes, did have tension and it was exciting, despite the very end never being in doubt as it is the more of the same ending seen throughout the series. Mighty Mouse is plot-device material and feels a bit shoe-horned but one has to admire his courage in such a difficult situation.Most of the story didn't really grab me. It is a loose animated re-telling of the big flood with a Mighty Mouse to the rescue spin, so there should be no expectations of accuracy and instead try and accept it as a what if sort of story. By all means some will find it hard to do it as it was such a big disastrous event and feelings still would have been raw even years later, even though intended to be a loose re-telling some may not take kindly to this event being re-told family-friendly style and in their minds \"trivialised\". If this comes over as nit-picky or disrespectful, that is not intended and is just my perception. Only in the final portion does 'The Johnstown Flood' properly come to life.Elsewhere, 'The Johnstown Flood' takes too long to get going and despite the cartoon being short it really seemed to struggle to fill enough content to fill the length. Most of the cartoon is paper thin and stretched out and everything leading up to the final third failed to generate much sense of danger, emotion or tension. Didn't really felt emotionally invested and my interest wasn't entirely there either. None of the other characters are particularly engaging and are not particularly distinct either.In conclusion, lacklustre though the final portion or so redeems it. 4/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0151566",
      "title": "Mighty Mouse in Krakatoa",
      "year": 1945,
      "imdbRating": 7.6,
      "imdbVotes": 90,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148172",
      "title": "Fortune Hunters",
      "year": 1946,
      "imdbRating": 5.1,
      "imdbVotes": 19,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153196",
      "title": "The Tortoise Wins Again",
      "year": 1946,
      "imdbRating": 5.7,
      "imdbVotes": 22,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153059",
      "title": "Throwing the Bull",
      "year": 1946,
      "imdbRating": 7.3,
      "imdbVotes": 49,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148632",
      "title": "Post War Inventions",
      "year": 1945,
      "imdbRating": 7.1,
      "imdbVotes": 35,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149591",
      "title": "Aesop's Fable: Foiling the Fox",
      "year": 1950,
      "imdbRating": 5.5,
      "imdbVotes": 23,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150842",
      "title": "A Hare-Breadth Finish",
      "year": 1957,
      "imdbRating": 4.7,
      "imdbVotes": 26,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150589",
      "title": "Flipper Frolics",
      "year": 1952,
      "imdbRating": 4.8,
      "imdbVotes": 10,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146780",
      "title": "Frozen Feet",
      "year": 1939,
      "imdbRating": 4.6,
      "imdbVotes": 18,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151363",
      "title": "Little Red Hen",
      "year": 1955,
      "imdbVotes": 7,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153756",
      "title": "When Mousehood Was in Flower",
      "year": 1953,
      "imdbRating": 6.3,
      "imdbVotes": 41,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151560",
      "title": "Mighty Mouse Meets Deadeye Dick",
      "year": 1947,
      "imdbRating": 7.4,
      "imdbVotes": 58,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.589Z"
}