{
  "imdbId": "tt0186946",
  "title": "De padre desconocido",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/de-padre-desconocido-1949",
      "id": "de-padre-desconocido-1949",
      "title": "De Padre Desconocido(1949)",
      "description": "De padre desconocido  es una película  argentina  del género de  drama  filmada en blanco y negro dirigida por  Alberto de Zavalía  sobre un guion de  Homero Manzi  que se estrenó el 25 de mayo de 1949 y que tuvo como protagonistas a  Enrique Muiño ,  Fernando Lamas ,  Orestes Caviglia ,  Delia Garcés  y  Rosa Rosen . (Wikipedia) Sinopsis Una muchacha huérfana (Delia Garcés) que se crio en un asilo del cual luego escapa, comienza a trabajar en una orquesta pero es acusada de prostitución y detenida. Pesan sobre ella dos circunstancias que significan un estigma social: es una madre soltera que se vio obligada a entregar su hija a un matrimonio y, ella misma, es una hija de padre desconocido que para ocultar esa filiación robó la identidad de una compañera muerta. En los tribunales se enfrentan dos visiones diferentes de la problemática social: el viejo juez (Enrique Muiño) y el fiscal (Orestes Caviglia). Para el fiscal la gente “nace buena o nace mala” y nada la hace cambiar. El juez considera, en cambio, que las condiciones sociales son las que determinan la suerte de las personas. Hugo, el hijo del juez (Fernando Lamas), que había asumido la defensa por pedido de su padre –y que está casado- llega a sentir atracción por Laura y propone reconocer a la nena como propia y que se fuguen juntos para luego divorciarse. Al saberlo, el juez desarrolla un  doble discurso  que puede sintetizarse en “con todos menos con mi hijo” 1 ​ y le suplica a Laura que lo deje para evitar un escándalo. Aunque ella al comienzo se niega, cuando llega Hugo provoca el rechazo de este recibiéndolo arreglada como una prostituta. Este gesto de renunciamiento conmueve al juez y le hace sentir culpable de haber destruido la vida de la muchacha. Cuando vuelve a la isla donde aquella se encontraba, la halla desvanecida y la lleva en brazos a la casa prometiéndole ser el padre que nunca tuvo. Reparto Enrique Muiño ...Juez Pablo Maidana Fernando Lamas ...Hugo Maidana Orestes Caviglia  ... Fiscal García Delia Garcés ...Laura Rosa Rosen ...Amelia García de Maidana Aurelia Ferrer  ... Petrona Alfonso Ferrari Amores Osvaldo María Cabrera Luis de Lucía Juan Carrara Warly Ceriani Ada Cornaro Isabel Figlioli Carmen Llambí Diana Maggi Orestes Soriani Susana Vargas",
      "fileSize": 1234013097,
      "addedAt": "2026-01-07T00:07:59.605Z",
      "thumbnail": "https://archive.org/services/img/de-padre-desconocido-1949",
      "language": "spa",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 75
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "86 min",
    "imdbRating": 5.9,
    "imdbVotes": 10,
    "Genre": "Drama",
    "Plot": "N/A",
    "Director": "Alberto de Zavalía",
    "Writer": "Homero Manzi",
    "Actors": "Enrique Muiño, Fernando Lamas, Orestes Caviglia",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038872",
    "tt0187154",
    "tt0187086",
    "tt0186788",
    "tt0186929",
    "tt0178446",
    "tt0186994",
    "tt0041468",
    "tt0123161",
    "tt0032098",
    "tt0178732",
    "tt0186966"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.605Z"
}