{
  "movieId": "tt0153059",
  "title": "Throwing the Bull",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/throwing-the-bull-1946",
      "id": "throwing-the-bull-1946",
      "title": "Throwing the Bull (1946)",
      "description": "A well-to-do Spanish merchant offers a fortune in gold and the hand of his daughter in marriage to any matador who can kill the bull in the ring. But the bull defeats all comers who challenge him. Finally, Mighty Mouse enters the ring and clobbers the bull, sending him to the local butcher shop and winning the hand of the merchant's daughter. Watch on RetroFlix:  https://retroflix.org/throwing-the-bull-1946/",
      "fileSize": 37063154,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/throwing-the-bull-1946",
      "language": "eng",
      "year": 1946,
      "collection": "feature_films",
      "downloads": 71
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 7.3,
    "imdbVotes": 49,
    "Genre": "Animation, Short, Comedy",
    "Plot": "Mighty Mouse's theatrical series consisted of 80 cartoons running from 1942 and 1961. They vary in quality. Some, as far as the previous cartoons in the series go, are quite good, such as 'The Mouse of Tomorrow', 'Mighty Mouse and the Wolf', 'The Green Line' and 'The Wicked Wolf'. Others were quite weak, such as 'Eliza on the Ice', 'The Two Barbers', 'At the Circus' and 'My Old Kentucky Home'. The others are in between mediocre and slightly above average.1946's 'Throwing the Bull' is not one of the best Mighty Mouse cartoons. It is also not one of the worst. It is instead to me one of the somewhere in the middle ones, and one of the few not easy to rate or review. After watching, summing up my thoughts on 'Throwing the Bull' did take some time (usually find it much easier to do that with other Mighty Mouse cartoons, didn't have a problem with any of the previous ones) and my rating wavered between a high-ish 4 and an on the fence 5.'Throwing the Bull' certainly has its merits. The best thing about it is easily the music, done in opera/operetta style with a Spanish flavour it is really quite outstanding. Very catchy and rousing, with even some nice use of the 'Lucia Di Lammermoor' sextet. Will say though regarding the latter that something like \"Votre Toast\" (the Toreador song) from 'Carmen' would have fitted better. The animation is filled with vibrant colour, rich detail and liveliness. The way Carmensita is animated and moves is a standout.She is one of two characters that stand out. She is sultry and also very charming, her appeal understandable. The other is the bull, both amusing and formidable yet a \"villain\" sort of character (more a love rival actually really) that is oddly rootable, certainly towards the end he was. There are some nice touches, like the one where the bull sharpens his horns.However, Mighty Mouse is one-dimensional, his role is pretty much exactly the same as in the previous cartoons (which with each cartoon increasingly had the feeling of \"if you've seen one Mighty Mouse cartoon you've seen them all watching others) and what he has is not particularly funny or interesting this time round. Didn't really think he was necessarily needed and a non-recurring character could easily have taken his role and been more likeable in it. The story is inconsistent in energy, starting off well but running out of steam when the material started running out of steam.It does fail in properly capturing the excitement and danger people felt while watching bullfighting. Personally don't really have a high opinion of it outside of how it's portrayed in animation. What there are of the gags feel quite stale and even those not easily shocked watching animation are likely to find themselves taken aback at the borderline sadistic brutality of the ending that really didn't gel with the rest of the cartoon.On the whole, a bit conflicted on this. 5/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Roy Halee, Ken Schoen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148172",
    "tt0151794",
    "tt0151145",
    "tt0153196",
    "tt0151566",
    "tt0148632",
    "tt0148609",
    "tt0153469",
    "tt0150546",
    "tt0150232",
    "tt0149591",
    "tt0150061"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.284Z"
}