{
  "movieId": "tt0150073",
  "title": "Catnips of 1940",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/catnips-of-1940-1934",
      "id": "catnips-of-1940-1934",
      "title": "Catnips of 1940 (1934)",
      "description": "A Columbia Krazy Kat cartoon released October 12, 1934. Watch on RetroFlix:  https://retroflix.org/catnips-of-1940-1934/",
      "fileSize": 440546404,
      "addedAt": "2026-01-07T00:07:45.167Z",
      "thumbnail": "https://archive.org/services/img/catnips-of-1940-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 119
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "8 min",
    "imdbRating": 5.4,
    "imdbVotes": 11,
    "Genre": "Animation, Short, Comedy",
    "Plot": "Krazy is a dance instructor who is teaching moves to a quartet of clowns wearing leotards and high-heeled pumps. When the clowns are having trouble following his instructions, Krazy puts ropes on their legs to show them how to move.Momentarily, a Swedish girl with a blond spiral hair comes out of a dance school only a few yards away before entering Krazy's studio. The Swedish girl comes to Krazy, and shows him her dance skills. Krazy, however, isn't interested and therefore turns her down as he is expecting a famous soprano to arrive. The Swedish girl then shows her singing skills by letting out a high tone that jolts Krazy off his feet. But Krazy still turns her down. The Swedish girl then demonstrates her acting skills as she goes into a movable balcony, and recites some romantic poems. To keep her away, Krazy raises and sets the balcony to the peak. The Swedish girl screams in horror upon seeing no way down.A fancy car arrives just outside the studio minutes later. Exiting the vehicle is the soprano whom Krazy was waiting for. The soprano comes to Krazy, and sings a few notes for demonstration. The Swedish girl, who is still up on the movable balcony, applauds the soprano's test act. The Swedish girl is also leaning forward too much before falling off the platform and onto the soprano. The soprano is deformed as a result, and even has a distorted voice. The soprano leaves the scene embarrassed. Krazy has no choice but to pick the Swedish girl for the show.Later that night, the scene shows the outside of the theater with a banner of the event called \"The Katnips of 1940.\" The name of the soprano on the banner is also shown being replaced by that of the Swedish girl. The event is started by a group of singing can can dancers. Next it is the turn of the Swedish girl to take center stage. The Swedish girl, wearing a fedora, is at first too hesitant to step into the limelight but thankfully Krazy literally gives her a push. The Swedish girl sings, dances, and plays castanets on the stage with complete fluency. Krazy, also wearing a fedora, joins her on stage seconds afterward. With three flawless performances, both of them receive applause. After the lights move away from them and back, Krazy and the Swedish girl are seen dressed like Uncle Sam and the Statue of Liberty respectively.",
    "Director": "Manny Gould, Ben Harrison, Harry Love",
    "Writer": "Harry Love, George Herriman",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149944",
    "tt0150000",
    "tt0150128",
    "tt0151503",
    "tt0153154",
    "tt0151250",
    "tt0152586",
    "tt0149876",
    "tt0150246",
    "tt0150181",
    "tt0148132",
    "tt0151257"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.167Z"
}