{
  "imdbId": "tt0151129",
  "title": "Jesse and James",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jesse-and-james-1931",
      "id": "jesse-and-james-1931",
      "title": "Jesse and James (1931)",
      "description": "Jesse and James is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/jesse-and-james-1931/",
      "fileSize": 35789101,
      "addedAt": "2026-01-07T00:08:54.189Z",
      "thumbnail": "https://archive.org/services/img/jesse-and-james-1931",
      "language": "eng",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 59
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.2,
    "imdbVotes": 19,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. 'Jesse and James' is another 1931 Terrytoon that is decent and worth watching but doesn't blow the mind. Its main reason is mainly for anybody striving to see every Terrytoons available like me. Again though that is not the sole reason, there is much more to 'Jesse and James' than that.The best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The backgrounds for 1931 are remarkably detailed and there is some nice inventive visual detail later on in the cartoon, showing a studio that were aiming for ambition and succeeding in some aspects.Pacing is neither too hectic or dull, there is a natural charm and fun amusing moments and Jesse and James are good fun.However, as is the case with a lot of the Terrytoons cartoons, the character designs are crude and simplistic.The story is very predictable and very melodramatic for Terrytoons. A couple of the gags could have gone for it a little more with the absurdity instead of being on the bland side. The mice don't have as much personality or memorability, nowhere near as interesting as the cats.Summing up, pretty decent but not a cartoon to be watched on repeat viewings for me. 6/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0161222",
    "tt0150028",
    "tt0150155",
    "tt0151114",
    "tt0147211",
    "tt0146681",
    "tt0149979",
    "tt0149980",
    "tt0149991",
    "tt0150160",
    "tt0150161",
    "tt0150165"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:54.189Z"
}