{
  "movieId": "tt0149979",
  "title": "Bull-ero",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bull-ero-1932",
      "id": "bull-ero-1932",
      "title": "Bull-ero (1932)",
      "description": "Bull-ero is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/bull-ero-1932/",
      "fileSize": 42659079,
      "addedAt": "2026-01-07T00:07:45.165Z",
      "thumbnail": "https://archive.org/services/img/bull-ero-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 49
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.1,
    "imdbVotes": 16,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. 'Bull-ero' for me is one of the worst 1932 Terrytoons and also down there with Terrytoons' worst. The previous 1932 cartoons were very much watchable if not exactly mind-blowing. 'Bull-ero' is the first lacklustre or less cartoon of the batch. Its main reason for viewing is mainly for anybody striving to see every Terrytoons available like me. Its best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action.A couple of decent gags to be found here and there. Otherwise 'Bull-ero' has very little else to it.The animation is not good here. Even for Terrytoons, while not doing as much cheating as some earlier cartoons, it is primitive at best and there is a lot of crudeness and over-simplicity going on in the backgrounds. There is also a good deal of repetition going on and it is not clever or inspired, it just looks cheap and lazy.Story is non-existent and doesn't have any lively pacing (dull) or memorable and interesting characters to make that forgivable. It's full of stale fatigue and the unfunny, dull and derivative (repetitively used too) gags don't help.Concluding, very weak. 3/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149991",
    "tt0150160",
    "tt0150165",
    "tt0150515",
    "tt0161563",
    "tt0150516",
    "tt0150933",
    "tt0150945",
    "tt0151076",
    "tt0161863",
    "tt0161913",
    "tt0151997"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.165Z"
}