{
  "imdbId": "tt0114345",
  "title": "The Scarlet Letter",
  "year": 1995,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-scarlet-letter-full-movie",
      "id": "the-scarlet-letter-full-movie",
      "title": "The Scarlet Letter",
      "description": "After young widow Hester Prynne (Colleen Moore) gives birth to a daughter and refuses to name the father, she is forced to wear a letter \"A\" for adulteress sewn into her clothing. Hester is protecting the young minister, Arthur Dimmsdale (Hardie Albright), who is the father of her baby. But when Hes ter's husband, Roger (Henry B. Walthall) -- believed drowned at sea -- returns alive, he discovers Arthur's secret and cruelly plays upon the minister's shame to exact revenge.",
      "fileSize": 741540732,
      "addedAt": "2026-01-07T00:12:22.158Z",
      "thumbnail": "https://archive.org/services/img/the-scarlet-letter-full-movie",
      "collection": "feature_films",
      "downloads": 1631
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "135 min",
    "imdbRating": 5.3,
    "imdbVotes": 16679,
    "Genre": "Drama, Romance",
    "Plot": "In 1666 in the Massachusetts Bay colony, Puritans and the Algonquian have an uneasy truce. Hester Prynne (Demi Moore) arrives from England, seeking independence. Awaiting her husband, she establishes independence, fixing up a house, befriending Quakers and other outsiders. Passion draws her to the young pastor, Reverend Arthur Dimmesdale (Gary Oldman). He feels the same; when they learn her husband has probably died at the hands of Indians, they consummate their love. A child is born, and on the day Hester is publicly humiliated and made to wear a scarlet letter, her husband appears after a year with Indians. Calling himself Chillingworth (Robert Duvall), he seeks revenge, searching out Hester's lover and stirring fears of witchcraft. Will his murderous plot succeed?",
    "Director": "Roland Joffé",
    "Writer": "Nathaniel Hawthorne, Douglas Day Stewart",
    "Actors": "Demi Moore, Gary Oldman, Robert Duvall",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 10 nominations total"
  },
  "relatedMovies": [
    "tt0114887",
    "tt0114095",
    "tt0164648",
    "tt0111415",
    "tt0116621",
    "tt0110146",
    "tt0116102",
    "tt0137000",
    "tt0110383",
    "tt0107273",
    "tt0106941",
    "tt0132893"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.158Z"
}