{
  "movieId": "tt0148318",
  "title": "How's Crops",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hows-crops-1934",
      "id": "hows-crops-1934",
      "title": "How's Crops (1934)",
      "description": "Cubby rises and shines with the dawn, and, reading a headline, learns that a \"mysterious menace\" is attacking farms and destroying crops. He uses his ingenuity to uncover the mystery. Cubby and his girlfriend go underground and create a crop of synthetic vegetables in their underground cave-factory, then force them upward through the soil. An evil clothes-wearing opossum conspires to steal the entire load of vegetables in his pickup truck, but Cubby's worm friend tips them off. Cubby bombs the opossum with a pineapple, blowing him sky-high. Beans, peas, and other assorted objects take on lives and personalities of their own. Watch on RetroFlix:  https://retroflix.org/hows-crops-1934/",
      "fileSize": 182668300,
      "addedAt": "2026-01-07T00:08:46.614Z",
      "thumbnail": "https://archive.org/services/img/hows-crops-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 37
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.8,
    "imdbVotes": 33,
    "Genre": "Animation, Short",
    "Plot": "Van Bueren Studios' Cubby the Bear series comprised of just 19 (not the 17 as initially thought, having worked from an incomplete list listing the cartoons) cartoons made between 1933-1934. As much as it pains me to say it, speaking as a big animation fan, it is not hard to see why the character and the series weren't so popular and didn't last long.Despite my love for animation, there are a few above mediocre Cubby cartoons, such as 'The Nut Factory', 'Fresh Ham' and 'Croon Crazy'. 'How's Crops' is only to me average but is one of the better efforts of the series. The best thing about it, and this is true of a lot of Van Bueren's output, is the music score. It is so beautifully and cleverly orchestrated and full of lively energy that is sorely lacking elsewhere, doing so well with enhancing the action.The opossum is a cute and amusing character, there are some neat transitions and synchronisation and a few of the gags are fun and delightfully surreal. There are more than most Cubby cartoons and they are better than most too.However, the animation generally is really not good even for a cartoon not made on a high budget, and it is true for the Cubby the Bear series and Van Bueren in general on the whole. It's static in movement, simplistic in background detail and sloppy in drawing, with the character expressions being pretty expressionless.Another major problem is Cubby himself, on top of being poorly animated he is one of the blandest, most personality-deprived there is. Not all the gags work, some being too weird and predictable to work, and the story is paper thin with a lot of what happens being able to be smelt from miles away. Especially the ending where the outcome is obvious from the very beginning.To summarise, average but one of the better Cubby cartoons. 5/10 Bethany Cox",
    "Director": "Vernon Stallings",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0152236",
    "tt0024839",
    "tt0150013",
    "tt0148037",
    "tt0148132",
    "tt0025728",
    "tt0025328",
    "tt0151147",
    "tt0148470",
    "tt0152639",
    "tt0150523",
    "tt0151428"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.614Z"
}