{
  "imdbId": "tt0191197",
  "title": "Hermógenes Cayo (Imaginero)",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hermogenes-cayo-1969",
      "id": "hermogenes-cayo-1969",
      "title": "Hermogenes Cayo (1969)",
      "description": "Hermógenes Cayo (Imaginero)  es una película documental filmada en colores de  Argentina  dirigida por  Jorge Prelorán  según su propio guion sobre el argumento de  Isabel Franco  que se estrenó el 30 de enero de 1969 que fue musicalizado por  Leda Valladares . Está considerado uno de los mejores documentales argentinos y el director lo donó junto a sus otras películas, al Smithsonian’s Human Studies Film Archive. [ 1 ] ​ Jorge Prelorán es considerado uno de los cineastas más reconocidos en una línea de cine independiente y tercermundista como el de  Fernando Birri ,  Octavio Getino  o  Fernando Solanas , que tiene como una de sus características distintivas es la necesidad de trascender la pasividad del cine como objeto subordinado a la lógica industrial y hegemónica de los Estados Unidos. Prelorán intenta demostrar que los deseos y aspiraciones del ser humano son básicamente iguales en cualquier lugar de la tierra, esa semejanza es tan fuerte que las diferencias materiales se acaban tornando superficiales y poco importantes. Se propuso reducir las distancias y el  racismo  a través del conocimiento profundo de otros pueblos y, se opuso a los documentales etnográficos que enfocan solamente lo exótico y lo extraño de otras culturas. [ 2 ] ​ [ 3 ] ​(Wikipedia) Sinopsis La película es sobre la vida y las actividades de Hermógenes Cayo, un artesano de la Puna jujeña que se desempeñó toda su vida como santero y telero donde pintaba retratos con témperas o tallaba imágenes religiosas en madera, así como el medio en el que vivía. Cayo falleció un año antes del estreno del filme en 1968 y en marzo de 2006 sus obras (70 piezas) luego de ser restauradas por la  Fundación Antorchas  fueron exhibidas en museos. Después de mostrar un paisaje desierto, rodeado de montañas, que transmite un sentimiento de una absoluta soledad, Cayo y su mujer, describen como hacen los hilados que luego venden. También hablan de sus privaciones, como por ejemplo que para traer agua deben recorrer a pie 8 kilómetros, y Cayo dice que si bien podría trasladar hacia el agua su casa, en la que vive desde mucho tiempo atrás, prefiere seguir donde está. Más adelante la película muestra el carnaval festejado por los lugareños, que lo denominan \"la fiesta del diablo\" y diferentes personajes que acuden al mismo, así como el gran consumo de alcohol. A continuación, Cayo muestra a la cámara el interior de su casa y relata cuando en 1946 fueron a pedir a Buenos Aires por las tierras de sus antepasados. También muestra diferentes imágenes religiosas de culto católico o cristiano, habla de cuando visitó la  Basílica de Luján . Luego, Cayo viaja con su hijo a un pueblo cercano para que conozca el tren y la su vuelta pinta los paisajes por donde estuvo. [ 4 ] ​ [ 2 ] ​ [ 3 ] ​",
      "fileSize": 1036532103,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/hermogenes-cayo-1969",
      "language": "spa",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 61
    }
  ],
  "metadata": {
    "Rated": "Atp",
    "Runtime": "68 min",
    "imdbRating": 8.4,
    "imdbVotes": 29,
    "Genre": "Documentary",
    "Plot": "N/A",
    "Director": "Jorge Preloran",
    "Writer": "Isabel Franco, Jorge Preloran",
    "Actors": "Jorge Preloran",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0206649",
    "tt7322114",
    "tt0303675",
    "tt0144633",
    "tt3394640",
    "tt7322102",
    "tt0251230",
    "tt1816543",
    "tt0290100",
    "tt0294468",
    "tt0181275",
    "tt0066759"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}