{
  "movieId": "tt0124076",
  "title": "Portland Exposé",
  "year": 1957,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xZk-luAyu54",
      "id": "xZk-luAyu54",
      "title": "Portland Exposé (1957) | Colorized Public Domain Crime Drama Classic with Edward Binns",
      "description": "Portland Exposé (1957) is a gritty American crime drama directed by Harold D. Schuster that brings a semi-documentary style to the screen. This colorized edition of the public domain classic revitalizes a tense story inspired by real events in Portland, Oregon during the mid-20th century when organized crime, racketeering, and corruption were seeping into the everyday lives of American citizens. By restoring this forgotten noir-inspired gem into vibrant color, Colorized Public Domain delivers a gripping experience for modern viewers in the USA, Europe, and beyond who crave both classic storytelling and cultural history.\n\nPlot Summary:\nThe story follows George Madison (Edward Binns), an ordinary tavern owner in Portland whose life spirals into danger when he resists the local crime syndicate’s attempts to take over his business. As Madison’s quiet world collides with violence and intimidation, he finds himself caught between protecting his family and standing up against ruthless gangsters. His decision to resist makes him a target, forcing him to navigate betrayal, community fear, and escalating threats.\n\nWhat makes Portland Exposé compelling is its semi-documentary narrative approach. With voiceover narration and a focus on authentic detail, the film blends dramatization with factual inspiration from organized crime scandals of the 1940s and 1950s. The atmosphere of paranoia, distrust, and desperation reflects the anxieties of postwar America, where corruption seemed as dangerous as foreign enemies.\n\nCast and Crew:\n• Director: Harold D. Schuster\n• Producers: George Weiss, Edward Small (uncredited connections)\n• Screenplay: Jack DeWitt\n• Cinematography: Ellis W. Carter\n• Editing: Robert B. Warwick Jr.\n\nStarring:\n• Edward Binns as George Madison\n• Carolyn Craig as Ruth Madison\n• Virginia Gregg as Arline Madison\n• Lawrence Dobkin as Walter\n• Frank Gorshin as Frankie\n• Dick Kallman as Bob Madison\n• Roy Engel as Capt. Jim Flannery\n• Jeanne Cooper as Elsie Madison\n\nFilm Significance:\nPortland Exposé reflects Hollywood’s experimentation with semi-documentary noir during the 1940s and 1950s. Unlike glossy studio crime pictures, this film adopted a rawer, more realistic tone, drawing inspiration from true accounts of organized crime hearings and media exposés of the time. Edward Binns, best known for roles in Twelve Angry Men (1957) and North by Northwest (1959), carries the film with grounded strength as an everyman hero.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like Portland Exposé remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1957 release was filmed in stark black and white, reflecting its noir-inspired roots. While historically authentic, modern audiences often overlook black-and-white films. By offering a carefully colorized version, this edition bridges the gap between cultural preservation and contemporary entertainment, making the themes of corruption and community courage more immediate and visually dynamic for today’s viewers.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, including crime dramas, thrillers, forgotten noirs, and culturally significant features. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#PortlandExposé #1950sCrimeDrama #FilmNoir #PublicDomainMovie #ColorizedClassic #EdwardBinns #ClassicCrimeFilm #OrganizedCrimeDrama #FilmRestoration #1957Movies #GoldenAgeHollywood",
      "addedAt": "2025-12-24T00:47:39.350Z",
      "thumbnail": "https://i.ytimg.com/vi/xZk-luAyu54/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4JgALQBYoCDAgAEAEYZSBaKFIwDw==&rs=AOn4CLBNROmZDzFW9pnmkCKe5XnsQhdJLw",
      "duration": 4268,
      "language": "en",
      "year": 1957,
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9GA292iaphc",
      "id": "9GA292iaphc",
      "title": "Portland Exposé (1957) TRUE CRIME",
      "description": "It's FRIDAY @ PizzaFLIX\nStarring: Edward Binns, Frank Gorshin, Carolyn Craig\nDirector: Harold D. Schuster\n\nA real-life probe by a Senate investigating committee into organized crime in Portland, Oregon, sparked this hard-hitting noir with Edward Binns as a tavern owner who finds himself–and his family–caught in the battle between rival gang lords.",
      "addedAt": "2025-12-24T01:10:00.593Z",
      "thumbnail": "https://i.ytimg.com/vi/9GA292iaphc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDAXDGJmJTZEgu3piFvCv0XSSzyHA",
      "duration": 4372,
      "language": "en",
      "year": 1957,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "72 min",
    "imdbRating": 6,
    "imdbVotes": 265,
    "Genre": "Crime, Film-Noir, Mystery",
    "Plot": "A tavern owner in Portland, Oregon gets involved in a struggle for power between two gangs attempting to control the unions. When his young daughter is attacked by one of the gangsters, he joins the faction fighting against the syndicate and gets important evidence via a tape recorder. He is discovered and he and his daughter are threatened but honest union men, come to his aid.",
    "Director": "Harold D. Schuster",
    "Writer": "Jack DeWitt",
    "Actors": "Edward Binns, Carolyn Craig, Virginia Gregg",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0048072",
    "tt0048426",
    "tt0028788",
    "tt0054930",
    "tt0050241",
    "tt0037078",
    "tt0037691",
    "tt0051713",
    "tt0050526",
    "tt0050847",
    "tt0050964",
    "tt0050213"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:41:30.604Z"
}