{
  "imdbId": "tt0171301",
  "title": "Fabiola",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-fabiola",
      "id": "silent-fabiola",
      "title": "Fabiola",
      "fileSize": 1089645690,
      "addedAt": "2026-01-07T00:10:59.117Z",
      "thumbnail": "https://archive.org/services/img/silent-fabiola",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 429
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "110 min",
    "imdbRating": 5.4,
    "imdbVotes": 60,
    "Genre": "Drama, History",
    "Plot": "During Herr Enrico Guazzoni's silent period, there were two main subjects in his films that were recurrent sources of inspiration for many of his spectacular epic silent films: the Roman Empire and the beginnings of Christianity. Such an interesting historical period of the Western world had good cinematic potential with its contrast of Roman decadence and the new religion. Many times these kolossal spectacles were adaptations of novels. There would be much history in these stories but Herr Guazzoni interpreted the facts freely in giving them cinematic life.In \"Fabiola\" (1918) Herr Guarzzoni moved from the earliest days of Christianity when the new faith was struggling to just survive to a later period in the Roman Empire when the religion was a major force and attempting to win over Rome. \"Fabiola\" is a clear Christian chant and praise of its martyrs, set as usual in the cruel times wherein early Christians suffered the rule and wrath of Caesar in old Europe. Thanks to their strength and constancy, besides their faith, they finally achieved their aims so even those Roman barbarians embraced the truth faith; a very important and decisive matter for the Catholic Church as demonstrated by the fact that even today the Pope has his headquarters in Rome.\"Fabiola\" could be considered as a \"chamber\" epic historical film because even though there are the usual crowd scenes and big spectacle, a kind of intimacy prevails in many scenes during the film as we see the Roman characters and their problematic relations with the Christians. Of course there are the dramatic scenes of martyrdom as well and these are full of lyricism. In keeping with that intimacy in artistic terms, the actors perform their roles with very heavy and studied poses that may make for stereotyped figures but effectively convey the transcendental religious spirit that is at the core of the film.And now, if you'll allow me, I must temporarily take my leave because this German Count must pray for his aristocratic soul.Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com",
    "Director": "Enrico Guazzoni",
    "Writer": "Fausto Salvatori, Nicholas Patrick Wiseman",
    "Actors": "Elena Sangro, Amleto Novelli, Augusto Mastripietri",
    "Language": "None",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0004022",
    "tt0002445",
    "tt0013388",
    "tt0160467",
    "tt0007801",
    "tt0008319",
    "tt0010559",
    "tt0008252",
    "tt0010247",
    "tt0006864",
    "tt0008150",
    "tt0006614"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.117Z"
}