{
  "movieId": "tt0146721",
  "title": "Fanny's Wedding Day",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/fannys-wedding-day-1933",
      "id": "fannys-wedding-day-1933",
      "title": "Fanny's Wedding Day (1933)",
      "description": "Fanny's Wedding Day is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/fannys-wedding-day-1933/",
      "fileSize": 34889907,
      "addedAt": "2026-01-07T00:08:24.393Z",
      "thumbnail": "https://archive.org/services/img/fannys-wedding-day-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 57
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.4,
    "imdbVotes": 14,
    "Genre": "Animation, Comedy, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1933, like all the other years for Terrytoons, saw a hit and miss batch. Of which this, part of an interesting but short-lived series of cartoons, is somewhere in the middle. It is an unexceptional, nothing exactly special cartoon and has the same amount of problems as it has the amount of strengths. It is also watchable, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see and some synchronisation is neat.For a Terrytoon, the gag count is pretty high and some are amusing and sharp. There is a natural charm and the characters give the cartoon, which is not a dull one, some zest.Outside of the backgrounds however, the animation is primitive at best with a fair bit of crudeness, over-simplicity and choppiness.Likewise, the very melodramatic story is paper thin and formulaic with a big air of over-familiarity due to doing very little new with a premise that was feeling old well before this was made. A few of the gags don't quite have the lustre and cleverness as others and the cartoon sometimes feels a bit choppy, a minute longer may have helped.Altogether though, it's definitely worth a watch if more once or twice as a completest rather than over and over. 5/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150504",
    "tt0150515",
    "tt0147211",
    "tt0146681",
    "tt0146799",
    "tt0150804",
    "tt0149817",
    "tt0150130",
    "tt0150382",
    "tt0150774",
    "tt0150820",
    "tt0151001"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.393Z"
}