{
  "movieId": "tt0149234",
  "title": "Taming the Cat",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/taming-the-cat-1948",
      "id": "taming-the-cat-1948",
      "title": "Taming the Cat (1948)",
      "description": "We see a house cat next to an unoccupied birdcage as he pulls a canary feather out of his mouth. Hmm, I wonder what happened? Now he hangs up a sign: 'Songbirds Wanted'. Watch on RetroFlix:  https://retroflix.org/taming-the-cat-1948/",
      "fileSize": 39760777,
      "addedAt": "2026-01-07T00:11:46.527Z",
      "thumbnail": "https://archive.org/services/img/taming-the-cat-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 55
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 6.3,
    "imdbVotes": 34,
    "Genre": "Animation, Short",
    "Plot": "Terrytoons Studios did a number of theatrical series throughout the 40+ years they were active, their first cartoon being 1930's 'Caviar' and their last being 1971's 'The Big Freeze'. Of those theatrical series, Heckle and Jeckle, who made quite a big impression since their first cartoon (1946's 'The Uninvited Pests') is my personal favourite and is the only one where their earlier outings were consistently good rather than being either hit and miss or being one that didn't take off.1948's 'Taming the Cat' is proof of that in my view and is, again from personal opinion, one of the best of the Heckle and Jeckle cartoons. Really liked the premise and 'Taming the Cat' makes the most out of it, while not all the material is fresh the entertainment value is vast and Heckle and Jeckle themselves are very well suited to this premise (note perfect, pun intended, for it actally) while also still being true to character.Sure, it is still predictable frequently and agreed begins on the slightly odd side.Even for the series, the chopping block gag was on the slightly too cruel side.However, 'Taming the Cat' is highly successful everywhere else in near-classic Heckle and Jeckle fashion and executes the best of its components brilliantly. The biggest star being unsurprisingly the music, as it should be with it being a very musical-oriented cartoon. It is so lovely to listen to and there is such an uplifting vibe hearing it because of the snappy character it has. The song is very catchy and despite it being used more than once it doesn't get annoying. The animation is every bit as great. It is vibrantly coloured, quite smooth in drawing and transitions, doesn't look static or simplistic and the attention to detail is good.When it comes to the gags, 'Taming the Cat' scores very highly. The cartoon is filled with them and they all range from amusing to hilarious. Such as Jeckle's lady getting dressed gag, the shower gag and Heckle going in Jimmy Durante mode. The dialogue avoids being too corny and the action is deliciously anarchic, sometimes darkly so when the two get more malicious. The pace is fast and furious and the action and increasing anarchy is wonderfully chaotic, yet remarkably it doesn't feel too much of an overload. The story is not novel, but the character interaction, constant entertainment value and eventful content helped always make it interesting still.Once again, Heckle and Jeckle are highly entertaining characters, their movements, the way they talk (in the use of language and the voices themselves) and their expressions make them quite unique characters for Terrytoons. The cat is amusing while also rootable.In summary, very entertaining. 8/10.",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148929",
    "tt0148223",
    "tt0148568",
    "tt0147966",
    "tt0150232",
    "tt0150596",
    "tt0148292",
    "tt0151420",
    "tt0149160",
    "tt0149621",
    "tt0153196",
    "tt0149313"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.527Z"
}