{
  "imdbId": "tt0198814",
  "title": "The Navy Lark",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheNavyLark_970",
      "title": "The Navy Lark",
      "description": "Title: The Navy Lark Summary: Film version of a popular BBC radio show about the incompetent crew of a Royal Navy ship. Directed by: Gordon Parry Actors: Cecil Parker, Ronald Shiner, Leslie Phillips Production Company: Herbert Wilcox Productions Release Date: 27 December 1959 (UK) Aspect Ratio: 2.35 : 1 On the English Channel Island of Boonzey there is a small British Navy base serviced by minesweeper HMS Compton. The task of the vessel and its crew is to sweep the surrounding waters for German magnetic mines leftover from WW2. The task is easy since there are no mines in the local waters. Therefore, the crew spends its time in various ways in order to kill boredom. The skipper, Commander Stanton, spends his time fishing. His second in command, Lieutenant Pouter, spends his time womanizing. Chief Petty Officer Banyard and Leading Seaman Johnson spend their time smuggling booze, in collusion with the local French fishermen. However, their idyllic paradise is about to be shattered when the Navy higher-ups decide to send Captain Povey to assess the usefulness of the base and to decide whether to close it down. Sensing the danger of re-assignment to less idyllic Navy bases, the crew of minesweeper Compton decides to prove that their work in the area is vital, thus leading to their ...",
      "id": "TheNavyLark_970"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "82 min",
    "imdbRating": "6.1",
    "imdbVotes": "115",
    "Genre": "Comedy",
    "Plot": "On the English Channel Island of Boonzey there is a small British Navy base serviced by minesweeper HMS Compton. The task of the vessel and its crew is to sweep the surrounding waters for German magnetic mines leftover from WW2. The task is easy since there are no mines in the local waters. Therefore, the crew spends its time in various ways in order to kill boredom. The skipper, Commander Stanton, spends his time fishing. His second in command, Lieutenant Pouter, spends his time womanizing. Chief Petty Officer Banyard and Leading Seaman Johnson spend their time smuggling booze, in collusion with the local French fishermen. However, their idyllic paradise is about to be shattered when the Navy higher-ups decide to send Captain Povey to assess the usefulness of the base and to decide whether to close it down. Sensing the danger of re-assignment to less idyllic Navy bases, the crew of minesweeper Compton decides to prove that their work in the area is vital, thus leading to their continued presence on the island of Boonzey. But Captain Povey is no fool and he's determined to declare the entire crew of HMS Compton redundant. Commander Stanton and his Chief Petty Officer Banyard come up with a series of schemes designed to convince Captain Povey of HMS Compton's usefulness. These schemes include a live mine-sweep demonstration, using a fake mine, a fake outbreak of Yellow Fever, using the crew of HMS Compton and a local French Revolution against the British Rule on Boonzey, using some drunk French islanders.",
    "Director": "Gordon Parry",
    "Writer": "Lawrie Wyman, Sid Colin",
    "Actors": "Cecil Parker, Ronald Shiner, Leslie Phillips",
    "Language": "English, French",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0053112",
      "title": "Make Mine a Double",
      "year": 1959,
      "imdbRating": "5.6",
      "imdbVotes": "173",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0055593",
      "title": "A Coming-Out Party",
      "year": 1961,
      "imdbRating": "6.7",
      "imdbVotes": "611",
      "language": "English, German, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052655",
      "title": "A Bucket of Blood",
      "year": 1959,
      "imdbRating": "6.7",
      "imdbVotes": "8,366",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053080",
      "title": "Moonbird",
      "year": 1959,
      "imdbRating": "5.2",
      "imdbVotes": "775",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052394",
      "title": "The Wild Women of Wongo",
      "year": 1959,
      "imdbRating": "2.3",
      "imdbVotes": "1,388",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147963",
      "title": "Casper's Birthday Party",
      "year": 1959,
      "imdbRating": "5.3",
      "imdbVotes": "48",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148079",
      "title": "Doing What's Fright",
      "year": 1959,
      "imdbRating": "5.4",
      "imdbVotes": "33",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0188938",
      "title": "El negoción",
      "year": 1959,
      "imdbRating": "7.2",
      "imdbVotes": "24",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0052815",
      "title": "Follow a Star",
      "year": 1959,
      "imdbRating": "6.5",
      "imdbVotes": "623",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053134",
      "title": "Good Morning",
      "year": 1959,
      "imdbRating": "7.8",
      "imdbVotes": "11,823",
      "language": "Japanese, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148258",
      "title": "Hashimoto-San",
      "year": 1959,
      "imdbRating": "7.3",
      "imdbVotes": "6",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051815",
      "title": "Kermesse",
      "year": 1959,
      "imdbRating": "6.5",
      "imdbVotes": "13",
      "language": "Spanish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:05.034Z"
}