{
  "imdbId": "tt0195080",
  "title": "Una mujer de la calle",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/una-mujer-de-la-calle-1939",
      "id": "una-mujer-de-la-calle-1939",
      "title": "Una Mujer De La Calle (1939)",
      "description": "Una mujer de la calle  es una película de  Argentina  en blanco y negro dirigida por  Luis José Moglia Barth  según guion de  Samuel Eichelbaum  que se estrenó el 23 de agosto de 1939 y que tuvo como protagonistas a  Pepita Serrador ,  Roberto Airaldi ,  Miguel Gómez Bao  y  Aída Alberti . (Wikipedia) Sinopsis Una mujer al regresar a su barrio después de una larga ausencia desencadena conflictos y afloran sentimientos olvidados. Reparto Pepita Serrador Roberto Airaldi Miguel Gómez Bao Aída Alberti María Esther Buschiazzo José Otal Pablo Cumo Samuel Giménez Samuel Sanda",
      "fileSize": 4130418608,
      "addedAt": "2026-01-07T00:12:55.131Z",
      "thumbnail": "https://archive.org/services/img/una-mujer-de-la-calle-1939",
      "language": "spa",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 30
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "77 min",
    "imdbRating": 7,
    "imdbVotes": 13,
    "Genre": "Drama",
    "Plot": "When everything is said and done about the Argentinean movies of the thirties, this half forgotten gem deserves our attention. It is not only for oldies but for researches and all those interested in Latin American cinema. It explains something about Buenos Aires and its low class towards the end of the thirties and let you know why this city was in the past the lighthouse of Latin America. There's a splendid script by playwright Samuel Eichelbaum and quite a good direction by Moglia Barth. Beyond the not so good performances you will discover the story of a woman who gets back to the house where she was born in one of the modest areas of Buenos Aires. Again it is possible to see that getting back is no good at all. Studios were not keen on showing poverty and lust. But this movie proves what Argentinean cinema could do with first rate technicians. How was life like for this low middle class back in the thirties? Watch and see. abel posadas",
    "Director": "Luis Moglia Barth",
    "Writer": "Samuel Eichelbaum",
    "Actors": "Pepita Serrador, Roberto Airaldi, Miguel Gómez Bao",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0194654",
    "tt0194769",
    "tt0194782",
    "tt0178301",
    "tt0194732",
    "tt0194767",
    "tt0195053",
    "tt0031580",
    "tt0031925",
    "tt0031051",
    "tt0031068",
    "tt0031119"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.131Z"
}