{
  "imdbId": "tt0149870",
  "title": "The Big Game Haunt",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-big-game-haunt-1937",
      "id": "the-big-game-haunt-1937",
      "title": "The Big Game Haunt (1937)",
      "description": "The Big Game Haunt is a Terrytoons cartoon directed by Mannie Davis, George Gordon. Watch on RetroFlix:  https://retroflix.org/the-big-game-haunt-1937/",
      "fileSize": 36937976,
      "addedAt": "2026-01-07T00:11:46.533Z",
      "thumbnail": "https://archive.org/services/img/the-big-game-haunt-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 77
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.5,
    "imdbVotes": 21,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1937, like all the other years for Terrytoons, saw a hit and miss batch, more so than the other years even. Of which 'The Big Game Haunt' is one of the high middle ones ranking it in correlation with the rest of the Terrytoons and one of the better 1937 cartoons. It is an unexceptional but above average cartoon that has the same amount of problems as it has the amount of strengths. 'The Big Game Haunt' is also worth a watch, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see, as is more fluidity and visual appeal than usual, and some synchronisation is neat.Several amusing moments, with a pretty riotous second half, and there is zest and natural charm. Farmer Al Falfa is amusing and the supporting characters are great fun. However, some of the animation in transitions is a bit crude. Likewise, the story is paper thin in a practically plot-less cartoon for most of it. Gags could have been more and a few better organised. The cartoon tends to veer towards being too cute at the start and a lot of it is pretty predictable.Altogether, above average. 6/10 Bethany Cox",
    "Director": "Mannie Davis, George Gordon",
    "Writer": "Joseph Barbera, Dan Gordon, Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149974",
    "tt0150602",
    "tt0151876",
    "tt0152157",
    "tt0152275",
    "tt0152298",
    "tt0149929",
    "tt0150861",
    "tt0153103",
    "tt0153240",
    "tt0149808",
    "tt0149981"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}