{
  "movieId": "tt0148184",
  "title": "Free Enterprise",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/free-enterprise-1948",
      "id": "free-enterprise-1948",
      "title": "Free Enterprise (1948)",
      "description": "Heckle & Jeckle sneak into a prison to sell drills, hack saws and other tools to the inmates. Watch on RetroFlix:  https://retroflix.org/free-enterprise-1948/",
      "fileSize": 39652860,
      "addedAt": "2026-01-07T00:08:32.016Z",
      "thumbnail": "https://archive.org/services/img/free-enterprise-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 76
    }
  ],
  "metadata": {
    "Rated": "G",
    "Runtime": "7 min",
    "imdbRating": 5.9,
    "imdbVotes": 26,
    "Genre": "Animation, Short",
    "Plot": "When they were first introduced in 1946, Heckle and Jeckle immediately made a strong impression and their debut cartoon 'The Uninvited Pests' was a very good one. Between that and this cartoon, all their cartoons have either being good or very good. No other theatrical series from Terrytoons Studios started off this strong and was this consistent early on. And even when the series was at its weakest, it was better than a lot of the studio's theatrical series at their worst.1948's (a very good year for Heckle and Jeckle, just like the equally consistent 1947) 'Free Enterprise' is not quite one of the series' best or most inspired, and a slight let down after such a strong run in quality with the previous cartoons. It is still good fun having said that and has more than enough to show what was so appealing about the Heckle and Jeckle series. 'Free Enterprise' is a well done effort, it just isn't a great one and actually did prefer its follow up 'Out Again, In Again'.'Free Enterprise' takes a little while to find its momentum so it is a little routine at first. By early Heckle and Jeckle standards, this is also reasonably tame and not as darkly anarchic, the latter of which being the already well established tone for the series.The ending is on the slightly abrupt side and everything with the coal could have had a little more variety.However, a lot works in 'Free Enterprise'. The animation is good, with vibrant colours, nice attention to detail and far from static or simplistic backgrounds. The drawing is so much smoother than when the studio first started and the transitions are much more fluid and less choppy, nowhere near as much recycling or cutting corners either. The music never disappointed with Terrytoons, always the best asset of their worst efforts and it is one of the best things here still. Actually would go as far to say that it's even better than the animation. It is so lovely to listen to and there is such an uplifting vibe hearing it because of the snappy character it has.We are far from gag deprived in 'Free Enterprise', and they are mostly very well timed with a good deal of energy and range from very amusing to hilarious without getting too corny. Loved the tools and how they were used and the prison setting was made the most of. The character interaction is witty and sparkles at its best. Heckle and Jeckle are highly entertaining characters, their movements, the way they talk (in the use of language and the voices themselves) and their expressions make them quite unique characters for Terrytoons, although other cartoons see them more malicious. The guard dog is a nice contrast.Good fun but not great. There's better in the series. 7/10.",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150532",
    "tt0151443",
    "tt0152124",
    "tt0148042",
    "tt0148253",
    "tt0148319",
    "tt0148458",
    "tt0148378",
    "tt0148588",
    "tt0152533",
    "tt0152161",
    "tt0146300"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.016Z"
}