{
  "movieId": "tt0121574",
  "title": "La muerte camina en la lluvia",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-muerte-camina-en-la-lluvia-1948",
      "id": "la-muerte-camina-en-la-lluvia-1948",
      "title": "La Muerte Camina En La Lluvia (1948)",
      "description": "La muerte camina en la lluvia  es una película argentina en blanco y negro estrenada el 7 de septiembre de 1948 dirigida por  Carlos Hugo Christensen  basada en la novela  L'assassin habite au 21  de  Stanislas-André Steeman  y que tuvo como protagonistas principales a  Olga Zubarry ,  Guillermo Battaglia ,  Eduardo Cuitiño ,  Amalia Sánchez Ariño  y  Nicolás Fregues . Se trata de una película de misterio en torno a la investigación de un asesino múltiple del que se sabe dónde vive. Sobre el mismo libro el director de cine  francés   Henri-Georges Clouzot  realizó en 1942 una película que lleva el nombre de la novela. En una encuesta de las  100 mejores películas del cine argentino  llevada a cabo por el  Museo del Cine Pablo Ducrós Hicken  en el año 2000, la película alcanzó el puesto 35. 1 ​(Wikipedia) Sinopsis La población de  Buenos Aires  está atemorizada por los crímenes de un ladrón que ya ha matado en siete oportunidades para robar a sus víctimas. Los hechos los comete en la calle en días de lluvia y siempre deja una tarjeta con el nombre \"S. López\". A través de un periodista, Lucho Rivas (Horacio Peterson), el policía encargado de la investigación, inspector Lima (Eduardo Cuitiño), recibe la información de un ladronzuelo que ha visto que la persona que cometió el último crimen entró en una casa donde funciona la pensión 2 ​ \"Babel\". En ella viven la dueña, Valeria Duval (Margarita Corona), la novia del periodista, Lila Espinoza ( Olga Zubarry ), un actor que se dice ruso, Boris Andreieff ( Guillermo Battaglia ), un cirujano (Oerestes Soriani) a quien se le retiró el permiso para ejercer la profesión, el doctor Robledo (Nicolás Fregues), un mago que se hace llamar Merlín (Pablo Acciardi), un relojero llamado Lamas y el matrimonio Vargas (Agustín Orrequía y Amalia Sánchez Ariño). Cuando llega un nuevo huésped la policía le solicita que sea su informante pero se niega y anuncia que al día siguiente dejará la pensión. Esa misma noche es asesinado en su habitación y en ella deja su tarjeta \"S. López\". Si bien hay indicios que comprometen a varios de los huéspedes, la policía detiene a Lamas y comienza a interrogarlo; sin embargo, en un nuevo día de lluvia aparece otra víctima de \"S. López\" por lo que debe dejarlo en libertad y detiene a otro sospechoso, el doctor Robledo. El periodista sale a caminar con Boris y a poco de separarse es atacado y robado, si bien no muere, y le dejan la tarjeta de \"S. López\" por lo que Robledo es liberado. Esa noche en la pensión juegan al póquer Boris, Robledo, Lamas y Vargas. Lila que los observa sin jugar advierte que los tres primeros se hacen señas entre sí y que Vargas pierde mucho dinero, por lo que deduce que \"S. López\" no es una sola persona sino que son los tres que actúan coordinados. Se atemoriza tanto que ellos lo notan, y Lila corre a la habitación de Merlín, quien le dice que está equivocada y le pide que se vaya a dormir. Poco después, Lila baja al salón de la pensión y es sorprendida por la aparición de Boris primero y de Lamas después, quienes se acercan amenazantes. Cuando quiere huir por la escalera baja por ella un hombre que parece ser el doctor Robledo con un revólver y comienza a disparar contra los otros dos, lo que ocasiona que la policía que vigilaba fuera de la pensión ingrese a ella. El hombre del revólver se acerca a Lila, quien se da cuenta de que es Merlín disfrazado con la ropa de Robledo y se desmaya. Después le explica que las deducciones de la joven eran correctas pero aparentó no creerlas porque de lo contrario los criminales lo hubieran matado a él también, por lo cual había desmayado a Robledo de un golpe y usado su ropa para disfrazarse. Los delincuentes firmaban los crímenes para que parecieran cometidos por una misma persona y en esa forma iban siendo excluidos de la lista de sospechosos. Reparto Pablo Acciardi  ... Merlín Alfredo Alaria  ... Joven en la prueba de magia Alberto Barcel  ... Policía Guillermo Battaglia  ... Boris Andreieff Ángel Boffa  ... Barquinazo Juan Corona  ... Lamas Margarita Corona  ... Valeria Duval Eduardo Cuitiño  ... Lima Nicolás Fregues  ... Doctor Robledo Agustín Orrequia  ... Camelio Vargas Carlos Perelli  ... Norton Horacio Peterson  ... Lucho Rivas Amalia Sánchez Ariño  ... Sra. Vargas Orestes Soriani  ... Doctor Kaplan Olga Zubarry  ... Lila Espinoza Roberto Escalada  ... Relator Ramón J. Garay  ...Conserje",
      "fileSize": 1344229017,
      "addedAt": "2026-01-07T00:09:24.702Z",
      "thumbnail": "https://archive.org/services/img/la-muerte-camina-en-la-lluvia-1948",
      "language": "spa",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 134
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "73 min",
    "imdbRating": 7.1,
    "imdbVotes": 157,
    "Genre": "Crime, Mystery, Thriller",
    "Plot": "A murderer terrorizes a city by attacking on the streets on rainy days and always leaving a card with the name \"S. López\".",
    "Director": "Carlos Hugo Christensen",
    "Writer": "Carlos Hugo Christensen, Stanislas-André Steeman, César Tiempo",
    "Actors": "Olga Zubarry, Guillermo Battaglia, Eduardo Cuitiño",
    "Language": "Spanish",
    "Country": "Argentina, Venezuela",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038449",
    "tt0038445",
    "tt0184960",
    "tt0040427",
    "tt0048919",
    "tt0040270",
    "tt0040887",
    "tt0048301",
    "tt0040457",
    "tt0040695",
    "tt0027136",
    "tt0052623"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}