{
  "movieId": "tt0152226",
  "title": "Romeo and Juliet",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/romeo-and-juliet-1933",
      "id": "romeo-and-juliet-1933",
      "title": "Romeo and Juliet (1933)",
      "description": "Romeo and Juliet is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/romeo-and-juliet-1933/",
      "fileSize": 34056873,
      "addedAt": "2026-01-07T00:10:40.950Z",
      "thumbnail": "https://archive.org/services/img/romeo-and-juliet-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 85
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.9,
    "imdbVotes": 18,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1933 was again a hit and miss year for Terrytoons. 'Romeo and Juliet' is still a watchable cartoon, but is neither among the best or the worst of that year's batch. Instead it is somewhere in the firm middle. 'Romeo and Juliet' is worth a one-time watch, mainly for Terrytoons completests, but there is not much special here.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Some of the backgrounds are detailed and ambitious enough and it's a little more elaborate looking than the previous 1933 cartoons. Synchronisation is pretty neat at places.'Romeo and Juliet' has a natural charm that is unforced and never feels too sugary despite relying on cuteness. Support is fun and the lead characters while slightly bland and not much different from similar characters are moderately appealing.However, the animation is still, outside of the backgrounds, primitive at best with a fair bit of crudeness, over-simplicity and choppiness.Story is not much of time at all and doesn't really go anywhere with a lot of predictability (the story is an old and done before one and with nothing new to it) and a disjointed feel. It's another example of a Terrytoon to feel too short, needed a couple more minutes, and felt choppy and rushed as a result. The cartoon is easily forgettable fairly quickly and what little there is of the humour is random, not very funny or well-timed.All in all, another one of those watchable and inoffensive but unexceptional and not especially memorable. 5/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150804",
    "tt0149817",
    "tt0150130",
    "tt0150382",
    "tt0150504",
    "tt0146721",
    "tt0150774",
    "tt0150820",
    "tt0151001",
    "tt0151046",
    "tt0151118",
    "tt0151217"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.950Z"
}