{
  "movieId": "tt0117056",
  "title": "The Mirror",
  "year": 1997,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Mbj0ZTqVgOg",
      "id": "Mbj0ZTqVgOg",
      "title": "The Mirror",
      "description": "La película \"El espejo\" representa reflejos, pensamientos de la persona nombrada aquí como el autor. No aparece personalmente, solo suena su voz cansada. Y en la pantalla, como en un espejo, hay imágenes de su pasado. Al principio, los recuerdos parecen dispersos: amor por la madre, que el Autor no sabe cómo expresar, un sentimiento penetrante por el padre, insatisfacción consigo mismo por la relación no desarrollada con su hijo ... Poco a poco se vuelve claro: esto es el relato de una persona sobre sí misma, un juicio de conciencia difícil, tal vez incluso una sentencia. La película ocupa un lugar especial en la obra de Andrei Tarkovsky. En él, capturó a su anciana madre Maria Ivanovna Vishnyakova-Tarkovsky, detrás de escena suena la voz de su padre, el poeta Arseny Tarkovsky, recitando sus maravillosos poemas. Es una película de confesión, una película de revelación...\n\nCalificación IMDb: 8,0\n\nAño de producción: 1974\n\nDirigida por: Andrei Tarkovsky\nEscrito por: Andrei Tarkovsky, Alexander Misharin\nMúsica: Artemyev Eduard\nOperador: Rerberg Georgy\nDiseño de producción: Nikolai Dvigubsky\n\nTitulares: Nikolay Grinko, Yuri Nazarov, Anatoly Solonitsyn, Margarita Terekhova, Oleg Yankovsky, Alla Demidova, Philip Yankovsky, Ignat Daniltsev, Larisa Tarkovskaya, Tamara Ogorodnikova",
      "addedAt": "2025-12-23T03:45:04.500Z",
      "thumbnail": "https://i.ytimg.com/vi/Mbj0ZTqVgOg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD5fa8Wo3cVWvMCdEJX-v_JRV7sqw",
      "duration": 6379,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 7.5,
    "imdbVotes": 3228,
    "Genre": "Drama",
    "Plot": "When a young girl becomes lost in the hustle and bustle of Tehran, her journey turns into a dazzling exercise on the nature of film itself. In this ingenious and daringly original feature, world renowned director Jafar Panahi (The White Balloon, Crimson gold) has wrapped a blunt political critique inside the layers of a deceptively simple film.",
    "Director": "Jafar Panahi",
    "Writer": "Jafar Panahi",
    "Actors": "Mina Mohammad Khani, Kazem Mojdehi, Naser Omuni",
    "Language": "Persian",
    "Country": "Iran",
    "Awards": "4 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt1779491",
    "tt0117496",
    "tt0159086",
    "tt0120585",
    "tt0132893",
    "tt0119173",
    "tt0157053",
    "tt0119358",
    "tt0118883",
    "tt0119468",
    "tt0118566",
    "tt0119837"
  ],
  "collections": [
    {
      "id": "1990s",
      "name": "1990s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-23T04:02:26.682Z"
}