{
  "imdbId": "tt0167346",
  "title": "The Last Inch",
  "year": 1959,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LastInch",
      "id": "LastInch",
      "title": "Last inch",
      "description": "Post-war years, coast of the North Africa. To jobless pilot Ben Esli offer for the big money dangerous work â underwater shootings of sharks. Ben and his son Devi who has asked the father to take of it with self, fly on distant deserted seacoast. During shootings Ben receives a serious trauma, and the boy, saving a life to itself and to the father, wears out it in the plane and flies up. Ben, fainting, learns the Davy to operate car, and that overcomes a dangerous way and puts the plane in airdrome â having made all correctly to last inch â¦",
      "fileSize": 1618326721,
      "addedAt": "2026-01-07T00:06:30.622Z",
      "thumbnail": "https://archive.org/services/img/LastInch",
      "collection": "feature_films",
      "downloads": 2320
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "88 min",
    "imdbRating": 7.2,
    "imdbVotes": 298,
    "Genre": "Adventure, Drama",
    "Plot": "Based on the short story by James Aldridge. Excellent, but elderly pilot Ben agrees to do dangerous underwater shooting for television. Together with his 12-yo son Davy, he flies a light sports plane to Shark Bay. A long time Davy is sitting on the beach. Finally, from the ocean a bloodied Ben appears. The boy hardly can drag his father back to the plane. Ben had only once shown him how to fly a plane. He also had explained that it was the last inch above the ground that mattered if the plane was going to crash while landing or not.",
    "Director": "Nikita Kurikhin, Teodor Vulfovich",
    "Writer": "James Aldridge, Leonid Belokurov",
    "Actors": "Nikolai Kryukov, Vladislav Muratov, Mikhail Gluzskiy",
    "Language": "Russian",
    "Country": "Soviet Union",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0052604",
    "tt0052538",
    "tt0053126",
    "tt0053234",
    "tt0052902",
    "tt0053106",
    "tt0052170",
    "tt0051702",
    "tt0051398",
    "tt0053935",
    "tt0055282",
    "tt0053580"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.622Z"
}