{
  "movieId": "tt0148357",
  "title": "Jitterbug Knights",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/jitterbug-knights-1939",
      "id": "jitterbug-knights-1939",
      "title": "Jitterbug Knights (1939)",
      "description": "The king paces back and forth; a knight rushes in with the news: It's a boy! The knight visits the three wise fairies with the news, inviting them to a ball in celebration. The fairies arrive (singing), and bestow various blessings on the child (including dancing the jitterbug). There follows some general merriment and dancing, until the clock strikes three. Everyone leaves to let the baby sleep, but he's not done yet -- a full set of percussion instruments pops up in his bed, and his drum solo brings everyone back for more. Watch on RetroFlix:  https://retroflix.org/jitterbug-knights-1939/",
      "fileSize": 230625446,
      "addedAt": "2026-01-07T00:09:15.996Z",
      "thumbnail": "https://archive.org/services/img/jitterbug-knights-1939",
      "language": "eng",
      "year": 1939,
      "collection": "feature_films",
      "downloads": 125
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.2,
    "imdbVotes": 16,
    "Genre": "Animation, Short",
    "Plot": "The king paces back and forth; a knight rushes in with the news: It's a boy! The knight visits the three wise fairies with the news, inviting them to a ball in celebration. The fairies arrive (singing), and bestow various blessings on the child (including dancing the jitterbug). There follows some general merriment and dancing, until the clock strikes three. Everyone leaves to let the baby sleep, but he's not done yet -- a full set of percussion instruments pops up in his bed, and his drum solo brings everyone back for more.",
    "Director": "Sid Marcus",
    "Writer": "Sid Marcus",
    "Actors": "Danny Webb",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148315",
    "tt0032238",
    "tt0148629",
    "tt0148090",
    "tt0148589",
    "tt0148435",
    "tt0149382",
    "tt0148270",
    "tt0148665",
    "tt0150235",
    "tt0149270",
    "tt0152334"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:15.996Z"
}