{
  "imdbId": "tt0176834",
  "title": "The Springtime of Life",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheSpringtimeOfLifeForYT",
      "title": "\"The Springtime of Life\" (1912)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"The Springtime of Life\" is a drama starring Victor Sjöström (Seastrom), a star of Silent Hall of Fame.     A little orphaned girl goes through many trials and tribulations before finding her place in life and her true love.     The film stars Victor Sjöström and features Mauritz Stiller in acting roles. These two personalities in a few years would graduate to directing and become world famous through their masterpieces created both in Sweden and in Hollywood.     Before WWI European cinema was the most advanced in the world and \"The Springtime of Life\" is an example of a very mature film from the early years of movie making.   Directed by                          Paul Garbagni Produced by                        a branch of the French company Pathé Frères Scenario by                          Paul Garbagni based on the novel by August Blanche Cinematography                Julius Jaenzon Starring                                Victor Sjöström, Selma Wiklund af Klercker, Mauritz Stiller, Georg af Klercker, Astrid Engelbrecht Distributed by                     Pathé Frères Release date                         1912 Running time                       57 min. Country                                Sweden Language                              Silent, Swedish intertitles, English subtitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 125646415,
      "id": "TheSpringtimeOfLifeForYT"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "54 min",
    "imdbRating": 6.3,
    "imdbVotes": 123,
    "Genre": "Drama",
    "Plot": "Little Gerta, when her mother dies. is brought to her father, Carl Von Seydling, a government official, who deserted his wife and child a few years before. Councilor Van Seydling found the child's presence in his household to be cumbersome and for that reason turned her over to one Sarah Anderson, a nurse. Although Van Seydling did not know it, the Anderson woman was a notorious fagin. She promptly sold Gerta to a beggar, who taught her to beg and to steal. One of her begging trips brings Gerta to the attention of a young man named Alm Stoddard, He becomes interested in the pretty child and upon learning her story is horrified. The police are notified. They arrest her supposed father, but Sarah Anderson escapes. Little Gerta is adopted by Alm's mother and grows to be a beautiful young woman. Alm falls in love with her, but Gerta has lost her heart to the dashing Lieutenant Wiles. Through Alm's efforts the character of this man is shown to Gerta, and thus she is warned in time. Lieutenant Wiles challenges Alm to a duel and in the encounter Alm is wounded slightly. Gerta, frightened by the trouble she has caused, disappears, leaving a note begging the Stoddards to forgive her seeming ingratitude. Some years later a grand opera star, Mlle. Hauser, has taken the public by storm. Among her admirers is Alm Stoddard, although he is too fainthearted to write to her or tell her that he knows her to be little Gerta. She, from behind the footlights, has recognized him but, fearing he has not forgiven her, makes no sign of recognition. Another man, in constant attendance at the opera, is Councilor Van Seydling, who has long since believed his daughter dead. By a strange coincidence Sarah Anderson is employed as Gerta's maid. She has not reformed any and when she steals Mlle, Hauser's handbag she extracts a picture of a very little girl. Looking at the picture Sarah suddenly realizes that Mlle. Hauser is none other than little Gerta. That evening the audience is assembled when a fire breaks out. In the panic that follows Alm is the only one who remembers Gerta. At the risk of his life he brings the unconscious girl out of danger. At the corner drug store Sarah Anderson, mortally injured, is dying. She bares the story of her life and among the listeners is Councilor Von Seydling. The memory of his misdeeds strikes terror to his heart. Van Seydling hurries out and, finding his daughter in the arms of Alm, begs her to forgive him. The girl is mystified, but a little explaining clears the situation. Following custom, Alm asks her father for her hand. Von Seydling asks Gerta to decide and she, clinging to Alm, smiles her contentment.",
    "Director": "Paul Garbagni",
    "Writer": "August Blanche, Paul Garbagni, Abdon Hedman",
    "Actors": "Victor Sjöström, Anna Norrie, Georg af Klercker",
    "Language": "None, Swedish",
    "Country": "Sweden, France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0002381",
      "title": "The Musketeers of Pig Alley",
      "year": 1912,
      "imdbRating": 6.6,
      "imdbVotes": 2540,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002054",
      "title": "A Beast at Bay",
      "year": 1912,
      "imdbRating": 5.8,
      "imdbVotes": 220,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002082",
      "title": "The Burglar's Dilemma",
      "year": 1912,
      "imdbRating": 6,
      "imdbVotes": 429,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002098",
      "title": "Children Who Labor",
      "year": 1912,
      "imdbRating": 5.9,
      "imdbVotes": 152,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002143",
      "title": "Dr. Jekyll and Mr. Hyde",
      "year": 1912,
      "imdbRating": 6,
      "imdbVotes": 893,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002101",
      "title": "Cleopatra",
      "year": 1912,
      "imdbRating": 5.1,
      "imdbVotes": 571,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002121",
      "title": "A Cry for Help",
      "year": 1912,
      "imdbRating": 4.9,
      "imdbVotes": 49,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002342",
      "title": "Man's Genesis",
      "year": 1912,
      "imdbRating": 5.7,
      "imdbVotes": 112,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002400",
      "title": "The Old Actor",
      "year": 1912,
      "imdbRating": 5.7,
      "imdbVotes": 264,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002408",
      "title": "One Is Business, the Other Crime",
      "year": 1912,
      "imdbRating": 6.2,
      "imdbVotes": 325,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002212",
      "title": "The God Within",
      "year": 1912,
      "imdbRating": 5.6,
      "imdbVotes": 44,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002386",
      "title": "The Narrow Road",
      "year": 1912,
      "imdbRating": 5.9,
      "imdbVotes": 162,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.036Z"
}