{
  "imdbId": "tt0132024",
  "title": "Celles qui s'en font",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/celles-qui-sen-font_1928",
      "title": "Celles qui s'en font",
      "fileSize": 206376781,
      "id": "celles-qui-sen-font_1928"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 6.6,
    "imdbVotes": 179,
    "Genre": "Short, Comedy",
    "Plot": "Celles qui s'en font' comprises of two little scenarios, each about three minutes in length. The first shows an obviously poor, \"triste\" and probably already a little crazy, fairly young woman sitting outside of a pub/bar/whatever having a drink. With great sadness and some disdain she watches the cheerful people around her, then gets up and walks through the streets, sees herself in a mirror and tears start running down her face. The second scenario is in a similar vein, at least in terms of overall feel. A young, unhappy woman strolls through the streets and through flashbacks we see why she is so gloomy. Maybe the scenarios aren't connected but the two women were played by the same actress so I interpreted the second one as quasi being a flashback of the first one (she has a missing tooth in the first scenario so that one would definitely have to come later).It's all pretty simple, much more poetic realist instead of superimpressionistic like a lot of Dulac's other works. Nevertheless the emotions as well as the localities are very palpable. I was very much reminded of especially the first section of Jean Epstein's 'Coeur fidèle' like when the characters in that film stand or sit ashore and absentmindedly gaze into the ocean. Instead of a longing for love the predominant feeling here is one of utter loneliness and hopelessness.But probably the most noteworthy thing about this so-called \"silent\" film is that it is meant to be shown with two specific chansons for a soundtrack. I think it wouldn't be a stretch to make a case for the film to be the first music video ever made, at any rate it apparently was meant to serve as an illustration of two songs. 'Celles qui s'en font' is featured on disc 1 of the DVD box set \"Retour de Flamme\" (which is also available as individual DVDs) and it shows the film with its intended soundtrack. In the film it looks like the protagonists are mumbling to themselves, which would seem to fit their characters well enough, and this is maybe even what they are supposed to do in the story, but I'm convinced that more than that they are also mouthing the vocals of the songs. In the DVD restoration(?) however the mouth movement never really matches the vocals, so I think something isn't right. Maybe the footage is incomplete, maybe the frame-rate is off, or maybe the music is just not synchronized well. This is quite unfortunate, but at least one gets the general idea of what Germaine Dulac (probably) intended.One IMDb reviewer wrote that the two chansons that the soundtrack consists of (\"Toute seule\" &amp; \"A la dérive\", both performed by Fréhel) were recorded in 1930 and concluded that thus instead of 1928 the film more likely was also made in 1930 (or possibly shortly thereafter), which seems like a very reasonable conclusion to me.",
    "Director": "Germaine Dulac",
    "Writer": "N/A",
    "Actors": "Lilian Constantini, Georges Vallée",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0132076",
      "title": "Danses espagnoles",
      "year": 1928,
      "imdbRating": 5.9,
      "imdbVotes": 88,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0017775",
      "title": "The Seashell and the Clergyman",
      "year": 1928,
      "imdbRating": 7,
      "imdbVotes": 2330,
      "language": "French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021576",
      "title": "À Propos de Nice",
      "year": 1930,
      "imdbRating": 7.4,
      "imdbVotes": 4591,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020927",
      "title": "The Golf Specialist",
      "year": 1930,
      "imdbRating": 6.2,
      "imdbVotes": 1259,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021590",
      "title": "Ain't Nature Grand!",
      "year": 1930,
      "imdbRating": 5.3,
      "imdbVotes": 258,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0021660",
      "title": "Big Man from the North",
      "year": 1930,
      "imdbRating": 5.8,
      "imdbVotes": 286,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020705",
      "title": "Box Car Blues",
      "year": 1930,
      "imdbRating": 5.3,
      "imdbVotes": 236,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020767",
      "title": "Circus Capers",
      "year": 1930,
      "imdbRating": 5.4,
      "imdbVotes": 108,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020784",
      "title": "Congo Jazz",
      "year": 1930,
      "imdbRating": 5.7,
      "imdbVotes": 482,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020907",
      "title": "Frozen Frolics",
      "year": 1930,
      "imdbRating": 4.3,
      "imdbVotes": 122,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146845",
      "title": "Gypped in Egypt",
      "year": 1930,
      "imdbRating": 6,
      "imdbVotes": 59,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0020983",
      "title": "Hold Anything",
      "year": 1930,
      "imdbRating": 5.4,
      "imdbVotes": 291,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.167Z"
}