{
  "imdbId": "tt0183884",
  "title": "This Is Not a Test",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThisisNotaTest",
      "title": "This Is Not a Test",
      "description": "Late one night on a rural road in the western US, a policeman sets up a roadblock and begins stopping all traffic. When several cars and a big truck have stopped, he and the others learn the reason for this roadblock........",
      "id": "ThisisNotaTest"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=imtcDPvol9w",
      "title": "This Is Not a Test (1962) | Colorized Public Domain Cold War Thriller | Seamon Glass and Mary Morlas",
      "description": "This Is Not a Test (1962) is an American independent Cold War thriller directed by Fredric Gadette. Produced at the height of nuclear anxiety, the film explores the human side of impending disaster, emphasizing psychological breakdown and moral choices in the face of annihilation. This restored and colorized edition revives a rarely seen public domain classic that reflects the tense atmosphere of the early 1960s, when nuclear drills, fallout shelters, and doomsday scenarios dominated American life. By upgrading this low-budget drama into color, we bring fresh accessibility to today’s audiences in the United States, Europe, and worldwide.\n\nPlot Summary:\nHighway patrolman Sergeant Dan Mathews (Seamon Glass) receives an urgent bulletin while on night duty: a nuclear missile attack against the United States is imminent. Ordered to halt traffic along a mountain road, Mathews stops a small group of motorists and warns them of the situation. The group includes Joe and Alice Johnson (Thom Carney and Mary Morlas), a married couple; a truck driver hauling sensitive cargo; and several stranded travelers.\n\nAs the reality of nuclear devastation looms, fear and desperation take hold. Attempts to construct a makeshift fallout shelter quickly turn chaotic as tensions erupt between the stranded civilians. Suspicion, selfishness, and survival instincts dominate, revealing the fragile nature of human cooperation under extreme pressure. Unlike larger-budget disaster films, This Is Not a Test focuses tightly on a small, confined cast of characters, forcing viewers to confront uncomfortable questions about morality, trust, and the breakdown of order when society collapses. The chilling ending underscores the futility of preparation in the face of overwhelming destruction.\n\nCast and Crew:\n• Director: Fredric Gadette\n• Producer: Fredric Gadette\n• Cinematography: William De Anda\n• Editing: Stanford T. Sherman\n\nStarring:\n• Seamon Glass as Sgt. Dan Mathews\n• Mary Morlas as Alice Johnson\n• Thom Carney as Joe Johnson\n• Aubrey Martin as Pete\n• Michael Greene as Colter\n• Norman Winston as Harry\n\nFilm Significance:\nThis Is Not a Test is a quintessential Cold War relic that mirrors American cultural anxieties of the early 1960s. Released the same year as the Cuban Missile Crisis, its themes of civil defense, panic, and mistrust echoed real-world fears. While modest in production values, it stands out for its psychological realism and willingness to explore the darker side of human behavior. Today, it serves as both a tense thriller and a historical artifact of an era when nuclear war felt imminent. For fans of post-apocalyptic and survival cinema, it provides an essential link between 1950s atomic-age sci-fi and later, more polished doomsday dramas.\n\nEnhanced Public Domain Explanation:\nThis film is in the public domain, which means it is completely free of copyright restrictions and can be legally shared, viewed, studied, and preserved without limitation. Colorized Public Domain restores and enhances these historic works through careful digital cleaning, visual restoration, and colorization techniques. Our mission is to ensure that timeless classics like This Is Not a Test remain available to a worldwide audience. By presenting them in color and modern quality, we make them more engaging and accessible to younger generations who might otherwise overlook black-and-white cinema. This process respects the original film while providing a new layer of appreciation for today’s viewers.\n\nWhy Watch This Colorized Edition:\nThe original 1962 release was in stark black and white, emphasizing the bleakness of nuclear war. While historically faithful, black-and-white presentation often discourages modern audiences. Our colorized edition heightens the realism of the night patrol scenes, the improvised shelter, and the expressions of panic and despair — making the human drama more immediate and impactful. This adaptation bridges Cold War authenticity with contemporary viewing habits.\n\nSubscribe and Explore More Classics:\n📌 Subscribe for more colorized classics: https://www.youtube.com/@ColorizedPublicDomain?sub_confirmation=1\n\nWe upload restored and colorized films from the Golden Age of cinema, from forgotten thrillers and B-movies to culturally significant dramas and comedies. Our work ensures these treasures remain discoverable, enjoyable, and preserved for audiences in the USA, Europe, and worldwide.\n\n#ThisIsNotATest #1960sThriller #ColdWarCinema #PublicDomainMovie #ColorizedClassic #NuclearAnxiety #CivilDefenseFilm #FilmRestoration #1962Movies #ApocalypseDrama #FredricGadette",
      "id": "imtcDPvol9w",
      "channelName": "Colorized Public Domain",
      "channelId": "UCgLqpXqmEJoyDYE_lpY1DXg"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fug9cVLHfCg",
      "title": "This Is Not a Test (1962) NUCLEAR SCARE",
      "description": "Stars: Seamon Glass, Thayer Roberts, Aubrey Martin\nDirector: Fredric Gadette \n\n A highway patrolman stops motorists on a highway after he hears news reports of a possible nuclear attack. He tells them their best chance at survival is to use it as a bomb shelter. Time is short and tensions in the small group quickly rise.",
      "id": "fug9cVLHfCg",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "73 min",
    "imdbRating": "5.3",
    "imdbVotes": "923",
    "Genre": "Drama, Sci-Fi",
    "Plot": "Late one night on a rural road in the western US, a policeman sets up a roadblock and begins stopping all traffic. When several cars and a big truck have stopped, he tells everyone why: a nuclear attack on the US appears to be underway, and since they have the truck there, their best chance at survival is to use it as a bomb shelter. Time is short and tensions in the small group quickly rise.",
    "Director": "Fredric Gadette",
    "Writer": "Peter Abenheim, Betty Lasky, Fredric Gadette",
    "Actors": "Seamon Glass, Thayer Roberts, Aubrey Martin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0054790",
      "title": "The Day the Earth Caught Fire",
      "year": 1961,
      "imdbRating": "7.2",
      "imdbVotes": "6,463",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0058084",
      "title": "Frozen Alive",
      "year": 1964,
      "imdbRating": "4.0",
      "imdbVotes": "655",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0058700",
      "title": "The Last Man on Earth",
      "year": 1964,
      "imdbRating": "6.7",
      "imdbVotes": "23,253",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053137",
      "title": "On the Beach",
      "year": 1959,
      "imdbRating": "7.1",
      "imdbVotes": "15,437",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053072",
      "title": "Missile to the Moon",
      "year": 1958,
      "imdbRating": "4.1",
      "imdbVotes": "1,542",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051020",
      "title": "The Strange World of Planet X",
      "year": 1958,
      "imdbRating": "4.8",
      "imdbVotes": "1,381",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0051622",
      "title": "The Fly",
      "year": 1958,
      "imdbRating": "7.1",
      "imdbVotes": "27,212",
      "language": "English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0199145",
      "title": "World Without Shame",
      "year": 1962,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt14407336",
      "title": "The Beast",
      "year": 2023,
      "imdbRating": "6.5",
      "imdbVotes": "11,356",
      "language": "French, English",
      "sourceType": "youtube",
      "channelName": "Moviedome"
    },
    {
      "imdbId": "tt0054803",
      "title": "Nine Days of One Year",
      "year": 1962,
      "imdbRating": "7.5",
      "imdbVotes": "1,296",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0079944",
      "title": "Stalker",
      "year": 1979,
      "imdbRating": "8.0",
      "imdbVotes": "153,633",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0087803",
      "title": "1984",
      "year": 1984,
      "imdbRating": "7.0",
      "imdbVotes": "85,708",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:11.886Z"
}