{
  "movieId": "tt0149160",
  "title": "The Stowaways",
  "year": 1949,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-stowaways-1949",
      "id": "the-stowaways-1949",
      "title": "The Stowaways (1949)",
      "description": "The magpies decide to stow away aboard a luxury flight to Africa, and of course mayhem ensues. Watch on RetroFlix:  https://retroflix.org/the-stowaways-1949/",
      "fileSize": 38277494,
      "addedAt": "2026-01-07T00:12:33.204Z",
      "thumbnail": "https://archive.org/services/img/the-stowaways-1949",
      "language": "eng",
      "year": 1949,
      "collection": "feature_films",
      "downloads": 61
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.8,
    "imdbVotes": 24,
    "Genre": "Animation, Short",
    "Plot": "In my opinion, the Heckle and Jeckle theatrical series is generally the best of Terrytoons Studios' regular character theatrical series (do like enough cartoons from that of Gandy/Sourpuss too). Which generally were interesting watches, if more the earlier ones than the later ones, but not all of them did much for me. It does help too that Heckle and Jeckle themselves are compelling lead characters in the way that some of the studio's other recurring characters weren't.1949's 'The Stowaways' is unfortunately not one of their best. It is not one of their overall worst, but when talking about their early efforts it is one of their weakest. 'The Stowaways' has a lot of great things and has a few interest points, but it doesn't start off that promising and ends pretty weakly. Which was unusual for the Heckle and Jeckle series at this point. Anybody that doesn't like stereotypes, and there are plenty out there, are also best warned.'The Stowaways' as said doesn't start very promisingly. Pretty slow and thin in content. As said too the ending is less than great too, too cruel (Heckle and Jeckle are malicious but their treatment was rather extreme) and containing some dubious stereotypes.Story-wise, there is not much special. In this regard, 'The Stowaways' is actually pretty thin on the ground. The material is amusing but not particularly hilarious.On the other hand, the animation is great. It is vibrantly coloured, quite smooth in drawing and transitions, doesn't look static or simplistic and the attention to detail is more ambitious to usual (and Terrytoons had already adopted a more ambitious visual style since the late 30s). Do agree that the fuel lines and engines sequence is a very elaborate piece of animation, especially in Heckle and Jeckle's character animation. The music never disappointed with Terrytoons, always the best asset of their worst efforts and it is one of the best things here still. It is so lovely to listen to and there is such an uplifting vibe hearing it because of the snappy character it has.If one is thinking of giving up on 'The Stowaways' from the first couple of minutes, my honest advice is stick with it as it does get better. While there are higher gag counts in other Heckle and Jeckle cartoons, 'The Stowaways' is hardly devoid of them and they are amusing and well timed at least without being corny. The social commentary and the portrayal of luxury air travel indeed fascinates. The pace is lively on the most part, especially in the second half. Heckle and Jeckle are still amusing and well defined characters.Concluding, not great but worthwhile. 6/10.",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150596",
    "tt0151420",
    "tt0148929",
    "tt0149621",
    "tt0148223",
    "tt0148568",
    "tt0149234",
    "tt0147966",
    "tt0150232",
    "tt0148500",
    "tt0150882",
    "tt0148292"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.204Z"
}