{
  "imdbId": "tt0174958",
  "title": "El nacimiento de un libro",
  "year": 1963,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-nacimiento-de-un-libro-1963",
      "id": "el-nacimiento-de-un-libro-1963",
      "title": "El Nacimiento De Un Libro (1963)",
      "description": "Año de producción: 1964 (1963 según Feldman). Dirección, libro y guión: Mario Sábato. Iluminación: Ignacio Souto. Música: Astor Piazzolla. Cámara: Ramón Carboneli y Christian Tinkelenberg. Asistente de Dirección: Ricardo Feliú. Montaje: Antonio Ripoll. Producción: Enrique Padilla. Intérpretes: Egle Martin, Roberto Vilas y Ernesto Bianco. Sistema color: blanco y negro. Duración: 17 min. (Rehime) Sinopsis Registra en imágenes el momento creador y el nacimiento de los personajes del libro \"Sobre Héroes y Tumbas\" de Ernesto Sábato Festivales y muestras Tercer premio de Instituto Nacional de Cinematografía. Primer premio del Primer Festival Argentino del Film de Arte de Cortometraje en la categoría blanco y negro. Participó de la muestra \"Cine Corto Argentino 1958/1964\", organizada por el Centro de las Artes de Expresión Audiovisual del Instituto Torcuato Di Tella con la colaboración de la Cinemateca Argentina, realizada los días 15 al 19 de diciembre de 1964. Estuvo compuesta por 31 cortometrajes seleccionados por Jorge Miguel Couselo, Andrés Rolando Fustiñana y Leopoldo Torre Nilsson, con el criterio de considerarlos obras representativas del \"nuevo movimiento\" de realizadores de cortometrajes: la \"Generación Cortometrajista\".",
      "fileSize": 262817171,
      "addedAt": "2026-01-07T00:08:15.379Z",
      "thumbnail": "https://archive.org/services/img/el-nacimiento-de-un-libro-1963",
      "language": "spa",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 77
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "N/A",
    "Plot": "N/A",
    "Director": "Mario Sábato",
    "Writer": "Mario Sábato",
    "Actors": "N/A",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt25681212",
    "tt0059640",
    "tt32331335",
    "tt24820646",
    "tt5255878",
    "tt0140022",
    "tt0055837",
    "tt0155347",
    "tt0193363",
    "tt0058683",
    "tt25610282",
    "tt0186003"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.379Z"
}