{
  "imdbId": "tt0127656",
  "title": "Lightning Triggers",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QzIGzPipBpI",
      "id": "QzIGzPipBpI",
      "title": "Lightning Triggers (1935) REB RUSSELL",
      "description": "Stars: Reb Russell, Yvonne Pelletier, Fred Kohler\nDirector: S. Roy Luby\n\nAn undercover agent for the Cattleman's Protective Association goes into the hideout of rustler chief Bull Thompson (Fred Kohler) posing as an outlaw.",
      "addedAt": "2025-12-24T01:06:39.473Z",
      "thumbnail": "https://i.ytimg.com/vi/QzIGzPipBpI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLADyjCdZNhTCtOkZF4KmMgdDRjSng",
      "duration": 3279,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "58 min",
    "imdbRating": 4.2,
    "imdbVotes": 23,
    "Genre": "Western",
    "Plot": "Reb Russell (Reb Russell), undercover agent for the Cattleman's Protective Association, goes into the stronghold hideout of rustler chief Bull Thompson (Fred Kohler) posing as an outlaw. He falls in love with Marion, Bull's step-daughter. Juan (Dick Botiller), a gang member once jailed by Reb, reveals Reb's true identity, but he will be given his and Marion's freedom to leavy the valley if he can beat Thompson in a fight. He does, but Butch Greer (Jack Rockwell), a gang member trying to take over from Thompson leads the gang after the pair, after first revealing to Thompson that Reb is Thompson's own son, whom he last saw as a baby when Thompson, then known as Big Bill Russell,was forced to flee the law. Thompson and loyal gang member Blackie (Edmund Cobb), who was once helped by Reb, go after the gang in an effort to help Reb and Marion escape. A nearly-exact remake of 1932's \"Lawless Valley\", which was written by Oliver Drake who received no credit (or payment according to him, and he would have been the one who knew) for this version.",
    "Director": "S. Roy Luby",
    "Writer": "Oliver Drake",
    "Actors": "Reb Russell, Rebel, Yvonne Pelletier",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0026080",
    "tt0203825",
    "tt0027514",
    "tt0132909",
    "tt0028199",
    "tt0028649",
    "tt0029473",
    "tt0176564",
    "tt0025454",
    "tt0034541",
    "tt0036096",
    "tt0035263"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:36:52.919Z"
}