{
  "movieId": "tt0151520",
  "title": "The Mechanical Cow",
  "year": 1937,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-mechanical-cow-1937",
      "id": "the-mechanical-cow-1937",
      "title": "The Mechanical Cow (1937)",
      "description": "The Mechanical Cow is a Terrytoons cartoon directed by Paul Terry, Jack Zander. Watch on RetroFlix:  https://retroflix.org/the-mechanical-cow-1937/",
      "fileSize": 32959155,
      "addedAt": "2026-01-07T00:12:22.154Z",
      "thumbnail": "https://archive.org/services/img/the-mechanical-cow-1937",
      "language": "eng",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 59
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5,
    "imdbVotes": 13,
    "Genre": "Animation, Short",
    "Plot": "Farmer Al Falfa tries to milk his cow, but she is on strike. He decides to automate by building a mechanical cow, but soon enough new problems arise in this good and very odd little Terrytoon.This cartoon looks a bit unfinished. It appears that some sequences might have been left unanimated, but filled in by an unusually large number of Dutch angles. Could this be related to the fact the credited director, Jack Zander, received a quick promotion from the ranks of uncredited animators? I strongly suspect that this was intended to be directed by Frank Moser, but he left the credited ranks of Paul Terry's staff the previous month.Mr. Zander did not last long. This was his sole directorial credit for Terry. Soon he would be snapped up by Fred Quimby at MGM as an animator. By the mid-1950s, Zander was working in industrial and advertising animation, and would not be credited again as a director until the 1970s. For the next fifteen years he directed for television, particularly the special GNOMES and \"Saturday Night Live\".The career paths of many who worked in animation are snarled. It would be interesting to know the whys and wherefores of Mr. Zander.",
    "Director": "Paul Terry, Jack Zander",
    "Writer": "Joseph Barbera, John Foster, Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150152",
    "tt0443314",
    "tt1020989",
    "tt0149799",
    "tt0149974",
    "tt0150031",
    "tt0150344",
    "tt0150602",
    "tt0151011",
    "tt0151876",
    "tt0151980",
    "tt0152157"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.154Z"
}