{
  "movieId": "tt0135453",
  "title": "The One-Man Band",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-one-man-band-1900-directed-by-georges-melies",
      "id": "the-one-man-band-1900-directed-by-georges-melies",
      "title": "The One Man Band (1900) Directed By Georges Méliès",
      "description": "The One-Man Band 1900 'L'homme orchestre' Director: Georges Méliès The One Man Band (French: L'Homme-Orchestre) is a 1900 French silent trick film directed by Georges Méliès. It was released by Méliès's Star Film Company and is numbered 262–263 in its catalogs. Production: To create the illusion of seven identical musicians, the film required seven simultaneous multiple exposures; only one other known Méliès film, The Melomaniac, uses so many exposures at once. In addition, the effect required careful coordination in timing and body position between exposures. First, Méliès walked down a line, arranging the seven chairs in a row and sitting in the last one; then, the film was rewound in the camera six times to allow Méliès to play the part of each musician. While filming each musician's part, all other chairs were masked from the lens to prevent them from being exposed. The process was repeated until the entire band had been filmed, all on a single strip of film. In 1906, Méliès commented on the difficulty of multiple exposure: \"you go into a rage when after three quarters of an hour of work and attention, a sprocket rips forcing you to start all over again, repair being impossible.\" The other effects in the film were created with stage machinery, pyrotechnics, and the substitution splice. A similar effect had previously been created by Méliès in his 1898 film The Triple Lady, in which two copies of a woman emerge from her body and sit beside her. The theme of multiplying chairs returned in Méliès's later film The Black Imp, although that film uses no multiple exposures.",
      "fileSize": 7987670,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-one-man-band-1900-directed-by-georges-melies",
      "year": 1900,
      "collection": "feature_films",
      "downloads": 109
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LhommeOrchestre",
      "id": "LhommeOrchestre",
      "title": "L'Homme Orchestre",
      "description": "L'Homme Orchestre, 1900, 1m21s Star Film Catalogue Nos. 262-263 In many ways a sequel to The Four Troublesome Heads (Un Homme de têtes, 1898), The One-Man Band ups the ante to a considerable degree by featuring no fewer than seven identically-dressed Georges Méliès playing musical instruments and interacting with one another in remarkably convincing synchronisation. Buster Keaton pulled off a similar trick in The Playhouse (1921) with greater technical polish, but Méliès beat him to the screen by over twenty years. Synopsis: A man lays out seven chairs in a row and counts and recounts them to make sure. He sits down in the one on the far right, and splits in two, his double moving to the seat next to him. This process is repeated until there are seven men, identical except for their differing musical instruments, occupying all the chairs. They chat amongst each other until the man in the middle stands up to conduct. The six instrumentalists perform, then sit back and relax. The conductor stands up again and indicates that they should come closer. They do so, blending into each other until only the conductor is left. He makes the chairs disappear and reappear en bloc, then individually. As he is bowing to the audience, a gigantic fan rises behind him, startling him when he turns round. He sits on the only remaining chair and sinks through the floor of the stage. He then reappears on the other side of the fan, jumping over it before disappearing in a puff of smoke. The fan descends to reveal him behind it. He bows to the audience. Director: Georges Méliès Stars: Georges Méliès Country: France Also Known As: The One Man Band Production Co: Star-Film Referenced in The Play House (1921)",
      "fileSize": 24744182,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LhommeOrchestre",
      "language": "None",
      "year": 1900,
      "collection": "feature_films",
      "downloads": 7541
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "2 min",
    "imdbRating": 7,
    "imdbVotes": 2435,
    "Genre": "Short, Comedy, Music",
    "Plot": "Ladies and gentlemen, tonight for your entertainment pleasure we have the world's most extraordinary band conductor and his one-man orchestra. Watch the unbelievable act of cloning before your very eyes, as the virtuoso of illusion duplicates himself, not once, but six times to conjure a formidable instrumental band, complete with their chairs and musical instruments. This is a must-see performance that no one should miss.",
    "Director": "Georges Méliès",
    "Writer": "N/A",
    "Actors": "Georges Méliès",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0227734",
    "tt0227438",
    "tt0227536",
    "tt0135571",
    "tt0000417",
    "tt0224189",
    "tt0215664",
    "tt0215817",
    "tt0215575",
    "tt0135122",
    "tt0227668",
    "tt0225972"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:14:38.522Z"
}