{
  "movieId": "tt0151411",
  "title": "Lulu at the Zoo",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lulu-at-the-zoo-1944",
      "id": "lulu-at-the-zoo-1944",
      "title": "Lulu at the Zoo (1944)",
      "description": "Little Lulu goes on a tour of the zoo, but she gets into trouble by feeding the animals, which is against the rules! Watch on RetroFlix:  https://retroflix.org/lulu-at-the-zoo-1944/",
      "fileSize": 89083835,
      "addedAt": "2026-01-07T00:09:46.420Z",
      "thumbnail": "https://archive.org/services/img/lulu-at-the-zoo-1944",
      "language": "eng",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 67
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.1,
    "imdbVotes": 22,
    "Genre": "Animation, Short, Family",
    "Plot": "The 26 Little Lulu cartoons made during 1944-1948 (and the two made in the early 60s) were uneven (individually and the series as a general overview) but watchable.Starting it all off was the decent but \"still finding its feet\" 'Eggs Don't Bounce'. Since then the quality of cartoons was inconsistent with some faring better than others (sometimes significantly so). There are, at least up to this point in the series, some good ones like 'Hullaba-Lulu' and 'Lulu's Indoor Outing', some mediocre at best ones like 'Lulu Gets the Birdie' and ones that fall somewhere in between like 'Eggs Don't Bounce' and 'Lulu in Hollywood'.'Lulu at the Zoo' is one of the mediocre at best cartoons and one of the weaker 1944 cartoons. The best asset is Sammy Timberg's lush and energetic music score, and who cannot resist that infectious theme song. The voice acting is solid, with Jackson Beck bring zest and some menace to the zookeeper and guide, who steal the show from Little Lulu, who has been more engaging before. Cecil Roy avoids being too sugary sweet though.However, the animation is a bit flat and rough here, the series was actually starting to became more refined just before but 'Lulu at the Zoo' returns to the less appealing animation style of the first few cartoons. The story is very slight, with too little narrative and content to sustain the (just over) 7 minute duration and drags as a result. The first half in particular is quite sedate and has more of an emphasis on educating Little Lulu on animals which is not very interesting to anybody who already knows this information.More could have been done with the zoo setting and the animals could have played a larger role. Any amusing gags are only sporadic in a cartoon with not enough laughs, the best moments coming from the zookeeper when the cartoon picks up a little in the second half.In summary, mediocre but okay for a one-time watch. 4/10 Bethany Cox",
    "Director": "Izzy Sparber, Nick Tafuri",
    "Writer": "Marge, Seymour Kneitel",
    "Actors": "Jackson Beck, Cecil Roy",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150441",
    "tt0149793",
    "tt0151414",
    "tt0151388",
    "tt0152672",
    "tt0036603",
    "tt0036874",
    "tt0151084",
    "tt0149942",
    "tt0152312",
    "tt0149826",
    "tt0150258"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.420Z"
}