{
  "movieId": "tt0110918",
  "title": "Pushed to the Limit",
  "year": 1992,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Rc_qlCJ6tPE",
      "id": "Rc_qlCJ6tPE",
      "title": "Pushed To The Limit | Full Action Drama Movie | Mimi Lesseos",
      "description": "Pushed To The Limit - Magnificent Mimi is a woman with a destiny and a bright future ahead of her. She is the world's greatest female wrestling champion, she has a loving boyfriend and loyal family members who care and love her. But things take a turn for the worst when Mimi's boyfriend Nick is wounded and her younger brother is shot to death for trying to stiff local druglord Harry Lee. \n1992.  Stars: Mimi Lesseos, Eidan Hanzei, Verrel Reed\n**Under non-exclusive license from Leomark Studios.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:45.811Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Rc_qlCJ6tPE/maxresdefault.webp",
      "duration": 6027,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "GB",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "96 min",
    "imdbRating": 4.2,
    "imdbVotes": 128,
    "Genre": "Action, Drama",
    "Plot": "Magnificent Mimi is a woman with a destiny and a bright future ahead of her. She is the world's greatest female wrestling champion, she has a loving boyfriend and loyal family members who care and love her. But things take a turn for the worst when Mimi's boyfriend Nick is wounded and her younger brother is shot to death for trying to stiff local druglord Harry Lee. Lee is the toughest and meanest criminal figure in all of Southern California and if you double-cross him, you won't live to see the sun set. Not only does Lee rule his own empire, he also runs the Kumite, a gladitorial fight ring where warriors battle to the death. Mimi knows the police can't touch Lee with a ten foot pole and so she enlists the aid of her martial arts friend Master Vern to teach her kickboxing and tai chi so she can prepare for combat. Vern doesn't think Mimi is ready for Kumite, as it is a place where only one warrior can be left standing and breathing and the one who loses dies. Against his own judgement, he teaches Mimi the art of kickboxing and tai chi to help her gain revenge. After months of training, Mimi is ready to infiltrate the Kumite and to take down Lee for his heinous crimes. But to get to him, Mimi must face other female combatants, including the lethal amazonian kickboxing queen Inga, who has never been defeated, nor has she met a warrior capable of being called her equal. After Mimi's cover is blown and she's forced to watch as Terry is brutally and mercillesly beaten and killed by the powerful Inga, things get really personal and Mimi must combat more warriors, including Inga herself without the guidance of Master Vern, who has been abducted by Lee's goons. Without Vern's guidance, can Mimi succeed where others before her have failed?",
    "Director": "Michael Mileham",
    "Writer": "Mimi Lesseos",
    "Actors": "Mimi Lesseos, Eidan Hanzei, Verrel Reed",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0111302",
    "tt0279243",
    "tt0107843",
    "tt0107382",
    "tt0105175",
    "tt0107525",
    "tt0105487",
    "tt0106403",
    "tt0099812",
    "tt0109444",
    "tt0101264",
    "tt0099753"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:05.422Z"
}