{
  "movieId": "tt0148402",
  "title": "Life with Fido",
  "year": 1942,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/life-with-fido-1942",
      "id": "life-with-fido-1942",
      "title": "Life with Fido (1942)",
      "description": "Life with Fido is a Terrytoons cartoon directed by Connie Rasinski. Watch on RetroFlix:  https://retroflix.org/life-with-fido-1942/",
      "fileSize": 34437678,
      "addedAt": "2026-01-07T00:09:38.890Z",
      "thumbnail": "https://archive.org/services/img/life-with-fido-1942",
      "language": "eng",
      "year": 1942,
      "collection": "feature_films",
      "downloads": 49
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.4,
    "imdbVotes": 20,
    "Genre": "Animation, Short, Family",
    "Plot": "Have found the Terrytoons cartoons, in my Terrytoons completest sake, oddly interesting. They are a mixed bag in quality, often with outstanding music and with some mild amusement and charm and variable in animation (which improved significantly by the late 30s compared to in their very early years), characterisation (tending to be the villains stealing the show and the leads being bland) and content (again bland and increasingly running out of ideas).1942, like all the other years for Terrytoons, was in terms of quality hit and miss, mostly falling into somewhere in the middle camp. Of which 'Life with Fido', another cartoon in the watchable but generally quite on the cutesy side Dinky Duck series, is one of the middling ones ranking it in correlation with the rest of the Terrytoons and one of the middling 1942 cartoons. It is an unexceptional, nothing exactly special cartoon and has the same amount of problems as it has the amount of strengths. 'Life with Fido' is definitely watchable, as is the Dinky Duck series in general if one doesn't demand too much, but the main reasons to see are for Terrytoons Studios completest sake and seeing more lower-budget older animation. As far as the Dinky Duck cartoons go, it is one of the better ones.Cannot fault the music, consistently the best thing about the Terrytoons cartoons. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The animation has come on leaps and bounds over-time, one can see more ambitious, elaborate detail in the backgrounds, and the fluidity of drawing and movement continues to improve, transitions are smoother, and some synchronisation is neat. The colour is vibrant.Some mildly amusing moments, if not particularly imaginative, and there is some zest and natural charm, and parts of it and the basic set up are nicely done. Dinky is cute and relatable enough, if not always compelling (the titular character is the more interesting character here), and the message is well intended. There is some nice conflict and it is hard to not be endeared by the cuteness, luckily not too excessive.However, the story is paper thin and formulaic with not an awful lot to it (like the cartoon in general), doing little new with a not so original idea. Gags aren't enough, and there is not much especially memorable about some. The cartoon is pretty predictable most of the time, parts also being rather too sentimental. The taking-too-long-to-get-going beginning being one of the biggest examples of both.Overall, unexceptional but watchable enough. 6/10 Bethany Cox",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Isadore Klein, Donald McKee",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149352",
    "tt0148503",
    "tt0148562",
    "tt0150658",
    "tt0148427",
    "tt0149616",
    "tt0150825",
    "tt0151023",
    "tt0151807",
    "tt0148876",
    "tt0149138",
    "tt0153844"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.890Z"
}