{
  "movieId": "tt0152040",
  "title": "Porkuliar Piggy",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/porkuliar-piggy-1944",
      "id": "porkuliar-piggy-1944",
      "title": "Porkuliar Piggy (1944)",
      "description": "Things are peaceful around the Yokum family shack in Dogpatch, as pipe-smoking Mammy Yokum has just given Abner, Pappy and Salomey, the family's pet pig, their semi-annual baths. Salomey goes for a stroll in the mountains but is spotted by an evil butcher---a bad caricature of Oliver Hardy---while driving his Black Market truck---it was made in WWII---and trolling for pork talent. He captures Salomey and hauls the little pig off to his large packing plant, with the intent of making sausage and pork chops out Salomey. And, possibly, salami. Abner rushes to the rescue but is soon tied to the same conveyor belt with Salomey and both are well on their way to becoming mixed mince-meat. But Abner screams for HELP!, and Mammy Yokum is on her way. Watch on RetroFlix:  https://retroflix.org/porkuliar-piggy-1944/",
      "fileSize": 165781834,
      "addedAt": "2026-01-07T00:10:21.537Z",
      "thumbnail": "https://archive.org/services/img/porkuliar-piggy-1944",
      "language": "eng",
      "year": 1944,
      "collection": "feature_films",
      "downloads": 100
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 5.1,
    "imdbVotes": 33,
    "Genre": "Animation, Short, Comedy",
    "Plot": "Things are peaceful around the Yokum family shack in Dogpatch, as pipe-smoking Mammy Yokum has just given Abner, Pappy and Salomey, the family's pet pig, their semi-annual baths. Salomey goes for a stroll in the mountains but is spotted by an evil butcher---a bad caricature of Oliver Hardy---while driving his Black Market truck---it was made in WWII---and trolling for pork talent. He captures Salomey and hauls the little pig off to his large packing plant, with the intent of making sausage and pork chops out Salomey. And, possibly, salami. Abner rushes to the rescue but is soon tied to the same conveyor belt with Salomey and both are well on their way to becoming mixed mince-meat. But Abner screams for HELP!, and Mammy Yokum is on her way.",
    "Director": "Bob Wickersham",
    "Writer": "Alec Geiss, Al Capp",
    "Actors": "Frank Graham, Lurene Tuttle",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0147875",
    "tt0148502",
    "tt0148088",
    "tt0148100",
    "tt0147804",
    "tt0148387",
    "tt0148602",
    "tt0148623",
    "tt0147277",
    "tt0148922",
    "tt0149348",
    "tt0148181"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.537Z"
}