{
  "imdbId": "tt0169357",
  "title": "Valley of Terror",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rFjWdWkFepw",
      "title": "Valley of Terror (1937) KERMIT MAYNARD",
      "description": "Movie Class by PizzaFLIX: Kermit was the younger brother of actor Ken Maynard. Like his brother, he became a star in early cowboy movies and appeared in 280 films between 1927 and 1962.\n\nStars: Kermit Maynard, Harley Wood, John Merton\nDirector: Albert Herman\nWriter: James Oliver Curwood \n\nWhen a cowboy finds himself behind bars for rustling cattle,  his buddy forms a lynch mob planning to arrange an escape once the mob takes him out of jail.",
      "id": "rFjWdWkFepw",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "59 min",
    "imdbRating": "5.9",
    "imdbVotes": "102",
    "Genre": "Action, Drama, Romance",
    "Plot": "Spud Hayes, the former cook of the Cross Bar X ranch, incites the men in a saloon at Salinas to try to lynch his former buddy, Bob Wilson, now in jail for rustling cattle from the ranch where he was foreman. After saloon owner Mark Flemming, who wants to buy the ranch from owner Mary Scott, assures Spud that his men will help with the lynching, Spud tells Bob that the lynch mob is a scheme to help him escape. Spud plans to tie Bob's hands loosely and leave guns hidden under the saddle flaps on \"Rocky,\" Bob's horse. Not trusting Spud, Flemming keeps him in his office during the breakout, but Bob escapes from the mob anyway and rides Rocky to safety. Later, as Mary, who is anxious to go East to become a singer, signs the deed over to Flemming, Bob and Spud interrupt. After Spud manages to swipe the deed from Flemming's pocket, Bob vows to find out what is on the ranch that Flemming wants. The next day, when Flemming, who has gone to the county seat to have the deed recorded, discovers it missing, he swears out a warrant for Mary's arrest, and when her stage stops at another town, she is apprehended. Extremely angered, Mary now refuses to sign a second deed and insists on staying in jail. Bob and Spud fail to find evidence of oil or gold on the ranch, but they overhear a stranger tell Flemming's men that the \"stuff\" runs rich on the land. When the stranger refuses to identify the nature of the stuff, Bob and Spud subdue Flemming's men in a fight; however, Flemming's foreman, Buck Mason, gets Spud's gun and orders Bob and Spud to leave. Bob searches Flemming's house but finds nothing. He then offers to strike a deal with Flemming for the deed, but a fight begins, and Flemming's men subdue Bob and Spud and tie their hands. Bob, however, manages to throw some bullets into the fire, and when they explode, Flemming and his men leave in fright. A small fire starts on the carpet, and Bob realizes that potash, which Flemming and his men have tracked in, has caught on fire and must be the reason Flemming desires the ranch, as potash is used in fertilizer and explosives, among other things. Meanwhile Flemming apologizes to Mary and, after convincing her that he does not want the ranch, tricks her into signing a second deed, so that she can get rid of it and go East. Bob hears about this and, after fighting Flemming's men and townspeople in the saloon, chases Flemming, who is on his way to have the deed recorded. He tackles Flemming and takes him to jail, where Flemming signs a confession clearing Bob of the rustling charges. When Mary learns about the potash, she decides to stay on the ranch and marry Bob.",
    "Director": "Albert Herman",
    "Writer": "James Oliver Curwood, John T. Neville, Sherman L. Lowe",
    "Actors": "Kermit Maynard, Harley Wood, John Merton",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026259",
      "title": "Danger Ahead",
      "year": 1935,
      "imdbRating": "5.5",
      "imdbVotes": "109",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028592",
      "title": "Atlantic Flight",
      "year": 1937,
      "imdbRating": "4.6",
      "imdbVotes": "92",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028634",
      "title": "Bill Cracks Down",
      "year": 1937,
      "imdbRating": "5.6",
      "imdbVotes": "108",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029376",
      "title": "Park Avenue Logger",
      "year": 1937,
      "imdbRating": "5.8",
      "imdbVotes": "100",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0140551",
      "title": "Sky Racket",
      "year": 1937,
      "imdbRating": "4.6",
      "imdbVotes": "117",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030839",
      "title": "Telephone Operator",
      "year": 1937,
      "imdbRating": "5.6",
      "imdbVotes": "193",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027366",
      "title": "Black Gold",
      "year": 1936,
      "imdbRating": "5.2",
      "imdbVotes": "103",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030090",
      "title": "The Duke of West Point",
      "year": 1938,
      "imdbRating": "6.4",
      "imdbVotes": "185",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030023",
      "title": "Crashing Through Danger",
      "year": 1936,
      "imdbRating": "4.6",
      "imdbVotes": "81",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028994",
      "title": "Here's Flash Casey",
      "year": 1938,
      "imdbRating": "5.6",
      "imdbVotes": "101",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029830",
      "title": "Ten Laps to Go",
      "year": 1936,
      "imdbRating": "4.7",
      "imdbVotes": "64",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0030911",
      "title": "Under the Big Top",
      "year": 1938,
      "imdbRating": "5.8",
      "imdbVotes": "84",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:28:57.626Z"
}