{
  "imdbId": "tt0147966",
  "title": "Cat Trouble",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cat-trouble-1947",
      "id": "cat-trouble-1947",
      "title": "Cat Trouble (1947)",
      "description": "Heckle and Jeckle see a seemingly helpless baby bird (who keeps saying he is only three years old) in danger as a cat is trying to capture it. Watch on RetroFlix:  https://retroflix.org/cat-trouble-1947/",
      "fileSize": 36905062,
      "addedAt": "2026-01-07T00:07:45.167Z",
      "thumbnail": "https://archive.org/services/img/cat-trouble-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 85
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.6,
    "imdbVotes": 19,
    "Genre": "Animation, Short",
    "Plot": "Heckle and Jeckle made a big impression ever since they were first officially introduced in 1946's 'The Uninvited Pests', 'The Talking Magpies' characters are prototypes. Their earlier cartoons are better than the later ones, funnier and fresher, but the best cartoons of their theatrical series are some of the best Terrytoons cartoons overall. From 1947 onwards up to their final cartoon in 1966 ('Messed Up Movie Makers'), they were among the studio's most frequent characters for good reason.1947's 'Cat Trouble', the fourth Heckle and Jeckle cartoon of 52, is a good example as to why. All three of the previous Heckle and Jeckle cartoons were solid efforts, especially 'The Uninvited Pests'. 'Cat Trouble' is no exception and has all the good things that were good in their previous three cartoons, and it was interesting to see a different side to Heckle and Jeckle. Do have to agree though that the supporting characters in them were stronger in general than the ones here.Did feel that the chick was on the annoying side and some of the way he is written veers on repetitive, do have to agree that the three and a half years old reiteration wore thin.More variety in the material would have been more welcome, with the story later on being very predictable and resolved a little too neatly.'Cat Trouble' has a lot more good than not so good. Have nothing to fault the animation for. Vibrant colours, nice attention to detail, far from static or simplistic backgrounds, the drawing is so much smoother than when the studio first started and the transitions are much more fluid and less choppy, nowhere near as much recycling or cutting corners either. The music never disappointed with Terrytoons, always the best asset of their worst efforts and it is one of the best things here still. Actually would go as far to say that it's even better than the animation. It is so lovely to listen to and there is such an uplifting vibe hearing it because of the snappy character it has.We are far from gag deprived in 'Cat Trouble', and they are mostly very well timed with a good deal of energy and range from very amusing to hilarious without getting too corny. While not having the same amount of energy as the previous Heckle and Jeckle cartoon the energy is still there and it increased the more anarchic things got. Anarchy that has a lot of impact, particularly later on, while not being distasteful or going overkill. Heckle and Jeckle are atypically un-malicious but this actually worked very well and was not out of character. They are great characters here, their movements, the way they talk (in the use of language and the voices themselves) and their expressions make them quite unique characters for Terrytoons. The cat is effectively creepy and one roots for his commuppence. Even if the story was not novel and got repetitive, it was benefitted greatly by the energy and the character interaction.In conclusion, good fun. 7/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150232",
    "tt0148292",
    "tt0148929",
    "tt0148223",
    "tt0148568",
    "tt0149234",
    "tt0153196",
    "tt0149313",
    "tt0150596",
    "tt0151420",
    "tt0149160",
    "tt0150546"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.167Z"
}