{
  "movieId": "tt0188993",
  "title": "Perdón, viejita",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/perdon-viejita-1927",
      "id": "perdon-viejita-1927",
      "title": "Perdon, Viejita (1927)",
      "description": "Perdón, viejita  fue una película argentina muda en blanco y negro  argentina  que se estrenó el 28 de enero de 1927 en el Cine Hindú Palace, ubicado en la  calle Lavalle  842 de Buenos Aires, con una capacidad para 1200 espectadores. Es un melodrama, poético, tanguero dirigida por  José Agustín Ferreyra . La dirección de fotografía estuvo a cargo de  Carlos Torres Ríos  y la música de  Eduardo Pereyra . El nombre de la película deriva de un tango que cantaba  Carlos Gardel , de  Osvaldo Fresedo  y  José Antonio Saldías  de 1925. 1 ​ Fragmentos de este filme fueron incluidos en la película  Aller simple (Tres historias del Río de la Plata)  (1998). 2 ​ Fue la última película enteramente muda de Ferreyra y el director salió con ella en gira y Turguenova cantaba el tango homónimo en vivo durante las exhibiciones. 3 ​(Wikipedia) Sinopsis Carlos, un ladrón arrepentido decide volver a su casa donde lo espera su madre, Doña Camila y su hermana Elena, acompañado de Nora, una prostituta y actual pareja. Una vez allí consiguen trabajo y se establecen. Elena trabaja en una oficina por la noche y es cortejada por un \"Don Juan\", quien le regala un anillo robado. Nora le prohíbe a Elena seguir viendo a este hombre y trata de devolverle el anillo a ese hombre por medio del amigo de la familia y enamorado de Elena, Preludio. Pero el \"Don Juan\" da aviso a la policía sobre unas joyas robadas que estarían en la casa de Doña Camila, la policía indaga a la familia. Carlos reconoce ante la madre que fue ladrón y Nora por proteger a Elena se entrega. Nora va presa pero Elena decide decir la verdad y condenar a Don Juan, quien queda preso y Nora en libertad. pero muy abatida decide volver a su vida de antes, el cabaret. Elena llega a su casa y le cuenta la verdad a Doña Carmila. Carlos va en su búsqueda, pero ella es herida por Gavilán, su dueño en el cabaret, Carlos la rescata y mientras él se encuentra curándola en la casa de Preludio, se hacen presentes Doña Camila y Elena, quien pide perdón a Nora y ella a su vez a Doña Camila por no decirle la verdad. Todos, incluido Preludio, se van a vivir se van a vivir al campo reconciliados, el final de la película los muestra comiendo alrededor de la mesa al mismo tiempo, unas campanas repiquetean desde el campanario de una iglesia. Reparto María Turgenova .....  Nora Stella Maris  .......  Elena Floricel Vidal .......  Doña Camila Ermete Meliante ......  Carlos Riú Álvaro Escobar ..... como  Preludio Mario Zappa  ..... como el \"Don Juan\" Luis Moresco 4 ​ Perdon, viejita (Tango) \"Yo estaba loco, fui un pobre hombre, Yo la quería con devoción. Vos me decías: \"Tené cuidado…\" Yo enceguecí de pasión. Aquella noche junté mis pilchas y sin decirte tampoco adiós, te abandonaba, viejita mía, para cambiarte por ese amor, ¡Perdón, viejita! Única amiga que me reciba tu bendición. Y me arrodillo beso tus manos, y una y mil veces, pido perdón. Tuve el castigo, porque cobarde. me dejó sola con su querer… Y, desde entonces, con tu memoria mi soledad acompañé. Hoy he vuelto mamá, pa' regalarte dulces sonrisas en tu vejez… Serás abuela, voy a pagarte toda la pena que te causé\".",
      "fileSize": 519243214,
      "addedAt": "2026-01-07T00:10:12.698Z",
      "thumbnail": "https://archive.org/services/img/perdon-viejita-1927",
      "language": "spa",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 98
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 5.7,
    "imdbVotes": 36,
    "Genre": "N/A",
    "Plot": "N/A",
    "Director": "José A. Ferreyra",
    "Writer": "José A. Ferreyra",
    "Actors": "María Turgenova, Stella Maris, Floricel Vidal",
    "Language": "None",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0188927",
    "tt0189237",
    "tt0188921",
    "tt0189031",
    "tt0189196",
    "tt0018380",
    "tt0345330",
    "tt0018977",
    "tt0208733",
    "tt0015739",
    "tt0216718",
    "tt0241869"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.698Z"
}