{
  "imdbId": "tt0132251",
  "title": "Joan of Arc",
  "year": 1900,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/joan-of-arc-1900-jeanne-d-arc-directed-by-georges-melies-1",
      "title": "Joan Of Arc (1900) Directed By Georges Méliès",
      "description": "Joan Of Arc (1900) 'Jeanne d'Arc' Director: Georges Méliès Joan of Arc is a 1900 French silent film directed by Georges Méliès, based on the life of Joan of Arc. Plot: In the village of Domrémy, the young Joan is visited by Saint Michael, Saint Catherine, and Saint Margaret, who exhort her to fight for her country. Her father Jacques d'Arc, mother Isabelle Romée, and uncle beg her to stay at home, but she leaves them and travels to Vaucouleurs, where she meets with the governor, Captain Robert de Baudricourt. The dissipated Baudricourt initially scorns Joan's ideals, but her zeal eventually wins him over, and he gives her authority to lead French soldiers. Joan and her army lead a triumphal procession into Orléans, followed by a large crowd. Then, in Reims Cathedral, Charles VII is crowned King of France. At the Siege of Compiègne, Joan is taken prisoner while her army attempts to storm the castle. In prison, Joan has another dream in which she sees her visions again. Taken to the interrogation, Joan refuses to sign a retraction, and is condemned as a heretic. In the Rouen marketplace, Joan is burned at the stake. The wood carrier at the execution, bringing in fuel for the burning, dies on the spot from the fumes. In a final apotheosis scene, Joan rises to heaven, where she is greeted by God and the saints. Cast: Jeanne Calvière as Joan of Arc. Calvière, a stablewoman at the Cirque d'Hiver, was hired for this film and remained among Méliès's core troupe of actors for several years afterward. Georges Méliès in seven roles: Jeanne's father; Jeanne's uncle; Robert de Baudricourt; a beggar at the Orléans procession; a soldier at the Siege of Compiègne; one of Joan's jailers; and the wood carrier at the execution. Jeanne d'Alcy in three roles: Jeanne's mother; a lady at Vaucouleurs; and a lady at Orléans. Production The film was made in the spring of 1900. It was the first of Méliès's films to surpass 200 meters in length, and the second (after his Cinderella the previous year) to use changes of scene, with twelve sets employed and that number of scenes, or tableaux, advertised. (Cinderella was advertised as having twenty tableaux, but they were filmed on only six sets; this division of long scenes into smaller segments for advertising purposes would become Méliès's standard practice. Joan of Arc, by contrast, was advertised with twelve scenes, one per set. The artist Charles Claudel, who also repainted the interior of the Théâtre Robert-Houdin in 1901 following Méliès's designs, was the set painter for the film. The cameraman was Leclerc, who also worked for Méliès as the pianist at the Théâtre Robert-Houdin. Méliès's scenario for the film strongly emphasizes Joan's status as a national hero of France and a martyr for the French people; the first scene, in which Joan enters leading a flock of sheep, foreshadows her eventual leading of the French army. The final scene, with its triumphal entry of Joan into heaven and her meeting God, suggests Joan's suitability for Catholic sainthood.[8] (Joan of Arc was beatified by the Church in 1909 and canonized in 1920. Most of the film is staged in Méliès's usual theatrical style, with a stationary camera viewing the action from afar, in a long shot, as if viewing a stage spectacle from a seat in the audience. However, the eighth scene, the Siege of Compiègne, is notable for a more modern-looking visual effect: in that scene, actors move much closer to the camera, in the distance of a medium shot. This is the second example, among Méliès's extant films, of experiments with medium shots; the first had occurred the previous year in Bagarre entre journalistes, an installment of Méliès's series The Dreyfus Affair. An advertisement for the film claims that \"almost 500 people\" can be seen in the grand parade at Orléans, an effect created by having a moderately sized group of people cross the screen from left to right, go around the north side of the studio, and re-enter, repeating the cycle several times to simulate a much larger crowd. Release and survival: Joan of Arc was released by Méliès's Star Film Company and is numbered 264–275 in its catalogues, where it was advertised as a pièce cinématographique à grand spectacle en 12 tableaux. As the film scholar Jacques Malthête has noted, Méliès's descriptions of the film in advertising material never mention that Joan's enemies are English; this omission occurs not only in the English-language materials (where mentioning conflict with the French may have been thought harmful to sales), but also in the French ones (where the omission is less understandable). The film was Méliès's second big cinematic success (Cinderella was the first).It was shown widely in France, and was also exhibited elsewhere, including in Montreal and Havana. In England, the film was distributed by the Warwick Trading Company, which handled English releases of Méliès's films until 1902. In the United States, the Edison Manufacturing Company sold \"dupes\" (illegally duplicated prints) of the film. American film piracy became such a problem for Méliès, especially after the success of his much-pirated 1902 film A Trip to the Moon, that he opened an American branch of his company in New York in 1903, under the direction by his brother Gaston Méliès, for added copyright protection. The film was believed lost until 1982, when a hand-colored print with the first scene missing was discovered by the collector René Charles.",
      "id": "joan-of-arc-1900-jeanne-d-arc-directed-by-georges-melies-1"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "10 min",
    "imdbRating": "6.6",
    "imdbVotes": "1,518",
    "Genre": "Short, Drama, History",
    "Plot": "Miraculously salvaged in 1982, this grand hand-tinted cinematographic epic in twelve superb static tableaux marks the great Georges Méliès's second cinematic triumph after his classic fairy-tale adaptation of Cendrillon (1899). Although the introductory scene which establishes the young Joan as a humble peasant maiden is forever lost, the film still manages to portray Joan of Arc as a saint and France's national hero, through the use of theatrical long shots, experimental medium shots where the action is, and gradual dissolves. Starting off with the seraphic visitation by Archangel Michael, St. Margaret and St. Catherine, a 13-year-old Joan accepts a divine call to arms against her parents' will, as she boldly crosses the iron gates of Vaucouleur, convincing Captain Robert de Baudricourt to grand his permission to lead an army. Next, as Charles VII is crowned King of France in the magnificent Reims Cathedral after the decisive victory at Orléans, the brutal Siege of Compiègne and Joan's final campaign follows, where the charismatic commander falls into the hands of the Burgundians, on 23 May 1430. But in her dank cell, the angelic visions return, as the mighty celestial guardian, St. Michael, reminds Joan of her destiny, inspiriting the now 19-year-old woman to refuse to sign a retraction. Condemned as a heretic by the Bishop of Beauvais, Pierre Cauchon, Joan is burned at the stake at the bustling Rouen marketplace on 30 May 1431, resulting in a glorious apotheosis scene where the noble martyr ascends to heaven, welcomed by God and all the saints.",
    "Director": "Georges Méliès",
    "Writer": "Georges Méliès",
    "Actors": "Bleuette Bernon, Jeanne Calvière, Jehanne d'Alcy",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0225132",
      "title": "Robinson Crusoe",
      "year": 1902,
      "imdbRating": "5.7",
      "imdbVotes": "437",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0135571",
      "title": "The Fat and the Lean Wrestling Match",
      "year": 1901,
      "imdbRating": "6.9",
      "imdbVotes": "1,132",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0228014",
      "title": "The Christmas Angel",
      "year": 1904,
      "imdbRating": "6.0",
      "imdbVotes": "243",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0223586",
      "title": "The Wandering Jew",
      "year": 1904,
      "imdbRating": "5.1",
      "imdbVotes": "236",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000417",
      "title": "A Trip to the Moon",
      "year": 1902,
      "imdbRating": "8.1",
      "imdbVotes": "58,712",
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0227668",
      "title": "The Dainaid's Barrel",
      "year": 1900,
      "imdbRating": "5.1",
      "imdbVotes": "337",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0227734",
      "title": "The Cook's Revenge",
      "year": 1900,
      "imdbRating": "5.8",
      "imdbVotes": "432",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0227438",
      "title": "The Doctor and the Monkey",
      "year": 1900,
      "imdbRating": "5.2",
      "imdbVotes": "387",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0135453",
      "title": "The One-Man Band",
      "year": 1900,
      "imdbRating": "7.0",
      "imdbVotes": "2,435",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0225972",
      "title": "The Triple Conjurer and the Living Head",
      "year": 1900,
      "imdbRating": "6.2",
      "imdbVotes": "553",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0227527",
      "title": "The Wizard, the Prince and the Good Fairy",
      "year": 1900,
      "imdbRating": "5.5",
      "imdbVotes": "362",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0227536",
      "title": "Up-to-Date Spiritualism",
      "year": 1900,
      "imdbRating": "5.7",
      "imdbVotes": "373",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:15.996Z"
}