{
  "imdbId": "tt0161750",
  "title": "Laundry Blues",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/laundry-blues-1930",
      "id": "laundry-blues-1930",
      "title": "Laundry Blues (1930)",
      "description": "Strange doings in a Chinese laundry with outrageous Oriental and Yiddish stereotypes. Watch on RetroFlix:  https://retroflix.org/laundry-blues-1930/",
      "fileSize": 71456222,
      "addedAt": "2026-01-07T00:09:38.888Z",
      "thumbnail": "https://archive.org/services/img/laundry-blues-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 41
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 4.1,
    "imdbVotes": 52,
    "Genre": "Animation, Short",
    "Plot": "Came out in 1930 and LOOKS it.It's basically a series of sight/spot gags surrounding a Chinese laundry with a few musical numbers mixed in. Of course everybody has the long ponytail and clacks around in wooden shoes. And apart from the brief singing....no one says anything comprehensible. It's all fake chatter. This one doesn't get played today due to the obvious racial stereotyping. But I'll bet it also doesn't get played due to the outdated \"entertainment\" value. Anyone over the age of five wouldn't enjoy it that much.The Van Bueren studios were more famous for their Little King. And like said, this is just a lot of music with visual gags. Also like said, it tends to be repetitious. See this for what it is.....and old theatrical cartoon that may have gotten laughs way back then but won't be much more than a curiosity/historical piece now. You don't even see this one on DVD's of racist animation. Hell, it hardly gets mentioned at all ANYWHERE.Two stand out scenes. Despite everyone being Chinese, why did the four laundrymen's singing sound like a jazz quartet? And the Jewish customer (NOT very flattering either) wanting his beard cleaned. And his ticket was written in Hebrew. I saw a quick blurb about this in a book. The cartoon is on youtube. Check it at your own desire.",
    "Director": "Mannie Davis, John Foster",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0147274",
    "tt0146845",
    "tt0161805",
    "tt0147096",
    "tt0147506",
    "tt0147620",
    "tt0146582",
    "tt0146719",
    "tt0161433",
    "tt0147534",
    "tt0021722",
    "tt0147017"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}