{
  "imdbId": "tt0120907",
  "title": "eXistenZ",
  "year": 1999,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZJZ0H7ULqMI",
      "id": "ZJZ0H7ULqMI",
      "title": "eXistenZ (THRILLING SCI FI with WILLEM DAFOE, Sci Fi Horror film in German, David Cronenberg films)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Allegra Geller (Jennifer Jason Leigh - \"The Hateful Eight\") testet ihr neues Spiel „eXistenZ“, das direkt ins Nervensystem überträgt. Nach einem Angriff flieht sie mit Ted Pikul (Jude Law \"Side Effects\"), während WILLEM DAFOE ( \"Platoon\" & \"Spider Man\") eine Schlüsselrolle spielt.\n\nEXISTENZ (1999)\nOriginaltitel: eXistenZ\nMit: Jude Law; Jennifer Jason Leigh; Ian Holm, Willem Dafoe\nRegie: David Cronenberg\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie von der Spieleentwicklerin Allegra Geller (Jennifer Jason Leigh) geschaffenen Videogames genießen Kultstatus und werden von einer treuen Fangemeinde gefeiert. Ihr neuestes Spiel, „eXistenZ“, soll im Rahmen einer exklusiven Vorschau von zwölf ausgewählten Testpersonen ausprobiert werden. Das Besondere daran: Die fleischähnliche Konsole überträgt Informationen über einen sogenannten Bioport – eine Öffnung im Rücken – direkt ins zentrale Nervensystem der Spieler. Dadurch verschwimmen die Grenzen zwischen realer Welt und virtueller Realität. Doch während der Testphase kommt es zu einem Schockmoment: Ein Teilnehmer zieht eine seltsam organische Waffe und versucht, Allegra auszuschalten. Der Angriff scheitert. Gemeinsam mit ihrem PR-Praktikanten Ted Pikul (Jude Law) kann sie fliehen. Doch wer steckt hinter dem Angriff?\n#Netzkino #ganzerFilm #davidcronenberg \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:35:36.636Z",
      "thumbnail": "https://i.ytimg.com/vi/ZJZ0H7ULqMI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBKq474fwNXmFYdgy-CdetdRLddxA",
      "duration": 5590,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "97 min",
    "imdbRating": 6.8,
    "imdbVotes": 111094,
    "Genre": "Horror, Mystery, Sci-Fi",
    "Plot": "Allegra Geller, the leading game designer in the world, is testing her new virtual reality game, eXistenZ with a focus group. As they begin, she is attacked by a fanatic assassin employing a bizarre organic gun. She flees with a young marketing trainee, Ted Pikul, who is suddenly assigned as her bodyguard. Unfortunately, her pod, an organic gaming device that contains the only copy of the eXistenZ game program, is damaged. To inspect it, she talks Ted into accepting a gameport in his own body so he can play the game with her. The events leading up to this, and the resulting game lead the pair on a strange adventure where reality and their actions are impossible to determine from either their own or the game's perspective.",
    "Director": "David Cronenberg",
    "Writer": "David Cronenberg",
    "Actors": "Jude Law, Jennifer Jason Leigh, Ian Holm",
    "Language": "English",
    "Country": "United Kingdom, France, Canada",
    "Awards": "3 wins & 14 nominations total"
  },
  "relatedMovies": [
    "tt0133751",
    "tt0081455",
    "tt0343449",
    "tt0047149",
    "tt0075990",
    "tt0185371",
    "tt13975458",
    "tt0068615",
    "tt0057859",
    "tt0203139",
    "tt3986820",
    "tt0222368"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "1990s",
      "name": "1990s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:20:58.701Z"
}