{
  "movieId": "tt0150895",
  "title": "Here's to the Good Old Jail",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/heres-to-the-good-old-jail-1938",
      "id": "heres-to-the-good-old-jail-1938",
      "title": "Here's to the Good Old Jail (1938)",
      "description": "Here's to the Good Old Jail is a Terrytoons cartoon directed by Eddie Donnelly. Watch on RetroFlix:  https://retroflix.org/heres-to-the-good-old-jail-1938/",
      "fileSize": 33909134,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/heres-to-the-good-old-jail-1938",
      "language": "eng",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 57
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.4,
    "imdbVotes": 8,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1938, like all the other years for Terrytoons, saw a hit and miss batch, more so than the other years even. Of which 'Here's to the Good Old Jail' is one of the better ones ranking it in correlation with the rest of the Terrytoons and one of the best 1938 cartoons. There are flaws but also a lot of strengths, and a few things done better than what was seen before. 'Here's to the Good Old Jail' is well worth watching as an above average watch with more to it than completest sake.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see, the 1936 Terrytoons onwards showed more fluidity in design than in previous years and some synchronisation is neat. The drawing is more fluid generally. A fair share of amusing moments, with more gags than there can be usually found and they are all beautifully timed and funny (not always the case with Terrytoons), and there is a lot of zest and natural charm. Also a suitably strange and absurdist quality that was fun and endearing to watch. The characters are amusing and quite relatable here too and that it doesn't get saccharine is appreciated. The metamorphoses/transformations are remarkably imaginative and weirdly absurd (in a good way).On the other hand, there are occasions where transitions are not as smooth as they could have been.Likewise, the story, while refreshingly wild for Terrytoons at this point, is thin and with not quite enough surprises. A few moments of staleness in humour though this was only occasional.All in all, pretty impressive. 7/10 Bethany Cox",
    "Director": "Eddie Donnelly",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150981",
    "tt0147063",
    "tt0159281",
    "tt0150361",
    "tt0150841",
    "tt0161998",
    "tt0150122",
    "tt0150362",
    "tt0149765",
    "tt0146905",
    "tt0151020",
    "tt0153345"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}