{
  "movieId": "tt0161337",
  "title": "Busted Blossoms",
  "year": 1934,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/busted-blossoms-1934",
      "id": "busted-blossoms-1934",
      "title": "Busted Blossoms (1934)",
      "description": "Busted Blossoms is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/busted-blossoms-1934/",
      "fileSize": 30929057,
      "addedAt": "2026-01-07T00:07:45.165Z",
      "thumbnail": "https://archive.org/services/img/busted-blossoms-1934",
      "language": "eng",
      "year": 1934,
      "collection": "feature_films",
      "downloads": 32
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.3,
    "imdbVotes": 19,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1934, like all the other years for Terrytoons, saw a hit and miss batch, more so than the other years even. Of which 'Busted Blossoms' is one of the middling ones ranking it in correlation with the rest of the Terrytoons, though one of the better faring ones of the batch up to this point. It is an unexceptional, nothing exactly special cartoon and has the same amount of problems as it has the amount of strengths. 'Busted Blossoms' is also watchable, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see and some synchronisation is neat.A few amusing moments and there is some zest and natural charm. A few nice details, like the gin-rickshaws.Outside of the backgrounds however, the animation is primitive at best with a fair bit of crudeness, over-simplicity and choppiness.Likewise, the story is paper thin and formulaic, once again executing an already fairly tired premise with nothing new. Gags aren't enough and there is not much especially memorable about them. The leads and their chemistry are bland (typical Terrytoons protagonists basically), the romance sometimes sweet but generally soppy. Occasionally the material is not for the easily offended through modern eyes, though this didn't distract that awfully.Overall, watchable but not much more. 5/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0161284",
    "tt0150804",
    "tt0149817",
    "tt0150130",
    "tt0150382",
    "tt0150504",
    "tt0146721",
    "tt0150605",
    "tt0150774",
    "tt0150820",
    "tt0151001",
    "tt0151046"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.165Z"
}