{
  "imdbId": "tt0144150",
  "title": "El crack",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-crack-1960",
      "id": "el-crack-1960",
      "title": "El Crack(1960)",
      "description": "El crack  es una  película   argentina  de 1960, dirigida por  José A. Martínez Suárez  y protagonizada por  Jorge Salcedo ,  Aída Luz  y  Marcos Zucker . En el elenco también aparecen personalidades del  fútbol , como el jugador  José Manuel Moreno  y los periodistas  José María Muñoz , y  Pipo Mancera . Es el primer largometraje del director y fue estrenada el 16 de agosto de 1960, en el cine Normadie de  Buenos Aires . Algunas producciones posteriores de José Martínez Suárez fueron, entre otras,  Los chantas  (1975) y  Los muchachos de antes no usaban arsénico  (1976) y  Noches sin lunas ni soles  (1985). (Wikipedia) Sinopsis La película está ambientada en los entretelones del negocio del  fútbol  profesional, y los mecanismos ocultos y cuestionables (sobornos, drogas, manipulaciones comerciales y publicitarias) que llevan a la consagración de un crack. Osvaldo es un jugador de tercera que asciende a primera. Entonces el joven jugador comienza a ser objeto de intereses comerciales, muchas veces inmorales o delictivos, para ubicarlo como una estrella del fútbol. De ese modo, Osvaldo comienza a representar los intereses y expectativas de muchas personas (su novia, su madre, su padre, el representante, los periodistas, los dirigentes del club, los hinchas). El film tiene su desenlace trágico en un partido final, en el que si juega \"bien en ese partido, va a valer millones y si no... Reparto Actor Personaje Jorge Salcedo Aída Luz Marcos Zucker Domingo Sapelli Carlos Rivas Enrique Kossi Fernando Iglesias  (Tacholas) Osvaldo Castro Claudia Laforgue José Manuel Moreno Víctor Martucci Mirko Álvarez Pedro Desio José María Muñoz Pacheco Fernández Armando Lopardo Pablo Cumo André Norevó Orlando Bohr Francisco Martino Paride Grandi Antonio Pérez Tersol Juan R. Lizzio Antonio Salcedo Cassandra Greys Nicolás \"Pipo\" Mancera Omar Antonio Calvo",
      "fileSize": 3484530266,
      "addedAt": "2026-01-07T00:08:15.378Z",
      "thumbnail": "https://archive.org/services/img/el-crack-1960",
      "language": "spa",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 84
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "81 min",
    "imdbRating": 7,
    "imdbVotes": 48,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Central transfers his star and to replace him, they look at Osvaldo. In this way, Osvaldo begins to represent the interests and expectations of his girlfriend, his mother, his father, the representative, the journalists, leaders a...",
    "Director": "José A. Martínez Suárez",
    "Writer": "Jose A. Gerino, José A. Martínez Suárez, Carlos Alberto Parrilla",
    "Actors": "Jorge Salcedo, Aída Luz, Marcos Zucker",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0054230",
    "tt0053810",
    "tt0054086",
    "tt0054698",
    "tt0051666",
    "tt0191032",
    "tt0199395",
    "tt0059927",
    "tt0121184",
    "tt0032599",
    "tt0027311",
    "tt0033891"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.378Z"
}