{
  "movieId": "tt0107007",
  "title": "Gettysburg",
  "year": 1993,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gettysburg-1993_202511",
      "id": "gettysburg-1993_202511",
      "title": "Gettysburg (1993)",
      "description": "\"Gettysburg,\" a 1993 film directed by Ron Maxwell, dramatizes the pivotal Battle of Gettysburg during the American Civil War, which took place from July 1 to July 3, 1863.The narrative follows key historical figures such as General Robert E. Lee (played by Martin Sheen) and General George G. Meade (played by Omar Epps), alongside the famous General Joshua Lawrence Chamberlain (played by Jeff Daniels), who leads the 20th Maine regiment. The film opens with the tensions leading up to the battle as both the Union and Confederate forces prepare for conflict. As the battle unfolds over three days, the film portrays significant events, such as the fierce fighting at Little Round Top , Pickett's Charge, and the struggles within the leadership of both armies. Through the perspectives of various soldiers, the film highlights themes of bravery, duty, and sacrifice. The ending captures the heavy toll of the battle, as the Confederate forces face a staggering defeat, marking a turning point in the Civil War.\"Gettysburg\" is notable for its historical accuracy, extensive battle recreations, and focus on the personal experiences of soldiers on both sides.",
      "fileSize": 2446312647,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/gettysburg-1993_202511",
      "language": "eng",
      "year": 1993,
      "collection": "feature_films",
      "downloads": 279
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "254 min",
    "imdbRating": 7.6,
    "imdbVotes": 32532,
    "Genre": "Drama, History, War",
    "Plot": "The four and 1/4 hour depiction of the historical and personal events surrounding and including the decisive American civil war battle features thousands of civil war re-enactors marching over the exact ground that the federal army and the army of North Virginia fought on. The defense of the Little Round Top and Pickett's Charge are highlighted in the actual three day battle which is surrounded by the speeches of the commanding officers and the personal reflections of the fighting men. Based upon the novel 'The Killer Angels'.",
    "Director": "Ron Maxwell",
    "Writer": "Michael Shaara, Ron Maxwell",
    "Actors": "Tom Berenger, Martin Sheen, Stephen Lang",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0098437",
    "tt0092978",
    "tt0057811",
    "tt0044400",
    "tt0227607",
    "tt0159476",
    "tt0014672",
    "tt0043590",
    "tt0035958",
    "tt0046029",
    "tt0005719",
    "tt0075784"
  ],
  "collections": [
    {
      "id": "war",
      "name": "War"
    },
    {
      "id": "1990s",
      "name": "1990s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.017Z"
}