{
  "imdbId": "tt0152285",
  "title": "Santa's Surprise",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/santas-surprise-1947",
      "id": "santas-surprise-1947",
      "title": "Santa's Surprise (1947)",
      "description": "Seven children from around the world follow Santa home on Christmas Eve and decide to surprise him with some help around the house while he sleeps. Watch on RetroFlix:  https://retroflix.org/santas-surprise-1947/",
      "fileSize": 162834977,
      "addedAt": "2026-01-07T00:10:40.952Z",
      "thumbnail": "https://archive.org/services/img/santas-surprise-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 430
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "9 min",
    "imdbRating": 6.1,
    "imdbVotes": 363,
    "Genre": "Animation, Short, Comedy",
    "Plot": "After a hard night's work on Christmas Eve, delivering toys to all the good little boys and girls all over the world, the worn-out-and-tired Santa Claus returns to his home at the North Pole for a well-earned rest. At Little Audrey's house in the USA, the viewer is introduced to her via her picture hanging above her stocking in the fireplace mantle. Little Audrey's stocking, giving the audience a glimpse of her character traits, has a hole in the bottom that drops her present into a box on the floor and, consequently, Audrey gets more than her allotted share as Santa keeps trying to fill her stocking. Santa visits many countries - one of which doesn't celebrate or recognize Christmas or Santa Claus but, as far as Santa is concerned, a good kid is a good kid no matter where they live and gets a present anyway. Audrey and a United Nations group of kids - Spanish, Chinese, Dutch, African, South-Seas, Baltic and unknown origin - follow him home in order to do something nice for Santa Claus while he is sleeping.",
    "Director": "Seymour Kneitel, Myron Waldman",
    "Writer": "Larz Bourne",
    "Actors": "Jack Mercer, Mae Questel",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0147944",
    "tt0147948",
    "tt0148409",
    "tt0149084",
    "tt0151675",
    "tt0148646",
    "tt0149086",
    "tt0149400",
    "tt0149933",
    "tt0147915",
    "tt0147934",
    "tt0148278"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.952Z"
}