{
  "imdbId": "tt0169359",
  "title": "Varhaník u sv. Víta",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/varhanik-u-sv-vita_1929",
      "id": "varhanik-u-sv-vita_1929",
      "title": "Varhaník u sv. Víta",
      "fileSize": 4648564086,
      "addedAt": "2026-01-07T00:12:55.133Z",
      "thumbnail": "https://archive.org/services/img/varhanik-u-sv-vita_1929",
      "language": "Czech",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 791
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "78 min",
    "imdbRating": 6.5,
    "imdbVotes": 62,
    "Genre": "Drama, Romance",
    "Plot": "The organist of St. Vitus' Cathedral in Prague is an old, solitary man who is devoted solely to his organ (that is to say, the musical instrument?). One night, the organist receives a strange visit from an old acquaintance; the man requests a special favor of him, namely to deliver a letter and some money to his daughter. The visitor-tormented by a terrible past-then shoots himself in front of the organist. The scene is witnessed by the organist's neighbor who later blackmails him. Meanwhile, the visitor's daughter, a nun, decides to leave the convent when the organist tells her that her father is dead (was her departure due to listening to the organist playing \"Toccata and, especially... Fugue\" by Herr Bach??). The old man helps her in her new life.\"Varhaník u sv. Víta\" (The Organist At St. Vitus' Cathedral) (1929) was directed by the prolific Czech film director Herr Martin Fric who later would be well-known for his satirical comedies; this film is also mentioned by learned silent connoisseurs as one of the most accomplished oeuvres during the Czech silent film period and certainly this film has many interesting aspects that this Herr Graf is going to detail right now.The first one and the most outstanding is its beautiful cinematography by Herr Jaroslav Blazek, who uses filters and other effects in order to emphasize and enhance a romantic and dreamlike aspect of the story that certainly matches perfectly with the atmosphere of the city of Prague where the film was shot. For example, when our heroine is secluded in the convent as a nun, the cinematography is especially splendid, with powerful close-ups wherein her beauty is showed in its fascinating purity and innocence. Later when she leaves the convent and meets a handsome painter, the cinematography becomes more down to earth and romantic with the background of the streets of Prague providing a dreamy, idealized setting.Outstanding also are the night scenes (Prague city streets, the organist's humble home, the St. Vitus' Cathedral) where we can see the influence of German Expressionism. This is also apparent in the indoor scenes emphasizing the dark elements of the story.Besides mystery and atonement, the film has a continuous and well defined line between good and evil though it depends too much on stereotyped characters and their predictable behavior. There's also a rather obvious ending that is detrimental but overall these flaws are dwarfed by the film's many merits.And now, if you'll allow me, I must temporarily take my leave because this German Count must play the organ.Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com/",
    "Director": "Martin Fric",
    "Writer": "Václav Wasserman, Martin Fric, Vítezslav Nezval",
    "Actors": "Karel Hasler, Oscar Marion, Suzanne Marwille",
    "Language": "None, Czech",
    "Country": "Czechoslovakia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019644",
    "tt0019957",
    "tt0019979",
    "tt0020514",
    "tt0019798",
    "tt0020602",
    "tt0019758",
    "tt0019788",
    "tt0019852",
    "tt0019946",
    "tt0019958",
    "tt0138560"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.133Z"
}