{
  "movieId": "tt0150751",
  "title": "Good Deed Daly",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/good-deed-daly-1955",
      "id": "good-deed-daly-1955",
      "title": "Good Deed Daly (1955)",
      "description": "Good Deed Daly is a model boy scout and is helpful as can be even when his help is not needed. When he walks into a bank and finds all the employees bound-and-gagged, Daly senses that something is not quite right. The announced on the television set says that gangster Desperate Dumkopf is on the loose. Dumkopf, a master of disguise, transforms himself into a lamp-post and follows Daly. Dunkopf then changes into a scout-master and directs Daly to walk off a cliff. Daly, however, comes to no harm, and, in the battle that follows, unmasks Dumkopf and earns another merit badge. Watch on RetroFlix:  https://retroflix.org/good-deed-daly-1955/",
      "fileSize": 37487166,
      "addedAt": "2026-01-07T00:08:32.019Z",
      "thumbnail": "https://archive.org/services/img/good-deed-daly-1955",
      "language": "eng",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 67
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "6 min",
    "imdbRating": 6.8,
    "imdbVotes": 10,
    "Genre": "Animation, Short",
    "Plot": "Good Deed Daly is a model boy scout and is helpful as can be even when his help is not needed. When he walks into a bank and finds all the employees bound-and-gagged, Daly senses that something is not quite right. The announced on the television set says that gangster Desperate Dumkopf is on the loose. Dumkopf, a master of disguise, transforms himself into a lamp-post and follows Daly. Dunkopf then changes into a scout-master and directs Daly to walk off a cliff. Daly, however, comes to no harm, and, in the battle that follows, unmasks Dumkopf and earns another merit badge.",
    "Director": "Connie Rasinski",
    "Writer": "Tom Morrison, Bob Kuwahara",
    "Actors": "Doug Moye",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149775",
    "tt0150408",
    "tt0150989",
    "tt0152017",
    "tt0152009",
    "tt0153986",
    "tt0149590",
    "tt0151030",
    "tt0147872",
    "tt0149886",
    "tt0150256",
    "tt0150627"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.019Z"
}