{
  "movieId": "tt0105274",
  "title": "Rompecorazones",
  "year": 1992,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rompecorazones-1992",
      "id": "rompecorazones-1992",
      "title": "Rompecorazones (1992)",
      "description": "Rompecorazones  es una película  Argentina  dirigida por  Jorge Stamadianos . Fue estrenada en el 1992.(Wikipedia) Sinopsis Viviana es una dentista casada hace años con Mario, un profesor universitario. El matrimonio no ha tenido hijos, y ella, que ya ha cumplido 42 años, comienza a desesperarse. Una madrugada, el auto de Viviana se rompe en la Panamericana. Andrés, que maneja una grúa, se acerca a ayudarla y ella le propone mantener relaciones sólo para quedar embarazada. Pero pronto la relación entre ellos comienza a adquirir importancia. El conflicto crece cuando al trío se le suma Mónica, la amante de Mario, y el juego de cuatro se descubre. Todos terminan viviendo bajo el mismo techo, hasta que la convivencia se vuelve insostenible. Reparto Actor Personaje Teresa Costantini Viviana Jorge Sassi Mario David Di Napoli Andrés Jorge Diez Julio Grecia Levy Mónica Margara Alonso Emilia Claudio Rissi Policía Willy Lemos La Reina",
      "fileSize": 2044875327,
      "addedAt": "2026-01-07T00:10:40.950Z",
      "thumbnail": "https://archive.org/services/img/rompecorazones-1992",
      "language": "spa",
      "year": 1992,
      "collection": "feature_films",
      "downloads": 108
    }
  ],
  "metadata": {
    "Rated": "13",
    "Runtime": "100 min",
    "imdbRating": 5.4,
    "imdbVotes": 13,
    "Genre": "Comedy, Romance",
    "Plot": "Viviana es una dentista de clase media casada hace quience años con Mario , un profesor universitario. El matrimonio no ha tenido hijos y viviana, que ha cumplido 41 años comienza a desesperarse .Obsesionada, sufre de insomio y decide abrir su consultorio las 24 hs. Cuando vuelve agotada a las 7 de la mañana, Mario se levanta para ir a trabajar.Esta situacion ha llevado al matrimonio a verse muy poco, ya que es el unico momento del dia en que estan juntos.Una madrugada, el auto de Viviana se descompone en la ruta. Andres, que maneja una grua, se acerca a ayudarla y la salva. Viviana motivada por una foto que muestra Andres por un par de gemelos cree haber dado finalmente con la persona ideal. Le propone tener una relacion sexual con solo motivo de quedar embarazada.Mientras tanto, en casa de Viviana, Mario tampoco esta solo. Monica, una bailarina joven y desprejuiciada mantiene bien ocupado al profesor.Todo parece estar en un armonico equilibrio.Pero la relacion entre Viviana y Andres comienza a crecer en importancia. El embarazo no llega y por miedo a enloquecer de culpa, Viviana decide dejar a Andres, Andres dessperado busca a Mario y le cuenta su relacion con Viviana. Mario se sorprende pero como sabe que le cnviene acepta una relacion triangular, y asi se lo dice a Viviana.Aunque a esta altura ella ya no quiere saber nada con ninguno de los dos, a no ser que se vayan avivir los tres juntos. A pesar de las protestas de Mario, Andres se va a vivir con ellos.El dedicado equilibrio que Mario habia montado comienza a resquebrajarse. Cuando Monica se entera de que Viviana esta viviendo con Andres, que es su amante, le exije a Mario irse a vivir con el en las mismas condiciones. Como Mario se opone, Monica en una ataque de furia rompe los vidrios de la casa y consigue ser aceptada.Esta situacion de cuatro personas conviviendo en la casa se vuelve insostenible y devendra en un insolito descenlace.",
    "Director": "Jorge Stamadianos",
    "Writer": "Jorge Stamadianos",
    "Actors": "Jorge Sassi, María Teresa Costantini, Jorge Díez",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0107273",
    "tt0106941",
    "tt0106257",
    "tt0101301",
    "tt0111415",
    "tt0096926",
    "tt0114095",
    "tt0198316",
    "tt0095781",
    "tt0116102",
    "tt0032599",
    "tt0027311"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.950Z"
}