{
  "imdbId": "tt0147913",
  "title": "Boo Ribbon Winner",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/boo-ribbon-winner-1954",
      "title": "Boo Ribbon Winner (1954)",
      "description": "Molasses, an overweight greyhound, is racing right for the dog pound until Casper the Friendly Ghost lends a paw. Watch on RetroFlix:  https://retroflix.org/boo-ribbon-winner-1954/",
      "id": "boo-ribbon-winner-1954"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": "5.5",
    "imdbVotes": "44",
    "Genre": "Animation, Short",
    "Plot": "The late-40s to the early/mid-50s Casper the Friendly Ghost cartoons had a higher budget and overall the overall quality was much better. Onwards, the quality did diminish quite significantly though the overall cartoons varied, some decent, many mediocre.Famous Studios' cartoons are not for all tastes, but my opinion is that their early stuff and some of the early 50s output are good. While they were very formulaic they were always well animated and voiced with some funny parts, some poignancy and decent characters and their regular composer Winston Sharples could always be relied on to write a great and often outstanding score.Admittedly though, by the mid-50s through to the late-60s Famous Studios' cartoons did get repetitive. While Sharples' music still shone and the voice actors did their best the animation suffered due to lower budgets and tighter deadlines, the humour became more tired and slow in timing than sharp and funny, the stories became increasingly predictable and rehashed and some characters started losing their initial spark, this is particularly true of most of the later Herman and Katnip cartoons.There are better Casper The Friendly Ghost cartoons out there than 'Boo Ribbon Winner', especially the cartoons from 'There's Good Boos Tonight' and 'Boo To You Too' (the cartoons from this to 'Boo Moon' varied but mostly decent), the very unique (and the most original Casper cartoon) 'Boo Moon' is also up there. It does have its good things, but Famous Studios were starting to decline from around this period and the difference in quality from the very early Casper cartoons is staggering.Best thing about 'Boos and Arrows' is the music score. Experimenting more with a more mellow horn and string sound at this point, Winston Sharples' music score here is typically merry and whimsical, it's beautifully orchestrated, energetic and adds so much to the mood, his music has always been one of the best assets of the Famous Studios cartoons and it's not an exception here. In fact how it's composed and how it meshes so well with everything going on in the animation, story and action contributes to it being the best thing about the cartoon.While he is a character that won't click with everybody, Casper does win me over with his friendly nature and kindness. The dog is a decent enough character and while very typical the chemistry is sweet. The outcome of the ending was heart-warming if not exactly surprising, and the voice acting is dependable.However, 'Boo Ribbon Winner' is very repetitive plot-wise (outside of the different setting, the same formula of almost every Casper cartoon, or at least most of the same elements, is here), and that there is not much at all to the writing which is thin on the ground and what there is of it is frankly unmemorable and also very repetitious and sickly twee. To me, the animation, outside of some lovely colours, was not that great. The animation quality was great in 'Boo Moon' and in a vast majority of the Casper cartoons preceding that, but the quality declined after 'Boo Moon' and was not the same again. Colours aside, the backgrounds and drawings have lost their meticulousness and instead look hastily drawn and scrappy. The reactions to Casper have also been much more imaginative in Casper cartoons, not much special here in this regard.Outside of some sweetness and the heart-warming ending, there is not much to properly invest with here emotionally, with funny moments being few if any noticeable.In conclusion, once again the music is outstanding but 'Boo Ribbon Winner' is just too repetitive and forgettable at best. 5/10 Bethany Cox",
    "Director": "Izzy Sparber, Myron Waldman",
    "Writer": "Isadore Klein",
    "Actors": "Jack Mercer, Alan Shay",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0148075",
      "title": "Do or Diet",
      "year": 1953,
      "imdbRating": "5.7",
      "imdbVotes": "34",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148188",
      "title": "Frightday the 13th",
      "year": 1953,
      "imdbRating": "5.8",
      "imdbVotes": "46",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147960",
      "title": "Casper Comes to Clown",
      "year": 1951,
      "imdbRating": "5.5",
      "imdbVotes": "55",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147962",
      "title": "Casper Takes a Bow-Wow",
      "year": 1951,
      "imdbRating": "6.1",
      "imdbVotes": "49",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147916",
      "title": "Boos and Saddles",
      "year": 1953,
      "imdbRating": "5.1",
      "imdbVotes": "34",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148369",
      "title": "Keep Your Grin Up",
      "year": 1955,
      "imdbRating": "5.8",
      "imdbVotes": "27",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148666",
      "title": "Red White and Boo",
      "year": 1955,
      "imdbRating": "5.6",
      "imdbVotes": "37",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148093",
      "title": "Dutch Treat",
      "year": 1956,
      "imdbRating": "5.9",
      "imdbVotes": "33",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149100",
      "title": "Casper the Friendly Ghost - Spunky Skunky",
      "year": 1952,
      "imdbRating": "6.0",
      "imdbVotes": "34",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147914",
      "title": "Casper the Friendly Ghost - Boo Scout",
      "year": 1951,
      "imdbRating": "6.0",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148214",
      "title": "Ghost of Honor",
      "year": 1957,
      "imdbRating": "6.0",
      "imdbVotes": "30",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148309",
      "title": "Hooky Spooky",
      "year": 1957,
      "imdbRating": "6.4",
      "imdbVotes": "41",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:07:38.719Z"
}