{
  "movieId": "tt0147193",
  "title": "Presto-Chango",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/presto-chango-1929",
      "id": "presto-chango-1929",
      "title": "Presto-Chango (1929)",
      "description": "In this entry in the Aesop's Fables series, a boy and girl cat cannot keep their eyes- and paws- off each other. Watch on RetroFlix:  https://retroflix.org/presto-chango-1929/",
      "fileSize": 70153573,
      "addedAt": "2026-01-07T00:10:21.539Z",
      "thumbnail": "https://archive.org/services/img/presto-chango-1929",
      "language": "eng",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 46
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.3,
    "imdbVotes": 46,
    "Genre": "Animation, Short, Comedy",
    "Plot": "The Aesop's Film Fables cartoons are pretty interesting for anybody interested in very early animation and who's an animation fan wanting to see cartoons of all decades, count me as somebody in both categories. They are variable in quality and would personally hesitate in calling many, if any, of them great, but while they are not necessarily must watches they are not must avoids either.'Presto-Chango' epitomises all of this. Far from terrible while less than great at the same time, with all the same strengths and flaws of the Aesop's Film Fables series. Flaws and strengths that are also seen but to a generally worse extent in the 1929 onwards Aesop's Fables cartoons with Van Beuren Studios fully taken over after the disagreement with director Paul Terry. It is easy to see why it may not work for some. The animation generally is crude and simplistic. The story is very slight, mostly non-existent with the first part feeling more like mundane filler with not enough laughs. Very few, if any, of the characters are particularly memorable or with enough engaging personalities to captivate, they are animated poorly too. However, there are things that make 'Presto-Chango' watchable. The pace really picks up from the middle to the end, going at a lively rate and living up to the cartoon's title. While standard and with little innovation, the second half also tries to have some kind of story, it disjoints the cartoon somewhat but it helps make the cartoon more interesting. In the second half the action compels and amuses and when things get going there are some well-engineered gags. Synchronisation is surprisingly neat, not being at odds as was the case with some of the later Aesop's Fables series, one would think it would be the other way around and that it would become more refined later. It is the splendidly peppy and cleverly and beautifully orchestrated music score that fares best of all though.Overall, not really great but watchable. 5/10 Bethany Cox",
    "Director": "Frank Moser, Paul Terry",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0146975",
    "tt0150133",
    "tt0152538",
    "tt0151219",
    "tt0147313",
    "tt0152274",
    "tt0146423",
    "tt0146596",
    "tt0150513",
    "tt0019014",
    "tt0146913",
    "tt0142419"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:21.539Z"
}