{
  "imdbId": "tt0150785",
  "title": "The Green Line",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-green-line-1944",
      "title": "The Green Line (1944)",
      "description": "In the town of Nowhere, the main street is divided by a broad green line. The mice live on one side. The cats live on the other, and never cross over the line, until an evil spirit convinces one of the cats to cross the line. Chaos ensues until Mighty Mouse arrives to defeat the evil spirit cat in a battle in the sky. The evil spirit cat crashes to the ground and burns up in a flaming pile! Watch on RetroFlix:  https://retroflix.org/the-green-line-1944/",
      "fileSize": 30708973,
      "id": "the-green-line-1944"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "5 min",
    "imdbRating": 6.1,
    "imdbVotes": 41,
    "Genre": "Animation, Short",
    "Plot": "Terrytoons Studios' output is interesting to watch but most it ranges between lacklustre and decent, seldom great but major misfires tended to be in their very early years or in their later output. Although drastically uneven and all their different year batches (cartoons from 1944 for example) are all very mixed bags, generally their cartoons are watchable and are mainly worth seeing for completest sake. Or at least that has always been my main reason.1944 was quite a prolific year for Terrytoons' most used regular character Mighty Mouse, a likeable enough if somewhat limited character. The cartoons that he did feature, tending to feel like he was featuring in a major role rather than starring considering he was the titular character, in are worth at least one-time watch though none are great as such and the quality varied a little. 'The Green Line' though for me is one of the better 1944 Mighty Mouse cartoons (among the better ones up to this point of his series) and among his better overall cartoons. Also one of the better 1944 Terrytoons cartoons.Will start with the not so good things this time, tending when reviewing Terrytoons to start with the good things. 'The Green Line' contains few surprises and is pretty formulaic, which was not unexpected as Mighty Mouse's series is a very formulaic one that got increasingly so. If you have seen many cats versus mice cartoons you will have seen it all before here, likewise with Mighty Mouse's role here.Mighty Mouse himself hasn't lost his likeability but for a titular character he could have been featured more and appeared earlier, am in two minds too as to whether his presence was particularly necessary considering that the cat versus mice battle was already engaging enough without him. Other cartoons however do worse though at this, and at feeling too much like two cartoons in one. The narration is distinguished and didn't feel corny or over-explanatory, but it was only really needed at the beginning to introduce the action.On the other hand, the music in 'The Green Line' is its usual lush and characterful self. Also excelling in enhancing everything going on between the cats and mice, even in little things like the mice tip-toeing. The animation is equally great in quality, especially the backgrounds and landscapes where the atmosphere evoked is to be admired greatly.It's, 'The Green Line' that is, one of the funnier Mighty Mouse cartoons to me, with the last minute or so being pretty much a riot. Gags are quite a lot and they are amusing. There is also a genuine sense of threat, without being too dark or too sinister. The story may be slight and predictable, but it engages and charms at least. While the mice are hardly devoid of personality, the most interesting characters by far are the cats, especially the black one who features more in the cartoon. They actually feel more like the lead characters than Mighty Mouse and their antics and methods are entertaining.Summing up, definitely worth watching and compares favourably among the 1944 Terrytoons output, their output overall and with the Mighty Mouse series. 7/10",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Donald McKee, Tom Morrison",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0150279",
      "title": "A Day in June",
      "year": 1944,
      "imdbRating": 6.5,
      "imdbVotes": 13,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149726",
      "title": "At the Circus",
      "year": 1944,
      "imdbRating": 7,
      "imdbVotes": 56,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150293",
      "title": "Dear Old Switzerland",
      "year": 1944,
      "imdbRating": 4.4,
      "imdbVotes": 13,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0037108",
      "title": "My Boy Johnny",
      "year": 1944,
      "imdbRating": 5.5,
      "imdbVotes": 113,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150879",
      "title": "The Helicopter",
      "year": 1944,
      "imdbRating": 6.7,
      "imdbVotes": 23,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153363",
      "title": "The Two Barbers",
      "year": 1944,
      "imdbRating": 5.8,
      "imdbVotes": 30,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151565",
      "title": "Mighty Mouse and the Wolf",
      "year": 1945,
      "imdbRating": 6.9,
      "imdbVotes": 84,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152406",
      "title": "Shipyard Symphony",
      "year": 1943,
      "imdbRating": 5.3,
      "imdbVotes": 12,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147188",
      "title": "The Port of Missing Mice",
      "year": 1945,
      "imdbRating": 5.9,
      "imdbVotes": 34,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152445",
      "title": "The Silver Streak",
      "year": 1945,
      "imdbRating": 5.9,
      "imdbVotes": 35,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0153985",
      "title": "Yokel Ducks Makes Good",
      "year": 1943,
      "imdbRating": 5.1,
      "imdbVotes": 16,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149801",
      "title": "Barnyard Waac",
      "year": 1942,
      "imdbRating": 5.6,
      "imdbVotes": 5,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.587Z"
}