{
  "imdbId": "tt0184958",
  "title": "Todo un hombre",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/todo-un-hombre-1943",
      "id": "todo-un-hombre-1943",
      "title": "Todo Un Hombre (1943)",
      "description": "Todo un hombre  es una película  argentina  dirigida por  Pierre Chenal  sobre guion de  Homero Manzi ,  Miguel Mileo  y  Ulises Petit de Murat  según la novela  Nada menos que todo un hombre  de  Miguel de Unamuno  que se estrenó el 16 de agosto de 1943 y que tuvo como protagonistas a  Francisco Petrone ,  Amelia Bence ,  Nicolás Fregues ,  Florindo Ferrario  y  Guillermo Battaglia . (Wikipedia) Sinopsis Una mujer venida a menos se casa con un hombre rico Produccion Inicialmente Chenal fue contratado por  Artistas Argentinos Asociados , una empresa cinematográfica que había sido creada apenas un año antes de su llegada a Buenos Aires y que aspiraba a trabajar en forma de cooperativa. El guion fue encargado a Homero Manzi y Ulyses Petit de Murat. La obra original era una historia de pasiones impregnada de romanticismo en la cual los guionistas encontraron diversos escollos para trasvasarla al cine. El personaje principal de la novela, a cuya caracterización como \"todo un hombre\" por Unamuno se refería el título, tenía una actitud ambigua respecto de la relación que su mujer mantenía con un tercero que la perseguía. 2 ​ Cuando los guionistas finalizaron su trabajo y se realizó su lectura surgió un fuerte entredicho con Chenal. El director sostenía que la película debía mostrar en forma inequívoca que la esposa se había entregado al acosador: según él la grandeza del personaje consistía en saberse engañado y perdonar. Los guionistas se oponían afirmando que el personaje era \"todo un hombre\" justamente porque era capaz de seguir amándola a pesar de las sospechas sobre su conducta. La discusión subió de tono, la reunión se disolvió y pareció que el proyecto tal como estaba concebido abortaba. 2 ​ Sin embargo, al día siguiente hubo nuevas reuniones y se modificó el guion. Para los guionistas eran cambios sin importancia, en tanto que el director los veía como fundamentales, con lo cual el entendimiento dejó a todos muy satisfechos. La película fue un éxito, se mantuvo ocho semanas en las salas de estreno y recibió elogios de los críticos de cine, al igual que su director y actores. 2 ​ Hay otro filme español basado en la novela, titulado  Nada menos que todo un hombre  (1972) dirigido por  Rafael Gil . Reparto Francisco Petrone  ...Alejandro Gómez Amelia Bence  ...Julia Nicolás Fregues  ...Doctor Sendra Florindo Ferrario  ...Héctor Giró Guillermo Battaglia Ana Arneodo  ...Ana, madre de Julia Tilda Thamar  ...Alicia Carlos Bellucci Juan Carrara Jacinta Diana Jorge Lanza  ...Enrique Regules Liana Moabro  ...dama de la caridad Percival Murray René Mugica  ...José Leticia Scury Juan Serrador",
      "fileSize": 1255499489,
      "addedAt": "2026-01-07T00:12:44.284Z",
      "thumbnail": "https://archive.org/services/img/todo-un-hombre-1943",
      "language": "spa",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 61
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "94 min",
    "imdbRating": 7.8,
    "imdbVotes": 18,
    "Genre": "Drama",
    "Plot": "Based on the novel by Miguel de Unamuno \"Nada menos que todo un hombre\". A woman come to marry a rich man.",
    "Director": "Pierre Chenal",
    "Writer": "Homero Manzi, Miguel Mileo, Ulises Petit de Murat",
    "Actors": "Francisco Petrone, Amelia Bence, Nicolás Fregues",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0184755",
    "tt0121724",
    "tt0184987",
    "tt0199895",
    "tt0181272",
    "tt0194782",
    "tt0184188",
    "tt0181348",
    "tt0037969",
    "tt0034636",
    "tt0035622",
    "tt0035614"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}