{
  "imdbId": "tt0102401",
  "title": "Marcellino",
  "year": 1991,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xj2IaCHiOOw",
      "id": "Xj2IaCHiOOw",
      "title": "Marcellino (1991) by Luigi Comencini with Didier Bénureau (Drama, Religion film)",
      "description": "In the 15th century, in a poor Italian village, the monks of a modest convent take up an abandoned baby. Unfortunately, for all their efforts, they prove unable to trace his parents. So they set up providing tender loving care to the little boy. Marcellino lives a happy life among the men of God but, as he grows up, he misses his mother more and more. To compensate for her absence, he tends to identify her with the Virgin Mary. One day, the local lord, in search of a child to raise, decides to adopt Marcellino and to bring him up in his castle. He dresses him in rich attire and gives him a strict education. But Marcellino feels miserable there and eventually runs away. Back in his dear convent, he gleefully resumes his former life. He still misses his mother but his life changes when he finds a crucifix in the attic. A wonderful friendship between Jesus and him is born.\n\nOriginal title: Marcellino pane e vino (1991) \n\nThis film has Italian & English audio, and subtitled in many language options.\n\nDirector: Luigi Comencini\nWriters: Luigi Comencini, Ennio De Concini, José María Sánchez Silva\nStars: Didier Bénureau, Sergio Bini Bustric, Alberto Cracco\nGenres: Drama, Religion\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:34.206Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Xj2IaCHiOOw/maxresdefault.webp?v=6633013e",
      "duration": 5535,
      "language": "en",
      "year": 1991,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "92 min",
    "imdbRating": 5.9,
    "imdbVotes": 264,
    "Genre": "Drama",
    "Plot": "In the 15th century, in a poor Italian village, the monks of a modest convent take up an abandoned baby. Unfortunately, for all their efforts, they prove unable to trace his parents. So they set up providing tender loving care to the little boy. Marcellino lives a happy life among the men of God but, as he grows up, he misses his mother more and more. To compensate for her absence, he tends to identify her with the Virgin Mary. One day, the local lord, in search of a child to raise, decides to adopt Marcellino and to bring him up in his castle. He dresses him in rich attire and gives him a strict education. But Marcellino feels miserable there and eventually runs away.Back in his dear convent, he gleefully resumes his former life. He still misses his mother but his life changes when he finds a crucifix in the attic. A wonderful friendship between Jesus and him is born.",
    "Director": "Luigi Comencini",
    "Writer": "Luigi Comencini, Ennio De Concini, José María Sánchez Silva",
    "Actors": "Didier Bénureau, Sergio Bini Bustric, Alberto Cracco",
    "Language": "Italian",
    "Country": "Spain, Italy, France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0101843",
    "tt0101465",
    "tt0235245",
    "tt0310574",
    "tt0279243",
    "tt0103205",
    "tt0101592",
    "tt0102715",
    "tt0102920",
    "tt0103838",
    "tt0105175",
    "tt0101638"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:35:47.309Z"
}