{
  "imdbId": "tt0121367",
  "title": "El hijo del crack",
  "year": 1953,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-hijo-del-crack-1953",
      "id": "el-hijo-del-crack-1953",
      "title": "El Hijo Del Crack (1953)",
      "description": "El Hijo del crack  (que significa \"Hijo de la Estrella\"  [  1  ]  ) es una  película  argentina  de melodrama deportivo  de 1953  de la  era clásica del cine argentino  , codirigida por  Leopoldo Torre Nilsson  y  Leopoldo Torres Ríos  [  2  ]  y protagonizada por  Armando Bo  y Oscar Rovito. La película, una historia de una estrella de fútbol profesional en decadencia y su hijo, se estrenó el 15 de diciembre de 1953  [  3  ]  [  4  ]  en el cine Normandie de Buenos Aires. El elenco incluía a importantes futbolistas profesionales de la época como  Mario Boyé  ,  Tucho Méndez  y  Ángel Labruna  y periodistas como Fioravanti. Es la última película en la que Leopoldo Torres Ríos y Leopoldo Torre Nilsson (padre e hijo  [  5  ]  [  6  ]  ) trabajaron juntos. La película de 77 minutos  [  7  ]  fue producida por  Sociedad Independiente Filmadora Argentina  (SIFA).(Wikipedia) Trama Mario López (Oscar Rovito) es un niño, hijo de un futbolista veterano (Armando Bo). Por un lado, mientras su padre es repudiado por la afición por no poder jugar físicamente, intenta convencerse de que se trata de un declive temporal y que volverá a ser una estrella. Por otro lado, su madre y su abuelo materno rechazan el mundo del fútbol y la calle, argumentando que es un mundo primitivo e inadecuado, lo que lo aísla. Solo su hijo sigue siendo un gran aficionado. Tras morir de una grave enfermedad, intenta complacer a su afición una vez más y recuperar su estatus de leyenda. Elenco Armando Bo  como Héctor 'Balazo' López Óscar Rovito  como Mario López Miriam Sucre  como María del Carmen de López Francisco Pablo Donadio  como Alvarado Pedro Laxalt Héctor Armendáriz Alberto Rinaldi Rolando Dumas Nelson de la Fuente Carlos Benso Recepcion La Guía Internacional de Cine describió la película como una \"obra puramente comercial\", a diferencia de muchas otras películas de Torre Nilson, como  El Crimen de Oribe  (1950) y películas posteriores, que eran más bien películas de arte con atención a los temas, la trama y los aspectos psicológicos.  [  8  ]  [  9  ]   Jorge Miguel Couselo,  en su libro de 1984  Historia del cine argentino,  comentó que \"a pesar de un guion pobre, [la película] mostró seriedad\" y elogió el talento y la actuación de Oscar Rovito en el papel del hijo.  [  10  ]  Ricardo Oliveri, en su libro de 1997  Cine argentino: crónica de 100 años,  coincidió en que Rovito había contribuido con una buena actuación y describió la película como un \"producto agradable\".  [  11  ]  El  Instituto de Literatura Argentina  destacó la fuerte presencia del padre y el hijo en la película y destacó sus elementos y carga neorrealistas.  [  12  ]",
      "fileSize": 1129645225,
      "addedAt": "2026-01-07T00:08:15.378Z",
      "thumbnail": "https://archive.org/services/img/el-hijo-del-crack-1953",
      "language": "spa",
      "year": 1953,
      "collection": "feature_films",
      "downloads": 59
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "77 min",
    "imdbRating": 6.3,
    "imdbVotes": 22,
    "Genre": "Drama",
    "Plot": "A famous football player faces retirement, but his son is still his most faithful fan.",
    "Director": "Leopoldo Torre Nilsson, Leopoldo Torres Ríos",
    "Writer": "Rafael García Ibáñez, Leopoldo Torre Nilsson, Leopoldo Torres Ríos",
    "Actors": "Armando Bo, Óscar Rovito, Miriam Sucre",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0201548",
    "tt0045473",
    "tt0045463",
    "tt0045465",
    "tt0045551",
    "tt0045533",
    "tt0046543",
    "tt0045566",
    "tt0045631",
    "tt0045669",
    "tt0046187",
    "tt0045557"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.378Z"
}