{
  "imdbId": "tt0195934",
  "title": "The Mystery of the Tea Dansant",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-mystery-of-the-tea-dansant",
      "id": "silent-the-mystery-of-the-tea-dansant",
      "title": "The Mystery of the Tea Dansant",
      "fileSize": 421239655,
      "addedAt": "2026-01-07T00:11:15.978Z",
      "thumbnail": "https://archive.org/services/img/silent-the-mystery-of-the-tea-dansant",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 340
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Short, Drama",
    "Plot": "Shortly after the mysterious disappearance of Marguerite Wheeler, an heiress, her mother receives a note demanding $5,000 for the girl's return. Ruth, the girl detective, assumes charge of the case and advises the frantic mother to comply with the demand. Harry Warrington, whose life the girl detective had saved in a previous case, uses his political influence to secure a position on the force. He becomes Ruth's assistant. The two find that the trail leads to the Tea Dansant conducted by Marmaduke. At Ruth's suggestion, Darby, Marmaduke's assistant, is arrested and questioned. The man breaks down and confesses that Marguerite is being held a prisoner by Marmaduke, who is in financial straits. Darby relates further of how he had served time in an English prison because of Marmaduke's treachery. The man possesses a hypnotic influence over Darby, which the latter is powerless to break. The girl detective secures Darby's co-operation. The man returns to the Tea Dansant. Ruth and Warrington visit the place. The girl detective fascinates Marmaduke, who invites her to his office. Knowing that Marguerite is locked up in an adjoining room, Ruth accepts the invitation. At an opportune moment, she thrusts a pistol into the scoundrel's face and orders him to release his prisoner. Marmaduke, however, overpowers Ruth. Darby rushes to her rescue. A shot rings out and Marguerite's kidnapper falls dead. But Ruth no sooner returns the girl to her mother, than she finds herself confronted by another case.",
    "Director": "James W. Horne",
    "Writer": "Hamilton Smith",
    "Actors": "Ruth Roland, R. Henry Grey, Cleo Ridgely",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0326289",
    "tt1072650",
    "tt0003803",
    "tt0005414",
    "tt0231300",
    "tt0005246",
    "tt0482779",
    "tt0005622",
    "tt1262050",
    "tt0228815",
    "tt0005047",
    "tt0442148"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.978Z"
}