{
  "imdbId": "tt0161010",
  "title": "The Trench",
  "year": 1999,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-trench-1999",
      "id": "the-trench-1999",
      "title": "The Trench (1999)",
      "description": "The Trench is a war drama set during World War I, focusing on the experiences of British soldiers stationed in the trenches of France. The story centers on a group of young men, primarily highlighting the life and struggles of Private Billy Hayes, who navigates the harsh realities of war. The film portrays the camaraderie among the soldiers as they deal with the constant threat of death, the strain of trench warfare, and their longing for home. Characters face personal fears and the psychological impact of war.As the narrative unfolds, the soldiers prepare for an impending attack, showcasing their fears and hopes. The film captures their daily routines, the monotony of life in the trenches, and the moments of levity that bring them solace in dark times.The climax occurs during a significant battle scene, where the soldiers must confront their reality head-on. The film emphasizes not only the physical dangers but also the emotional and moral dilemmas they encounter.",
      "fileSize": 914812261,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-trench-1999",
      "language": "eng",
      "year": 1999,
      "collection": "feature_films",
      "downloads": 195
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "98 min",
    "imdbRating": 5.9,
    "imdbVotes": 4304,
    "Genre": "Drama, History, War",
    "Plot": "June 1916. The British Army is planning a big offensive in the Somme region in France. We follow a platoon of British soldiers as they sit in a forward trench, anxiously awaiting the order to go over the top.",
    "Director": "William Boyd",
    "Writer": "William Boyd",
    "Actors": "Paul Nicholls, Daniel Craig, Julian Rhind-Tutt",
    "Language": "English, German",
    "Country": "France, United Kingdom",
    "Awards": "2 wins & 2 nominations"
  },
  "relatedMovies": [
    "tt0092978",
    "tt0057811",
    "tt0044400",
    "tt0227607",
    "tt0159476",
    "tt0014672",
    "tt0043590",
    "tt0035958",
    "tt0046029",
    "tt0005719",
    "tt0075784",
    "tt0049302"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}