{
  "imdbId": "tt0152222",
  "title": "Romance",
  "year": 1932,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/romance-1932",
      "id": "romance-1932",
      "title": "Romance (1932)",
      "description": "Romance is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/romance-1932/",
      "fileSize": 34908654,
      "addedAt": "2026-01-07T00:10:40.949Z",
      "thumbnail": "https://archive.org/services/img/romance-1932",
      "language": "eng",
      "year": 1932,
      "collection": "feature_films",
      "downloads": 74
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.8,
    "imdbVotes": 17,
    "Genre": "Short, Animation",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. 'Romance' is a perfect example of all this. The 1932 batch of Terrytoons started off watchable if unexceptional, before dipping drastically with 'Bull-ero' and 'Radio Girl' and 'Woodland' were only a marginal improvement. Luckily, while far from great, 'Romance' is a return to the watchable standard set when the 1932 batch of Terrytoons started.Its main reason for viewing is mainly for anybody striving to see every Terrytoons available like me. Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Some of the backgrounds are detailed and ambitious enough and yes it's a little more elaborate looking than the previous 1932 cartoons. There is a charm that is natural and never forced, a few of the gags are amusing and reasonably timed, there is not as big an issue with the pace, synchronisation has neatness and the cat is a fun character.On the other hand, much of the rest of the animation is not great, not good even. Even for Terrytoons, while not doing as much cheating as some earlier cartoons, it is primitive at best and there is a lot of crudeness and over-simplicity going on in the way that the characters are designed. Story is not much of one and formulaic, doing very little new with a very old and melodramatic premise. That the mice characters lack personality (or ones that engage or stand out from similar Terrytoons heroes) and there are not enough gags or enough moments that one really remembers doesn't help matters.Overall, a long way from unwatchable but hardly a must-watch or one for repeated viewings. 5/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149979",
    "tt0149991",
    "tt0150160",
    "tt0150165",
    "tt0150515",
    "tt0161563",
    "tt0150516",
    "tt0150933",
    "tt0150945",
    "tt0151076",
    "tt0161863",
    "tt0161913"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.949Z"
}