{
  "imdbId": "tt0130633",
  "title": "Body of the Prey",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BodyOfThePrey1966",
      "id": "BodyOfThePrey1966",
      "title": "BODY OF THE PREY",
      "description": "From the IMDb: \"The credits on the version of this movie which exists today are actually for the movie \"Mad Doctor of Blood Island\" and bear no relation to this film. This comes from when they were originally intended to be released as a double feature. \"Contrary to popular belief, this film was not directed by Kenneth G. Crane, was not made in 1970, was not produced by Toei Company, and was not titled \"The Double Garden\". It was originally filmed in 1966 as \"Body of the Prey\" and it was produced and directed by Norman Thomson. Thomson was the popular pulp novelist of the Burns Bannion series, which he wrote under his pen name 'Earl Thomson'. The production was assisted by members of the United States military bases in Japan and shot on location there. During production, Al Rickett wrote about the making of this film in the 'Stars & Stripes' newspaper, as well as having a small part as a gas station owner. However, while Edward D. Wood Jr. claimed he wrote the script for this film under the title \"Venus Flytrap\" and placed it on his resumes, reports of the making of the film in 'Stars & Stripes' claim Thomson wrote the script. It's possible that Wood sold the script to Thomson and it was slightly re-written before production. It's undetermined if the completed film was released theatrically, in either Japan or the United States.\" I have taken the liberty of replacing the credits with the data listed on the IMDb, footage from the Moody Institute's \"Carnivorous Plants,\" and a little music from \"Knife of the Party.\" I did it with my handy-dandy NERO. Since this created a NEW work under the law, despite being a simple combination of Public Domain works, I slapped a copyright notice on the back. Hack those off and the film belongs to everyone. If you don't, expect trouble from YouTube! The original VHS release can be downloaded from Public Domain Movie Torrents, complete with incorrect credits under the \"Revenge of Dr. X\" title. Whether or not Ed Wood had anything to do with this steaming dogflop of a film, it's certainly worthy of his name!",
      "fileSize": 2896429589,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BodyOfThePrey1966",
      "year": 1966,
      "collection": "feature_films",
      "downloads": 41848
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/body-of-the-prey-1967",
      "id": "body-of-the-prey-1967",
      "title": "Body of the Prey (1967)",
      "description": "A mad scientist creates man eating creatures from carnivorous plants. Watch on RetroFlix:  https://retroflix.org/body-of-the-prey-1967/",
      "fileSize": 586758216,
      "addedAt": "2026-01-07T00:07:38.719Z",
      "thumbnail": "https://archive.org/services/img/body-of-the-prey-1967",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 107
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "94 min",
    "imdbRating": 2.7,
    "imdbVotes": 695,
    "Genre": "Horror, Sci-Fi",
    "Plot": "A NASA scientist turns a Venus Flytrap into a monstrous humanoid while on vacation in Japan.",
    "Director": "Norman Earl Thomson",
    "Writer": "Norman Earl Thomson, Edward D. Wood Jr.",
    "Actors": "James Craig, Tota Kondo, Lawrence O'Neill",
    "Language": "Japanese, English",
    "Country": "United States, Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0062036",
    "tt0059161",
    "tt0061217",
    "tt0061683",
    "tt0062168",
    "tt0062411",
    "tt0060580",
    "tt0061529",
    "tt0060270",
    "tt0060558",
    "tt0063195",
    "tt0063206"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.719Z"
}