{
  "imdbId": "tt0151449",
  "title": "Magoo Goes Skiing",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/magoo-goes-skiing-1954",
      "id": "magoo-goes-skiing-1954",
      "title": "Magoo Goes Skiing (1954)",
      "description": "Mr. Magoo and his nephew Waldo are vacationing at a ski lodge in the Swiss Alps. Magoo is intent on braving the slopes while Waldo tries to flirt with a pretty girl he meets up with. Unfortunately, Magoo takes the wrong turn while climbing the mountain pass and instead of going to the ski summits, he instead climbs to the top of the steep Matternot. A professor sees Magoo and, sensing danger, sends a St. Bernard up to rescue him. Magoo mistakes the St. Bernard for Waldo and takes the dog with him when he starts skiing eventually causing an avalanche. Watch on RetroFlix:  https://retroflix.org/magoo-goes-skiing-1954/",
      "fileSize": 38848169,
      "addedAt": "2026-01-07T00:09:46.422Z",
      "thumbnail": "https://archive.org/services/img/magoo-goes-skiing-1954",
      "language": "eng",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 106
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 6.5,
    "imdbVotes": 46,
    "Genre": "Family, Animation, Short",
    "Plot": "Mr. Magoo and his nephew Waldo are vacationing at a ski lodge in the Swiss Alps. Magoo is intent on braving the slopes while Waldo tries to flirt with a pretty girl he meets up with. Unfortunately, Magoo takes the wrong turn while climbing the mountain pass and instead of going to the ski summits, he instead climbs to the top of the steep Matternot. A professor sees Magoo and, sensing danger, sends a St. Bernard up to rescue him. Magoo mistakes the St. Bernard for Waldo and takes the dog with him when he starts skiing eventually causing an avalanche.",
    "Director": "Pete Burness",
    "Writer": "T. Hee, Bill Scott",
    "Actors": "Jim Backus, Jerry Hausner",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150308",
    "tt0151179",
    "tt0151432",
    "tt0162458",
    "tt0151451",
    "tt0151454",
    "tt0150019",
    "tt0150039",
    "tt0151446",
    "tt0151450",
    "tt0045033",
    "tt0150357"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.422Z"
}