{
  "movieId": "tt0151353",
  "title": "Little Boy Blue",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/little-boy-blue-1933",
      "id": "little-boy-blue-1933",
      "title": "Little Boy Blue (1933)",
      "description": "Little Boy Blue is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/little-boy-blue-1933/",
      "fileSize": 35119647,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/little-boy-blue-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 45
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.1,
    "imdbVotes": 10,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1933 again was a hit and miss year for Terrytoons. 'Little Boy Blue' is for me one of the batch's weakest, with more problems than it has strengths in both cases being the same as usual. Instead of being watchable or more, 'Little Boy Blue' is pretty weak and its main, and really only, reason to view it is if you are a Terrytoons completest trying to see all that are available (like me).Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action.Sometimes the pace is lively and a couple of gags are mildly amusing. Other than that, there is not much to recommend.It is one of the worst-looking 1933 Terrytoons, outside of the background detail which is the only thing that looks good. Very crude and simplistic.Likewise, the story is paper thin and formulaic with a big air of over-familiarity. The overload of sugar and cutesiness became too difficult to take when there were not enough gags to make up for that and balance it out. There are not enough gags and they are generally not particularly funny, clever or memorable, plus completely unimaginative. The energy mostly isn't there, the timing of the material not being sharp enough, and neither is the charm. It is non-stop bland. Don't remember the characters very much, the wolf is the best character but is basically your typical Terrytoons antagonist. And yes the lyrics are pretty bad here.Overall, weak. 3/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150804",
    "tt0149817",
    "tt0150130",
    "tt0150382",
    "tt0150504",
    "tt0146721",
    "tt0150774",
    "tt0150820",
    "tt0151001",
    "tt0151046",
    "tt0151118",
    "tt0151217"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.891Z"
}