{
  "imdbId": "tt0194467",
  "title": "Tres veces Ana",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tres-veces-ana-1961",
      "title": "Tres Veces Ana (1961)",
      "description": "Tres veces Ana  es una película  argentina  en blanco y negro estrenada el 2 de noviembre de 1961, dirigida por  David José Kohon  sobre su propio guion, que tiene como principales intérpretes a  María Vaner ,  Luis Medina Castro ,  Alberto Argibay  y  Walter Vidarte . La película se compone de tres historias independientes en cada una de las cuales la protagonista principal, encarnada por María Vaner, se llama Ana. (Wikipedia) Sinopsis La tierra  es el nombre de la primera historia en la cual un grupo de jóvenes amigos -todos varones- que se reunía habitualmente en un suburbio de  Buenos Aires  donde viven ven pasar a menudo a una joven bella y de apariencia recatada, encarnada por María Vaner, que también era de la zona. A raíz de los comentarios que realizan entre sí sobre ella, uno de ellos, representado por Luis Medina Castro, apuesta a que logrará conquistarla. La circunstancia de que los dos jóvenes coinciden a menudo en el tren que los lleva a sus empleos le da oportunidad de acercarse a ella e iniciar una conversación. Él vive con sus padres y hermano y trabaja en una fábrica. en tanto Ana vive sola con su madre y trabaja en una juguetería. Salen varias veces a pasear y comienzan a tener relaciones íntimas de las que resulta su embarazo. Cuando el joven se entera le dice que no quiere casarse, esto es que no desea modificar la vida de soltero que está llevando y en la cual se siente cómodo y sin compromisos, y que debe abortar. Ana, que a todas luces preferiría casarse y tener su hijo, se resigna y acepta que un médico que es tío del joven interrumpa el embarazo. A pesar de los pedidos de él de continuar la relación, ella inmediatamente después la corta por completo. En  El aire , la segunda historia Pepe y Raúl, dos muchachos de barrio, van a pasar el día en una playa de río cercana a Buenos Aires y para cambiarse de ropa usan una casilla allí ubicada. En ese lugar conocen a varias personas que evidentemente no son las que habitualmente frecuentan; entre ellos hay dos hombres de origen alemán que beben y discuten, un homosexual que canta y además está Ana, que en un momento queda caracterizada cuando dice «tengo ganas y no sé de qué». Ana actúa en forma desenfadada y en varias ocasiones se dirige a Raúl como el «normal» que trabaja y estudia matemáticas. Al caer la noche Ana invita a Pepe a salir a la playa solitaria con el evidente fin de que mantengan relaciones, a lo que el joven consiente. Al regresar hace la misma invitación a Raúl; cuando están solos en la playa le dice a Ana que se siente atraído por ella pero no acepta tener relaciones porque quiere un vínculo de otro tipo. Luego hay una escena en la que uno de los alemanes no se anima a suicidarse, pero al empuñar Ana la pistola con la que pensaba hacerlo la misma se dispara sin consecuencias. Ana y sus amigos van hacia una fiesta en auto, Raúl trata de que se quede pero ella parte y los jóvenes vuelven a su casa y a su vida. La tercera historia llamada  La nube  tiene como protagonista a Daniel, a quien llaman «Monito», que trabaja en un periódico como diagramador y dibujante. Como dice de él otro de los personajes, Daniel es «un solitario por nacimiento». Un día desde la calle ve una figura de mujer a través de una ventana y se obsesiona con ella, a quien llama Ana, tiene ensoñaciones en las cuales con ella conversa, va al cine, a un parque de diversiones. Un día cuando pasa por la casa advierte que del balcón había caído una maceta con flores por lo que aprovecha a tomarla y subir al departamento. Lo recibe una mujer de mediana edad que le agradece su gesto; entonces advierte que la silueta que había visto era la del maniquí de la modista que lo había atendido. Reparto María Vaner  (1935-2008). Luis Medina Castro  (1928-1995). Alberto Argibay  (1932-2007). Walter Vidarte  (1931-2011). Carlos Alberto Usay Lautaro Murúa  (1926-1995). Rossana Zucker Jorge Rivera López  (1934-). José María Fra Javier Portales  (1937-2003). Roberto Olivier Ovidio Fuentes  (1929-1998). Mecha López Oscar Matarrese Pascual Nacaratti Jorge Cavanet Lucio Deval Beatriz Matar",
      "fileSize": 1802380478,
      "id": "tres-veces-ana-1961"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "115 min",
    "imdbRating": 7.6,
    "imdbVotes": 84,
    "Genre": "Drama",
    "Plot": "Three independent stories about three different women, all named Ana and played by the same actress.",
    "Director": "David José Kohon",
    "Writer": "David José Kohon",
    "Actors": "María Vaner, Luis Medina Castro, Alberto Argibay",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "2 wins & 1 nomination"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0144556",
      "title": "Prisioneros de una noche",
      "year": 1961,
      "imdbRating": 7.2,
      "imdbVotes": 54,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0189375",
      "title": "Así o de otra manera",
      "year": 1964,
      "imdbRating": 6,
      "imdbVotes": 9,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0188011",
      "title": "Los jóvenes viejos",
      "year": 1962,
      "imdbRating": 7.2,
      "imdbVotes": 99,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0055736",
      "title": "Alias Gardelito",
      "year": 1961,
      "imdbRating": 7,
      "imdbVotes": 84,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0144119",
      "title": "Breve cielo",
      "year": 1969,
      "imdbRating": 7.6,
      "imdbVotes": 104,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0189343",
      "title": "El agujero en la pared",
      "year": 1982,
      "imdbRating": 6.1,
      "imdbVotes": 48,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054162",
      "title": "La patota",
      "year": 1960,
      "imdbRating": 6.7,
      "imdbVotes": 97,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0189606",
      "title": "Los inconstantes",
      "year": 1962,
      "imdbRating": 6.3,
      "imdbVotes": 11,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0314675",
      "title": "Simiente humana",
      "year": 1959,
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054809",
      "title": "Diary of a Nudist",
      "year": 1961,
      "imdbRating": 4.2,
      "imdbVotes": 567,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0054817",
      "title": "Five Minutes to Live",
      "year": 1961,
      "imdbRating": 5.5,
      "imdbVotes": 1009,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053987",
      "title": "The Steamroller and the Violin",
      "year": 1961,
      "imdbRating": 7.4,
      "imdbVotes": 7703,
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.129Z"
}