{
  "imdbId": "tt0149769",
  "title": "Bad Bill Bunion",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bad-bill-bunion-1945",
      "title": "Bad Bill Bunion",
      "description": "Bad Bill Bunion is a Terrytoons cartoon directed by Mannie Davis. Watch on RetroFlix: https://retroflix.org/bad-bill-bunion-1945/",
      "id": "bad-bill-bunion-1945"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": "6.9",
    "imdbVotes": "43",
    "Genre": "Animation, Short",
    "Plot": "ALTHOUGH THE VARIOUS cartoons and characters that came out of the cartoon of pioneer animator Paul Terry's Cartoon Studio were never seen as artistic as that of Walt Disney, nor as funny as Warner Brothers' output, they have been a TV favourite of the Baby Boomer generation for years. Somehow they had always managed to fill an intermediate niche and hence make their mark in the world.THERE IS A CERTAIN characteristic nonchalance about the stories that featured FARMER AL FALFA, DINKY DUCK, HECKLE &amp; JECKLE, THE TERRY BEARS and LITTLE ROQUEFORT. The humor was always basic, down to Earth and non-pretentious. These were elements commonly shared by all previously mentioned; but even more so were basic tenets of the MIGHTY MOUSE Series.REMEMBERED AS ONE of our favourite MM shorts was this 1945 entry, BAD BILL BUNION aka THE JAIL BREAK. Mr. Terry and company take many elements and successfully mix them, coming up with a satisfying and chuckle filled cartoon. Reality, represented in mention of the United States' Federal Prison at Alcatraz Island in San Francisco and the all important annual Army-Navy Football Game are blended side by side with the outrageous and the fantastic elements of the screen cartoon.SO IT IS that one \"Bad Bill\" Bunion, an outlaw in the tradition of \"the Old West\" finds himself as a 'guest' of Uncle Sam's on \"the Rock\"; as Alcatraz has been called. Among the other desperado inmates are the Frankenstein Monster and Dracula (himself)! Bunion, with aid of his channel-swimming equine accomplice, manages his escape.EMBARKING ON WHAT was truly a nationwide crime wave, \"Bad Bill\" manages to rob the now defunct Chicago Stock Yards of a steer and hold up a baby at gunpoint; relieving him of the contents of his piggy bank! His ultimate felonious misdeed is stealing the game-ball at the Army-Navy College Football Game! THIS, OF COURSE, is totally unacceptable to the American people and calls for the ultimate solution, Mighty Mouse! The rest of the under 8 minutes is occupied with MM's struggle to recapture the escaped felon (and his criminally predisposed horse)! THE ORIGIN OF the character Mighty Mouse was a predictable and inevitable outgrowth of the Golden Age of the Comic Book Super Heroes. Starting with Superman in Action Comics #1, dated June, 1938, what started as a trickle the proliferation of costumed and super-powered characters became a great and overpowering tidal wave of characters in titles from various publishers. Hence, Batman, The Flash, Wonder Woman, the Spirit, Plastic Man, Captain Marvel, Spy Smasher, the Human Torch, Sub-mariner, Captain America and hundreds of others became household words. Soon, Mighty Mouse joined the parade, albeit in a slightly different mode.ALTHOUGH THIS CARTOON is one of our best remembered example of the totality of the series, it is not typical in some respects.MOST MIGHTY MOUSE top shelf cartoons were done in a sort of Operetta-style; with MM, the hapless heroine, the villain and others doing their best imitations of Nelson Eddy &amp; Janette McDonald. Some good examples of this sub-genre are THE GYPSY LIFE and THE GIRL OF THEV GOLDEN WEST.THIS FORM WAS not applied to the production of BAD BILL BUNION.CHALK IT UP to the Star's desire to appear in a straight dramatic part.",
    "Director": "Mannie Davis",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0148588",
      "title": "Peace Time Football",
      "year": 1946,
      "imdbRating": "4.5",
      "imdbVotes": "16",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146300",
      "title": "The Talking Magpies",
      "year": 1946,
      "imdbRating": "6.1",
      "imdbVotes": "222",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148458",
      "title": "McDougal's Rest Farm",
      "year": 1947,
      "imdbRating": "5.9",
      "imdbVotes": "25",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148487",
      "title": "Aesop's Fable: The Mosquito",
      "year": 1945,
      "imdbRating": "4.7",
      "imdbVotes": "16",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149685",
      "title": "Ants in Your Pantry",
      "year": 1945,
      "imdbRating": "6.3",
      "imdbVotes": "27",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151562",
      "title": "Mighty Mouse and the Kilkenny Cats",
      "year": 1945,
      "imdbRating": "6.1",
      "imdbVotes": "39",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150625",
      "title": "The Fox and the Duck",
      "year": 1945,
      "imdbRating": "4.8",
      "imdbVotes": "19",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150532",
      "title": "Felix the Fox",
      "year": 1948,
      "imdbRating": "5.9",
      "imdbVotes": "15",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148184",
      "title": "Free Enterprise",
      "year": 1948,
      "imdbRating": "5.9",
      "imdbVotes": "26",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151443",
      "title": "The Magic Slipper",
      "year": 1948,
      "imdbRating": "6.5",
      "imdbVotes": "32",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152124",
      "title": "The Racket Buster",
      "year": 1948,
      "imdbRating": "6.4",
      "imdbVotes": "31",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146537",
      "title": "Carmen's Veranda",
      "year": 1944,
      "imdbRating": "7.3",
      "imdbVotes": "35",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T21:49:05.598Z"
}