{
  "movieId": "tt0149980",
  "title": "Bully Beef",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/bully-beef-1930",
      "id": "bully-beef-1930",
      "title": "Bully Beef (1930)",
      "description": "The story, such as it is, concerns a cat and mouse going off to War -- looking a lot like World War One, down to the artillery and tanks. It looks inspired, in a completely uninspired way, by WHAT PRICE GLORY. Watch on RetroFlix:  https://retroflix.org/bully-beef-1930/",
      "fileSize": 31727026,
      "addedAt": "2026-01-07T00:07:45.165Z",
      "thumbnail": "https://archive.org/services/img/bully-beef-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 48
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.3,
    "imdbVotes": 33,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. It is not just beef, or any kind of meat for that matter, that 'Bully Beef' (available on Youtube as of now, and not via the far more interesting French print with German subtitles and the silhouetted orchestra opening scene sadly) is lacking in. Nearly everything doesn't work, and not only is 'Bully Beef' the worst Terrytoons cartoon up to this point and one of the worst from 1930 it has to be down there among the worst Terrytoons overall (certainly of the early period).'Bully Beef's' best component is the music, which, despite not being the best recorded, is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Some synchronisation is neat and the ambulance/stretcher part is the most, and only, interesting one of the cartoon.Other than these elements, there is a lot wrong here in 'Bully Beef'. Can say nothing good about the animation, on top of the expectedly crude and simplistic character designs, that are too similar to each other, the backgrounds this time round are severely limited in scope and detail and there is a lot of repetition, giving the cartoon a lazy feel.Despite being a quite short cartoon, 'Bully Beef' also shows limitations in the amount and quality of the material. There is not enough to sustain the length and what there is is uninspired at best stuff with nothing funny or imaginative. There is not even enough to it to reach cutesy level, that's how bland it was. A couple of gags have no relevance and their only purpose it seemed was to pad out an already black ice-thin and practically non-existent story that was basically a series of very bland gags randomly organised. Even the characters exude little personality. To conclude, very little to recommend here. 3/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150161",
    "tt0150425",
    "tt0161623",
    "tt0145828",
    "tt0151158",
    "tt0151617",
    "tt0152308",
    "tt0161222",
    "tt0150028",
    "tt0150155",
    "tt0151114",
    "tt0151129"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.165Z"
}