{
  "movieId": "tt0149352",
  "title": "Welcome Little Stranger",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/welcome-little-stranger-1941",
      "id": "welcome-little-stranger-1941",
      "title": "Welcome Little Stranger (1941)",
      "description": "Welcome Little Stranger is a Terrytoons cartoon directed by Connie Rasinski. Watch on RetroFlix:  https://retroflix.org/welcome-little-stranger-1941/",
      "fileSize": 39070674,
      "addedAt": "2026-01-07T00:13:06.702Z",
      "thumbnail": "https://archive.org/services/img/welcome-little-stranger-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 57
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 5.4,
    "imdbVotes": 22,
    "Genre": "Animation, Short, Family",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1941, like all the other years for Terrytoons, saw a hit and miss batch, though more consistent than previous years. Of which 'Welcome Little Stranger' is one of the middling ones ranking it in correlation with the rest of the Terrytoons and one of the middling 1941 cartoons. It is an unexceptional, nothing exactly special cartoon and has the same amount of problems as it has the amount of strengths. 'Welcome Little Stranger' is watchable, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see, as is the comparatively improved fluidity of drawing and movement, and some synchronisation is neat. The colour is vibrant.Some mildly amusing moments, if not particularly imaginative, and there is some zest and natural charm, and parts of it and the basic set up are nicely done. Dinky is cute and relatable enough, if not always compelling, and the message is well intended.Occasionally though the visuals lack polish in drawing and some transitions. The conflict is bland and none of the other characters stand out.Likewise, the story is paper thin and formulaic with not an awful lot to it (like the cartoon in general), doing little new with a not so original premise. Gags aren't enough, and there is not much especially memorable about some. The cartoon tends to veer towards being too cute and sugary and a lot of it is pretty predictable, parts also being rather too sentimental. The taking-too-long-to-get-going beginning being one of the biggest examples of both.Overall, unexceptional but watchable enough. 5/10 Bethany Cox",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Donald McKee, Tom Morrison",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0148402",
    "tt0148503",
    "tt0148562",
    "tt0150658",
    "tt0148427",
    "tt0153977",
    "tt0151596",
    "tt0148876",
    "tt0149138",
    "tt0151823",
    "tt0149616",
    "tt0150825"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.702Z"
}