{
  "movieId": "tt0150130",
  "title": "Cinderella",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cinderella-1933",
      "id": "cinderella-1933",
      "title": "Cinderella (1933)",
      "description": "Cinderella is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/cinderella-1933/",
      "fileSize": 32462198,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/cinderella-1933",
      "language": "eng",
      "year": 1933,
      "collection": "feature_films",
      "downloads": 107
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 4.8,
    "imdbVotes": 20,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1933 was again a hit and miss year for Terrytoons. 'Cinderella' is still a watchable cartoon, but is neither among the best or the worst of that year's batch. Instead it is somewhere in the firm middle. 'Cinderella' is worth a one-time watch, mainly for Terrytoons completests, but there is not much special here.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. Some of the backgrounds are detailed and ambitious enough and it's a little more elaborate looking than the previous 1933 cartoons. Was pleasantly surprised by the character designs as well, usually crude and simplistic in Terrytoons cartoons but in this regard, 'Cinderella' is one of their more interesting and striking efforts. Synchronisation is pretty neat at places.'Cinderella' has some natural charm that is unforced and never feels too sugary despite relying on cuteness.However, the story is as basic and predictable as one can get with nothing to it. Sometimes it's dull in pace and the charm doesn't come consistently. The gags are not enough in terms of quantity and despite the odd surprising raciness of some of the content they're neither particularly funny or well-timed, some even a bit random. Regarding Cinderella herself, although interesting visually her personality is bland. The cartoon does feel like it needed a couple more minutes, which would have tightened the pace, made the story less erratic and made things more cohesive. Summing, worth watching once but not for repeat viewings. 5/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150804",
    "tt0149817",
    "tt0150382",
    "tt0150504",
    "tt0146721",
    "tt0150774",
    "tt0150820",
    "tt0151001",
    "tt0151046",
    "tt0151118",
    "tt0151217",
    "tt0151353"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.623Z"
}