{
  "movieId": "tt0137193",
  "title": "Riddle Ranch",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EwFBI1OD3hY",
      "id": "EwFBI1OD3hY",
      "title": "Riddle Ranch (1935) BLACK KING🍕 COWBOY WESTERN",
      "description": "Stars: Black King, David Worth, June Marlowe\nDirector: Charles Hutchison\n\nSaddle up for a thrilling ride in this rare 1935 Classic Western, featuring the magnificent stallion Black King in a starring role alongside David Worth and June Marlowe. Directed by action veteran Charles Hutchison and produced by Black King Productions, this vintage Western delivers high-stakes drama, frontier justice, and a race against time.\n\nWhen the devious Don Carlos rigs a horse race and wins big, his luck quickly turns when he gambles away the fortune. In a fit of rage, he murders a card dealer—framing innocent rancher Horton by using his gun. Wrongfully accused and unable to prove his innocence, Horton finds himself caught in a web of lies, betrayal, and desperation. Only the loyalty of his friends—and the courage of the legendary horse Black King—can help him clear his name.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPerfect for fans of Cowboy Westerns, 1930s Western films, and rare animal star performances, this gem captures the drama and tension of classic frontier storytelling. With strong performances from David Worth, June Marlowe, and the powerful presence of Black King, this tale of justice and redemption is brought to you by PizzaFLIX.\n\n#BlackKing #ClassicWesterns #CowboyMovies #DavidWorth #JuneMarlowe #CharlesHutchison #PizzaFLIX #VintageWestern #HorseWestern #1930sMovies #FramedForMurder #WesternJustice",
      "addedAt": "2025-12-24T01:03:40.484Z",
      "thumbnail": "https://i.ytimg.com/vi/EwFBI1OD3hY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB2Z3rC5OURW_9ZA9dLT0RrNRtSUQ",
      "duration": 3111,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "63 min",
    "imdbRating": 4.4,
    "imdbVotes": 25,
    "Genre": "Western",
    "Plot": "Don Carlos, Mexican renegade, wanted by his government for espionage, but who poses as a horse buyer,wants to buy \"Black King,\" Owner Jim Riddle refuses and Carlos is determined to get the horse by hook or crook. A race is arranged between a Carlos horse and \"Black King\", with the winning owner to take the other's horse. Carlos sends a henchie to fix \"Black King\" so that he goes lame and loses. Bob Horton, who loves Riddle's niece, Helen, rides the horse and is accused of pulling a double-cross. That night at Riddle's gambling house Carlos loses, and shoots a gambler with Bob's gun.Bob is accused and escapes to Mexico. Exhausted, he finds a water hole and, while drinking (and surprised to find that it isn't poisoned, considering the kind of day he has had) ol' \"Black King\" (the Horse With a Human Brain) limps up. He has been freed by Betty, Helen's six-year-old sister. Bob discovers the wire that had been twisted into the horses' leg by the henchman. Bob and the horse elude the posse and meet up with Carlos. Carlos wounds Bob, whose day gets worse as the movie moves along,but \"Black King\" knocks down Carlos and is about to trample him when the sheriff arrives, arrests Carlos and frees Bob, whose innocence has been established.",
    "Director": "Charles Hutchison",
    "Writer": "L.V. Jefferson, E.J. Thornton",
    "Actors": "Black King, David Worth, June Marlowe",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0028098",
    "tt0165402",
    "tt0027087",
    "tt0026052",
    "tt0026081",
    "tt0024883",
    "tt0026112",
    "tt0026114",
    "tt0026130",
    "tt0026133",
    "tt0026157",
    "tt0026244"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:33:49.582Z"
}