{
  "imdbId": "tt0148588",
  "title": "Peace Time Football",
  "year": 1946,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/peace-time-football-1946",
      "title": "Peace Time Football (1946)",
      "description": "Peace Time Football is a Terrytoons cartoon directed by Mannie Davis. Watch on RetroFlix:  https://retroflix.org/peace-time-football-1946/",
      "fileSize": 38517683,
      "id": "peace-time-football-1946"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.5,
    "imdbVotes": 16,
    "Genre": "Animation, Short",
    "Plot": "Will admit to not being a fan of Gandy Goose as a solo character, or at least in his early solo outings, his personality didn't appeal to me and it wasn't really much of one. Luckily in the early 40s he did advance as a character and became more appealing when partnered with Sourpuss in one of Terrytoons' generally better-faring, though it was by no means consistent, theatrical series. That was a series that on paper shouldn't have worked, very like their pairing, but it on the whole did.1946's 'Peace-Time Football' was not just a step backwards for Gandy in my view, it also saw Terrytoons going backwards. Although there were misfires along the way, generally the studio had come on leaps and bound at this point while only reaching very good a few times (the last one being 1946's 'The Talking Magpies'). With 'Peace-Time Football', it was like the improvement of Gandy's character and how far Terrytoons had progressed since first starting had not really happened, or had only marginally improved, which is quite infuriating.'Peace-Time Football' does have strengths, although the shortcomings outweigh them. hat the animation fares very well here was not a surprise as this aspect had come on enormously by this point with Terrytoons. It is nicely detailed, lively and colourful without being garish, particularly in some imaginative visuals in the dream sequence. Again, the music, the thing that was the most consistently good thing from the very beginning with Terrytoons, is a big strength. It is beautifully and cleverly orchestrated and arranged, is terrific fun to listen to and the lively energy is present throughout, doing so well with adding to the action.Those are the two main redeeming merits, but there are also sporadic mildly amusing moments and the cartoon does start off fairly promisingly.Sadly that promise doesn't stay for long, with 'Peace-Time Football' basically running out of puff far too early and recovery never happens. The story is very little, if any, different to other sport-oriented Terrytoons cartoons, and actually even animation in general, done with a lot of predictability throughout and nothing feels imaginative or like much, again if any, original thought went into it. There is hardly any excitement or urgency, so it doesn't really capture the spirit of the game, the pace never really ignites fire after the promising start and it really did feel like Terrytoons had run out of ideas and were recycling old ones.Hardly anything is amusing let alone funny, and that the gags are nowhere near enough in the first place doesn't really help. What there are have a real staleness to them and like they were lifted out of elsewhere. Gandy is neither interesting or appealing, this is closest to bland late-30s Gandy (and 'Peace-Time Football' in fact in general felt like it was another solo Gandy cartoon from the late-30s) than the much better characterised Gandy when paired with Sourpuss, so close in fact that one would be forgiven if they hadn't remembered that Gandy actually had advanced as a character or that they didn't realise that the cartoon wasn't from 1946. None of the other characters are particularly compelling either and because of not enough variation in the personalities nobody stands out either.In conclusion, well made and scored but rather dull, lazy and with a feeling of being ten years out of date. 4/10",
    "Director": "Mannie Davis",
    "Writer": "John Foster",
    "Actors": "Dayton Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0146300",
      "title": "The Talking Magpies",
      "year": 1946,
      "imdbRating": 6.1,
      "imdbVotes": 222,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149769",
      "title": "Bad Bill Bunion",
      "year": 1945,
      "imdbRating": 6.9,
      "imdbVotes": 43,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148458",
      "title": "McDougal's Rest Farm",
      "year": 1947,
      "imdbRating": 5.9,
      "imdbVotes": 25,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150532",
      "title": "Felix the Fox",
      "year": 1948,
      "imdbRating": 5.9,
      "imdbVotes": 15,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148184",
      "title": "Free Enterprise",
      "year": 1948,
      "imdbRating": 5.9,
      "imdbVotes": 26,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151443",
      "title": "The Magic Slipper",
      "year": 1948,
      "imdbRating": 6.5,
      "imdbVotes": 32,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0152124",
      "title": "The Racket Buster",
      "year": 1948,
      "imdbRating": 6.4,
      "imdbVotes": 31,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147628",
      "title": "Mighty Mouse in the Trojan Horse",
      "year": 1946,
      "imdbRating": 6.6,
      "imdbVotes": 53,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150450",
      "title": "The Electronic Mouse Trap",
      "year": 1946,
      "imdbRating": 6.2,
      "imdbVotes": 26,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148218",
      "title": "The Golden Hen",
      "year": 1946,
      "imdbRating": 5,
      "imdbVotes": 15,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150889",
      "title": "The Hep Cat",
      "year": 1946,
      "imdbRating": 6,
      "imdbVotes": 43,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150976",
      "title": "The Housing Problem",
      "year": 1946,
      "imdbRating": 6.2,
      "imdbVotes": 15,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.697Z"
}