{
  "movieId": "tt0151315",
  "title": "Lazy Little Beaver",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/lazy-little-beaver-1947",
      "id": "lazy-little-beaver-1947",
      "title": "Lazy Little Beaver (1947)",
      "description": "A young beaver who has run away from home learns a lesson about work and slothfulness when he attracts a wolf who wants to turn him into a fur coat. Watch on RetroFlix:  https://retroflix.org/lazy-little-beaver-1947/",
      "fileSize": 38004888,
      "addedAt": "2026-01-07T00:09:38.888Z",
      "thumbnail": "https://archive.org/services/img/lazy-little-beaver-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 48
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 7.4,
    "imdbVotes": 39,
    "Genre": "Animation, Short",
    "Plot": "1947 was a mixed year for the Mighty Mouse theatrical series, not surprising as every year for the series was up and down. Other years before and since 1947 had a wider divide between the best cartoons and the worst for the series and for Terrytoons overall. A couple of the Mighty Mouse cartoons from this year were decent, with the best by far being 'A Fight to the Finish' and 'Aladdin's Lamp' being a close second, but 'A Date for Dinner' and 'Swiss Cheese Family Robinson' were mediocre.'Lazy Little Beaver' is neither one of his best or worst from 1947. If anything, it's somewhere in the middle, leaning towards the lower end. It is also neither one of the best ('Happy Go Lucky', 'The Intruders', 'The Super Salesman') or worst 'A Date for Dinner', 'One Note Tony', 'Swiss Cheese Family Robinson') Terrytoons cartoons from the year. Put it somewhere in the middle in this regard as well. 'Lazy Little Beaver' is a watchable effort where the second half is better than the first, but it is far from a great one.There are good things here, at this point of Terrytoons' output there was yet to be a cartoon of theirs without redeeming qualities despite a small handful of their previous cartoons still being pretty terrible. The best assets, as is the case for a vast majority of the series, being the animation and the music. The animation is colourful and neat and it is great that the backgrounds increasingly became more ambitious and more detailed. Even better is the music. Lush, full of energy and so infectious and cleverly constructed.As said the second half is better than the first, being actually pretty good. 'Lazy Little Beaver' does come to life and become more energised and with believable conflict once the wolf appears. The wolf is the best character here, being both sinister and fun and continuing the common trend of the villain stealing the show in Mighty Mouse's cartoons. There are amusing moments in the second half, especially in the conflict between Mighty Mouse (limited but amusing and heroic here) and the wolf which is not as repetitive luckily than most of Mighty Mouse's conflicts.Was rather mixed on the narration however. Did like the storybook-like approach of the dialogue and delivery and it is voiced beautifully, but it tends to over-explain what's going on and intrude too much.For all the good things, there is some bad. The first half is rather slow and takes too long to set up the story, in a story where it only shows signs of a plot when the conflict between Junior and the wolf happens. Also found the middle too sugary and over-sentimental and that the cartoon tried too hard to making one feel sympathy for Junior when to me to begin with he was quite annoying. Did appreciate though that he progressed as a character.Moreover, on the most part 'Lazy Little Beaver' is pretty low on gags and there is nothing that hilarious or inspired. Actually found the first half pretty bland in terms of the writing.Summing up, watchable but pretty average. 5/10.",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "Dayton Allen, Tom Morrison",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150275",
    "tt0148339",
    "tt0149212",
    "tt0150974",
    "tt0148443",
    "tt0150215",
    "tt0148633",
    "tt0153299",
    "tt0148143",
    "tt0151663",
    "tt0152597",
    "tt0150072"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.888Z"
}