{
  "imdbId": "tt0150837",
  "title": "The Hard Boiled Egg",
  "year": 1948,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-hard-boiled-egg-1948",
      "id": "the-hard-boiled-egg-1948",
      "title": "The Hard Boiled Egg (1948)",
      "description": "The Hard Boiled Egg is a Terrytoons cartoon directed by Connie Rasinski. Watch on RetroFlix:  https://retroflix.org/the-hard-boiled-egg-1948/",
      "fileSize": 38941429,
      "addedAt": "2026-01-07T00:12:10.587Z",
      "thumbnail": "https://archive.org/services/img/the-hard-boiled-egg-1948",
      "language": "eng",
      "year": 1948,
      "collection": "feature_films",
      "downloads": 88
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.6,
    "imdbVotes": 14,
    "Genre": "Animation, Short",
    "Plot": "1948's 'The Hard Boiled Egg' is interesting for being the first cartoon to star the too short lived character of Dingbat. Who starred/featured in five cartoons over five years and then became practically obscure. A real shame as Dingbat did deserve a lot better than that, and was actually in my view not a bad character at all (the opposite). Am guessing that the reason why the character and the series didn't last longer because of them having a style of humour that was very popular and high in competition at the time, so they fell underneath the radar.Of the five (the others being 'Dingbat Land', 'Foiling the Fox', 'All This and Rabbit Stew' and 'Sour Grapes'), 'The Hard Boiled Egg' is one of the better ones and one of the very good ones. Also feel that it is one of the best 1948 Terrytoons cartoons to not star Mighty Mouse and Heckle and Jeckle, the two theatrical series that made most of that year's batch up. It is a shame that it didn't make enough of a splash and that it isn't better known because it showed off Dingbat's great potential.'The Hard Boiled Egg' has very little wrong with it. The blackface gag does stick out like a sore thumb and is rather out of place.Some may find that Dingbat's laugh is a bit grating.However, 'The Hard Boiled Egg' works very well to brilliantly everywhere else. The music is fantastic and as ever with Terrytoons the best thing about 'The Hard Boiled Egg'. It is beautifully and cleverly orchestrated and arranged, is terrific fun to listen to and the lively energy is present throughout, doing so well with adding to the action. Close behind was the animation, as said more than once this component has come on considerably since the Terrytoons Studios cartoons first started. Overall, it is nicely detailed, lively and colourful, with nice attention to detail and vibrant colours that don't look garish.Moreover, when it comes to the humour 'The Hard Boiled Egg' to me is easily one of the funniest that year. There are plenty of gags and all of them hit, the best are hilarious and Sylvester's encounters at the beginning have enough variety to avoid them from being repetitive. Absolutely love Dingbat's wonderfully crazy screwball humour and quick wit and his clever tricks and bombast are a riot to watch. The story is not earth shattering but is full of energy, right from the promising beginning all the way up to the riotous ending.While Dingbat makes a big impression here, Sylvester the fox is every bit his equal with great comic timing and a crafty demeanour. Their conflict is enormous fun to watch, two characters trying to outsmart each other is an age old type of conflict but it feels fresh here in 'The Hard Boiled Egg', thanks to the fast and furious pacing, as does Dingbat's style of humour which was actually unlike any other Terrytoons character at the time.On the whole, very good indeed and deserving of more credit. 8/10.",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0153913",
    "tt0153316",
    "tt0151560",
    "tt0151880",
    "tt0149591",
    "tt0149829",
    "tt0151632",
    "tt0148178",
    "tt0151145",
    "tt0148929",
    "tt0148223",
    "tt0148568"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.587Z"
}