{
  "imdbId": "tt0146978",
  "title": "The Last Mail",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-last-mail-1933",
      "title": "The Last Mail (1933)",
      "description": "Cubby the Bear has to deliver the mail through snow and also save his girl from a evil raccoon. Watch on RetroFlix:  https://retroflix.org/the-last-mail-1933/",
      "fileSize": 164192961,
      "id": "the-last-mail-1933"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 4.6,
    "imdbVotes": 29,
    "Genre": "Animation, Short, Family",
    "Plot": "Van Bueren Studios' Cubby the Bear series comprised of just 17 cartoons made between 1933-1934. As much as it pains me to say it, speaking as a big animation fan, it is not hard to see why the character and the series weren't so popular and didn't last long.'The Last Mail' is not a great cartoon, far from it, and has its fair share of faults that mostly apply to pretty much all of the Cubby the Bear cartoons. It is however one of Cubby's best, decide for yourself as to whether that is saying much. To me, despite still not rating it particularly highly, it is, being one of not many to be above mediocre. And also his more entertaining, again saying a fair bit, because there is nothing hilarious there are a few wry smile moments that most of his cartoons do not achieve and it is at times cute without being too saccharine.Almost all of Cubby's cartoons are plot-less, or near to it, and most also don't really go anywhere. While it is very formulaic and slight, with the rescue-oriented elements being very derivative, there is more of a story here in 'The Last Mail' than most Cubby cartoons and a livelier pace that actually does go somewhere. The racoon is a fun villainous character and the only one to have any real personality.Best thing about 'The Last Mail' though is the music score. It is so beautifully and cleverly orchestrated and full of lively energy that is sorely lacking elsewhere, doing so well with enhancing the action. Loved how \"Pop Goes the Weasel\" and \"Stars and Stripes Forever\" were arranged and utilised.However, the animation is really not good even for a cartoon not made on a high budget, and it is true for the Cubby the Bear series and Van Bueren in general on the whole. It's static in movement, simplistic in background detail and sloppy in drawing, with the character expressions being pretty expressionless.Just as problematic, and even more majorly, is Cubby himself, on top of being poorly animated he is one of the blandest and most personality-deprived characters ever to exist. Credit is due making him more heroic than usual (though it is a stock role that any character in all honesty could fill, for example it's a tailor-made role for Mickey Mouse who also happened to do it much better) and giving him a motivation, that doesn't stop us from understanding why the character and his series was so short-lived. Honey is not much better, think the love interests for similar early male characters from Disney and Looney Tunes except much blander and with significantly less charm or personality and you have Honey.'The Last Mail' is only really mildly amusing and the story, while better than that for most Cubby cartoons, is nothing special.Overall, not great but watchable which is something reasonably special for a Cubby cartoon. 5/10 Bethany Cox",
    "Director": "Mannie Davis",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0146464",
      "title": "Barking Dogs",
      "year": 1933,
      "imdbRating": 4.9,
      "imdbVotes": 27,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0161331",
      "title": "Bubbles and Troubles",
      "year": 1933,
      "imdbRating": 4.6,
      "imdbVotes": 23,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0146938",
      "title": "Indian Whoopee",
      "year": 1933,
      "imdbRating": 4.9,
      "imdbVotes": 36,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147123",
      "title": "Opening Night",
      "year": 1933,
      "imdbRating": 5.1,
      "imdbVotes": 126,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0150452",
      "title": "The Elephant Mouse",
      "year": 1951,
      "imdbRating": 4.6,
      "imdbVotes": 11,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0147102",
      "title": "The Nut Factory",
      "year": 1933,
      "imdbRating": 5.1,
      "imdbVotes": 26,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0149383",
      "title": "Wise Quacks",
      "year": 1953,
      "imdbRating": 5.3,
      "imdbVotes": 8,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0023889",
      "title": "Christmas Night",
      "year": 1933,
      "imdbRating": 5.5,
      "imdbVotes": 210,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024089",
      "title": "Happy Hoboes",
      "year": 1933,
      "imdbRating": 5.8,
      "imdbVotes": 49,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148319",
      "title": "Hula Hula Land",
      "year": 1949,
      "imdbRating": 5.8,
      "imdbVotes": 28,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0151050",
      "title": "In the Park",
      "year": 1933,
      "imdbRating": 4.6,
      "imdbVotes": 24,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0148378",
      "title": "King Tut's Tomb",
      "year": 1950,
      "imdbRating": 5.7,
      "imdbVotes": 32,
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.590Z"
}