{
  "imdbId": "tt0163354",
  "title": "Roger Corman: Hollywood's Wild Angel",
  "year": 1978,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WK6HUh7FBUk",
      "id": "WK6HUh7FBUk",
      "title": "Roger Corman | War of the Satellites 1958 (Thriller, Sci-Fi) Colorized Movie",
      "description": "Extraterrestrials manipulate a human scientist to sabotage U.S. space exploration, while an \"unknown force\" declares war on Earth after the United Nations defies warnings to halt its attempts to launch the first satellite into space.\n\nOriginal title: War of the Satellites (1958)\n\nBlack & White version: https://youtu.be/zvJAHgjHAqs\n\n\nDirector: Roger Corman\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYLD4ZQC1D1o3WC_ePvnOng\nWriters: Irving Block, Lawrence L. Goldman\nStars: Dick Miller, Susan Cabot, Richard Devon \nGenre:  Colorized classics, Cult Film, Horror, Thriller, Sci-Fi, Adventure \nBudget: $70,000 \n\n\n00:00 Full Movie\n01:39 Intergalactic conflict unfolds as scientists battle satellite threat.\n07:23 Alien message disrupts Earth's space program, leading to a volunteer mission to investigate.\n10:35 Interstellar mission faces unexpected challenges and political intrigue.\n17:24 Alien invasion threat leads to urgent decision-making and potential sacrifice.\n20:48 Intense debate at a crucial meeting regarding Project Sigma, with a focus on survival and resistance against alien control.\n24:05 Space mission faces urgent challenges and personnel conflicts.\n31:26 Intense space mission faces sabotage, AI threat, and ethical dilemma.\n41:26 Space mission faces unexpected challenges, leading to a tragic loss and suspicion among crew members.\n44:56 Space mission faces identity crisis as crew suspects alien infiltration.\n52:25 Intriguing sci-fi thriller involving a space mission, a mysterious threat, and a dramatic escape.\n59:36 Space mission to stop satellite explosion and protect Earth.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdab9LsjsyqpseqaKefjzFvQ",
      "addedAt": "2025-12-27T00:39:08.864Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/WK6HUh7FBUk/maxresdefault.webp?v=65af6bf7",
      "duration": 3926,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "57 min",
    "imdbRating": 6.7,
    "imdbVotes": 69,
    "Genre": "Documentary, Biography",
    "Plot": "Known as \"The B-Movie King\", Roger Corman's filmography has paved ways for genre films, igniting the screen with his rambunctious exploitation cinema. This portrait, made by Christain Blackwood who at the time was an aspiring filmmaker himself, takes a closer look at Corman's plentiful career. Corman's early casts and crews were oftentimes bursting with young talent such as Martin Scorsese, Jonathan Demme and David Carradine. His horror-comedy hits were made in such fast succession that the opportunities for emerging directors were countless and though the pay was low many of them feel they were very much compensated in experience and recognition. Through his low production budgets and high box office revenues, Corman built a B-movie empire that continues to thrill, inspire and endlessly entertain.",
    "Director": "Christian Blackwood",
    "Writer": "Richard Koszarski, Elliott Stein",
    "Actors": "Allan Arkush, Paul Bartel, David Carradine",
    "Language": "English",
    "Country": "United Kingdom, United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt0079704",
    "tt0186483",
    "tt0310597",
    "tt1475191",
    "tt1002443",
    "tt0247304",
    "tt3123418",
    "tt7188868",
    "tt9316022",
    "tt0066759",
    "tt0499562",
    "tt0311432"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:38:49.814Z"
}