{
  "movieId": "tt0180721",
  "title": "Guacho",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/guacho-1954",
      "id": "guacho-1954",
      "title": "Guacho (1954)",
      "description": "Guacho  es una  película   argentina  de 1954, dirigida por  Lucas Demare , protagonizada por Tita Merello y Carlos Cores.  Guacho  procede del quechua cuzqueño wakcha que significa pobre, huérfano. Estrenada en Buenos Aires el 7 de julio de 1954. Obtuvo cinco premios, entre ellos los de mejor director del año, de la  Asociación de Cronistas de Cine , y el de mejor película del año de la Academia de Artes y Ciencias Cinematográficas, en 1955. Los exteriores de la película fueron filmada en  Puerto Montt , en el sur de  Chile . También se la conoce como  El castigo de los mares del sur . (Wikipedia) Sinopsis Una mujer ( Tita Merello ), casada con un marinero (Carlos Cores), debe criar a su propio hijo y también al que su marido tuvo antes con otra mujer. Ambos niños van creciendo diferentes: débil el que tuvieron juntos, fuerte el que tuvo con la otra mujer. La mujer entonces se ve inclinada a adjudicarse la maternidad de niño fuerte, cambiando las identidades de ambos. Pero sucede que su propio hijo biológico, a quien ella presentaba como de \"la otra\", muere en un naufragio. La culpa de la madre, la lleva entonces al suicidio Reparto Tita Merello Carlos Cores Julia Sandoval Enrique Chaico Margarita Corona Luis Medina Castro Néstor Deval Alberto Barcel Alejandro Rey Félix Rivero Antonia Volpe Orestes Soriani Carmen Giménez Aída Villadeamigo Francisco Audenino Mecha Corbo María Ferez Domingo Garibotto Ricardo Carenzo Juan Villarreal Elvira Quiroga",
      "fileSize": 1284932341,
      "addedAt": "2026-01-07T00:08:39.343Z",
      "thumbnail": "https://archive.org/services/img/guacho-1954",
      "language": "spa",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 75
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "97 min",
    "imdbRating": 7.7,
    "imdbVotes": 12,
    "Genre": "Drama",
    "Plot": "Out of fear of her husband abandoning her, the protagonist changes two children's identities: one is their biological son with a debilitating affliction, and the other is the son of her husband and his ex-lover.",
    "Director": "Lucas Demare",
    "Writer": "Lucas Demare, Concha Espina, Sergio Leonardo",
    "Actors": "Tita Merello, Carlos Cores, Julia Sandoval",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "3 wins & 1 nomination"
  },
  "relatedMovies": [
    "tt0048370",
    "tt0043679",
    "tt0186026",
    "tt0032787",
    "tt0186329",
    "tt0186516",
    "tt0178536",
    "tt0155751",
    "tt0185971",
    "tt0186182",
    "tt0186404",
    "tt0037320"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.343Z"
}