{
  "movieId": "tt0153214",
  "title": "A Tough Egg",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-tough-egg-1936",
      "id": "a-tough-egg-1936",
      "title": "A Tough Egg (1936)",
      "description": "A Tough Egg is a Terrytoons cartoon directed by Mannie Davis, George Gordon,  Paul Terry. Watch on RetroFlix:  https://retroflix.org/a-tough-egg-1936/",
      "fileSize": 30439226,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-tough-egg-1936",
      "language": "eng",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 47
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.6,
    "imdbVotes": 15,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1936, like all the other years for Terrytoons, saw a hit and miss batch, more so than the other years even. Of which 'A Tough Egg' is one of the middling ones ranking it in correlation with the rest of the Terrytoons and one of the middling 1936 cartoons. It is an unexceptional, nothing exactly special cartoon and has the same amount of problems as it has the amount of strengths. 'A Tough Egg' is also watchable, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see, as is the comparatively improved fluidity of drawing and movement, and some synchronisation is neat.A few amusing moments, some imaginative and there is some zest and natural charm, and parts of it and the basic set up are affecting. There is a fun antagonist, showing the most personality of the characters even if a fairly typical Terrytoons antagonist.Outside of the backgrounds and more fluidity than seen previously however, the animation is primitive and crude sometimes.Likewise, the story is paper thin and formulaic with not an awful lot to it (like the cartoon in general), once again with nothing new to a melodramatic and old premise. Gags aren't enough, they are not always very organised (fairly scattershot), and there is not much especially memorable about some and some don't serve much point. The cartoon tends to veer towards being too cute and a lot of it is pretty predictable. Some choppiness too and the cartoon feels very old fashioned with not all the characters being particularly memorable.Overall, watchable if unexceptional. 5/10 Bethany Cox",
    "Director": "Mannie Davis, George Gordon, Paul Terry",
    "Writer": "Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0153715",
    "tt0149808",
    "tt0149981",
    "tt0153627",
    "tt0162048",
    "tt0149634",
    "tt0149712",
    "tt0149796",
    "tt0150074",
    "tt0150514",
    "tt0150517",
    "tt0150914"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}