{
  "movieId": "tt0153345",
  "title": "Twelve O'Clock and All Ain't Well",
  "year": 1941,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/twelve-o-clock-and-all-aint-well-1941",
      "id": "twelve-o-clock-and-all-aint-well-1941",
      "title": "Twelve O'Clock and All Ain't Well (1941)",
      "description": "Twelve O'Clock and All Ain't Well is a Terrytoons cartoon directed by Eddie Donnelly. Watch on RetroFlix:  https://retroflix.org/twelve-oclock-and-all-aint-well-1941/",
      "fileSize": 36905460,
      "addedAt": "2026-01-07T00:12:55.130Z",
      "thumbnail": "https://archive.org/services/img/twelve-o-clock-and-all-aint-well-1941",
      "language": "eng",
      "year": 1941,
      "collection": "feature_films",
      "downloads": 52
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.2,
    "imdbVotes": 11,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1941, like all the other years for Terrytoons, saw a hit and miss batch. Of which 'Twelve O Clock and All Ain't Well' is one of the high middle ones ranking it in correlation with the rest of the Terrytoons and one of the better 1941 cartoons. It is a decent if unexceptional cartoon with a lot of strengths and some problems as well. 'Twelve O Clock and All Ain't Well' is also worth the look, completest sake is the main reason to see it but it's not the only reason.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds is still great to see, as is the comparatively improved fluidity of drawing and movement, and some synchronisation in movement and sound is neat.A number of well timed and amusing moments, some imaginative and there is some zest and natural charm, and parts of it and the basic set up are nicely done. The characters are fun, the dog and the cat are both cute and funny and the mice thankfully are not bland, mice characters tend to be in Terrytoons cartoons.A few of the transitions are not always polished on the other hand.Likewise, the story is paper thin and formulaic with not an awful lot to it (like the cartoon in general). In terms of gags, a few lack freshness and wit to work properly. Due to it being somewhat of a familiar premise for Terrytoons, and a fairly old one in animation in general, a lot of it is pretty predictable.Summing up, above average and not bad at all, though also not great. 6/10 Bethany Cox",
    "Director": "Eddie Donnelly",
    "Writer": "John Foster, Isadore Klein, Tom Morrison",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150362",
    "tt0149765",
    "tt0146905",
    "tt0151020",
    "tt0149801",
    "tt0159281",
    "tt0150361",
    "tt0150841",
    "tt0152301",
    "tt0161998",
    "tt0152601",
    "tt0152406"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.130Z"
}