{
  "imdbId": "tt0152221",
  "title": "Roman Punch",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/roman-punch-1930",
      "id": "roman-punch-1930",
      "title": "Roman Punch (1930)",
      "description": "Roman Punch is a Terrytoons cartoon directed by Frank Moser. Watch on RetroFlix:  https://retroflix.org/roman-punch-1930/",
      "fileSize": 30076357,
      "addedAt": "2026-01-07T00:10:40.949Z",
      "thumbnail": "https://archive.org/services/img/roman-punch-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 56
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "5 min",
    "imdbRating": 3.8,
    "imdbVotes": 21,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. Of their offerings up to this point of this very early stages, 'Roman Punch' is the weakest. Not awful, but it really does fail agreed to pack punch. While one never expects much exceptional with the early Terrytoons, and generally even (the only component to consistently be so is the music), 'Roman Punch' is the first less than watchable one and one of the most lacklustre of the 1930 offerings. 'Roman Punch's best asset, always the case with Terrytoons, is the music which predictably is outstanding. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The backgrounds for 1930 are remarkably detailed and there is some nice inventive visual detail, showing a studio that were aiming for ambition and succeeding in some aspects. Some synchronisation is neat.However, like the previous cartoons and much of the ones since, the character designs are crude and don't match the amount of detail that went everywhere else in the animation.Furthermore, the story is paper thin and thoroughly predictable, and doesn't have the natural charm or lively pacing (erratic here) to make up for it. Nor any good gags, which are too few and are far too random and short to make much impression. The characters are bland this time round.In conclusion, bland and lacklustre. 4/10 Bethany Cox",
    "Director": "Frank Moser",
    "Writer": "Paul Terry",
    "Actors": "Philip A. Scheib",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0151054",
    "tt0152064",
    "tt0152549",
    "tt0149980",
    "tt0150161",
    "tt0150425",
    "tt0161623",
    "tt0145828",
    "tt0151158",
    "tt0151617",
    "tt0161916",
    "tt0152308"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:40.949Z"
}