{
  "imdbId": "tt0147274",
  "title": "A Romeo Robin",
  "year": 1930,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a-romeo-robin-1930",
      "id": "a-romeo-robin-1930",
      "title": "A Romeo Robin (1930)",
      "description": "A Romeo Robin is an Aesop Fables cartoon directed by Mannie Davis, John Foster. Watch on RetroFlix:  https://retroflix.org/a-romeo-robin-1930/",
      "fileSize": 108128068,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a-romeo-robin-1930",
      "language": "eng",
      "year": 1930,
      "collection": "feature_films",
      "downloads": 43
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "8 min",
    "imdbRating": 4.9,
    "imdbVotes": 47,
    "Genre": "Animation, Short",
    "Plot": "Van Beuren cartoons are extremely variable, especially in the number of gags and whether the absurdist humour shines through enough (sometimes it does, other times it doesn't), but are strangely interesting. Although they are often poorly animated with barely existent stories and less than compelling lead characters, they are also often outstandingly scored, there can be some fun support characters and some are well-timed and amusing.'A Romeo Robin' is among neither of the best Aesop's Fables/Van Beuren cartoons or the worst, though when it first started first impressions were that it would be among the latter. Instead it's somewhere in the lower middle, mildly watchable and far from terrible, being elevated to something a little better by the second half, but rather bland and uneven. Like most cartoons in the series, the animation is really not great. It's even not good, the worst of it downright bad with erratically sloppy character designs in particular while the simplistic background detail and lack of fluidity and crispness are just as difficult to ignore.The first half does not give a good first impression, with all the flaws mentioned a lot by me in my previous reviews for the previous cartoons in the series apparent. On top of being poorly animated with bland characters, there was a serious lack of energy, next to no gags (any that were noticeably amusing or memorable anyhow) and it was just aimless and random. Only the music worked. Fortunately for 'A Romeo Robin' things do pick up in the second half, where the energy becomes more lively, a couple of moments amuse and make one go aw and there is more of a story that, even though basic and formulaic as heck, at least made more sense. Sadly, the animation is still not good and the characters never properly engage. The cartoon also feels disjointed, a case of two halves that feel completely far removed from each other that there are two 3-4 minute cartoons in one.It is good though that throughout the synchronisation is not too bad.Best of all, and the only outstanding asset, is the music score, it is typically peppy and great fun to listen to. It is so beautifully and cleverly orchestrated and full of lively energy, doing so well with enhancing the action. On the whole, mildly watchable but bland, uneven and a very disconcertingly strange case of two wildly different halves. 4/10 Bethany Cox",
    "Director": "Mannie Davis, John Foster",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0146845",
    "tt0161750",
    "tt0161805",
    "tt0147096",
    "tt0147506",
    "tt0147620",
    "tt0146582",
    "tt0146719",
    "tt0161433",
    "tt0147534",
    "tt0021722",
    "tt0147017"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}