{
  "imdbId": "tt0191402",
  "title": "La revolución de Mayo",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-revolucion-de-mayo-1909",
      "title": "La Revolucion De Mayo(1909)",
      "description": "La Revolución de Mayo   es una película de   Argentina   sin sonido y en blanco y negro, dirigida por   Mario Gallo   sobre su propio guion que se estrenó el 22 de mayo de 1909 en el teatro Ateneo de la esquina de Corrientes y Maipú y que tuvo como protagonistas. a actores profesionales entre los que se encontraba   Eliseo Gutiérrez . La película se refiere a los acontecimientos sucedidos en   Buenos Aires   en mayo de 1810 conocidos como la   Revolución de Mayo , si bien contiene fallas e inexactitudes como la presencia de   San Martín , una licencia artística del director o la visión en el extremo derecho del cuadro de la persona que sostiene el telón. (Wikipedia) Sinopsis Dirigido por Mario Gallo, está considerado la primera película de ficción argentina realizada con actores profesionales. Representa los acontecimientos de la Revolución de Mayo de 1810, cuyo centenario estaba por cumplirse. La película fue restaurada cien años más tarde con motivo del bicentenario. (FILMAFFINIDAD) Produccion  El director Mario Gallo, un italiano que había llegado a la Argentina en 1905, comenzó a filmar en 1909 y realizó la primera película con argumento de Argentina si bien las opiniones de los estudiosos no son coincidentes en cuanto a su orden temporal. La versión tradicional de  Pablo C. Ducros Hicken   investigador e historiador especializado en cine, la prioridad fue de   El fusilamiento de Dorrego   estrenado el 24 de mayo de 1908. Otros investigadores fechan su rodaje dos años después, lo que significaría que la primera película sería   La Revolución de Mayo   de 1909 Valoracion Algunos estudiosos ven en la obra fílmica de Gallo la influencia de la corriente del Film d'Árt, que desde 1908 intentaba en Francia la primera aproximación al cine como arte, para alejarlo del mero espectáculo de feria, y que tuvo su primera expresión en  El asesinato del Duque de Guisa , filme que tuvo además la particularidad de ser el primero en contar con música original, expresamente solicitada por su director el francés André Calmettes , compuesta por el septuagenario Camille Saint-Saëns para ser ejecutada en vivo durante la proyección.       En La Revolución de Mayo se puede apreciar que su lenguaje está emparentado con el del cine francés de su tiempo: la acción es eminentemente teatral, los decorados pintados en telones (el Cabildo flamea al soplar el viento), la cámara toma el lugar de un espectador y la narrativa queda a carga de las placas con leyendas, funcionando la imagen a la manera de la ilustración de un texto.     Restauracion del filme Fotograma restaurado de La revolución de mayo   Originalmente la copia conservada por la Cinemateca Argentina estaba rodada en soporte nitrato de 35 mm, y por ende altamente inflamable y fue transferida en 1955 a un soporte 16 mm. En la empresa Cinecolor Argentina se reparó básicamente la copia para permitir su escaneado, que luego fue restaurado digitalmente por el Equipo de Restauración y Retoque Digital integrado por Milagros Cimadevilla , Juan Ignacio Bousquet Archivado el 17 de agosto de 2021 en Wayback Machine . y María Victoria Mateu, quienes estabilizaron la imagen, arreglaron los cuadros dañados, limpiaron defectos y eliminaron el flickeo. Más adelante se restauraron y rearmaron las placas usando como base los originales para reemplazar las letras dañadas o inexistentes, se dosificó imagen para emparejar las diferencias de luminancia y contrastes de los distintos planos del cortometraje, y se imprimieron 2 negativos, uno para que pueda ser proyectado en una sala comercial y otro que respeta el formato original de captura, esto quiere decir 35mm con la imagen en el total de la película, de perforación a perforación, en formato 1.37:1 así respetando el nitrato original capturado por Mario Gallo en 1909. .La copia obtenida no presenta los saltos esperables por las huellas del tiempo ni la falta de estabilidad debida a diversos factores: ser rodada a una velocidad inferior de cuadros por segundo y, principalmente, a manivela. En el año 2016 con motivo del Bicentenario de la Independencia se realizó una segunda restauración a cargo de la empresa Gotika a pedido del Instituto Nacional de Cine y Artes Audiovisuales. Se realiza una nueva corrección de color, estabilización, eliminación de rayas y manchas partiendo del negativo escaneado.           Reparto Eliseo Gutiérrez César Fiaschi",
      "id": "la-revolucion-de-mayo-1909"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "5 min",
    "imdbRating": "4.9",
    "imdbVotes": "94",
    "Genre": "Short, Drama, History",
    "Plot": "The film refers to the historical events happened in Buenos Aires in May1810 known as the May Revolution, in order to be independent of the Spaniards.",
    "Director": "Mario Gallo",
    "Writer": "N/A",
    "Actors": "Eliseo Gutiérrez",
    "Language": "None",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0001117",
      "title": "Cleopatra",
      "year": 1910,
      "imdbRating": "5.5",
      "imdbVotes": "15",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001032",
      "title": "The Sealed Room",
      "year": 1909,
      "imdbRating": "6.0",
      "imdbVotes": "985",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001915",
      "title": "A Tale of Two Cities",
      "year": 1911,
      "imdbRating": "5.4",
      "imdbVotes": "153",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0188941",
      "title": "Nero. Or the Fall of Rome.",
      "year": 1909,
      "imdbRating": "5.2",
      "imdbVotes": "553",
      "language": "None, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0434198",
      "title": "The Death of the Duke D'Enghien",
      "year": 1909,
      "imdbRating": "5.0",
      "imdbVotes": "32",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000776",
      "title": "The Last Days of Pompeii",
      "year": 1908,
      "imdbRating": "5.6",
      "imdbVotes": "137",
      "language": "None, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0207954",
      "title": "L'agonie de Byzance",
      "year": 1913,
      "imdbRating": "5.9",
      "imdbVotes": "172",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1223220",
      "title": "Antony and Cleopatra",
      "year": 1914,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001265",
      "title": "In the Border States",
      "year": 1910,
      "imdbRating": "6.4",
      "imdbVotes": "579",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001431",
      "title": "The Unchanging Sea",
      "year": 1910,
      "imdbRating": "6.3",
      "imdbVotes": "916",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0001150",
      "title": "A Child of the Ghetto",
      "year": 1910,
      "imdbRating": "5.4",
      "imdbVotes": "122",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0258254",
      "title": "A Tin-Type Romance",
      "year": 1910,
      "imdbRating": "6.4",
      "imdbVotes": "26",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}