{
  "movieId": "tt0151212",
  "title": "Kiko and the Honey Bears",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kiko-and-the-honey-bears-1936",
      "id": "kiko-and-the-honey-bears-1936",
      "title": "Kiko and the Honey Bears (1936)",
      "description": "Kiko and the Honey Bears is a Terrytoons cartoon directed by Mannie Davis, George Gordon. Watch on RetroFlix:  https://retroflix.org/kiko-and-the-honey-bears-1936/",
      "fileSize": 34019378,
      "addedAt": "2026-01-07T00:09:24.699Z",
      "thumbnail": "https://archive.org/services/img/kiko-and-the-honey-bears-1936",
      "language": "eng",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 35
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.3,
    "imdbVotes": 18,
    "Genre": "Animation, Short",
    "Plot": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content.1936, like all the other years for Terrytoons, saw a hit and miss batch. Of which 'Kiko and the Honey Bears' is one of the low middle ones ranking it in correlation with the rest of the Terrytoons, and one of the lesser ones of the 1936 batch. It is an unexceptional, nothing exactly special and somewhat lacklustre cartoon and has the same amount of problems as it has the amount of strengths. Completest sake is the main reason to see it.Best asset is the music, which predictably is incredible. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The ambitious, elaborate detail in the backgrounds in places is still great to see and some synchronisation is neat.A little charm here and there and the occasional mildly amusing touch. Kiko is on the right side of cute, though he fares better in support than as a lead.Outside of the backgrounds however, the animation is primitive at best with a fair bit of crudeness, over-simplicity and choppiness. Especially in the drawing and designs of the characters, disappointing for a period where the animation quality generally was improving. Limited budget and hasty time constraints show loud and clear.Likewise, the story is paper thin and formulaic, a familiar story with very over-familiar execution. It's also pretty dull, due to a lot of padding and not enough content. Very few of the characters are memorable apart from Kiko, who would have fared better with a character with a stronger personality like Farmer Al Falfa, the conflict is stale and parts try too hard to be cute.Gags are scarce, or at least nowhere near enough, and what there is is nothing to write home about, too much of it is very stale. The charm isn't enough either, neither is the tension, and some of it is structured in a choppy manner. Too much is too saccharine like at the start.Overall, lacklustre. 4/10 Bethany Cox",
    "Director": "Mannie Davis, George Gordon",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149808",
    "tt0149981",
    "tt0149712",
    "tt0150074",
    "tt0150514",
    "tt0150517",
    "tt0151211",
    "tt0152101",
    "tt0152464",
    "tt0152655",
    "tt0146869",
    "tt0150965"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.699Z"
}