{
  "movieId": "tt0140080",
  "title": "Der Glücksbringer",
  "year": 1957,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pVO-h5Ef02Y",
      "id": "pVO-h5Ef02Y",
      "title": "Der Glücksbringer - Liebe gibt es nicht umsonst - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt das Drama “Der Glücksbringer - Liebe gibt es nicht umsonst” mit Richard Gere und Dakota Fanning in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nIn dieser Charakterrolle spielt Weltstar Richard Gere den unglücklich alternden Milliardären Franny, der bei einem Autounfall seine besten Freunde verlor. Als die Tochter (Dakota Fanning, bekannt aus u.a. \"Krieg der Welten\", \"Ocean's 8\", \"Brimstone - Erlöse uns von dem Bösen\") seiner verstorbenen Freunde in sein Leben tritt, versucht er, seinen Frieden mit der Vergangenheit zu machen.\n\nJetzt “Der Glücksbringer - Liebe gibt es nicht umsonst” kostenlos als ganzen Film in deutsch sehen\nDas Drama mit Richard Gere (bekannt aus \"Pretty Woman\", \"Die Braut, die sich nicht traut\", \"American Gigolo\", \"Ein Offizier und Gentleman\") in der Hauptrolle erzählt die Geschichte des alternden Milliardärs Franny. Als er bei einem tragischen Autounfall seine besten Freunde verliert, zieht er sich zurück und bricht den Kontakt zu allen um ihn herum ab. Jahre später tritt die mittlerweile verheiratete Tochter der verstorbenen Freunde, Olivia (Dakota Fanning, bekannt aus \"The Alienist\" / dt. \"Die Einkreisung\" mit Daniel Brühl) Krieg der Welten), wieder in Frannys Leben. Dieser versucht daraufhin, mit der Vergangenheit abzuschließen und mischt sich stark in das Leben Olivias und ihres Mannes ein. Olivias Mann, Luke (Theo James) kommen dabei Zweifel, welche Ziele Franny wirklich verfolgt. Richard Gere beeindruckt mit seiner Darstellung des alten Mannes, der zwischen größter Lebensfreude und niederschmetternder Trauer schwankt. Produziert wurde der Film von Jay Schuminsky, Thomas B. Fore, Jason Michael Berman und Kevin Turen.\n\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme: www.moviedome.de\n\nFolge uns auch auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\n\n#Moviedome #DerGlücksbringer #movie #film #spielfilm \n\n\nFilmlänge: 92 Minuten\nDVD-Start (DE): 20.06.2016\n\nDie Charaktere werden von folgenden Schauspielern verkörpert: \nRichard Gere (bekannt aus \"Pretty Woman, Ein Offizier und Gentleman, Hachiko) in der Rolle des Franny\nDakota Fanning (bekannt aus Krieg der Welten, Twilight Saga) in der Rolle der Olivia\nTheo James in der Rolle des Luke\nCheryl Hines in der Rolle der Mia\nErica Cho in der Rolle der Ärztin\nDylan Baker in der Rolle des Bobby\n\nDie Handlung und Szenen von “Der Glücksbringer - Liebe gibt es nicht umsonst”\nOlivia (Dakota Fanning, bekannt aus der \"Twilight\"-Saga) verlor als Kind ihre Eltern bei einem Autounfall. Jahre später, als verheiratete Frau, trifft sie auf einen alten Bekannten: Milliardär und Philanthrop Franny (Richard Gere, u.a. \"Sommersby\", \"Der 1. Ritter\" und \"Mr. Jones\") war der beste Freund ihrer Eltern und kämpft seit dem Unfall mit Schuldgefühlen. Nach dem Tod seiner besten Freunde brach er den Kontakt zu seinem Umfeld vollständig ab. Umso mehr freut er sich, dass Olivia mit ihrem Ehemann Luke (Theo James) in sein Leben zurückkehrt. In seinem Bestreben, die Vergangenheit hinter sich zu lassen, beteiligt er sich intensiv am Eheleben der beiden. Dabei schlägt er immer weiter über die Stränge, sodass Luke Zweifel am Motiv des reichen alten Mannes kommen. Dieses Drama mit Top-Besetzung punktet mit herausragenden darstellerischen Leistungen und emotionalen Momenten. \n\nDie Synchronisation \nDie deutsche Synchronisation der Verfilmung wurde durch die DMT - Digital Media Technologie GmbH, Hamburg durchgeführt. \n\nRichard Gere; Sprecher: Hubertus Bengsch\nDakota Fanning; Sprecherin: Lisa May-Mitsching\nTheo James; Sprecher: Jaron Löwenberg \nCheryl Hines; Sprecherin: Christin Marquitan\nErica Cho; Sprecherin: Kerstin Draeger\nDylan Baker; Sprecher: Christian Rudolf\n\n\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. \n\nJetzt Film und Trailer kostenlos auf Deutsch schauen\nDer Glücksbringer - Liebe gibt es nicht umsonst I Trailer I 2016 I Alle Filminfos",
      "addedAt": "2025-12-26T00:36:16.813Z",
      "thumbnail": "https://i.ytimg.com/vi/pVO-h5Ef02Y/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB7i66ATestLxhToAekPTWG1u6NjQ",
      "duration": 5555,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "93 min",
    "imdbVotes": null,
    "Genre": "Comedy",
    "Plot": "N/A",
    "Director": "Volker von Collande",
    "Writer": "Theo Rausch",
    "Actors": "Beppo Brem, Lucie Englisch, Werner Finck",
    "Language": "German",
    "Country": "West Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0051196",
    "tt0149982",
    "tt0150842",
    "tt0184342",
    "tt0150147",
    "tt0050293",
    "tt0050335",
    "tt0127366",
    "tt0150530",
    "tt0148214",
    "tt0148309",
    "tt0148344"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:34.216Z"
}