{
  "imdbId": "tt0139491",
  "title": "The Negro Soldier",
  "year": 1944,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/negrosoldier",
      "id": "negrosoldier",
      "title": "The Negro Soldier",
      "description": "WWII recruitment film aimed at African Americans. The film opens with an African American minister in church telling his flock why they should join the armed forces to fight the Nazis. We see historical re-enactments of African Americans as valued participants in US armed conflicts dating from the American Revolution. The balance of the film deals with the African American experience within the present war effort, the conditions of their living and training, with special attention paid to the respect and dignity they will have. The quality of the original film is very good, however there are a few \"issues\" apparent in this copy, which was made from a video in the National Achives' collection: - the original work was made up of 5 seperate film reels, there are some noticable breaks in continuity when the reels switch - the framing of the film to video transfer was a bit off, so there is a border visible throughout - there is occassional video dropout, probably due either to the age of the video tape at the National Archives NAIL Control Number: NWDNM(m)-111-M-6022 ARC Identifier: 35956",
      "fileSize": 1059533353,
      "addedAt": "2026-01-07T00:10:02.897Z",
      "thumbnail": "https://archive.org/services/img/negrosoldier",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 30129
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "43 min",
    "imdbRating": 6,
    "imdbVotes": 850,
    "Genre": "Documentary, Short, Drama",
    "Plot": "Documentary focusing on the contributions to the American war effort of African-American soldiers.",
    "Director": "Stuart Heisler",
    "Writer": "Carlton Moss",
    "Actors": "Clyde Turner, Carlton Moss, William Broadus",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0034798",
    "tt2152805",
    "tt6710554",
    "tt1966357",
    "tt6056976",
    "tt3516888",
    "tt2160081",
    "tt6240486",
    "tt0033337",
    "tt0039840",
    "tt0812201",
    "tt13364232"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.897Z"
}