{
  "movieId": "tt0120274",
  "title": "Tango",
  "year": 1998,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tango_201908",
      "id": "tango_201908",
      "title": "Tango",
      "description": "“Sincere but routine” “Insipid and overly sentimental” (IMDB reviews quotes). Marion Nixon stars in this ordinary melodrama of class differences adapted from a novel by Vida Hurst. Good supporting cast and adequate production values, however there are no tango dancers in “Tango.” IMDB rating 5.6. Directed by Phil Rosen. Released in 1936. Complete print.",
      "fileSize": 924178271,
      "addedAt": "2026-01-07T00:11:46.527Z",
      "thumbnail": "https://archive.org/services/img/tango_201908",
      "collection": "feature_films",
      "downloads": 14433
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "115 min",
    "imdbRating": 6.9,
    "imdbVotes": 3203,
    "Genre": "Drama, Musical",
    "Plot": "Set in Buenos Aires, Argentina, the film tells the story of director Mario Suarez's quest to make the ultimate tango film. Lonely after his wife (one of the film's stars) has left him, Mario must find the themes that will hold the film together, while simultaneously permitting his musicians and dancers the freedom of expression that is necessary to satisfy the tango-hungry Argentine audience. Things become complicated when Mario falls in love with Elena, a beautiful and talented young dancer who is the girlfriend of the powerful and dangerous Angelo Larroca, an investor in the picture. And Mario's creative vision is challenged by his investors when he plans a scene that recreates Argentina's dark years of political suppression and \"disappearances\".",
    "Director": "Carlos Saura",
    "Writer": "Carlos Saura",
    "Actors": "Miguel Ángel Solá, Cecilia Narova, Mía Maestro",
    "Language": "Spanish",
    "Country": "Spain, Argentina",
    "Awards": "Nominated for 1 Oscar. 8 wins & 11 nominations total"
  },
  "relatedMovies": [
    "tt0150992",
    "tt0245837",
    "tt0049397",
    "tt0019644",
    "tt0028629",
    "tt0023845",
    "tt0038480",
    "tt0220614",
    "tt0019933",
    "tt0026775",
    "tt0043822",
    "tt0035397"
  ],
  "collections": [
    {
      "id": "1990s",
      "name": "1990s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.527Z"
}