{
  "movieId": "tt0183796",
  "title": "Social Error",
  "year": 1935,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5ZFmN6E78o0",
      "id": "5ZFmN6E78o0",
      "title": "Social Error (1935) DAVID SHARPE",
      "description": "PizzaFLIX Presents Classic Movie Monday\nStars: David Sharpe, Gertrude Messinger, Monte Blue\nDirector: Harry Fraser\n\nA college student is expelled for his wild antics, but he has a chance to redeem himself when a heiress is kidnapped.\n\nTRIVIA: David Sharpe has worked as a stuntman in over 4,500 films, more than any other person in Hollywood history.",
      "addedAt": "2025-12-24T01:06:27.391Z",
      "thumbnail": "https://i.ytimg.com/vi/5ZFmN6E78o0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDPb518T1K9dcxOw4sh_WytDMhq3w",
      "duration": 3590,
      "language": "en",
      "year": 1935,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "57 min",
    "imdbRating": 4.3,
    "imdbVotes": 52,
    "Genre": "Action, Adventure, Crime",
    "Plot": "One of a series of films, including two shorts, produced by William Berke starring David Sharpe, following Sharpe's work for Hal Roach in shorts and before Sharpe became a mostly-full time stunt man. In this one, Sharpe sings, tap dances, does acrobats, fights, climbs up and down building walls and drives and rides all vehicles that come his way. The first half is a series of collegiate escapades as Ed Bentley (David Sharpe) is finally expelled from dear old Wellmore by Dean Carter (Monte Blue), and he and his valet, Shadow (Fred Toones billed as \"Snowflake\") are on the way to a bank to get money to go home on, when Ed mistakes two bodyguards (Roger Williams and Ted Adams) pushing their charge, heiress June Merton (Gertrude Messinger, then married to David Sharpe), into a car as being kidnappers. He and Shadow follow them to the Merton apartment and begin to try and \"rescue\" her from the kidnappers who aren't kidnappers, although with Roger Williams and Ted Adams in the roles, the impression is that it hasn't occurred to them and one keeps expecting them to revert to type. But across the hall, Louie (Matty Fain) and Sonia (Sheila Terry), the low-rent tenants living on the same floor with the \"rich\" Mertons, have every intention of kidnapping the girl, and do so with the aid of the bumbling Ed and Shadow. Berke was also producing a western series with Harry Carey at the time, and the only cast members from those westerns missing here are Chief Thunder Cloud, Harry Carey and his horse Sonny. Lots of outdoor action and chases with views of 1935 Hollywood.",
    "Director": "Harry L. Fraser",
    "Writer": "David Sharpe, Charles E. Roberts",
    "Actors": "David Sharpe, Gertrude Messinger, Monte Blue",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0169253",
    "tt0030164",
    "tt0026772",
    "tt0026756",
    "tt0027201",
    "tt0026724",
    "tt0136492",
    "tt0028241",
    "tt0027420",
    "tt0025309",
    "tt0027879",
    "tt0164611"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:36:33.400Z"
}