{
  "imdbId": "tt0148419",
  "title": "Loco Lobo",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/loco-lobo-1947",
      "id": "loco-lobo-1947",
      "title": "Loco Lobo (1947)",
      "description": "Out in the desert, a dopey wolf tries to catch an obnoxious rabbit. Watch on RetroFlix:  https://retroflix.org/loco-lobo-1947/",
      "fileSize": 185205224,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/loco-lobo-1947",
      "language": "eng",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 129
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 5.7,
    "imdbVotes": 35,
    "Genre": "Animation, Short",
    "Plot": "In the waning days of Screen Gems' cartoon production -- Columbia has been trying to establish a stable cartoon unit since Charles Mintz' death in 1939 -- director Howard Swift and writer Cal Howard came up with this funny cartoon of a wolf pursuing a rabbit in the American Southwest desert.It's done very nicely, with a fine assortment of gags -- although it does run out of steam at the end. The problem is that the latest producers Columbia had hired for the unit were unsure of where they were going with the work. Their credentials were they had been book keepers for Schlesinger, and while they seem to have done a good job, no one seems to have any idea beyond whatever cartoon they had in hand. The only continuing characters they had were the Fox and the Crow, derived from the period five years earlier, when Frank Tashlin had been briefly in charge of the cartoon. Otherwise, every cartoon was a one-off, like this one.It's a pity, because a couple of years later, Chuck Jones would come up with the Roadrunner &amp; Coyote, same setting, same predator-and-prey tropes. No one would put it together at Columbia.Within a couple of year, so would the cartoonists at Screen Gems. UPA would do the job cheaper and with less supervision. They would also win a couple of Oscars.",
    "Director": "Howard Swift",
    "Writer": "Cal Howard",
    "Actors": "Dave Barry, Cal Howard",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0149273",
    "tt0151321",
    "tt0148603",
    "tt0148310",
    "tt0148072",
    "tt0147949",
    "tt0148627",
    "tt0149316",
    "tt0147957",
    "tt0036764",
    "tt0149288",
    "tt0162424"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.891Z"
}