{
  "movieId": "tt0151609",
  "title": "Molly Moo-Cow and the Indians",
  "year": 1935,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/molly-moo-cow-and-the-indians-1935",
      "id": "molly-moo-cow-and-the-indians-1935",
      "title": "Molly Moo-Cow and the Indians (1935)",
      "description": "A Conestoga Wagon leads Molly Moo-Cow and some ducks through the hills. The ducks stop for a swim by a tepee and go to explore the settlement. Molly misses her friends and goes to look for them; when she finds them she discovers they're behaving like Native Americans, and she joins in. Meanwhile, a Native woman downstream loses her baby in the stream and chases after her. Seeing the baby's in trouble, Molly pursues it as well, and eventually retrieves it. Watch on RetroFlix:  https://retroflix.org/molly-moo-cow-and-the-indians-1935/",
      "fileSize": 36172034,
      "addedAt": "2026-01-07T00:09:54.329Z",
      "thumbnail": "https://archive.org/services/img/molly-moo-cow-and-the-indians-1935",
      "language": "eng",
      "year": 1935,
      "collection": "feature_films",
      "downloads": 109
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "7 min",
    "imdbRating": 5.5,
    "imdbVotes": 120,
    "Genre": "Animation, Short, Comedy",
    "Plot": "A Conestoga Wagon leads Molly Moo-Cow and some ducks through the hills. The ducks stop for a swim by a tepee and go to explore the settlement. Molly misses her friends and goes to look for them; when she finds them she discovers they're behaving like Native Americans, and she joins in. Meanwhile, a Native woman downstream loses her baby in the stream and chases after her. Seeing the baby's in trouble, Molly pursues it as well, and eventually retrieves it. She returns it to its mother, but while she's gone a hunter captures the ducks and absconds with them. While preparing them for his meal Molly discovers what's going on and comes to the rescue, pleading with the man to release the ducks. A fight ensues, and the hunter is on the verge of winning when the Native woman joins in the fight and scares him away. Molly and the ducks return to the wagon and all is well.",
    "Director": "Burt Gillett, Tom Palmer",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150996",
    "tt0151608",
    "tt0151909",
    "tt0141134",
    "tt0026118",
    "tt0151610",
    "tt0026851",
    "tt0151910",
    "tt0152130",
    "tt0152309",
    "tt0152560",
    "tt0027123"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.329Z"
}