{
  "imdbId": "tt0152484",
  "title": "Smoky Joe",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/smoky-joe-1945",
      "id": "smoky-joe-1945",
      "title": "Smoky Joe (1945)",
      "description": "A Terrytoons cartoon released 25 May 1945. A faithful horse retires as the method of getting to a fire and is replaced by a fire engine. Of course, when the big fire breaks out, the fire engine breaks down and Joe comes to the rescue! Watch on RetroFlix:  https://retroflix.org/smoky-joe-1945/",
      "fileSize": 38059100,
      "addedAt": "2026-01-07T00:11:24.929Z",
      "thumbnail": "https://archive.org/services/img/smoky-joe-1945",
      "language": "eng",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 53
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.2,
    "imdbVotes": 17,
    "Genre": "Animation, Short",
    "Plot": "'Smoky Joe' is one of the few 1945 Terrytoons cartoons to not feature a re-curring character or be part of a re-curring character's theatrical series. This year's output for Terrytoons was mainly made up of cartoons part of theatrical series for two characters. One being Gandy/Sourpuss, a likeable pairing with a decent enough output that was starting to tire by now. The other being Mighty Mouse, an alright if limited character in a formulaic series that was already starting to get repetitive.1945's output, as one can probably tell, was from personal opinion a mixed bag. Never great, with the Gandy/Sourpuss cartoon 'Post War Inventions' being one of the few to be above good level. Neither was it ever completely dreadful, there are weak/mediocre efforts but even they managed to have good things. Found 'Smoky Joe' to be one of the better Terrytoons cartoon from that year and that Smoky Joe himself was compelling enough to feature in more cartoons.It is a bit of a slow starter, lacking the energy that the rest of the cartoon once the action kicked in had. Giving the impression that it would be a slight and predictable cartoon.And to me if to be respectfully honest the first third did have that impression.Once 'Smoky Joe' got going though and the action kicked in, it was good fun. Do agree that it is one of the livelier in pace Terrytoons cartoons around this point and there are more gags than usual. While none of them are what you would call hilarious or particularly original, they have enough variety to them and they are amusing at least. No real corkers but no real misfires either, settling for a very comfortable in between. The titular character amuses and engages.The animation, as usual for Terrytoons during this period, is great. Of all the components of the cartoons from the studio, overtime this was the most improved, the drawing is smoother and more refined and the backgrounds more detailed complete with some vibrant colours that help make the fire visuals look as authentic as possible. The music as to be expected is outstanding, the characterful energy and sumptuousness of orchestration is evident throughout and it helps the action get the snap that is necessary.Summing up, not mind-blowing but quite good for 1945 Terrytoons. 7/10",
    "Director": "Connie Rasinski",
    "Writer": "John Foster, Tom Morrison, Paul Terry",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0151566",
    "tt0152134",
    "tt0152787",
    "tt0150059",
    "tt0151145",
    "tt0145751",
    "tt0151560",
    "tt0145954",
    "tt0037912",
    "tt0148489",
    "tt0148632",
    "tt0149616"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.929Z"
}