{
  "imdbId": "tt0188999",
  "title": "Piloto de pruebas",
  "year": 1972,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/piloto-de-pruebas-1972",
      "title": "Piloto De Pruebas ( 1972)",
      "description": "Piloto de pruebas  es una película filmada en colores de  Argentina  dirigida por  Leo Fleider  según su propio guion escrito en colaboración con  Jorge Falcón  que se estrenó el 23 de marzo de 1972 y que tuvo como protagonistas a  Carlos Alberto Pairetti ,  Gilda Lousek ,  Ricardo Bauleo  y  Osvaldo Brandi . 1 ​ 2 ​ 3 ​Esta película tiene algunas similitudes con la película de Sandro de Siempre Te Amaré acerca de carreras de autos estrenada el año anterior, ya que no se descarta haber sido una secuela contando con la misma dirección y guion. (Wikipedia) Sinopsis Aventuras de un piloto de pruebas de  Turismo Carretera , incluyendo un triángulo amoroso. 1 ​ Trama La historia se centra en la etapa profesional del piloto  Carlos Alberto Pairetti , durante su paso por el equipo oficial Ford Argentina del  Turismo Carretera . Sin embargo, esta historia transcurre en una realidad ficticia en la cual el ex-campeón de la categoría tiene un hermano llamado Nicolás ( Ricardo Bauleo ). Durante su paso por el equipo oficial  Ford , Pairetti es contratado no solo como piloto para las categorías de  Turismo Carretera  y  Sport Prototipo , sino que además posee un cargo dentro de la planta ubicada en  General Pacheco , lo cual le permite conseguirle puestos de trabajo tanto a su hermano como a su amigo Roberto Brandi ( Osvaldo Brandi ). Lamentablemente, Carlos debe lidiar con la actitud irresponsable de su hermano menor, a quien en más de una oportunidad reprende por sus actitudes juerguistas, su poco apego al trabajo y sus constantes roces con Roberto. Un buen día, el Sr. Iglesias (jefe de la planta de Ford en Pacheco), decide promover a Pairetti como piloto y jefe del equipo oficial, dejando en sus manos la designación del personal que lo acompañarían en la conformación de la escudería. Por tal motivo, Carlos debe elegir un reemplazo para ocupar el cargo de jefe de pilotos de pruebas que poseía hasta esa designación. En un acto de piedad, Carlos designa a Nicolás como su sucesor, en detrimento de Roberto. Esto hace que Roberto cuestione la decisión de su amigo, quién sin embargo le responde que no quería ventilar la decisión que llevaba aparejada con esta designación, la cual era que Roberto sería el piloto número 2 junto a Carlos. Al conocer esta decisión, Nicolás comenzó a desentenderse de su nueva posición dentro de la fábrica, provocando que Iglesias finalmente tome la decisión de removerlo de su cargo, comunicando a Carlos de su decisión. Carlos se decepciona por la actitud de Nicolás y trata por todos los medios de devolverle credibilidad, por lo que lo pone a trabajar bajo su entera supervisión y responsabilidad. Una noche Ana, la esposa de Carlos ( Gilda Lousek ), le anuncia a su esposo la llegada al país de Susana, una amiga proveniente del  Uruguay , por lo que le pide que invite a Nicolás a salir junto a ellos, sin embargo este rechaza la invitación aduciendo \"querer disfrutar de su día libre\", lo que provoca que Carlos finalmente termine invitando a Roberto a la salida. Con lo que no iba a contar nadie, era con que tanto Carlos como Nicolás terminaron coincidiendo en el mismo local bailable. Al percatarse de la presencia de Carlos y contemplar la belleza de Susana, Nicolás no tiene empacho en dejar a la mujer que lo acompañó para acercarse a Susana, provocando la sorpresa de Carlos y el enojo de Roberto. A pesar de este incómodo encuentro, el grupo comienza a salir más de seguido, sin embargo en una de esas salidas Carlos sufre un accidente al tratar de manipular una bola de boliche, lo que lo priva del uso del brazo derecho. Por tal motivo, se ve obligado a convocar a su hermano para que lo reemplace como piloto, con vistas al Gran Premio de la Montaña que se avecinaba por esos días. Durante unas pruebas que el equipo llevó adelante en una ruta, Nicolás vuelve a salirse de los papeles, al tomar esta prueba como un nuevo desafío para demostrarle a su hermano que era mejor piloto que Roberto, lo cual termina dando como resultado la rotura del motor del auto de Nicolás, a un día de producirse la competencia y sin un motor que sirva como reemplazo. Presionado por la gravedad del caso, Carlos termina inclinándose por Nicolás para que lo reemplace en el Gran Premio, frustrando nuevamente la carrera de Roberto, quién sin embargo acepta la decisión con resignación. El Gran Premio de la Montaña del '72 transcurre y Nicolás cierra la jornada con un trabajo impecable y sin fisuras, demostrando el acierto de su hermano al designarlo como su reemplazante. Nuevamente el grupo se reúne a festejar en un local bailable, donde nuevamente Nicolás se aprovecha de la situación para alejar a Roberto de al lado de Susana. Tras el éxito del equipo en el Gran Premio de la Montaña, Carlos anuncia su participación en las 300 millas de Indy (competencia que quedó en la historia por haber sido la primera vez que la categoría norteamericana hizo pie en suelo argentino), designando a su vez a Nicolás y Roberto como sus pilotos de reserva, aunque manteniendo el misterio sobre quién iba a ser efectivamente el que participe. Sin embargo, esta decisión de Carlos terminó dando pie a un planteo de Nicolás que terminó de la peor manera. Tras haber mantenido una reunión en un bar, donde Carlos comunicó su decisión a sus compañeros, Nicolás propuso desafiar a Roberto a una competencia unas horas antes de que se abra el  Autódromo de Rafaela . Este desafío terminó por quemar todos los papeles, ya que como desenlace tuvo un brutal accidente que terminó dejando a Roberto en estado de agonía. Tras haber sido hospitalizado, Roberto pide hablar con Carlos ante quien desliga a Nicolás de cualquier responsabilidad por lo sucedido. Con sus últimas fuerzas, pide ver a todos los amigos una vez más. Una vez frente a ellos, Roberto pide a Nicolás que cuide a Susana y a Carlos que gane la competencia, tras lo cual da su último suspiro, muriendo ante sus amigos. La película finaliza con la participación de Carlos en las 300 millas de Indy, donde recuerda las últimas palabras de Roberto mientras conduce su prototipo. Reparto Participaron en el filme los siguientes intérpretes: 1 ​ Actor Personaje Carlos Pairetti Él mismo con voz neutra de Emilio Disi Parada. Ricardo Bauleo 4 ​ Nicolás Pairetti Osvaldo Brandi 4 ​ Roberto Brandi Gilda Lousek 5 ​ Ana Pairetti Mariquita Gallegos 5 ​ Susana Eddie Pequenino 4 ​ El \"Tano\" Alfredo Iglesias 4 ​ Iglesias Alberto Hugo Cando (padre) Relator de carreras además de comentarista en la Fórmula 1 Internacional y en las imágenes a color de los 1000 kilómetros de Sport Prototipos válido por el Campeonato Mundial de Pilotos y Marcas de esos años para Canal 7 junto a Juan Carlos Pérez Loizeau mas estar en el video del Turismo Carretera en la localidad de Los Cóndores Provincia de Córdoba. José María Pommares Entrevistador Actuaciones musicales Bandas Canciones interpretadas Mauro y su conjunto Mil lágrimas de amor Los Bríos Nena juguemos Conjunto Santa Bárbara Lo que el mundo necesita es paz Conjunto Abracadabra Quererte mucho, extrañarte poco",
      "id": "piloto-de-pruebas-1972"
    }
  ],
  "metadata": {
    "Rated": "TV-PG",
    "Runtime": "85 min",
    "imdbRating": "N/A",
    "imdbVotes": "N/A",
    "Genre": "Musical, Comedy",
    "Plot": "Un piloto de pruebas del Turismo de Carretera vive todo tipo de aventuras, incluyendo un triángulo amoroso.",
    "Director": "Leo Fleider",
    "Writer": "Jorge Falcón, Leo Fleider",
    "Actors": "Ricardo Bauleo, Osvaldo Brandi, Mariquita Gallegos",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0060378",
      "title": "Escala musical",
      "year": 1966,
      "imdbRating": "N/A",
      "imdbVotes": "20",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0188848",
      "title": "Locuras, tiros y mambos",
      "year": 1951,
      "imdbRating": "N/A",
      "imdbVotes": "14",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0188971",
      "title": "Novia para dos",
      "year": 1956,
      "imdbRating": "N/A",
      "imdbVotes": "9",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0168469",
      "title": "Así es Buenos Aires",
      "year": 1971,
      "imdbRating": "5.2",
      "imdbVotes": "12",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0188586",
      "title": "Embrujo de amor",
      "year": 1971,
      "imdbRating": "6.2",
      "imdbVotes": "33",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0189091",
      "title": "Siempre te amaré",
      "year": 1971,
      "imdbRating": "4.6",
      "imdbVotes": "30",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0188526",
      "title": "Crimen en el hotel alojamiento",
      "year": 1974,
      "imdbRating": "4.2",
      "imdbVotes": "6",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0228063",
      "title": "Bikinis y rock",
      "year": 1972,
      "imdbRating": "4.4",
      "imdbVotes": "16",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0191997",
      "title": "Estoy hecho un demonio",
      "year": 1972,
      "imdbRating": "4.2",
      "imdbVotes": "11",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0068670",
      "title": "Había una vez un circo",
      "year": 1972,
      "imdbRating": "4.8",
      "imdbVotes": "83",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0178907",
      "title": "La sonrisa de mamá",
      "year": 1972,
      "imdbRating": "5.5",
      "imdbVotes": "51",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0066888",
      "title": "Caravan",
      "year": 1971,
      "imdbRating": "6.7",
      "imdbVotes": "338",
      "language": "Hindi",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:10:12.700Z"
}