{
  "imdbId": "tt0232263",
  "title": "Pan-American Exposition by Night",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-pan-american-exposition-by-night",
      "id": "silent-pan-american-exposition-by-night",
      "title": "Pan-American Exposition by Night",
      "fileSize": 30084154,
      "addedAt": "2026-01-07T00:11:07.410Z",
      "thumbnail": "https://archive.org/services/img/silent-pan-american-exposition-by-night",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 335
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "1 min",
    "imdbRating": 5.8,
    "imdbVotes": 570,
    "Genre": "Documentary, Short",
    "Plot": "A great feature of the Pan-American Exposition, as unanimously conceded by all visitors, was the electric illumination of the Exposition grounds at night. After a great deal of experimenting and patience, we succeeded in securing an excellent picture of the buildings at the Pan-American as they appeared when lighted up at night. All the buildings from the Temple of Music to the Electric Tower are shown, including the Electric Tower itself. The emotional and sensational effects were also secured by starting the panoramic view by daylight and revolving the camera until the Electric Tower forms the center of the field of the lens. Our camera was then stopped and the position held until night, when we photographed the coming up of the lights, an event which was deemed by all to be a great emotional climax to the Pan-American Exposition. Immediately the lights are burning to their fullest brilliancy, the camera is againt set in motion and revolved until the Temple of Music is reached. The motion is then reversed and the camera goes back until it rests on the Electric Tower, thus supplying the climax to the picture. The great searchlights of the Tower are being worked during the entire time the picture is being exposed, and the effect is startling. This picture is pronounced by the photographic profession to be a marvel of photography.",
    "Director": "Edwin S. Porter",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0366268",
    "tt0232181",
    "tt0285265",
    "tt0233479",
    "tt0231523",
    "tt0316226",
    "tt0000346",
    "tt0348794",
    "tt0000301",
    "tt0245125",
    "tt0000321",
    "tt0477387"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.410Z"
}