{
  "imdbId": "tt0227995",
  "title": "The Adventure of the Wrong Santa Claus",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-adventure-of-the-wrong-santa-claus",
      "id": "silent-the-adventure-of-the-wrong-santa-claus",
      "title": "The Adventure of the Wrong Santa Claus",
      "fileSize": 212900828,
      "addedAt": "2026-01-07T00:11:15.974Z",
      "thumbnail": "https://archive.org/services/img/silent-the-adventure-of-the-wrong-santa-claus",
      "language": "English",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 483
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "14 min",
    "imdbRating": 5.6,
    "imdbVotes": 246,
    "Genre": "Short, Comedy, Drama",
    "Plot": "Time hung heavily on the hands of Octavius, for no new problems that presented themselves for his massive intellect to unravel. He felt somewhat discouraged with things generally when suddenly the morning mail brought a piece of news which was destined to lead him into the most extraordinary adventure of his entire career. In short, it was an invitation from his friends, Mr. and Mrs. Randall, to pay them a holiday visit and to play the part of Santa Claus at the children's Christmas party. Octavius accepted the invitation with enthusiasm, and repaired to a toy shop where he invested in a complete Santa Claus outfit. He arrived at the Randall's just in time for dinner. Christmas greetings were exchanged and all was merriment, they little dreaming that an unwelcome guest, in the person of a burglar, was slipping into the house as they ate. The arrival of Grace Randall added to the merriment of all, and it was very evident that her personality made an immediate impression upon Octavius. In the meantime, the burglar had made his way to the floor above. Listening to the happy voices in the hall, he overheard Mrs. Randall telling Octavius that a complete Santa Claus outfit was hanging in the closet of the spare room. The burglar immediately decided to use the costume as a disguise. Octavius, on the other hand, decided to wear his own outfit and just as he was admiring its general effect in the mirror, the burglar entered his room and knocked him senseless. Safe in his disguise, the footpad passed quickly to the lower floor and escaped from the house with all of the Christmas presents. Octavius regained his senses, only to find himself securely locked in, but at last he attracted the attention of his friends and was quickly released. In the midst of the story, Mrs. Randall discovered that the presents were stolen. Octavius started at once upon the trail and succeeded in overtaking his quarry just as he was boarding the train for the city. Climbing into the moving train, Octavius proceeded to attack the burglar, but was restrained by the train crew. He waited, however, until the train should arrive in the city, and after many failures, succeeded in capturing the basket with which he returned to the Randall home, triumphant. His welcome was an enthusiastic one and the understanding between him and Grace was so apparent that Mr. and Mrs. Randall crept out of the room, leaving them a free field. The children, however, were more curious and were the happy witnesses of the final capitulation of Octavius, detective.",
    "Director": "Charles M. Seay",
    "Writer": "Frederic Arnold Kummer",
    "Actors": "Barry O'Moore, Julian Reed, Richard Neill",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0404734",
    "tt0234537",
    "tt0004028",
    "tt0003323",
    "tt0006764",
    "tt0002478",
    "tt0007507",
    "tt0256909",
    "tt0004413",
    "tt0008133",
    "tt0460831",
    "tt0326184"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.974Z"
}