{
  "movieId": "tt0297449",
  "title": "1925 Studio Tour",
  "year": 1925,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-1925-studio-tour",
      "id": "silent-1925-studio-tour",
      "title": "1925 Studio Tour",
      "fileSize": 521702201,
      "addedAt": "2026-01-07T00:10:50.367Z",
      "thumbnail": "https://archive.org/services/img/silent-1925-studio-tour",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 714
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "32 min",
    "imdbRating": 6.8,
    "imdbVotes": 441,
    "Genre": "Documentary, Short",
    "Plot": "This documentary provides a behind the scenes look at the making of movies in 1925 at the M-G-M Studios in Culver City, California. The studio itself is a small city, encompassing forty-five buildings, including fourteen sound stages (number fourteen which is currently under construction), connected by three miles of paved roads over the forty-three acre property. The stories, the soul of any movie, are vetted through a story department headed by Mrs. M.F. Lee. The approved stories are passed to the scenario writers, supported by the research department, who ensure factual accuracy. Taking the script, the director makes up the storyboards, and casts the lead roles. The director has a plethora of big name stars available at his disposal. The casting office, headed by Robert McIntyre, fills the supporting roles. His office is filled with aspiring actors, hoping to be the next big star. Being M-G-M with many of the movies being \"musicals\", a large subgroup of the performers are dancers, who are supported by the studio's musicians, there for mood rather than sound for the movie itself which is non-existent. The craft departments, such as costume design and art departments, make sure the movie looks like it should. And the technical departments, such as camera, electrical and construction, provide the support. These support teams are all under the guidance of the studio's production manager, J.J. Cohn. After filming, the movie goes into post-production, such as film printing, developing and editing. The final products are stored in the studio's fireproof vaults. And once the movie leaves the studio, the publicity department takes over. Some of M-G-M's biggest names, both those in front and behind the camera, are at the studio on the day of this tour.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Mrs. M.F. Lee, Carey Wilson, Howard Hawks",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt5503754",
    "tt0309243",
    "tt0229789",
    "tt1029374",
    "tt0309770",
    "tt0475080",
    "tt0988639",
    "tt0000537",
    "tt0178247",
    "tt0334912",
    "tt3100486",
    "tt0178309"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}