{
  "movieId": "tt0235045",
  "title": "The Whole Dam Family and the Dam Dog",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-whole-dam-family-and-the-dam-dog",
      "id": "silent-the-whole-dam-family-and-the-dam-dog",
      "title": "The Whole Dam Family and the Dam Dog",
      "fileSize": 45832161,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-the-whole-dam-family-and-the-dam-dog",
      "language": "English",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 546
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "5 min",
    "imdbRating": 5.3,
    "imdbVotes": 735,
    "Genre": "Short, Comedy, Family",
    "Plot": "The Whole Dam Family and The Dam Dog is a popular fad which has been widely advertised by lithographs and souvenir mailing cards, and has recently been made the subject of a sketch in a New York Vaudeville Theatre. The Edison Manufacturing Co., with their usual up-to-date methods, have illustrated this popular subject in a most novel and original way in Motion Pictures. The picture opens with a close view of the individual members of the family. Each goes through a very amusing performance. Mr. I.B. Dam is seized with a severe fit of sneezing. Herself relieves her mind through woman's sole weapon. Jimmy Dam shows how a cigarette should be smoked. Miss U.B. Dam is very proud of the marcel wave in her hair. Annie Dam, in a large picture hat, tries to look very shy and demure. Lizzie Dam chews gum in a most artistic manner. Baby Dam gives a sample of his ability at crying. A family group is seated at dinner, with the Dam Dog seated at the head of the table. Mr. I.B. Dam enters and kicks the Dam Dog out of the chair. The Dam Dog waits until the soup has been served, and then returns and drags the table cloth and all the dishes on to the floor. The final scene is most amusing. Different portions of the Dam Dog's body appear from all directions. They finally arrange themselves in shape, showing a dilapidated looking cur sitting up on his haunches. Presently his tail joins his body by piecemeal, the end having two tin cans tied to it. The tail and tin cans begin to wag in a most comical way. The picture has made the biggest kind of a hit, and is one of the best humorous pictures ever offered.",
    "Director": "Edwin S. Porter",
    "Writer": "N/A",
    "Actors": "William Courtenay, Frank Daniels, May Irwin",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0233391",
    "tt0000565",
    "tt0228839",
    "tt0273542",
    "tt0231549",
    "tt0287461",
    "tt0231758",
    "tt0248890",
    "tt0235568",
    "tt0477345",
    "tt0477366",
    "tt0477372"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}