{
  "imdbId": "tt0248567",
  "title": "Traps and Tangles",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/my-movie_20210821_2253",
      "title": "\"Traps and Tangles\" (1919) starring Larry Semon",
      "description": "This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems    This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation   This film is part of our brand new Larry Semon collection of short comedies. Please see below important details about this collection. \"Traps and Tangles\" is a short comedy directed by Larry Semon starring Larry Semon, Madge Kirby, Otto Lederer, Frank Alexander, Vera Steadman, William Hauber, Rose Gore and others. A Special Announcement As part of our Silent Gems Collection of rare high quality films we have released a set of discs named: Endless Slapstick. Larry Semon: The Ultimate Collection Highlights of this exclusive and unique collection: 1/ this is the most comprehensive Larry Semon collection ever released - it includes no less than 61 short comedies on 13 DVDs. 2/ almost half of these films have never been available on home video. 3/ most of these films are brand new high resolution transfers made with cutting-edge true frame-by-frame scanning technology, offering superior quality compared to other releases. 4/ many of these films are transfers combined from more than one source print and include numerous scenes that have never been available for viewing in other releases; thus, the films in our collection represent the most complete versions possible. 5/ Larry Semon is just one of a whole constellation of stars, in particular, Oliver Hardy stars in 21 films, Stan Laurel in 3 other films, and Monty Banks in still one other film. 6/ Larry Semon fans will be delighted with this new exclusive collection, which offers 23 hours of mirth from sidesplitting slapstick!",
      "id": "my-movie_20210821_2253"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "16 min",
    "imdbRating": "4.6",
    "imdbVotes": "18",
    "Genre": "Short, Comedy",
    "Plot": "A very moderate Larry Semon in which he plays a detective on the trail of a gang whom, disguised as a elderly Jew, he cleverly manages to capture. He and his wife however themselves get tricked by one clever con man and Larry also gets pickpocketed by another (a woman this time). Frank Alexander is the assistant in a pawnshop whose mildly crooked proprietor is again possibly intended to be Jewish (the antics are those typically imputed to Jewish shopkeepers). His wife, through the discovery of a misplaced photograph of Alexander's girlfriend, comes to believe that her husband is unfaithful and consults Larry and, iIn order to spy on the shop assistant and the girl, he pretends to be one of the shop's tailor's dummies. They discover he is spying on them, the proprietor discovers his wife has hired a detective and a typical Semon high-voltage tangle ensues where everyone is chasing everyone else and Semon has an opportunity for the dare-devil rooftop acrobatics several times employed in 1918-19 (see Dunces and Dangers and Humbugs and Husbands) and which would famously be copied and improved upon by Harold Lloyd in Look Out Below a little later in the year and by virtually every single comic in the years that followed.There is a further final twist at the end.Semon's humour is always recognisably \"Jewish\" in its style but very rarely explicitly so, in the sense that he plays Jewish characters (like the young Ernst Lubitsch or the US comedian Max Davidson) or makes constant Jewsih references (in the manner of Woody Allen) and this film is rather unusual in that respect. The caricatures are not very complimentary but it would obviously be absurd to describe them as in any way \"anti-Semitic\" or \"anti-Jewish\". The fact is that, rightly or wrongly, Jewish humour itself assumed such caricatures and made frequent use of them (the films of Davidson, himself, like Semon, of Central European Ashkenazi stock, contain many examples of such typical self-deprecatory humour).The version of the film I saw is a much later sonorised and commented Spanish version and it is interesting that, despite being so evidently a Jewish comedian, Semon was hugely popular long after his death in both Fascist Italy and Fascist Spain.",
    "Director": "Larry Semon",
    "Writer": "Larry Semon",
    "Actors": "Larry Semon, Madge Kirby, Frank Alexander",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0277342",
      "title": "Spies and Spills",
      "year": 1918,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0174483",
      "title": "Babes and Boobs",
      "year": 1918,
      "imdbRating": "6.8",
      "imdbVotes": "18",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0268254",
      "title": "Dunces and Dangers",
      "year": 1918,
      "imdbRating": "6.3",
      "imdbVotes": "59",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0277438",
      "title": "Whistles and Windows",
      "year": 1918,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0009563",
      "title": "Romans and Rascals",
      "year": 1918,
      "imdbRating": "4.3",
      "imdbVotes": "40",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0455012",
      "title": "Gall and Golf",
      "year": 1917,
      "imdbRating": "6.3",
      "imdbVotes": "17",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0277323",
      "title": "Slips and Slackers",
      "year": 1917,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0277391",
      "title": "Tough Luck and Tin Lizzies",
      "year": 1917,
      "imdbRating": "5.8",
      "imdbVotes": "35",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0277236",
      "title": "Plagues and Puppy Love",
      "year": 1917,
      "imdbRating": "6.2",
      "imdbVotes": "50",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0268266",
      "title": "The Dome Doctor",
      "year": 1925,
      "imdbRating": "6.9",
      "imdbVotes": "19",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007023",
      "title": "The Man from Egypt",
      "year": 1916,
      "imdbRating": "5.1",
      "imdbVotes": "26",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0011958",
      "title": "The Bell Hop",
      "year": 1921,
      "imdbRating": "6.7",
      "imdbVotes": "70",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:09:54.333Z"
}