{
  "movieId": "tt0244419",
  "title": "Una bala es mi testigo",
  "year": 1960,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/y-2-mate.is-una-bala-es-mi-testigo-pelicula-completa-de-gaston-santos-cdb-5gn-jy",
      "id": "y-2-mate.is-una-bala-es-mi-testigo-pelicula-completa-de-gaston-santos-cdb-5gn-jy",
      "title": "Una bala es mi testigo(1960)",
      "description": "A stranger arrives in a town to avenge the death of his godparents. SINOPSIS:  Un forastero investiga en un pueblo quién mató a su amigo Enrique Mora para robarle 200 mil pesos y defiende de unos esbirros al \"El Profesor\", un boticario. El ranchero Juan, supuesto asesino de Mora, es obligado por el villano Romano a firmar un pagaré. María Rosa, esposa de Juan y madre de la niña Estercita, revela al forastero que al parecer fue la pequeña quien mató a Mora al disparar un rifle, sin acertar, contra un gavilán. Un esbirro que intenta matar al forastero cae de la carreta robada en la que intenta huir y dice que fue Juan quien mató a Mora. En la cantina, Romano es golpeado por el antes cobarde Juan al sugerir el villano un romance entre María Rosa y el forastero. Acto seguido, Juan, sujetado por esbirros, recibe una paliza de Romano. Estercita, cuyo oído quedó afectado al disparar el rifle, revela al forastero que oyó otro tiro además del suyo. Ante el desvanecido y ensangrentado Juan, María Rosa es amenazada por Romano, pero llega el forastero: pistola en mano, desarma a los villanos y rescata a la pareja. Los villanos rodean el rancho de Juan; Estercita queda a su merced al correr, tropezar y desmayarse, pero su padre, a costa de ser herido, logra que el forastero la rescate. En la balacera, mueren todos los esbirros. El forastero vence a Romano. Ya curado Juan, el forastero revela que fue Romano quien mató a Mora.",
      "fileSize": 2516833718,
      "addedAt": "2026-01-07T00:13:17.037Z",
      "thumbnail": "https://archive.org/services/img/y-2-mate.is-una-bala-es-mi-testigo-pelicula-completa-de-gaston-santos-cdb-5gn-jy",
      "language": "spa",
      "year": 1960,
      "collection": "feature_films",
      "downloads": 1580
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbVotes": 14,
    "Genre": "Action, Crime, Drama",
    "Plot": "A stranger arrives in a town to avenge the death of his godparents.",
    "Director": "Chano Urueta",
    "Writer": "Ramón Obón",
    "Actors": "Gastón Santos, Rita Macedo, Jaime Fernández",
    "Language": "Spanish",
    "Country": "Mexico",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0054058",
    "tt0054350",
    "tt0053098",
    "tt0053374",
    "tt0055633",
    "tt0051783",
    "tt0134771",
    "tt1248984",
    "tt0048108",
    "tt0048209",
    "tt3881026",
    "tt0116374"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:17.037Z"
}