{
  "imdbId": "tt0236553",
  "title": "One Too Many",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OneTooMany",
      "id": "OneTooMany",
      "title": "One Too Many",
      "description": "Long before teaming with Stan Laurel, Oliver Hardy starred with Billy Ruge in a series of comedies as \"Plump and Runt.\" It was relatively short-lived, as they did 35 films together in 1915 and 1916, mainly one reels. It was the pinnacle of Ruge's career, and he disappeared from movies a few years later. Hardy moved on to bigger things (no pun intended). In this short, Plump receives an announcement of a coming visit by a rich uncle. He can't wait to meet the beautiful wife and children Plump has boasted about. Plump panics, as he has no family and he recruits bellboy Runt to help him cover this up. The story gets a little bizzare as Runt resorts to kidnapping and child trafficking to achieve his ends. In one scene, Runt approaches a strange woman on the street and tells her to \"rent me your baby.\" She hands the child over with a smile. IMDb entry: http://www.imdb.com/title/tt0236553/",
      "fileSize": 589863692,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/OneTooMany",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 9437
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-one-too-many",
      "id": "silent-one-too-many",
      "title": "One Too Many",
      "fileSize": 208409740,
      "addedAt": "2026-01-07T00:11:07.410Z",
      "thumbnail": "https://archive.org/services/img/silent-one-too-many",
      "language": "English",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 230
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "16 min",
    "imdbRating": 4.3,
    "imdbVotes": 179,
    "Genre": "Comedy, Short",
    "Plot": "Plump, a bachelor wastrel who drinks too much and sleeps until noon, learns that his uncle, who thinks Plump is married with a baby, will arrive for a visit in two hours. He throws cash at the building's errand \"boy,\" a small man who goes about grabbing or renting small children from their mothers then bribing various women to pose as Plump's wife. As Uncle John's arrival nears, Plump in desperation swaddles the errand boy and puts him in the crib. With various infants and women coming in and out, and several men looking for their lost babies or lost wives, will Plump pull off his deception?",
    "Director": "Will Louis",
    "Writer": "N/A",
    "Actors": "Oliver Hardy, Billy Ruge, Billy Bletcher",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0418515",
    "tt0006796",
    "tt0009764",
    "tt0228815",
    "tt0251116",
    "tt0009558",
    "tt0139488",
    "tt0006414",
    "tt0007194",
    "tt0006684",
    "tt0006764",
    "tt0006548"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.410Z"
}