{
  "imdbId": "tt0203689",
  "title": "Las minas de Salomón Rey",
  "year": 1986,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/las-minas-de-salomon-rey-1986",
      "id": "las-minas-de-salomon-rey-1986",
      "title": "Las Minas De Salomon Rey (1986)",
      "description": "Las minas de Salomón Rey  es una película cómica de  Argentina  dirigida y guionada por  Gerardo Sofovich  y estrenada el 2 de octubre de 1986. Fue interpretada por  Tristán ,  Susana Traverso ,  Rolo Puente ,  Reina Reech  y  Ana María Giunta . (Wikipedia) Reseña Salomón Rey ( Rolo Puente ) es un adinerado empresario que mantiene simultáneamente dos relaciones amorosas con Natalia ( Reina Reech ) y Morena ( Susana Traverso ) sin que ninguna de ellas sepa la existencia de la otra. Pero el cumpleaños de una y el aniversario de otra se mezclarán en un día agitado, disparando todo tipo de enredos en torno a un tapado de visón, para lo cual Salomón contará con la ayuda de su torpe pero fiel empleado  Tristán . Así ambos tratarán de que el día termine de la mejor manera y que el empresario pueda continuar la relación con sus dos hermosas mujeres... pero las cosas se irán complicando a medida que se acerque la noche. Reparto Actor Personaje Tristán Tristán Susana Traverso Morena Iriarte Rolo Puente Salomón Rey Reina Reech Natalia Arismendi Ana María Giunta Domitila Silvia Pérez Fernanda Ortiguera Silvia Peyrou Clarita Sánchez, la secretaria Nelly Prono Tía de Fernanda Alfonso Pícaro Policía Délfor Medina Peletero Mónica Guido Teresa Emilio Vidal Ladrón Rubén Green Policía Pepe Fechoría Él mismo Roberto Giordano Él mismo Alberto Busaid Policía Roberto Dairiens Pete Martin Farmacéutico Gustavo sofovich cadete Roberto giordano estilista",
      "fileSize": 1285582108,
      "addedAt": "2026-01-07T00:09:38.887Z",
      "thumbnail": "https://archive.org/services/img/las-minas-de-salomon-rey-1986",
      "language": "spa",
      "year": 1986,
      "collection": "feature_films",
      "downloads": 16104
    }
  ],
  "metadata": {
    "Rated": "18",
    "Runtime": "92 min",
    "imdbRating": 5.4,
    "imdbVotes": 285,
    "Genre": "Comedy",
    "Plot": "A wealthy and womanizing businessman gets into trouble when he decides to give a fur coat as a birthday present to one of his two girlfriends. His clumsy chauffeur and his attractive secretary will try to help him, while everything becomes more and more entangled.",
    "Director": "Gerardo Sofovich",
    "Writer": "Gerardo Sofovich",
    "Actors": "Tristán, Rolo Puente, Susana Traverso",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0198351",
    "tt0198421",
    "tt0199058",
    "tt0301947",
    "tt0091364",
    "tt0262883",
    "tt0092850",
    "tt0091269",
    "tt0199057",
    "tt0091991",
    "tt0092239",
    "tt0092117"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.887Z"
}