{
  "movieId": "tt0284717",
  "title": "The Crusaders",
  "year": 2001,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=anED_UF2fj8",
      "id": "anED_UF2fj8",
      "title": "The Crusaders | Full Movie | Epic Drama Adventure | Complete Mini-Series",
      "description": "*The Crusaders* - Towards the end of the 11th century, three friends - bell founder Peter, baron's son Richard and shepherd Andrew - set off to join The Crusades, after watching soldiers returning from Jerusalem. Facing the horrors of war in search of answers and a new way of life, the three young men experience friendships, love and adventure in the midst an incredible undertaking that can never be called Holy.\n2001. Stars: Alessandro Gassmann, Barbora Bobulova, Thure Riefenstein, Armin Mueller-Stahl\n*Licensed from Bruder Releasing Inc. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#biblestories  #MovieCentral #goodfriday",
      "addedAt": "2025-12-27T00:03:40.318Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/anED_UF2fj8/maxresdefault.webp",
      "duration": 11886,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AS",
          "AU",
          "CA",
          "CC",
          "CK",
          "CX",
          "FJ",
          "FM",
          "GF",
          "GU",
          "ID",
          "KI",
          "MH",
          "MP",
          "NC",
          "NF",
          "NR",
          "NU",
          "NZ",
          "PF",
          "PG",
          "PH",
          "PN",
          "PW",
          "SB",
          "TK",
          "TV",
          "US",
          "VU",
          "WF",
          "WS"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "194 min",
    "imdbRating": 5.6,
    "imdbVotes": 595,
    "Genre": "Adventure, Drama",
    "Plot": "Towards the end of the eleventh century, Pope Urban II announces a crusade against the Saracens, who have occupied the holy city of Jerusalem. Three young friends # Richard, Peter and Andrew # set off to join the crusading army. The three friends come from very different backgrounds: Andrew is a shepherd; Peter is a poor bell founder, and the illegitimate son of a Christian woman and a Saracen man; and Richard is the deeply religious son of Baron William of Aurocastro, who was murdered by his rival brother Corrado. The violent methods used by the crusaders soon cause the three friends to fall out with each other, and after a bloody attack on a Jewish monastery, they go their separate ways: Andrew remains with the crusaders, while Peter and Richard accompany the attractive Jewess Rachel # whose teacher, a rabbi, was killed in the raid # to Jerusalem. Andrew is very reluctant to see Rachel go, having # like Peter # fallen in love with her at first sight. In Jerusalem the situation is very tense: the Saracen governor is having the Christians expelled from the city, out of fear of crusader spies. Peter, Richard and Rachel manage to trick their way into the city, but shortly afterwards Richard is arrested. When the crusaders, with Andrew at their head, arrive at the gates of Jerusalem, the former friends now face each other as enemies # because to save Richard, Peter has joined the side of the Saracens. The city cannot withstand the onslaught of the crusaders and their fierce fighting spirit, and soon falls into Christian hands. Peter prepares an escape route for himself and Richard. Rachel has decided to stay with Andrew, however, who has also confessed his love to her. Peter and Richard return to their homeland. Richard, already seriously ill, dies on arrival. Peter marries his childhood sweetheart Maria and works as a bell founder again. Years later he meets Rachel and Andrew again. Andrew is now the feudal baron of Aurocastro. He has built an enormous cathedral # and wants Peter to make the bells for it....",
    "Director": "Dominique Othenin-Girard",
    "Writer": "Andrea Porporati",
    "Actors": "Alessandro Gassmann, Johannes Brandrup, Thure Riefenstein",
    "Language": "English",
    "Country": "Italy, Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0237534",
    "tt0326450",
    "tt0164085",
    "tt0339236",
    "tt0318281",
    "tt0377062",
    "tt0374248",
    "tt0349889",
    "tt0117496",
    "tt0410162",
    "tt0388377",
    "tt0437803"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:10:09.445Z"
}