{
  "imdbId": "tt0210599",
  "title": "Canned Harmony",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/CannedHarmony",
      "id": "CannedHarmony",
      "title": "Canned Harmony",
      "description": "Canned Harmony (1912) is directed by Alice Gay Blache who was the first woman director and the first persons to direct a fiction film in 1896. She also co-owned with her husband one of the first film studios, where she posted a sign reading \"ACT NATURALLY\" She also directed \"Algie the Miner\" which is found elsewhere in the Archive.",
      "fileSize": 298441081,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/CannedHarmony",
      "collection": "feature_films",
      "downloads": 3653
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-canned-harmony",
      "id": "silent-canned-harmony",
      "title": "Canned Harmony",
      "fileSize": 342313504,
      "addedAt": "2026-01-07T00:10:59.115Z",
      "thumbnail": "https://archive.org/services/img/silent-canned-harmony",
      "language": "English",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 354
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "12 min",
    "imdbRating": 5.7,
    "imdbVotes": 263,
    "Genre": "Comedy, Short",
    "Plot": "Evelyn brings Jack, her sweetheart, to her father's studio and introduces Jack to the musical professor. The professor, long having cherished the plan to unite his daughter with celebrated musician, dissents to the match. Although the father objects, the pair meet clandestinely and have considerable trouble in keeping out of the old man's reach. One day the father finds them together and he makes it plain in a forcible way that Jack is not wanted around the house. Jack goes home in a rather surly mood. He enters his room and finds his roommate, Dick, playing on his violin, imitating a phonograph. He takes his roommate into his confidence and Dick then proposes a plan. He urges Jack to disguise himself as Signor Tremelo and as that famous musician, pay his respects to the girl's father. At the same time they will take a phonograph to Evelyn's home and when the Signor begins to give a private concert on his violin, she sets off the phonograph. Evelyn approves of the plan. With the aid of a friendly newspaper man, the plan works out beautifully. When the Signor offers his hand the old professor gives his consent, he finds out the joke only after everything is over with.",
    "Director": "Alice Guy",
    "Writer": "N/A",
    "Actors": "Billy Quirk, Blanche Cornwall, Lee Beggs",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0256909",
    "tt1289621",
    "tt0002983",
    "tt1389556",
    "tt0210835",
    "tt0210675",
    "tt0004413",
    "tt0003876",
    "tt0215495",
    "tt0759516",
    "tt0000288",
    "tt1649427"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}