{
  "imdbId": "tt0234953",
  "title": "An Unsullied Shield",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-an-unsullied-shield",
      "id": "silent-an-unsullied-shield",
      "title": "An Unsullied Shield",
      "fileSize": 372938481,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-an-unsullied-shield",
      "language": "English",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 245
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "17 min",
    "imdbRating": 5.1,
    "imdbVotes": 97,
    "Genre": "Drama, Short",
    "Plot": "His Grace, the Duke of Rutland, is dying and his family consisting of his wife and his only son are at his bedside. He admonishes his son to live up to the best traditions of his ancestors and the boy swears to he a worthy son of a worthy sire and takes his mother in his arms, indicating that he will he henceforth her refuge, whereupon the old duke passes away happily contented. We later see the Duke in a Monte Carlo Casino; he loses to such an extent that he is wiped out and can only continue playing on I.O.U's. Upon returning to London he borrows money from a notorious money lender whom he promises to pay back in thirty days. He forgets about the obligation, but a month later he is forcibly reminded of it by the money lender who threatens to expose him. He promises to settle the following day. Afraid of exposure he forges his mother's name to a check. Later sitting in front of several great paintings of his ancestors, conspicuous among which is a shield, he falls asleep and in his dream he recklessly crashes a glass of liquor against the escutcheon. One by one we see the gentlemen of the pictures leave their frames, advance toward the sleeping Duke and in an intensely dramatic scene each describes how he fought for the name which he bears. The Duke is still asleep and slowly along the gallery is seen to approach his mother. She moves to his side and tenderly awakes him. He starts suddenly, looks around the room, sees the paintings, the shield, his mother and is utterly bewildered. Suddenly he recoils and quickly crossing to the wall, takes the shield down and closely examines it. He finds it unsullied. Reverently raising it to his lips he kisses it. He looks toward his mother and taking the checkbook from his pocket shows her the forged name. She is greatly affected but coming to a decision destroys the check. He falls on his knees in deep contrition but she gently raises him up and going to the table signs a blank check and presents it to him. After reading it he turns to the paintings of his ancestors and indicates that he will he true to the trust and leave no blot upon his escutcheon.",
    "Director": "Charles Brabin",
    "Writer": "Charles Brabin",
    "Actors": "Wadsworth Harris, Marc McDermott, Margery Bonney Erskine",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002621",
    "tt0132221",
    "tt0405424",
    "tt0002421",
    "tt0005047",
    "tt0005955",
    "tt0002784",
    "tt0002795",
    "tt0002910",
    "tt0003075",
    "tt0003497",
    "tt0003516"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}