{
  "imdbId": "tt0245767",
  "title": "Big Moments from Little Pictures",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-big-moments-from-little-pictures",
      "id": "silent-big-moments-from-little-pictures",
      "title": "Big Moments from Little Pictures",
      "fileSize": 332861524,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-big-moments-from-little-pictures",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 421
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "20 min",
    "imdbRating": 6.4,
    "imdbVotes": 82,
    "Genre": "Comedy, Short",
    "Plot": "Will Rogers made a number of silent two-reel comedies for the Hal Roach Studio during the 1923-4 season, but apparently he didn't think much of them; he was later quoted as complaining to a friend that \"all I do is run around barns and lose my pants.\" It wasn't until talkies came along that Will found his true métier in a series of domestic comedies at Fox: naturalistic, gentle slices of Americana that eschewed slapstick.But from posterity's vantage point, several of Will's Roach comedies hold up pretty well. In two of them Rogers hit the bullseye by aiming at Hollywood itself: Uncensored Movies (1923) and its follow-up, Big Moments from Little Pictures. Instead of trying to invent a role to play, Will simply dressed up as his famous contemporaries and poked fun at them. In this second installment he takes on Rudolph Valentino's bull-fighting epic Blood and Sand, Douglas Fairbanks' Robin Hood, weepy melodramas, and the Keystone comedies of the 1910s that were already somewhat passé by this time. In the Valentino sequence Will contrasts the matador's on-screen bravery with his off-screen concern for his personal safety, and the results are mildly amusing. The melodrama send-up is basically a one-joke sketch that doesn't add up to much, but the Fairbanks sequence is quite funny, making creative use of such cinematic techniques as slow-motion and footage run backward to make Robin and his Merry Men look ridiculous. Best of all is the Keystone segment, which looks and plays very much like the real article. Will gives a lively performance as Police Chief Ford Sterling and earns some real belly-laughs. Will's spot-on impersonation of Sterling is so accurate that some unwary viewers might be believe they're watching the real thing. This sequence brings the film to a rousing climax and demonstrates that, whatever he told his friends, Will Rogers managed to do some quality work at the Hal Roach Studio.",
    "Director": "Roy Clements",
    "Writer": "H.M. Walker",
    "Actors": "Will Rogers, Marie Mosquini, Charlie Hall",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0141405",
    "tt0124857",
    "tt0015477",
    "tt0014664",
    "tt0141028",
    "tt0014992",
    "tt0015390",
    "tt0014903",
    "tt0014967",
    "tt0015096",
    "tt0014659",
    "tt0014660"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}