{
  "movieId": "tt0229309",
  "title": "The Confederate Ironclad",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-confederate-ironclad",
      "id": "silent-the-confederate-ironclad",
      "title": "The Confederate Ironclad",
      "fileSize": 370769951,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-confederate-ironclad",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 838
    }
  ],
  "metadata": {
    "Rated": "Unrated",
    "Runtime": "16 min",
    "imdbRating": 6,
    "imdbVotes": 232,
    "Genre": "Drama, War, Short",
    "Plot": "Lieutenant Yancey's southern sweetheart, Rose, is jealous of Elinor, a northern girl, who is visiting her aunt Mary de Lane. This jealousy is excited by an invitation which Yancey receives from Mary to call and meet her niece. Yancey visits the de Lane home, and while walking along the river with Elinor, he shows her where the Confederate Ironclad is being constructed. Elinor, having strong Union sympathies, reveals the location of the Ironclad to the commander of the Federal gunboats. An attack is made on the Ironclad and Yancey rides to give warning. The Confederates are temporarily helpless as their power is exhausted. Yancey, knowing that a supply of ammunition is loaded on a train in another location, prepares to bring the needed powder to his compatriots. As the train is about to leave, a Federal scouting party rides up and opens fire. Rose and Yancey jump on the engine and make a wild dash to escape with the powder. Elinor, from a distance, sees the fight and sets fire to the bridge over which the train must pass. While riding over the bridge the last car catches fire. Yancey, who has been wounded, is left in the engine cab while Rose crawls over the loaded train and succeeds in cutting off the end car just in time to escape the explosion. The powder is delivered to the Ironclad in the nick of time, and a fierce battle wages between the Confederate vessel and the Union gunboats.",
    "Director": "Kenean Buel",
    "Writer": "N/A",
    "Actors": "Guy Coombs, Anna Q. Nilsson, Hal Clements",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0234238",
    "tt0001913",
    "tt0002816",
    "tt0001680",
    "tt0001265",
    "tt0001227",
    "tt0001256",
    "tt0000895",
    "tt0002381",
    "tt0002054",
    "tt0002082",
    "tt0002098"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}