{
  "movieId": "tt0227396",
  "title": "Robert Macaire and Bertrand",
  "year": 1907,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Robert_Macaire_and_Bertrand",
      "id": "Robert_Macaire_and_Bertrand",
      "title": "Robert Macaire and Bertrand",
      "description": "The original French title is Robert Macaire et Bertrand, les rois des cambrioleurs . IMDb Page",
      "fileSize": 263714244,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/Robert_Macaire_and_Bertrand",
      "language": "English",
      "year": 1906,
      "collection": "feature_films",
      "downloads": 1727
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.8,
    "imdbVotes": 148,
    "Genre": "Short, Comedy, Crime",
    "Plot": "Two thieves, Robert Macaire and Bertrand, are eating at an outdoor restaurant, when they find themselves left alone. So, spying their chance, they make off with everything on the table. The waitress, discovering the theft, gives the alarm and four policemen begin following the thieves. Robert Macaire and Bertrand meanwhile rob a bank and steal several costumes to disguise themselves as tourists. They leave their clothes in a garden and embark onto a train, the police behind them. They get off at the station, and an attendant tells the police which way they when the police arrive. Entering a town, an earthquake hits and the thieves fly through the air. They land and the police are again on their trail. To hide themselves Macaire and Bertrand must disclose themselves in a barn. The police soon discover their abode and shoot the thieves down, but Robert Macaire and Bertrand get up and escape after the police turn their backs. And, jumping into a hot air balloon, they float away, making rude gestures to the officers of the law.",
    "Director": "Georges Méliès",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0215817",
    "tt0223702",
    "tt0135122",
    "tt0233391",
    "tt0127948",
    "tt0215575",
    "tt0000069",
    "tt0215664",
    "tt3110548",
    "tt0227434",
    "tt0224189",
    "tt0225797"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}