{
  "movieId": "tt0225797",
  "title": "The King and the Jester",
  "year": 1907,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_King_and_the_Jester",
      "id": "The_King_and_the_Jester",
      "title": "The King and the Jester",
      "description": "The original French title is François 1er et Triboulet . IMDb Page",
      "fileSize": 120276857,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_King_and_the_Jester",
      "language": "English",
      "year": 1907,
      "collection": "feature_films",
      "downloads": 2140
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "5 min",
    "imdbRating": 5.2,
    "imdbVotes": 152,
    "Genre": "Short",
    "Plot": "The scene opens with the jester being spurned by the king, who has evidently partaken of food which disagrees with him, and instead of being amused by the frolics of his jester he casts him away. All the wiles of the jester fail to raise a smile. The king petulantly throws himself into his chair of state. The jester, finding his jokes falling flat, performs acrobatic feats to no effect; juggling with balls, no result; the king won't be pleased. The jester then gathers chairs and builds them up and outward. Ah! The king is at last interested, wondering why they don't fall over, and gets down to see. The jester, taking a pair of bellows, blows the chairs and they fall in a heap at the king's feet. The jester next puts the chairs away and tickles the king, who kicks him for his frivolity; then, getting down from his chair to again kick the jester, kicks air, for the jester has vanished, quickly appearing again out of a large box and laughing at his master, who again seats himself with a frown. Finding all his efforts to please are not appreciated, the jester summons a lady to his aid. Now the king is all attention. Then taking three stools, the jester places them before the king, helps the lady to stand on the center one, pulls her dress, which falls to the ground, displaying her as a Grecian model. The king now forgets his indigestion and watches, the figure. The jester produces two staves, which he places under the outstretched hands of the model, then with a few passes hypnotizes his subject; he now takes the center stool from beneath the sleeping beauty, leaving her suspended on the two staves. After one or two more passes, he removes one of the staves, leaving the subject with only the support of the other, to the astonishment of the king, who is still more surprised when the beautiful model throws him a kiss. The jester now replaces the stool under the feet of the model, awakens her and helps her down. The king sits on the stool, takes the model in his arms and is about to kiss her, when to his intense disgust he finds himself embracing his jester, who, linking his arm in that of the king, leads him off.",
    "Director": "Georges Méliès",
    "Writer": "N/A",
    "Actors": "Georges Méliès",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0215817",
    "tt0227434",
    "tt0000575",
    "tt0215938",
    "tt0135122",
    "tt0216016",
    "tt0222785",
    "tt0228696",
    "tt0215575",
    "tt0215749",
    "tt0223702",
    "tt0227396"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}