{
  "imdbId": "tt0289127",
  "title": "Cocaine",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/MyMovie_20181112",
      "id": "MyMovie_20181112",
      "title": "\"Cocaine\" (1922)",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation       \"Cocaine\" is a British crime drama. A drug lord must deal with unintended consequences.     The film became contentious even before hitting the screens. \"Cocaine\" was banned as it was feared that it would encourage drug use. The film's message, however, is exactly the opposite. Eventually \"Cocaine\" was approved by the board of censors under the alternative and less provocative title \"While London Sleeps\". Still, it is said that this is the most controversial British film of the 1920s.   Directed by                    Graham Cutts Produced by                  Master Films Starring                         Hilda Bayley, Flora le Breton, Ward McAllister, Cyril Raymond, Tony Fraser, Teddy Arundell Release date                   May 1922 Running time                 55 minutes Country                          Great Britain Language                        Silent film, English intertitles     Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 66210715,
      "addedAt": "2026-01-07T00:06:38.753Z",
      "thumbnail": "https://archive.org/services/img/MyMovie_20181112",
      "year": 1922,
      "collection": "feature_films",
      "downloads": 7904
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6.6,
    "imdbVotes": 35,
    "Genre": "Drama",
    "Plot": "A decadent tale of drugs and the London underworld the cosseted daughter of a respectable businessman - in fact head of a cocaine racket - succumbs to the pleasures of drink and drugs. Vivid nightlife scenes recreate the interwar world of flappers and hedonists; the dapper club owner and seedy street dealers.",
    "Director": "Graham Cutts",
    "Writer": "Frank Miller",
    "Actors": "Hilda Bayley, Flora le Breton, Ward McAllister",
    "Language": "None",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0023469",
    "tt0013705",
    "tt0013134",
    "tt0013253",
    "tt0013372",
    "tt0012928",
    "tt0013402",
    "tt0013607",
    "tt0013662",
    "tt0013688",
    "tt0013704",
    "tt0013719"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.753Z"
}