{
  "imdbId": "tt0223755",
  "title": "The Monster",
  "year": 1903,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMonster1903_72",
      "title": "The Monster",
      "description": "Title: The Monster Summary: An Egyptian prince has lost his beloved wife and he has sought a dervish who dwells at the base of the sphinx. The prince promises him a vast fortune if the dervish will only give him the ... Directed by: Georges Méliès Actors: Production Company: Georges Méliès Release Date: 15 August 1903 (USA) Aspect Ratio: 1.33 : 1 An Egyptian prince has lost his beloved wife and he has sought a dervish who dwells at the base of the sphinx. The prince promises him a vast fortune if the dervish will only give him the opportunity of gazing once more upon the features of his wife. The dervish accepts the offer. He brings in from a neighboring tomb the receptacle containing the remains of the princess. He opens it and removes the skeleton, which he places upon the ground close beside him. Then, turning to the moon and raising his arms outstretched toward it, he invokes the moon to give back life to her who is no more. The skeleton begins to move about, becomes animated, and arises. The dervish puts it upon a bench and covers it with a white linen; a masque conceals its ghostly face. At a second invocation the skeleton begins again to move, arises, and performs a weird dance. In performing its contortions it partly disappears in the ground. While performing its feats it increases gradually in size, its neck assuming ...",
      "fileSize": 17443190,
      "id": "TheMonster1903_72"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "3 min",
    "imdbRating": 6.3,
    "imdbVotes": 1382,
    "Genre": "Short, Fantasy, Horror",
    "Plot": "An Egyptian prince has lost his beloved wife and he has sought a dervish who dwells at the base of the sphinx. The prince promises him a vast fortune if the dervish will only give him the opportunity of gazing once more upon the features of his wife. The dervish accepts the offer. He brings in from a neighboring tomb the receptacle containing the remains of the princess. He opens it and removes the skeleton, which he places upon the ground close beside him. Then, turning to the moon and raising his arms outstretched toward it, he invokes the moon to give back life to her who is no more. The skeleton begins to move about, becomes animated, and arises. The dervish puts it upon a bench and covers it with a white linen; a masque conceals its ghostly face. At a second invocation the skeleton begins again to move, arises, and performs a weird dance. In performing its contortions it partly disappears in the ground. While performing its feats it increases gradually in size, its neck assuming enormous proportions, much to the horror of the prince, who fails to see in this grotesque character the wife whom he has lost. The dance ceases. The dervish throws a veil over the hideous creature. Then appear the real princess as she was when her husband possessed her. The prince darts forward to take her into his arms to give her a last kiss, but the dervish stops him, wraps the young lady in the veil and throws her into the arms of the prince. When he removes the veil he finds only the skeleton of his former wife. The vision has disappeared, and the princess has returned to dust. The dervish withdraws, and the prince pursues him with his threats and curses.",
    "Director": "Georges Méliès",
    "Writer": "N/A",
    "Actors": "Georges Méliès",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0135180",
      "title": "The Infernal Cauldron",
      "year": 1903,
      "imdbRating": 6.6,
      "imdbVotes": 2415,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0223291",
      "title": "The Mystical Flame",
      "year": 1903,
      "imdbRating": 5.1,
      "imdbVotes": 192,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000465",
      "title": "The Kingdom of the Fairies",
      "year": 1903,
      "imdbRating": 7.3,
      "imdbVotes": 1724,
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0222731",
      "title": "The Fugitive Apparitions",
      "year": 1904,
      "imdbRating": 5,
      "imdbVotes": 183,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0215664",
      "title": "The Cook in Trouble",
      "year": 1904,
      "imdbRating": 6,
      "imdbVotes": 871,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0215992",
      "title": "The Mermaid",
      "year": 1904,
      "imdbRating": 6.2,
      "imdbVotes": 1349,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0135631",
      "title": "The Untamable Whiskers",
      "year": 1904,
      "imdbRating": 6.2,
      "imdbVotes": 1200,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0216419",
      "title": "The Wonderful Living Fan",
      "year": 1904,
      "imdbRating": 5.6,
      "imdbVotes": 689,
      "language": "None, French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0215575",
      "title": "The Black Imp",
      "year": 1905,
      "imdbRating": 6.9,
      "imdbVotes": 2341,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0215749",
      "title": "The Enchanted Sedan Chair",
      "year": 1905,
      "imdbRating": 5.4,
      "imdbVotes": 524,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0135122",
      "title": "The Hilarious Posters",
      "year": 1906,
      "imdbRating": 6.2,
      "imdbVotes": 1176,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0216016",
      "title": "The Mysterious Retort",
      "year": 1906,
      "imdbRating": 5.8,
      "imdbVotes": 720,
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.034Z"
}