{
  "movieId": "tt0215575",
  "title": "The Black Imp",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Black_Imp",
      "id": "The_Black_Imp",
      "title": "The Black Imp",
      "description": "The original French title is Le Diable noir . IMDb Page",
      "fileSize": 94951437,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Black_Imp",
      "language": "English",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 3312
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-black-imp-1905-directed-by-georges-melies",
      "id": "the-black-imp-1905-directed-by-georges-melies",
      "title": "The Black Imp (1905) Directed By Georges Méliès",
      "description": "The Black Imp (1905) 'Le diable noir' Directed by Georges Méliès The Black Imp (French: Le Diable noir) is a 1905 French silent trick film by Georges Méliès. It was sold by Méliès's Star Film Company and is numbered 683–685 in its catalogues Synopsis: A mischievous magic imp cavorts around inside of a hotel room, jumping from the bed to the table, and then, from the chair to an expensive couch. A respectable resident arrives escorted by the landlady and her husband, and before long, strange things begin to occur. Articles of furniture magically move from place to place, and even disappear entirely before their eyes. In the end, the mischievous imp materializes before the startled guests, causing a major emotional shock. Production: Méliès appears in the film as the distinguished hotel guest. The special effects include pyrotechnic techniques as well as many substitution splices; there are 61 substitution splices in the moving chair sequence alone. John Frazer's 1979 book-length study of Méliès, and a 1981 guide to Méliès's work from the Centre national de la cinématographie, both devote sections to The Black Imp. The compilers of the latter book report that two different versions of the film appear to exist: the copy viewed for their analysis differs from Frazer's summary in plot outline, and even in the number of chairs that are involved in the chair sequence. In an April 1979 article in Cahiers du cinéma, film director Marie-Christine Questerbert described The Black Imp as a classic example of Méliès's way of evoking disorder, creating proliferation from simple visual motifs. -From Wikipedia",
      "fileSize": 62611462,
      "addedAt": "2026-01-07T00:11:46.533Z",
      "thumbnail": "https://archive.org/services/img/the-black-imp-1905-directed-by-georges-melies",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 74
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "4 min",
    "imdbRating": 6.9,
    "imdbVotes": 2341,
    "Genre": "Short, Comedy, Fantasy",
    "Plot": "A mischievous black imp hiding in a hotel room, enjoys his privacy jumping around from the bed to the table, and then, from the chair to the priceless davenport. However, when a respectable resident arrives escorted by the landlady and her husband, before long, the furniture will begin vanishing or stacking into impossible configurations, and much to the visitor's surprise, teleport back into the room. Eventually, as the culprit manifests before the man's eyes, inevitably, pandemonium ensues. Is there a way to get rid of this nuisance?",
    "Director": "Georges Méliès",
    "Writer": "N/A",
    "Actors": "Georges Méliès",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0215664",
    "tt0135122",
    "tt0215749",
    "tt0227536",
    "tt0222731",
    "tt0215992",
    "tt0216016",
    "tt0135631",
    "tt0216419",
    "tt0215817",
    "tt0223755",
    "tt0223291"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.533Z"
}