{
  "imdbId": "tt0260221",
  "title": "Narcotics: Pit of Despair (1967)",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Narcotics",
      "id": "Narcotics",
      "title": "Narcotics",
      "description": "film",
      "fileSize": 447418746,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/Narcotics",
      "collection": "feature_films",
      "downloads": 51861
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "29 min",
    "imdbRating": 5.7,
    "imdbVotes": 321,
    "Genre": "Short, Drama",
    "Plot": "This educational film presents the hidden dangers to especially young people in what they may initially deem a harmless activity, namely the use of drugs, most specifically narcotics. The every boy in this case is student John Scott, who is your average young man in that he is a good person, but is facing what he sees as some struggles in his day-to-day life, such as failing some classes which could kick him off the school track team, and feeling misunderstood by his often neglectful parents. In preparing for exams, he has in the past taken some bennies, which has caused him no long term harm. But in running into a former classmate named Pete, John's life could be forever changed. Pete dropped out of school and unknown to John is a drug pusher. Pete sees the signs in John as a potential customer, which Pete needs to feed his own livelihood. Pete knows that if he can get John to the stage of trying the hard drugs, such as heroin, he's got a customer for life in that John will be addicted. That process involves introducing John to his social group, including party girl Helen, who is one of his regular customers. Their parties start with alcohol and marijuana which will dull the senses and thus impair the ability to make rational decisions. Although marijuana is not addictive in and of itself, it is a drug upon which users become psychologically dependent. Even if John gets hooked on narcotics and comes out the other side by whatever fashion clean and sober, he may always feel the urge, rationalizing such choices.",
    "Director": "Mel Marshall",
    "Writer": "Edward Brennan",
    "Actors": "Kevin Tighe, Gerald LeRoy, Julie Conners",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0059936",
    "tt0313018",
    "tt12658952",
    "tt0001032",
    "tt0001265",
    "tt0001431",
    "tt0002381",
    "tt1419606",
    "tt0002054",
    "tt0001150",
    "tt0000832",
    "tt0000852"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.464Z"
}