{
  "movieId": "tt0232632",
  "title": "Shiner",
  "year": 2000,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=O-jP_Zucx80",
      "id": "O-jP_Zucx80",
      "title": "Shiner | Full Drama Movie",
      "description": "**This film is under non-exclusive license from Glass House Distribution. All rights reserved**\n\nShiner - Matt sets out to live his dreams of becoming a world champion fighter. He meets Happy McBride, a washed up has-been, who takes him under his wing and introduces him to the underground world of MMA fighting. Matt fights his way to the top but then finds that love throws a stronger punch when his falls for Happy's daughter Nikki.\n\n2018\nStars: Seya Hug, Shannon Staller, Kevin Bernhardt\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:40.374Z",
      "thumbnail": "https://i.ytimg.com/vi/O-jP_Zucx80/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBEMvHf2FtjT9ZhRqFmzi13u_REPg",
      "duration": 5683,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "99 min",
    "imdbRating": 5.9,
    "imdbVotes": 2218,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "Billy Simpson is a shady boxing promoter in South London banned from legitimate fights. It's the biggest day of his life, though, because he has a champion on his hands, his twenty-year-old son, Eddie. Billy's put all of his money on a victory, as have his quarrelling daughters. But Eddie is nervous, an odd guy in a cap is hanging around, the licensed promoter Billy has hired to arrange the evening's other fights has hired dogs, the manager of Eddie's opponent looks down scornfully on Billy and on south London, and Scotland Yard wants to put Billy in jail for the death of a club brawler. When the night goes disastrously wrong, Billy tries to find out who double-crossed him.",
    "Director": "John Irvin",
    "Writer": "Scott Cherry",
    "Actors": "Michael Caine, Martin Landau, Frances Barber",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0157871",
    "tt0143127",
    "tt0310775",
    "tt0164003",
    "tt0138389",
    "tt0366598",
    "tt0339236",
    "tt0116374",
    "tt0212435",
    "tt0116260",
    "tt0204626",
    "tt2543702"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:58:18.096Z"
}