{
  "movieId": "tt0221905",
  "title": "Octopus",
  "year": 2000,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gO0hoJnaFWY",
      "id": "gO0hoJnaFWY",
      "title": "Octopus | Full Movie | Action Adventure Monster | Killer Octopus!",
      "description": "Octopus - During the Cuban missile crisis in 1962, a Russian submarine strays into American waters. On board is a nuclear cargo destined for Castro. The Americans attack and destroy the sub. 38 years later US submarine Roosevelt is in the same waters. An unknown object attacks and disables the sub with devastating force and drags the vessel to the bottom of the ocean. What lies on the ocean bed beggars belief: dozens of wrecks, among them the sub destroyed 38 years ago. Whatever was on board has fed a creature of unbelievable size and strength! The only way out is the emergency submersible and a passing cruise ship. Above or below the water, there is no escape from the monster mutant octopus with a nuclear diet...\n**Under non-exclusive license from Framerate Technologies LLC.  All rights reserved**\n2000.  Stars: Jay Harrington, Ravil Isyanov, David Beecroft\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:45:15.998Z",
      "thumbnail": "https://i.ytimg.com/vi/gO0hoJnaFWY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD6pozDFMdFWuvQMZzgTNfuph9gwA",
      "duration": 5962,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "100 min",
    "imdbRating": 3,
    "imdbVotes": 1864,
    "Genre": "Action, Adventure, Horror, Sci-Fi, Thriller",
    "Plot": "During the Cuban Missle Crisis, a Russian sub is sunk while en route to Havana. As the sub goes down, the hold is breached and barrels full of some mysterious substance tumble out. Years later, an American nuclear submarine is transporting a captured terrorist to the States. The terrorist's henchmen, however, are planning to hijack the sub and rescue their leader. Meanwhile, a large, unidentified creature is approaching the sub at high speed...",
    "Director": "John Eyres",
    "Writer": "Boaz Davidson (story), Michael D. Weiss (screenplay)",
    "Actors": "Jay Harrington, Ravil Isyanov, David Beecroft, Carolyn Lowery",
    "Language": "English",
    "Country": "USA, Bulgaria",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0118912",
    "tt1094162",
    "tt0426556",
    "tt1183733",
    "tt2130142",
    "tt4943934",
    "tt6874406",
    "tt0843873",
    "tt1132130",
    "tt1705773",
    "tt1075746",
    "tt0339236"
  ],
  "collections": [
    {
      "id": "monster-madness",
      "name": "Monster Madness"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:56:08.741Z"
}