{
  "imdbId": "tt0270480",
  "title": "Mad Love",
  "year": 2001,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/queenie-in-love-2001",
      "title": "Queenie In Love (2001) - Amos Kollek Film",
      "description": "Queenie In Love (2001) is another forgotten Amos Kollek gem. In terms of the conception of this film, Amos saw the side story involving Victor Argo & Valerie Geffner in his previous work Fast Food Fast Women (2000) and figured he could expand that story into a full-fledged feature. The late great Victor Argo was an actor in the New York scene but was relegated to supporting & small roles throughout his career. In this film, he showcased himself in one of the leads as the lovable Horace & he does a fine job (he also sings in the film). Valerie Geffner does a good job as the titular Queenie, a mischievous character who's trying to figure out what she wants to do with her life. It's a shame she didn't do many movies after this because I thought she was wonderful in the film. Kollek regulars: Louise Lasser & Mark Margolis played an old couple trying to rejuvenate their marriage, but at the same time have an S/M business on the sideline. And Austin Pendleton played Argo's horny therapist, who sports a Kramer hairdo —probably the funniest character in the film. The movie premiered at the Cannes Film Festival in 2001 and was nominated for a SACD Prize in the Directors' Fortnight category.  Argo and Geffner would collaborate again for the final time in the short film Angela (2002), which is lost media; you can see a clip in Valerie's demo reel on YouTube. Argo would collaborate with Amos Kollek three more times in the feature Bridget (2002) & two shorts, Angela (2002) as mentioned earlier & Music (2003), before his passing in 2004. As for Geffner, she still resides in New York and works as a performance coach. Interesting factoids about Quennie: -Victor Argo starred in five other films in 2001, albeit in smaller roles ( Angel Eyes , Don't Say A Word , Double Whammy , 'RXmas & The Man Who Knew Belle Starr ). -Some of the cast members from this film would go on to do Bridget (2002): Victor Argo, Mark Margolis, David Wike, & Neal Jones. -Irma St. Paule appeared in this film; she appeared in Kollek's previous feature Fast Food Fast Women (2000). -One of Kollek's daughters, Abigail Kollek, appeared in the film as one of the kids in the playground; she's credited as Avigayeel Kollek. -Kris Carr, the actress who played Queenie's best friend Tzocki, was diagnosed with a rare Stage IV cancer called epithelioid hemangioendothelioma affecting her liver and her lungs. She transformed that experience into a wellness movement and founded the Inner Circle Wellness, which promotes the alkaline diet to reduce cancer risk. She later became a New York Times best-selling author of Crazy Sexy Diet , Crazy Sexy Kitchen , Crazy Sexy Juice , & others. She also directed a documentary, appeared on Oprah & has a podcast. Quite a transition lol. -The paintings in Austin Pendleton's office were done by Maria Farmer; she even gets a thank you in the credits. Most people know her for her association with the infamous Jeffrey Epstein. Knowing this makes the paintings have a creepy tone. Plot Synopsis: At 24, Queenie works with troubled children and prefers the run-down buildings of Manhattan's East Village to her parents' luxurious property in Westchester. Eccentric and always ready to play games in life, Queenie also tries, unsuccessfully, to pursue a career as an actress. Horace, a middle-aged ex cop, lives alone in the same neighborhood. His doctor has just told him that he only has a few months to live. That's when Horace meets Queenie, who, like a tornado, turns his life upside down. The film is subtitled in French. The non-profit streaming of the commercial free, quality films I have very much enjoyed and therefore uploaded to archive.org, are for educational purposes. I have uploaded each movie for posterity, with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film, nor to any other I have uploaded, and I receive nothing for the uploads nor for the information I put with those uploads. Although I do receive great joy from sharing these uploads with you, I have no wish to infringe on any existing copyright laws.",
      "id": "queenie-in-love-2001"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "115 min",
    "imdbRating": "6.5",
    "imdbVotes": "4,091",
    "Genre": "Biography, Drama, History",
    "Plot": "Juana is married off by her pious parents, the Catholic kings Ferndinand of Aragon and Isabella of Castille, to ally Spain, united by their marriage, to the Burgundian and other Habsburg heritage of archduke Maximilian's son Philip. When they meet, it's love at first sight, for her all-consuming, for him one of many happy bed partnerships as she later discovers. Deaths in her family soon make Juana Isabella's heir, but Ferdinand suggests she inherited her grandmother's madness and supports Philip's ambition to rule instead, which becomes the stakes of political maneuvering in the Cortes (nobility-dominated parliament). Combined with Philip's incurable infidelity, which includes a Moorish whore-princess, multiple drama is inevitable, and worse follows.",
    "Director": "Vicente Aranda",
    "Writer": "Vicente Aranda, Antonio Larreta, Manuel Tamayo y Baus",
    "Actors": "Pilar López de Ayala, Daniele Liotti, Rosana Pastor",
    "Language": "Spanish",
    "Country": "Spain, Italy, Portugal, France",
    "Awards": "14 wins & 12 nominations"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0266425",
      "title": "Conspiracy",
      "year": 2001,
      "imdbRating": "7.6",
      "imdbVotes": "28,545",
      "language": "English, German, Latin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1441953",
      "title": "Testament of Youth",
      "year": 2014,
      "imdbRating": "7.2",
      "imdbVotes": "31,170",
      "language": "English, German",
      "sourceType": "youtube",
      "channelName": "Moviedome"
    },
    {
      "imdbId": "tt0045473",
      "title": "Admiral Ushakov",
      "year": 1953,
      "imdbRating": "7.3",
      "imdbVotes": "224",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0060107",
      "title": "Andrei Rublev",
      "year": 1966,
      "imdbRating": "8.0",
      "imdbVotes": "58,379",
      "language": "Russian, Italian, Tatar",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt0086891",
      "title": "Anatomy of an Illness",
      "year": 1984,
      "imdbRating": "6.4",
      "imdbVotes": "116",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0024966",
      "title": "Chapaev",
      "year": 1934,
      "imdbRating": "7.0",
      "imdbVotes": "1,461",
      "language": "Russian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0033451",
      "title": "Carl Peters",
      "year": 1941,
      "imdbRating": "5.7",
      "imdbVotes": "64",
      "language": "German, English, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt9071322",
      "title": "Dark Waters",
      "year": 2019,
      "imdbRating": "7.6",
      "imdbVotes": "118,173",
      "language": "English, Korean",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0007801",
      "title": "Cleopatra",
      "year": 1917,
      "imdbRating": "6.6",
      "imdbVotes": "413",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0053800",
      "title": "Esther and the King",
      "year": 1960,
      "imdbRating": "5.5",
      "imdbVotes": "883",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0041437",
      "title": "Guilty of Treason",
      "year": 1950,
      "imdbRating": "6.1",
      "imdbVotes": "257",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt5029668",
      "title": "Paula",
      "year": 2016,
      "imdbRating": "6.4",
      "imdbVotes": "870",
      "language": "German, French",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T15:34:43.456Z"
}