{
  "imdbId": "tt0228040",
  "title": "Ice Queen",
  "year": 2005,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nceo6n91iGk",
      "id": "nceo6n91iGk",
      "title": "Ice Queen | Full Fantasy Horror Movie",
      "description": "**This film is under non-exclusive license from  Artistview Entertainment. All rights received***\n\nIce Queen - A plane carrying a frozen creature crashes into a ski resort causing an avalanche and trapping the guests. It's a fight for survival as the awakened creature goes on a bloody rampage through the lodge.\n\n2005\nStars: Ami Chorlton, Harmon Walsh, Noelle Reno \n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:25.789Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/nceo6n91iGk/maxresdefault.webp",
      "duration": 5508,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "ID",
          "JP",
          "NZ",
          "PH",
          "US",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "92 min",
    "imdbRating": 3,
    "imdbVotes": 668,
    "Genre": "Action, Fantasy, Horror, Sci-Fi, Thriller",
    "Plot": "While transporting a unique female species from the Pleistocene Age, a.k.a. Ice Age, a military convoy is attacked and the sample is abducted. The creature called \"Ice Queen\" should be conserved in cryogenic state, otherwise she would wake-up very aggressively, but the apparatus in the plane where Dr. Goddard airborne the species has a problem, the creature is warmed, awakes and kills the mercenary pilot. The airplane crashes and slides with the snow avalanche that was provoked in the mountains, falling over and burying a resort, trapping a group of survivors with the Ice Queen inside. The species kills some of them, while Johnny, his girlfriend Tori and Elaine have to find a means of escape to save their lives.",
    "Director": "Neil Kinsella",
    "Writer": "Peter Beckwith, Neil Kinsella, David R. Williams",
    "Actors": "Ami Chorlton, Harmon Walsh, Noelle Reno, Jennifer Hill",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0843873",
    "tt1132130",
    "tt0426556",
    "tt1094162",
    "tt1075746",
    "tt0489018",
    "tt1183733",
    "tt6724510",
    "tt1353997",
    "tt2175184",
    "tt0221905",
    "tt0118912"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:21:31.745Z"
}