{
  "movieId": "tt0237534",
  "title": "Brotherhood of the Wolf",
  "year": 2001,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/brotherhood-of-the-wolf",
      "id": "brotherhood-of-the-wolf",
      "title": "Brotherhood Of The Wolf (2001)",
      "description": "Brotherhood of the Wolf is a 2001 French period action horror film directed by Christophe Gans, co-written by Gans and Stéphane Cabel, and starring Samuel Le Bihan, Mark Dacascos, Émilie Dequenne, Monica Bellucci and Vincent Cassel. The story takes place in 18th-century France, where the Chevalier de Fronsac and Mani of the Iroquois tribe are sent to investigate the mysterious slaughter of hundreds by an unknown creature in the county of Gévaudan.",
      "fileSize": 3887270048,
      "addedAt": "2026-01-07T00:07:45.164Z",
      "thumbnail": "https://archive.org/services/img/brotherhood-of-the-wolf",
      "language": "English",
      "year": 2001,
      "collection": "feature_films",
      "downloads": 262
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "142 min",
    "imdbRating": 7,
    "imdbVotes": 75641,
    "Genre": "Action, Adventure, Drama",
    "Plot": "In 1764 something was stalking the mountains of central France. A 'beast' that pounced on humans and animals with terrible ferocity. Indeed they beast became so notorious that the King of France dispatched envoys to find out what was happening and to kill the creature. By the end, the Beast of Gevaudan had killed over 100 people.To this day, no one is entirely sure what it was, a wolf? a hyena? or something supernatural? The Beast is a popular myth in France, albeit one rooted firmly in reality; somewhat surprisingly it is little known to the outside world, and perhaps incredibly it has never been made into a movie. Until now. Based on the true story of the Beast of the Gevaudan that terrorized France in the eighteenth century, the movie aims to tell first and explain afterwards. In the first part, a special envoy of the King of France, altogether biologist, explorer and philosopher, arrives in the Gevaudan region, in the mountainous central part of France. The Beast has been attacking women and children for months and nobody has been able to harm it or even take a good look at it. In the second part, our hero Chevalier de Fronsac will not only have to fight the Beast, but also ignorance, bigotry and conspiracy and will rely on two women, one an aristocrat, the other a prostitute, as well as the enigmatic Mani, an Iroquois he met in New-France (Canada).",
    "Director": "Christophe Gans",
    "Writer": "Stéphane Cabel, Christophe Gans, Canal Plus Ecriture",
    "Actors": "Samuel Le Bihan, Mark Dacascos, Jérémie Renier",
    "Language": "French, German, Italian",
    "Country": "France",
    "Awards": "4 wins & 22 nominations total"
  },
  "relatedMovies": [
    "tt0326450",
    "tt0339236",
    "tt0318281",
    "tt1075746",
    "tt0377062",
    "tt0349889",
    "tt0388377",
    "tt0437803",
    "tt0072231",
    "tt0034428",
    "tt0052604",
    "tt0026223"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    },
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.164Z"
}