{
  "imdbId": "tt0208230",
  "title": "L'intruse",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-lintruse",
      "id": "silent-lintruse",
      "title": "L'intruse",
      "fileSize": 516804180,
      "addedAt": "2026-01-07T00:11:07.408Z",
      "thumbnail": "https://archive.org/services/img/silent-lintruse",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 294
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "37 min",
    "imdbRating": 5.1,
    "imdbVotes": 20,
    "Genre": "Short",
    "Plot": "A dying man writes his parents, begging their pardon for whatever he did that forced his exile to New York. He asks that they succor his wife and child. Only his mother survives, and his plea succeeds, because we see her and the child on board a ship headed to their new home. However, they fall in with bad shipboard companions. Soon the mother is their prisoner and the child has escaped and is selling flowers on the street for a mean old couple, while a member of the gang masquerades in grandmother's house as her son's widow.It's an affecting movie, if overly sentimental for my taste, and everything will be solved by the efficient and honest police. Clearly Gaumont and director Louis Feuillade were aiming this 4-reel feature at the middle class! It's particularly notable for not having a single title; that may have been the original intention, or perhaps the titles werelost somewhere before the print I looked at was uploaded. It could have used a few, but the story was clearly enough told by the pantomime.",
    "Director": "Louis Feuillade",
    "Writer": "N/A",
    "Actors": "René Navarre, Renée Carl, Louis Leubas",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0208195",
    "tt0209437",
    "tt0208496",
    "tt0207954",
    "tt0208372",
    "tt0002844",
    "tt0003165",
    "tt0209091",
    "tt0003952",
    "tt0208378",
    "tt0209007",
    "tt0759500"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.408Z"
}