{
  "imdbId": "tt0287952",
  "title": "Cainà",
  "year": 1922,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-cain",
      "id": "silent-cain",
      "title": "Cainà",
      "fileSize": 937960451,
      "addedAt": "2026-01-07T00:10:59.115Z",
      "thumbnail": "https://archive.org/services/img/silent-cain",
      "language": "Italian",
      "year": 1923,
      "collection": "feature_films",
      "downloads": 292
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "50 min",
    "imdbRating": 6.4,
    "imdbVotes": 44,
    "Genre": "Adventure, Drama",
    "Plot": "Frau Cainá is a young peasant who lives in a small village in Sardinia together with her goats and parents. She is a wild and free spirit and unconventional for any small and closed communities dominated by old rules.Cainà yearns to escape from such a closed atmosphere and the isolated island, so, as an old tune says: \"Somewhere beyond the sea, somewhere, waiting for me?\"; When a boat arrives to the island, she will do her best to flee away from her little oppressing village and experience new adventures in the continent with the help of the boat captain.\"Cainà: La Figlia Dell'isola\" (1922) was directed by Herr Gennaro Righelli. The film starred Frau Maria Jacobini who during these old days was romantically involved with the Italian director whom some years later she would marry.Herr Righelli's silent films are especially interesting for this Herr Graf for its unusual modernity and original artistic proposals. This time in \"Cainà?\" Herr Righelli directed a traditionalist film only in appearance. That's because a core element of the picture is a disturbing drama settled in old Sardinia.In addition to Herr Righelli's always interesting film stories, they contain an evolved film narrative in which technical resources match the story perfectly.For example, in the boat sequences there are striking overhead shots and others from different angles. Not to be forgotten also are the close-ups of the inhabitants of the small village and their ancient traditions and way of life. These are ethnographical images that reflect well the peculiar idiosyncrasies of the typical islander. And last but not least, there are the rugged Sardinia landscapes which are an important and decisive main character itself. They contrast with the sunny views of the continent that finally makes Frau Cainà blind.So in \"Cainà?\" Herr Righelli creates different layers and film styles in the same film: traditionalism, ethnography and drama. These are diverse artistic achievements that the Italian director accomplishes thanks to his skillful use of the technique and film narrative. Everything is at the service of an obscure story in which nothing can be taken or granted. We will discover that the small village is crowded with vengeful people, that the captain and the continent is not such a promising adventure. Thus, consequently, Frau Cainà's shattered dreams will end up in a tragedy, in the Sardinia style natürlich!.And now, if you'll allow me, I must temporarily take my leave because this German Count must isolate from the aristocratic world in his private island.Herr Graf Ferdinand Von Galitzien",
    "Director": "Gennaro Righelli",
    "Writer": "Maria Jacobini, Adriano Piacitelli, Gennaro Righelli",
    "Actors": "Maria Jacobini, Carlo Benetti, Ida Carloni Talli",
    "Language": "None, Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0013719",
    "tt0014112",
    "tt0133813",
    "tt0012657",
    "tt0012675",
    "tt0014321",
    "tt0130218",
    "tt0014496",
    "tt0014770",
    "tt0011387",
    "tt0197903",
    "tt0014646"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}