{
  "imdbId": "tt0200775",
  "title": "Kilómetro 111",
  "year": 1938,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kilometro-111-1938_202411",
      "id": "kilometro-111-1938_202411",
      "title": "Kilometro 111 (1938)",
      "description": "Kilómetro 111  es una película  argentina  en blanco y negro dirigida por  Mario Soffici  con guion de  Enrique Amorim ,  Carlos A. Olivari  y  Sixto Pondal Ríos  que fue estrenada el 31 de agosto de 1938 y cuyos principales intérpretes fueron  Pepe Arias ,  Ángel Magaña ,  Delia Garcés ,  José Olarra ,  Miguel Gómez Bao . En una encuesta de las  100 mejores películas del cine argentino  llevada a cabo por el  Museo del Cine Pablo Ducrós Hicken  en el año 2000, la película alcanzó el puesto 33. 1 ​(Wikipedia) Sinopsis El filme se inscribe en el género dramático y si bien está centrado en la crítica social también contiene elementos de la comedia y el  melodrama . El trasfondo de la narración está constituido por la confrontación de distintos sectores económicos: los agricultores se quejaban del ferrocarril (en ese momento de propiedad británica) acusándolos de dificultarles el transporte de su producción y ser cómplices de los acopiadores de granos que compraban el cereal a los productores para luego revenderlo a los exportadores e industriales) y consideraban estos últimos obtenían sin riesgo una ganancia injusta por la mera intermediación en perjuicio de los productores que disminuía lo que recibían por su trabajo. Por otra parte la construcción de nuevas y mejores carreteras que en muchos casos corrían paralelas a las vías del ferrocarril estaba alentando el transporte de carga por camión en competencia con el ferrocarril, con el efecto de abaratar costos. El guion se inclina decididamente por un punto de vista que condena el papel del intermediario y que considera que los intereses del ferrocarril y por extensión los de los hombres de la ciudad, se oponen en muchos aspectos a los de los productores, esto es \"a los hombres del campo\". En la trama argumental Ceferino, el flamante jefe de la  estación de ferrocarril  de kilómetro 111 contraviene las órdenes expresas que recibió de sus superiores y les da a los productores a crédito en flete para que transporten el fruto de una cosecha que ha sido excepcionalmente buena y que en caso contrario hubieran debido vender a menor precio al acopiador ya que no contaban con el dinero para pagarlos y el banco les negaba el crédito. Como consecuencia de ello es llamado a dar explicaciones a Buenos Aires y despedido. Al regresar, encuentra que los vecinos en retribución de su ayuda le han comprado una estación de venta de combustibles o sea que tendrá una nueva ocupación vinculada al incipiente transporte automotor que es visto (por los guionistas) como una \"liberación económica\". Reparto Pepe Arias Ángel Magaña Delia Garcés José Olarra Miguel Gómez Bao Héctor Méndez Inés Edmonson Juan Bono Choly Mur Arturo Podestá Eduardo Zucchi Alberto Terrones Julio Renato Leticia Scury Héctor Ferraro Adolfo Meyer Cirilo Etulain",
      "fileSize": 1310179028,
      "addedAt": "2026-01-07T00:09:24.699Z",
      "thumbnail": "https://archive.org/services/img/kilometro-111-1938_202411",
      "language": "spa",
      "year": 1938,
      "collection": "feature_films",
      "downloads": 88
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "103 min",
    "imdbRating": 7.1,
    "imdbVotes": 69,
    "Genre": "Drama",
    "Plot": "Ceferino is the train station chief o a remote little town. A group of planters ask him to legit them some of the wagons to send the harvest to Buenos Aires, he agrees, but because of that, he is fired. At the same time, her niece runs away to Buenos Aires to be an actress, but she is deceived by a fake academy.",
    "Director": "Mario Soffici",
    "Writer": "Enrique Amorim, Carlos A. Olivari, Sixto Pondal Ríos",
    "Actors": "Pepe Arias, Delia Garcés, José Olarra",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0200726",
    "tt0176049",
    "tt0201295",
    "tt0178336",
    "tt0200468",
    "tt0200572",
    "tt0200514",
    "tt0200555",
    "tt0200715",
    "tt0200950",
    "tt0200605",
    "tt0200742"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.699Z"
}