{
  "movieId": "tt0229397",
  "title": "Forgive and Forget",
  "year": 2000,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X3xty-7kjgg",
      "id": "X3xty-7kjgg",
      "title": "Forgive And Forget | Full Urban Drama Movie | Ali Abdin | Nollywood Black Cinema",
      "description": "Forgive And Forget - In the wake of a tragic accident that claimed the life of a dear loved one, a family begins to implode. Secrets, lies, and falsehoods are uncovered as past transgressions reveal themselves. Bonds are tested as they try to come to grips with new revelations about each other.\n2015. Stars: Ali Abdin, Cameron Bedford, Shane Best\n**This film is under license from Vision Films Inc. All rights reserved**\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#nollywoodmovies  #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:54.513Z",
      "thumbnail": "https://i.ytimg.com/vi/X3xty-7kjgg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDRwYJkJX2w62EUqSQcN24ZO7WzIA",
      "duration": 6128,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "100 min",
    "imdbRating": 6.1,
    "imdbVotes": 689,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "David O'Neil, a plasterer and mature student Theo have been best mates for fourteen years and are practically inseparable. However, their friendship has become strained as Theo is about to move in with his long-term girlfriend, photographer Hannah. A raging jealousy awakes in David and he starts scheming to break up the loving couple using Hannah's insecurities against them. When the couple eventually separate David is in a quandary about his next move and is forced to confront his long-hidden homosexuality and feelings towards Theo. Eventually, David decides to reveal his sexual orientation and deep love for Theo very publicly by arranging for them both to appear as guests on Judith Adams' talk-show, \"forgive and forget\", with tragic consequences for their friendship and David's family.",
    "Director": "Aisling Walsh",
    "Writer": "Mark Burt",
    "Actors": "John Simm, Steve John Shepherd, Laura Fraser",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0303243",
    "tt0199744",
    "tt0191821",
    "tt0185125",
    "tt0296686",
    "tt0341372",
    "tt0364517",
    "tt0157053",
    "tt0118566",
    "tt0116102",
    "tt0315206",
    "tt0032599"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:58:39.897Z"
}