{
  "imdbId": "tt0235568",
  "title": "Maniac Chase",
  "year": 1904,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-maniac-chase",
      "id": "silent-maniac-chase",
      "title": "Maniac Chase",
      "fileSize": 112087641,
      "addedAt": "2026-01-07T00:11:07.409Z",
      "thumbnail": "https://archive.org/services/img/silent-maniac-chase",
      "year": 1904,
      "collection": "feature_films",
      "downloads": 273
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ManiacChase1904EdwinS.PorterUsa",
      "id": "ManiacChase1904EdwinS.PorterUsa",
      "title": "Maniac Chase (1904, Edwin S. Porter, USA)",
      "description": "The picture opens with the interior of a cell in an insane asylum. The inmate, who imagines himself to be Napoleon the Great, is seated at a table dressed in the costume of that world renowned general. A keeper enters with a bowl of soup. \"Napoleon\" tastes the soup and then dashes the contents of the bowl into the keeper's face. A fierce fight follows with \"Napoleon\" getting the better of it until two more keepers rush in and the three beat him unmercifully and leave him insensible on the floor. After the keepers leave, \"Napoleon\" gets up, smashes the table and pries off the bars of his cell with one of the table legs and escapes through the window. The second scene shows \"Napoleon\" escaping through the woods, pursued by the three keepers, and succeeding scenes following in rapid succession show the most exciting and ludicrous situations. In his flight \"Napoleon\" discovers an empty barrel, crawls into it and rolls to the bottom of the hill, and thus eludes his pursuers for a time. He next reaches a large tree. The first limbs are high above the ground, but \"Napoleon\" jumps and easily reaches one of the branches. The three keepers follow and disappear into the tree. A panoramic effect shows \"Napoleon\" descending from another tree, followed closely by the three keepers. A haystack is now reached. A tramp is sleeping at the foot with a gun beside him. \"Napoleon\" takes his gun and paces back and forth as a sentinel on guard. The keepers soon discover him and the chase continues. Finally \"Napoleon\" gets back to the asylum, climbs up to his cell window, and when the tired and worn out keepers return they are dumfounded [sic] at finding \"Napoleon\" seated at a table reading a paper. At each change of scene \"Napoleon\" stops to pose in characteristic attitude, producing a highly amusing effect. Director: Edwin S. Porter",
      "fileSize": 143992993,
      "addedAt": "2026-01-07T00:06:38.751Z",
      "thumbnail": "https://archive.org/services/img/ManiacChase1904EdwinS.PorterUsa",
      "collection": "feature_films",
      "downloads": 8375
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 5.2,
    "imdbVotes": 158,
    "Genre": "Short, Comedy",
    "Plot": "A \"madman\" escapes prison and the torments of his warders.",
    "Director": "Edwin S. Porter",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0273542",
    "tt0231758",
    "tt0477366",
    "tt0477372",
    "tt0477377",
    "tt0233391",
    "tt0228839",
    "tt0477387",
    "tt0245125",
    "tt0248890",
    "tt0231549",
    "tt0477345"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T18:16:06.689Z"
}