{
  "imdbId": "tt0200715",
  "title": "El hombre que debía una muerte",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-hombre-que-debia-una-muerte-1955",
      "id": "el-hombre-que-debia-una-muerte-1955",
      "title": "El Hombre Que Debia Una Muerte (1955)",
      "description": "El hombre que debía una muerte  es una película en blanco y negro de  Argentina , cuyo primer nombre fue  El hombre que debía un crimen  dirigida por  Mario Soffici  sobre el guion de  Sixto Pondal Ríos  y  Carlos Olivari  que se estrenó el 24 de marzo de 1955 y que tuvo como protagonistas a  Amelia Bence ,  Carlos Cores ,  Nelly Panizza  y  Domingo Sapelli . (Wikipedia) Sinopsis Una joven recibe en su casa a un desconocido que había simulado un accidente para ser atendido. Se casan y por la extraña muerte de un familiar, ella recibe una herencia. Reparto Amelia Bence  …Leonor Carlos Cores  …Héctor Rossi Nelly Panizza  …Celina Reyes Domingo Sapelli  …Roque Fontán Elvira Quiroga  …Doña Nico Héctor Méndez  … Arquitecto Carlomagno Walter Reyna  …Inspector Medina Gloria Bayardo  …Directora André Norevó  …Maurice Tito Grassi  …Dr. Ontiveros Enrique Talión  …Cadete en club Teresa Blasco  …Rosa Warly Ceriani  …Médico 1 Rafael Diserio  …Médico 2 Carmen Giménez  …Teresa Serafín Ramírez Jorge Mayo Francisco Iriarte Francisco Audenino Diego Marcote Laura Saniez  …Amante de Carlomagno Alfredo Santa Cruz Luis Schiavo Eduardo Langlais Carmen Monteleone  …Maestra",
      "fileSize": 1199415109,
      "addedAt": "2026-01-07T00:08:15.378Z",
      "thumbnail": "https://archive.org/services/img/el-hombre-que-debia-una-muerte-1955",
      "language": "spa",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 45
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 7.4,
    "imdbVotes": 30,
    "Genre": "Drama, Thriller",
    "Plot": "Surprisingly this is a good movie considering its age and the period in Argentinian film making when it was produced (1955) not exactly the best time for the national filmography (Dictatorship and church united). Believe it or not, it seems they have to fake a passionate kiss with shut mouths and still poses, like manikins in a window shop. As you can imagine, that destroys any believability to the scene (specially considering current cinema!!!).Not surprisingly we noticed the difference it makes when the script and its dialogs are sound, as they were in this case. I consider it a Film Noir Argentinian style. Suspense builds up from the very beginning and keeps mounting to a fast ending. Pity that this copy in \"You Tube\" was quite mediocre and the night time scenes were practically a black screen only understandable because of the spoken dialog.Amelia Bence was one of the few true stars of our cinema and incredibly she's still alive and over 100 years old!!! She was always considered a serious actress and quite competent, with a very beautiful voice.Carlos Cores, (Héctor in the story and its central character) was also one of the best actors as well as one of the handsomest at the time. He also had a beautiful voice.Nelly Panizza (The secretary, also available after hours for extra duties) had an important part in this story and she was quite good at it. And for some inexplicable reason I see her as a tone down version of Faye Dunaway, quite alluring really. I find this story to be a good one to be redone today, with current freedom of expression and so much better technical skills. The final shot was very impressive because it reveals a truth (disguised till that moment), that could distraught ANYONE, no matter how sturdy his/her temperament could be, because invariably it will be followed by now unanswerable questions: \"What IF... this didn't happen...\"?? \"What if... it was just another --final-- lie??\" It could make an excellent thriller!! At least it held my attention to the bitter end, which is quite a lot, believe you me.",
    "Director": "Mario Soffici",
    "Writer": "Carlos A. Olivari, Sixto Pondal Ríos",
    "Actors": "Amelia Bence, Carlos Cores, Nelly Panizza",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0200555",
    "tt0200468",
    "tt0200560",
    "tt0200605",
    "tt0200950",
    "tt0048087",
    "tt0050364",
    "tt0200742",
    "tt0200734",
    "tt0047505",
    "tt0047205",
    "tt0047296"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.378Z"
}