{
  "imdbId": "tt0233498",
  "title": "The Crime of Carelessness",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-crime-of-carelessness",
      "id": "silent-the-crime-of-carelessness",
      "title": "The Crime of Carelessness",
      "fileSize": 353502388,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-crime-of-carelessness",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 269
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "14 min",
    "imdbRating": 5.5,
    "imdbVotes": 84,
    "Genre": "Drama, Short",
    "Plot": "Mr. Waters, the owner of a large woolen mill, is careless about having the fire exits kept clear. The factory inspector listens to Mr. Waters' promise to right matters and does not report the case. Tom Watts, an employee in the mill, breaks the rule which prohibits smoking. Thus the three are to blame. Tom Watts and Hilda Fox. another employee of the mill, are lovers with the wedding only one day off Tom carelessly throws the lighted match, with which he had lit his cigarette, into a pile of rubbish in the basement of the mill. The fire started gains headway so rapidly that Tom is barely able to make his escape up the now blazing stairway. Meanwhile the smoke has penetrated to all parts of the mill; the hundreds of employees are panic stricken and rush wildly for the fire exits, only to find them locked or cluttered with heavy boxes and bales which make them impractical for use. Tom comes upon a crowd of them at one of these doors, and hastily grabbing a fire axe, cuts a way for them through a partition. Upon escaping to the street he finds that Hilda is still in the mill which is now blazing from every window. In a series of thrilling episodes Tom finds the unconscious Hilda and carries her to the street, where he acknowledges his blame in setting the mill afire. The employees nearly mob him and he is driven out of the town. His name is heralded among other mill owners and he is unable to secure work. This, added to the fact that Hilda was badly crippled in the fire, drives him to contemplating suicide from which he is prevented by the timely arrival of Hilda with a letter from Waters in which he acknowledges his own blame as well as Tom's and invites Tom to return to the new factory, both having learned a needed lesson.",
    "Director": "Harold M. Shaw",
    "Writer": "James Oppenheim",
    "Actors": "Bigelow Cooper, Mabel Trunnelle, Austin Conroy",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0214588",
    "tt0000488",
    "tt0470339",
    "tt0233246",
    "tt0002381",
    "tt0002054",
    "tt0002082",
    "tt0002098",
    "tt0002143",
    "tt0002121",
    "tt0002342",
    "tt0002400"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}