{
  "movieId": "tt0223839",
  "title": "The One Eyed Soldiers",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-one-eyed-soldiers-1967",
      "id": "the-one-eyed-soldiers-1967",
      "title": "The One Eyed Soldiers (1967)",
      "description": "Action - The body of Dr. Charles Berens, Chief of the United Nations Medical Relief Organization, is seen hurtling from the lofty parapet of an ancient church. He has chosen death rather than capitulate to his murderous pursuers. Police chief Colonel Ferrer (Andrew Faulds) arrives in time to hear the dying Berens last words: \"July the 18th! The One Eyed Soldiers.\" -  Dale Robertson, Luciana Paluzzi, Guy Deghy Watch on RetroFlix:  https://retroflix.org/the-one-eyed-soldiers-1967/",
      "fileSize": 465987102,
      "addedAt": "2026-01-07T00:12:22.155Z",
      "thumbnail": "https://archive.org/services/img/the-one-eyed-soldiers-1967",
      "language": "eng",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 97
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "81 min",
    "imdbRating": 4.3,
    "imdbVotes": 84,
    "Genre": "Action, Adventure, Crime",
    "Plot": "In Nassaum, a border town in an intrigue-infested Central European republic, the body of Dr. Charles Berens, Chief of the United Nations Medical Relief Organization, is seen hurtling from the lofty parapet of an ancient church. He has chosen death rather than capitulate to his murderous pursuers. Police chief Colonel Ferrer arrives in time to hear the dying Berens gasp\" \"July the 18th! The One Eyed Soldiers.\" Unaware he has heard the words that are the key to the location of a fabulous hidden treasure, Ferrer returns to his headquarters. The pursuit and death of Berens has been observed by The Fat Man/Harold Schmidt with more than passing interest, and begins a series of chilling events involving many people. One of them is Beren's daughter, Gava, because \"the key\" was meant to be passed to her, and another is American newspaperman Richard Owen, an innocent bystander, who gets caught up in the search and intrigue.",
    "Director": "John Ainsworth",
    "Writer": "John Ainsworth, Richard Aubrey",
    "Actors": "Dale Robertson, Luciana Paluzzi, Guy Deghy",
    "Language": "English",
    "Country": "United Kingdom, Italy, Yugoslavia, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0062630",
    "tt0026772",
    "tt0049962",
    "tt0033426",
    "tt0029952",
    "tt0173742",
    "tt0045668",
    "tt0031207",
    "tt2101341",
    "tt0021792",
    "tt0050249",
    "tt0028836"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.155Z"
}