{
  "imdbId": "tt0223459",
  "title": "His Official Appointment",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-his-official-appointment",
      "id": "silent-his-official-appointment",
      "title": "His Official Appointment",
      "fileSize": 196607107,
      "addedAt": "2026-01-07T00:10:59.119Z",
      "thumbnail": "https://archive.org/services/img/silent-his-official-appointment",
      "language": "English",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 207
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.2,
    "imdbVotes": 15,
    "Genre": "Drama, Short",
    "Plot": "Colonel Armistead, accompanied by his faithful servant Amber, travels to Washington, where the colonel has made application for an appointment in the State Department. Arriving in Washington, the colonel sets out for the State Department office. He finds little encouragement there. Time goes on until, with no money to pay rent or for food, the old man is threatened with starvation. His faithful old servant Amber, takes his fiddle to a street corner and plays, thereby collecting enough to pay the landlady. In the meantime, the clerks fake up an official appointment, and send it to the colonel. The colonel is overjoyed and on the way to the office he stops a runaway horse, ignorant of the fact that the frightened young lady in the vehicle is the daughter of the Secretary of State. She thanks him kindly and drives off. He goes on to the office and there learns of the joke played upon him. Soon after, the secretary's daughter calls at her father's office to tell him of her deliverance from certain death. There she discovers the bunch of violets which her father had that morning purchased for her, and which she had in turn, given the old gentleman who had stopped her horse. He had dropped them in the office on learning of the hoax. She coaxes her father to write her deliverer another and legitimate appointment, which the latter does. She arrives with the genuine paper, just too late. The colonel has gone to fill an appointment in the service of his Creator.",
    "Director": "Charles Kent",
    "Writer": "Catherine Carr",
    "Actors": "Charles Kent, Hal Wilson, Mrs. B.F. Clinton",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001915",
    "tt0125564",
    "tt0002381",
    "tt0002054",
    "tt0002082",
    "tt0002098",
    "tt0002143",
    "tt0002121",
    "tt0002342",
    "tt0002400",
    "tt0002408",
    "tt0002212"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.119Z"
}