{
  "imdbId": "tt0233368",
  "title": "The Borrowed Flat",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-borrowed-flat",
      "title": "The Borrowed Flat",
      "fileSize": 399670212,
      "id": "silent-the-borrowed-flat"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4,
    "imdbVotes": 29,
    "Genre": "Comedy, Short",
    "Plot": "Percy and Bobby are companions. Percy is in debt and Bobby is in love. Percy enters. Crowd outside have been hooting him. He cannot understand why until he gazes at the calendar and sees it is the first day of April. He looks and finds a \"Please Kick Me\" sign on his back. He is down and out. The janitor hands him a letter from his aunt, the contents telling him that she would not forget him in her will. Percy is overjoyed at the news, looks around the room and decides it would never do for aunt to see some of its contents. See the pictures of two women very much decolette. He decides to change them. He takes them down and reverses them. Getting a paint brush, he writes on the back of one, \"What Is Home Without an Aunt?\" And on the opposite one, \"Love Your Relations.\" Percy hears someone at the door, goes hurriedly to meet his aunt, throwing his arms around Bobby instead. Bobby wants the use of Percy's room to meet his fiancee in. Percy gives consent, and Bobby writes a note to his lady love. Percy looks at the addressed envelope, glances at the calendar and laughs. He removes the letter from the envelope and addresses another one, sending it to the washerwoman. He gives the letter to the janitor. Percy then leaves Bobby to meet his affinity alone. A rap is heard and Bobby, thinking it is his sweetheart goes to the door with arms outstretched to receive her, but is horrified to have Bridget fall into his arms, who tells him she came to marry him and shows the letter. Bobby tries to explain to her. She stumbles and falls into a trunk. Bobby closes the lid, he looks around for some place to put the trunk, an decides to throw it from the window. Bobby, vowing vengeance, goes to the table, spies letter, read it and decides he will impersonate Percy's aunt. He finds an old masquerade costume, makes a quick getaway just as Percy enters very much relieved that his aunt has not arrived. He has bought a present for her, looks as it, and it falls. He gets down on his knees and looks for it. Finally gets under the table. Percy peeps from under the table and discovers the joke that Bobby intends to perpetrate. Percy crawls from under the table and begins to disrobe. He hears someone coming and goes to the door, when, instead of the pseudo, the real aunt appears. Percy begins a decided rough house play with her. Bobby enters. Percy turns and sees him, and is astounded to see that he has been abusing his real aunt. He drops on his knees, imploring her pardon, but she refuses to listen. Bobby has removed his female wardrobe and proceeds to take the Aunt's part. He offers her his arm and starts toward the door. Percy turns to signs, tears one down and smashes it and is about to smash the other one, when the poor washwoman enters and gets it full force over her head. She falls to the floor. She holds her hands out to him imploringly and Percy seeing no way of escape, throws up his hands in despair and dives out of the window.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "J. Warren Kerrigan",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt1247273",
      "title": "Princess Charming",
      "year": 1911,
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002429",
      "title": "Petticoat Camp",
      "year": 1912,
      "imdbRating": 6.2,
      "imdbVotes": 177,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1298777",
      "title": "A Lively Affair",
      "year": 1912,
      "imdbRating": 5.1,
      "imdbVotes": 53,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0249454",
      "title": "A Race for a Monkey",
      "year": 1909,
      "imdbRating": 5.1,
      "imdbVotes": 90,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0366564",
      "title": "Her Nephews from Labrador",
      "year": 1913,
      "imdbRating": 5.1,
      "imdbVotes": 29,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1845834",
      "title": "Medium Wanted as Son-in-Law",
      "year": 1909,
      "imdbRating": 4.7,
      "imdbVotes": 8,
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0486919",
      "title": "A Tango Tangle",
      "year": 1914,
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt3110548",
      "title": "The Bad Boy's Joke at a Wedding Party",
      "year": 1907,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0234922",
      "title": "Trial Marriages",
      "year": 1907,
      "imdbRating": 5.4,
      "imdbVotes": 88,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt6373988",
      "title": "Frau Blechnudel will Kinoschauspielerin werden",
      "year": 1915,
      "imdbRating": 3.9,
      "imdbVotes": 12,
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0200500",
      "title": "The Boy, the Bust and the Bath",
      "year": 1907,
      "imdbRating": 5.3,
      "imdbVotes": 27,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0308284",
      "title": "A Frontier Flirtation; or, How the Tenderfoot Won Out",
      "year": 1903,
      "imdbRating": 4.6,
      "imdbVotes": 104,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}