{
  "imdbId": "tt0294808",
  "title": "Once Upon a Tractor",
  "year": 1965,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/once-upon-a-tractor-1965",
      "id": "once-upon-a-tractor-1965",
      "title": "Once Upon A Tractor ( 1965)",
      "description": "Habia una vez un tractor Título originalOnce Upon a TractorAño1965Duración40 min.País  ArgentinaDirección Leopoldo Torre Nilsson Guion Leopoldo Torre Nilsson .  Historia:   Arthur A. Ross Reparto  10 Jean-Pierre Aumont Actor Alan Bates Actor Diane Cilento Actriz Melvyn Douglas Actor Albert Dekker Actor John Gayford Actor Buddy Hackett Actor Clive Revill Actor Barbara Steele Actriz Frank Wolff Actor Dirección  1 Leopoldo Torre Nilsson Director Guion  2 Leopoldo Torre Nilsson Guionista Arthur A. Ross Historia Fotografía  1 Piero Portalupi Fotografía Compañías  1 Telsun Foundation Inc Productora Fotografía Piero Portalupi  (B&W) CompañíasCoproducción Argentina-Estados Unidos;  Telsun Foundation Inc Género Comedia  |  Mediometraje .  Telefilm SinopsisFilm realizado para una campaña agraria de la UNESCO. (FILMAFFINITY) Alan Bates y Diane Cilento interpretan a una extraña pareja que huye a través de países europeos ficticios con Nueva(MUBI) York y la ONU como destino",
      "fileSize": 1083814108,
      "addedAt": "2026-01-07T00:10:02.902Z",
      "thumbnail": "https://archive.org/services/img/once-upon-a-tractor-1965",
      "language": "spa",
      "year": 1965,
      "collection": "feature_films",
      "downloads": 93
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "40 min",
    "imdbRating": 6.8,
    "imdbVotes": 35,
    "Genre": "Short, Comedy",
    "Plot": "I'll append my usual \"unfairness &amp; neglected\" rant about Torre-Nilsson to the end of this review. The all-but-forgotten ONCE UPON A TRACTOR is a wonderful little propaganda piece he cranked out during his peak career period, apparently funded by the U.N.Alan Bates and Diane Cilento topline flamboyantly as an odd couple fleeing across fictitious European countries with NYC and (specifically in Bates' case) the UN as their destination.Cutesy opener has Bates as a peasant who with his fellow farmers successfully destroys their ancient tractor, so he can go to the government's agricultural board and requisition a much-needed new one. But despite the country's promise to aid farmers, he runs into Catch-22 style red tape, shuttled around heartlessly by mean bureaucrats including Barbara Steele (fun in a non-glamorous, non-horror role for a change) and a general played by Albert Dekker.With farceurs like Clive Revill entering the fray, Bates is soon deemed a dangerous spy and must flee for his life to a neighboring and equally f*cked up nation. There he's taken in tow by Cilento, a madcap millionairess fleeing in her boyfriend's Rolls Royce. Their increasingly nonsensical, fast-paced adventures satirize militarism and Cold War attitudes, finally stowing away through the kind help of airline mechanic Frank Wolff.Arriving in New York City (with some effective location photography), they're befriended by Melvyn Douglas and get to speak before a committee at the UN. Bates delivers a passionate, only slightly tongue-in-cheek tirade on behalf of refugees and anyone agitating against their own government, a topic as live today as it was five decades ago. Dekker reappears at the UN and capitulates to Bates, getting him a spanking new tractor in a happy ending when the unlikely duo of Cilento and Bates get married to boot.Even a rather portly incarnation of Buddy Hackett pops up, in a humorous comedy routine as a car dealer who happily cheats the hard-up star duo. Blessed with a sprightly Piero Piccioni score, it's a very entertaining piece of fluff wearing its message on its sleeve, clocking in at only 58 minutes.It is interesting to note the associate producer credit to Del Tenney; horror fans know him as a purveyor of truly clunky horror films, such as I EAT YOUR SKIN, but he moonlighted for the United Nations, delivering this film and a similarly all-star THE POPPY IS ALSO A FLOWER. Ah, the vagaries of show biz.Leopoldo Torre-Nilsson once ranked in every serious film buff's Top 10 of world film directors, but that was about 50 years ago. Today he is completely forgotten but I'm currently watching a dozen of his masterpieces (including re-watching my personal favorite, PAINTED LIPS, the direct forerunner of 90% of Almodovar's work) and am happy to do my small part in keeping his flame alive.",
    "Director": "Leopoldo Torre Nilsson",
    "Writer": "Arthur A. Ross, Leopoldo Torre Nilsson",
    "Actors": "Alan Bates, Diane Cilento, Melvyn Douglas",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0150678",
    "tt0059466",
    "tt26659378",
    "tt0056066",
    "tt0290100",
    "tt0411819",
    "tt0148704",
    "tt0062388",
    "tt0015477",
    "tt2459468",
    "tt12180592",
    "tt10906518"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.902Z"
}