{
  "movieId": "tt0214467",
  "title": "All on Account of a Transfer",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-all-on-account-of-a-transfer",
      "id": "silent-all-on-account-of-a-transfer",
      "title": "All on Account of a Transfer",
      "fileSize": 222217603,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-all-on-account-of-a-transfer",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 207
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "11 min",
    "imdbRating": 5.3,
    "imdbVotes": 95,
    "Genre": "Comedy, Short",
    "Plot": "In trying to explain to a big, fat German who has recently arrived in this country, how and where he is to change streetcars to get to a certain address, a conductor gives Herr Frantz Muller a transfer, telling him to follow a lady who is sitting ahead of him, to whom he has just given a transfer for the same car. Arriving at the crosstown line the lady, who is followed by Muller, discovers that she has forty minutes leeway before her transfer expires, and decides to do a little shopping. Muller follows her everywhere. She becomes suspicious of him and tries to evade him by rushing into a busy bargain store, but Muller sticks to her trail like Old Sleuth, the detective, never losing sight of her for a moment. At the shirtwaist counter, where great reductions are offered, the persistent Muller creates a sensation among the shoppers when the lady he is following screams for help and has him arrested. At the police station Muller tries to explain in his own tongue, but the Irish sergeant cannot understand him and is about to confine him to a cell when the lady, upon learning Muller's motive in following her so persistently, withdraws her charge, and understanding German, acts as his interpreter, has him excused and also volunteers to direct him to the proper car. Now they understand each other they become good friends, and the last seen of them is on a crosstown car with Cupid on the job.",
    "Director": "C.J. Williams",
    "Writer": "Henry Otto",
    "Actors": "Frank A. Lyons, Ida Williams, William Bechtel",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0234694",
    "tt0002532",
    "tt0421917",
    "tt0003177",
    "tt0003417",
    "tt0002663",
    "tt0002755",
    "tt0002851",
    "tt0002956",
    "tt0003104",
    "tt0003106",
    "tt1289621"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}