{
  "imdbId": "tt0229549",
  "title": "Makers of Melody",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/makers-of-melody_1929",
      "id": "makers-of-melody_1929",
      "title": "Makers of Melody",
      "fileSize": 895493845,
      "addedAt": "2026-01-07T00:09:46.424Z",
      "thumbnail": "https://archive.org/services/img/makers-of-melody_1929",
      "language": "English",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 134
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "18 min",
    "imdbRating": 6.7,
    "imdbVotes": 36,
    "Genre": "Short, Music",
    "Plot": "The songwriting team of Richard Rodgers and Lorenz Hart always had a touch of self-deprecation in their humour and in Hart's witty lyrics. I savour the gag appearance that they made on-screen in 'Hallelujah, I'm a Tramp', a film musical for which they wrote the songs: Rodgers and Hart appear briefly as two bank clerks, attempting to cash a cheque for $10. (Both men were earning millions at the time.) In hindsight, we know that things weren't so happy. Hart was a deeply neurotic man with a strong self-loathing and a severe drinking problem. Rodgers's alcoholism was less obtrusive than Hart's (it didn't affect his work as much), but he suffered from lifelong bouts of depression and phobias.Here, they star in a musical short which manages to suggest that the songwriting life is not all peaches and cream. We see Dick and Larry at a piano, in a cluttered area which is allegedly backstage at a Broadway theatre, but which looks suspiciously like a dressed set at Paramount's studio in Astoria, Queens. An actor pretending to be a stage manager arrives, escorting an actress in a cloche hat and stole, whom he introduces as 'Miss Merrill', a reporter for 'United Syndicate'. She's writing an article about the songsters, and wants to get some background. Rodgers nervously entreats her not to ask them 'Which comes first, the words or the music.' (About 30 years later, when Rodgers was teamed with Oscar Hammerstein, he served a stint of jury duty ... and the judge asked him precisely this question. As far as Rodgers was concerned, the music came first when he was writing with Hart, but second when he was writing with Hammerstein.)Miss Merrill wants to know how the lads got the ideas for some of their songs, so Dick and Larry proceed to offer some examples. Here, the film cuts to a series of flashbacks which are allegedly true incidents from Rodgers and Hart's scuffling days: the flashbacks are blatantly phony, but are still very enjoyable. In each flashback, somebody makes a casual remark which ostensibly inspires Dick and Larry to crank out their latest hit song.The ditties chosen here are 'The Girl Friend', 'The Blue Room' (one of my personal favourites), 'Here in My Arms' and one of the most famous Rodgers &amp; Hart songs of them all: 'Manhattan'. Each song's flashback culminates in a performance of the song by various warblers. Among the performers here are Ruth Tester, Kathryn Reece, Allan Gould, Robert Cloy and Inez Courtney. I found the latter especially unpleasant: her voice is off-key, and she's unattractive with it.'Makers of Melody' will delight any aficionados of Tin Pan Alley and the golden age of American songwriting. Both Rodgers and Hart show real presence as movie actors, although the dwarfish Hart is clearly self-conscious about his unattractive appearance. I'll rate this pleasant time-passer 7 out of 10.",
    "Director": "S. Jay Kaufman",
    "Writer": "N/A",
    "Actors": "Richard Rodgers, Lorenz Hart, Robert Cloy",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1503085",
    "tt0017896",
    "tt1706294",
    "tt1698474",
    "tt0019701",
    "tt1698489",
    "tt1492912",
    "tt1698547",
    "tt1894519",
    "tt1706463",
    "tt0020306",
    "tt1245760"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:46.424Z"
}