{
  "movieId": "tt0233246",
  "title": "At Bear Track Gulch",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-at-bear-track-gulch",
      "id": "silent-at-bear-track-gulch",
      "title": "At Bear Track Gulch",
      "fileSize": 348948160,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-at-bear-track-gulch",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 248
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "14 min",
    "imdbRating": 5.2,
    "imdbVotes": 97,
    "Genre": "Short, Comedy, Western",
    "Plot": "Alice Loraine, a young Eastern school teacher takes her father to a little western mining camp recommended by her physician, in the hope of saving or at least prolonging his life. The physician provides her with a letter to an old friend in the camp so \"the boys\" of Bear Track Gulch give them a real western welcome. Alice is the first woman to ever alight from the stage at the Gulch and her personal charms and devotion to her invalid father soon win the admiration of every man in the camp. The change of air failing to benefit her father, Alice is soon left alone and to add to her misfortune she gets a letter telling her that the bank in which she had deposited her meager savings in the east, has failed. The boys learn of this and start to raise money for her by subscription but old Pete Griffin realizes the danger of wounding her by this method. They decide that Bear Track Gulch is an illiterate camp and that it needs a school. Of course a school requires a teacher and none but Alice would do. Thus is Alice put on a living wage, at least. Jack Turner, one of Alice's pupils, is deeply smitten with her but his bashfulness prevents an avowal of his love. One day he finds her crying over and kissing the photograph of a young man and decides that she has left a sweetheart in the east. He tells the boys that she must be sent back and keeps his own feelings in the background. Under his leadership they steal over to Alice's little claim at night and \"salt\" a mine at her very door. The following morning the \"school committee\" calls under pretext of business and apparently accidentally picks up a piece of valuable ore from the salted mine. An auction is immediately arranged and Jack buys the claim, thus enabling Alice to start east at once, but Alice does not want to go. At the last moment when about to board the stage Jack tells of his love and speaks of the photograph. Alice quickly shows it to him, a picture of her father taken years ago. Needless to say, Alice does not go back east.",
    "Director": "Harold M. Shaw",
    "Writer": "R.P. Janette",
    "Actors": "William West, Herbert Prior, George Lessey",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0329121",
    "tt0003943",
    "tt0006801",
    "tt0006913",
    "tt0214588",
    "tt0233498",
    "tt0000488",
    "tt0015477",
    "tt0003177",
    "tt0003417",
    "tt0002663",
    "tt0002755"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}