{
  "movieId": "tt0253066",
  "title": "En la terraza",
  "year": 1961,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/la-terraza-1963",
      "id": "la-terraza-1963",
      "title": "La Terraza(1963)",
      "description": "La Terraza  es una película en blanco y negro de  Argentina  dirigida por  Leopoldo Torre Nilsson  sobre su propio guion escrito en colaboración con  Beatriz Guido ,  Ricardo Luna  y  Ricardo Becher  según un argumento de Beatriz Guido que se estrenó el 17 de octubre de 1963 y que tuvo como protagonistas a  Graciela Borges ,  Leonardo Favio ,  Héctor Pellegrini  y  Marcela López Rey . La película formó parte de la competición oficial del  Festival de Cine de Berlín . (Wikipedia) Sinopsis Un grupo de adolescentes de clase adinerada expresan su rebeldía en una terraza de un edificio en  Recoleta . 1 ​En cuya terraza hay una pileta de natación, los jóvenes deciden tomar ese espacio porque están aburridos y no saben qué hacer, además de lo que suelen hacer (jugar, hacer bromas pesadas, beber, seducir, fumar, andar en auto, maltratar). Llegan a la terraza para tener una fiesta: unos son estudiantes de Derecho, y se encuentran con dos chicas tomando sol y calentando su apatía. Todos beben, bailan, tocan instrumentos, se acarician, se besan, se engañan, juegan y nadan. Mientras tanto está Belita, la nieta del portero del edificio, y su amigo de la calle, que trabaja para un teatro de revista. Belita es la sirvienta tácita de todo el edificio y su amiguito que, por casualidad se queda dormido en la terraza, se convertirá en el payaso que los jóvenes necesitan para llenar de risas algunos momentos de su estadía allí arriba. Reparto Graciela Borges Leonardo Favio Belita Héctor Pellegrini Marcela López Rey Dora Baret Pedro Laxalt Mirtha Dabner Walmo Fernando Vegal María Esther Duckse Norberto Suárez Enrique Liporace Susana Brunetti Sergio Corona",
      "fileSize": 1237480746,
      "addedAt": "2026-01-07T00:09:24.702Z",
      "thumbnail": "https://archive.org/services/img/la-terraza-1963",
      "language": "spa",
      "year": 1963,
      "collection": "feature_films",
      "downloads": 131
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "4 min",
    "imdbVotes": null,
    "Genre": "Short",
    "Plot": "N/A",
    "Director": "Víctor Erice",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "Spanish",
    "Country": "Spain",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt8268650",
    "tt0153669",
    "tt0153104",
    "tt0149287",
    "tt0057398",
    "tt0151319",
    "tt0324179",
    "tt0150058",
    "tt0148028",
    "tt0161530",
    "tt0148304",
    "tt2090571"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.702Z"
}