{
  "imdbId": "tt0204983",
  "title": "El cura Lorenzo",
  "year": 1954,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/el-cura-lorenzo-1954",
      "id": "el-cura-lorenzo-1954",
      "title": "El Cura Lorenzo(1954)",
      "description": "El cura Lorenzo  es una  película  de  Argentina  de 1954, dirigida por  Augusto César Vatteone , protagonizada por Ángel Magaña. Fue filmada en los Estudios Libertador y estrenada el 28 de julio de 1954, en  Buenos Aires . En  España  la película fue exhibida en 1961 con el título de  Los descarriados . (Wikipedia) Sinopsis La película recrea libremente la historia por la cual el  sacerdote   católico   Lorenzo Massa  inspiró la creación del club  San Lorenzo de Almagro , en 1908. La película describe al barrio de Almagro de ese entonces como una zona marginal de Buenos Aires, en el que los niños se encontraban solos en la calle, expuestos a ingresar a las pandillas de delincuentes que dominaban el sector. En ese ambiente, el padre Lorenzo ( Ángel Magaña ) nota que solo unas pocas ancianas asisten a su parroquia, y decide acercar a los niños a la religión, comprando una pelota de cuero (inaccesible por su precio para los niños pobres) y ofreciéndoles los terrenos de la iglesia para jugar al  fútbol . Ese proyecto cuenta con la oposición del jefe de la «patota» ( Tito Alonso ) de delincuentes juveniles del barrio, quien se convierte en la contrafigura moral del cura Lorenzo. La puja entre ambos se concreta en uno de los «pibes» del equipo de fútbol de la parroquia ( Oscar Rovito ), que a su vez es hermano del matón. Historia El 1 de abril de 1908, el cura  Lorenzo Massa , de la parroquia San Antonio del barrio de  Almagro , vio a un grupo de niños jugando al fútbol en la esquina Treinta y Tres Orientales y México. Como era peligroso le ofreció jugar en la cancha de fútbol de la parroquia, a cambio de ir a misa todos los domingos. Los chicos aceptaron y pocos días después fundaron un club. En la discusión por el nombre, y cuando ya se habían puesto de acuerdo en llamarse “ Los Forzosos de Almagro ”, Massa, quien se encontraba presente, manifestó su desacuerdo debido a que podía ser asociado con la violencia. Algunos propusieron entonces denominar al club con el nombre del sacerdote:  Lorenzo Massa , en agradecimiento por haber facilitado el campo de juego. Massa entonces, explicó que eso implicaría un pecado de soberbia, y propuso a cambio que se eligiera el nombre de su santo. Inmediatamente después,  Federico Monti , propuso que cualquiera fuera el nombre, debía llevar el agregado del barrio al que pertenecía. Así se aprobó la denominación “San Lorenzo de Almagro” Reparto Ángel Magaña  (cura Lorenzo Massa) Tito Alonso  (el matón) Nelly Meden  (jovencita del barrio) Eloy Álvarez Oscar Rovito  (el pibe) Roberto Durán  (novio de la joven) Lalo Malcolm Domingo Mania Bernardo Perrone Panchito Lombard Esperanza Palomero Ricardo Greco Arturo Arcari Vicente Ariño Julio de Grazia Juan Laborde Pablo Cumo",
      "fileSize": 1228935756,
      "addedAt": "2026-01-07T00:08:15.378Z",
      "thumbnail": "https://archive.org/services/img/el-cura-lorenzo-1954",
      "language": "spa",
      "year": 1954,
      "collection": "feature_films",
      "downloads": 113
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "84 min",
    "imdbRating": 7.4,
    "imdbVotes": 24,
    "Genre": "Drama",
    "Plot": "San Lorenzo de Almagro is one of the biggest soccer teams of Argentina. The movie shows the previous moments before the foundation: in 1908, a group of children's played soccer in the streets, and an accidents occurs when a train-way runs over a young boy. Then, a priest called Lorenzo helps him and his friends; And he allows them to play in the yard of his chapel. This way starts the story of San Lorenzo de Almagro (Favorite's soccer team of ambassador James Cheek and actor Viggo Mortensen), a great sportive institution that wins the Argentinean tournament of 1933, 1946, 1959, 1968 (Metropolitan Championship), 1972 (Both), 1974 (National Championship), 1995 (Closing Championship) and 2001 (Closing Championship). In addition, San Lorenzo wins the Mercosur Cup (2001) and Southamerican Cup (2002).",
    "Director": "Augusto Cesar Vatteone",
    "Writer": "Nora Celso, Osvaldo Falabella, Augusto Cesar Vatteone",
    "Actors": "Ángel Magaña, Tito Alonso, Arturo Arcari",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0045169",
    "tt0205171",
    "tt0200605",
    "tt0189470",
    "tt0185043",
    "tt0325480",
    "tt0315965",
    "tt0188243",
    "tt0205274",
    "tt0047542",
    "tt0046969",
    "tt0046672"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.378Z"
}