{
  "movieId": "tt0249846",
  "title": "Nobody Needs to Know",
  "year": 2003,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Nobody_Needs_To_Know",
      "id": "Nobody_Needs_To_Know",
      "title": "Nobody Needs To Know",
      "description": "Young black man about town, \"Lamont\" (Alvin Seme) pushed by the constant surveillance of his everyday life, discovers the real power is offscreen. At the same time an actress, Iris (Tricia Vessey) refuses to \"die\" in a casting, which in turn piques the interest of the director (Matt Borum). She returns to her east Village apartment she shares with another actress, \"Mira\" (Liz Stauber) who is desperate for fame whatever the price. Iris retreats in her room, seemingly setting off a trend of people saying no, one of them being Kurt (Norman Reedus) who disapears from the movie being shot outside her house. As Iris searches for something real, in the city and in herself, Lamont sets off a wave where the real nobodies step out and into control.",
      "fileSize": 2195324403,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/Nobody_Needs_To_Know",
      "language": "English",
      "year": 2003,
      "collection": "feature_films",
      "downloads": 57414
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "96 min",
    "imdbRating": 5.6,
    "imdbVotes": 232,
    "Genre": "Drama",
    "Plot": "Nobody Needs to Know is a story of Fame and the towns and industries and the people who create it and support it. It's the story of two actresses on divergent paths who unwittingly illustrate the power of Fame and its ability to pursue those who run from it and run from those who pursue it. Aesthetically. it's an alchemy of Nathaniel West's The Day of the Locust, The Shadow radio serial, Ralph Ellison's The Invisible Man, and Juergen Teller's Go-See's mixed and sampled to create a sublime cinematic Paul's Boutique for the Era of the Image and beyond.",
    "Director": "Azazel Jacobs",
    "Writer": "Azazel Jacobs, Curtis Winter",
    "Actors": "Tricia Vessey, Liz Stauber, Alvin Seme",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0335563",
    "tt0346504",
    "tt0351780",
    "tt0341372",
    "tt0380732",
    "tt0330219",
    "tt0364517",
    "tt0363468",
    "tt0269347",
    "tt0366598",
    "tt0157191",
    "tt0353042"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.464Z"
}