{
  "imdbId": "tt0245837",
  "title": "Chunhyang",
  "year": 2000,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PvG8y3bNmgg",
      "id": "PvG8y3bNmgg",
      "title": "Chunhyang(2000)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/05199\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/05199\n\n영화글 : https://www.kmdb.or.kr/story/10/1860\n\n감독(Director) : 임권택(Im Kweon-taek)\n출연 : 이효정(성춘향),조승우(이몽룡),이정헌(변학도),김성녀(월매),김학용(방자),이혜은(향단),최진영(이사또),홍경연(행수기생),윤일주(곡성군수),이해룡(순천부사),국정환(옥과현감),배태일(이방),민경진(호방),하덕성(형방),이석구(공방),조태봉(예방),박재형(병방),맹봉학(금난장교),방영(옥사정),박길수(집사령),권태원(김번수),송영탁(박번수),김홍규(형리),원보라(몽룡모),이은숙(기생1),윤혜영(기생2),최현주(소리기생),정진오(어사 서리),박민희(어사 중방),방충식(왕),윤충일(수농부),이동섭(이사또 책실),안진수(변사또 책실),강영민(후배사령),홍동은(남원백성),남정희(아낙),박예숙(아낙),강희(아낙),박철민(구경꾼),장남열(구경꾼),김태희(구경꾼),김세호(사령),박평호(사령),황춘하(판쇠),김철홍(신연급창),신성일(급창),임창대(통인),문상철(대학생),조현철(대학생),이재욱(대학생),이원두(대학생),황금희(대학생),장지수(대학생),최진영(특별출연),김재찬,임이조,김호민,한경선,이태완,박규현,임현빈,김준엽,김선영,김정희,김은영,이경미,이유화,이지현,김윤진,최강미,박소희,김준엽,하영완,조재경,전병진,김창선,민희배,배양순,황상현,강만보\n\n줄거리 : 서울의 정동극장, 무대에 명창 조상현이 올라오고 ‘춘향전’ 공연이 시작된다. 조상현의 소리에 맞춰 화면은 조선 시대의 한 관아로 바뀐다. 단오절, 남원부 자제 이몽룡(조승우)는 방자(김학용)를 앞세워 광한루 구경을 나서고, 그곳에서 그네를 타고 있는 춘향(이효정)을 만난다. 그날 이후 춘향을 보고 싶은 몽룡은 야심한 밤, 춘향의 집을 방문한다. 몽룡은 춘향 어미 월매(김성녀) 앞에서 춘향에게 ‘불망기’를 써 사랑을 맹세한다. 첫날밤을 보낸 후 둘의 사랑은 더욱 깊어가지만 몽룡은 동부승지 당상하여 한양에 가게 된 아버지를 따라 남원을 떠나야 하고, 몽룡과 춘향은 서로의 거울과 가락지를 나눈 후 이별한다. 새로 부임한 변 사또(이정헌)는 남원골 절색 춘향에게 수청 들기를 강요한다. 춘향은 수청을 거부하고, 변 사또는 춘향에게 모진 고문을 가하고 옥에 가둔다. 한편 한양에서 장원급제한 몽룡은 암행어사로 다시 전라도로 온다. 변학도의 폭정과 춘향의 고초를 알게 된 몽룡은 그날 밤 거지 행색으로 월매와 옥에 갖힌 춘향을 찾는다. 변학도의 생일날, 성대한 잔치가 벌어지는 틈에 암행어사 출두가 붙여지고, 몽룡은 변학도를 비롯한 부패한 탐관오리들을 응징한다. 춘향은 풀려나고, 월매와 동네 사람들은 기쁨의 노래를 부른다. 화면이 다시 공연장으로 돌아오면, 조상현의 소리와 함께 추임새를 넣는 관객들의 소리가 어우러진다.\n\nCasts : Lee Hyo-jeong, Cho Seung-wu, Lee Jeong-heon, Kim Seong-nyeo, Kim Hak-yong, Lee Hye-eun, Choi Jin-young, Hong Kyoung-yeon, Yun Il-ju\n\nSYNOPSIS : Based on the Pansori folk song of the same title, Chunhyang tells the tale of two star-crossed lovers who consummate their love after overcoming various obstacles. Mongryong, the son of a nobleman, falls in love with a beautiful maiden on a swing. He learns that she is Chunhyang, the daughter of a retired kisaeng (equiv.to geisha)named Wolmae, but he pursues her despite her lower social status.Mongryong succeeds in winning the heart of Chunhyang and Wolmae and pledges Chunhyang as his life-long companion. Unfortunately Mongryong is forced to leave the side of his beloved when his father is summoned by the king's court. Sadly he leaves for the city with the promise to return as a court official. One day a new governor, BYUN\nHakdo arrives in Namwon, the hometown of Chunhyang. Notorious for his insatiable desire for women, he orders Chunhyang to serve him after hearing of her beauty. When she refuses, BYUN tortures Chunhyang and throws her in jail. Meanwhile Mongryong passes the state exam with the highest distinction, whereby the king makes him his personal emissary, a post\nwhich grants him the authority to punish corrupt officials. Disguised as a vagrant and accompanied by his envoy, Mongryong heads toward Namwon with a vengeance...",
      "addedAt": "2025-12-26T00:24:06.379Z",
      "thumbnail": "https://i.ytimg.com/vi/PvG8y3bNmgg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCcwM80Z4o4EoJ_XX288NHF2jorVw",
      "duration": 8208,
      "language": "ko",
      "year": 2000,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "137 min",
    "imdbRating": 7.1,
    "imdbVotes": 1837,
    "Genre": "Drama, Musical, Romance",
    "Plot": "Mongryong marries the beautiful Chunhyang without telling his father, the Governor of Namwon. When his father is transferred to Seoul, Mongryong has to leave Chunhyang and finish his exams. Chunhyang, being the daughter of a courtesan, is also legally a courtesan. She is beaten and imprisoned when she refuses to obey the new Governor Byun, as she wishes to be faithful to her husband. After three years, Mongryong passes his exam and becomes an emissary to the King. He returns to Namwon, disguised as a beggar, just before Chunhyang is to be flogged to death at the governor's birthday celebration.",
    "Director": "Im Kwon-taek",
    "Writer": "Sang-hyun Cho, Hye-yun Kang, Kim Myung-gon",
    "Actors": "Hyo-jeong Lee, Cho Seung-woo, Seong-nyeo Kim",
    "Language": "Korean",
    "Country": "South Korea",
    "Awards": "8 wins & 11 nominations total"
  },
  "relatedMovies": [
    "tt0019644",
    "tt0026775",
    "tt0185878",
    "tt0143144",
    "tt0026301",
    "tt0188586",
    "tt0037702",
    "tt0168822",
    "tt0019946",
    "tt0020143",
    "tt0206826",
    "tt0303243"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:15:17.105Z"
}