{
  "imdbId": "tt0221687",
  "title": "The Voice of Conscience",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheVoiceOfConscience",
      "title": "TheVoiceOfConscience",
      "id": "TheVoiceOfConscience"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "14 min",
    "imdbRating": "5.7",
    "imdbVotes": "46",
    "Genre": "Short, Drama",
    "Plot": "An orphan girl was given a home by one of her father's friends, who, with his mother, carefully looked after her. The girl's benefactor was much her senior, but soon fell desperately in love with him, although she hid it from those around her. Jealousy came into her life, when a young woman came to visit her guardian's mother. Soon it was apparent to the orphan that the man she admired was deeply in love with the elder girl, and she saw that his affection for his ward was purely paternal. While the two girls and the young man were motoring one day, they met with an accident and the young women were badly injured. A little country hospital was nearby, and there the victims were taken, being placed on adjoining cots. The young man did all he could for their comfort, but his actions showed that his heart was wrapped up in the elder girl. This his ward noted, and as she lay on her cot she brooded and prayed for a chance to have revenge. The man's sweetheart was suffering principally from shock, and a heart stimulant was given her at constant intervals. This draught was a very powerful drug, and the ward knew that an overdose would be fatal. Full of hatred, she watched her chance and when she thought she was unobserved, poured half of the contents of the bottle into the glass containing the mixture prepared for the patient. By good fortune the doctor, who was outside on the porch, saw her. He decided that she should be punished, but had a firm belief that conscience would cause her more suffering than could be administered by the law. The guilty girl peeped stealthily when the doctor approached her enemy's cot, and gave her a dose of medicine. She shuddered a few minutes later when the screen emblem of a patient's approaching death was put around her neighbor's cot. Later when the screen was removed and she saw the empty bed beside her she bitterly regretted the evil deed that jealousy had led her to do. The girl was not dead, however, the doctor only pretended to give her the medicine, and removed her for safety's sake to another part of the hospital. The guilty girl regained her strength very slowly. Weak and wan, she was seated in the hospital grounds one beautiful afternoon when visitors were announced. They were the man she loved and the girl she thought she had killed. Joyfully she greeted them, but was so weak from the shock that her callers were ordered to leave. To the doctor who came to administer to her, the girl made full confession, and devoutly thanked heaven that in some mysterious way the crime she planned had not succeeded. The doctor explained that he knew all, and had known it from the time she tampered with the medicine, but had kept the secret. Humbly she thanked him, told him she had learned her lesson, and as reparation would consecrate the rest of her life to doing good.",
    "Director": "Theodore Wharton",
    "Writer": "Harry Mainhall, Theodore Wharton",
    "Actors": "Francis X. Bushman, Edmund J. Hayes, Florence La Badie",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0002336",
      "title": "The Magic Wand",
      "year": 1912,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002200",
      "title": "From the Submerged",
      "year": 1912,
      "imdbRating": "6.1",
      "imdbVotes": "99",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002143",
      "title": "Dr. Jekyll and Mr. Hyde",
      "year": 1912,
      "imdbRating": "6.0",
      "imdbVotes": "893",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0417062",
      "title": "The Portrait of the Lady Anne",
      "year": 1912,
      "imdbRating": "6.8",
      "imdbVotes": "88",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002356",
      "title": "The Melody of Love",
      "year": 1912,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0002504",
      "title": "The Star of Bethlehem",
      "year": 1912,
      "imdbRating": "4.9",
      "imdbVotes": "60",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002784",
      "title": "Cymbeline",
      "year": 1913,
      "imdbRating": "5.0",
      "imdbVotes": "50",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0464694",
      "title": "Tannhäuser",
      "year": 1913,
      "imdbRating": "5.2",
      "imdbVotes": "44",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0463594",
      "title": "The Marble Heart",
      "year": 1913,
      "imdbRating": "4.7",
      "imdbVotes": "40",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002381",
      "title": "The Musketeers of Pig Alley",
      "year": 1912,
      "imdbRating": "6.6",
      "imdbVotes": "2,540",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002054",
      "title": "A Beast at Bay",
      "year": 1912,
      "imdbRating": "5.8",
      "imdbVotes": "220",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002082",
      "title": "The Burglar's Dilemma",
      "year": 1912,
      "imdbRating": "6.0",
      "imdbVotes": "429",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T21:20:10.826Z"
}