{
  "imdbId": "tt0234694",
  "title": "A Serenade by Proxy",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-serenade-by-proxy",
      "id": "silent-a-serenade-by-proxy",
      "title": "A Serenade by Proxy",
      "fileSize": 390216506,
      "addedAt": "2026-01-07T00:10:50.367Z",
      "thumbnail": "https://archive.org/services/img/silent-a-serenade-by-proxy",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 213
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "14 min",
    "imdbRating": 5.5,
    "imdbVotes": 89,
    "Genre": "Short, Comedy, Romance",
    "Plot": "Colonel Jackson, a well-to-do farmer, forbids young Thomas, a neighbor's son, to have any further communication with his daughter, Muriel. Considering her own romance shattered, Muriel lends herself to helping Zeb Hawkins, the chore boy. In winning the affections of Molly, the housemaid, whose head has been completely turned by constantly reading sensational novels. She refuses to consider Zeb as a suitor because he is not romantic enough. Muriel advises Zeb to emulate Molly's idea of a lover by serenading her. Zeb is anything but musical, so he gets a phonograph, points the horn towards Molly's window that night and grinds out \"Love Me and the World is Mine,\" to such purpose that her heart is melted. Unfortunately, Molly does not possess a singing voice, but she induces Muriel to do the singing for her while she, Molly, stands at the open window and makes appropriate gestures. Soon after Molly accepts Zeb as her future husband, but not until he agrees to elope with her. The night of the elopement Zeb comes cautiously down the ladder with Molly's telescope bag and young Thomas, who happens along, mistakes him for a burglar. Anxious to cover himself with glory in the eyes of Muriel's father, he attacks the supposed burglar in the dark and a rough and tumble fight ensues, in which Molly joins. Muriel, hearing the rumpus, hastens down the ladder just as Zeb and Molly streak it across the lawn. Thomas and Muriel recognize each other at the foot of the ladder, and by this time Colonel Jackson arrives on the scene. He accuses the young people of eloping and in vain do they try to convince the irate father to the contrary. Under the stress of circumstances the spirit of Thomas awakens and he boldly tells the colonel that he may as well have the game as the name, and runs off with Muriel, pursued by her father. Joining Zeb and Molly, they drive to the nearest clergyman, who has an unexpected double wedding on his hands. The final scene brings unexpected laughter.",
    "Director": "C.J. Williams",
    "Writer": "Al Giebler",
    "Actors": "Frank A. Lyons, Margery Bonney Erskine, Gertrude McCoy",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0214467",
    "tt0002532",
    "tt0421917",
    "tt0215495",
    "tt0003805",
    "tt0310891",
    "tt0464747",
    "tt0006414",
    "tt0007567",
    "tt0001458",
    "tt0001002",
    "tt0003177"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}