{
  "imdbId": "tt0234904",
  "title": "Tom, Tom, the Piper's Son",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TomTomThePipersSon1905",
      "id": "TomTomThePipersSon1905",
      "title": "\"Tom, Tom, the Piper's Son\" (1905) cinematographer Billy Bitzer",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"Tom, Tom, the Piper's Son\" is a short comedy with unknown cast and director.  The film is included in our program to illustrate the work of our star Billy Bitzer. During a village fair Tom steals a pig and runs away with it chased by a crowd of persecutors.  The pig becomes unruly and hampers the escape, but the chasers have their own problem as they constantly stumble upon each other.  Will Tom take advantage and escape? Tom, Tom the Piper's Son Nursery Rhyme Words Tom Tom the piper's son, Stole a pig and away he ran. The pig was eat and Tom was beat, And Tom went crying down the street. Directed by                       unknown Cinematography by         Billy Bitzer Starring                             unknown Distributed by                   Biograph Company Release date                      March 9, 1905 Country                             United States Running time                    8 m.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 9359636,
      "addedAt": "2026-01-07T00:07:11.886Z",
      "thumbnail": "https://archive.org/services/img/TomTomThePipersSon1905",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 1916
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 4.5,
    "imdbVotes": 148,
    "Genre": "Comedy, Short",
    "Plot": "Based loosely on the nursery rhyme: A fair is in progress, with refreshments, entertainment, and other activities. As the rest of the crowd is watching one of the acts, Tom steals a pig and runs off. He tries to hide, but he is chased by the crowd, and the pig also proves difficult to control. But Tom has some tricks up his sleeve that might give him a chance to escape.",
    "Director": "G.W. Bitzer",
    "Writer": "Frank Marion, Wallace McCutcheon",
    "Actors": "N/A",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000524",
    "tt0431889",
    "tt0308402",
    "tt0233391",
    "tt0257379",
    "tt0257990",
    "tt0228839",
    "tt1168658",
    "tt0235018",
    "tt0000492",
    "tt0232946",
    "tt0449172"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.886Z"
}