{
  "movieId": "tt0228331",
  "title": "Ghost Parade",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Ghost_Parade_1931",
      "id": "Ghost_Parade_1931",
      "title": "Ghost Parade",
      "description": "Plot taken from IMDb When Mr. Martin and everyone else in Mosby Manor hears strange noises during the night, they fear that it might be the ghost of Martin's uncle, who died in the Civil War. But the next day, the local constable investigates, and he finds mice in the attic who are making the odd sounds by crawling across some musical instruments stored there. But their relief does not last long. As they are showing the house to some potential buyers, a new series of strange, inexplicable, and increasingly frightening events begins. Extracted from the file \"Comedy shorts\" available on Public Domain Movie Torrents.",
      "fileSize": 456998114,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/Ghost_Parade_1931",
      "year": 1931,
      "collection": "feature_films",
      "downloads": 19662
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "18 min",
    "imdbRating": 4.4,
    "imdbVotes": 120,
    "Genre": "Short, Comedy, Mystery",
    "Plot": "When Mr. Martin and everyone else in Mosby Manor hears strange noises during the night, they fear that it might be the ghost of Martin's uncle, who died in the Civil War. But the next day, the local constable investigates, and he finds mice in the attic who are making the odd sounds by crawling across some musical instruments stored there. But their relief does not last long. As they are showing the house to some potential buyers, a new series of strange, inexplicable, and increasingly frightening events begins.",
    "Director": "Mack Sennett",
    "Writer": "John A. Waldron, Earle Rodney, Harry McCoy",
    "Actors": "Andy Clyde, Marjorie Beebe, Harry Gribbon",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0019682",
    "tt0019938",
    "tt0020237",
    "tt0002133",
    "tt0003177",
    "tt0002501",
    "tt0003417",
    "tt0002280",
    "tt0002663",
    "tt0002755",
    "tt0003733",
    "tt0003934"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}