{
  "movieId": "tt0293950",
  "title": "Take Heed Mr. Tojo",
  "year": 1943,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/take-heed-mr.-tojo-1943",
      "id": "take-heed-mr.-tojo-1943",
      "title": "Take Heed Mr. Tojo (1943)",
      "description": "Take Heed Mr. Tojo is  a 1943 wartime bond film directed by Shamus Culhane. Watch on RetroFlix:  https://retroflix.org/take-heed-mr-tojo-1943/",
      "fileSize": 111712657,
      "addedAt": "2026-01-07T00:11:46.527Z",
      "thumbnail": "https://archive.org/services/img/take-heed-mr.-tojo-1943",
      "language": "eng",
      "year": 1943,
      "collection": "feature_films",
      "downloads": 88
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.3,
    "imdbVotes": 57,
    "Genre": "Animation, Short",
    "Plot": "WWII was a funny period for the animation departments at many American studios. For the war effort, sometimes the studios shared talent and ideas, as for once they were all on the same team. As a result, some interesting relationships were forged. Looney Tunes and Dr. Seuss combined for some Private Snafu cartoons to be shown to the troops (they were, surprisingly, sprinkled with some rather adult humor). And, Walter Lantz (Universal Pictures) and Looney Tunes actually shared a character, Mr. Hook. Hook was the invention of Hank Ketcham of the Dennis the Menace fame and his main purpose was to sell war bonds.TAKE HEED MR. TOJO is the first Hook and it is a lot different from the last three. First, it was a color cartoon meant to raise bonds in America. As such, it was shown in regular theaters across the country to all audiences. Second, Mr. Hook just doesn't look or sound the same. Part of this is because the Walter Lantz folks had a different style than the Warner Brothers folks. Also, the voice talent is different, with Arthur Lake (\"Dagwood\") providing Hook's voice in the last three. And, because the last three cartoons were meant only to be shown to troops serving overseas, they saved a few bucks by producing them in glorious black and white. Additionally, Hook just acted differently in the later installments--much cuter and comical.TAKE HEED is a pretty typical wartime bond film as far as quality goes--a bit better than the usual Lantz fare but not up to the great style and quality of a Looney Tune short. This story of Hook is set a decade in the future, and he is telling his young son about his exploits during the war and how war bonds helped him defeat an evil Japanese pilot who was trying to attack the fleet. It has a few funny moments and it's very watchable today. However, despite being a much longer and more complicated film, I really prefer the later ones--they just had a nice magical quality you won't forget.",
    "Director": "Shamus Culhane",
    "Writer": "Hank Ketcham",
    "Actors": "Dick Nelson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0159453",
    "tt0148638",
    "tt0035754",
    "tt0147804",
    "tt0147829",
    "tt0149798",
    "tt0035743",
    "tt0154347",
    "tt0035750",
    "tt0145751",
    "tt0035836",
    "tt0035861"
  ],
  "collections": [
    {
      "id": "animation-shorts",
      "name": "Animation Shorts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.527Z"
}