{
  "movieId": "tt0367144",
  "title": "The Tiniest of Stars",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-tiniest-of-stars",
      "id": "silent-the-tiniest-of-stars",
      "title": "The Tiniest of Stars",
      "fileSize": 560998181,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-tiniest-of-stars",
      "language": "English",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 336
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": 6,
    "imdbVotes": 25,
    "Genre": "Drama, Short",
    "Plot": "When a member of a theatrical orchestra went \"on the road\" he left behind him in a big city his wife, their little boy and their baby girl. For some weeks he sent them money regularly, then all word from him ceased. The wife on inquiry learned that the company had disbanded in a western city, and the members of it were presumably making their way east the best they could. The woman was sickly, and practically unable to work, but her little son proved to be an energetic bread winner, secured free board by aiding his mother to do the work of a janitor, and at odd times sold newspapers. He always had his eye out for a chance to make money and one day determined that little sister was in a position to help them. A local theater advertised \"Amateur Night\" with a cash prize for the winner, and the boy saw no reason why the little girl should not bring the money home to mother. She was little, and cute and could recite, therefore why should anyone doubt her success. \"Amateur Night\" was a night of triumph for the little girl and the brother who believed in her. The other contestants were outclassed, while the audience rapturously greeted the baby girl who smiled at them so sweetly and lisped out a few words with a confident air. Even the members of the orchestra, ordinarily the most stolid of individuals, enjoyed her performance. One in particular, the first violin, was deeply affected. It was his first night at the theater, and he was overcome with emotion, when he recognized in the tiniest of stars his little girl whom he had so vainly sought. There was a joyous reunion in the wings of the theater, and a proud little girl went home to tell her mother that \"I got papa and some shiny money for being a good girl.\" It is needless to say that with the father's return their troubles of the family ceased, and the little girl was never again called upon to be leading lady on an amateur night.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "James Cruze, Marguerite Snow, Marie Eline",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0463594",
    "tt0470339",
    "tt0330942",
    "tt0344506",
    "tt0417062",
    "tt0002356",
    "tt2160081",
    "tt1223220",
    "tt1207008",
    "tt0482779",
    "tt1113818",
    "tt0464694"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}