{
  "imdbId": "tt0304545",
  "title": "Perón: La revolución justicialista",
  "year": 1971,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/peron-la-revolucion-justicialista-1971",
      "title": "Peron, La Revolucion Justicialista (1971)",
      "description": "Perón, La revolución justicialista  es una película documental de  Argentina  filmada en  Eastmancolor  dirigida por  Fernando Solanas  y  Octavio Getino  que se produjo en 1971 y nunca fue estrenada comercialmente. 1 ​ Consiste en entrevistas a  Juan Domingo Perón  a cargo de Octavio Getino y Fernando Solanas, realizadas en Madrid entre junio y octubre de 1971. De la misma serie de entrevistas se extrajo el material del documental  Perón: Actualización política y doctrinaria para la toma del poder . (Wikipedia) Sinopsis A mediados de 1971 Fernando Solanas y Octavio Getino realizaron para el  Grupo Cine Liberación  un largo reportaje a Juan Perón. La película incluye fragmentos musicales y fotomontaje en las primeras secuencias. De allí en adelante, sólo el general Perón explicitando la doctrina y la práctica del movimiento justicialista. Este material fue exhibido, legal o clandestinamente, en sindicatos, reuniones de militantes, agrupaciones estudiantiles. Está dividida en dos partes: la primera titulada  Antes del Gobierno y En el gobierno , y la segunda titulada  En la resistencia  e incluye dos cortes para posibilitar la discusión entre los espectadores. Produccion Ya en 1969 un integrante del grupo Cine Liberación había realizado a Perón –por mediación de  Jorge Antonio  una entrevista de alrededor de 3 minutos de duración, que desde 1968 fue exhibido junto a la segunda parte del filme ‘’ La hora de los hornos  A partir del impacto obtenido con la difusión de ese filme surgió la idea de una entrevista, que contó con el apoyo del exteniente  Julian Licastro  y de Fernandez Valoni . En 1970 Licastro consiguió que Perón viera varios rollos de  La hora de los hornos , para transmitirle la importancia que podía tener para la difusión de sus ideas un reportaje filmado y posteriormente Getino viajó a España; allí fue atendido por  José López Rega  a quien explicó detalladamente la idea. En un viaje posterior a comienzos de 1971 Getino habló con Perón, quien aprobó el proyecto y prometió responder por escrito. Esa respuesta llegó el 10 de marzo de 1971 y en ella Perón describió, capítulo por capítulo, los posibles temas que proponía desarrollar e incluía una probable duración de los mismos. Conforme al acuerdo escrito que se realizó, la financiación para la producción corrió a cargo de Jorge Antonio con el compromiso de la conducción del Movimiento Justicialista y de las \" 62 Organizaciones \" de restituirla, sin que los directores y el equipo técnico percibieran honorarios. En la etapa de realización del documental se incorporó a la filmación  Gerardo Vallejo  y tuvo la apoyatura técnica de un reducido grupo de españoles. La entrevista se hizo en el interior de la residencia de Puerta de Hierro entre junio y julio de 1971, finalizando el 10 de este mes. Respecto de las imágenes a incluir sugirió prescindir de la de  Juan Bosch , el líder de la oposición dominicana en el exilio contra el régimen de  Rafael Leónidas Trujillo  durante más de 25 años. El montaje y proceso de laboratorio se hizo por razones de seguridad en Roma, entre julio y septiembre y el 17 de octubre se hizo en Puerta de Hierro la primera proyección del primer capítulo terminado. Al finalizar 1972, los documentales comenzaron a difundirse en Argentina y pocos meses después, y de manera imprevista para los directores,  Bernardo Neustadt  difundió por  Canal 9  algunas escenas y así por primera vez en 17 años la palabra y la imagen de Perón estuvieron en ese medio.",
      "id": "peron-la-revolucion-justicialista-1971"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "180 min",
    "imdbRating": "7.4",
    "imdbVotes": "31",
    "Genre": "Documentary",
    "Plot": "General Juan Perón is interviewed in his exile in Madrid, where he explains the doctrine and history of the Justicialist movement in Argentina. It's divided into two parts: \"Before the Government and In government\" and \"In the resistance\", and was exhibited in unions and meetings of militants without being released commercially.",
    "Director": "Octavio Getino, Fernando E. Solanas",
    "Writer": "N/A",
    "Actors": "Juan Domingo Perón",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0066759",
      "title": "The American West of John Ford",
      "year": 1971,
      "imdbRating": "7.1",
      "imdbVotes": "297",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0201506",
      "title": "El camino hacia la muerte del viejo Reales",
      "year": 1971,
      "imdbRating": "8.3",
      "imdbVotes": "39",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0302871",
      "title": "Nosotros los monos",
      "year": 1971,
      "imdbRating": "7.0",
      "imdbVotes": "10",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt13886998",
      "title": "Zaat (1971)",
      "year": 1971,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "N/A",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0848243",
      "title": "A Blank on the Map",
      "year": 1971,
      "imdbRating": "8.1",
      "imdbVotes": "174",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt7322102",
      "title": "Mietersolidarität",
      "year": 1970,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0251230",
      "title": "The Marriage Manual",
      "year": 1970,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0294468",
      "title": "Companeras and Companeros",
      "year": 1970,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "Spanish",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0181275",
      "title": "a.k.a. Cassius Clay",
      "year": 1970,
      "imdbRating": "6.7",
      "imdbVotes": "719",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt7322114",
      "title": "Teenage Art",
      "year": 1969,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0303675",
      "title": "Argentina, mayo de 1969: Los caminos de la liberación",
      "year": 1969,
      "imdbRating": "6.0",
      "imdbVotes": "20",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0072962",
      "title": "F for Fake",
      "year": 1973,
      "imdbRating": "7.7",
      "imdbVotes": "19,115",
      "language": "English, French, Spanish",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T15:27:40.745Z"
}