{
  "imdbId": "tt0300647",
  "title": "What Becomes of the Children?",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/what-becomes-of-the-children-1936",
      "title": "What Becomes of the Children? (1936)",
      "description": "What Becomes of the Children? is a 1936 American drama film directed by Walter Shumway. Watch on RetroFlix:  https://retroflix.org/what-becomes-of-the-children-1936/",
      "id": "what-becomes-of-the-children-1936"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/what_becomes_of_the_children",
      "title": "What Becomes Of The Children?",
      "description": "You can find more information regarding this film on its IMDb page .",
      "id": "what_becomes_of_the_children"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1oRIFptoPKg",
      "title": "What Becomes of the Children? (1936) DRAMA",
      "description": "Stars: Joan Marsh, Robert Frazer, Claudia Dell\nDirector: Walter Shumway\n\nNeglected as children, two siblings lead troubled lives as adults.",
      "id": "1oRIFptoPKg",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "65 min",
    "imdbRating": "5.2",
    "imdbVotes": "71",
    "Genre": "Drama, Crime, Family",
    "Plot": "While Boston tycoon John Worthington dreams of building his \"Great American Railway,\" his family life is disintegrating around him. His wife Edith spends all her time on social endeavors, leaving the rearing of their two small children, Freddie and Marion, to their nanny, Gertrude. The neglected Worthington children seek their parents attention and affection, as they witness the normal family life of next-door neighbor Thomas Scott, John's lawyer and closest friend. When Freddie and Marion bring home an abandoned dog, the two are sent to bed early. With both their parents away for the evening, the two sneak out of bed to play hide and seek. Marion, searching for Freddie, falls down the dumbwaiter and is seriously injured. The two parents rush home, and each blames the other for the child's injury. Edith, claiming that John is neglecting her as well as the children, files for divorce. Following their parents, divorce, Freddie and Marion are split up, with Freddie living with John while Marion leaves with Edith. Years later, John has fulfilled his dream of a great railroad empire, but is faced with two dilemmas: his workers are threatening to strike and Freddie has been thrown out of yet another college. John manages to break his workers' union, but Freddie tells his father that he would rather be disinherited than become a mirror of his father. With the help of his girl friend, blues singer Gale Adams, Freddie gets a job as a singing piano player in a small family restaurant. Meanwhile, Marion has led a similarly rebellious life. After Edith informs her that she is going off on a European vacation, Marion disowns her mother, goes to a wild cocktail party, and impulsively marries Roy Daniels. When Daniels is arrested on their wedding night for jewel theft, Marion is arrested as an accessory and spends one year in prison. Released from prison, Marion is unable to find work and contemplates suicide when she is evicted from her apartment. Her next-door neighbor, Elsie, takes her out to dinner, to the restaurant where Freddie works. When Roy enters the restaurant, Elsie, one of his jilted lovers, re-introduces him to his wife. Marion refuses to have anything to do with Roy, and when the thief tries to get rough with her, Freddie comes to her aid. Later, Marion tries to commit suicide by slipping pills into her drink, but Freddie stops her, and the two discover they are brother and sister. They go back to Marion's apartment, but their happy reunion is interrupted by the reappearance of Roy. When Roy and Freddie fight, a gun goes off and Roy is killed. Both Marion and Freddie are placed on trial for murder, and their two parents are reconciled in light of this family tragedy. Gale, convinced that Marion and Freddie are innocent, goes to Elsie and pretends to blackmail her, stating that she saw Elsie shoot Roy. Elsie then admits that Roy's partner, Shelby, was the real murderer. With their names cleared, the Worthingtons all return to their old home. Finally a happy family, Marion and Freddie ask their parents to take them to the zoo, something they had always been too busy before to do.",
    "Director": "Walter Shumway",
    "Writer": "Corra Beach",
    "Actors": "Joan Marsh, Robert Frazer, Natalie Moorhead",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0026771",
      "title": "Never Too Late",
      "year": 1935,
      "imdbRating": "5.3",
      "imdbVotes": "41",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028231",
      "title": "Secret Agent",
      "year": 1936,
      "imdbRating": "6.4",
      "imdbVotes": "9,469",
      "language": "English, French, German, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027697",
      "title": "Great Guy",
      "year": 1936,
      "imdbRating": "6.3",
      "imdbVotes": "1,104",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027893",
      "title": "Little Lord Fauntleroy",
      "year": 1936,
      "imdbRating": "7.3",
      "imdbVotes": "2,696",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Timeless Classic Movies"
    },
    {
      "imdbId": "tt0028346",
      "title": "Reefer Madness",
      "year": 1936,
      "imdbRating": "3.7",
      "imdbVotes": "9,511",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0029199",
      "title": "A Man Betrayed",
      "year": 1936,
      "imdbRating": "5.6",
      "imdbVotes": "119",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0028596",
      "title": "The Avenging Hand",
      "year": 1936,
      "imdbRating": "5.1",
      "imdbVotes": "124",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027354",
      "title": "Beware of Ladies",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "102",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027406",
      "title": "Bulldog Edition",
      "year": 1936,
      "imdbRating": "5.5",
      "imdbVotes": "93",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027499",
      "title": "Daniel Boone",
      "year": 1936,
      "imdbRating": "5.6",
      "imdbVotes": "358",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0027568",
      "title": "Ellis Island",
      "year": 1936,
      "imdbRating": "5.4",
      "imdbVotes": "89",
      "language": "English, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0030164",
      "title": "Fury Below",
      "year": 1936,
      "imdbRating": "5.3",
      "imdbVotes": "60",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:13:06.702Z"
}