{
  "imdbId": "tt0336421",
  "title": "The Butterflies",
  "year": 1906,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-butterflies",
      "id": "silent-the-butterflies",
      "title": "The Butterflies",
      "fileSize": 189800444,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-butterflies",
      "language": "Italian",
      "year": 1908,
      "collection": "feature_films",
      "downloads": 401
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "6 min",
    "imdbRating": 6.3,
    "imdbVotes": 83,
    "Genre": "Short",
    "Plot": "In a Japanese garden, gather maidens with nets to catch butterflies, all in the joy of life and budding maidenhood; fresh Irish sweetness of blithe Spring; the light fantastic toe \"tripping\" the limpid music arranged for this unique piece of art in a large cage a pretty colored butterfly is brought in, to delight the winsome maidens, who execute a pretty umbrella dance ere the poor butterflies are forced to entertain the merry group. Scenes are passed and the pretty butterfly is imprisoned again in the cage. Forth from the sweet-scented garden appears the butterfly's companion; a cage opens and the two embrace and flutter to the sensuous music; when, lo! Appears the merry group of maids and master, who, in the agitation that ensues, catches the strange butterfly and cruelly cuts away the gossamer wings and leaves him trembling, feebler and feebler, to die. Then Nemesis, the avenging hosts of butterflies, gather and swarm about the cruel master and cast him into the cage, leading him away to be the victim of their dazzling, bewildering dance. Around him they gather, and to the exquisite melody of a waltz they fill the scene with the wonder of their dance. Upon them floods of gorgeous colors in ever varying harmonies are thrown, suited to the rhythmic whirl of the music and dance. No more dazzling effect has probably been attempted than is here used, united in one grand harmony of light, color, music and dance.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000537",
    "tt3473502",
    "tt0205480",
    "tt0258293",
    "tt1880182",
    "tt0249618",
    "tt0471431",
    "tt3110548",
    "tt0257379",
    "tt3369930",
    "tt0234922",
    "tt3658844"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}