{
  "movieId": "tt0326289",
  "title": "Toil and Tyranny",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-toil-and-tyranny",
      "id": "silent-toil-and-tyranny",
      "title": "Toil and Tyranny",
      "fileSize": 817100425,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-toil-and-tyranny",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 414
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "35 min",
    "imdbRating": 5.9,
    "imdbVotes": 35,
    "Genre": "Short, Drama",
    "Plot": "David Powers, lumber king, treats his employees as inconsiderable details of his business, to be replaced without question at his pleasure. He is backed in his patrician contempt for labor by his legal adviser, Perry Travis. Both Powers and Travis love Powers' daughter Laura with a love that amounts fairly to worship. Laura has promised to marry Travis. Karl Hurd, his wife Mina, and their six-year-old daughter Betty form, a pathetic example of struggling poverty. Hurd works as a stevedore for Powers. In a fight with his foreman, Hurd is beaten with a club and laid up for many months. His wife, slaving to support her family, contracts tuberculosis. When Hurd, still weak, again applies for work at the lumber yard, Powers drives him away. Conditions become unbearable in Powers' plant and his workers decide to strike. Laura's pleas for the workmen are of no avail. Mina dies. On a mission of exploration to the workers' homes, Laura finds Hurd sitting beside the lifeless body of his wife. He is inconsolable, and Laura sees she can do naught to assuage his grief. She leaves her purse and departs. The strikers decide to be revenged on Powers, and lie in wait for his automobile. Hurd, crazed with grief at the loss of his wife, and attributing all his troubles to Powers, takes a revolver from the strike leader's pocket and decides to do \"the job\" himself. He waits a block in advance of the mob of strikers. Laura eludes her father and Travis, and entering Powers' limousine starts for the strikers' meeting, resolved to help them. Hurd empties his revolver into the automobile, and the chauffeur, fear-stricken, rushes home. When Powers and Travis open the car door, they find Laura dead within, and realize that her death is the result of their willful blindness. Hurd learns too late of his terrible mistake, and will go through life ever as the self-accused murderer of his benefactress.",
    "Director": "Harry Harvey",
    "Writer": "Henry King, Will M. Ritchey",
    "Actors": "Henry King, Ruth Roland, Daniel Gilfether",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0195934",
    "tt0003803",
    "tt0005414",
    "tt0231300",
    "tt0005246",
    "tt0482779",
    "tt0005622",
    "tt1262050",
    "tt0228815",
    "tt0005047",
    "tt0442148",
    "tt0477332"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}