{
  "imdbId": "tt0336695",
  "title": "The Kid Stakes",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheKidStakes",
      "id": "TheKidStakes",
      "title": "The Kid Stakes",
      "description": "Australian Silent film based on the Fatty Finn comic strips. This was the last silent film made in Australia. It was shot in the Sydney streets in 1927. The suburb where it is set is Wooloomoloo, which is an inner city suburb between the CBD and Potts Point. At the time this was film was made, it was a poor area. It is now an expensive, trendy suburb. The billy goat race had to be filmed in Queensland as the New South Wales government had banned such races a year before this film was made. The projection speed has been corrected so the film runs a little longer than other versions. The soundtrack included here is a collection of popular style recordings from the time approximating the original musical accompanyment. This film has been in the Australian public domain since 1978. It was published in the USA without the necessary copyright formalities and its copyright was not restored by GATT due to its public domain status in Australia.",
      "fileSize": 1919611720,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheKidStakes",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 18975
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "69 min",
    "imdbRating": 6.6,
    "imdbVotes": 73,
    "Genre": "Drama",
    "Plot": "Young \"Fatty\" Finn and his friends enter their pet goat in a race, but his rival \"Bruiser\" Murphy lets the goat loose, right before the race.",
    "Director": "Tal Ordell",
    "Writer": "Tal Ordell",
    "Actors": "Robin 'Pop' Ordell, Charles Roberts, Ray Salmon",
    "Language": "None",
    "Country": "Australia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0018379",
    "tt0017667",
    "tt0017765",
    "tt0018295",
    "tt0017899",
    "tt0019339",
    "tt0167756",
    "tt0017623",
    "tt0017632",
    "tt0017662",
    "tt0017735",
    "tt0017743"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}