{
  "imdbId": "tt0346156",
  "title": "Sky Captain and the World of Tomorrow",
  "year": 2004,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tomorrowtheworld",
      "id": "tomorrowtheworld",
      "title": "Tomorrow, the World!",
      "description": "“Thoughtful film with strong performances” “’The Bad Seed’ Nazi style” “Fredrick March provides the heart” (IMDB reviews quotes). A WW2 home front drama in which an American family takes in a young German refugee, not knowing he’s a brainwashed member of the Hitler Youth. Fredrick March and Betty Field costar at the head of a compact cast of credited actors. Adequate production values. IMDB rating 6.6. Directed by Leslie Fenton. Released in 1944 Complete print (UK edition). CAST NOTE: Skip Homeier’s feature film debut.",
      "fileSize": 1039461112,
      "addedAt": "2026-01-07T00:12:44.285Z",
      "thumbnail": "https://archive.org/services/img/tomorrowtheworld",
      "collection": "feature_films",
      "downloads": 4842
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "106 min",
    "imdbRating": 6.1,
    "imdbVotes": 89747,
    "Genre": "Action, Adventure, Mystery",
    "Plot": "In 1939, an intrepid reporter in New York City makes a connection between the story she's covering, of famous scientists suddenly disappearing around the world, and a recent attack on the city by giant robots. Determined to find the solution to these happenings, she seeks the help of her ex-boyfriend, the Captain of a mercenary legion of pilots. The two are investigating the case when the robots attack the city again, though in a stroke of luck, Sky Captain Harry Joseph \"Joe\" Sullivan's right-hand man Dex (Giovanni Ribisi) is able to locate their source. They then set off on an adventure in search of the evil mastermind behind these schemes, who is bent on creating a utopia and destroying the current world.",
    "Director": "Kerry Conran",
    "Writer": "Kerry Conran",
    "Actors": "Gwyneth Paltrow, Jude Law, Giovanni Ribisi",
    "Language": "English, Tibetan, German",
    "Country": "United Kingdom, Italy, United States",
    "Awards": "8 wins & 19 nominations total"
  },
  "relatedMovies": [
    "tt0398913",
    "tt0810817",
    "tt0377062",
    "tt0988045",
    "tt1132130",
    "tt0112715",
    "tt0028776",
    "tt0011753",
    "tt0036439",
    "tt0441263",
    "tt5361488",
    "tt0098179"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.285Z"
}