{
  "movieId": "tt0372119",
  "title": "Across the Mexican Line",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-across-the-mexican-line",
      "id": "silent-across-the-mexican-line",
      "title": "Across the Mexican Line",
      "fileSize": 878099978,
      "addedAt": "2026-01-07T00:10:50.367Z",
      "thumbnail": "https://archive.org/services/img/silent-across-the-mexican-line",
      "year": 1911,
      "collection": "feature_films",
      "downloads": 994
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "13 min",
    "imdbRating": 5.6,
    "imdbVotes": 31,
    "Genre": "Short, War",
    "Plot": "A Mexican officer is desirous of obtaining the intentions of the American troops. He converses with Decastro, who suggests that they send Juanita, a Spanish girl, into the American line. Juanita succeeds in getting acquainted with Lieutenant Harvey, of the American troops. Harvey teaches her telegraphy. Juanita, so far, has not been successful in securing any information that would be of use to the Mexican government, so she plans to admit Decastro into the telegraph office, when on one is there but the lieutenant. Decastro, after a struggle, subdues the lieutenant, and carries him to the Mexican general. Juanita, who is in love with the lieutenant, takes good care that no harm is done to her lover, and plans his rescue. The Mexican general orders that he give him all the information he can. He promptly refuses. Juanita interrupts and asks to be left alone with Harvey. Her request is granted. Now she plans his rescue. She dashes away to a telegraph pole, climbs, taps the wires, connects them with her instrument and is successful in conveying the news to the American troops. Enraged at the apparent treachery of Juanita and the persistent refusal of Harvey, the Mexican officer determines that the lieutenant be shot at sunrise. The execution is interrupted by the arrival of the American troops and Lieutenant Harvey is restored to his freedom and the loving arms of his sweetheart.",
    "Director": "Alice Guy",
    "Writer": "N/A",
    "Actors": "Romaine Fielding, Frances Gibson",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0210599",
    "tt0210675",
    "tt0256909",
    "tt1289621",
    "tt0002983",
    "tt1389556",
    "tt0210835",
    "tt0001913",
    "tt0001680",
    "tt0002083",
    "tt0001265",
    "tt0001227"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}