{
  "imdbId": "tt0316226",
  "title": "The Martyred Presidents",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Martyred_Presidents_1901",
      "id": "The_Martyred_Presidents_1901",
      "title": "The Martyred Presidents - Lincoln, Garfield, McKinley",
      "description": "From an Edison film company catalog: \"The scene opens with a beautiful woman who represents Columbia seated at the altar of Justice. As if from out of space there slowly appears a perfect and lifelike picture of Abraham Lincoln. The forming of the picture is first noticed by the appearance of what seems to be a mere spot on the front of the altar. This spot slowly enlarges and is focused into shape, until, to the amazement of the audience, the face of the great emancipator is clearly shown. President Lincoln's likeness is allowed to remain upon the altar just long enough for recognition, when, in the same mysterious manner that it appeared, it slowly fades and in its place their grows the picture of President Garfield. This in a like manner fades away, and again as out of the dim distance comes the picture of our great martyred President, William McKinley. The tableau is then dissolved into a picture of an assassin kneeling before the throne of Justice. Here the tableau ends, leaving an impression of mingled sorrow and sublimity upon the audience.\" A film in Library of Congress Motion Picture, Broadcasting and Recorded Sound Division",
      "fileSize": 26321358,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Martyred_Presidents_1901",
      "year": 1901,
      "collection": "feature_films",
      "downloads": 8192
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "1 min",
    "imdbRating": 3.8,
    "imdbVotes": 202,
    "Genre": "Short",
    "Plot": "This film is difficult to classify. It opens on a scene showing a mourner with bowed head sitting in front of what appears to be a tombstone. Shortly afterwards, the face of Abraham Lincoln and then of two other presidents, Garfield and McKinley, can be seen on the monument and then they disappear. There is a figure huddled at the foot of a statue of Justice, as if asking forgiveness.",
    "Director": "Edwin S. Porter",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000346",
    "tt0232263",
    "tt0348794",
    "tt0000301",
    "tt0366268",
    "tt0245125",
    "tt0000321",
    "tt0232181",
    "tt0477387",
    "tt0000471",
    "tt0231868",
    "tt0273542"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}