{
  "imdbId": "tt0388143",
  "title": "Jamaeui hwawon",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OAwm06Mc-jU",
      "id": "OAwm06Mc-jU",
      "title": "Sisters' Garden (Jamaeui Hwawon)(1959)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00508\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00508\n\n영화글 : https://www.kmdb.or.kr/story/10/504\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희,최지희,김석훈,김승호,안성기,남궁원,주선태,최남현,한은진,나애심,성소민,고선애\n\n줄거리 : 아버지 남박사는 큰딸 정희(최은희)에게 화가 동수(남궁원)와 결혼하라는 유언을 남기고 죽는다. 아버지의 빚보증으로 집이 넘어갈 위기에 처하는데, 남박사의 도움으로 대학 공부까지 한 젊은 의사 순철(김석훈)은 자신의 집을 팔아서 정희를 돕는다. 순철은 정희를 사랑하지만, 남박사의 유언 때문에 자신의 감정을 말하지 못한다. 정희는 가정의 생계를 책임지기 위해 직업을 구하는데, 남박사 덕분에 병을 고친 방사장(김승호)은 정희에게 요정 마담 자리를 권유한다. 한편 동생 명희(최지희)는 동수와 사랑하는 사이로 발전해서 결혼을 약속한다. 정희는 그들의 행복을 빌어주고 요정의 경영을 맡아 일한다. 방사장의 청혼을 받은 정희는 이를 승낙하려고 하는데, 순철은 정희에게 사랑을 고백을 한다. 순철의 맘을 알게 된 방사장이 떠남으로써 순철과 정희는 맺어진다.\n\nCasts : Choi Eun-Hee, Choi Ji-Hee, NamGung Won\n\nSYNOPSIS : Dr. Nam, in his will, requests that his eldest daughter, Jeong-hui(Choe Eun-hui), marry a painter named Dong-su (Won Nam-gung). Jeong-hui is at risk of losing her house due to her father's debt, and a young physician Sun-cheol (Kim Seok-hun) who received his college education with the financial support of Dr. Nam, helps her by selling his own house. Despite his love for her, Sun-cheol cannot express his feelings because he knows of the request in her father's will. When Jeong-hui looks for a job to support her family, Bang, whom Dr. Nam once cured, offers her a position of saloon madam. Meanwhile, her younger sister Myeong-hui (Choe Ji-hui) promises Dong-su her hand in marriage. Jeong-hui, now running the saloon, wishes them happiness.  It is only when she gets a proposal from Bang and decides to accept it that Sun-cheol confesses his love for her. Moved by Sun-cheol's true affection for her, Bang gives her up, and Sun-cheol and Jeong-hui exchange vows of marriage.",
      "addedAt": "2025-12-26T00:24:15.793Z",
      "thumbnail": "https://i.ytimg.com/vi/OAwm06Mc-jU/hqdefault.jpg?sqp=-oaymwE9CPYBEIoBSFryq4qpAy8IARUAAAAAGAElAADIQj0AgKJDeAHwAQH4Af4EgALgA4oCDAgAEAEYZSBlKGUwDw==&rs=AOn4CLCz9if1vxgCWS07MJtvHmn-_4BW0Q",
      "duration": 6527,
      "language": "ko",
      "year": 1959,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "119 min",
    "imdbRating": 6.3,
    "imdbVotes": 15,
    "Genre": "Drama",
    "Plot": "The Nam family leads a life of upper-middle class luxury. But this wealth lies on unstable foundations, and when the father dies suddenly, Jung-hee, as the new head of the family, finds herself with steep debts and no source of in...",
    "Director": "Shin Sang-ok",
    "Writer": "Nam-sa Jo",
    "Actors": "Choi Eun-hie, Ji-hie Choi, Chun Yu",
    "Language": "Korean",
    "Country": "South Korea",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0388964",
    "tt0388982",
    "tt0388969",
    "tt3213182",
    "tt0052600",
    "tt0052634",
    "tt0052604",
    "tt0052561",
    "tt0053318",
    "tt0052713",
    "tt0053374",
    "tt0053133"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:15:27.045Z"
}