{
  "imdbId": "tt0321231",
  "title": "Andy's Stump Speech",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-andys-stump-speech",
      "id": "silent-andys-stump-speech",
      "title": "Andy's Stump Speech",
      "fileSize": 438587814,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-andys-stump-speech",
      "language": "English",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 502
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "22 min",
    "imdbRating": 5.9,
    "imdbVotes": 63,
    "Genre": "Comedy, Short",
    "Plot": "Currently, among the silent films you can view online from the National Film Preservation Foundation is \"Andy's Stump Speech\". Whether or not it's worth your time watching it probably depends on you. If you love silents and have seen quite a few, this film is for you. But, for the average person who has never seen a silent, it's not exactly a great introduction, as it probably won't do a lot to convince them that silents are well worth seeing (which they are, believe me!). Why do I think this way? Well, there are simply a lot of comedy shorts that are better made and have MANY more laughs. Still, for me, it was worth it.Andy Gump was a character from the comic strip \"The Gumps\" which debuted in 1917 and ran into the 1950s. Sidney Smith's strip was way before my time, but apparently Smith had Andy supposedly run for president starting in 1924 and it continued until the strip's demise! Interestingly, the film makers did get the look of Andy right--complete with an almost absent lower jaw and balding head. Whether or not the character ACTED like Andy is certainly something I cannot say.The film begins with Andy out taking a dip in the pond--leading to rather comical difficulties when goats ate his clothing! This delays Andy from leaving the pond to go make a stump speech in a neighboring town--leading to a crazy chase scene. I loved how it ended--but you'll need to see that for yourself. Suffice to say, it had some lovely moments--but, sadly, it also had some stupid ones--such as the very poor use of a stunt double who clearly was NOT Joe Murphy (who played Gump). Also, the who bees in his pants angle seemed pretty lame--as was his enormous size at the end of the film (he went from normal to HUGE back and forth for no discernible reason). But, it is also fun and worth a peek.",
    "Director": "Norman Taurog",
    "Writer": "Sidney Smith",
    "Actors": "Joe Murphy, Fay Tincher, Jack Morgan",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0015477",
    "tt0014664",
    "tt0141028",
    "tt0014992",
    "tt0015390",
    "tt0014903",
    "tt0014967",
    "tt0015096",
    "tt0014659",
    "tt0014660",
    "tt0014656",
    "tt0014661"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}