{
  "imdbId": "tt0303270",
  "title": "The Evidence of the Film",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheEvidenceOfTheFilm",
      "id": "TheEvidenceOfTheFilm",
      "title": "\"The Evidence of the Film\" (1913) starring Florence La Badie",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   We have included this film in our program to illustrate the work and contributions of Florence La Badie, a star of Silent Hall of Fame. \"The Evidence of the Film\" (1913) is a short crime drama, significant for the fact that it depicts \"film within the film\" as a method of proving innocence and guilt.    In 2001 the film was selected for preservation in the National Film Registry as being \"culturally, historically, or aesthetically significant.\" Let's all give our thanks to Ned Thanhouser for the outstanding work he has done for the past 25+ years in archives around the globe to acquire and publish on DVD and online Thanhouser films starring Florence La Badie.  Directed by                     Lawrence Marston, Edwin Thanhouser Produced by                   Edwin Thanhouser Starring                          William Garwood, Florence La Badie, Marie Eline Distributed by                Mutual Film Release date                    January 10, 1913 Running time                  15 minutes Country                           United States Language                         Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 197289276,
      "addedAt": "2026-01-07T00:06:58.274Z",
      "thumbnail": "https://archive.org/services/img/TheEvidenceOfTheFilm",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 2011
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-evidence-of-the-film",
      "id": "silent-the-evidence-of-the-film",
      "title": "The Evidence of the Film",
      "fileSize": 366300124,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-evidence-of-the-film",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 381
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "15 min",
    "imdbRating": 6.2,
    "imdbVotes": 456,
    "Genre": "Crime, Short",
    "Plot": "A girl who worked in the joining room of a motion picture factory had a little brother, of whom she was very fond. He visited the plant one day, and saw from \"the inside\" how pictures were made. The youngster was a messenger boy, and later was summoned to the office of a broker, and given a package which he was to deliver to a rich woman up town. The woman received the package herself, opened it in his presence, but found only bits of blank paper, instead of the bonds she had expected. At first she suspected the broker, but he clearly proved that, in the presence of two witnesses, he had placed the bonds in an envelope, and carefully sealed them up. The messenger boy protested his innocence, but the woman and the broker both insisted the he be prosecuted, and the weeping child was locked in a cell. His sister pleaded with his accuser, but in vain, and for several days the case against the boy was dark. One morning while joining film the girl happened to glance with extra care at one scene. She thought she recognized her brother, and close examination under a microscope proved to her she was correct. With a cry of joy she rushed to the police station and told the officers in charge she had important evidence. Two detectives accompanied her back to the plant, and saw a scene of a play thrown upon the screen. It revealed the messenger boy, a package in his hand, coming around the corner, whistling merrily. A man close behind him ran into and upset the child, deftly substituted a package he held, for the one the boy had dropped, and then walking down the street, so rapidly that he did not notice the camera. \"Don't you know that man?\" screamed the girl. \"He is the broker who had my brother sent to prison.\" The broker was arrested, and when the evidence of the film was displayed to him, he broke down and confessed. He had hoped by throwing the blame upon the boy to keep the bonds for himself. A long term in prison was his punishment, while the plucky girl was warmly complimented for the shrewd way in which she cleared her little brother.",
    "Director": "Lawrence Marston, Edwin Thanhouser",
    "Writer": "N/A",
    "Actors": "William Garwood, Marie Eline, Florence La Badie",
    "Language": "None",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0002784",
    "tt0002381",
    "tt0002133",
    "tt0002497",
    "tt0002415",
    "tt0444797",
    "tt0002553",
    "tt0003828",
    "tt0405424",
    "tt0002143",
    "tt0002429",
    "tt0001789"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}