{
  "imdbId": "tt0351988",
  "title": "When Rogues Fall Out",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WhenRoguesFallOut",
      "id": "WhenRoguesFallOut",
      "title": "\"When Rogues Fall Out\" (1915) starring Helen Holmes",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   We have included this film in our program to illustrate the work and contributions of our star Helen Holmes. \"When Rogues Fall Out\" is a short action film released at the end of 1915. By that time Helen Holmes had left \"The Hazards of Helen\" and Kalem to make an independent career. She continued working together with director and husband J.P. McGowan, and she also kept her love for railroad adventures. We are showing you a very short surviving clip of the film, in which Helen Holmes has to deal with a life-threatening situation. Directed by                          J.P. McGowan Produced by                        Bison Motion Pictures Scenario by                          Helen Holmes Cinematography                unknown Starring                               Helen Holmes, T.J. McDaniels, W.R. Weber, Leo D. Maloney Distributed by                     Universal Film Manufacturing Company Release date                         December 25, 1915 Running time                      1 min. Country                               United States Language                             Silent, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 9990042,
      "addedAt": "2026-01-07T00:07:11.888Z",
      "thumbnail": "https://archive.org/services/img/WhenRoguesFallOut",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 1302
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Action, Short",
    "Plot": "Holmes, the president of the S.L. Railway, has been trying very hard to secure a new franchise for his company. Frank Hynes, an acquaintance of Helen, the daughter of Holmes, has been a friendly visitor at the house, but, unknown to Helen and her father, is trying in every way possible to prevent Holmes from obtaining the franchise. Hynes, sometime later, learns that Holmes has obtained the franchise and, with the aid of Ben White, a dope fiend, and some of the latter's pals, the papers are stolen that night from Holmes' office. Hynes is working hand in hand with some of the dissatisfied members of the board, who are trying in every way possible to oust Holmes from the presidency. He takes the papers to them and tells them that he can \"railroad\" the one man who is likely to squeal about getting the papers. Hynes then phones the police, giving them White's address and telling the police that they can capture him there. White, however, before giving the papers to Hynes had made a photographic copy of them. The police capture White, and through Hynes' testimony he is sent up for ten years. On the way to prison White jumps out of the car window into a boat and is assisted to escape by two of his friends. Helen leaves for a trip to the beach and while there makes the acquaintance of White. As soon as White is settled in safety he wires Holmes asking what he will give for a copy of the franchise, giving a fictitious address for answer. Hynes learns of this and details detectives to locate White and re-arrest, him. They trace the message back and find that White is stopping at the same hotel with Helen. Hynes hastens to the beach, and confronting White, tells him that if he does not give him the papers that he will have him re-arrested. By means of a sleeping gas forced into his room White is rendered unconscious, but as he has a presentiment of coming trouble he writes a note telling where the papers can be found and drops it out of the window. Helen's maid, while dusting near the window, sees the note and gives it to her, and Helen, realizing the importance of the information to her father, starts out in a car to take it to him. Hynes learns of her mission and goes in pursuit. Helen, seeing that she is about to be overtaken by Hynes, succeeds in boarding a moving freight train, and, riding that for a short distance, jumps off on top of a streetcar. Hynes is thrown off the trail and Helen arrives home just as her father is about to be ousted from the presidency. White returns and confides all to Holmes. Hynes is then arrested and during the trial White is given his freedom. As the story ends, White is on the way toward leading a better life with the active assistance of Helen.",
    "Director": "J.P. McGowan",
    "Writer": "Helen Holmes",
    "Actors": "Helen Holmes, T.J. McDaniels, W.R. Weber",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1488156",
    "tt1487926",
    "tt1316468",
    "tt1488145",
    "tt0003755",
    "tt0018654",
    "tt0016749",
    "tt0015201",
    "tt0005654",
    "tt0003734",
    "tt0003662",
    "tt0021945"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.888Z"
}