{
  "movieId": "tt0336751",
  "title": "Life Story of John Lee, or The Man They Could Not Hang",
  "year": 1921,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-life-story-of-john-lee-or-the-man-they-could-not-hang",
      "id": "silent-life-story-of-john-lee-or-the-man-they-could-not-hang",
      "title": "Life Story of John Lee, or The Man They Could Not Hang",
      "fileSize": 1537650507,
      "addedAt": "2026-01-07T00:11:07.408Z",
      "thumbnail": "https://archive.org/services/img/silent-life-story-of-john-lee-or-the-man-they-could-not-hang",
      "year": 1921,
      "collection": "feature_films",
      "downloads": 338
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "88 min",
    "imdbRating": 6,
    "imdbVotes": 19,
    "Genre": "Drama",
    "Plot": "John \"Barracombe\" Lee was convicted on thin evidence of killing his employer, Emma Keyse, and sentenced to hang on 23 February 1885. When the trap failed to open three times, the attending medical officer balked at a fourth try. Lee's sentence was commuted to life imprisonment. He was released in 1907, made a living by lecturing on the miracle, then dropped from sight around 1916. The date and circumstances of his death are uncertain. there are claims he died in a workhouse during World War Two. Another possibility is that he died in the United States in 1945. If you go to Milwaukee, there's a gravestone with that unusual name on it. There is a Fairport Convention song about him, \"Barracombe\", and this Australian film.As a story, it's as thin as the evidence of Lee's conviction. The camerawork and editing are good, and the titles are set in the first person singular. The actor who plays Lee looks to be about Lee's age and the story the titles tell falls short. in an early sequence, Lee desires to join the Royal Navy, contrary to his father's wishes. When asked why, his father explains his own father was a fisherman who \"put to sea, as was the custom\" and drowned one stormy night; this only serves to strengthen Lee's desire to join the Navy. Later, Lee develops a strong belief that his salvation was a miracle. This undoubtedly played well on the lecture circuit.The movie has some interest as a survivor of Australia's silent era. Unhappily, it does not argue for a high standard of the national cinema.",
    "Director": "Arthur W. Sterry",
    "Writer": "Arthur W. Sterry",
    "Actors": "Rose Rooney, David Edelsten",
    "Language": "None",
    "Country": "Australia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0011904",
    "tt0012027",
    "tt0012190",
    "tt0012397",
    "tt0012465",
    "tt0012532",
    "tt0011953",
    "tt0011907",
    "tt0012068",
    "tt0012364",
    "tt0012657",
    "tt0012675"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.408Z"
}