{
  "imdbId": "tt0329121",
  "title": "The Girl Ranchers",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-girl-ranchers",
      "id": "silent-the-girl-ranchers",
      "title": "The Girl Ranchers",
      "fileSize": 472472192,
      "addedAt": "2026-01-07T00:11:15.976Z",
      "thumbnail": "https://archive.org/services/img/silent-the-girl-ranchers",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 298
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 5.5,
    "imdbVotes": 36,
    "Genre": "Short, Comedy, Western",
    "Plot": "Mrs. Houston and her daughters in an eastern city receive an unexpected telegram from the west, informing them of their heritage of \"Rough Neck Ranch\" together with inquiry as to its management. In spite of Mrs. Houston's protests, her daughters decide to manage their own ranch and promptly wire information to that effect. The foreman, upon receipt of the message, reports the unexpected outcome to the punchers, who give utterance in chorus, \"That no darn skirt bosses the ranch.\" In time Mrs. Houston and her daughters arrive at a small western station, where they are saluted by several rounds of ammunition, piled into a buckboard and driven to \"Rough Neck Ranch.\" Mrs. Houston finds things rather untidy and proceeds to adjust them in accordance with her feminine tastes. Having learned the art of fine pastry and fudge she gives a sample of her pies to Lee, who is immediately transformed into an ardent admirer. After a few days a general change is in evidence throughout the ranch, which has been renamed \"Maidens' Rest.\" The arrival of other girlfriends adds to the befitting of its new christening. The punchers unable to tolerate the female monarchs, openly rebel. The girls, in answer to their demand, stick up their noses and prepare to care for the ranch duties themselves. The punchers amusingly watch their preparations in various undertakings. In the meantime the Indians have gone upon the warpath and happen upon \"The Maidens' Rest.\" Finding no male opposition, they immediately prepare to carry off the would-be strike breakers, who for the first time give utterance in their prayers for \"man,\" which is promptly answered by the arrival of the punchers, who put the Indians to flight. A fuller consideration as to the need and uses of \"man\" having been deeply manifested, an inseparable unit becomes apparent between both species at \"Rough Neck,\" alias \"Maidens' Rest\" Ranch.",
    "Director": "Al Christie",
    "Writer": "N/A",
    "Actors": "Lee Moran, Stella Adams, Marie Walcamp",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0233246",
    "tt0003943",
    "tt0025187",
    "tt0248079",
    "tt0006801",
    "tt0006913",
    "tt0015477",
    "tt0003177",
    "tt0003417",
    "tt0002663",
    "tt0002755",
    "tt0012543"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.976Z"
}