{
  "movieId": "tt0374248",
  "title": "Strings",
  "year": 2004,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3R427YB34p0",
      "id": "3R427YB34p0",
      "title": "Strings | Full Drama Movie",
      "description": "Strings - After years of paying his dues in every bar from New York to Pennsylvania, rocker Jimmy Ford trades in his rock n' roll fantasy for the bright lights of Nashville. Success proves elusive until Malinda Price, an up-and-coming country singer, takes an interest in him. But just as his career and personal life begin to take off his past comes calling, reminding him there are always strings attached.\n**Under non-exclusive license from Total Content Digital.  All rights reserved**\n2018.  Stars: Jason Michael Carroll, Katie Garfield, Robert Wagner\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:39.896Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/3R427YB34p0/maxresdefault.webp",
      "duration": 6200,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "91 min",
    "imdbRating": 6.9,
    "imdbVotes": 4444,
    "Genre": "Adventure, Drama, Fantasy",
    "Plot": "Hal Tara is the son of The Kahro of the city of Hebalon and heir to the throne. When The Kahro kills himself, Hal is chosen to taken his place to rule Hebalon. But the discovery of The Kahro's suicide letter, that his father's death was no suicide, and was conducted by rivals of the city known as The Zeriths, Hal disguising himself as a commoner leaves the city and sets out to find the Zeriths and avenge his father. But Nezo, The Kahro's evil advisor who discovered the Kahro's body sends a warrior known as Erito to join Hal and to kill him. Entering the Zerith's camp, unaware of his identity, Hal falls in love with Zita, a Zerith female warrior, unaware Nezo has evil schemes to take over ruler ship of the city and Erito's wife Eike and Hal's sister Jhinna have uncovered his evil plot.",
    "Director": "Anders Rønnow Klarlund",
    "Writer": "Naja Marie Aidt, Anders Rønnow Klarlund",
    "Actors": "James McAvoy, Catherine McCormack, Julian Glover",
    "Language": "English, Danish, Norwegian, Swedish",
    "Country": "Denmark, Sweden, Norway, United Kingdom, Japan",
    "Awards": "3 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt1135493",
    "tt1132130",
    "tt1294699",
    "tt0377062",
    "tt0055117",
    "tt0056211",
    "tt0061549",
    "tt0029162",
    "tt4404296",
    "tt3159412",
    "tt0002130",
    "tt0015174"
  ],
  "collections": [
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:17:54.174Z"
}