{
  "movieId": "tt0326373",
  "title": "A Trip to Jupiter",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AncreSegundoDeChomonViajeAJupiter",
      "id": "AncreSegundoDeChomonViajeAJupiter",
      "title": "A Trip to Jupiter (1909)",
      "description": "The King and his official astronomer are alone in the study viewing the heavenly bodies through the monstrous telescope. They go out on the balcony and the gay old ruler is much absorbed in the phenomenon, and spends some time in studying the stars and planets. The evening has been well spent with the many mysteries which have made such a deep impression upon the King's mind that they are still with him in his dreams. Upon retiring for the night he has a wonderful nightmare, in which he imagines that he is climbing up a long ladder to the planet Jupiter. He passes all the other planets and receives an official salute from each one in honor of his exalted position upon the earth. Finally arriving at Jupiter, he is admitted to the palace of the King, where he is granted an audience with the high potentate. They become so effusive in their welcome and so strenuous in their mode of entertaining that he wishes to be back on earth once more. Finally, after witnessing all that is to be seen,... Source: http://www.youtube.com/watch?v=LyXxJ9kP0VQ IMDB: http://www.imdb.com/title/tt0326373/?ref_=nm_flmg_dr_81",
      "fileSize": 83534915,
      "addedAt": "2026-01-07T00:06:09.635Z",
      "thumbnail": "https://archive.org/services/img/AncreSegundoDeChomonViajeAJupiter",
      "language": "fre",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 4553
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 6.4,
    "imdbVotes": 316,
    "Genre": "Short, Sci-Fi",
    "Plot": "The King and his official astronomer are alone in the study viewing the heavenly bodies through the monstrous telescope. They go out on the balcony and the gay old ruler is much absorbed in the phenomenon, and spends some time in studying the stars and planets. The evening has been well spent with the many mysteries which have made such a deep impression upon the King's mind that they are still with him in his dreams. Upon retiring for the night he has a wonderful nightmare, in which he imagines that he is climbing up a long ladder to the planet Jupiter. He passes all the other planets and receives an official salute from each one in honor of his exalted position upon the earth. Finally arriving at Jupiter, he is admitted to the palace of the King, where he is granted an audience with the high potentate. They become so effusive in their welcome and so strenuous in their mode of entertaining that he wishes to be back on earth once more. Finally, after witnessing all that is to be seen, he expresses a desire to return home, so he is picked up bodily and thrown off of the planet, but luckily for him he grabs the ladder and starts to descend. As he is passing Mercury, someone cuts the ladder, his royal highness is precipitated through the air, where he lands with an awful bump on earth. And then he woke up, only to find himself groveling on the floor of his room.",
    "Director": "Segundo de Chomón",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0449252",
    "tt0432623",
    "tt0855966",
    "tt0450089",
    "tt0257889",
    "tt0449438",
    "tt8646230",
    "tt2079489",
    "tt0249655",
    "tt0449817",
    "tt0298525",
    "tt0449172"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.635Z"
}