{
  "imdbId": "tt0364699",
  "title": "Whistle in the Night",
  "year": 1947,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1947fearinthenightmiedoenlanochemaxwellshane",
      "id": "1947fearinthenightmiedoenlanochemaxwellshane",
      "title": "1947 - Fear in the Night - Miedo en la noche - Maxwell Shane",
      "description": "1947 - Fear in the Night - Miedo en la noche - Maxwell Shane",
      "fileSize": 394784644,
      "addedAt": "2026-01-07T00:06:03.998Z",
      "thumbnail": "https://archive.org/services/img/1947fearinthenightmiedoenlanochemaxwellshane",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 1807
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/FearInTheNight",
      "id": "FearInTheNight",
      "title": "Fear in the Night",
      "description": "DeForest Kelley in a Cornell Woolrich story. This is a better copy than what is already on this site.",
      "fileSize": 1187778048,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/FearInTheNight",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 57702
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Fear_in_the_Night",
      "id": "Fear_in_the_Night",
      "title": "Fear in the Night",
      "description": "A film noir shocker, based on the story Nightmare by Cornell Woorlich, in which average Joe Vince Grayson (De Forest Kelley) dreams he murders someone and wakes up to find it may not have been a dream. This is worth it for the clever plot twists alone.",
      "fileSize": 1720771307,
      "addedAt": "2026-01-07T00:06:25.398Z",
      "thumbnail": "https://archive.org/services/img/Fear_in_the_Night",
      "year": 1947,
      "collection": "feature_films",
      "downloads": 116735
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KSp4XCSDbWI",
      "id": "KSp4XCSDbWI",
      "title": "Fear in the Night (1947) [Film Noir] [Drama]",
      "description": "Fear in the Night is an American low budget black-and-white film noir directed by Maxwell Shane and starring Paul Kelly and DeForest Kelley (in his film debut). It is based on the Cornell Woolrich story \"And So to Death\" (retitled '\"Nightmare\" in 1943). Woolrich is credited under pen name William Irish. The film was remade by the same director in 1956 with the title Nightmare this time starring Edward G. Robinson playing the cop and Kevin McCarthy.\n\nBank teller Vince Grayson (DeForest Kelley) dreams that he stabs a man in an octagonal room of mirrors and locks the body in a closet. When he wakes up, he discovers marks on his throat, a strange key and a button in his pocket, and blood on his cuff. Cliff Herlihy (Paul Kelly), his police officer brother-in-law, tries to convince him it was just a dream. A few days later, while trying to find cover from the rain, the pair finds themselves taking shelter in the strange house from Vince's dream. They discover that the police found two bodies in the house, one in the mirrored room and one run over in the driveway. Mrs. Belknap, who was run over by a car, gave the police a description matching Vince before she died.\n\nAt first Vince is hopeful that he is innocent because he does not know how to drive, but he recognizes the victims from his dream. Overcome with remorse, he attempts suicide, but is rescued by Cliff. The detective uncovers clues that point to an evil hypnotist (Robert Emmett Keane) manipulating Vince. They realize that the hypnotist is actually Mr. Belknap in disguise and try to trap him by pretending that Vince wants hush money. Belknap puts Vince under hypnosis and tries to get him to drown himself. Cliff rescues him from the lake and Mr. Belknap is killed in a car accident as he is trying to evade the police. It is implied that Vince will be acquitted of all charges since he killed the man in the mirrored room in self defense.\n\n\"The Amazing Mr. X\", also known as \"The Spiritualist\", is a film noir directed by Bernard Vorhaus with cinematography by John Alton. Like \"Nightmare Alley\" (1947), this film tells the story of a phony spiritualist racket. The film is prominently featured in Alton's book on cinematography \"Painting with Light\" (1949). The film stars Turhan Bey, Lynn Bari, Cathy O'Donnell, and Richard Carlson. Eagle-Lion Films signed a contract with Carole Landis for the part played by Bari, but Landis committed suicide a few days before shooting began.\n\nTwo years after her husband's death, Christine Faber (Lynn Bari) thinks she hears her late husband (Donald Curtis) calling out of the surf on the beach one night.\nShe meets a tall dark man named Alexis (Turhan Bey) who seems to know all about her. After more ghostly manifestations, Christine and her younger sister (Cathy O'Donnell) become enmeshed in the strange life of Alexis; but he in turn finds himself manipulated into deeper cruelness than he had in mind.\n\n---\n\nDirected by Maxwell Shane, produced by William H. Pine and William C. Thomas, written by Cornell Woolrich (story Nightmare as William Irish) and Maxwell Shane, starring Paul Kelly, DeForest Kelley, Ann Doran and Kay Scott.\n\n---\n\nSource: \"Fear in the Night (1947 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 9 March 2013. Web. 12 March 2013. http://en.wikipedia.org/wiki/Fear_in_the_Night_(1947_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:43.849Z",
      "thumbnail": "https://i.ytimg.com/vi/KSp4XCSDbWI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAXLgabSXuDruuerUMKioCb7uKxmg",
      "duration": 4247,
      "language": "en",
      "year": 1947,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5_ozGYt5fck",
      "id": "5_ozGYt5fck",
      "title": "Fear in the Night (1947) DeFOREST KELLEY",
      "description": "Stars: DeForest Kelley, Paul Kelly, Ann Doran\nDirector: Maxwell Shane\nWriter: Cornell Woolrich (story)\n\nThis Film Noir classic Stars DeForest Kelley of STAR TREK! A young man dreams he committed a murder, but when he wakes with blood on his sleeve he is convinced it was real! Based on a story by master of suspense Cornel Woolrich.",
      "addedAt": "2025-12-26T23:56:59.392Z",
      "thumbnail": "https://i.ytimg.com/vi/5_ozGYt5fck/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB8gSAAuADigIMCAAQARhcIFwoXDAP&rs=AOn4CLD0qnOYEQPqWMoa5RAci5Yw9MauLQ",
      "duration": 4262,
      "language": "en",
      "year": 1947,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "17 min",
    "imdbVotes": null,
    "Genre": "Documentary, Short",
    "Plot": "A look at post-war American railroads during their conversion to peace, operating under the handicap of little to no new equipment. It then looks at the plans for the future designed to provide swifter, safer and more comfortable traveling for the American public. Swifter is about all that is now left of the plans detailed in this 1947 short. The vast majority of the American public has no access to rail travel, all of the depots are gone, along with thousands and thousands of miles of track, and railroading is now a shipping service, mostly of truck trailers and containers. No complaints, other than most wish they could have at least kept the mournful, lonely and lovely sound of the old steam whistle. Diesel horns in the night have inspired very few songs or dreams. The essence of railroading, for older America, is captured in the title of this short.",
    "Director": "Larry O'Reilly",
    "Writer": "Philip H. Reisman Jr.",
    "Actors": "Dwight Weist",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt6045006",
    "tt0038171",
    "tt1523561",
    "tt0190806",
    "tt0038264",
    "tt0038175",
    "tt15527684",
    "tt0276867",
    "tt1772258",
    "tt8835616",
    "tt0036630",
    "tt0041891"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.398Z"
}