{
  "movieId": "tt0343630",
  "title": "Elvis Lives",
  "year": 2002,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=M8zf4Ex2VJM",
      "id": "M8zf4Ex2VJM",
      "title": "Elvis Lives | Full Elvis Movie!",
      "description": "Elvis Lives - Plagued by heavy addiction and his failing voice, The King is desperate to make things right with himself, his deceased brother, and God. His attempts to get back on track are thwarted, however, after he helps the cops bring down a powerful crime syndicate-putting his family in danger and sending him on a journey that will change his life forever.\n2016. Stars: Jonathan Nation, Doug Burch, Sallieu Sesay\n**Under license from The Asylum.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#ElvisNewMovie #ElvisLives #ElvisNotDead",
      "addedAt": "2025-12-27T00:11:12.756Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/M8zf4Ex2VJM/maxresdefault.webp",
      "duration": 5140,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "NZ",
          "PH",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "45 min",
    "imdbRating": 5.7,
    "imdbVotes": 71,
    "Genre": "Music",
    "Plot": "Elvis Lives aired on NBC Thanksgiving 2002 to promote the recent smash release ELV1S 30 #1 Hits by BMG.  Rather than a documentary of Elvis' career, this television special was more of a testimonial documentary featuring contemporary people from the music, television, film and sports world giving their thoughts regarding Elvis.  Originally this television special was approximately 45 minutes long but an expanded 100 minute home video/DVD is to be released in late October 2003 by BMG Home Entertainment. Also worth noting is that BMG Home Entertainment is to release the comprehensive Elvis Aloha From Hawaii and the '68 Comeback Special DVDs in the near future, possibly in October as well.",
    "Director": "N/A",
    "Writer": "David Wild",
    "Actors": "Chris Isaak, Kevin Bacon, Carter Beauford",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1706329",
    "tt0430019",
    "tt0192101",
    "tt1053360",
    "tt2527618",
    "tt1706486",
    "tt0468845",
    "tt1893340",
    "tt0229761",
    "tt0177778",
    "tt1876490",
    "tt0430477"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:23:16.697Z"
}