{
  "movieId": "tt0315206",
  "title": "Ball & Chain",
  "year": 2004,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SHlMeAtxTuA",
      "id": "SHlMeAtxTuA",
      "title": "Ball & Chain - Starring Kal Penn - Full Movie",
      "description": "Click here to watch great FREE Movies & TV: http://filmrise.com\n\nWhen Ameet and Saima's Indian-American families arrange for them to be married they will do anything to get out of the situation. In their desperation to have the wedding called off, they fail to realize that they have actually fallen in love. By now however Saima's parents have promised her hand to a sleazy playboy, Ashol. Culture and customs clash in this hilarious and delightful comedy.\n\n#freemovies #moviesondemand #fullmovie",
      "addedAt": "2025-12-26T21:41:46.706Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/SHlMeAtxTuA/maxresdefault.webp",
      "duration": 5403,
      "language": "en",
      "channelName": "FilmRise Movies",
      "channelId": "UC8IHAQMuiJdY6ALuhG7iU8Q",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "90 min",
    "imdbRating": 4.5,
    "imdbVotes": 630,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Saima is a second-generation East Indian-American, living in Austin, Texas, along with her dad, mom, and brother, Dev. Her dad considers her an old maid and wants her to get married to Ameet much to her displeasure as she dislikes him. Her dad wants their marriage to be telecast via Internet so that their extended family in India can e-participate in the ceremony. After her not-so-good-looking friend, Ruby, gets married, albeit dramatically to Bobby, Ameet's friend, Her dad pressurizes her and even manages to convince her, she appears to change her mind but secretly meets with Ameet and together they create a series of misunderstandings with Ameet revealing his secret desire of becoming a male stripper during their formal engagement. They do succeed in getting their wedding canceled, but then Saima is faced with another challenge when her dad wants her to get married to Ashol, a Computer Programmer, who she also dislikes. The question does remain will Saima be compelled to go through another charade, and will Ashol be ready to along with her?",
    "Director": "Shiraz Jafri",
    "Writer": "Thomas Mortimer",
    "Actors": "Sunil Malhotra, Lisa Ray, Purva Bedi",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0341372",
    "tt0364517",
    "tt0483726",
    "tt0296686",
    "tt0425326",
    "tt0452594",
    "tt0466839",
    "tt0944958",
    "tt0303243",
    "tt0229397",
    "tt0363780",
    "tt0199744"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:24:31.000Z"
}