{
  "movieId": "tt0398672",
  "title": "Ali Baba and the Forty Thieves",
  "year": 1902,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ali-baba-and-the-forty-thieves-1902-directed-by-ferdinand-zecca",
      "id": "ali-baba-and-the-forty-thieves-1902-directed-by-ferdinand-zecca",
      "title": "Ali Baba And The Forty Thieves (1902) Directed By Ferdinand Zecca",
      "description": "Ali Baba and the Forty Thieves (1902) 'Ali Baba et les quarante voleurs' Director: Ferdinand Zecca Ali Baba et les quarante voleurs (English: Ali Baba and the Forty Thieves) is a 1902 French short silent film directed by Ferdinand Zecca, inspired by the eponymous folk tale added to the One Thousand and One Nights in the 18th century by its French translator Antoine Galland, who heard it from the Maronite storyteller Hanna Diyab. It is the first cinematographic adaptation of this tale. Plot: The film is composed of seven scenes introduced by intertitles: \"Open sesame!\" While gathering wood in the forest, Ali Baba, accompanied by his donkey, surprises a gang of thieves carrying their loot. He hides and overhears the magic spell that gives access to the cave where they pile up their treasures. \"The thieves' treasure\" Once the thieves are gone, he enters the lair, takes a few bags of gold coins and runs back home. \"Rich at last!\" Ali Baba comes back to his house where his wife is expecting him. She is overjoyed when she sees the gold. Cassim, Ali's brother, arrives at that moment and Ali Baba tells him how he got the gold. Cassim dashes off to the cave. \"Cassim is discovered and executed\" In the cave Cassim is awed by the accumulated treasures but he suddenly hears the 40 thieves coming back. He hides behind a treasure chest while the thieves are celebrating their latest plunder with dancing girls but he is soon discovered. He pleads for his life, revealing that Ali Baba had given him the magic spell but the chief cuts off his head. \"Brigands discovered by the maid\" Forty jars of oil are delivered in the courtyard of Ali Baba's new mansion. Ali Baba thanks the oil merchant and invites him to dinner. A maid enters and sees that thieves are hidden in the jars. She takes a jar of boiling oil and pours it into the forty jars. \"The fake oil merchant\" In the dining room of Ali Baba's mansion, Ali Baba enters and sits down with his wife and the oil merchant (in fact the chief of the thieves). Dancing girls entertain the guests. Suddenly the maid enters and stabs the fake oil merchant in the heart. \"Triumph of Ali Baba - Apotheosis\" Ali Baba and his wife pose with pretty girls in front of a lavishly decorated backdrop. Production: According to certain sources, the director was Albert Capellani, under supervision of Ferdinand Zecca.[3] On the other hand, the website of the Fondation Jérôme Seydoux-Pathé only indicates Ferdinand Zecca as director.[2] The film was hand colored by Segundo de Chomón, using the mechanical stencil-based film tinting process for movies later patented as Pathécolor. -From Wikipedia",
      "fileSize": 41791019,
      "addedAt": "2026-01-07T00:07:24.998Z",
      "thumbnail": "https://archive.org/services/img/ali-baba-and-the-forty-thieves-1902-directed-by-ferdinand-zecca",
      "year": 1902,
      "collection": "feature_films",
      "downloads": 180
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-ali-baba-and-the-forty-thieves",
      "id": "silent-ali-baba-and-the-forty-thieves",
      "title": "Ali Baba and the Forty Thieves",
      "fileSize": 183385255,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-ali-baba-and-the-forty-thieves",
      "language": "French",
      "year": 1902,
      "collection": "feature_films",
      "downloads": 2006
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 6.1,
    "imdbVotes": 478,
    "Genre": "Adventure, Short",
    "Plot": "An early adaptation of the Ali Baba tale.",
    "Director": "Ferdinand Zecca",
    "Writer": "Ferdinand Zecca",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000416",
    "tt0258104",
    "tt0000417",
    "tt0000439",
    "tt0000465",
    "tt2654324",
    "tt0364559",
    "tt1090191",
    "tt0366268",
    "tt0471108",
    "tt1090193",
    "tt1741513"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}