{
  "imdbId": "tt0306032",
  "title": "Rudolph Valentino and His 88 American Beauties",
  "year": 1923,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheEagleRudolphValentinoAppleTV2ndGen..mp4",
      "id": "TheEagleRudolphValentinoAppleTV2ndGen..mp4",
      "title": "The Eagle (Rudolph Valentino)",
      "description": "1925 directed by Clarence Brown starring Rudolph Valentino as Drubovsky, Vilma Banky as Mascha, Louise Dresser as the Czarina, Albert Conti as Kuschka and James A. Marcus as Kryilla. After witnessing the daring rescue of a runaway carriage by the dashing, young Lieutenant Dubrovski, (Valentino), a smitten Czarina orders him to attend a private dinner. After a few drinks, the middle aged Czarina begins feeling a little lusty and exits to change into something more comfortable. The young Lieutenant, rightly horrified at the prospect of pressing against that pasty, sagging middle-aged babe-flesh, makes a hasty getaway. The re-buffed Czarina, duly chagrined, orders that the Lieutenant be arrested as a deserter, and has his ancestral estate seized then sold to the seedy Kryilla. Swearing revenge, the Lieutenant goes into hiding then surfaces as a masked avenger known as The Eagle. Like Clark Kent's glasses, the tiny mask seems to be enough to hide his identity. Will The Eagle reclaim his stolen lands and also win the hand of the girl he loves, who happens to be the daughter of the said, seedy Kryilla? And will the re-buffed Czarina, still a girl at heart and unable to restrain her lusty nature, find love with a man closer to her own age who can still see her as a tasty morsel?",
      "fileSize": 2377097701,
      "addedAt": "2026-01-07T00:06:58.274Z",
      "thumbnail": "https://archive.org/services/img/TheEagleRudolphValentinoAppleTV2ndGen..mp4",
      "year": 1925,
      "collection": "feature_films",
      "downloads": 6053
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "13 min",
    "imdbRating": 5.2,
    "imdbVotes": 61,
    "Genre": "Documentary, Short",
    "Plot": "Rudolph Valentino and His 88 American Beauties (1923) * 1/2 (out of 4)This short was pretty much just thrown together by David O. Selznick to make a quick buck off of Valentino's popularity. What basically takes place is that 88 different cities had one woman selected to go to New York City where they'd compete in a beauty contest. The winner would be selected by Valentino and that winner would be very happy. That's pretty much what we get here as we get quick clips of the women and of course plenty of shots of Valentino. There's no question that this thing was cheaply thrown together as there's no artistic merit to be found and it's really nothing more than a newsreel with added clips of the star to sell to theater owners to cash in on his name. The only interesting things are seeing what was considered beauty in 1923 and we also get some clips inside Madison Square Garden.",
    "Director": "David O. Selznick",
    "Writer": "N/A",
    "Actors": "Rudolph Valentino, Norma Niblock, Eugenia Gilbert",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt13166260",
    "tt0229789",
    "tt3308046",
    "tt3308002",
    "tt3308008",
    "tt0475127",
    "tt1029374",
    "tt0131468",
    "tt0297449",
    "tt0988639",
    "tt6340186",
    "tt0988738"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.274Z"
}