{
  "imdbId": "tt0330942",
  "title": "The Struggle",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheStruggle1913--Dir.ByThomasInce",
      "title": "THE STRUGGLE (1913) -- dir. by Thomas Ince",
      "description": "THE STRUGGLE (1913) Starring: Red Wing, J. Barney Sherry, Jack Conway Produced and Directed by Thomas Ince Broncho Motion Picture Company William Thomas Sherman, wts@gunjones.com, http://www.mn-hp.com",
      "fileSize": 490261505,
      "id": "TheStruggle1913--Dir.ByThomasInce"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 6,
    "imdbVotes": 31,
    "Genre": "Drama, Short",
    "Plot": "A prospector by the name of Worth, lives with his son, a youth of about 15, and his daughter, a girl of twenty. While father and son are at work a stranger comes to the cabin and is given a meal by Miss Worth, and he repays her generosity by endeavoring to embrace her. She indignantly slaps him and endeavors to escape into another room, but the now thoroughly angered man attempts to bar her way, and it is only after a struggle that she reaches it and bars the door. Little Bob, returning home, hears the noise inside, and finding the door locked, peers through the window. The sight within sends him scurrying to his father, who grabs his gun and runs home. Inside the stranger has succeeded in forcing back the door, and has seized the girl. Gordon breaks the door down with an axe and attacks the intruder, and when Jack rushes in he is brushed aside by the stranger, who is endeavoring to escape. The sight of his dead father on the floor infuriates Jack, and he leaps at the man like a panther, and his attack is so furious that for a few moments the man has his hands full handling the boy, who is finally struck a blow and knocked aside. The stranger mounts his horse and gallops away. Years later Jack is a government scout, and is sent on a mission by the colonel. Stopping at a settlement he enters an inn, where men are playing cards. The stranger, who is a gambler, is cheating, and Jack takes advantage of the situation to interfere. One of the gambler's victims is a consumptive, pale and hollow-eyed, and while Jack is struggling with him the consumptive fires a shot which lays the gambler low. Everyone thinks Jack has fired, and he backs away, leaps on his horse and escapes, a fugitive. Some days later the colonel's daughter is in a stagecoach which is attacked by Indians. From a distant hill Jack sees the driver shot from his seat, and driving the spurs into his horse's flanks, he gallops madly across the hills, and heads it off. Dismounting at a gallop, he catches hold of the coach while the horses are going at break-neck speed, pulls himself to the top and guides the swaying vehicle towards the fort, though severely wounded. The soldiers, hearing the shooting, ride to the rescue, and the colonel is filled with gratitude toward Jack, while his daughter falls in love with him. The news of Jack's heroic deed spreads through the settlements, and the sheriff, who has been looking for him, calls at the fort. The parting is intensely pathetic, as the sheriff dislikes his unwelcome duty, and the colonel is compelled to give up the prisoner, though his daughter weeps bitter tears as Jack is led away, handcuffed. As the sheriff and Jack ride along they are attacked by Indians, and in most thrilling scenes the two fight for their lives. The sheriff unlocks the handcuffs and gives Jack a revolver, and they jump about through the hills, keeping the redskins at a distance. The sheriff is finally wounded, and Jack carries his unconscious form to the top of a hill, where, from behind a huge rock, he makes his last stand. Jack's wounded horse limpingly makes his way back to the fort, mute evidence of what has occurred. The colonel calls out the troop and they gallop madly to the spot from where faint echoes of the shots are carried to their ears. With anger in their hearts, the soldiers dash among the redskins, and a furious battle ensues, in which the Indians are badly routed. Jack and the sheriff are tenderly carried back to the fort and revived, and nursed back to health. The colonel's daughter proves a tender nurse for Jack, but the specter of the charge against Jack hovers over their happiness. The consumptive, who has been guarding his guilty secret, nears his last hours, and in a repentant mood confesses to the physician. The doctor makes haste to lay this confession in the hands of the colonel, and Jack is restored to his position.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Richard Stanton, Elmer Morrow, E.H. Allen",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0470339",
      "title": "The Haunted Bedroom",
      "year": 1913,
      "imdbRating": 6.1,
      "imdbVotes": 27,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0463594",
      "title": "The Marble Heart",
      "year": 1913,
      "imdbRating": 4.7,
      "imdbVotes": 40,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0367144",
      "title": "The Tiniest of Stars",
      "year": 1913,
      "imdbRating": 6,
      "imdbVotes": 25,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0417062",
      "title": "The Portrait of the Lady Anne",
      "year": 1912,
      "imdbRating": 6.8,
      "imdbVotes": 88,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002356",
      "title": "The Melody of Love",
      "year": 1912,
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt2160081",
      "title": "Ammunition Smuggling on the Mexican Border: Incidents of the Mexican Revolution",
      "year": 1914,
      "imdbRating": 6.4,
      "imdbVotes": 24,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1223220",
      "title": "Antony and Cleopatra",
      "year": 1914,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1207008",
      "title": "Never Too Late to Mend",
      "year": 1911,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0812323",
      "title": "The Master of the Sword",
      "year": 1915,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0482779",
      "title": "In the Hands of the Enemy",
      "year": 1915,
      "imdbRating": 5.8,
      "imdbVotes": 26,
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1113818",
      "title": "Richard the Lion-Hearted",
      "year": 1911,
      "imdbRating": 5.7,
      "imdbVotes": 18,
      "language": "None, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0344506",
      "title": "The Two Roses",
      "year": 1910,
      "imdbRating": 5.4,
      "imdbVotes": 48,
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.037Z"
}