{
  "imdbId": "tt0368394",
  "title": "The Unusual Honeymoon",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-unusual-honeymoon",
      "id": "silent-the-unusual-honeymoon",
      "title": "The Unusual Honeymoon",
      "fileSize": 556757252,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-unusual-honeymoon",
      "language": "English",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 349
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "15 min",
    "imdbRating": 4.1,
    "imdbVotes": 24,
    "Genre": "Comedy, Short",
    "Plot": "Newly married Thomas and Mary MacGregor attend the village fair on their honeymoon. The balloon ascension is advertised for the afternoon. Everything is in readiness and Mary induces Thomas to enter the basket of the balloon. Some mischievous boys cut the ropes holding the balloon and it rises, taking the pair on a honeymoon trip entirely unexpected. They travel fast and long until the balloon collapses upon a desert island, among a tribe of cannibals, who think the couple are gods descended from the skies. Thomas deposes the king and runs things with a high hand. The natives, however, as they become better acquainted with Thomas and Mary, realize that they are only human beings like themselves. They decide to put an end to their reign and begin preparations for their execution and cooking. The night before the day they are to be put to death, Thomas and Mary escape to the seashore, where they hail a passing vessel, which lands a boat loaded with men, who rescue the terrified couple.",
    "Director": "James Young",
    "Writer": "N/A",
    "Actors": "Charles Michael Edwards, Flora Finch, Rose Tapley",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002124",
    "tt0001660",
    "tt0002133",
    "tt0002501",
    "tt0215495",
    "tt0002280",
    "tt0210599",
    "tt0002232",
    "tt0002255",
    "tt0002290",
    "tt0002387",
    "tt0002398"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}