{
  "movieId": "tt0353784",
  "title": "Narco terror",
  "year": 1985,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/narco-terror-1985-hd-1080p",
      "id": "narco-terror-1985-hd-1080p",
      "title": "Narco Terror ( 1985)",
      "description": "Mexploitation revenge film about a man who goes against narcos and a treasonous partner",
      "fileSize": 8264398561,
      "addedAt": "2026-01-07T00:10:02.896Z",
      "thumbnail": "https://archive.org/services/img/narco-terror-1985-hd-1080p",
      "language": "spa",
      "year": 1985,
      "collection": "feature_films",
      "downloads": 5989
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 7,
    "imdbVotes": 16,
    "Genre": "Action, Crime, Drama",
    "Plot": "Oh Dear Lord how to begin?I watched this movie because the title was really \"cool\" in my opinion. I mean, Narco AND Terror. Sounded like my kind of entertainment. To be (expected) deception, this is ultra low budget direct to video crap with the usual gratuitous semi-nudity and foul language. You can't help but love the fake \"shooting\" sounds.EVERYTHING in this movie is a disaster. The plot does not even get deep into narcotraffic or even tries to explain what's about it. It only shows low budget mobsters trying to kill Yañez and his father who only says that \"mafia always gets you\".The action sequences are truly awful and do not add anything to the movie. In fact, it gets boring with time. Yañez making team with his father \"battling\" narcos isn't the best plot and the low budget didn't help it. The shoothing was crap and the typical 80'S \"Rambo music\" also stinks. A lame, poor movie that tries to be a direct to video American detective flick. Ugh.So I suggest you to avoid this terrible piece of crap. Not even the sexy MILF Felicia Mercado can save this movie.Narciso B. is the best actor from this one.",
    "Director": "Rubén Galindo",
    "Writer": "Rubén Galindo, Carlos Valdemar",
    "Actors": "Eduardo Yáñez, Alfredo Leal, Juan Gallardo",
    "Language": "Spanish",
    "Country": "Mexico",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0333955",
    "tt0223769",
    "tt0186908",
    "tt0298055",
    "tt0352599",
    "tt0087258",
    "tt0090693",
    "tt0086192",
    "tt0445845",
    "tt0093640",
    "tt0315254",
    "tt0238080"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:02.896Z"
}