{
  "imdbId": "tt0392276",
  "title": "Kilink: Strip and Kill",
  "year": 1967,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/KilinkSoyVeOldur",
      "id": "KilinkSoyVeOldur",
      "title": "Kilink Soy Ve Oldur (Kilink Strip And Kill)",
      "description": "Kilink Soy Ve Oldur is a Turkish superhero movie from 1967. It was directed by Yilmaz Atadeniz and starts Yilderim Gencer. Kilink is a villain in a skeleton suit. All the Kilink movies are a must-see for lovers of cult cinema.",
      "fileSize": 1725194408,
      "addedAt": "2026-01-07T00:06:30.622Z",
      "thumbnail": "https://archive.org/services/img/KilinkSoyVeOldur",
      "year": 1967,
      "collection": "feature_films",
      "downloads": 8492
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "93 min",
    "imdbRating": 5.7,
    "imdbVotes": 129,
    "Genre": "Adventure, Crime, Fantasy",
    "Plot": "Kilink is between 2 rival gangs and manages to turn one against the other. All of them are after a precious microfilm and a big foreign treasure. Kilink proves to be the most perfect Fantomas of them all, changing disguises more often than he changes socks. At the same time, it's raining gorgeous ladies all over the place. Most of them rivals. All of them falling for him or off balconies, pushed by him. In a brilliant sequence, he punches a treacherous pussycat, strangles her with his bare hands and chucks her off a balcony. The film features the classic torture the tied woman scenes. In one of them, even a snake is used for a quicker confession. Endless shootouts, car chases, murders, beat ups and plot twists make this sequel one of the best Turkish auctioneers ever.",
    "Director": "Yilmaz Atadeniz",
    "Writer": "Yilmaz Atadeniz",
    "Actors": "Yildirim Gencer, Suzan Avci, Reha Yurdakul",
    "Language": "Turkish",
    "Country": "Turkey",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0062150",
    "tt0061549",
    "tt0223839",
    "tt0063143",
    "tt0062630",
    "tt0062759",
    "tt0064115",
    "tt0059433",
    "tt0058311",
    "tt0058063",
    "tt2388691",
    "tt0057547"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.622Z"
}