{
  "movieId": "tt0322124",
  "title": "East Is East",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/EastIsEast1916",
      "id": "EastIsEast1916",
      "title": "\"East Is East\" (1916) starring Florence Turner",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"East Is East\" is a drama and romance.  The film is included in our program to illustrate the work of Florence Turner, a star of Silent Hall of Fame. Directed by                      Henry Edwards Produced by                    Florence Turner Scenario by                     Henry Edwards Based on                         a play by Philip Hubbard and Gwendolen Logan Starring                           Florence Turner, Henry Edwards Cinematography             Tom White Distributed by                 Mutual Film Corporation (USA) Release date                     November 9, 1916 (USA) Running time                   71 minutes Country                            UK Language                         Silent film, English intertitles   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 84260401,
      "addedAt": "2026-01-07T00:06:19.370Z",
      "thumbnail": "https://archive.org/services/img/EastIsEast1916",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 3509
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6.1,
    "imdbVotes": 68,
    "Genre": "Drama, Romance",
    "Plot": "Victoria Vickers, a little East End Cockney girl, is left a vast fortune by an uncle in America. She is finally discovered hop-picking in Kent by her solicitor, who has given up the search and gone off on a photographic holiday instead! The conditions of the legacy are that she must spend three years learning to be a lady before she inherits absolutely. 'Vicky' does her best, but she is not happy in high society. Meanwhile her old East End beau Bert accepts a loan from her in order to 'better himself' and starts a highly-successful fish-and-chip shop business. He takes elocution lessons and buys gentleman's clothes in the hopes of aspiring to her hand. But Vicky, who thinks he has deserted her now she is a fine lady, is lonely enough to accept an offer of marriage from her guardian's spendthrift son, and when Bert reads of the engagement in the newspapers he abandons London and goes down to live in Kent where they were once happy together. When Vicky discovers her suitor's true mercenary nature, however, she abandons the high life and the conditions of her fortune along with it and seeks out Bert... who is nowhere to be found... With the last of her money she goes back to the hop-fields and the little house they once wished they could buy. Unbeknownst to her, Bert used the profits from the sale of his business to buy it himself - and the lovers are reunited, with Victoria's troublesome inheritance happily relinquished to charitable works.",
    "Director": "Henry Edwards",
    "Writer": "Henry Edwards, Philip Hubbard, Gwendolyn Logan",
    "Actors": "Florence Turner, Henry Edwards, Ruth Mackay",
    "Language": "None, English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006826",
    "tt0006745",
    "tt0006614",
    "tt0005078",
    "tt0008188",
    "tt0005460",
    "tt0007698",
    "tt0228815",
    "tt0005059",
    "tt0004635",
    "tt0317150",
    "tt0009086"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.370Z"
}