{
  "movieId": "tt0388964",
  "title": "Ganghwadoryeong",
  "year": 1963,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2AqLtVks5Nc",
      "id": "2AqLtVks5Nc",
      "title": "A Reluctant Prince ( Ganghwadoryeong )(1963)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00871\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00871\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희,신영균,김승호,황정순,김희갑,한은진,신성일,이예춘,윤인자,주선태,구봉서,정애란,도금봉\n\n줄거리 : 당파간의 암투가 치열했던 조선 말기. 헌종이 승하하자 왕손이면서도 강화도에서 평민처럼 살고있던 떠꺼머리 총각 원범(신영균)이 하루 아침에 철종으로 등극한다. 제조상궁(한은진)으로부터 궁중의 법도를 하나하나 배워가던 철종은 격식에 얽매여 제약이 많은 왕의 지위에 염증을 느끼고, 강화도에서 함께 자유로이 뛰놀던 복녀(최은희)를 향한 그리움에 상사병이 난다. 철종은 대왕대비의 간택으로 억지로 혼인까지 하지만, 복녀를 잊지 못해 끝내 그녀를 입궐시켜 상궁의 지위를 주고 곁에 머물게 하나 대왕대비의 명으로 복녀는 쫓겨나기에 이른다. 철종의 병이 깊어지자 철종비는 복녀를 다시 한양으로 부르고, 왕의 흔들림을 보다 못한 복녀는 왕의 마음을 돌리고자 인두로 자신의 얼굴을 지지고는 철종에게 백성으로부터 존경받는 성군이 될 것을 간청하며 다시 강화도로 돌아간다. 복녀가 떠나자 하루가 다르게 쇠약해져가던 철종은 결국 복녀의 이름을 부르다 눈을 감지 못한 채로 죽는다. 뒤늦게 도착한 복녀는 철종의 장례행렬을 바라보며 슬픔에 젖지만, 그와의 사이에서 낳은 아들만큼은 왕이 아닌 초부(樵夫)로 훌륭히 키워 사람다운 사람을 만들겠다고 다짐한다.\n\nCasts : Choi Eun-Hee, Shin Young-Kyun, Kim Seung-Ho, Do Keum-Bong\n\nSYNOPSIS : During the later years of the Joseon Dynasty (1392-1910), when King Heonjong falls ill, political factions start a covert fight over the throne. One of those factions finds out a king's descendant who's been abandoned in Ganghwa-do. The country boy becomes a prince overnight and ascends to the throne. But the rigid rules and etiquettes of the court are stifling him. He is sick of being king and he dreams of the old days in the countryside. In his dreams, he freely wanders around the beaches in Ganghwa-do.",
      "addedAt": "2025-12-26T00:23:33.353Z",
      "thumbnail": "https://i.ytimg.com/vi/2AqLtVks5Nc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCBct58Iz0w9FjGlssUctawVFdLXw",
      "duration": 7561,
      "language": "ko",
      "year": 1963,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Drama",
    "Plot": "When King Heon-kong falls ill, a power struggle erupts over who will inherit the throne. Tired of all the infighting, the ministers arrange for a branch of the king's family, which had lost all its wealth and was living on remote Ganghwa Island, to inherit. But the heir to the throne is reluctant to leave his island home.",
    "Director": "Shin Sang-ok",
    "Writer": "Seo-gu Lee",
    "Actors": "Choi Eun-hie, Yeong-gyun Shin, Seung-ho Kim",
    "Language": "Korean",
    "Country": "South Korea",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0388969",
    "tt0388143",
    "tt0388982",
    "tt0414075",
    "tt0349893",
    "tt0057415",
    "tt0056810",
    "tt0178515",
    "tt0057062",
    "tt0057207",
    "tt12658952",
    "tt0056656"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:14:44.545Z"
}