{
  "imdbId": "tt0344506",
  "title": "The Two Roses",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-two-roses",
      "id": "silent-the-two-roses",
      "title": "The Two Roses",
      "fileSize": 176924862,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-two-roses",
      "language": "English",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 324
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "12 min",
    "imdbRating": 5.4,
    "imdbVotes": 48,
    "Genre": "Drama, Family, Short",
    "Plot": "Tony Prolo, a poor laborer, lives happily, despite his poverty, with his wife and their child, who is named after his father. Tony is employed with other laborers on railroad construction work, and little Tony brings him his lunch every day. The boy has carried father his lunch as usual one noon, and crossing the road fails to notice the approach of a large automobile. He is knocked down. Mr. Sears, the owner of the car, tries to aid the boy and seeks to comfort his father. But the excited laborer spurns the rich man's sympathy, picks the child up in his arms and carries him home. Arrives at his own resident, Mr. Sears receives a letter signed \"Black Hand\" demanding $10,000. He is to give the money to a man who will meet him at a certain street corner, and will carry a white rose. Sears takes the letter to the police and a trap is laid for the Black Hand man. In the meantime, Tony, who has been to see the doctor, stops at a florist's and purchases a white rose for his suffering son, who is passionately fond of flowers. Unhappily for him, he passes the place picked out by the Black Hand, the police think his rose the signal rose. He is promptly arrested, but when he tells his story, Sears and his wife induce the police to investigate it. They find Tony has told the truth, and the repentant Mr. Sears presents him, by way of recompense, with a pretty cottage in the country where white roses are so plentiful that little Tony can't even begin to keep track of them.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Marie Eline, Frank Hall Crane, Anna Rosemond",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1727546",
    "tt0367144",
    "tt1207008",
    "tt1113818",
    "tt0427674",
    "tt0417062",
    "tt0002356",
    "tt1059291",
    "tt1840952",
    "tt0470339",
    "tt0463594",
    "tt0330942"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}