{
  "imdbId": "tt0365675",
  "title": "The Red Baron",
  "year": 2008,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gzIyCzApFEU",
      "id": "gzIyCzApFEU",
      "title": "The Red Baron | FULL MOVIE | 2008 | Action, Fighter Pilots | Joseph Fiennes",
      "description": "Europe, 1916. A living legend (aged 24) performing amazing dogfights and aerial stunts, flies in on painted wings to become famous the world over. For millions of his countrymen, he becomes an idol, a symbol of hope and pride. Baron Manfred von Richthofen (MATTHIAS SCHWEIGHÖFER) is the crack pilot of the German aerial combat forces – a legend in his own time, a hero at home and a man both feared and respected by the enemy, including Allied Forces’ Canadian pilot, Captain Roy Brown (JOSEPH FIENNES). He and his fellow officers, Lieutenants Voss (TIL SCHWEIGER), Sternberg (MAXIM MEHMET) and Lehmann (HANNO KOFFLER) see their duels in the sky as tactical, almost sportsmanlike, clever challenges that, at least at first, obscure their view of the horrors of the battlefields below. And the provocative red paint job of his Fokker aircraft earns him the nickname ‘The Red Baron’. Unwittingly, he allows the German high command to manipulate his chivalrous code of honor and misuse him for propaganda purposes – until the young pilot falls in love with Käte (LENA HEADEY), a beautiful and resolute nurse who opens his eyes to the tragic fact that there is more to war than dogfights won and adversaries downed. Baron von Richthofen finally becomes aware of his role in the propaganda machine of a senseless and barbarous war. With a torn heart, despite the heavy losses in his squadron and his disgust for the war and his responsibility to his fighter wing, von Richthofen cannot help but fly. But even for this living legend, each new combat mission could be his last…\n\nA living legend (aged 24) performing amazing dogfights and aerial stunts, flies in on painted wings to become famous the world over.\n\r\nTil Schweiger, Joseph Fiennes, Lena Headey\nDirected by Nikolai Müllerschön\n2008\n\n#ww1 #worldwar1 #airplane \n\r\nMORE Popcornflix MOVIES, FREE on YouTube!\r\n\r\n Action: https://bit.ly/2XC8pvv\r\n Romance: https://bit.ly/2NVnIQ2\r\n Horror: https://bit.ly/2LeNNaK\r\n Crime: https://bit.ly/2NK201z\r\n Drama: https://bit.ly/2G6Uasy\r\n Comedy:  https://bit.ly/2LPCNQD\r\n Western: https://bit.ly/2S7FRc4\r\n Popcornflix Channel page: https://bit.ly/2Saak9p\r\n\r\nWatch more free movies and TV series at Popcornflix.com, or on the Popcornflix app available on Roku, Amazon FireTV, iOS, Android, Chromecast, and AppleTV.\r\n\r\n#Popcornflix, Full length free movies and TV series.\r\nLike us on Facebook: https://www.facebook.com/Popcornflix\r\nFollow us on Twitter: https://twitter.com/Popcornflixnews\r\nPopcornflix is owned/operated by Screen Media Ventures",
      "addedAt": "2025-12-23T23:36:22.478Z",
      "thumbnail": "https://i.ytimg.com/vi/gzIyCzApFEU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDrzPVE38INpGp5GjWexbLNsRE0hw",
      "duration": 6362,
      "language": "en",
      "channelName": "Popcornflix",
      "channelId": "UCVFYikepF-avelvuIaQ_lHA"
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "106 min",
    "imdbRating": 6.3,
    "imdbVotes": 13304,
    "Genre": "Action, Adventure, Biography",
    "Plot": "Baron Manfred von Richthofen is the most feared and celebrated pilot of the German air force in World War I. To him and his companions, air combats are events of sporty nature, technical challenge and honorable acting, ignoring the terrible extent of war. But after falling in love with the nurse Käte, Manfred realizes he is only used for propaganda means. Caught between his disgust for the war, and the responsibility for his fighter wing, von Richthofen sets out to fly again.",
    "Director": "Nikolai Müllerschön",
    "Writer": "Nikolai Müllerschön",
    "Actors": "Matthias Schweighöfer, Lena Headey, Til Schweiger",
    "Language": "German, English, French",
    "Country": "Germany, United Kingdom",
    "Awards": "2 nominations"
  },
  "relatedMovies": [
    "tt0000574",
    "tt0068182",
    "tt1260932",
    "tt1314248",
    "tt0373051",
    "tt1104123",
    "tt1001548",
    "tt1219671",
    "tt0047444",
    "tt0048579",
    "tt0049710",
    "tt0040761"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:19:48.985Z"
}