{
  "imdbId": "tt0337476",
  "title": "White Water",
  "year": 1926,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WhiteWater1924",
      "id": "WhiteWater1924",
      "title": "\"White Water\" (1924) starring Nell Shipman",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     \"White Water\" is a short drama about lumberjack country. We have included this film in our program to illustrate the work and contributions of Nell Shipman, a star of Silent Hall of Fame. Directed by                 Nell Shipman and Bert Van Tuyle Produced by               Nell Shipman Productions Inc. Written by                  Nell Shipman Starring                      Nell Shipman, Donald Winslow (the boy), Ray Peters (the boy's brother) Cinematography        Robert S. Newhard Release date                coming soon Running time              27 minutes Country                        US Language                     Silent film   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 22231591,
      "addedAt": "2026-01-07T00:07:11.888Z",
      "thumbnail": "https://archive.org/services/img/WhiteWater1924",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 1600
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "27 min",
    "imdbRating": 7.2,
    "imdbVotes": 26,
    "Genre": "Drama, Short",
    "Plot": "Odd little 2-reeler from Nell Shipman Productions starring Shipman as a girl of the woods. She lives near an Idaho lumber camp where she skips along forest paths and communes with nature.One day she meets a sullen violinist and a hunchbacked boy dancing to the music and begging for coins. The older boy tells the story of how a tree he was chopping down fell on his brother and injured him so that he will never grow. Nell gets him a job in the lumber company office and tries to involve him with the villagers. No dice.The boy sees some lumberjacks rolling logs and tries to copy them, but he falls into the river and gets washed downstream toward the rapids. Nell sees this and canoes out to save him. But the canoe capsizes and the sullen boy must swim out to save them both.The \"happy\" ending is very odd.Good location shooting and stunts by the actors. The film has been nicely restored and has beautiful tints throughout.IMDb lists this films as 1926, but the film itself says 1924.",
    "Director": "Bert Van Tuyle, Nell Shipman",
    "Writer": "Nell Shipman",
    "Actors": "Nell Shipman, Ralph Cochner, Ray Peters",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0317876",
    "tt1727500",
    "tt0419902",
    "tt0221180",
    "tt0017775",
    "tt0019099",
    "tt0184737",
    "tt0014904",
    "tt0131461",
    "tt0019267",
    "tt1029331",
    "tt3706210"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.888Z"
}