{
  "movieId": "tt0349889",
  "title": "Unstoppable",
  "year": 2004,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XSiyElMlURs",
      "id": "XSiyElMlURs",
      "title": "WESLEY SNIPES IS UNSTOPPABLE (Action Thriller full movie in German, full-length action movie)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein rasanter Actionthriller mit Wesley Snipes (\"Blade\") in Hochform - Ex-Soldat Dean Cage wird Opfer einer geheimen Droge und für einen CIA-Agenten gehalten. Gejagt und halluzinierend kämpft er ums Überleben...\n\nUNSTOPPABLE (2004)\nMit: Wesley Snipes, Jacqueline Obradors, Stuart Wilson\nRegie: David Carson\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nDer ehemalige Special-Forces-Soldat Dean Cage (Wesley Snipes), schwer gezeichnet von seiner Vergangenheit, wollte eigentlich nur in einem gemütlichen Café seine Freundin Amy (Jacqueline Obradors), die als Polizistin arbeitet, treffen. Doch anstelle eines ruhigen Wiedersehens findet er sich plötzlich einem Fremden gegenüber, der ihm unvermittelt eine Spritze ins Knie rammt. Hinter dieser Attacke steckt eine geheime Organisation ehemaliger Agenten, die dem Staat eine experimentelle halluzinogene Substanz entwendet hat und diese nun an den Höchstbietenden verkaufen will. Ausgerechnet Dean halten sie fälschlicherweise für einen CIA-Mann, der ihnen dicht auf den Fersen ist. Zwar gelingt es der Gruppe zunächst, den durch die Droge benebelten Dean zu verschleppen, um ihn über die laufenden FBI-Ermittlungen auszuhorchen – doch ihr Erfolg währt nicht lange.\n#Netzkino #ganzerFilm #wesleysnipes\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:36:09.056Z",
      "thumbnail": "https://i.ytimg.com/vi/XSiyElMlURs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB5679T1u044cTBjXg32qoTECkvNg",
      "duration": 5531,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "96 min",
    "imdbRating": 5,
    "imdbVotes": 5458,
    "Genre": "Action, Adventure, Drama",
    "Plot": "Dean Cage is a former CIA operative who suffers from extreme PTSD. While in a program to resolve the stress of the loss his future brother-in-law Scott, he plans to meet Scott's sister at a diner to discuss their plans for marriage. But, he is mistaken for an FBI agent who is trying to stop the sell of a powerful narcotic EX.",
    "Director": "David Carson",
    "Writer": "Tom Vaughan",
    "Actors": "Wesley Snipes, Jacqueline Obradors, Stuart Wilson",
    "Language": "English",
    "Country": "United States, Aruba",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0377062",
    "tt0388377",
    "tt0339236",
    "tt0318281",
    "tt0437803",
    "tt0498380",
    "tt0326450",
    "tt0237534",
    "tt0913968",
    "tt1104684",
    "tt0958824",
    "tt1075746"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-11T22:02:12.506Z"
}