{
  "imdbId": "tt0477133",
  "title": "White Terror",
  "year": 2005,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vkXs-IYyWPU",
      "id": "vkXs-IYyWPU",
      "title": "White Terror | Full Movie | Mystery Horror | Bobby Slaski",
      "description": "White Terror - One late summer night, 21-year-old Bella, witnesses the death of both her parents during a home invasion. To help recover from her trauma and get on with life, Bella and her brother, Mason, move in with their aunt and uncle. Although Bella very much wants to move on, it’s as if life won’t let her. Days leading up to her parents’ death start to repeat themselves. The same conversations, the same people, the same situations. No matter what she does, she cannot keep the past from playing over and over. At the end of every repeated day, Bella finds herself in a white room. On one wall, a large projection screen plays a video of a fan spinning. Occasionally a woman with a mask appears, looking down at her. Large, non-descript black figures follow her around the room, talking, whispering and screaming at her. When Bella finally solves the mystery of the White Room, she is able to put the past behind her, but not in the way she expected.\n2020.  Stars: Kat Kaevich, Bobby Slaski, Dalit Berkowitz\n**Under non-exclusive license from Leomark Studios.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:43.478Z",
      "thumbnail": "https://i.ytimg.com/vi/vkXs-IYyWPU/maxresdefault.jpg",
      "duration": 4847,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "90 min",
    "imdbRating": 6.8,
    "imdbVotes": 147,
    "Genre": "Documentary",
    "Plot": "Over the past years, there has been a significant changeover among radical far-right extremists: the veterans are long gone, either dead or too old. New ideologists are emerging all over Europe, North America and Russia. They do not necessarily shave their heads; they have created corporations, distribution companies, music clubs, magazines, publishing houses, internet sites and they have replaced the old symbols with new ones. With globalization taking a firmer hold and with clear demarcation lines blurring, the hate mongers are rekindling the fires of the past, blowing on their glowing ashes. In this era of new technologies, the United States and Sweden have been deeply shocked to discover their youth inciting racist violence, which has since contaminated the whole of the Western world as well as Russia and its neighbouring countries. Over two years of investigation on the most active extremist groups have revealed the international links between them from Stockholm to Dallas via Moscow. Daniel Schweizer, director of acclaimed documentary Skinhead Attitude, investigates the forces that hide behind the «White Power» and the «New Racists» slogans.",
    "Director": "Daniel Schweizer",
    "Writer": "Daniel Schweizer",
    "Actors": "Daniel Schweizer, Christine Brand, Olivier Cochet",
    "Language": "English, French, German, Russian",
    "Country": "Switzerland, Finland, France, Germany",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt0479676",
    "tt0907285",
    "tt3103732",
    "tt0492337",
    "tt0484256",
    "tt0445936",
    "tt0796992",
    "tt0856228",
    "tt1418793",
    "tt0419100",
    "tt1422757",
    "tt0790769"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:01.558Z"
}