{
  "imdbId": "tt0479997",
  "title": "Season of the Witch",
  "year": 2011,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4UIeNujC6n0",
      "id": "4UIeNujC6n0",
      "title": "Season Of The Witch | Full Mysterious Thriller Movie",
      "description": "**This film is under non-exclusive license from Ytinifni Entertainment. All rights reserved**\n\nSeason Of The Witch - Mary Blackwell travels back to her hometown of Maiden Hollow to clear out her recently deceased father's house. She takes her two children Alice and Sam with her. Whilst there they discover a tiny village, which has been isolated from surrounding towns and in which the locals have developed their own way of life. The villagers are initially hostile towards the new family, but grow to accept them. Local priest Michael Howdy, however, takes an unhealthy interest in Mary's daughter Alice. Villagers Harry Price, John Elliot and Tom Hopkins, notice this interest and keep a close watch on Michael.\n\n2009\nStars: Beth Kingston, Tim McConnell, Barry Robbins\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:45:36.893Z",
      "thumbnail": "https://i.ytimg.com/vi/4UIeNujC6n0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAjlvakPx1MK0327CSuXf0aQwPmSg",
      "duration": 6081,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "95 min",
    "imdbRating": 5.4,
    "imdbVotes": 101604,
    "Genre": "Action, Adventure, Fantasy",
    "Plot": "A 14th-century Crusader returns to a homeland devastated by the Black Plague. A beleaguered church, deeming sorcery the culprit of the plague, commands the two knights to transport an accused witch to a remote abbey, where monks will perform a ritual in hopes of ending the pestilence. A priest, a grieving knight, a disgraced itinerant and a headstrong youth who can only dream of becoming a knight join a mission troubled by mythically hostile wilderness and fierce contention over the fate of the girl. When the embattled party arrives at the abbey, a horrific discovery jeopardises the knight's pledge to ensure the girl fair treatment, and pits them against an inexplicably powerful and destructive force.",
    "Director": "Dominic Sena",
    "Writer": "Bragi F. Schut",
    "Actors": "Nicolas Cage, Ron Perlman, Claire Foy",
    "Language": "English, Latin",
    "Country": "United States",
    "Awards": "2 nominations total"
  },
  "relatedMovies": [
    "tt1594917",
    "tt1734203",
    "tt1637713",
    "tt1792794",
    "tt1999141",
    "tt1636629",
    "tt2296404",
    "tt2318405",
    "tt1079372",
    "tt2182163",
    "tt1785669",
    "tt1353997"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:56:39.159Z"
}