{
  "movieId": "tt0451238",
  "title": "The Toybox",
  "year": 2005,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-toybox_202509",
      "id": "the-toybox_202509",
      "title": "The Toybox",
      "description": " Berenice convinces her younger brother Brian that she is the reincarnation of a witch with the powers to put everything right. As they grow up Brian becomes emotionally dependent on his sister, so that when she returns to the family home for Christmas with her new boyfriend he feels totally betrayed. At the same time a man strongly resembling the mythical Jake the Mid-Folker is closing in. An overwhelming sense of impending horror surrounds the house, but is the enemy outside - or is the enemy within?",
      "fileSize": 1218639744,
      "addedAt": "2026-01-07T00:12:33.205Z",
      "thumbnail": "https://archive.org/services/img/the-toybox_202509",
      "language": "eng",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 270
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "81 min",
    "imdbRating": 3.7,
    "imdbVotes": 386,
    "Genre": "Horror, Mystery, Thriller",
    "Plot": "It all began so innocently for two children growing up in the deepest countryside, their imaginations set ablaze by a book on local myths and legends. Berenice convinces her younger brother Brian that she is the reincarnation of a witch with the powers to put everything right. As they grow up Brian becomes emotionally dependent on his sister, so that when she returns to the family home for Christmas with her new boyfriend he feels totally betrayed. At the same time a man strongly resembling the mythical Jake the Mid-Folker is closing in. An overwhelming sense of impending horror surrounds the house, but is the enemy outside - or is the enemy within?",
    "Director": "Paolo Sedazzari",
    "Writer": "Paolo Sedazzari",
    "Actors": "Alexander Abadzis, Russell Barnes, Suzanne Bertish",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "2 wins"
  },
  "relatedMovies": [
    "tt0422272",
    "tt0468683",
    "tt0475937",
    "tt0454224",
    "tt0899128",
    "tt1132130",
    "tt1521787",
    "tt1176724",
    "tt0218619",
    "tt0206314",
    "tt0024625",
    "tt0073582"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.205Z"
}