{
  "movieId": "tt0434085",
  "title": "A Pair of White Gloves",
  "year": 1908,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-pair-of-white-gloves",
      "id": "silent-a-pair-of-white-gloves",
      "title": "A Pair of White Gloves",
      "fileSize": 276250146,
      "addedAt": "2026-01-07T00:10:50.367Z",
      "thumbnail": "https://archive.org/services/img/silent-a-pair-of-white-gloves",
      "language": "French",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 480
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "18 min",
    "imdbRating": 6,
    "imdbVotes": 56,
    "Genre": "Short",
    "Plot": "A prosperous looking young man arrives at a hotel, and after being assigned to a room, makes a most elaborate toilet before going out in search of diversion. When he is ready to depart, however, he discovers that he is in need of a pair of white gloves to complete his immaculate appearance. So, going to the telephone, he calls up a shop and orders a pair, and soon a young lady appears on the scene ready to fit him. As she is about to fasten one of the gloves, the button snaps, but this is soon remedied, for she has a needle and thread handy, and after sewing another one on, takes her departure. The young man then goes forth in a most felicitous frame of mind and is driven to a select café, where he sits down to enjoy a good dinner. As he glances about him at the other diners he recognizes a female acquaintance sitting at the next table. He sees that she recognizes him, so he takes out a piece of paper and writes her a note, asking her to meet him that evening near the club. The girl and her companion soon leave the place, and as she passes, the youth slips her the note without being discovered. In the next picture we see the happy young fellow waiting at the appointed place. Soon the lady comes along in an auto. After an affectionate greeting, the youth also steps into the machine and accompanies his friend to her home. As they enter the house a rough-looking character on the sidewalk watches the prosperous-looking couple in a rather peculiar manner, but the latter pass in without paying the slightest attention to the stranger. Arriving in the lady's parlor, the latter proceeds to remove her wraps, and in order to be more comfortable, she takes a beautiful pearl collar from her neck and places it in a jewel case which is lying on the table. She then leaves the room for a few moments, and during her absence the temptation to steal the valuable piece of jewelry masters her companion, and we see him slip the collar into his pocket. The evening is happily spent, and when the young man takes his leave the lady accompanies him to the gate and bids him a fond adieu. As he saunters down the street he accidentally drops his gloves, and the suspicious looking character, who watched them enter the house, picks them up and puts them on. The ruffian then steals into the house through an open window and is prowling around the parlor in search of valuables, when the lady, who by this time has retired, misses her collar and returns to the parlor to get it. Hearing approaching footsteps, the burglar hides behind a chair; the woman enters and not finding her jewels becomes alarmed and in her excitement shrieks for help. The fellow then springs from his hiding place and attacks the helpless girl, who in the ensuing struggle receives a death blow and falls at the man's feet. The murder, quickly removing the gloves, throws them on the floor beside his victim and makes his escape from the house. When the crime is discovered and the detectives are called in, they find the gloves and immediately start out in search of their owner. Through the trade-marks they trace them to the shop where they were purchased, and when they are shown to the saleslady she at once identifies them as the ones which she sold to the young man at the hotel. They then go to the hostelry, where they find the youth, who is just about to leave the place. He is detained and accused of the crime, but stoutly denies his guilt. On searching his belongings the detectives come upon the missing jewels, The youth is then led to the scene of the crime, where he is confronted with the victim as well as with the girl who sold him the gloves, which play such an important part in the case as circumstantial evidence. The unfortunate young man stoutly maintains his innocence, but the evidence is too strong against him and he is shackled and led away to prison, charged with the terrible crime. As he enters a carriage with the detectives, the real murderer, one of the curious crowd looking on, smiles with satisfaction as he sees the innocent man taken to pay the penalty of the crime of which he alone is guilty.",
    "Director": "Albert Capellani",
    "Writer": "Albert Capellani, Georges Docquois",
    "Actors": "Henri Desfontaines, Marguerite Brésil, Alexandre Arquillière",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0433791",
    "tt0482887",
    "tt0164493",
    "tt0434198",
    "tt0434281",
    "tt1815802",
    "tt0434455",
    "tt0434199",
    "tt0434157",
    "tt0461304",
    "tt0460831",
    "tt0000653"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}