{
  "imdbId": "tt0449324",
  "title": "L'obsession de l'or",
  "year": 1906,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/LobsessionDeLor",
      "id": "LobsessionDeLor",
      "title": "L'Obsession de l'or",
      "description": "An artist is painting the portrait of a young woman dressed in a country costume in his attic studio. The landlord demands the rent, but the artist has no money and forces the landlord out. The model tries to comfort him, but he throws her out too. Dancing safes appear and he takes bags of gold coins out of them. A woman fairy appears and she transports them to a palace. Soldiers march in and a troupe of women dancers perform. The scene changes to an area before a fountain, but everyone disappears except the artist. A rain of what appears to be fire begins to fall and he awakens back in his studio. He is desperate. The model comes in and gives him the money she received when she sold her earrings to a jeweler. Release Date: 5 October 1906 (France) Genre:Short Directed by Segundo de Chomón Cinematography by Segundo de Chomón Production Companies Pathé Frères Distributors Pathé Frères (1906) (France) (theatrical) Country: France Language: French Color: Black and White Sound Mix: Silent Photography, Segundo de Chomón Other Titles: Friendship better than riches Obsesión por el oro Unidentified Masson.",
      "fileSize": 27789676,
      "addedAt": "2026-01-07T00:06:38.750Z",
      "thumbnail": "https://archive.org/services/img/LobsessionDeLor",
      "language": "French & Dutch",
      "year": 1906,
      "collection": "feature_films",
      "downloads": 2870
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-lobsession-de-lor",
      "id": "silent-lobsession-de-lor",
      "title": "L'obsession de l'or",
      "fileSize": 57718572,
      "addedAt": "2026-01-07T00:11:07.408Z",
      "thumbnail": "https://archive.org/services/img/silent-lobsession-de-lor",
      "year": 1906,
      "collection": "feature_films",
      "downloads": 185
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "3 min",
    "imdbRating": 4.8,
    "imdbVotes": 125,
    "Genre": "Short",
    "Plot": "Features a painter in trouble with his landlord. Then, magical dancing safes appear and the painter selects a bag of gold from each, and plays with his money until a fairy appears and escorts him to a fairy land where fairies dance for his delight. Meanwhile the painters' model comes back to his studio, where the painter tries to hang himself, when the rope breaks, and upon which the model enters the studio to find the painter on the floor.",
    "Director": "Segundo de Chomón, Lucien Nonguet",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000537",
    "tt0431889",
    "tt0298525",
    "tt0308402",
    "tt3473510",
    "tt3473502",
    "tt0449172",
    "tt0205480",
    "tt0258293",
    "tt0235057",
    "tt1880182",
    "tt1649316"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.408Z"
}