{
  "movieId": "tt0488057",
  "title": "Snow Wonder",
  "year": 2005,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hbQQOZWF1gU",
      "id": "hbQQOZWF1gU",
      "title": "Snow Wonder (CHRISTMAS FILM full film German, new family films for Christmas 2022)",
      "addedAt": "2025-12-23T23:59:30.109Z",
      "thumbnail": "https://i.ytimg.com/vi/hbQQOZWF1gU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCMjZ5gMrpjfk1s3SmzexGXvSRuqQ",
      "duration": 5077,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "100 min",
    "imdbRating": 5.1,
    "imdbVotes": 431,
    "Genre": "Drama, Family",
    "Plot": "A mysteriously spreading period of postcard winter conditions, complete with snow, over most of the northern hemisphere shortly before Christmas influences several otherwise unrelated lives. Most obviously, weather channel presenter Billy, a former studio boss, whose show now becomes news again, gets to know his prompter text writer Joey. Businessman Warren, a gifted lier who pretends to be stuck in airports to explain his delay on the way home to his gullible wife, is found out and dumped by his conquest in Baltimore. Young mother Pilar, who got a bad custody deal for her darling little boy Miguel, is unable to deliver him to dad because of the snow; he asks the judge for full custody as punishment, but... Young Luke, who recently moved out of home, learns most of his guests, including his bossy mother, who came to cook the Christmas dinner where he is house-sitting, are stuck in traffic, so he decides to cook the goose with weird ex-socialite aunt Lula, who then forces him to a twist... In the South, even bride Stacey, who always got her way, is unable to wish away or ignore the unprecedented winter weather; the groom and her best friend, a cellist who nearly knows her from school, seize the opportunity... A bitter woman from greater Chicago visits Virginia and confronts her past...",
    "Director": "Peter Werner",
    "Writer": "Rodney Patrick Vaccaro, Connie Willis",
    "Actors": "Julie Ann Emery, Jennifer Esposito, Camryn Manheim",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt0457477",
    "tt0340331",
    "tt0294806",
    "tt1071780",
    "tt0261264",
    "tt0363468",
    "tt0772176",
    "tt0087383",
    "tt0910993",
    "tt1032746",
    "tt1131732",
    "tt0031580"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:31:54.912Z"
}