{
  "imdbId": "tt0410162",
  "title": "The King Maker",
  "year": 2005,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=V6gjUU41a7o",
      "id": "V6gjUU41a7o",
      "title": "The King Maker | Full Movie | Action Adventure | John Rhys-Davies | Gary Stretch",
      "description": "The King Maker - Fernando De Gama, a Portuguese mercenary, sets sail for the Orient, where he reaches the Thai kingdom of Ayutthaya, in a bid to find the man that murdered his father.\n2005. Stars: Gary Stretch, John Rhys-Davies, Cindy Sirinya Bishop\n*Licensed from ITN Distribution. All rights reserved*\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\nMORE FULL MOVIES - FREE on YouTube!\n\n Free Action Movies: https://bit.ly/3uMwRxq\n Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n Free Horror Movies: https://bit.ly/3aBBt2J\n Free Asylum Movies: https://bit.ly/3cipzeI\n Free Crime/Thriller: https://bit.ly/3o01prJ\n Free Drama Movies: https://bit.ly/3Pu4mN9\n Free Comedy Movies: https://bit.ly/3IE0wPd\n Free Western Movies: https://bit.ly/3RqTX6u\n Free Adventure Movies: https://bit.ly/3yHolAT\n MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:42:17.612Z",
      "thumbnail": "https://i.ytimg.com/vi/V6gjUU41a7o/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCWeIdXZVIq9S_9ndcjLAaGSQoRRA",
      "duration": 5541,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "BD",
          "BT",
          "CA",
          "IN",
          "LK",
          "MV",
          "PK",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "92 min",
    "imdbRating": 3.6,
    "imdbVotes": 752,
    "Genre": "Adventure, Drama",
    "Plot": "In 1547 Fernando De Gama, a young \"Soldier of Fortune\" from Portugal, set sail for the Orient in a bid to find the man that murdered his father and, with luck, like many of his fellow countrymen,to make his fortune. A vicious storm in the Indian ocean almost ended his plans when the ship he was on sank. The sole survivor, he was washed up on a tropical beach only to be captured by Arab slavers and taken to Ayutthaya in the kingdom of Siam where he was offered for sale as a slave. He is rescued from slavery when a beautiful young woman Maria, also from Portugal, living in Ayutthaya with her father, buys him from the Arabs and restores his freedom. Not suprisingly he falls for Maria and Maria him, much to the chagrin of Maria's Father. As an experienced soldier his services are soon in demand when the King of Siam declares war on a Northern renegade pretender and all of the Portuguese colony are press-ganged into the service of the King. Predictably, Fernando's experience and gallantry in the heat of battle, gain favour with the King who commands him to be one of his honoured personal Guard along with a new found Thai friend of tremendous gallantry, Tong. Unbeknownst to the king, his beautiful but devious wife, Queen Sudachan, plots to kill him and place her lover on the throne. The first attempt by the Queen to rid herself of the king fails and she enlists the services of Phillippe, who it transpires was the murderer of Fernando's father. He in turn organises another failed attempt on the Kings life. As trusted guardians of the king, Fernando and Tong discover that Phillippe is involved but is killed during an attempt to arrest him. They subsequently discover that the perpetrator is the Queen but are to late to save the king who has already succumbed to her poison. The blame for the kings death is fostered upon Fernando and Tong who are arrested and forced to fight each other to the death for the amusement of Queen Sudachan and her lover, the new king.",
    "Director": "Lek Kitaparaporn",
    "Writer": "Sean Casey",
    "Actors": "Gary Stretch, John Rhys-Davies, Cindy Sirinya Bishop",
    "Language": "Arabic, English, Thai",
    "Country": "Thailand",
    "Awards": "2 nominations"
  },
  "relatedMovies": [
    "tt0388377",
    "tt0437803",
    "tt0294806",
    "tt1135493",
    "tt0377062",
    "tt0498380",
    "tt0460925",
    "tt0406816",
    "tt0374248",
    "tt0349889",
    "tt0913968",
    "tt1104684"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:51:01.368Z"
}