{
  "movieId": "tt0477402",
  "title": "The Wonders of Magnetism",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-wonders-of-magnetism",
      "id": "silent-the-wonders-of-magnetism",
      "title": "The Wonders of Magnetism",
      "fileSize": 144218897,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-the-wonders-of-magnetism",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 408
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "8 min",
    "imdbRating": 6.4,
    "imdbVotes": 83,
    "Genre": "Documentary, Short",
    "Plot": "The lode stone's attraction for iron was well known to the Greeks as early as 500 B.C., and is mentioned by Homer, Plato and Aristotle in their writings. It was the original magnet, and was followed, in course of time, by a suspending needle, which has been touched by a lode stone, in order to give it magnetic properties. This was the elementary compass, and was used by Chinese mariners about 1000 A.D. At that time people considered these two magnets as bewitched, and it was not until William Gilbert. a scientist, in the year 1600 A.D., announced that the earth itself was an enormous magnet, that people began to realize the possibilities of magnetism. Today there are two kinds of magnets in common use, the electro-magnet and the steel magnet. The steel magnet is a bar of steel that appears to hold its charge of magnetic force indefinitely, although the force actually is diminishing, but never seems to arrive at a zero quantity. This magnet is used for light work, where electricity is not immediately available. However, when steady and heavier work is to be done, the electro-magnet, because of its far greater strength, is used. The electro-magnet, in its simpler form, is nothing but a bar of iron around which a current is passed. When the current is on, the magnet possesses magnetic force, but the second the current ceases, the bar loses its attraction. The Edison magnetic ore separator is an example of the electro-magnet performing the seemingly impossible task of separating magnetic from non-magnetic ores on a large scale. In the picture we see both of these modern magnets used for different kinds of work. We learn what a wonderful aid the magnet is to science and industry. Likewise we are taught in a few minutes more of the principles of magnetism than the ancient philosophers discovered about the bewitched metals, as they called their magnets, in a millennium.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt9837386",
    "tt1283535",
    "tt2647224",
    "tt0938705",
    "tt0955263",
    "tt0885116",
    "tt2647246",
    "tt2160081",
    "tt2647252",
    "tt1515754",
    "tt1187321",
    "tt1410251"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}