{
  "imdbId": "tt0448022",
  "title": "A Bird of the Air",
  "year": 2011,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/a.bird.of.the.air.2011.xvid",
      "id": "a.bird.of.the.air.2011.xvid",
      "title": "A Bird In The Air",
      "description": "A man in search of his past, and a woman who lives in the moment, are brought together when they pursue the origins of a stray parrot in this comedic and romantic drama.",
      "fileSize": 1314352091,
      "addedAt": "2026-01-07T00:07:18.438Z",
      "thumbnail": "https://archive.org/services/img/a.bird.of.the.air.2011.xvid",
      "language": "eng",
      "year": 2011,
      "collection": "feature_films",
      "downloads": 37
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "108 min",
    "imdbRating": 6.6,
    "imdbVotes": 1444,
    "Genre": "Drama, Romance",
    "Plot": "A sassy parrot and a free-spirited librarian upend the well-ordered life of a solitary man. Lyman (Jackson Hurst) is a loner, working the graveyard shift for the Courtesy Patrol. Orphaned by a car wreck that killed his parents when he was four years old, he knows only his last name and approximate year of birth. When a green parrot flies in to his trailer and announces, 'Shut up!\" and \"I'm an eagle!\" he becomes obsessed with finding its owner, which leads him to FIONA (Rachel Nichols). She has been eying Lyman from a distance and decides to help with his parrot search, whether he wants her to or not. Along with her basset hound, they set out on a quest to find the bird's previous owners and Fiona begins to unravel the mysteries of Lyman's past. But when Fiona joins Lyman on his nightly rounds, she witnesses a reality more intense than the romantic version she had envisioned. Ultimately, once Lyman is able to reconcile with is past, he is able to break free of his dark world and they prepare to begin a new life together.",
    "Director": "Margaret Whitton",
    "Writer": "Roger Towne, Joe Coomer",
    "Actors": "Rachel Nichols, Jackson Hurst, Anjanette Comer",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1519663",
    "tt2351157",
    "tt1957930",
    "tt1839596",
    "tt1789074",
    "tt2460976",
    "tt1529240",
    "tt1241329",
    "tt2179087",
    "tt1441940",
    "tt1781769",
    "tt1640571"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.438Z"
}