{
  "movieId": "tt0483719",
  "title": "The Living and the Dead",
  "year": 2006,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=irg1jyjMYhI",
      "id": "irg1jyjMYhI",
      "title": "The living and the dead, Part One | WAR DRAMA",
      "description": "Part Two: https://youtu.be/SeUKETNYHUM\n\nBased on the novel by K. Simonov. Journalist Ivan Sintsov receives news of the treacherous attack of Nazi Germany while on vacation. Now he is a war correspondent... Sintsov witnesses the difficult retreats of the first months of the war.\n\nIMDb rating: 7.6\n\nYear of production: 1963\n\nDirector: Stolper Alexander\nScreenwriter: Stolper Alexander\nOperator: Olonovsky Nikolay\nProduction designer: Volkov Stalen\n\nCast: Pushkarev Igor, Efremov Oleg, Krylova Lyudmila, Glazyrin Alexey, Papanov Anatoly, Pavlova Sofya, Shutov Evgeniy, Avdyushko Victor, Gluzsky Mikhail, Dubrovin Yuri, Chirkov Boris, Lavrov Kirill, Vorobyov Mikhail, Krugly Lev, Ulyanov Mikhail, Muravyov Vladimir , Samoilov Evgeniy, Gorelov Vladimir, Telegina Valentina, Kurkina Raisa, Makarov Vasily, Volkov Yuri, Aleynikova Arina, Paulus Vladlen, Khomyatov Roman, Lyubimova Lyudmila, Lyubetsky Lev, Kulik Valentin, Bityukov Boris, Shibankov Vladimir, Marenkov Vladimir, Ardov Boris, Vysokovsky Zinovy, Sergeev Nikolay, Yurchenko Boris, Yakushev O.",
      "addedAt": "2025-12-23T03:44:37.472Z",
      "thumbnail": "https://i.ytimg.com/vi/irg1jyjMYhI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAMC_MrTUBZmtnwy4T9bdNmZc_I8g",
      "duration": 5889,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "83 min",
    "imdbRating": 5.8,
    "imdbVotes": 2474,
    "Genre": "Drama, Horror, Mystery",
    "Plot": "A descent into Hell is triggered when \"Ex-Lord\" Donald Brocklebank finds that he must leave Longleigh House for London to find a way to pay for the medical treatments for his wife Nancy. Alone, his over-protected, delusional, adult son, James, fancies himself in charge of the manor house with his terminally ill mother, and barricades the two of them into the house for a series of ever more panicked home treatments, mistakenly protecting her from the arrival of Nurse Mary and any outside help.",
    "Director": "Simon Rumley",
    "Writer": "Simon Rumley",
    "Actors": "Leo Bill, Roger Lloyd Pack, Kate Fahy",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "10 wins & 3 nominations"
  },
  "relatedMovies": [
    "tt0412798",
    "tt0441741",
    "tt1132130",
    "tt1075113",
    "tt3778010",
    "tt1881060",
    "tt0032406",
    "tt0026230",
    "tt0037711",
    "tt0038975",
    "tt0478832",
    "tt0067341"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:30:29.534Z"
}