{
  "movieId": "tt0425847",
  "title": "The Nobleman's Dog",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-noblemans-dog",
      "id": "silent-the-noblemans-dog",
      "title": "The Nobleman's Dog",
      "fileSize": 177271912,
      "addedAt": "2026-01-07T00:11:24.921Z",
      "thumbnail": "https://archive.org/services/img/silent-the-noblemans-dog",
      "language": "French",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 338
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": 11,
    "Genre": "Comedy, Short",
    "Plot": "Aubry de Montidier, a nobleman attached to the court of Charles V of France, was assassinated by Richard Macaire, who was jealous of the favor the King showed the handsome courtier. During his lifetime, Sir Aubry owned a dog renowned for its devotion to its master. Macaire knew this and had the dog chained up, but the latter, breaking his leash, succeeded, after a long hunt, in locating the spot where the murderer had buried the body of his victim. On finding his master's body, the intelligent beast goes in search of one of his master's friends, and the latter, on witnessing the dog's unusual behavior, makes up his mind that something is wrong; so follows the faithful animal as he conducts him to the spot where the body has been interred. When Macaire is confronted by his dumb accuser, the latter exhibits such an animosity towards him that suspicion is immediately aroused. The King therefore orders that a sort of judiciary duel shall take place between the suspected man and the dog. The man's weapon is an enormous stick and the dog is given a barrel with which to defend himself. The King and all the royal household witness the exciting encounter between the man and beast, and after a close contest the man is finally defeated and sentenced to be hanged.",
    "Director": "Georges Monca",
    "Writer": "Romain Coolus",
    "Actors": "René Leprince, Dick, Paul Capellani",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0493625",
    "tt0001062",
    "tt0000840",
    "tt0000877",
    "tt0001002",
    "tt0000892",
    "tt0000800",
    "tt0127948",
    "tt0000878",
    "tt0000922",
    "tt0000938",
    "tt0000946"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.921Z"
}