{
  "imdbId": "tt0442013",
  "title": "Zigoto as a Station Master",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-zigoto-as-a-station-master",
      "id": "silent-zigoto-as-a-station-master",
      "title": "Zigoto as a Station Master",
      "fileSize": 84260063,
      "addedAt": "2026-01-07T00:11:24.927Z",
      "thumbnail": "https://archive.org/services/img/silent-zigoto-as-a-station-master",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 1846
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 5.1,
    "imdbVotes": 35,
    "Genre": "Comedy, Short",
    "Plot": "Zigoto believes that he was destined to become a station master. He gets the job. He likes it and has considerable amusement in regulating the trains which travel back and forth with the rapidity and amusing eccentricity that characterize some of the French comedies. Zigoto gets his train schedule mixed up and there are fifty-seven kinds of trouble in the station. Some of the trains seem too bashful to leave the station unchaperoned and the passengers rage accordingly as the train stalls on the rails. Others impulsively start too soon and the passengers who had counted upon taking them rage and roar when they find that they have missed them. The peevish travelers in the belated trains grow so rambunctious that Zigoto turns the passenger cars into a stable and puts in with the passengers calves, ducks, dogs and other barn-yard ornaments. The fun goes on and Zigoto makes his line a veritable bedlam. The crisis comes when he forgets to shift the switch for the 9:23 express. Accordingly this express jumps the tracks and goes right through the station with the usual accompaniments of damage and hilarity.",
    "Director": "Jean Durand",
    "Writer": "N/A",
    "Actors": "Clément Mégé, Berthe Dagmar, Marie Dorly",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0442015",
    "tt0438017",
    "tt1003515",
    "tt0002133",
    "tt0002501",
    "tt0215495",
    "tt0002280",
    "tt0210599",
    "tt0002232",
    "tt0002255",
    "tt0002290",
    "tt0002387"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.927Z"
}