{
  "movieId": "tt0442003",
  "title": "Blut und Boden",
  "year": 1933,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/1933-Blut-und-Boden",
      "id": "1933-Blut-und-Boden",
      "title": "1933 - Blut und Boden - Grundlagen zum neuen Reich (28m 24s, 352x288)",
      "description": "1933 - Blut und Boden - Grundlagen zum neuen Reich (28m 24s, 352x288)",
      "fileSize": 335769157,
      "addedAt": "2026-01-07T00:06:00.052Z",
      "thumbnail": "https://archive.org/services/img/1933-Blut-und-Boden",
      "language": "German",
      "collection": "feature_films",
      "downloads": 5411
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "28 min",
    "imdbRating": 5.2,
    "imdbVotes": 21,
    "Genre": "Short",
    "Plot": "Walter Ruttmann directed this propagandistic documentary in 1933 after having directed one of the masterpieces of early documentary history Berlin, sinfonie einer Grosstadt in 1927 in Weimar Germany. Today Ruttmann is known as being one of the very talented film workers who decided NOT to leave Germany after Hitler took power in 1933. That leaves the question whether it was possible for Ruttmann to produce films in Nazi Germany that were totally free of nazi propaganda? Blut und Boden proves that the answer is no. The film is about peasants before and after 1933. Not surprisingly the film shows how peasants had a very hard time in the Weimar Republic, many farms being sold off cheaply, peasant families having to move to the city and then the turnaround after Hitler took power. The final episode shows rural life restored, new farms being built, cats and dogs living in harmony side by side, swastikas and the Hitler-jugend marching and singing in the fields. This conclusion is very similar to the conclusions of Leni Riefenstahl's Triumph of the Will and Fritz Hippler's Der ewige Jude. Nazis marching is intended to leave the audience with a reassured sense of optimism.",
    "Director": "Walter Ruttmann, Hans von Passavant, Rolf von Sonjevski-Jamrowski",
    "Writer": "E.Th. Brugers, Karl Motz",
    "Actors": "Heinz Berghaus, Carl de Vogt, Herta Scheel",
    "Language": "German",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0022732",
    "tt0279784",
    "tt0487799",
    "tt0022883",
    "tt0023059",
    "tt0024212",
    "tt0024361",
    "tt0024051",
    "tt0024446",
    "tt0146629",
    "tt0150804",
    "tt0149684"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:00.052Z"
}