{
  "imdbId": "tt0454860",
  "title": "Der König der Mittelstürmer",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/der-konig-der-mittelsturmer_1928",
      "id": "der-konig-der-mittelsturmer_1928",
      "title": "Der König der Mittelstürmer",
      "fileSize": 11234598221,
      "addedAt": "2026-01-07T00:07:59.606Z",
      "thumbnail": "https://archive.org/services/img/der-konig-der-mittelsturmer_1928",
      "language": "German",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 159
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 5.1,
    "imdbVotes": 36,
    "Genre": "Drama, Sport",
    "Plot": "Sports are those bizarre kinds of pastimes in which people sweat and work hard for a trifling reward and the aristocracy doesn't like working hard or sweating nor is there much interest in ordinary sports like football, the sport background depicted in the film \"Der König Der Mittelstürmer\" ( King Of The Centre-forward ) directed by Herr Fritz Freisler . This German Count prefers elegant sports like fencing or drinking, more exciting if both are being played at the same time.Strange and modern times are these, even in Germany, when ordinary people don't appreciate the merits of their ancestors, forgetting and confusing titles of nobility as happens in this film in where a football player is considered a king! for the longhaired hordes? what a disgrace? are those the newest heroes?... it seems so because the film stars Herr Paul Richter, one-time Siegfried and now a footballer? With the same running time as a football match, the film is as boring as that ordinary sport ; the story is full of clichés that mix sports and romance, depicting the story of Tull Harper, football player but also son of a leather manufacturer who is heading for bankruptcy in his business. This serious problem could be avoided with the help of Mabel Douglas ( Aud Egede Nissen ), a rich and Amerikan backer who doesn't really know if that nice boy loves her only for their millions ( football and millions??... what an incongruity ).One of the scarce merits of this film is that is considered as one of the first \"football films\" in Deutschland, not a film genre in itself. It is an unimportant film that doesn't work as a football documentary ( the film includes only simple football shots ) and even less as a romance film with its static and foreseeable story full of the usual things( he loves me, she loves me not ), a tale that will end in a boring but supposedly interesting football match in where our modern hero, obviously, will win the match and the girl's love and fortune.And now, if you'll allow me, I must temporarily take my leave because this German Count must dribble one of his Teutonic heiresses.Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com/",
    "Director": "Fritz Freisler",
    "Writer": "Hugo Huxhol, Kurt Lauermann",
    "Actors": "Paul Richter, Fritz Alberti, Colette Brettel",
    "Language": "None, German",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0017765",
    "tt0017841",
    "tt0018253",
    "tt0017534",
    "tt0017832",
    "tt0020359",
    "tt0020439",
    "tt0020392",
    "tt0018379",
    "tt0017667",
    "tt0039204",
    "tt19800090"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:59.606Z"
}