{
  "movieId": "tt0469153",
  "title": "Panorama Ephemera",
  "year": 2004,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/panorama_ephemera2004",
      "id": "panorama_ephemera2004",
      "title": "Panorama Ephemera",
      "description": "PANORAMA EPHEMERA (2004, 89:35 min., color and black and white) is a collage of sequences drawn from a wide variety of ephemeral (industrial, advertising, educational and amateur) films, touring the conflicted landscapes of twentieth-century America. The films' often-skewed visions construct an American history filled with horror and hope, unreeling in familiar and unexpected ways. PANORAMA EPHEMERA focuses on familiar and mythical activities and images in America (1626-1978). Many creatures and substances that we hardly notice because we feel so used to them take center stage, including pigs, corn, water, telephones, fire, and rice. At first resembling a compilation, it soon reveals itself as a journey through the American landscape over time, and the story begins to emerge between the sequences. The film consists of 64 self-contained film sequences ranging from 5 seconds to 4 minutes in length arranged into a narrative. Unlike many films made using archival footage, it's primarily a combination of sequences rather than a collage of individual shots. PANORAMA EPHEMERA is populated by American children, animals, farmers, industrial workers, superheroes, pioneers heading West, crash test dummies, and many others. PANORAMA EPHEMERA is released under a Creative Commons \"Attribution-NonCommercial\" license, and may be freely shown, copied, or distributed according to the terms of this license (http://creativecommons.org/licenses/by-nc/1.0/). NEW: If anyone wants to do a serious remix of this movie, here's a copy of my Final Cut Pro project (less the movie files, which you'll have to load yourself): http://www.prelinger.com/PanoramaDV20040512 BitTorrent download here (thanks, Simon!): http://www.legaltorrents.com/index.php?fuse=42 NOTE ADDED May 21, 2021: This was my first real film. Since then I have made many more, but this is my best.",
      "fileSize": 7654646649,
      "addedAt": "2026-01-07T00:10:12.695Z",
      "thumbnail": "https://archive.org/services/img/panorama_ephemera2004",
      "year": 2004,
      "collection": "feature_films",
      "downloads": 203974
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "89 min",
    "imdbRating": 6.2,
    "imdbVotes": 36,
    "Genre": "N/A",
    "Plot": "Collage of sequences drawn from a wide variety of ephemeral (industrial, advertising, educational and amateur) films, touring the conflicted landscapes of twentieth-century America. The films' often-skewed visions construct an American history filled with horror and hope, unreeling in familiar and unexpected ways. Panorama Ephemera focuses on familiar and mythical activities and images in America (1626-1978). Many creatures and substances that we hardly notice because we feel so used to them take center stage, including pigs, corn, water, telephones, fire, and rice. At first resembling a compilation, it soon reveals itself as a journey through the American landscape over time, and the story begins to emerge between the sequences. The film consists of 64 self-contained film sequences ranging from 5 seconds to 4 minutes in length arranged into a narrative. Unlike many films made using archival footage, it's primarily a combination of sequences rather than a collage of individual shots. The film is populated by American children, animals, farmers, industrial workers, superheroes, pioneers heading West, crash test dummies, and many others.",
    "Director": "Rick Prelinger",
    "Writer": "Rick Prelinger",
    "Actors": "William Boyett, Bill Agee, Tim Bosworth",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0389974",
    "tt0482962",
    "tt6982524",
    "tt26820087",
    "tt1349632",
    "tt0325013",
    "tt17977694",
    "tt18761394",
    "tt32493438",
    "tt8084578",
    "tt0355746",
    "tt18761206"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.695Z"
}