{
  "movieId": "tt0408107",
  "title": "Poisons",
  "year": 1987,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WyFMJdIPmMo",
      "id": "WyFMJdIPmMo",
      "title": "Poisons, or the world history of poisoning",
      "description": "Eine Version mit englischen Untertiteln ist auf unserem Kanal verfügbar: https://youtu.be/bvChOTAsHec\n\nDer Theaterschauspieler Oleg Volkov ist sich sicher, dass seine Frau ihn betrügt. Schweren Herzens sitzt er in einer Bar und überlegt, was er tun soll. Der imposante Rentner Ivan Petrovich trifft Oleg, mit dem der betrogene Ehemann seine Probleme teilt. Und Ivan Petrovich hat eine Lösung! Es ist notwendig, einfach ... den untreuen Ehepartner zu vergiften. Schließlich ist diese Methode so alt wie die Welt. Einst nahm Sokrates Hemlock-Gift, als das Athener Gericht ihn zum Tode verurteilte ... Und die Zeit im Film ging zurück und führte die Zuschauer in das alte Persien und das mittelalterliche Rom, zu den großen Vergiftungen aller Epochen und Völker - aus den Geschichten des persischen Königs Xerxes an Katharina von Medici. Im Allgemeinen beginnt die Weltgeschichte der Vergiftungen.\n\nErschienen: 2001\n\nRegie: Shakhnazarov Karen\nAutoren: Borodyansky Alexander, Shakhnazarov Karen\nKomponist: Kroll Anatoly\nBetreiber: Klimov Wladimir\nProduktionsdesigner: Kusakova Lyudmila\n\nBesetzung: Oleg Basilashvili, Lyudmila Kasatkina, Andrey Panin, Aleksandr Bashirov, Ignatiy Akrachkov, Zhanna Dudanova, Ekaterina Klimova, Olga Tumaikina, Dmitry Dyuzhev, Marina Kazankova, Yuri Osherov, Elena Obukhova, Alexander Andrievich, Ivan Lakshin, Nikolay Afanasiev, Timur Matsiev, Nikolaeva Veronika, Shelenkov Fedor, Fomina Elena",
      "addedAt": "2025-12-23T03:45:06.502Z",
      "thumbnail": "https://i.ytimg.com/vi/WyFMJdIPmMo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBpS1j7jAwnqCjpvkXsmbAkCT2aqQ",
      "duration": 6229,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "106 min",
    "imdbVotes": null,
    "Genre": "Drama",
    "Plot": "Three brothers, who spy on and mistrust each other, live together in a large neglected house. They are holding an elderly painter prisoner, trying by all means to make him paint again.",
    "Director": "Pierre Maillard",
    "Writer": "Pierre Maillard",
    "Actors": "Roland Dubillard, Maurice Garrel, Rufus",
    "Language": "French",
    "Country": "Switzerland, France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0092978",
    "tt0096492",
    "tt0094683",
    "tt0973837",
    "tt0093791",
    "tt0094888",
    "tt0092819",
    "tt0092552",
    "tt0257543",
    "tt0319326",
    "tt0219797",
    "tt0093036"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:31:46.397Z"
}