{
  "imdbId": "tt0421917",
  "title": "Cabman Kate",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-cabman-kate",
      "id": "silent-cabman-kate",
      "title": "Cabman Kate",
      "fileSize": 1007043157,
      "addedAt": "2026-01-07T00:10:59.115Z",
      "thumbnail": "https://archive.org/services/img/silent-cabman-kate",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 259
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "15 min",
    "imdbRating": 5.1,
    "imdbVotes": 21,
    "Genre": "Comedy, Short",
    "Plot": "As a laundress, Kate isn't much of a success. A goat makes a meal of her clothesline, and the $13.13 that Tim McGrath owes her for washing is apparently uncollectable. But this is nothing to what happens when she forcibly seizes Tim's horse and cab in lieu of her $13.13, after sousing him in the watering trough. Samuel Rosenstein, a dry goods drummer, is very anxious to catch a certain train, and almost goes into hysterics when the taxi-cab in which he is riding breaks down. He spies Kate leading the horse and cab, and wildly implores her to get him to the station in time for his train. With some misgivings, she consents. He gets in, Kate whips up \"Wildfire\" and the thrilling ride begins. In their mad career, Kate runs over a flock of chickens, demolishes an Italian fruit-peddler's stand and nearly scares the natives to death. After all the terrifying speed and hairbreadth escapes from destruction, the nearest Samuel comes to catching his train is when it almost runs over the cab at a railroad crossing. Meanwhile, the victims of her exciting sprint are coming on apace in cabs, and on foot. A fat policeman finally arrests Kate. Followed by Samuel and the crowd of complainants, Kate is marched to the nearest police station. There she is charged with grand larceny, reckless driving, assault and battery, violating traffic rules, operating a vehicle without a license, exceeding the speed limit, damage to property and resisting an officer. The whole affair is so amusing, however, it tickles the judge, who proves himself a good sport by simply forcing Samuel to pay all the damages and costs, and making Tim pay Kate the money he owes her. The case is then dismissed and later Kate and Tim go into life partnership as man and wife, but Kate can never see a cab without a shudder of remembrance.",
    "Director": "C.J. Williams",
    "Writer": "William Addison Lathrop",
    "Actors": "Kate Price, Eddie Redway, Edward Elkas",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0234694",
    "tt0214467",
    "tt0002532",
    "tt0005812",
    "tt0004936",
    "tt0005571",
    "tt0005810",
    "tt0006309",
    "tt0005044",
    "tt0005489",
    "tt0005309",
    "tt0005310"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}