{
  "movieId": "tt0446298",
  "title": "Civic Duty",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/civic-duty-dvdrip",
      "id": "civic-duty-dvdrip",
      "title": "Civic Duty",
      "description": "Angry and depressed over losing his job, Terry Allen begins to suspect his new, Middle Eastern neighbor is at the center of a terrorist conspiracy. Obsessed about revealing the man's true identity, he takes matters into his own hands.",
      "fileSize": 1310388960,
      "addedAt": "2026-01-07T00:07:51.623Z",
      "thumbnail": "https://archive.org/services/img/civic-duty-dvdrip",
      "language": "eng",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 62
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "98 min",
    "imdbRating": 6.2,
    "imdbVotes": 3475,
    "Genre": "Drama, Thriller",
    "Plot": "Shortly after landing a job, Terry Allen is laid off, starts looking for another circa post September 11, 2001 media frenzy and paranoia with President George W. Bush stating that grief has turned to anger, anger to resolution, and that there are thousands of terrorists in over 60 countries ready to strike. With increasing reports of identity theft, the involvement of wealthy &amp; educated foreigners in terrorist activities, Terry starts suspecting his new neighbor, a middle-easterner, who he stereotypes as 'raghead', 'camel jockey', and 'sand nigger'. His wife, Marla, does not share in his bigotry, but he believes that she has turned her attention from rock-stars to Jihadists. While looking for employment, as well as a loan to purchase a house, he also contacts the Federal Bureau of Investigation as he feels he has sufficient evidence that his new neighbor is structuring money, experimenting with chemicals, and associating with other middle-easterners for devious reasons.",
    "Director": "Jeff Renfroe",
    "Writer": "Andrew Joiner",
    "Actors": "Peter Krause, Kal El Naga, Richard Schiff",
    "Language": "English, Arabic",
    "Country": "United Kingdom, United States, Canada",
    "Awards": "1 win & 2 nominations total"
  },
  "relatedMovies": [
    "tt1375790",
    "tt0478832",
    "tt0489070",
    "tt0910548",
    "tt0424938",
    "tt0839991",
    "tt0470705",
    "tt0428541",
    "tt0497365",
    "tt0461653",
    "tt0475410",
    "tt0995033"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.623Z"
}