{
  "movieId": "tt0486497",
  "title": "Cherche fiancé tous frais payés",
  "year": 2007,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Cherchever1",
      "id": "Cherchever1",
      "title": "Cherche",
      "description": "Ceci est un film que nous avons faite dans l'experimentation d'une ligue d'improvisation cinematographique, nous avons fait deux versions, l'une qu'on a fait dans les temps, donc 24Heures, et la version 2 qu'on a fait en 48 heures. C'est un film d'ambiance, une bande de jeunes s'enfoncent dans les bois et tranquillement chacun disparait.",
      "fileSize": 257548093,
      "addedAt": "2026-01-07T00:06:19.366Z",
      "thumbnail": "https://archive.org/services/img/Cherchever1",
      "language": "French",
      "year": 2005,
      "collection": "feature_films",
      "downloads": 7890
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "92 min",
    "imdbRating": 4.8,
    "imdbVotes": 179,
    "Genre": "Comedy",
    "Plot": "Either with « Brice » or with this movie, i wanted to have fun, to feel the spirit of vacations and pursue the magic of « Un Gars, Une Fille » with a gentle, romantic, a bit crazy and arguing Alexandra. Each time i was disappointed : here, if there's maybe not a story, at least there is an original idea : to cast an actor to be the lover of a single daughter during a family vacation reunion ! Alex is good in the romantic, problematic plotter, Salamone is OK as the performer (even if it's bizarre to see Alex getting intimate with Jean's best friend who does a cameo by the way), the relatives are solid but at the end, the movie doesn't work : Cardinale is really uninspired as the mother and above all, the locations are totally depressive : the family mansion is this old, rusty house that french family can have for generations and this Britain place is totally gray, with small beaches, ghostly town. Personally i would be here even for vacations, i wouldn't be happy so as an audience, i can't be more !",
    "Director": "Aline Issermann",
    "Writer": "Jean-Luc Estèbe, Aline Issermann, Brice-Pascal Renault",
    "Actors": "Alexandra Lamy, Bruno Salomone, Claudia Cardinale",
    "Language": "French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt28082434",
    "tt0963158",
    "tt1120912",
    "tt0388182",
    "tt1158278",
    "tt1065092",
    "tt1837662",
    "tt0466839",
    "tt1091869",
    "tt1130914",
    "tt0460912",
    "tt1105274"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.366Z"
}