{
  "movieId": "tt0470339",
  "title": "The Haunted Bedroom",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheHauntedBedroom1913",
      "id": "TheHauntedBedroom1913",
      "title": "The Haunted Bedroom (1913)",
      "description": "An Edison Company Film Released: December 20, 1913 Starring: Herbert Prior, Mabel Trunnelle, Augustus Phillips http://www.imdb.com/title/tt0470339/ No score Not to be confused with the movie of the same name released in 1919.",
      "fileSize": 159778867,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheHauntedBedroom1913",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 1735
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 6.1,
    "imdbVotes": 27,
    "Genre": "Short, Drama, Horror",
    "Plot": "When young Jean Germaine's father decreed that his son should not marry Lizette Rouget, unless the girl brought with her the sum of ten thousand francs. Jean, bowing to the inherited custom of generations, would as soon have thought of flying to the moon as of disobeying the parental command, Lizette was somewhat downcast when she learned the size of the required dowry, but soon brightened up and assured Jean that she would surely have it within a year, as a result of her clever embroidery work. But the end of the year found poor Lizette in a sorrowful state. Only a fifth of the required sum had been earned and Monsieur Germaine was beginning to grow insistent that his son should choose another bride. At her wits' end, Lizette readily accepted the offer of her brother, Paul, to increase the money to the proper amount by means of a certain investment. Unknown to his sister, Paul was an habitué of the gambling dens of Paris. With his sister's money in his charge, he betook himself to a somewhat shady resort, where, owing to a streak of exceptional luck, he succeeded in winning the required stake within half an hour. But although winning the money was easy, taking it away was attended with serious difficulties. The proprietor of the den was distinctly unwilling to have so much money taken away. Paul escaped after a scuffle, only to be held up on the street and stabbed. Desperately wounded, he took refuge in an inn, staggering up to a room, and died after he had concealed the money in a crevice in the floor. From that date, Paul's ghost kept watch in the room and faithfully guarded the money from unworthy hands. Soon the room acquired the evil reputation of being haunted, and was shunned by all. Poor Lizette's hopes expired with the disappearance of her fortune, and nothing was left for her to look forward to but a life of poverty and despair. One day an Englishman came to the den, and, laughing at the landlord's explanation, engaged the room. The ghost recognized an honest man. Under its mysterious influence the Englishman found the money and the paper with Lizette's address upon it. Still under the ghost's guidance, he carried the money to Lizette and changed her sad despair to hopeful joy.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Herbert Prior, Mabel Trunnelle, Augustus Phillips",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0463594",
    "tt0330942",
    "tt0367144",
    "tt0417062",
    "tt0002356",
    "tt2160081",
    "tt1223220",
    "tt1207008",
    "tt0482779",
    "tt1113818",
    "tt0002813",
    "tt0003424"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}