{
  "movieId": "tt0404734",
  "title": "The Adventure of the Hasty Elopement",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-adventure-of-the-hasty-elopement",
      "id": "silent-the-adventure-of-the-hasty-elopement",
      "title": "The Adventure of the Hasty Elopement",
      "fileSize": 284967321,
      "addedAt": "2026-01-07T00:11:15.974Z",
      "thumbnail": "https://archive.org/services/img/silent-the-adventure-of-the-hasty-elopement",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 220
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "15 min",
    "imdbRating": 5,
    "imdbVotes": 95,
    "Genre": "Mystery, Short, Comedy",
    "Plot": "When Octavius reads in the newspaper that auto-thieves had been making havoc in the vicinity of the Rosedale Country Club, his soul was stirred to extraordinary effort. He had just bought a car himself, and naturally felt a keen interest in anything affecting even remotely his new and cherished possession. Then again, there was, of course, his Duty to the Public. In his capacity as an amateur detective Octavius was above all else a relentless bloodhound in the public interest. So he took his machine and went out to Rosedale. Adventure met him on the way, for at the railway station a pretty girl begged him for a ride, and Octavius gladly complied with her request. After a short ride, the girl, apparently by accident, dropped her parasol from the automobile. Octavius gallantly stopped the machine, and ran back to get it. A moment later, the astonished Octavius was standing with the parasol in his hands watching his car speeding down the road under the guidance of the perfidious female. As there was not a moment to be lost, Octavius cranked up a car which was standing idle nearby and started in pursuit. After a long chase, the girl stopped Octavius' car in front of a house and darted in. Octavius followed. When he got inside he discovered that the house was a rectory. When Octavius arrived, the girl had just been married to the man she loved. Immediately afterward the infuriated parents reached the house. While Octavius was attempting to make the radiant young bride understand that she was a thief, a motorcycle policeman arrived and arrested him for speeding. When things were finally straightened out, the chastened Octavius started back for town, anxiously wondering if he would be met by the owner of the car he commandeered with a warrant for his arrest. Instead, he discovered that the car belonged to the auto-thieves who had terrorized the locality, and by one of his absurd pieces of logic was able to turn the criminals over to the police.",
    "Director": "Charles M. Seay",
    "Writer": "Frederic Arnold Kummer",
    "Actors": "Barry O'Moore, Julian Reed, Viola Dana",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0227995",
    "tt0234537",
    "tt0228331",
    "tt0003679",
    "tt0003758",
    "tt0004288",
    "tt0003805",
    "tt0004736",
    "tt0003733",
    "tt0003934",
    "tt0004194",
    "tt0004280"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.974Z"
}