{
  "movieId": "tt0498013",
  "title": "Mirazhi",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-mirazhi",
      "id": "silent-mirazhi",
      "title": "Mirazhi",
      "fileSize": 686900644,
      "addedAt": "2026-01-07T00:11:07.409Z",
      "thumbnail": "https://archive.org/services/img/silent-mirazhi",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 177
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "37 min",
    "imdbRating": 6,
    "imdbVotes": 112,
    "Genre": "Short, Drama",
    "Plot": "Frau Marianna ( Frau Vera Kholodnaia ) is a poor but decent fraulein who is working for the millionaire Herr Dymov; besides being poor and decent, Frau Marianna has also a special concern and talent for the Arts and it is precisely for this reason that Herr Dymov gave her the job of reading books to him. Herr Dymov has a son, a dilettante youngster who with the help of his wealth will seduce Frau Marianna who, besides being poor, decent and talented, has also a fiancée, Herr Sergei. Frau Marianna doesn't hesitate to leave her family and fiancée in order to obtain the splendid life offered by Herr Dymov Jr. Alas; their romance is short lived.\"Mirazhi\" ( Mirages ) (1915) was another fruitful collaboration between the pioneer silent film director, Herr Pyotr Chardynin and the Russian star Frau Vera Kholodnaia; the film is one of those intense pre-revolutionary melodramas so characteristic of the Russian early silent times before the coming of Bolshevism which definitely put an end to a peculiar film artistic style.But that subject certainly doesn't mean that Russian pre-revolutionary oeuvres were lacking in interest or did not achieve important artistic developments; on the contrary, as can be seen in \"Mirazhi\", the wealthy bourgeois life and the contrast with the very different social realities and the daily hardships of the lower class provide an opportunity to create stylized melodramas in the vein of great Russian literature. Deception and tragedy are skillfully depicted in a mere half hour.Herr Chardynin's film settings are always careful and rich in details, including outdoor scenes that open up the story and prevent it from becoming a mere filmed stage play. The heroine, trapped in a golden cage and doomed, is splendidly portrayed by Frau Kholodnaia.And now, if you'll allow me, I must temporarily take my leave because this German Count must do the same as Frau Marianna did except imitate her tragic final decision, natürlich!.",
    "Director": "Pyotr Chardynin",
    "Writer": "Lidiya Charskaya, Ekaterina Tissova",
    "Actors": "Arsenii Bibikov, Tamara Gedevanova, Andrey Gromov",
    "Language": "None",
    "Country": "Russia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0191358",
    "tt0006764",
    "tt0007507",
    "tt0004413",
    "tt0003803",
    "tt0005414",
    "tt0008133",
    "tt0231300",
    "tt0005246",
    "tt0006494",
    "tt0482779",
    "tt0005622"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.409Z"
}