{
  "imdbId": "tt0417062",
  "title": "The Portrait of the Lady Anne",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ThePortraitOfLadyAnne",
      "title": "ThePortraitOfLadyAnne",
      "id": "ThePortraitOfLadyAnne"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "15 min",
    "imdbRating": "6.8",
    "imdbVotes": "88",
    "Genre": "Short, Drama, Fantasy",
    "Plot": "It hung in the place of honor in the old colonial house, and the daughter of the family was very proud of it, for she could prove by the likeness that she was a descendant of the proud Lady Anne, who had been a noted belle one hundred years ago. The portrait had been painted before Lady Anne was married, and only a few years before she died, leaving a broken-hearted husband, and one little child. There were rumors that the Lady Anne had died of a broken heart, because she believed that she had sent one of her disappointed suitors to death, but it was only a tradition, and the girl never believed it. The girl was the living picture of Lady Anne. Everyone told her so, and she had no reason to doubt it. Naturally she liked to watch the painting, and knowing the other woman's life story, or believing she did, she wondered often what her own would be. They had a house party at her home one time, and at night there was a dance. The girl, in a spirit of fun, took all the other young women up in the attic and fitted them out with costumes of days gone by. She herself wore the dress in which Lady Anne bad posed for her portrait, for it emphasized the resemblance. At the dance, the girl and her fiancé had a quarrel. It seemed most serious to her at the time, although it was only a trifle. Still, she returned him his ring and told him that all was over between them forever. For the moment she believed it herself. So she flounced upstairs, took off her gala dress, and was thoroughly miserable. The young man was unhappy, too. The others were dancing, but he stood sadly in one corner. A moment later he brightened up, for his sweetheart entered, and with a radiant smile, went over to him. He welcomed her gladly, they danced, and all his troubles were forgotten. It wasn't the girl he was dancing with, however. She was upstairs in her room at the time. Finally the music drew her out, but as she was not dressed for the party, she slipped out the window and peered in the downstairs room, hoping to see a thoroughly miserable Jack. To her amazement, she saw him dancing with herself. She could not comprehend until she had cautiously made her way into the library. Then she saw that the portrait of the Lady Anne was missing and she realized that a miracle had been performed in her behalf. She went back to her room and reverently picked up the gown of the Lady Anne. Out of the pocket dropped a note, written one hundred years ago. She read and understood. The old legend was true; the Lady Anne had lost the man she loved because of a foolish quarrel, and had died of grief. The girl knew that what she had seen was meant as a lesson to her, and she decided to be guided by it. The lovers made up and never quarreled again, and they say that the portrait of the Lady Anne was seen to smile on their wedding day, but as one matter of fact individual said, perhaps it was only the reflection of the sun upon the glass. Perhaps! But the girl does not believe it, and never will.",
    "Director": "N/A",
    "Writer": "Lloyd Lonergan",
    "Actors": "Florence La Badie, Justus D. Barnes, William Russell",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0463594",
      "title": "The Marble Heart",
      "year": 1913,
      "imdbRating": "4.7",
      "imdbVotes": "40",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002356",
      "title": "The Melody of Love",
      "year": 1912,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt1207008",
      "title": "Never Too Late to Mend",
      "year": 1911,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0470339",
      "title": "The Haunted Bedroom",
      "year": 1913,
      "imdbRating": "6.1",
      "imdbVotes": "27",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0330942",
      "title": "The Struggle",
      "year": 1913,
      "imdbRating": "6.0",
      "imdbVotes": "31",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1113818",
      "title": "Richard the Lion-Hearted",
      "year": 1911,
      "imdbRating": "5.7",
      "imdbVotes": "18",
      "language": "None, Italian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0367144",
      "title": "The Tiniest of Stars",
      "year": 1913,
      "imdbRating": "6.0",
      "imdbVotes": "25",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2160081",
      "title": "Ammunition Smuggling on the Mexican Border: Incidents of the Mexican Revolution",
      "year": 1914,
      "imdbRating": "6.4",
      "imdbVotes": "24",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1223220",
      "title": "Antony and Cleopatra",
      "year": 1914,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0344506",
      "title": "The Two Roses",
      "year": 1910,
      "imdbRating": "5.4",
      "imdbVotes": "48",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0002429",
      "title": "Petticoat Camp",
      "year": 1912,
      "imdbRating": "6.2",
      "imdbVotes": "177",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000488",
      "title": "The Land Beyond the Sunset",
      "year": 1912,
      "imdbRating": "6.9",
      "imdbVotes": "842",
      "language": "None, English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T20:52:23.397Z"
}