{
  "movieId": "tt0405424",
  "title": "The Usurer's Grip",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-usurers-grip",
      "id": "silent-the-usurers-grip",
      "title": "The Usurer's Grip",
      "fileSize": 239313951,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-usurers-grip",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 175
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "15 min",
    "imdbRating": 5.7,
    "imdbVotes": 75,
    "Genre": "Short, Crime, Drama",
    "Plot": "A young clerk, a small salary, a wife and child, the child long ill then the doctor's bill and other bills and debts accumulate; the advertisement in the news about borrowing money on your furniture at six per cent. Ah. That's the solution. I'll try it. Yes, he tried it and as the picture unfolds itself we see the clerk careworn and desperate borrowing twenty-five dollars from a loan shark, who compels him to return five of it for drawing up papers. At this the clerk remonstrates and shows the loan shark his own advertisement at six per cent. The shark snarls and snatches back the money, but the child is ill, what can he do but submit and take what he gets and sign that fatal card, which reads that he must pay forty-five dollars for tho loan of twenty-five. He signs it; he has to. Now comes with sickening regularity the dreaded monthly payments. He cannot always meet them, what then? Slowly they go, his watch, her brooch and last, the baby's ring. And next comes the \"bawlerout.\" The clerk at his desk in a large office is told that a woman wishes to see him. She demands a payment, he can't comply, she raises her voice, threatens, heaps imprecations on him, she will not be silenced. The clerk is humiliated before the whole office and the manager discharges him. He plods home and breaks the news to his wife, who comforts him and bids him try again. The clerk succeeds in getting n new position and a kindly, sympathetic employer in whom he confides, when the \"bawlerout\" next appears. His employer takes him to a loan association, where anyone who is employed and in distress may borrow money at the legal rate of interest. Again, through his employer, the clerk meets the district attorney and tells him of the loan shark who is squeezing money from him, although he has already more than paid the debt. The district attorney investigates and intervenes just in time to prevent the ruffian from taking the very bed from under the clerk's sick child. He also compels him to give back all the usury interest he has received above six per cent.",
    "Director": "Charles Brabin",
    "Writer": "Theodora Huntington, Bannister Merwin",
    "Actors": "Walter Edwin, Gertrude McCoy, Edna May Weick",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0132221",
    "tt0234953",
    "tt0002621",
    "tt0002381",
    "tt0002415",
    "tt0001789",
    "tt0000488",
    "tt0000832",
    "tt0000942",
    "tt0000831",
    "tt0000728",
    "tt0002054"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}