{
  "imdbId": "tt0477332",
  "title": "The Lone Game",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-lone-game",
      "id": "silent-the-lone-game",
      "title": "The Lone Game",
      "fileSize": 347489648,
      "addedAt": "2026-01-07T00:11:15.977Z",
      "thumbnail": "https://archive.org/services/img/silent-the-lone-game",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 189
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "16 min",
    "imdbRating": 5,
    "imdbVotes": 104,
    "Genre": "Short, Drama",
    "Plot": "Grace Proctor, in dire poverty, seeks employment. She is struck by a car and picked up by Dean, who rushes her to the hospital in his machine. She tells him her story and he recognizes her as the sister of his classmate, Phil, who has coached him through college. She tells him of Phil, who, through his efforts to support her and give her a vocal education, has broken down and been attacked by the ravages of tuberculosis. Under the impression that he was suffering from malaria, he neglected his condition until he was no longer able to be about. Dean promises to obtain employment for Grace as soon as she is well again. Phil goes West. Unable to obtain work, he is compelled to go to a sanitarium. His stay there is short, however, for he has no funds and he wanders about without treatment, while his lungs are slowly eaten away. Dean, who has neglected a cold, is examined by a specialist, who tells him that he has tuberculosis. His wealthy father immediately sends him west, attended by nurses and surrounded by every comfort that money can procure. Under the expert treatment which he received, he gradually recovers. Grace, who has obtained employment through Dean, is beginning to feel the hereditary curse slowly creeping upon her. Consulting a physician in a hospital clinic, she is told that the west helps only those who can afford to go there under the proper circumstances. She is sent to the Bradley Sanitarium in Waverly. Connecticut, where she is treated without charge. Time passes and Grace is cured. Her voice has been restored and she sings at the Red Cross Benefit. She meets Dean, who has returned completely cured. He tells her of Phil's death. With no one in the world to care for her, her heart sinks, but Dean gathers her in his arms, and whispers to her the only cheering words that she has ever heard: \"I love you.\"",
    "Director": "Edward C. Taylor",
    "Writer": "Mary Rider",
    "Actors": "Bessie Learn, Robert Walker, Wilfred Young",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005047",
    "tt1262050",
    "tt0003803",
    "tt0005414",
    "tt0231300",
    "tt0005246",
    "tt0482779",
    "tt0005622",
    "tt0228815",
    "tt0442148",
    "tt0195934",
    "tt0326289"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.977Z"
}