{
  "movieId": "tt0442148",
  "title": "The Doll-House Mystery",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-doll-house-mystery",
      "id": "silent-the-doll-house-mystery",
      "title": "The Doll-House Mystery",
      "fileSize": 1282625869,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-doll-house-mystery",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 506
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "20 min",
    "imdbRating": 5.4,
    "imdbVotes": 28,
    "Genre": "Short, Drama",
    "Plot": "John Grant, a broker, places some very valuable bonds in his library desk. Carmen, Grant's little daughter, sees the bonds. Thinking them very pretty, she takes them to her doll's house, unknown to her parents. Here, she and Georgie Morley, her poor little playmate, proceed to paper the house with the bonds. When Grant discovers the loss of the paper, he summons a detective. More bonds are placed on the table. Again little Carmen helps herself to the pretty papers and takes them to her playhouse. She makes Georgie a present of some of them, and he places them in his blouse and starts for home. The detective, leaving Grant's house at the same time, finds one of the papers, traces Georgie home. He watches outside, and sees Georgie's father, Jim Morley, an ex-convict who has been trying to lead a straight life, enter the door. Georgie warns his father that the detective has found the paper which Carmen had given him. Although innocent, Morely is fearful of the police, and flees from the house with the boy in his arms. The detective follows, and there is a spectacular fight between the two men on the speeding freight. Morley succeeds in stunning the detective. Then he leaps with Georgie from the train. The detective organizes a posse and pursues. Morley, with Georgie, is cornered in a cabin and as he threatens to shoot, the posse commences firing. Meanwhile, little Carmen has disclosed to her mother that the bonds are on the walls of her doll's house. Grant rushes to the police station to exonerate Morley, taking Carmen with him to tell her story. Learning at the station that the posse is after Morley, dead or alive, and that the innocent man may already have been killed, because of Carmen's playful prank, Grant leaves with the police in their high power machine, in the hope that they may reach the cabin in time to save Morley's life. Carmen insists on being taken along. Grant and the police arrive just in time to restrain the posse from slaying the ex-convict. Morley is exonerated, and the two children, Georgie and Carmen, are happy again.",
    "Director": "Chester M. Franklin, Sidney Franklin",
    "Writer": "N/A",
    "Actors": "Charles Gorman, Georgie Stone, 'Baby' Carmen De Rue",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006745",
    "tt0006509",
    "tt0003803",
    "tt0005414",
    "tt0231300",
    "tt0005246",
    "tt0482779",
    "tt0005622",
    "tt1262050",
    "tt0228815",
    "tt0005047",
    "tt0477332"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}