{
  "movieId": "tt0433412",
  "title": "Material Girls",
  "year": 2006,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4Q_OC9_hUEQ",
      "id": "4Q_OC9_hUEQ",
      "title": "HILARY DUFF in MATERIAL GIRLS (Comedy in German, Romco, full movie German complete, romance film)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Die verwöhnten Erbinnen eines Kosmetik-Imperiums stürzen nach einem Skandal ins finanzielle Chaos. Plötzlich mittellos, müssen sie sich ohne Luxus durchschlagen und kämpfen darum, ihr einstiges Leben zurückzugewinnen. Mit Disney-Star HILARY DUFF (\"Lizzy McGuire\" & \"Im dutzend billiger\"!\n\nMATERIAL GIRLS (2006)\nOriginaltitel: Material Girls\nMit: Hilary Duff, Haylie Duff, Anjelica Huston\nRegie: Martha Coolidge\nFSK: Freigegeben ab 0 Jahren\n\nINHALTSANGABE:\nDie verwöhnten Gören Tanzie und Ava sind die Erbinnen eines Kosmetik-Imperiums. Sie leben in einer Welt des Überflusses und haben keine Ahnung von der \"normalen\" Welt, in der sie gnadenlos scheitern würden. Aus ihrem Paris-Hilton-Schlaf werden sie gerissen, als ein Skandal und eine darauf folgende Untersuchung sie ihrer Besitztümer beraut. Komplett verarmt, müssen sie lernen, ohne den täglichen Luxus auszukommen. Dass das beiden alles andere als leicht fällt, versteht sich von selbst. Um so verzweifelter versuchen sie, ihren Reichtum zu retten...\n#Netzkino #ganzerFilm #hilaryduff \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:49:22.948Z",
      "thumbnail": "https://i.ytimg.com/vi/4Q_OC9_hUEQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBwk1MGv5JdGwAkeWikjprco0nD7A",
      "duration": 5637,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "98 min",
    "imdbRating": 4,
    "imdbVotes": 22872,
    "Genre": "Comedy, Family, Romance",
    "Plot": "The silver spoon daughters of the late cosmetics empire founder Victor Marchetta, Avan and Tanzie, never even took an interest in the business, happy to let it be run by their and the firm's administrator, Tommy Katzenbach, while they lead socialite lives, aiming at a marriage with soap star Mic Rionn. Suddenly a scandal wrecks the firm's stock and their family reputation. Their credit cards are canceled, one of them torches the mansion, the other hands their sports-car to a thief mistaken for a parking valet. So they end up living with their Latina former cleaning lady. Help to investigate whether the firm is really best sold to competitor Fabiella, as Tommy claims, comes from hunky lab technician Rick, whom the previously mistook for the inexistent firm parking lot attendant, and Henry Baines, whose free law for the poor charity they didn't even consider for sponsoring.",
    "Director": "Martha Coolidge",
    "Writer": "John Quaintance, Jessica O'Toole, Amy Rardin",
    "Actors": "Hilary Duff, Haylie Duff, Anjelica Huston",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 4 nominations"
  },
  "relatedMovies": [
    "tt0412922",
    "tt5863634",
    "tt0067818",
    "tt0038704",
    "tt0466342",
    "tt0483726",
    "tt1942787",
    "tt13057170",
    "tt14444018",
    "tt8312392",
    "tt0482088",
    "tt3214240"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:35.804Z"
}