{
  "imdbId": "tt0434198",
  "title": "The Death of the Duke D'Enghien",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-death-of-the-duke-denghien",
      "id": "silent-the-death-of-the-duke-denghien",
      "title": "The Death of the Duke D'Enghien",
      "fileSize": 221938927,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-death-of-the-duke-denghien",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 325
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "15 min",
    "imdbRating": 5,
    "imdbVotes": 32,
    "Genre": "Short, Drama, History",
    "Plot": "The incidents in this picture took place in 1803-4 when Napoleon was First Consul. In August, 1803, Napoleon discovered a conspiracy hatched in England in which three Englishmen were implicated. The aim of the conspirators was to restore to the throne of France one of the Bourbons. The Prince de Conde, father of the Duke D'Enghien, was in England at this time and he probably was associated with the conspirators. The Duke D'Enghien had already borne arms against the French Republic in the Austrian army, but there was no particular reason for supposing that he was interested in this particular conspiracy against Napoleon Bonaparte, except that it had been learned through some of the conspirators, that had already been arrested, that a Prince of the Bourbon family was about to come on French soil and take active measures towards regaining the throne. As the Duke D'Enghien was residing at this time at Ettenheim just over the border line and was at times absent from his home several days together, Napoleon fixed on him as the probable Prince. This was altogether wrong, however, as the Duke was not interested in the affairs of state, but very much interested in those of the heart. He was very much in love with and spent most of his time in paying court to the beautiful Charlotte de Rohan and in the pleasures of the chase. One of Napoleon's officers was sent to Ettenheim, however, to spy on the Duke and on March 10th this officer sent a report to Napoleon which convinced the latter that the Duke was one of the conspirators. After consulting with his ministers it was decided to rush into Germany and capture the Duke. This was done five days after Napoleon received the information, and the Duke was brought to Strasburg and then to Versailles. Napoleon was so undecided as to what punishment to mete out to his prisoner that he retired to Malmaison for several days to give the matter serious consideration, but finally came to the conclusion that the Duke's death was a necessary political move, as the royalists must be intimidated at any cost. Murat, Napoleon's brother-in-law, was so disinclined to sign the Duke's death warrant that the first consul was incensed at their lack of appreciation of the necessity of this political step and signed the order himself. The Duke was conducted to the place of execution in the courtyard of Versailles by Col. Savary, where he was shot to death. His body was buried on the spot where he fell. It was made known after his death that Mr. Real had been sent by Napoleon to question the Duke further to find if possible a sufficiently good excuse to pardon him, but Mr. Real was not told of Napoleon's message until late and arrived at Versailles a few moments after the execution.",
    "Director": "Albert Capellani",
    "Writer": "Léon Hennique",
    "Actors": "Georges Grand, Henry Houry, Germaine Dermoz",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0433791",
    "tt0482887",
    "tt0164493",
    "tt0461304",
    "tt0460831",
    "tt0001032",
    "tt0188941",
    "tt0434455",
    "tt0434199",
    "tt0434157",
    "tt0191402",
    "tt0001117"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}