{
  "movieId": "tt0449061",
  "title": "London",
  "year": 2005,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AWindowInLondon",
      "id": "AWindowInLondon",
      "title": "A Window in London",
      "description": "“Part thriller, part emotional drama” “Between life and death in London” “Unusual murder mystery” (IMDB reviews quotes). A unique thriller with a good Anglo-Hungarian cast and views of life in London that unknowingly was on the eve of war. Good production values. Remake of the French drama “Metropolitain” (1939). IMDB rating 6.9. Directed by Herbert Mason. Released in 1940.. Complete print (original UK release). AKA “Lady in Distress”",
      "fileSize": 1072667886,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/AWindowInLondon",
      "collection": "feature_films",
      "downloads": 5522
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "92 min",
    "imdbRating": 6.3,
    "imdbVotes": 25119,
    "Genre": "Drama, Romance",
    "Plot": "In New York, the drug-addicted Syd is consumed by drink and drugs - missing his girlfriend London, who broke up with him six months ago after a two-year relationship. When Syd finds that London's friends throw a going away party for her, he decides to go to the party without an invitation. But first he meets the banker and drug-dealer, Bateman, in a bar to buy coke, and he invites his new acquaintance to go to the party with him. While locked in the bathroom with Bateman snorting coke and drinking booze, Syd recalls moments of his relationship with London, inclusive that he had never said \"I love you\" to his girlfriend despite her countless requests. Bateman also \"open his heart\" under the influence of cocaine and tells his impotence problem to Syd; in the end he convinces Syd to talk to London.",
    "Director": "Hunter Richards",
    "Writer": "Hunter Richards",
    "Actors": "Jessica Biel, Chris Evans, Jason Statham",
    "Language": "English",
    "Country": "United Kingdom, United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0856775",
    "tt0382810",
    "tt0872022",
    "tt0870944",
    "tt0882791",
    "tt0483726",
    "tt0814197",
    "tt0414993",
    "tt0425326",
    "tt0315206",
    "tt0410297",
    "tt0452594"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.633Z"
}