{
  "movieId": "tt0463594",
  "title": "The Marble Heart",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheMarbleHeart",
      "id": "TheMarbleHeart",
      "title": "\"The Marble Heart\" (1913) featuring Florence La Badie",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   We have included this film in our program to illustrate the work and contributions of Florence La Badie, a star of Silent Hall of Fame. \"The Marble Heart\" is a short drama.  A talented sculptor is heartbroken when the woman he loves rejects him for a rich man. Directed by                     unknown Produced by                   Thanhouser Company Based on                          the play by Charles Selby Starring                          James Cruze, Florence La Badie, Marguerite Snow, William Russell Cinematography by       unknown Distributed by                Mutual Film Release date                    May 13, 1913 Running time                  27 minutes Country                           United States Language                         Silent film, English intertitles Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 341870529,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheMarbleHeart",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 1125
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "27 min",
    "imdbRating": 4.7,
    "imdbVotes": 40,
    "Genre": "Short, Drama",
    "Plot": "Outside the door of the home of a sculptor and his mother, fell a poor, friendless young girl. They took the girl in and cared for her, and as time went on the mother began to regard her as her daughter. The son regarded the affectionate advances of the girl with only brotherly love. But there came a time when the misgivings of the son changed, for he began to pay scant attentions to a young beauty he met at a reception and who was characterized as a woman with a heart \"cold as marble.\" This piqued the beauty, who was accustomed to abject adulation. She determined to bring him to her feet and in this she succeeded. She offered to pose for him, and, spurred on by such a splendid model and her praises, he produced a figure which was acclaimed by all the critics as a masterpiece. With fame thus attained he neglected his home and spent all his time wooing the beauty, who was cold and impassive as the statue. The sculptor was warned by an editor friend that the beauty did not care for him and that he would meet the fate of her other admirers. The sculptor, disbelieving his friend's warning, fell asleep and dreamed that he was a sculptor in ancient Athens when Diogenes, the philosopher, lived. He had created a beautiful statue for a rich man, and having fallen in love with his work, he was loath the part with it when the rich man came to claim it. The rich man then ordered the soldiers to carry the statue away, and they were on the point of doing so when Diogenes appeared and told them that the statue should decide who the owner would he. The sculptor presented his case, pleading great love, which the statue paid no heed to; then the rich man displayed jewels and money, and immediately the statue extended its arms to him. The sculptor then awoke and found that it was only a dream. He was happy in the beauty's company until he found that she had pledged herself to another. This drove him frantic, and, rushing to his studio, he smashed the statue and fell dying on the floor, where he was found by the beauty and the friend. The latter indignantly ordered the beauty from the home she had wrecked.",
    "Director": "N/A",
    "Writer": "Charles Selby",
    "Actors": "Marguerite Snow, James Cruze, Florence La Badie",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0367144",
    "tt0417062",
    "tt0464694",
    "tt0470339",
    "tt0330942",
    "tt0002356",
    "tt2160081",
    "tt1223220",
    "tt1207008",
    "tt0482779",
    "tt1113818",
    "tt0002784"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}