{
  "movieId": "tt0486919",
  "title": "A Tango Tangle",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/tango-tangle-1914-directed-by-mack-sennett",
      "id": "tango-tangle-1914-directed-by-mack-sennett",
      "title": "Tango Tangle (1914) Directed By Mack Sennett",
      "description": "Tango Tangles Theatrical release poster Directed by Mack Sennett Written by Mack Sennett Produced by Mack Sennett Starring Charles Chaplin Ford Sterling Roscoe 'Fatty' Arbuckle Chester Conklin Minta Durfee Cinematography Frank D. Williams Production company Keystone Studios Distributed by Mutual Film Release date March 9, 1914 Running time 12 minutes Country United States Languages Silent film English (Original titles) Chaplin and Arbuckle Tango Tangles is a 1914 American film comedy short starring Charles Chaplin and Roscoe Arbuckle . [ 1 ] The action takes place in a dance hall, with a drunken Chaplin, Ford Sterling , and the huge, menacing, and acrobatic Arbuckle fighting over a girl. The supporting cast also features Chester Conklin and Minta Durfee . The picture was written, directed and produced by Mack Sennett for Keystone Studios and distributed by Mutual Film Corporation. In Tango Tangles , Charlie Chaplin appears without makeup and his usual mustache, baggy pants, and oversized shoes. The film was shot at a dance hall without any sort of formal script. Mack Sennett, in his 1954 autobiography King of Comedy , said of the impromptu nature of Tango Tangles , \"We took Chaplin, [Ford] Sterling, [Roscoe] Arbuckle and [Chester] Conklin to a dance hall, turned them loose, and pointed a camera at them. They made funny, and that was it.\" Tango Tangles marked the last time that Ford Sterling and Chaplin appeared in the same film. Sterling had decided to leave Keystone where he had gained most of his fame as the chief of the Keystone Cops. Reviews The movie publication Bioscope wrote of Tango Tangles , \"Jealousy in a dance room ends in a fight which is engaged by the dancers, musicians and attendants.\" Another reviewer in The Cinema wrote, \"The ballroom is soon converted into a battlefield which results in this Keystone being a real scream.\" Cast Charles Chaplin - Tipsy Dancer Roscoe Arbuckle - Clarinetist Ford Sterling - Band leader Chester Conklin - Guest in Police Costume Minta Durfee - Guest Charles Avery ... Guest in Straw Hat (uncredited) Glen Cavender ... Drummer in band / Guest in Cone Hat (uncredited) Alice Davenport ... Guest with Man in Overalls (uncredited) Billy Gilbert ... Guest in cowboy hat (uncredited) William Hauber ... Flutist (uncredited) Bert Hunn ... Guest (uncredited) George Jeske ... Cornet Player / Guest with Bow Tie (uncredited) Edgar Kennedy ... Dance Hall Manager (uncredited) Sadie Lamp ... Hat Check Girl (uncredited) Hank Mann ... Guest in Overalls (uncredited) Harry McCoy ... Piano Player (uncredited) Rube Miller ... Guest Pushed Away (uncredited) Dave Morris ... Dance Organizer (uncredited) Eva Nelson ... Guest with Man in Cone Hat (uncredited) Frank Opperman ... Clarinetist / Guest (uncredited) Peggy Pearce ... Guest (uncredited) Al St. John ... Guest in Convict Costume (uncredited) References 1 Walker, Brent E. (2010). Mack Sennett's Fun Factory: A History and Filmography of His Studio and His Keystone and Mack Sennett Comedies, with Biographies of Players and Personnel . McFarland Inc. p. 291. ISBN   9780786457076 . Retrieved 20 February 2024 .",
      "fileSize": 44672928,
      "addedAt": "2026-01-07T00:11:46.527Z",
      "thumbnail": "https://archive.org/services/img/tango-tangle-1914-directed-by-mack-sennett",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 186
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Short, Comedy",
    "Plot": "A tango-crazy wife goes to dance with another man.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "N/A",
    "Country": "UK",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt6373988",
    "tt0146448",
    "tt0245297",
    "tt1247273",
    "tt0366564",
    "tt0002429",
    "tt1298777",
    "tt6528876",
    "tt0308284",
    "tt3110548",
    "tt2585250",
    "tt0257379"
  ],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:46.527Z"
}