{
  "movieId": "tt0456057",
  "title": "Minikillers",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/minikillers-1969-diana-rigg-4_202105",
      "id": "minikillers-1969-diana-rigg-4_202105",
      "title": "Minikillers (1969)",
      "description": "Diana Rigg",
      "fileSize": 3288326720,
      "addedAt": "2026-01-07T00:09:54.327Z",
      "thumbnail": "https://archive.org/services/img/minikillers-1969-diana-rigg-4_202105",
      "collection": "feature_films",
      "downloads": 1566
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "42 min",
    "imdbRating": 5.3,
    "imdbVotes": 49,
    "Genre": "Short, Action, Crime",
    "Plot": "In 1969 Diana Rigg was at the high point of her (large and small) screen career. Just finished with 'The Avengers', she was about to appear in the lavish period romp 'The Assassination Bureau' with Oliver Reed and a great supporting cast, directed by Basil Dearden, and her classic Bond role Tracey DiVicenzo in 'On Her Majesty's Secret Service'. So what was she doing appearing in not one, but two, cheap, wordless, German-produced films made in Super8 format which were shot in Spain?These films were never part of Diana Rigg's official filmography and she never mentioned them in interviews even as a self-deprecating joke. I have a private theory as to what was behind these films, but it is only a personal guess. I remember reading in the early 1970's that Diana had a holiday home in a remote part of the island of Majorca. My personal guess is she needed to prove some kind of legal reason or need to be resident in Spain in order to buy property there. So she made this couple of quickies to say to the authorities: \"Look! I work in Spain so I have a right/need to live here.\" Then she bought her holiday home.None of which is a review of the film, so I will just say they are cheap but not without a kind of amateurish charm. Diana Rigg is by far the best thing about them and looks wonderful. To her credit she does not just go through the motions, but fills the screen with charm and charisma whenever she appears.I have no shame in saying I fell in love with Diana Rigg as Emma Peel and still do, not just as a pin-up - she was smart, funny and life-enhancing, and never lost her essential beauty. I saw her several times on stage and she was tremendous. Her death came as a real blow and although I never met her, even as just a fan I will miss knowing she's around.",
    "Director": "Wolfgang von Chmielewski",
    "Writer": "Michael von Chmielewski, Wolfgang von Chmielewski",
    "Actors": "Diana Rigg, José Nieto, Moisés Augusto Rocha",
    "Language": "None",
    "Country": "Spain, West Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0233351",
    "tt3390244",
    "tt0000273",
    "tt0231445",
    "tt1235803",
    "tt0066970",
    "tt0062861",
    "tt0062630",
    "tt0330536",
    "tt0061882",
    "tt0069948",
    "tt0223839"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.327Z"
}