{
  "imdbId": "tt0468340",
  "title": "Mazeppa, der Volksheld der Ukraine",
  "year": 1919,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-mazeppa-der-volksheld-der-ukraine",
      "id": "silent-mazeppa-der-volksheld-der-ukraine",
      "title": "Mazeppa, der Volksheld der Ukraine",
      "fileSize": 1228908045,
      "addedAt": "2026-01-07T00:11:07.409Z",
      "thumbnail": "https://archive.org/services/img/silent-mazeppa-der-volksheld-der-ukraine",
      "year": 1919,
      "collection": "feature_films",
      "downloads": 475
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 6.4,
    "imdbVotes": 19,
    "Genre": "Drama",
    "Plot": "\"Mazeppa, der Volksheld der Ukraine\" (1919) is a historical film by German director Martin Berger, that was made in 1918 and released the next summer. Berger directed a total of 20 films, majority of which are now lost and forgotten. This was his third, and one which he also wrote. The film was produced by a short-lived company that made only six films, all of them Berger's.\"Mazeppa\" is loosely based on the life of Ukranian folk hero Ivan Mazeppa (1639 - 1709), or at least the famous poems written about the man after his death. Any viewer should not come in cold without some knowledge of the subject, as the film is not very informative. It does have a nice story to tell, about how Mazeppa (played by Werner Krauss of later \"Caligari\" fame) served in the Polish court, then had an affair with the wrong woman, and as a punishment was tied to a horse naked and sent to the wilderness to die. His survival narrative would have made for a good film, but there is very little of that here. Most of the film takes place indoors and the actors probably did not have fun, since their historical costumes look quite warm for these scenes.Ukraine was a timely subject in 1919, as the country was amidst the chaos of their war of independence following the aftermath of the October revolution in Russia. Germany and Poland also played their part in this conflict, which may have sparked the German interest in Ukrainian subjects. This film is not well made, as the story seems fragmentary and hard to follow, and there is hardly merits for cinematography or acting either. There is very little memorable things in the film, and by 1919 the standards of German cinema were on the rise.",
    "Director": "Martin Berger",
    "Writer": "Martin Berger",
    "Actors": "Alfred Beierle, Max Gülstorff, Rudolf Hofbauer",
    "Language": "None",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0009559",
    "tt0009968",
    "tt0010103",
    "tt0010137",
    "tt0010208",
    "tt0010316",
    "tt0010402",
    "tt0010418",
    "tt0010890",
    "tt0192409",
    "tt0010680",
    "tt0010178"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.409Z"
}