{
  "imdbId": "tt0454097",
  "title": "Chantecoq",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-chantecoq",
      "id": "silent-chantecoq",
      "title": "Chantecoq",
      "fileSize": 1296605000,
      "addedAt": "2026-01-07T00:10:59.115Z",
      "thumbnail": "https://archive.org/services/img/silent-chantecoq",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 245
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": 10,
    "Genre": "War",
    "Plot": "This an attempt by Pouctal to adapt the style of the great Feuillade serials (particularly in this case Fantômas) to the purposes of war propaganda. There's no shilly-shallying. The gang of spies led by mistress/criminal (presumably played by Claude Mérelle) are all introduced at the begiining in Fantômas stylein both their \"real\" character and their disguised one as is the writer Arthur Bernède's celebrated pipe-smoking amateur dective Chantecoq, represented as their \"deadliest enemy\".The setting, symbolically enough, is La Meuse in Lorraine (some nice wooded scenery) where the spies are attempting to blow up a munitions factory and get hold of the inevitable secret formula for some weapon of other. When the director of the works is murdered, the police (as is their wont) add two and two to make five while Chantecoq is on the track of the true culprits who, as is their wont, have been extraordinarily careless about leaving clues around..One of the spies disguises himself as the dead director to tick the chemist; Chantecoq promptly disguises himself as the chemist to trick the spy. The mistress criminal turns up disguised as a widow but reveals herself to Chantecoq (whom she rceognises immediately) as \"William's spy,\" Emma Lückner.Chantecoq drugged, abducted and shipped to Germany (en Bocherie) by the villains, the police back in the Meuse on completely the wrong track......the war is on the point of being lost when - alas - the film deteriorates into crude and silly comedy of the sort often found in later US propaganda films (Yankee Doodle in Berlin) and from which it is unable to recover.",
    "Director": "Henri Pouctal",
    "Writer": "Arthur Bernède, Pierre Decourcelle",
    "Actors": "Claude Mérelle, Gaston Michel, Bordes",
    "Language": "None",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0006405",
    "tt0004972",
    "tt0008663",
    "tt0008188",
    "tt0005719",
    "tt0008807",
    "tt0142333",
    "tt0008359",
    "tt0005059",
    "tt0005149",
    "tt0009150",
    "tt0009620"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}