{
  "movieId": "tt0421867",
  "title": "Bud's Recruit",
  "year": 1918,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-buds-recruit",
      "id": "silent-buds-recruit",
      "title": "Bud's Recruit",
      "fileSize": 975898903,
      "addedAt": "2026-01-07T00:10:59.114Z",
      "thumbnail": "https://archive.org/services/img/silent-buds-recruit",
      "language": "English",
      "year": 1918,
      "collection": "feature_films",
      "downloads": 393
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "26 min",
    "imdbRating": 5.8,
    "imdbVotes": 113,
    "Genre": "Short, Comedy, Drama",
    "Plot": "Reggie learns that his number is so far down on the draft list that there is little likelihood of his being drawn, and he and his mother and fiancée are delighted. Bud, his kid brother, however, feels the disgrace of having a \"slacker\" in the family, and shows his contempt for Reggie in various ways. Bud's patriotism finds an outlet in a demonstration of his company of \"soldiers\" in front of the house where his mother is entertaining the Peace Society. As a recruiting party the demonstration is a success, for Reggie's fiancée comes to the door with the others to see what the noise is all about, and is touched by the undoubted earnestness of the young \"soldiers,\" and, taking a flag, joins them. Finally Bud can stand it no longer, and not being able to enlist himself, he impersonates Reggie and enlists in his name. Reggie is at once congratulated on all sides and is bewildered until he sees the announcement of his enlistment in the newspapers. The realization that the part he is playing is not a manly one dawns on him gradually. He arrives at the recruiting desk just in time to answer to his name. Bud, still in the role of Reggie and ready to go on with the affair, reluctantly takes off his disguise and watches the activities of his big brother with mingled feelings of pride and longing.",
    "Director": "King Vidor",
    "Writer": "Judge Willis Brown, King Vidor",
    "Actors": "Wallace Brennan, Robert Gordon, Ruth Hampton",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0009018",
    "tt0009629",
    "tt0008133",
    "tt0194858",
    "tt0326184",
    "tt0006764",
    "tt0007507",
    "tt0004413",
    "tt0016251",
    "tt0015500",
    "tt0019258",
    "tt0010534"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.114Z"
}