{
  "movieId": "tt0409081",
  "title": "New Town Original",
  "year": 2005,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MntwTabMllw",
      "id": "MntwTabMllw",
      "title": "New Town Original | Full Drama Movie | This Is Essex | Elliott Jordan",
      "description": "*New Town Original* - Mick spends a night with the girlfriend of the town's psycho. Now, he must choose: run or face the town's most feared man.\n2005. Stars: Elliott Jordan, Katharine Peachey, Kal Aise, Terry Bird, John Campbell-Mac\n*Licensed from Distribution Solutions. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:03:43.751Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/MntwTabMllw/maxresdefault.webp",
      "duration": 4796,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "86 min",
    "imdbRating": 6.2,
    "imdbVotes": 78,
    "Genre": "Drama",
    "Plot": "I watched this film primarily because it's based in Basildon, Essex, which is an area I used to work in. I also felt that as an Essex resident myself I had to offer my support to the film. I did think that it would be a poorly put together film, due to the low budget and virtually unknown cast. However, I was very pleasantly surprised to find that I was gripped in the plot from beginning to end. The acting by most of the cast was extremely good and very believable. Essex mentality, nightlife, cultural and social scene was portrayed extremely well. I fell in love with the characters, warming to their worries and fears, and laughing at their mistakes and relationship blunders. The plot I felt was predictable and i had no reason to think otherwise until right near the end key parts of the plot were revealed. What I was seeing unfold in front of my eyes turned out to have other meanings. You have to watch it to understand what i mean. The twist and revelations at the end were fantastically thought out, giving the film a clever, steady and exciting pace.Excellent portrayal of a small town in England, and the lives of a group of young 20 something men struggling to find their way in life.I would recommend anyone see this film, especially Essex people or those that know the area. Not sure when its out on DVD but should be by the end of this year I would have thought.",
    "Director": "Jason Ford",
    "Writer": "Jason Ford",
    "Actors": "Kal Aise, Terry Bird, John Campbell-Mac",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0475536",
    "tt0436091",
    "tt0856775",
    "tt0449061",
    "tt5506590",
    "tt0492868",
    "tt0436012",
    "tt0451094",
    "tt0463029",
    "tt0457477",
    "tt0416471",
    "tt0371257"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:10:13.846Z"
}