{
  "movieId": "tt0498380",
  "title": "Letters from Iwo Jima",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/letters.-from.-iwo.-jima.-2006_202511",
      "id": "letters.-from.-iwo.-jima.-2006_202511",
      "title": "Letters from Iwo Jima (2006)",
      "description": "Letters from Iwo Jima is a 2006 Japanese-language American war film directed and co-produced by Clint Eastwood, starring Ken Watanabe and Kazunari Ninomiya. It  tells the story of the Battle of Iwo Jima during World War II from the perspective of Japanese soldiers. It follows Private First Class Saigo, who, along with his comrades, faces overwhelming odds as they defend the island under the command of Lieutenant General Tadamichi Kuribayashi, who believes in a strategy of underground defenses despite the grim reality of their situation.",
      "fileSize": 2514947206,
      "addedAt": "2026-01-07T00:09:38.890Z",
      "thumbnail": "https://archive.org/services/img/letters.-from.-iwo.-jima.-2006_202511",
      "language": "jpn / English subtitles",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 367
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "141 min",
    "imdbRating": 7.8,
    "imdbVotes": 174028,
    "Genre": "Action, Adventure, Drama",
    "Plot": "The island of Iwo Jima stands between the American military force and the home islands of Japan. Therefore the Imperial Japanese Army is desperate to prevent it from falling into American hands and providing a launching point for an invasion of Japan. General Tadamichi Kuribayashi (Ken Watanabe) is given command of the forces on the island and sets out to prepare for the imminent attack. General Kuribayashi, however, does not favor the rigid traditional approach recommended by his subordinates, and resentment and resistance fester amongst his staff. In the lower echelons, a young soldier, Saigo (Kazunari Ninomiya), a poor baker in civilian life, strives with his friends to survive the harsh regime of the Japanese Army itself, all the while knowing that a fierce battle looms. When the American invasion begins, Kuribayashi and Saigo find strength, honor, courage, and horrors beyond imagination.",
    "Director": "Clint Eastwood",
    "Writer": "Iris Yamashita, Paul Haggis, Tadamichi Kuribayashi",
    "Actors": "Ken Watanabe, Kazunari Ninomiya, Tsuyoshi Ihara",
    "Language": "Japanese, English",
    "Country": "United States",
    "Awards": "Won 1 Oscar. 25 wins & 39 nominations total"
  },
  "relatedMovies": [
    "tt0913968",
    "tt1104684",
    "tt0388377",
    "tt0437803",
    "tt0958824",
    "tt1075746",
    "tt0377062",
    "tt1260932",
    "tt1001548",
    "tt0425637",
    "tt0983922",
    "tt1132130"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.890Z"
}