{
  "imdbId": "tt0411204",
  "title": "Cactuses",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Cactuses",
      "id": "Cactuses",
      "title": "Cactuses",
      "description": "A young man's life of confusion and broken relationships takes a turn when he meets an older woman who is abnormally understanding of his self-destructive behavior. While working for her at her cactus shop he becomes a role model for a young boy and feels \"obligated\" to clean up his act. It is his experience at the cactus shop and the woman's surprising stick-to-itiveness that helps him begin to mend some of the broken relationships in his life - including the father who has disowned him. But change takes time, and there are more mistakes to be made ... more info at http://cactusesmovie.com/",
      "fileSize": 1474446454,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/Cactuses",
      "collection": "feature_films",
      "downloads": 1913
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "93 min",
    "imdbRating": 7.3,
    "imdbVotes": 46,
    "Genre": "Drama",
    "Plot": "Simon Brodigan gives up on just about everything in his life, and just about everyone in his life has given up on him. He passes the time in his unfulfilling life by working an honest part-time job with a not-so-honest scam on the side. Simon cuts corners, runs from responsibility, and definitely doesn't want to be helped. Eventually, he is estranged from everyone in his life except for one person -- an eccentric old woman that he steals from. Mary Beth is surprisingly tolerant of Simon's self-destructive behavior, and her persistent interest in Simon's life eventually gets the best of him. While working for Mary Beth at her Cactus shop, Simon finds that his reluctance turns to willingness, even eagerness, to improve the quality of his life and the relationships that he has seemingly ruined. Flirting with the concept of ambition, Simon tries to mend some of the wreckage of his past by making up with the father who has disowned him. But things do not go as planned... With hopes dashed, Simon quickly retreats to his old ways, knowing that he is unable to change and not worth the effort of trying. He is tired of hurting the people that he loves. If only he can push everyone away once and for all, maybe then they will quit pushing him. The result is a mistake that has in store bigger consequences then Simon imagined, and even Mary Beth will have a hard time untangling his untimely mess.",
    "Director": "Matt Hannon, Rick Rapoza",
    "Writer": "Matt Hannon, Rick Rapoza",
    "Actors": "Cliff Chamberlain, Carmencristina Moreno, John White",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0478832",
    "tt0489070",
    "tt0910548",
    "tt0446298",
    "tt0808139",
    "tt0412798",
    "tt0872022",
    "tt0424938",
    "tt0498380",
    "tt0870944",
    "tt0882791",
    "tt0483726"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.041Z"
}