{
  "movieId": "tt0485521",
  "title": "Sushi in Suhl",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-hoau0iOPvs",
      "id": "-hoau0iOPvs",
      "title": "Sushi in Suhl (GERMAN DRAMA COMEDY in full length, tragicomedy in German, comedy films NEW)",
      "addedAt": "2025-12-23T23:54:19.640Z",
      "thumbnail": "https://i.ytimg.com/vi/-hoau0iOPvs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBQXVeweIrxSfOsc6ZUmbBbFGXi1w",
      "duration": 6251,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "100 min",
    "imdbRating": 6.3,
    "imdbVotes": 412,
    "Genre": "Comedy, Drama",
    "Plot": "One evening in the mid-sixties, Rolf Anschütz, a chef who runs a small restaurant in a town called Suhl in the middle of the East German province of Thuringen offers his guests a unique and exotic meal - Japanese Sukiyaki. It was intent to be a surprise for some of his best customers and it became a great success. Even the local paper wrote about it - and this should change the life of Rolf Anschütz forever. A couple of days after the \"event\" a real Japanese turned up at the restaurant and demanded the same meal again. From this moment there was no way back. The Japanese loved Rolf Anschütz cooking and his restaurant \"Der Waffenschmied\" (Gunsmith) soon was honored as the place which offered the best and most authentic Japanese cuisine outside Japan. In the shortest time the Japanese have accepted Rolf Anschütz as one theirs. They celebrate the Authenzität of his kitchen and the \"original\" Japanese washing rituals before the meals would be served. First diplomats, later Japanese economic bosses and sports delegations were sitting in the pool of the now famous restaurant \"Waffenschmied - Japanese department\" - naked and side by side with government officials and the brigades of the East German working class. And because the omnipresent communist party cannot close the popular place any more, the state security better known as Stasi took also their seat in the pool. The party soon discovered Rolfs restaurant as a foreign currency bringer and allowed the import of Japanese food and exotic ingredients from a delicatessen importer from West Germany. And while Rolfs Anschütz, in the meantime, wearing kimonos and East German geisha's on his side, philosophies about the peaceful coexistence of the people in the World his restaurant turns into the only really existing \"theme park\" in East Germany. Who wanted to go for a meal, must order two years in advance - at the end it will be 2 million guests!",
    "Director": "Carsten Fiebeler",
    "Writer": "Jens-Frederik Otto, Elke Weigelt",
    "Actors": "Uwe Steimle, Julia Richter, Ina Paule Klink",
    "Language": "German",
    "Country": "Germany",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt2838540",
    "tt1694020",
    "tt2460976",
    "tt1566938",
    "tt2008633",
    "tt1880212",
    "tt1674778",
    "tt2345503",
    "tt1385591",
    "tt1930546",
    "tt1582465",
    "tt3101386"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:28:40.961Z"
}