{
  "movieId": "tt0407304",
  "title": "War of the Worlds",
  "year": 2005,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fyiY68aHedw",
      "id": "fyiY68aHedw",
      "title": "War Of The Worlds | Full Movie | H.G. Wells",
      "description": "War Of The Worlds - In this modern retelling of H.G. Wells' sci-fi classic, civilization is laid to ruin when a race of super aliens invades Earth.  The story tells of a man named George Herbert who is separated from his wife and child when a Martian invasion begins. He tries to make his way to Washington, D.C. to reunite with them as the world is torn apart. But civilization is laid to ruin when a race of super aliens ultimately invades Earth!\n2005. Stars: C. Thomas Howell, Rhett Giles, Andrew Lauer\n**Under license from The Asylum.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:11:28.251Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/fyiY68aHedw/maxresdefault.webp",
      "duration": 5595,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "NZ",
          "PH",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "117 min",
    "imdbRating": 6.6,
    "imdbVotes": 500526,
    "Genre": "Action, Adventure, Sci-Fi",
    "Plot": "An ordinary man has to protect his children against alien invaders in this science fiction action film freely adapted from the classic story by H.G. Wells. Ray Ferrier (Tom Cruise) is a dockworker living in New Jersey, divorced from his first wife Mary Ann (Miranda Otto) and estranged from his two children Rachel and Robbie (Dakota Fanning and Justin Chatwin), of whom he has custody on weekends. On one such visitation, looking after the kids becomes a little more difficult when, after a series of strange lighting storms hit his neighborhood, Ray discovers that a fleet of death-ray robotic spaceships have emerged nearby, part of the first wave of an all-out alien invasion of the Earth. Transporting his children from New York to Boston in an attempt to find safety at Mary Ann's parents' house, Ray must learn to become the protector and provider he never was in marriage.",
    "Director": "Steven Spielberg",
    "Writer": "Josh Friedman, David Koepp, H.G. Wells",
    "Actors": "Tom Cruise, Dakota Fanning, Tim Robbins",
    "Language": "English",
    "Country": "United States",
    "Awards": "Nominated for 3 Oscars. 16 wins & 49 nominations total"
  },
  "relatedMovies": [
    "tt0457489",
    "tt0426556",
    "tt0481509",
    "tt0843873",
    "tt1094162",
    "tt0958824",
    "tt1075746",
    "tt1136683",
    "tt1183733",
    "tt1132130",
    "tt1345449",
    "tt1353997"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:23:45.593Z"
}