{
  "imdbId": "tt0489018",
  "title": "Day of the Dead",
  "year": 2008,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ArEnBmZgpxo",
      "id": "ArEnBmZgpxo",
      "title": "Day of the Dead (2008) - Full Zombie Movie",
      "description": "When a small Colorado town is overrun by the flesh hungry dead, a small group of survivors try to escape in a last ditch effort to stay alive. Starring Mena Suvari.\n\n#freemovies #fullmovies #zombies #nightofthelivingdead #zombiemovie",
      "addedAt": "2025-12-26T21:39:54.503Z",
      "thumbnail": "https://i.ytimg.com/vi/ArEnBmZgpxo/maxresdefault.jpg?v=615f6d31",
      "duration": 5095,
      "language": "en",
      "year": 2008,
      "channelName": "FilmRise Movies",
      "channelId": "UC8IHAQMuiJdY6ALuhG7iU8Q",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "86 min",
    "imdbRating": 4.5,
    "imdbVotes": 20394,
    "Genre": "Action, Horror, Sci-Fi, Thriller",
    "Plot": "In Leadville, Colorado, Captain Rhodes and his army seals off the town to contain an influenza-type epidemic. The locals are not allowed to leave the town and the Pine Valley Medical Center is crowded with sick people. Corporal Sarah Bowman was born and raised in Leadville and goes to her home with Private Bud Crain to visit her mother. Sarah finds that her mother is ill and takes her to the local hospital. However, the sick people suddenly transform in flesh eating, fast moving zombies which attack the non-infected humans. Sarah, Bud and Private Salazar get a jeep and head to the town exit to escape from the dead. But Sarah hears the voice of her brother, Trevor, on the radio and is compelled to go to the radio station where Trevor is hidden with his girlfriend Nina. The group of survivors drives to the isolated Nike missile site seeking shelter, where they discover an underground army base.",
    "Director": "Steve Miner",
    "Writer": "Jeffrey Reddick (screenplay), George A. Romero (motion picture \"Day of the Dead\")",
    "Actors": "Mena Suvari, Nick Cannon, Michael Welch, AnnaLynne McCord",
    "Language": "English",
    "Country": "USA",
    "Awards": "1 nomination."
  },
  "relatedMovies": [
    "tt1183733",
    "tt1132130",
    "tt1094162",
    "tt6724510",
    "tt1075746",
    "tt0843873",
    "tt1705773",
    "tt2175184",
    "tt0426556",
    "tt0228040",
    "tt2130142",
    "tt0221905"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:23:17.068Z"
}