{
  "movieId": "tt0407876",
  "title": "The Red Detachment of Women",
  "year": 1970,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/The_Red_Detachment_of_Women",
      "id": "The_Red_Detachment_of_Women",
      "title": "The Red Detachment of Women",
      "description": "One of the most powerful and moving ballets from the Great Proletarian Cultural Revolution. It depicts a woman's journey into the People's Liberation Army. Instead of weak, fragile women dressed in fluttery tutus, women were depicted in military uniforms with rifles. Instead of frail motions, women had strong arms and clenched fists. This play shook the entire foundation of bourgeois art.",
      "fileSize": 2632266001,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/The_Red_Detachment_of_Women",
      "year": 1970,
      "collection": "feature_films",
      "downloads": 121857
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "105 min",
    "imdbRating": 7.9,
    "imdbVotes": 115,
    "Genre": "Music",
    "Plot": "Nixon, while in China, was treated to an abbreviated performance of this ballet, and he became a fan! And why not? It's a great show. And a great score, full of emotion, catchy tunes, and real Hollywood Golden Age-style heart, enough to win over a Republican president! Because, that's what really matters in art and show biz: appealing to the audience. The Chinese Cultural Revolution was a nightmare, but in the midst of the chaos were sincere and hardworking artists who did what they could to produce the best quality productions they could, even though they were propaganda. The other outstanding film in the same vein from China at this time was 'Dongfang hong' (aka 'The East is Red'). It is to these (largely anonymous) artists' credit, and an honor to their memory, that the art in what they did survives, and can be rediscovered.",
    "Director": "Jie Fu, Wenzhan Pan",
    "Writer": "Xin Liang",
    "Actors": "Qingtang Liu, Jinghua Xue, Song Chen",
    "Language": "Mandarin",
    "Country": "China",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0065466",
    "tt0174685",
    "tt0062430",
    "tt0388966",
    "tt5203478",
    "tt0329368",
    "tt0016220",
    "tt0054817",
    "tt0048700",
    "tt0027361",
    "tt0076666",
    "tt0077711"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.885Z"
}