{
  "movieId": "tt0449438",
  "title": "A New Way of Traveling",
  "year": 1908,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-a-new-way-of-traveling",
      "id": "silent-a-new-way-of-traveling",
      "title": "A New Way of Traveling",
      "fileSize": 92747432,
      "addedAt": "2026-01-07T00:10:50.367Z",
      "thumbnail": "https://archive.org/services/img/silent-a-new-way-of-traveling",
      "language": "French",
      "year": 1908,
      "collection": "feature_films",
      "downloads": 506
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "5 min",
    "imdbRating": 5.4,
    "imdbVotes": 26,
    "Genre": "Short, Comedy",
    "Plot": "Two grotesquely costumed Orientals seem to be coaxing a clumsy looking Chinese damsel to take a trip with them. The equipage proposed is a queer barrel and when she finally raises her unshapely self from the floor she crawls into it, while the two men mount the cask a-straddle. It promptly moves upward, and the next view shows them in mid-air. They sail around among the planets, which assume all manner of weird forms, the men managing to retain secure positions until suddenly a storm hits them and the curious craft goes hurtling through space; down it goes, through lightning, until it splashes into the sea and strikes the bottom. The damsel crawls out and all three become witnesses of marvelous subaqueous occurrences. A huge starfish is seen, with human heads on each point, and subterranean fungi and other growths keep moving before them in a bewildering maze. Again and again they view wonderful evolutions in which figure all manner of imps and water nymphs. This performance over, the trio once more take possession of their barrel and an upward tide carries their submarine airship to the surface. Here the men find that the girl had swallowed several gallons of water. They immediately adjust a pump to her mouth and her inflated diaphragm begins to give way to rhythmic spurts of water. The trio then embarks on the barrel once more and fly home.",
    "Director": "Segundo de Chomón",
    "Writer": "Segundo de Chomón",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0432623",
    "tt2079489",
    "tt0249655",
    "tt0855966",
    "tt0449172",
    "tt0449181",
    "tt0449308",
    "tt0449252",
    "tt0257889",
    "tt0454107",
    "tt0326373",
    "tt0450089"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.367Z"
}