{
  "movieId": "tt0427674",
  "title": "The Garibaldi Boy",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-garibaldi-boy",
      "id": "silent-the-garibaldi-boy",
      "title": "The Garibaldi Boy",
      "fileSize": 245103533,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-garibaldi-boy",
      "language": "Italian",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 391
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "12 min",
    "imdbRating": 5.8,
    "imdbVotes": 54,
    "Genre": "Drama, Short",
    "Plot": "The Italians were very much ahead of the game at this point in time. Their major specialty was (and continued for some while to be) the patriotic film and the kolossal (the epic) and also adaptations of Shakespeare. La Presa di Roma (patriotic) had appeared in 1905 and and early version of The Last Days of Pompeii (kolossal) had already appeared in 1908 and pointed the way towards the Pastrone's wonderful Cabiria of 1914, a film that would do so much to establish what critics prissily (and inaccurately) like to call \"the grammar\" of cinema (there is no one single grammar of cinema). Comics like André Deedes (French but performing at this time in Italy as \"Cretinetti\") and even more so Spanish-born Marcel Peréz/Marcel Fabre (who performed in Italy as \"Robinet\") were both introducing elements of the absurd and the surreal into their comedy which make the later repertoire of Mack Sennett and co look distinctly simple-minded.In 1909 there was also Otello, Julius Caesar, Nero or the Fall of Rome (all shorts and readily available) as well as this slightly gruesome patriotic film. If it was ever stencil-coloured, only the other reviewer here seems to know about it; all copies I have seen are merely tinted, which is a quite different thing.The theme of a (much smaller) boy's dreams of battle was taken up in one of the finest films of 1917, Pastrone and Chomon's The War and the Dream of Momi, also rather gruesome in its implications but rather wonderful too.In 1910 there would be Hamlet, The Merchant of Venice, King Lear, Anita Garibaldi, The Rape of the Sabine Women, Didone abandonnata as well as the fine lyric short L'Ave Maria di Gounod. In 1911 came The Fall of Troy, Agrippina, San Sebastiano, La Sposa del Nilo, the excellent parody The Extraordinary Adventures of Saturnino Farandola, the first film version of Pinocchio and (the real breakthrough) the first two full-length epics The Odyssey and Dante's Inferno.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Maria Caserini, Mario Caserini, Gemma De Ferrari",
    "Language": "None, Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1059291",
    "tt1840952",
    "tt0344506",
    "tt1207008",
    "tt1113818",
    "tt0234435",
    "tt0417062",
    "tt0002356",
    "tt0470339",
    "tt0463594",
    "tt0330942",
    "tt0367144"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}