{
  "imdbId": "tt0431859",
  "title": "Kigeki: Ase",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kigeki-ase_1929",
      "id": "kigeki-ase_1929",
      "title": "Kigeki: Ase",
      "fileSize": 7580980688,
      "addedAt": "2026-01-07T00:09:24.699Z",
      "thumbnail": "https://archive.org/services/img/kigeki-ase_1929",
      "language": "Japanese",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 624
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 6.2,
    "imdbVotes": 10,
    "Genre": "Drama",
    "Plot": "When \"The Marriage Circe\" (1924) by Ernst Lubitsch hit the shores of Japan, a generation of film-makers were influenced by the wittiness of the German auteur. Just like with Harold Lloyd, there are Lubitsch-esque touches in the early films of many Japanese directors: Ozu, Naruse, Gosho, and apparently Uchida Tomu as well.\"Kigeki: Ase\" (Perspiration, 1929) is a comedy that offers a highly westernized criticism of modern life and class society. The protagonist is a rich man, surrounded by an army of adjutants and servants, who don't particularly care for his lavish life style. One day, the hero of the film gets tired of his entourage, and runs away from them in a very comical sequence. The rich guy ends up meeting a girl and working in a construction site, where the work is very physical, hence the perspiration.The concept of the film resembles later films by Frank Capra or Preston Sturges more than it probably does Lubitsch, though his influence is visible. The film is only about 50 minutes, it's cheerful and lively, and really different from Uchida's later films, or the films other directors made in Japan at the time.",
    "Director": "Tomu Uchida",
    "Writer": "Masashi Kobayashi",
    "Actors": "Kôji Shima, Yasushi Yoshii, Hisako Takihana",
    "Language": "None, Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0020030",
    "tt0019644",
    "tt0019765",
    "tt0019933",
    "tt0019957",
    "tt0019979",
    "tt0019983",
    "tt0020514",
    "tt0020305",
    "tt0019798",
    "tt0020092",
    "tt0020103"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.699Z"
}