{
  "imdbId": "tt0477380",
  "title": "Tale the Autumn Leaves Told",
  "year": 1908,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-tale-the-autumn-leaves-told",
      "id": "silent-tale-the-autumn-leaves-told",
      "title": "Tale the Autumn Leaves Told",
      "fileSize": 29873259,
      "addedAt": "2026-01-07T00:11:15.974Z",
      "thumbnail": "https://archive.org/services/img/silent-tale-the-autumn-leaves-told",
      "year": 1908,
      "collection": "feature_films",
      "downloads": 256
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "2 min",
    "imdbRating": 4.6,
    "imdbVotes": 105,
    "Genre": "Short, Drama",
    "Plot": "A story of ye olden tyme in merrie England. Gathering Autumn Leaves: Mistress Dorothy, of Elmhurst Manor, meets perchance young Squire Douglass. He picks some desired leaves beyond her reach. Love's young dream. Sir Varney, of London Town: Her father, Lord Ravenhood, has pledged her band to Sir Varney. He is rather distasteful to the lady. The Trysting Place: The young lovers secretly meet. Plan their future. Her father and Sir Varney discover them. A quarrel ensues. Mistress Dorothy sent away in tears. Varney challenges the Squire to a duel. The Warning: Giles, the Squire's man, warns the lady of the proposed combat. The Duel at Early Dawn: The ground is paced off. All is ready. The opponents fire. Mistress Dorothy arrives to save her lover's life. She is wounded instead. In the Garden: The lady recovering from the accident. Entertaining some friends. Giles, disguised as a bird peddler, brings a message from his master. Lord Ravenhood discovers the subterfuge. Imprisons Mistress Dorothy in the tower. Love's Messenger: Giles brings the news to his master, Squire Douglass. He pens a note to his lady love. Ties the missive to a dove. The message delivered. Mistress Dorothy returns an autumn leaf as a love token. The Tower: The lovers plan to escape. The lady unravels her gown. Lowers the thread to her waiting lover. A rope pulled up. She escapes. The Gretna Green Marriage: The lovers escape on horses. Discovered by Lord Ravenhood. The runaways cross the boundary into Scotland. Stop at the shop of a blacksmith. Wedded and forgiven by Lord Ravenhood.",
    "Director": "Edwin S. Porter",
    "Writer": "N/A",
    "Actors": "Mr. Barry, Phineas Nairs, Laura Sawyer",
    "Language": "None",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0000519",
    "tt0000904",
    "tt0000557",
    "tt0228839",
    "tt0234913",
    "tt0445359",
    "tt0000471",
    "tt0212884",
    "tt0233471",
    "tt0234609",
    "tt0287461",
    "tt0248890"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.974Z"
}