{
  "movieId": "tt0468845",
  "title": "Rhythms",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/rhythms_1929",
      "id": "rhythms_1929",
      "title": "Rhythms",
      "fileSize": 553009127,
      "addedAt": "2026-01-07T00:10:30.754Z",
      "thumbnail": "https://archive.org/services/img/rhythms_1929",
      "language": "English",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 205
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 5.1,
    "imdbVotes": 20,
    "Genre": "Short, Music",
    "Plot": "Rhythms (1929) ** 1/2 (out of 4) Early talkie-musical from Vitaphone and Warner has Leo Ruisman and his orchestra doing a few numbers including Some of These Days, Lonely, the standard Milenberg Joys and the highlight If I Had You sung by Smith Ballew. There were hundreds of these Vitaphone films shot in New York City as talkies made it possible for musical acts to be \"seen\" instead of just heard on the radio. Warner was certainly the king at introducing these faces but many of them are now long forgotten and that's where Ruisman comes into play. I think most people might remember him from a couple of his tunes showing up in PAPER MOON but this here was his only appearance in front of the camera. For the most part this is a nice little short since the music is nice and that's certainly the most important thing. For some reason the film features scenes from silent movies, which I'm guessing were meant to show a \"peaceful\" image while the music is playing. The effect really doesn't work too well but I guess we can give them credit for at least trying something different.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Leo Reisman, Leo Reisman and His Orchestra, Smith Ballew",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0229761",
    "tt1706329",
    "tt0430019",
    "tt0192101",
    "tt1053360",
    "tt2527618",
    "tt1706486",
    "tt1893340",
    "tt0177778",
    "tt1876490",
    "tt1827582",
    "tt1144513"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:30.754Z"
}