{
  "imdbId": "tt0438017",
  "title": "The Matrimonial Express",
  "year": 1912,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-matrimonial-express",
      "id": "silent-the-matrimonial-express",
      "title": "The Matrimonial Express",
      "fileSize": 244085788,
      "addedAt": "2026-01-07T00:11:15.977Z",
      "thumbnail": "https://archive.org/services/img/silent-the-matrimonial-express",
      "language": "French",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 398
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "13 min",
    "imdbRating": 5.8,
    "imdbVotes": 54,
    "Genre": "Short, Comedy",
    "Plot": "A decidedly handsome lady of the blond persuasion with a feminine companion whose looks are hardly so inviting, find themselves in the same railroad car with Andrew Forbes. Mr. Forbes, thereupon enters a desperate flirtation with the blond lady, which is equally desperately received, the desperation being mostly caused by the Argus-eyed companion who seems to take diabolical pleasure in thwarting their attempts at intimacy. There is a very ingenious courtship carried on through transoms and in the dining car, and especially noteworthy are the feet to promote acquaintance. They reach a tunnel and Mr. Forbes with an audacity quite commensurate with the worthiness of the cause, attempts to kiss the blond lady. Tunnels have an unpleasant way of being dark, however, and he plants his affectionate kiss on the unsympathetic lips of the companion, who is angry enough to bite him. The two ladies and Forbes get off at the same station, but they are whisked out of sight in an automobile before he can trace them, then goes on to his destination, his uncle's suburban home. His uncle is importunate that Forbes become married and says that he has the lady all picked out for him and that today she will come for inspection. Forbes, making a very wry face at the idea of being \"sicked\" on to an unknown woman in this manner, as his thoughts are still occupied with the fair charmer of the express, it soon turns out to be the matrimonial express, however, and the very lady selected by his uncle for the lucrative position of his wife is the same as she with whom he had so desperately flirted on the train.",
    "Director": "Léonce Perret",
    "Writer": "N/A",
    "Actors": "Valentine Petit, Léonce Perret, Marie Dorly",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0310891",
    "tt0003059",
    "tt1003515",
    "tt0437080",
    "tt0437960",
    "tt0438472",
    "tt0442013",
    "tt0002133",
    "tt0002501",
    "tt0215495",
    "tt0002280",
    "tt0210599"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.977Z"
}