{
  "imdbId": "tt0446724",
  "title": "Kim Possible: So the Drama",
  "year": 2005,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XLxB713o3Tc",
      "id": "XLxB713o3Tc",
      "title": "Anything is Possible | Full Family Drama Movie | Lacey Chabert | Ethan Bortnick",
      "description": "Anything is Possible - Ethan Bortnick plays the leading role as Nathan, a young boy who's separated from his mother when she goes missing during a trip to Japan to help after the tsunami. The movie explores issues like homelessness, military family life and adoption. Ethan co-wrote the music with Grammy award winning songwriter and producer, Gary Baker and will also score the entire film. Ethan will become the youngest actor to co-write the soundtrack and play the leading role in a feature film. When Army lieutenant, MARGARET PETERS (Lacy Chabert) goes missing during a tsunami rescue mission in Japan, back in Detroit, her son, NATHAN (Ethan Bortnick), discovers that his father GEORGE (Jonathan Bennett) isn't his biological father. Learning that Child Care Services could take him away, Nathan runs away before his father can explain. While George goes on a frantic search, Nathan takes to the streets of Detroit where he meets CAPTAIN MILES, a homeless Iraqi war veteran.\n2013. Stars: Ethan Bortnick, Jonathan Bennett, Lacey Chabert\n**Under license from Vision Films Inc.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:47:44.690Z",
      "thumbnail": "https://i.ytimg.com/vi/XLxB713o3Tc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBg-fYjve58U5CZrmdb9DXli0-qnQ",
      "duration": 5602,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "AU",
          "BE",
          "LU",
          "NL",
          "NO",
          "NZ",
          "SE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "71 min",
    "imdbRating": 7.1,
    "imdbVotes": 5317,
    "Genre": "Animation, Action, Adventure",
    "Plot": "Dr. Drakken has an evil new plot for world domination, but his ultimate success depends upon finding out KP's weakness which may involve a new hottie at Middleton High School named Eric, who suddenly sparks feelings in Ron about Kim that resemble much more than friendship. To make matters worse, Bueno Nacho, Ron's favorite fast food chain has turned sour on him by bombarding him with little Devil diablo toys. Does this mean KP may finally have to surrender to Drakken once and for all?",
    "Director": "Steve Loter",
    "Writer": "Bob Schooley, Mark McCorkle",
    "Actors": "Christy Carlson Romano, Will Friedle, Nancy Cartwright",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt6724888",
    "tt1782440",
    "tt13740078",
    "tt2006753",
    "tt7850334",
    "tt0417943",
    "tt0467923",
    "tt0388377",
    "tt0457489",
    "tt0426556",
    "tt0455583",
    "tt0437803"
  ],
  "collections": [
    {
      "id": "adventure",
      "name": "Adventure"
    },
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:59:45.458Z"
}