{
  "movieId": "tt0775438",
  "title": "Buy the Ticket, Take the Ride: Hunter S. Thompson on Film",
  "year": 2006,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BOd6H8R9DH4",
      "id": "BOd6H8R9DH4",
      "title": "Hunter S. Thompson: The Final 24 (Full Documentary) The Story of His Final 24 Hours",
      "description": "\"Hunter S Thompson was an author trapped in the body of a rock star.  His drug-fuelled adventures were legendary and became the basis of one of the classics of 20th century literature. Thompson’s constant questioning of authority and wild antics made him a hero for a generation of rebels across the globe.  But in the end it wasn’t enough.\n\nA lifetime of alcohol and drug abuse was taking their toll.  At 67, with a broken leg, two hip operations and in chronic pain Thompson could no longer live up to the legend he’d created.  On February 20, 2005, he decided to end it all with one of his favorite possessions, a Smith and Wesson 45.  Final 24 charts the life of this troubled genius and uncovers why a bullet to the head was the only way out.\"\n\nSE1 EP04\n\nDirected by Mike Parkinson\n2006\nDave McRae\n\nMORE Popcornflix MOVIES, FREE on YouTube!\r\n\r\n Action: https://bit.ly/2XC8pvv\r\n Romance: https://bit.ly/2NVnIQ2\r\n Horror: https://bit.ly/2LeNNaK\r\n Crime: https://bit.ly/2NK201z\r\n Drama: https://bit.ly/2G6Uasy\r\n Comedy:  https://bit.ly/2LPCNQD\r\n Western: https://bit.ly/2S7FRc4\r\n Popcornflix Channel page: https://bit.ly/2Saak9p\r\n\r\nWatch more free movies and TV series at Popcornflix.com, or on the Popcornflix app available on Roku, Amazon FireTV, iOS, Android, Chromecast, and AppleTV.\r\n\r\n#Popcornflix, Full length free movies and TV series.\r\nLike us on Facebook: https://www.facebook.com/Popcornflix\r\nFollow us on Twitter: https://twitter.com/Popcornflixnews\r\nPopcornflix is owned/operated by Screen Media Ventures",
      "addedAt": "2025-12-23T23:37:52.594Z",
      "thumbnail": "https://i.ytimg.com/vi/BOd6H8R9DH4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBkwaa4DYQrql2MBBZyot8LGk46gQ",
      "duration": 3123,
      "language": "en",
      "channelName": "Popcornflix",
      "channelId": "UCVFYikepF-avelvuIaQ_lHA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "73 min",
    "imdbRating": 7.1,
    "imdbVotes": 1168,
    "Genre": "Documentary, Biography",
    "Plot": "\"Buy The Ticket, Take The Ride: Hunter S. Thompson On Film is a personal, intimate look at Thompson with a special emphasis on his Hollywood relationships. It captures the legacy and \"gonzo\" spirit of one of this century's most notorious figures - a man whose life and work regularly intersected with some of the biggest names in the world of film, politics, journalism and sports. The documentary features interviews with Hunter's inner circle of family and friends, but the thrust of the film is focused on the manner in which his life often overlapped with numerous Hollywood celebrities who became his close friends, such as Johnny Depp and Benicio Del Toro (Fear and Loathing in Las Vegas); Bill Murray (Where the Buffalo Roam); Sean Penn, John Cusack, Hunter's wife Anita, son Juan, former Senators George McGovern and Gary Hart, Tom Wolfe, William F. Buckley, Gary Busey, Harry Dean Stanton, Ralph Steadman and others.",
    "Director": "Tom Thurman",
    "Writer": "Tom Marksbury",
    "Actors": "Ed Bradley, Bob Braudis, Douglas Brinkley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1185616",
    "tt1475191",
    "tt1352822",
    "tt0376855",
    "tt0848358",
    "tt0310597",
    "tt0247304",
    "tt3123418",
    "tt7188868",
    "tt1422757",
    "tt9316022",
    "tt0066759"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:20:39.668Z"
}