{
  "movieId": "tt0872022",
  "title": "Heavenly Forest",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/heavenly-forest-2006-1080p-webrip",
      "id": "heavenly-forest-2006-1080p-webrip",
      "title": "Heavenly Forest (2006)",
      "description": "\"Heavenly Forest\" is about a photographer named Makoto, who travels to New York during Christmas to look for his best friend, Shizuru. The two first met when Makoto attended his university entrance ceremony. Makoto tends to shy away from other people but Shizuru managed to make him open up to her. Because of their friendship, Shizuru also ended up taking an interest in photography and the two often went to a forest to take pictures. Shizuru wants nothing else but to be by Makoto's side so when he started liking another girl called Miyuki, Shizuru decided that she too will like Miyuki and becomes her friend. One day, Makoto asked Shizuru what present she'd like to receive for her birthday. Shizuru, who wanted to enter a photography competition, had an idea to take a picture of the two of them kissing in a forest. Makoto agreed to do this and the two kissed for the very first time. Ever since that day, however, Shizuru disappears from Makoto's life. (Source: AsianWiki)",
      "fileSize": 2097536778,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/heavenly-forest-2006-1080p-webrip",
      "language": "jpn",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 522
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "116 min",
    "imdbRating": 7.4,
    "imdbVotes": 3653,
    "Genre": "Drama, Romance",
    "Plot": "Heavenly Forest is About a Photographer name Makoto who travels to New York during Christmas to look for his best friend, Shizuru. The two first met when Makoto attended his University Entrance Ceremony. Due to his Inferiority Complex, Makoto tends to shy away other people but Shizuru managed to Make him open up to her. Because of their friendship, Shizuru also ended up taking interest in photography and the two often went to the forest to take pictures. Shizuru wants nothing else but to be by Makoto's side so when he started liking another girl called Miyuki , Shizuru decided that she too will like Miyuki and becomes her friend . One day , Makoto asked Shizuru what present she'd like to receive for her Birthday. Shizuru , who want to enter a photography competition, had an idea to take a picture of the two of them kissing in a forest. Makoto agreed to do this and the two kissed for the very first time. Ever since that day, however, Shizuru ups and disappears from Makoto's life.",
    "Director": "Takehiko Shinjô",
    "Writer": "Takuji Ichikawa, Kenji Bando",
    "Actors": "Aoi Miyazaki, Hiroshi Tamaki, Munetaka Aoki",
    "Language": "Japanese, English",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0870944",
    "tt0882791",
    "tt0483726",
    "tt0814197",
    "tt0414993",
    "tt0425326",
    "tt0410297",
    "tt0452594",
    "tt0856775",
    "tt0449061",
    "tt1265599",
    "tt0795493"
  ],
  "collections": [
    {
      "id": "romance",
      "name": "Romance"
    },
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}