{
  "movieId": "tt0855966",
  "title": "Pickpock ne craint pas les entraves",
  "year": 1909,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-pickpock-ne-craint-pas-les-entraves",
      "id": "silent-pickpock-ne-craint-pas-les-entraves",
      "title": "Pickpock ne craint pas les entraves",
      "fileSize": 164571100,
      "addedAt": "2026-01-07T00:11:15.971Z",
      "thumbnail": "https://archive.org/services/img/silent-pickpock-ne-craint-pas-les-entraves",
      "language": "French",
      "year": 1909,
      "collection": "feature_films",
      "downloads": 289
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "8 min",
    "imdbRating": 6.7,
    "imdbVotes": 214,
    "Genre": "Short, Comedy",
    "Plot": "Slippery Jim, a captured pickpocket, is brought into the police station. From the valuable jewelry in his pocket, he is evidenced to be guilty of numerous crimes; thus, the policemen escort him to a jail cell where he is chained up around the ankles. Once they have left, the pickpocket's feet become dismembered and the chains drop off, freeing him. The police, spotting him, try shutting him in a box, but yet again he is able to escape. Fed up with these pranks, they attempt drowning the trickster in the river by tying him up and covering him with a sack, but this proves yet again no use. The pickpocket frees himself of his bondage and jumps out of the river. However, the police catch soon catch on to his trail, and so this time he is pursued on a bicycle which he assembles magically. Using this, he is able yet again to evade them by riding the bike through mid air. Then, taking refuge in an apartment building, he is found once more but mystifies the cops further by disappearing into thin air. Having distracted them by this, he cleverly flattens them between the wall and the door, rolls them up like a scroll, and hurls them out the window. A rag-picker, finding the unfortunate policemen, shakes them out and brings them back into shape. Slippery Jim, seeing this, jumps through the window and lands on the ground safely, but is seized by the cops. They jam him into the rag-picker's basket, and sitting on it so he cannot get out. The prankster takes care of this by seeping through a hole in the basket like a snake, and slithering into the police station, and turning back into a person, he is caught. The police are triumphant, but little do they realize the clever trick the pickpocket has in store for them next.",
    "Director": "Segundo de Chomón",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0432623",
    "tt0449438",
    "tt2079489",
    "tt0249655",
    "tt0449172",
    "tt0449181",
    "tt0449308",
    "tt0454107",
    "tt0326373",
    "tt0450089",
    "tt0449252",
    "tt0257889"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.971Z"
}