{
  "movieId": "tt0814197",
  "title": "Love & Dance",
  "year": 2006,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q5B56ZIvNWk",
      "id": "q5B56ZIvNWk",
      "title": "Love & Dance (GANZER LIEBESFILM auf Deutsch kostenlos, Liebesfilme in voller Länge, Musikfilme)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Zwischen den Konflikten seiner Eltern sucht Hen Halt im Tanzunterricht. Eigentlich will er Natalie beeindrucken – doch an Sharons Seite lernt er, Verantwortung zu übernehmen und seinen eigenen Weg zu gehen.\n\nLOVE & DANCE (2006)\nOriginaltitel: Sipur Hatzi-Russi\nMit: Evgenia Dodina, Avi Kushnir, Oksana Korostyshevskaya\nRegie: Eitan Anner\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nDer dreizehnjährige Chen ist Sohn eines israelischen Vaters und einer russischen Mutter. Seine Eltern streiten sich häufig und um seine Mutter zu trösten, begleitet er sie zu einem Tanzabend der russischen Gemeinde. Dort verliebt er sich in die gleichaltrige Natalie. Ihretwegen tauscht er den Judokurs gegen Walzer und Tango ein.\n#Netzkino #ganzerFilm #Liebesfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:42:56.440Z",
      "thumbnail": "https://i.ytimg.com/vi/q5B56ZIvNWk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB-ZSOFoHKFLiVMesqKJb45mP9s4g",
      "duration": 5812,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 6.9,
    "imdbVotes": 299,
    "Genre": "Drama, Music, Romance",
    "Plot": "Chen, a young kid, is battling a cultural conflict between his Russian born mother and Israeli father. She is cultured and used to the finer things in life, including theater and fine dining. He is gruff on the outside but sweet on the inside - a Sabra; and looking to make his young son a man rather than the wimp his mother is raising. One day, Chen stumbles upon a ballroom dance class for young people and sees Natalie, a stunning Russian young girl he falls in love with immediately. His interest in Natalie leads him to taking ballroom dancing and to ultimately bridging the cultural divide of his own family - through the Cha Cha and the Tango. The teachers are a pair of former Russian world champions who never quite fulfilled their potential, but find themselves battling their demons through the instructions of the kids.",
    "Director": "Eitan Anner",
    "Writer": "Eitan Anner",
    "Actors": "Evgenia Dodina, Avi Kushnir, Oksana Korostyshevskaya",
    "Language": "Hebrew",
    "Country": "Israel",
    "Awards": "3 nominations"
  },
  "relatedMovies": [
    "tt0882791",
    "tt0020866",
    "tt0026367",
    "tt0028216",
    "tt0023128",
    "tt0055278",
    "tt0032411",
    "tt0872022",
    "tt0027796",
    "tt10206614",
    "tt0329368",
    "tt0870944"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:21:58.727Z"
}