{
  "imdbId": "tt0856775",
  "title": "Cafuné",
  "year": 2005,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Cafune",
      "id": "Cafune",
      "title": "Cafuné",
      "description": "Brazilian feature film, released on theaters and on the Internet on the same day, with a CC licence, in 2006. Tells the story a mixed couple - a middle class girl meets a favela boy.",
      "fileSize": 2130183038,
      "addedAt": "2026-01-07T00:06:14.041Z",
      "thumbnail": "https://archive.org/services/img/Cafune",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 84978
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "92 min",
    "imdbRating": 6.2,
    "imdbVotes": 60,
    "Genre": "Drama, Romance",
    "Plot": "CAFUNÉ is about people who are starting their adult lives in the both violent and charming environment of the city of Rio de Janeiro. This scenery is viewed through the eyes of a young couple: a high-class girl, Débora, and a boy from a favela, Marquinhos. Slowly, they'll discover each others' worlds. What was believed to be prejudice against lower class actually turns into a fascination that is both sexual and affective - the meaning of Cafuné is fondling. This fascination evolves to the environment around the girl, to the point that we suspect that her mother is attracted to the kid. The girl's friends start leaving the city due to lack of perspective. Those who remain find themselves entangled in a web of boredom and vanity, like Marta, who obsessively takes pictures of herself and publishes them on the Internet. Débora, the lead character, finds out to be pregnant of Marquinhos. Her mother pushes her into abortion, but she resists, claiming that she intents to raise the baby in the favela. They have the baby, but he is born with a medical condition. They can't take him to Marquinhos' house; she gets depressed and he enjoys being installed in her big flat. After an accident with Marquinho's brother and Débora's mother, the girl decides to definitely move to the slum. Marquinhos leaves to work as a car keeper and never returns. She tries to find him and is trapped in her memories of the relationship.",
    "Director": "Bruno Vianna",
    "Writer": "Bruno Vianna",
    "Actors": "Priscila Assum, Lúcio Andrey, Dilma Lóes",
    "Language": "Portuguese",
    "Country": "Brazil",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0449061",
    "tt0382810",
    "tt0872022",
    "tt0870944",
    "tt0882791",
    "tt0483726",
    "tt0814197",
    "tt0414993",
    "tt0425326",
    "tt0315206",
    "tt0410297",
    "tt0452594"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.041Z"
}