{
  "movieId": "tt0878674",
  "title": "Garage",
  "year": 2007,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VahEhy4HJu4",
      "id": "VahEhy4HJu4",
      "title": "Garage",
      "description": "A satirical comedy about employees of a certain research institute who come to a meeting of a garage cooperative in the hope that it will take quite a bit of time. However, it turns out that the number of garage boxes has been reduced, and now people will have to choose those who will be left without a future garage of their own. The active resistance of the disadvantaged is understandable, but will there be those who will rise up against injustice? The meeting is obviously dragging on...\n\nIMDb rating: 8,1\n\nYear of production: 1979\n\nDirector: Ryazanov Eldar\nScreenwriter: Eldar Ryazanov, Emil Braginsky\nComposer: Andrey Petrov\nOperator: Vladimir Nakhabtsev\nProduction designer: Borisov Alexander\n\nCast: Georgy Burkov, Leonid Markov, Valentin Gaft, Liya Akhedzhakova, Iya Savvina, Svetlana Nemolyaeva, Vyacheslav Innocent, Andrey Myagkov, Petr Shcherbakov, Maria Vinogradova, Alexander Pyatkov, Igor Kostolevsky, Anatoly Vedenkin, Alla Budnitskaya, Borislav Brondukov, Gleb Strizhenov , Kokshenov Mikhail, Voznesenskaya Anastasia, Farada Semyon, Ostroumova Olga, Lebedev Alexander, Voinarovsky Vyacheslav, Gurzo Natalia, Zakharchenko Vadim, Tsvetkova Lyudmila, Isaeva Zoya, Sanko Natalia, Ryazanov Eldar, Rogozina Tatiana, Orlovsky Dmitry, Myshkin Vladimir",
      "addedAt": "2025-12-23T03:45:02.998Z",
      "thumbnail": "https://i.ytimg.com/vi/VahEhy4HJu4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDUczH7f79R9-Ts9QHt-J62Xvc3yQ",
      "duration": 5991,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 7.1,
    "imdbVotes": 3178,
    "Genre": "Drama",
    "Plot": "Tragi-comedy from the margins of contemporary Irish life. Regarded by his neighbors as a harmless misfit, eliciting idle kindness, benign tolerance and occasional abuse, Josie has spent all his adult life as the caretaker of a crumbling petrol station on the outskirts of a small town in the mid-west of Ireland. He is limited, lonely, yet relentlessly optimistic and, in his own peculiar way, happy. But then over the course of a summer, Josie's world shifts. A teenager, David, comes to work with him. David likes him. They open up to each other and suddenly the lonely adult is drinking cans down at the railway tracks with the local kids. He is awakened to needs in himself that have never been met. And Carmel, from the local shop, who has always been kind to him, stirs feelings within him that he struggles to name. And then one thoughtless moment unravels the threads of faltering friendship. Events spiral. Josie's life is changed, forever.",
    "Director": "Lenny Abrahamson",
    "Writer": "Mark O'Halloran",
    "Actors": "Pat Shortt, John Keogh, George Costigan",
    "Language": "English",
    "Country": "Ireland",
    "Awards": "12 wins & 13 nominations total"
  },
  "relatedMovies": [
    "tt1605717",
    "tt1094627",
    "tt1291131",
    "tt1298590",
    "tt28082434",
    "tt0995033",
    "tt1039780",
    "tt1265599",
    "tt0879825",
    "tt0388182",
    "tt1034405",
    "tt0795493"
  ],
  "collections": [
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-23T04:01:48.190Z"
}