{
  "imdbId": "tt0842765",
  "title": "Character Studies",
  "year": 1928,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/character-studies_1928",
      "id": "character-studies_1928",
      "title": "Character Studies",
      "fileSize": 748776307,
      "addedAt": "2026-01-07T00:07:45.168Z",
      "thumbnail": "https://archive.org/services/img/character-studies_1928",
      "language": "English",
      "year": 1928,
      "collection": "feature_films",
      "downloads": 221
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 5.2,
    "imdbVotes": 16,
    "Genre": "Short",
    "Plot": "Character Studies (1928) ** (out of 4)Montagu Love pretty much plays himself in this Vitaphone short where he starts off by introducing himself to the viewer and saying most probably remember him for playing villains. He then asks that people pretend that he's surrounded by a dinner party and he's been asked to give a speech even though he's shy. From here we see the actor get into character and playing this man worried about talking in front of people. Love then breaks this character and informs people that he played Fagin from Oliver Twist on stage and he's going to do so here. The scene then breaks to a jail cell where Love is made up and does a scene. CHARACTER STUDIES should have been called \"How to Act\" and one could possibly had seen a long series. I will say that the first half of this film is downright bad because it's simply not funny like it's meant to be. With that said, I was impressed with the acting by Love and thought he did a good job in the first and second half. His performance is the main reason to check this film out, which is certainly an interesting piece, if not fully entertaining.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Montagu Love",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1893190",
    "tt3251338",
    "tt0309243",
    "tt0211244",
    "tt1706329",
    "tt0430019",
    "tt1698500",
    "tt4135826",
    "tt0192101",
    "tt1053360",
    "tt0759722",
    "tt3251348"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.168Z"
}