{
  "movieId": "tt0936466",
  "title": "Consequences",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/consequences-dvdrip",
      "id": "consequences-dvdrip",
      "title": "Consequences (2006)",
      "description": "Consequences introduces us to Max, Jimmy, Norm, Nick and Jason at the age of eighteen. Friends since early childhood, they have bonded deeper than natural brothers. As eighteen-year-old men, we share with them their dreams, loves, and friendships as well as life's hopes and frustrations. We, once again, meet them at age forty and learn how their lives have unfolded as we experience their marriages, strengths and disappointments. The group is together now on their annual football weekend, this year in Philadelphia. While bonding and enjoying the vibrant nightlife, they become separated only to find a darkness they have never known. It becomes a struggle of life or death. Realizing that everyone must pay the price, they all have to deal with Consequences.",
      "fileSize": 1247659803,
      "addedAt": "2026-01-07T00:07:51.624Z",
      "thumbnail": "https://archive.org/services/img/consequences-dvdrip",
      "language": "eng",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 110
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "86 min",
    "imdbRating": 3,
    "imdbVotes": 135,
    "Genre": "Thriller",
    "Plot": "Consequences introduces us to Max, Jimmy, Norm, Nick and Jason at the age of eighteen. Friends since early childhood, they have bonded deeper than natural brothers. As eighteen-year-old men, we share with them their dreams, loves, and friendships as well as life's hopes and frustrations. We, once again, meet them at age forty and learn how their lives have unfolded as we experience their marriages, strengths and disappointments. Together they are capable of celebrating with each other their emotions in an open and honest fashion. The group is together now on their annual football weekend, this year in Philadelphia. While bonding and enjoying the vibrant nightlife, they become separated only to find a darkness they have never known. It becomes a struggle of life or death. The friends find themselves disconnected from each other but ultimately gain a stronger respect for one another than they ever thought possible. Realizing that everyone must pay the price, they all have to deal with Consequences.",
    "Director": "Stephen Stahl",
    "Writer": "Anthony C. Hipple",
    "Actors": "Nicholas Kattar, Paul Marron, Adam Ratcliffe",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0473445",
    "tt0478832",
    "tt0489070",
    "tt0910548",
    "tt0446298",
    "tt2381117",
    "tt0424938",
    "tt0933750",
    "tt0827179",
    "tt0839991",
    "tt0470705",
    "tt0393567"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:51.624Z"
}