{
  "imdbId": "tt0952640",
  "title": "Alvin and the Chipmunks",
  "year": 2007,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jyJnhZtyofo",
      "id": "jyJnhZtyofo",
      "title": "Alvin and the Chipmunks - The Movie (Cult Film, Full Movie in German, Adventure Film, Family Film)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Alvin, Simon und Theodore – drei ganz unterschiedliche Chipmunks – landen nach dem Verlust ihres Baums beim erfolglosen Musikproduzenten Dave. Dort müssen sie beweisen, dass sie bleiben dürfen. Zum Glück können die frechen Streifenhörnchen nicht nur sprechen, sondern auch singen – und zwar richtig gut.\n\nALVIN UND DIE CHIPMUNKS (2007)\nOriginaltitel: Alvin and the Chipmunks\nMit: Jason Lee, Ross Bagdasarian Jr., Janice Karman\nRegie: Tim Hill\nFSK: Freigegeben ab 0 Jahren\n\nINHALTSANGABE:\nAlvin, Simon und Theodore sind so verschieden wie Streifenhörnchen nur sein können: der eine ein Draufgänger, der andere smart wie Einstein und der Dritte ein naiver Träumer. Als ihr Tannenbaum plötzlich als Weihnachtsbaum gefällt wird und die Chipmunks bei Dave, einem erfolglosen Musikproduzenten, in Los Angeles landen, müssen sie mit all ihren Talenten davon überzeugen, bei ihm bleiben zu dürfen. Was liegt also näher, als ihn mit ihrer Musik zu begeistern - denn die Chipmunks können nicht nur sprechen, sondern auch tierisch gut singen....\n#Netzkino #ganzerFilm #alvinandthechipmunks \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:35:23.307Z",
      "thumbnail": "https://i.ytimg.com/vi/jyJnhZtyofo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBV6Z21dBN0Vtvd2gqHXEXaEiX6yA",
      "duration": 5471,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "92 min",
    "imdbRating": 5.3,
    "imdbVotes": 101785,
    "Genre": "Animation, Adventure, Comedy",
    "Plot": "In a tree farm, three musically inclined chipmunks, Alvin, Simon and Theodore, find their tree cut down and sent to Los Angeles. Once there, they meet the frustrated songwriter David Seville, and despite a poor house wrecking first impression, they impress him with their singing talent. Seeing the opportunity for success, both human and chipmunks make a pact for them to sing his songs. While that ambition proves a frustrating struggle with the difficult trio, the dream does come true after all. However, that success presents its own trials as their unscrupulous record executive, Ian Hawke, plans to break up this family to exploit the boys. Can Dave and the Chipmunks discover what they really value amid the superficial glamor around them?",
    "Director": "Tim Hill",
    "Writer": "Jon Vitti, Will McRobb, Chris Viscardi",
    "Actors": "Jason Lee, Ross Bagdasarian Jr., Janice Karman",
    "Language": "English, French, Spanish, Japanese",
    "Country": "United States",
    "Awards": "4 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt1068997",
    "tt0907678",
    "tt1067106",
    "tt1356395",
    "tt1620449",
    "tt1272051",
    "tt0031397",
    "tt0104740",
    "tt8354218",
    "tt6181728",
    "tt2179678",
    "tt1487931"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:27:08.249Z"
}