{
  "imdbId": "tt0937419",
  "title": "Reign of the Fallen",
  "year": 2005,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Reign_of_the_Fallen",
      "id": "Reign_of_the_Fallen",
      "title": "Reign of the Fallen",
      "description": "In the times since great wars laid waste to the planet Prias, its people have learned to embrace a simple life, away from the perils of technology and war. As the mighty Sith army spreads across the galaxy, subjugating every planet in its path, all the people of Prias can do is wait, their planet protected by an energy shield held in place by ancient towers. While the people wait in fear, one Jedi trained by Master Oram Bren will be chosen to be the future leader of Prias, a title decided by a vote of the entire population of the planet. But little do they know that one Jedi's dark secret could spell their doom.",
      "fileSize": 2278921714,
      "addedAt": "2026-01-07T00:06:51.866Z",
      "thumbnail": "https://archive.org/services/img/Reign_of_the_Fallen",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 180327
    }
  ],
  "metadata": {
    "Rated": "NOT RATED",
    "Runtime": "56 min",
    "imdbRating": 6.4,
    "imdbVotes": 120,
    "Genre": "Action, Sci-Fi",
    "Plot": "In the times since great wars laid waste to Prias, its people have learned to embrace a simple life, away from the perils of technology and war. As the mighty Sith army spreads across the galaxy, subjugating every planet in its path, all the people of Prias can do is wait, their world protected by an energy shield held in place by ancient towers. While the people wait in fear, one Jedi trained by Master Oram Bren will be chosen to be the future leader of Prias, a title decided by a vote of the entire population of the planet. But little do they know that one Jedi's dark secret could spell their doom.",
    "Director": "David McLeavy",
    "Writer": "David McLeavy",
    "Actors": "Carlos Acuña, Maureen Isern, Jason Updike, Kevin Walsh",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0472566",
    "tt0457489",
    "tt0426556",
    "tt0228040",
    "tt0407304",
    "tt0481509",
    "tt0491764",
    "tt0457701",
    "tt0843873",
    "tt0896040",
    "tt1094162",
    "tt0854667"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.866Z"
}