{
  "movieId": "tt10768194",
  "title": "A New York Christmas Wedding",
  "year": 2020,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tnBt1Pmgkf0",
      "id": "tnBt1Pmgkf0",
      "title": "New York Christmas - Christmas miracles do happen (Christmas movies in German, Holiday Romance)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 An Weihnachten bleibt New Yorks Aufzugswelt stehen: 20 Menschen stecken in sechs Aufzügen fest – darunter ein gefeuertes Personalmitglied, ein Immobilien-Hai, eine Musikerin mit Orchester und ein zynischer Arzt. In dieser chaotischen Nacht erleben sie lustige, bewegende und unvergessliche Momente miteinander.\n\nNEW YORK CHRISTMAS – WEIHNACHTSWUNDER GIBT ES DOCH! (2015)\nOriginaltitel: Christmas Eve\nMit: Jon Heder, James Roday, Patrick Stewart, Cheryl Hines, Julianna Guill, Max Casella, Gary Cole\nRegie: Mitch Davis\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nAusgerechnet an Weihnachten: Ein Stromausfall sorgt dafür, dass 20 Menschen verteilt auf sechs Aufzüge in unterschiedlichen Gebäuden in New York City stecken bleiben und dadurch eine unvergessliche Weihnachtsnacht erleben. James (Jon Heder) ist zusammen mit Randy (Max Casella) eingeschlossen dem Personalmanager, der ihn vor wenigen Minuten gefeuert hat. Immobilien-Hai Harris (Patrick Stewart) hat gerade die Baustelle seines aktuellen Architekturprojekts verlassen, als sein Baustellenlift den Geist aufgibt und den herzlosen Tycoon in schwindelerregender Höhe allein zurücklässt. Die Musikerin Dawn (Cheryl Hines) wiederum bleibt zusammen mit ihrem ganzen dysfunktionalen Orchester stecken - was bleibt ihnen also anderes übrig, als sich die Wartezeit mit Musik zu vertreiben? Der aufstrebende Modefotograf B. (James Roday) findet sich in einer Kabine mit seiner verschlossenen Nachbarin, der Anwältin Ann (Julianna Guill), wieder. Und außerdem ist da noch der zynische Arzt Dr. Roberts (Gary Cole), der mit seinem Team gerade dabei war, eine todkranke Patientin per Fahrstuhl zu einer wichtigen OP zu bringen. Im Laufe des Abends durchleben die durch das Schicksal zusammengewürfelten New Yorker lustige und traurige, bewegende und alles verändernde Momente miteinander.\n#Netzkino #ganzerFilm #Weihnachtsfilme\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:35:43.808Z",
      "thumbnail": "https://i.ytimg.com/vi/tnBt1Pmgkf0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD4EIC7-hrhbma7gfutU28ImkGWTw",
      "duration": 5475,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-MA",
    "Runtime": "88 min",
    "imdbRating": 5.4,
    "imdbVotes": 1441,
    "Genre": "Drama, Romance",
    "Plot": "As her Christmas Eve wedding draws near, Jennifer is visited by an angel and shown what could have been if she hadn't denied her true feelings for her childhood best friend.",
    "Director": "Otoja Abit",
    "Writer": "Otoja Abit",
    "Actors": "Camilla Harden, Natasha Goodman, Avery Whitted",
    "Language": "English",
    "Country": "United States",
    "Awards": "8 nominations"
  },
  "relatedMovies": [
    "tt10886166",
    "tt12787842",
    "tt13197624",
    "tt11585200",
    "tt8338762",
    "tt10372548",
    "tt9115528",
    "tt10663608",
    "tt9144004",
    "tt16156352",
    "tt10333426",
    "tt14311250"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:21:02.390Z"
}