{
  "imdbId": "tt10418972",
  "title": "Black Pool",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QRP-aqpIOrY",
      "id": "QRP-aqpIOrY",
      "title": "Black Pool | Full Movie | Gripping Thriller Drama | IRA Story",
      "description": "Black Pool - A gripping thriller about a revenge-fueled, cat-and-mouse game of imprisonment and interrogation between two Irish immigrants whose mysterious shared past sets them on a collision course with violence.\n2019.  Stars: Tom Walton, Amber Stonebraker, Todd Van Voris\n**Under license from Distribution Solutions.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\nMORE FULL MOVIES - FREE on YouTube!\n\n Free Action Movies: https://bit.ly/3uMwRxq\n Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n Free Horror Movies: https://bit.ly/3aBBt2J\n Free Asylum Movies: https://bit.ly/3cipzeI\n Free Crime/Thriller: https://bit.ly/3o01prJ\n Free Drama Movies: https://bit.ly/3Pu4mN9\n Free Comedy Movies: https://bit.ly/3IE0wPd\n Free Western Movies: https://bit.ly/3RqTX6u\n Free Adventure Movies: https://bit.ly/3yHolAT\n MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #IRAStories #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:06:58.009Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/QRP-aqpIOrY/maxresdefault.webp",
      "duration": 5110,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "GB",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 7.2,
    "imdbVotes": 26,
    "Genre": "Thriller",
    "Plot": "A dark, dingy basement. One man is tied to a chair. Another man stands before him, gripping a large hammer. A video camera whirs away in the background. \"How do you know me?\" asks the man with the hammer. \"I've never seen you before in my life,\" answers the man in the chair. \"You will tell me how you know me, and what you've done to me, or you won't get out of that chair alive.\" So begins \"Black Pool\", a gripping thriller of imprisonment and interrogation, as three desperate people engage in a battle of wills that may leave one of them dead. Set all in one night, the film uses a contemporary story of fatalism and vengeance to explore the conflict that has raged in Northern Ireland for nearly a hundred years. Michael is a tortured Irishman living with his wife Emma in America. Perpetually down on his luck, he has projected his life's misfortune onto a stranger, a man who changed his life in a tragic incident nearly thirty years earlier. A shadowy figure he saw for only a fleeting moment. But tonight, through a chance encounter, he believes he's found the man who ruined his life. And he's going to make him pay. But does he have the right man? This question ignites a revenge-fueled game of cat-and-mouse that will test Michael's understanding of his past. And caught between the two men is Emma, who may hold the only key to escaping the night alive.",
    "Director": "Dustin Morrow",
    "Writer": "Dustin Morrow",
    "Actors": "Tom Walton, Amber Stonebraker, Todd Van Voris",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt9214844",
    "tt9211804",
    "tt6195762",
    "tt9552162",
    "tt5563718",
    "tt7336182",
    "tt4669974",
    "tt7043534",
    "tt8332666",
    "tt8561690",
    "tt9312100",
    "tt4857806"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:14:46.431Z"
}