{
  "imdbId": "tt1094627",
  "title": "Buddha Collapsed Out of Shame",
  "year": 2007,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BuddhaCollapsedOutOfShame2007",
      "id": "BuddhaCollapsedOutOfShame2007",
      "title": "Buddha Collapsed Out of Shame (2007)",
      "description": "Synopsis Buddha Collapsed Out of Shame (Buda as sharm foru rikht) is a 2007 film by Hana Makhmalbaf. It is the story of a 5 year old Afghan girl who wants to go to school against all odds. Bakhtay (Nikbakht Noruz), a little girl living in the caves under the remains of the Buddha statues of Bamyan (which were destroyed by the ************ Taliban in 2001), becomes obsessed with the idea of going to school. The process to reach her dream proves to be dreadful. She has to make her way through machismo, the ravages of war, poverty and dire childrenÂ´s games (including stoning of captive girls â when playing as Taliban â and unlawful executions â when playing as American army soldiers). âWikipedia Cast: Abbas Alijome, Abdolali Hoseinali, Nikbakht Noruz",
      "fileSize": 17340037,
      "addedAt": "2026-01-07T00:06:14.040Z",
      "thumbnail": "https://archive.org/services/img/BuddhaCollapsedOutOfShame2007",
      "collection": "feature_films",
      "downloads": 3081
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "81 min",
    "imdbRating": 7.3,
    "imdbVotes": 2394,
    "Genre": "Drama, War",
    "Plot": "A young girl zealously wants to go to school and learn to read and write. Almost everywhere she is met with hostility or indifference. The only young boy who takes her to his school is thrown out by the teacher, because helping her prevented him from coming in time. - It must not go unnoticed that the schoolgirls and the female teacher are likewise hostile toward this girl. None of them want her in the classroom. On her way home she and other girls are taken as prisoners by boys playing talibans. They tear her school book to pieces (or rather what was left of it after the schoolgirls had done the same thing.) The \"taliban boys\" threaten to stone their girl prisoners (although in this movie there is little real physical violence against girls). The girl's attempts end in complete failure. (Whatever moods of the scenes throughout the entire movie, the acting by the central girl is really impressive.)",
    "Director": "Hana Makhmalbaf",
    "Writer": "Marzieh Makhmalbaf",
    "Actors": "Abbas Alijome, Abdolali Hoseinali, Nikbakht Noruz",
    "Language": "Persian",
    "Country": "Iran, France, Afghanistan",
    "Awards": "8 wins & 6 nominations"
  },
  "relatedMovies": [
    "tt1298590",
    "tt0460989",
    "tt0785012",
    "tt0456508",
    "tt1633245",
    "tt0377935",
    "tt1316616",
    "tt1789074",
    "tt1295026",
    "tt0092978",
    "tt0020620",
    "tt0033021"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.040Z"
}