{
  "movieId": "tt1041763",
  "title": "The Triumph of an Emperor",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-triumph-of-an-emperor",
      "id": "silent-the-triumph-of-an-emperor",
      "title": "The Triumph of an Emperor",
      "fileSize": 396815128,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-triumph-of-an-emperor",
      "language": "Italian",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 519
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "61 min",
    "imdbRating": 4.6,
    "imdbVotes": 34,
    "Genre": "Drama",
    "Plot": "Emperor Maximian, having married his daughter, Fausta, to Constantine, renounced the purple and went into retirement, but the enforced idleness and his desire for power and action, induced him to again resume the imperial power. In the field near Lodi, where the oath of allegiance of the army has been received, Maximian begins his triumphant return, and we see him again amid the people crowding the streets, impatient to see him again. He enters the imperial court where Constance, a sister of Constantine, and Licinius, the young Caesar of Illyrium, and Fausta are waiting the arrival of their august relation. The love affair between Constance and Licinius is discovered by Fausta, who has instructions to prevent this alliance from being consummated, as Maximian himself has set his heart on winning Constance. As soon as he enters the palace, and the tumult of greetings cease, he goes into the ladies' room and, dismissing Fausta with a sign, is left alone with Constance, whom he tries to win through flattery, but she refuses him. She goes secretly to St. Maternus and listens to his inspiring words, receiving the right of Christian baptism from his hands. Fausta, having followed Constance, sees all and hastens to tell her father of her discovery. Maximian orders a banquet in the hope that the allurements of pleasure will break down the stubborn defense of Constance. Even this fails, for Constance does not even go near the banqueting room. Maximian then calls together the pagan priests; he annuls his decree, giving tolerance to Christianity. Thousands of confessors of Christ will fall. Constance alone, by giving herself up, will be able to appease the bloody sword of the persecutor. He forces the young neophyte, Constance, to be present at the gladiatorial games. A populace present at the games at the hecatomb of martyrs. The heart of the young Christian girl undergoes a terrible martyrdom, but the bravery of these martyrs gives the girl the firmness that only faith can produce. Maximian, again failing in his attempt to win Constance, tries again, and goes to the field of Lodi and, summoning the army, he orders incense to be thrown upon the pagan tripod. Here again Christian heroes give up their lives to their faith, their bodies are carried in chariots before the imperial seat, before the eyes of Fausta and Constance. Realizing that there is no peace in the court of Maximian for her, she, with her companions, mount their horses and rush to the Court of Constantine. Here exists no bacchanalian orgy, but the sweet calm of virtue. Constantine, amid the lowly, the oppressed and the poor, does his work of upright government. Constance tells her powerful brother all of the horrible plots in which she has been involved and the terrors she has seen. In the meantime, Maximian and Fausta plot the death of Constantine and send the corrupt centurian, Elvius Brutus, to execute the treasonable deed. Through a trick, this design is frustrated, but Brutus is led to believe that his work has been carried out and he tells Maximian, who comes before the gallis coharts, exclaiming: \"Constantine is dead. I am your emperor!\" \"Constantine is living!\" interrupts a powerful voice, and the austere monarch appears among a crowd of faithful followers. Maximian is put to death and Fausta, fearing the penalty for her part in the plot, rushes word to her brother, Maxentius, in Rome, who declared war on Constantine. Gathering his coharts together, Constantine crosses the snowy Alps and carries the war into Italy. As day is declining, Constantine, unable to rest, paces to and fro between the tents when, at last, his eyes catch sight of something dazzling in the direction of the sun. He sees a splendid cross in the blue heaven in all its glory, with the inscription: \"In Hoc Signo Vincis,\" but the Emperor, not comprehending the meaning of this sign, was further instructed in the clear night where a vision of the Lord Himself appeared, telling him: \"By this sign you will conquer,\" and directing him to engrave the Holy Cross on his shields. The army resumes its march toward Rome, exulting at the miracle. Meeting the army of Maxentius on the Banks of the Tiber, the battle wages fiercely for hours, but eventually, the followers of Maxentius are put to rout and retreat across the Tiber on bridges made of boats, which give way, carrying Maxentius and his men to their death. Having made his triumphal entry into Rome, the first thought of Constantine is to pay homage to the chief of Christianity, Pontifex St. Melchiades. He prostrates himself at his feet, together with the dutiful Constance and promises to give Christianity free liberty and, as a token of filial reverence, gives the magnificent palace of the Lateran, to be the mother church of all the churches of the world. We see Constantine in his triumphant dress in the same imperial hall where the last bloody persecution had begun. Licinius hastens to Milan to joint his beloved Constance, and has signed the decree giving full liberty to Christianity. He is flanked by a victorious host and looks at the people crowded and acclaiming while the herald reads the imperial messages, \"We, Constantine and Licinius Augustus, being at Milan to make joint treaties concerning the welfare and security of our people amongst the things which we deem enhancing the prosperity of our subjects, we specially give importance to those that have reference to the homage due to the Divinity and thus we have given to the Christians and to all citizens of the Roman people the liberty to follow the form of faith which each one may severally prefer.\" The forum is deserted, the darkness of night prevails and Constantine is alone in his hall lighted up by the soft rays falling from a lamp; he holds in his hands a little tablet containing the decree and is meditating. A few lines contain the history of the world. He closes his eyes and before his mind appears in review the facts which led Christianity to victory after so many centuries of bloodshed. Footsteps awaken the Emperor. Constance and Licinius, with their arms interlocked, enter. Constantine sees and smiles. In the triumph of faith and justice, innocent love also has its victory.",
    "Director": "Nino Oxilia",
    "Writer": "N/A",
    "Actors": "Maria Jacobini, Mario Mariani, Dillo Lombardi",
    "Language": "None, Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0005951",
    "tt0002784",
    "tt0002795",
    "tt0002910",
    "tt0003014",
    "tt0003075",
    "tt0003497",
    "tt0003516",
    "tt0778062",
    "tt0464694",
    "tt0002816",
    "tt0470339"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}