{
  "imdbId": "tt1013921",
  "title": "Lord Roberts' Visit to Manchester",
  "year": 1901,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-lord-roberts-visit-to-manchester",
      "title": "Lord Roberts' Visit to Manchester",
      "id": "silent-lord-roberts-visit-to-manchester"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "3 min",
    "imdbRating": "5.1",
    "imdbVotes": "70",
    "Genre": "Documentary, Short, News",
    "Plot": "This is a news (or actuality) film of the former Commander-in-Chief of the Boer War, Lord Frederick Roberts, visiting Manchester to much hoopla. He's seen first giving a speech, and shortly thereafter, the unveiling of a statue of Victoria is recorded. Yet, it's poorly filmed. The eye-line view of the camera doesn't take in the statue. The tilting framing that James White and the Edison Company used the previous year for their film \"Panorama of Eiffel Tower\" would've came in handy here. In other parts of \"Lord Roberts' Visit to Manchester\", the filmmakers use in-camera jump cuts, which in retrospect wasn't a wise editorial decision (although common in these early actuality films). It's an amateurish and distracting shot transition. Moreover, Mitchell and Kenyon, or their cameraman, are more interested in photographing crowd scenes. Of this, there is some good footage.From viewing the Mitchell and Kenyon collection on the \"Electric Edwardians\" DVD, it's evident that these filmmakers were obsessed with filming crowds; the more people they could cram within the frame the better seems to be the logic. This appears to have been a business tactic to encourage local patrons to see themselves on the screen; the Mitchell and Kenyon films were distributed locally, rather than nationally and internationally, as is usually the case with filmmakers who receive historical attention. (The large number of preserved films, however, makes the Mitchell and Kenyon collection unique, especially since their recent discovery has come at a time of increased interest in the study of early films.) They were surely also influenced by the Lumière brothers' crowd scenes, such as \"Workers Leaving the Lumière Factory\" (La Sortie des usines Lumière) (1895). The Lumière Company's influence on Mitchell and Kenyon can also be seen in their adoption of the Company's phantom ride films (i.e. placing the camera on a moving vehicle) for other movies of theirs.Nevertheless, what I find interesting in \"Lord Roberts' Visit to Manchester\" are two scenes not staged but nonetheless captured by the camera. These are in contrast to the otherwise staged event of Lord Roberts's visit and the nationalistic fervor surrounding it. The first is of a woman who fainted, which occurs within only the second shot of the film, after the shot of Roberts speaking to the crowd. The second is the filming of another film crew filming the same crowd scene. The cameraman, it is believed, is none other than Cecil Hepworth, who was the main British film producer for a time.These early films have been of interest for various reasons, including as a historical look at a bygone era, as well as, in some instances, the capture of interesting events, but the main interest in them has been in discovering the beginnings of the art form of cinema itself. Here, the process of filming is captured; therefore, it's of doubled interest.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Frederick Sleigh Roberts",
    "Language": "None",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt1013937",
      "title": "Opening of the Drill Hall in Accrington by General Baden-Powell",
      "year": 1904,
      "imdbRating": "4.8",
      "imdbVotes": "64",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0471071",
      "title": "Alfred Butterworth and Sons, Glebe Mills, Hollinwood",
      "year": 1901,
      "imdbRating": "5.5",
      "imdbVotes": "134",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0360454",
      "title": "Captain Nissen Going Through Whirlpool Rapids, Niagara Falls",
      "year": 1901,
      "imdbRating": "5.8",
      "imdbVotes": "187",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1982637",
      "title": "Chamonix: Arrivée en voitures des breaks d'excursion",
      "year": 1901,
      "imdbRating": "4.8",
      "imdbVotes": "222",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1982638",
      "title": "Chamonix: Le Mauvais Pas",
      "year": 1901,
      "imdbRating": "5.3",
      "imdbVotes": "236",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0471134",
      "title": "Cunard Vessel at Liverpool",
      "year": 1901,
      "imdbRating": "5.4",
      "imdbVotes": "100",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0359274",
      "title": "Fireman Rescuing Men and Women",
      "year": 1901,
      "imdbRating": "5.1",
      "imdbVotes": "134",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0477309",
      "title": "High Diving Scene",
      "year": 1901,
      "imdbRating": "5.5",
      "imdbVotes": "156",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0471213",
      "title": "Jamaica Street, Glasgow",
      "year": 1901,
      "imdbRating": "5.8",
      "imdbVotes": "107",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1982751",
      "title": "La Plage et l'Etablissement",
      "year": 1901,
      "imdbRating": "4.8",
      "imdbVotes": "77",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1982778",
      "title": "Maillane: Défilé des tambourinaires",
      "year": 1901,
      "imdbRating": "4.5",
      "imdbVotes": "80",
      "language": "None, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0471256",
      "title": "Manchester Band of Hope Procession",
      "year": 1901,
      "imdbRating": "5.2",
      "imdbVotes": "99",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:11:07.408Z"
}