{
  "movieId": "tt1166827",
  "title": "Zeitgeist",
  "year": 2007,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ZEITGEIST_DVD",
      "id": "ZEITGEIST_DVD",
      "title": "ZEITGEIST",
      "description": "http://www.zeitgeistmovie.com/ Zeitgeist was created as a not for profit expression to inspire people to start looking at the world from a more critical perspective and to understand that very often things are not what the population at large think they are. The information in Zeitgeist was established over a year long period of research and the current Source page on this site lists the sources used / referenced. Soon, an interactive transcript will be online with detailed footnotes and links. It's important to point out that there is a tendency to simply disbelieve things that are counter to our understanding, without the necessary research performed. For example, some information contained in Part 1 and Part 3, specifically, is not obtained by simple keyword searches on the Internet. You have to dig deeper. For instance,very often people who look up \"Horus\" or \"The Federal Reserve\" on the Internet draw their conclusions from very general or biased sources. Online encyclopedias or text book Encyclopedias often do not contain the information contained in Zeitgeist. However, if one takes the time to read the sources provided, they will find that what is being presented is based on documented evidence. Any corrections, clarifications & further points regarding the film are found on the Clarifications page. That being said, it is my hope that people will not take what is said in the film as the truth, but find out for themselves, for truth is not told, it is realized. Please click the \"ftp\" link on the left side of this page and download the ZEITGEIST.iso DVD image. Burn the file \"as an image\" with your DVD recording program.",
      "fileSize": 4433227041,
      "addedAt": "2026-01-07T00:07:18.437Z",
      "thumbnail": "https://archive.org/services/img/ZEITGEIST_DVD",
      "language": "English",
      "year": 2007,
      "collection": "feature_films",
      "downloads": 34102
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "118 min",
    "imdbRating": 8.1,
    "imdbVotes": 48342,
    "Genre": "Documentary, History",
    "Plot": "This film gathers information from many sources and puts it together in a way that shows it is possible for people to be manipulated by large institutions, governments and economic powers. It is divided into 3 parts. 1. Religion: Pagan astrological beliefs compared to modern and ancient religions. (9:35-35:53) 2. 9/11: An overview of the numerous questionable aspects of this immensely important event. (35:54-1:09:16) 3. The Federal Reserve Bank: A history of its formation and ability to control the economy. (1:09:17-1:56:23) With many news clips from tragic events in history, audio excerpts from those who believe people are being misled about the level of freedom they have.",
    "Director": "Peter Joseph",
    "Writer": "Peter Joseph",
    "Actors": "Chogyam Trungpa, Jordan Maxwell, George Carlin, Bill Hicks",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1332128",
    "tt0911010",
    "tt1475191",
    "tt1457738",
    "tt0379225",
    "tt2296619",
    "tt1935826",
    "tt0247568",
    "tt0059529",
    "tt1127851",
    "tt2213002",
    "tt0276783"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.437Z"
}