{
  "movieId": "tt11209358",
  "title": "Zoey",
  "year": 2020,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=53QAo8Otnss",
      "id": "53QAo8Otnss",
      "title": "Zoey | Full Drama Thriller Movie | 2020",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nZoey - After losing his job, Tommy heads back to his home town of New York City. With zero job prospects, Tommy starts selling cocaine with Donnie, his brother, a veteran drug dealer. Tommy keeps seeing a gorgeous young woman, Zoey. But before he gets the chance things head sideways when she gets attacked in the street. Tommy fights off the attacker and finally meets Zoey. His life and outlook improve instantly as their relationship develops. But keeping his web of lies neat quickly proves futile.\n\n2020\nStars: Ruth Maria Flores, Kyle Myhre, Jason Utnick\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:35.568Z",
      "thumbnail": "https://i.ytimg.com/vi/53QAo8Otnss/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCrstPf2LqFCsAjms8wyaGdPVBosQ",
      "duration": 5096,
      "language": "en",
      "year": 2020,
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "84 min",
    "imdbRating": 4,
    "imdbVotes": 76,
    "Genre": "Thriller",
    "Plot": "After losing his job, Tommy heads back to his home town of New York City. With zero job prospects, Tommy starts selling cocaine with Donnie, his brother, a veteran drug dealer. Tommy keeps seeing a gorgeous young woman, Zoey. But before he gets the chance things head sideways when she gets attacked in the street. Tommy fights off the attacker and finally meets Zoey. His life and outlook improve instantly as their relationship develops. But keeping his web of lies neat quickly proves futile.",
    "Director": "Kyle Myhre",
    "Writer": "N/A",
    "Actors": "Ruth Maria Flores, Kyle Myhre, Jason Utnick",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt10772662",
    "tt9037864",
    "tt4269310",
    "tt10799214",
    "tt6876854",
    "tt8660656",
    "tt13486266",
    "tt8433786",
    "tt9378826",
    "tt8075634",
    "tt7622584",
    "tt7153650"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:58:10.933Z"
}