{
  "imdbId": "tt1104779",
  "title": "The Five",
  "year": 2010,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-five-2010-dvdrip-xvid-pg",
      "id": "the-five-2010-dvdrip-xvid-pg",
      "title": "The Five (2010)",
      "description": "Battling their way back after being thrown into the dangerous world of a popular fictional book series, five kids learn that they can't change the past, but how they deal with it in the present will determine their future.",
      "fileSize": 1221151416,
      "addedAt": "2026-01-07T00:11:57.687Z",
      "thumbnail": "https://archive.org/services/img/the-five-2010-dvdrip-xvid-pg",
      "language": "eng",
      "year": 2010,
      "collection": "feature_films",
      "downloads": 70
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 5,
    "imdbVotes": 94,
    "Genre": "Adventure, Family, Fantasy",
    "Plot": "Summer vacation in Mountain's Edge, a sprawling two-square-mile subdivision of three-story half-million-dollar catalogue homes in suburban Denver. At the heart of the subdivision, its own fleet of soccer fields, manicured and gleaming - a game in play, a swarm of 12-year-olds running from end to end, moms and dads in that \"off-duty Hollywood\" look. At the foot of the subdivision: The desert to one side, long and dry, and endless-looking. To the other side, a span of high-desert foothills, rolling upward into the greener, higher mountains. It is here that two sets of kids - neighbors in both landscape and loss - will wake one morning to find that their paths begin to resemble that of a character in their favorite mythological book series. What they don't yet know is that an invisible darkness following them is what they make it out to be - themselves, their fears about their parents, the frequency of change in their lives, and the instability of a world lived on the mountain's edge.",
    "Director": "Dave Yasuda",
    "Writer": "J. Reuben Appelman",
    "Actors": "Madisen Beaty, Emily Cho, Ry Feder Pruett, Ben Larned",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1438462",
    "tt0050084",
    "tt0004873",
    "tt0089961",
    "tt1320261",
    "tt0004099",
    "tt0004457",
    "tt0015400",
    "tt0068190",
    "tt0290406",
    "tt0052948",
    "tt0243462"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.687Z"
}