{
  "movieId": "tt1161861",
  "title": "A Lonely Place for Dying",
  "year": 2009,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ALonelyPlaceForDying",
      "id": "ALonelyPlaceForDying",
      "title": "A Lonely Place for Dying",
      "description": "KGB defector Nikolai Dzerzhinsky (Ross Marquand) convinces Washington Post Editor-In-Chief Howard Simons (James Cromwell) to send a reporter for a rendezvous in an abandoned Mexican prison. CIA project manager Anthony Greenglass (Michael Wincott) sends special agent Robert Harper (Michael Scovotti) to intercept Nikolai...and kill him. VODO is proud to present this incredible indie Cold War spy thriller, with appearances from James Cromwell (LA Confidential, The Green Mile, Secretariat) and indie-favorite Michael Wincott (Talk Radio, The Crow, The Assassination of Richard Nixon). Created by talented first-time Director Justin Eugene Evans, A Lonely Place for Dying has already been a festival hit. Now it's releasing as a five-part series through VODO, including two music releases highlighting the work of the film's composer, Brent Daniels. Visit VODO's website for more information .",
      "fileSize": 1478171569,
      "addedAt": "2026-01-07T00:06:09.633Z",
      "thumbnail": "https://archive.org/services/img/ALonelyPlaceForDying",
      "language": "English",
      "year": 2011,
      "collection": "feature_films",
      "downloads": 45232
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "94 min",
    "imdbRating": 5.8,
    "imdbVotes": 363,
    "Genre": "Action, Thriller, War",
    "Plot": "In 1972, the conflict in Vietnam continues. The creeping threat of communism grips the nation in fear. In an abandoned prison on the US/Mexican border, KGB mole Nikolai Dzerzhinsky waits for his contact from the Washington Post. He holds explosive evidence against the CIA, information he will trade for asylum in the United States. Special Agent Robert Harper's orders are clear: take the documents from Dzerzhinsky and kill him.",
    "Director": "Justin Eugene Evans",
    "Writer": "Catherine Doughty, Justin Eugene Evans",
    "Actors": "Michael Scovotti, Ross Marquand, Michael Wincott",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    "tt1561768",
    "tt2130142",
    "tt2175927",
    "tt0094843",
    "tt2459244",
    "tt2717318",
    "tt6724510",
    "tt1198153",
    "tt5344794",
    "tt1147687",
    "tt1269734",
    "tt1353997"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.633Z"
}