{
  "imdbId": "tt1185616",
  "title": "Waltz with Bashir",
  "year": 2008,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WaltzWithBashir2008",
      "id": "WaltzWithBashir2008",
      "title": "Waltz with Bashir (2008)",
      "description": "Waltz with Bashir (2008) Directed by: Ari Folman Date of birth: 1963, Haifa, Israel Writing credits: Ari Folman Music by: Max Richter Country: Israel Language: Hebrew | German | English | Arabic Color: Color Runtime: 91 min. Released: 2009 Genre: Animation / Documentary We may forget the past, but the past won't forget us. Synopsis One night at a bar, an old friend tells director Ari Folman about a recurring nightmare in which he is chased by 26 vicious dogs. Every night, the same number of beasts. The two men conclude that thereâs a connection to their Israeli Army mission in the first Lebanon War of the early eighties. Ari is surprised that he canât remember a thing anymore about that period of his life. Intrigued by this riddle, he decides to meet and interview old friends and comrades around the world. He needs to discover the truth about that time and about himself. As Ari delves deeper and deeper into the mystery, his memory begins to creep up in surreal images â¦ (Summary from Waltz with Bashir web site) Cast: Ron Ben-Yishai, Ronny Dayag, Ari Folman, Dror Harazi, Yehezkel Lazarov, Mickey Leon, Ori Sivan",
      "fileSize": 24761957,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/WaltzWithBashir2008",
      "collection": "feature_films",
      "downloads": 6985
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/waltz-with-bashir-2008_202510",
      "id": "waltz-with-bashir-2008_202510",
      "title": "Waltz with Bashir (2008)",
      "description": "Waltz with Bashir is a 2008 adult animated war documentary film written, produced, and directed by Ari Folman. It  follows Israeli filmmaker Ari Folman as he interviews fellow veterans to uncover his repressed memories of serving in the Israeli army during the 1982 Lebanon War, particularly focusing on the Sabra and Shatila massacre. The film blends animation with real-life interviews, exploring the psychological impact of war and the nature of memory.",
      "fileSize": 1582657539,
      "addedAt": "2026-01-07T00:13:06.701Z",
      "thumbnail": "https://archive.org/services/img/waltz-with-bashir-2008_202510",
      "language": "heb / English subtitles",
      "year": 2008,
      "collection": "feature_films",
      "downloads": 140
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "90 min",
    "imdbRating": 8,
    "imdbVotes": 61713,
    "Genre": "Documentary, Animation, Biography",
    "Plot": "One night at a bar, an old friend tells director Ari about a recurring nightmare in which he is chased by 26 vicious dogs. Every night, the same number of beasts. The two men conclude that there's a connection to their Israeli Army mission in the first Lebanon War of the early eighties. Ari is surprised that he can't remember a thing anymore about that period of his life. Intrigued by this riddle, he decides to meet and interview old friends and comrades around the world. He needs to discover the truth about that time and about himself. As Ari delves deeper and deeper into the mystery, his memory begins to creep up in surreal images.",
    "Director": "Ari Folman",
    "Writer": "Ari Folman",
    "Actors": "Ari Folman, Ron Ben-Yishai, Ronny Dayag",
    "Language": "Hebrew, Arabic, German, English",
    "Country": "Israel, France, Germany, United States, Finland, Switzerland, Belgium, Australia",
    "Awards": "Nominated for 1 Oscar. 46 wins & 63 nominations total"
  },
  "relatedMovies": [
    "tt1475191",
    "tt1457738",
    "tt1352822",
    "tt0775438",
    "tt1821641",
    "tt0310597",
    "tt0247304",
    "tt5378288",
    "tt3123418",
    "tt7188868",
    "tt9316022",
    "tt14091630"
  ],
  "collections": [
    {
      "id": "top-movies",
      "name": "Top Movies"
    },
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.701Z"
}