{
  "movieId": "tt1176412",
  "title": "Birthrite",
  "year": 2008,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/birthrite-2008-dvdrip",
      "id": "birthrite-2008-dvdrip",
      "title": "Birthrite (2008)",
      "description": "Insurance adjuster Elizabeth Alexander is abducted by a backwoods mentally deficient Charley and his crazy mother in the swamps of East Arkansas.",
      "fileSize": 1269327591,
      "addedAt": "2026-01-07T00:07:38.717Z",
      "thumbnail": "https://archive.org/services/img/birthrite-2008-dvdrip",
      "language": "eng",
      "year": 2008,
      "collection": "feature_films",
      "downloads": 89
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 3.7,
    "imdbVotes": 80,
    "Genre": "Horror, Thriller",
    "Plot": "When Elizabeth Alexander is sent to asses the storm damage of one of her employer's policyholders, her life will be changed forever. After getting lost, her car gets stuck. When she is befriended by the simple- minded Charley Aycock, she believes that soon she will be back on the road. Her nightmare has just begun. Momma Aycock has raised her slow-witted son Charley on the banks of the Cache River. They live on Charley's trapping and fishing. But Momma is worried. She is aging, and there is no one to take care of Charley after she is gone...and there is his Birthrite to consider. Their home has passed from one Aycock to the next for generations. Charley has no heir. Elizabeth would make the perfect mate for Charley. She is young and beautiful. With just a little training, Momma is sure that she could be the one for Charley...unless she turns out like the others.",
    "Director": "Mark L. Maness",
    "Writer": "Randal Files (screenplay)",
    "Actors": "Alex Moody, Linda Bowling, Megan Dowd, Darnel Alexander",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1149606",
    "tt0867295",
    "tt0489018",
    "tt1098356",
    "tt0899128",
    "tt1183733",
    "tt1132130",
    "tt0995033",
    "tt1164090",
    "tt1285216",
    "tt1285217",
    "tt1521787"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.718Z"
}