{
  "movieId": "tt1158278",
  "title": "Kisaragi",
  "year": 2007,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/kisaragi-2007-1080p-blu-ray",
      "id": "kisaragi-2007-1080p-blu-ray",
      "title": "Kisaragi (2007)",
      "description": "One year after the suicide of C-list model Miki, five of her fans come together for a commemorative meeting: fan club leader Iemoto, Yuji Oda, Snake, Yasuo, and Musume Ichigo. Sitting down together for the first time, they reminisce about their idol, wondering how someone so bright and beautiful could have possibly taken her own life. It just doesn't make sense. That's when they reach a revelation - she must have been murdered! The five heatedly discuss her death, expressing their suspicions and weighing the many clues and possibilities. The more they talk, the more the case takes shape in their minds, and the closer they come to the truth.",
      "fileSize": 2146691131,
      "addedAt": "2026-01-07T00:09:24.700Z",
      "thumbnail": "https://archive.org/services/img/kisaragi-2007-1080p-blu-ray",
      "language": "jpn",
      "year": 2007,
      "collection": "feature_films",
      "downloads": 540
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "108 min",
    "imdbRating": 7.2,
    "imdbVotes": 1321,
    "Genre": "Comedy, Mystery",
    "Plot": "One year after the suicide of C-list model Kisaragi Miki, five of her fans come together for a commemorative meeting; fan club leader Iemoto, Oda Yuji, \"Snake\", Yasuo, and \"Strawberry Girl\". After meeting each other for the first time, they reminisce about their idol, wondering how someone so bright and happy could have possibly taken her own life. As they discuss her death, the facts, and evidence, they slowly come to the realization that her death didn't occur they way they thought it did. The more they talk, the more the case takes shape in their minds, and the closer they come to the truth.",
    "Director": "Y没ichi Sat么",
    "Writer": "Ry么ta Kosawa",
    "Actors": "Shun Oguri, Y没suke Santamaria, Keisuke Koide",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "1 win & 4 nominations"
  },
  "relatedMovies": [
    "tt0478210",
    "tt1100053",
    "tt8315092",
    "tt1711507",
    "tt0039645",
    "tt0037960",
    "tt0033613",
    "tt0038577",
    "tt0036695",
    "tt0026085",
    "tt0034488",
    "tt0019690"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:24.700Z"
}