{
  "imdbId": "tt1113818",
  "title": "Richard the Lion-Hearted",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-richard-the-lion-hearted",
      "id": "silent-richard-the-lion-hearted",
      "title": "Richard the Lion-Hearted",
      "fileSize": 777927887,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-richard-the-lion-hearted",
      "language": "Italian",
      "year": 1912,
      "collection": "feature_films",
      "downloads": 479
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 5.7,
    "imdbVotes": 18,
    "Genre": "Short, Drama",
    "Plot": "Richard of England, the champion of Christendom, dominates with his iron will the camp of the Crusaders. and is most desirous that the English banner shall float supreme upon St. George's Hill, flaunting defiance to the enemy. He gives orders that Sir Kenneth of Scotland shall guard this banner with his life. Kenneth is brave and a worthy knight, but is falsely induced to leave his post, and, unfortunately, fails in his trust, for during his absence the banner is stolen by his enemies. When this comes to the king's ears, he becomes furious, and calls a council of war. The Duke of Montserrat scornfully admits to have committed the deed, and the king decrees that the two knights shall settle the matter in mortal combat. To the sounding of trumpets, a gay and gorgeous throng assemble to view the struggle in the lists. The two rival warriors, Kenneth and Montserrat, clad in mail and mounted upon chargers, are soon engaged in furious assault upon each other. The battle is fierce, but of short duration, for Sir Kenneth proves the mightier, and Montserrat is soon stretched upon the ground desperately wounded. Kenneth thus triumphantly justifies himself, amid the plaudits of the multitude. The king is so pleased with the victory that he graciously bestows upon him the hand of Edith Plantagenet in marriage.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, Italian",
    "Country": "Italy",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1207008",
    "tt1223220",
    "tt1059291",
    "tt0417062",
    "tt0002356",
    "tt0344506",
    "tt0470339",
    "tt0463594",
    "tt0330942",
    "tt0427674",
    "tt0367144",
    "tt0231716"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}