{
  "movieId": "tt11116656",
  "title": "The Memory Eraser",
  "year": 2020,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-memory-eraser-2020-1080p-blu-ray",
      "id": "the-memory-eraser-2020-1080p-blu-ray",
      "title": "The Memory Eraser (2020)",
      "description": "Ryoichi Yoshimori is a university student. His girlfriend Kyoko Sawada is older than him, but he enjoys his time with her. After Ryoichi Yoshimori proposes to his girlfriend, she suddenly disappears one day. Several days later, he finally sees her again but she has no memory of him. Ryoichi Yoshimori is stunned, but he suspects her memory loss is related to the Kiokuya rumor. A person named Kiokuya is reputed to erase the memories of people. He talks to Tomoaki Takahara, who is a lawyer and attended the same university as him, about his situation. Ryoichi Yoshimori searches for the cause of Kyoko Sawada’s memory loss and gets help from childhood friend Maki Kawai and Tomoaki Takahara’s assistant.",
      "fileSize": 4312235660,
      "addedAt": "2026-01-07T00:12:22.154Z",
      "thumbnail": "https://archive.org/services/img/the-memory-eraser-2020-1080p-blu-ray",
      "language": "jpn",
      "year": 2020,
      "collection": "feature_films",
      "downloads": 324
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "105 min",
    "imdbRating": 5.1,
    "imdbVotes": 79,
    "Genre": "Drama, Fantasy",
    "Plot": "Ryoichi Yoshimori is a university student. His girlfriend Kyoko Sawada is older than him, but he enjoys his time with her. After Ryoichi proposes to his girlfriend, she suddenly disappears one day. Several days later, he finally sees her again, but Kyoko does not have any memory of him. Ryoichi is stunned, but he suspects her memory loss is related to the Kiokuya rumor. A person named Kiokuya is reputed to erase the memories of people. He talks to Chiaki Takaharu, who is a lawyer and attended the same university, about his situation. Ryoichi searches for the cause of Kyoko's memory loss and gets help from childhood friend Maki Kawai, who is also Chiaki's assistant.",
    "Director": "Yûichirô Hirakawa",
    "Writer": "Yûichirô Hirakawa, Keiko Kanome",
    "Actors": "Tatsuomi Hamada, Kurumi Inagaki, Rika Izumi",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt10399114",
    "tt10617192",
    "tt9893266",
    "tt8284860",
    "tt14292086",
    "tt16233104",
    "tt5886388",
    "tt5770864",
    "tt14717832",
    "tt7642542",
    "tt6193454",
    "tt6121428"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:22.154Z"
}