{
  "imdbId": "tt1131732",
  "title": "Flying By",
  "year": 2009,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bEk_Od8V0IA",
      "id": "bEk_Od8V0IA",
      "title": "Flying By | Full Drama Movie | Billy Ray Cyrus | Heather Locklear",
      "description": "**The film is under non-exclusive license from Artist View Entertainment Inc.  All rights reserved**\n\nFlying By - This musically driven drama follows a successful Real Estate developer (Billy Ray Cyrus) who puts his marriage and business on the line when given the opportunity to follow his ultimate, life-long dream....music.\n\n2009\nStars: Ahnaise Christmas, Mo Collins, Billy Ray Cyrus, Heather Locklear\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:24.001Z",
      "thumbnail": "https://i.ytimg.com/vi/bEk_Od8V0IA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCL9Ztvk1xPhOKrvvnu7SF78lmEpg",
      "duration": 5741,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "GB"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "90 min",
    "imdbRating": 4.2,
    "imdbVotes": 345,
    "Genre": "Drama, Family, Music",
    "Plot": "A real estate developer goes to his 25th high school reunion without his wife, and finds his old teenage band playing. They get him up on stage for a couple of songs, and convince him come to a rehearsal. His wife is outraged that he played. His daughter thinks it's kind of cool. His Mother, in a retirement home, encourages him to enjoy life. He feels some temporary relief from the pressures of business complexities and the stress of marriage tensions. The band gets booked at a popular bar, which leads to a last minute booking to open for a reunion tour, with the possibility of additional tour dates. But the band has internal conflicts. He faces a tough decision to give it a shot even though it will affect his marriage, his family, particularly his daughter, and his business.",
    "Director": "Jim Amatulli",
    "Writer": "Jim Amatulli, Oscar Jarnicki",
    "Actors": "Billy Ray Cyrus, Heather Locklear, Patricia Neal",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt1509130",
    "tt0910993",
    "tt1400335",
    "tt1640714",
    "tt1032746",
    "tt1646876",
    "tt2094146",
    "tt1083448",
    "tt1577038",
    "tt1839596",
    "tt1613062",
    "tt0772176"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:57:52.050Z"
}