{
  "movieId": "tt11276530",
  "title": "Black School Rules",
  "year": 2019,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/black-kosoku-2019-1080p-web-dl",
      "id": "black-kosoku-2019-1080p-web-dl",
      "title": "Black School Rules (2019)",
      "description": "Sora is a 2nd grade high school, but he is virtually invisible at school. He is friends with Chuya. Chuya's personality is completely different from Sora. Chuya does unpredictable things and that surprises those around him. Sora and Chuya both have feelings for the same girl at their school. The girl refuses to attend school, because she doesn't want to change her brown hair to black. Their school has unreasonable school rules, including requiring all students to have black hair. For the girl that Sora and Chuya like, they stand up to change their school's black school rules. (Source: AsianWiki)",
      "fileSize": 3664667907,
      "addedAt": "2026-01-07T00:07:38.718Z",
      "thumbnail": "https://archive.org/services/img/black-kosoku-2019-1080p-web-dl",
      "language": "jpn",
      "year": 2019,
      "collection": "feature_films",
      "downloads": 396
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "118 min",
    "imdbRating": 6.1,
    "imdbVotes": 33,
    "Genre": "Drama",
    "Plot": "Sora is a high school student, but feels virtually invisible at school. His friend, Chuya, does unpredictable and surprising things and has a completely different personality than Sora, but they both like the same girl, Kio. In their pursuit of her, they take a stand against their school's unreasonable rules, which require all students to have black hair -- and the object of their affection has brown hair and refuses to change it, so she won't attend school. Based on the anime series of the same name.",
    "Director": "Shintarô Sugawara",
    "Writer": "Kazuya Konomoto",
    "Actors": "B.T., Serena Motola, Shori Sato",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt4364194",
    "tt8337320",
    "tt9214844",
    "tt9037866",
    "tt9071322",
    "tt9211804",
    "tt9552352",
    "tt8549590",
    "tt9816396",
    "tt9552162",
    "tt9110380",
    "tt10206614"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.718Z"
}