{
  "imdbId": "tt1172203",
  "title": "Sita Sings the Blues",
  "year": 2008,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Sita_Sings_the_Blues",
      "title": "Sita Sings the Blues",
      "description": "Sita is a goddess separated from her beloved Lord and husband Rama. Nina is an animator whose husband moves to India, then dumps her by email. Three hilarious shadow puppets narrate both ancient tragedy and modern comedy in this beautifully animated interpretation of the Indian epic Ramayana. Set to the 1920's jazz vocals of Annette Hanshaw, Sita Sings the Blues earns its tagline as \"the Greatest Break-Up Story Ever Told.\"",
      "fileSize": 251213276370,
      "id": "Sita_Sings_the_Blues"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Sita1080pFLAC",
      "title": "Sita Sings the Blues",
      "description": "DVD VERSION! This is my own DVD version -- UN official, but loaded with goodies. You can find it as a direct-download here, but please if possible use the torrent and help seed! DVD features: High-quality video encoding; Director's Commentary featuring Nina Paley and Karl Fogel ; Subtitles including English, Spanish, French, German, Russian, Chinese, Dutch and Finnish; Customized chapter selection screens with screenshot previews - chapters are biased towards the Annette Hanshaw songs (for lack of anything better to base them on); Two trailers; Full-resolution anamorphic 16x9 video with 16x9 menus; A few fun easter-eggs. Please download, help seed, spread the word, and let me know what you think! 1080p/FLAC version: This is a remuxing of the 1080p .mp4 version of the movie as originally posted, combining the exact same video with the original uncompressed audio track in FLAC. That means that as of now, this is the highest possible quality version available. NOTICE: Please use the torrent if you can - it is webseeded by the uploaded version here yet will probably give you better download speeds. 720p AVCHD .iso: Please use the torrent ... This is burnable to one blank DVD, and should play on many blu-ray players including the Playstation 3. (check your player's documentation for the \"AVCHD\" logo; if it doesn't have it, bug the manufacturer to implement it in a firmware upgrade!) This .iso contains the original 720p video (non-transcoded) as well as original PCM audio. AVCHD is basically like a blu-ray quality disc but smaller, small enough to fit on a single-layer DVD blank. I've found that the disc is unrecognized in my computer's DVD drive after burning, but it plays in my Panasonic BD35k blu-ray player just beautifully, in full 720p HD.",
      "fileSize": 17952325397,
      "id": "Sita1080pFLAC"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Sita_Sings_the_Blues_1080p_dirac_vorbis.ogg",
      "title": "Sita_Sings_the_Blues",
      "description": "Sita is a goddess separated from her beloved Lord and husband Rama. Nina is an animator whose husband moves to India, then dumps her by email. Three hilarious shadow puppets narrate both ancient tragedy and modern comedy in this beautifully animated interpretation of the Indian epic Ramayana. Set to the 1920's jazz vocals of Annette Hanshaw, Sita Sings the Blues earns its tagline as \"the Greatest Break-Up Story Ever Told.\"",
      "fileSize": 5081152189,
      "id": "Sita_Sings_the_Blues_1080p_dirac_vorbis.ogg"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Sita_Sings_the_Blues_Files",
      "title": "Sita Sings the Blues Files",
      "description": "Flash Authoring Files for the feature-length animated film Sita Sings the Blues All the Flash authoring (.fla) files I used to make Sita Sings the Blues have just been posted on archive.org , under a Creative Commons Share Alike license. Want to know how I got a certain animated effect in Sita Sings the Blues ? Open up the .fla files and find out. Want to remix from the source? Now you can. Want to make a Sita Sings the Blues video game using all the assets? Go for it. (But I strongly suggest you negotiate my endorsement if you want to actually market the end product.) License: You may use these files any way you wish, as long as you 1. attribute the source to Nina Paley / Sita Sings the Blues ; 2. properly attribute any modifications so it’s clear those are NOT by Nina Paley ; 3. Release any resulting work under the same Creative Commons Share Alike license. DRM is prohibited on anything made with these source files. Certain musical works included in Sita Sings the Blues, listed here , are subject to restrictive licenses. As required by the respective copyright holders, these licenses only allow you to listen to these songs in the context of the original film. Here is a chart containing a full list of restricted songs and their composers, along with each song’s license holder today. File names: These files are very poorly named. We welcome any open re-naming and re-cataloguing projects. Asset libraries: Please note that every file has its own asset library. Although many assets have the same name, in many cases they are not exactly the same from file to file. Combining assets may yield strange results. Hanuman’s pupils, for example, may appear giant-sized when moved into other libraries. Yes, I know bad bad people can also use the .fla files for dastardly deeds (the dreaded hypothetical “Nazi Porn Version” that always comes up at Q&A’s). Bad bad people can use our shared Language and Technology for evil too, but I’m not going to constipate culture out of fear of imaginary worst-case scenarios. I’m confident much more good will come from this than bad, and that’s motivation enough for me. It’s Free Culture , baby. If programmers can tinker with the Free Software ’s source code , artists can tinker with Sita Sings the Blues ‘ source files .",
      "fileSize": 4891151816,
      "id": "Sita_Sings_the_Blues_Files"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "82 min",
    "imdbRating": 7.6,
    "imdbVotes": 5022,
    "Genre": "Animation, Comedy, Fantasy",
    "Plot": "The movie is about Sita, the Hindu Goddess from the epic \"The Ramayana\", who accompanies Lord Rama on a 14 year exile in forest. Sita is abducted by Ravana, the ruler of Lanka. This movie tells the story of Rama and Sita, along-with a biographical account of the director's relationship with her husband.",
    "Director": "Nina Paley",
    "Writer": "Nina Paley, Valmiki",
    "Actors": "Annette Hanshaw, Aseem Chhabra, Bhavana Nagulapally",
    "Language": "English",
    "Country": "United States",
    "Awards": "7 wins & 3 nominations"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0772185",
      "title": "Santa Baby",
      "year": 2006,
      "imdbRating": 5.5,
      "imdbVotes": 1858,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    },
    {
      "imdbId": "tt0044414",
      "title": "The Curious Adventures of Mr. Wonderbird",
      "year": 1952,
      "imdbRating": 7.2,
      "imdbVotes": 286,
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0907678",
      "title": "Edison & Leo",
      "year": 2008,
      "imdbRating": 5.5,
      "imdbVotes": 257,
      "language": "English, French",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt1067106",
      "title": "A Christmas Carol",
      "year": 2009,
      "imdbRating": 6.8,
      "imdbVotes": 136559,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0461770",
      "title": "Enchanted",
      "year": 2007,
      "imdbRating": 7.1,
      "imdbVotes": 225315,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt1356395",
      "title": "The Dog Who Saved Christmas",
      "year": 2009,
      "imdbRating": 4.1,
      "imdbVotes": 1047,
      "language": "N/A",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt1068997",
      "title": "Noah's Ark",
      "year": 2007,
      "imdbRating": 5.1,
      "imdbVotes": 569,
      "language": "Spanish",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0952640",
      "title": "Alvin and the Chipmunks",
      "year": 2007,
      "imdbRating": 5.3,
      "imdbVotes": 101785,
      "language": "English, French, Spanish, Japanese",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0918628",
      "title": "Fishtales",
      "year": 2007,
      "imdbRating": 4.6,
      "imdbVotes": 2019,
      "language": "English, Greek",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0787495",
      "title": "Netherbeast Incorporated",
      "year": 2007,
      "imdbRating": 5.5,
      "imdbVotes": 1479,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt1620449",
      "title": "Animals United",
      "year": 2010,
      "imdbRating": 4.9,
      "imdbVotes": 7254,
      "language": "German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1272051",
      "title": "Space Dogs",
      "year": 2010,
      "imdbRating": 5,
      "imdbVotes": 1595,
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    }
  ],
  "collections": [
    {
      "id": "2000s",
      "name": "2000s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-07T18:28:14.711Z"
}