{
  "movieId": "tt1182302",
  "title": "Lights and Shadows in a City of a Million",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-lights-and-shadows-in-a-city-of-a-million",
      "id": "silent-lights-and-shadows-in-a-city-of-a-million",
      "title": "Lights and Shadows in a City of a Million",
      "fileSize": 117027905,
      "addedAt": "2026-01-07T00:11:07.408Z",
      "thumbnail": "https://archive.org/services/img/silent-lights-and-shadows-in-a-city-of-a-million",
      "language": "English",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 368
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbRating": 4.6,
    "imdbVotes": 45,
    "Genre": "Documentary, Short",
    "Plot": "This film is part of a collection entitled \"American Film Archives: Vol. 3: Disc 1\". The DVDs deal specifically with American short films that deal with various social issues. These are the sort of films that usually would be forgotten or lost had it not been for some film preservationists work. Now this set certainly isn't for everyone, as the content is a bit dry. However, for history teachers (like myself) and cinemaniacs (again, that would be me), it's an invaluable set.The pedigree to this film is interesting. Instead of being made by a film company, this short was paid for by Ford Motors in an attempt to improve the lot of the working people through advocating social services. Normally you don't think of Henry Ford in such positive terms, as today he's often known for his strike-breaking and pro-Nazi ideas. However, in this film he advocates for a better life for his employees (even foreign ones) and seems rather progressive for the era.Overall, a very unusual though not especially exciting film. Important for its historical aspects and advocacy of social work, but not a super-watchable film to audiences today.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0471648",
    "tt1495996",
    "tt2647254",
    "tt1515754",
    "tt0988639",
    "tt0955263",
    "tt2647224",
    "tt0938705",
    "tt0229789",
    "tt1029374",
    "tt0000537",
    "tt0178247"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.408Z"
}