{
  "imdbId": "tt1207008",
  "title": "Never Too Late to Mend",
  "year": 1911,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/NeverTooLateToMend",
      "id": "NeverTooLateToMend",
      "title": "Never Too Late To Mend",
      "description": "It is olde England and an evil land owner uses the local prison as his tool to get rid of poor people who bother him, until one day the tables are turned and he gets his just reward.",
      "fileSize": 1375476015,
      "addedAt": "2026-01-07T00:06:45.464Z",
      "thumbnail": "https://archive.org/services/img/NeverTooLateToMend",
      "collection": "feature_films",
      "downloads": 8095
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Short, Drama",
    "Plot": "Jack Pierce, a private in a certain U.S. regiment, is obliged to go west, as it has been found he is afflicted with consumption. Arriving at his destination, he takes a room at an old Mexican Inn, where he meets the daughter of the proprietor. They fall in love, and are subsequently married. An unexpected call from his superiors, requesting his services at once; so he is obliged to depart, leaving his wife behind, as he cannot take her with him. Twenty-five years elapse, and the son Juan, that was born a few days after Jack's departure, has grown to manhood, but has fallen in with a bad lot of thieves. The doings of this gang of robbers become so numerous that word is sent to the U.S. army, and a regiment of which Jack is now lieutenant, is sent to subdue the thieves. Arriving at the scene of pillage, they set out to capture the bad fellows. They are rounded up, including Juan, and in their march to the village, Jack recognizes the old in, and also sees his wife. After explanations are offered, a happy reunion is the result. Lieutenant Pierce hands in his resignation and Juan promises to be an honest man in the future.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1113818",
    "tt1223220",
    "tt1059291",
    "tt0417062",
    "tt0002356",
    "tt0344506",
    "tt0470339",
    "tt0463594",
    "tt0330942",
    "tt0427674",
    "tt0367144",
    "tt0231716"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.464Z"
}