{
  "imdbId": "tt1289621",
  "title": "Officer Henderson",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OfficerHenderson",
      "title": "Officer Henderson",
      "description": "This short film by Alice Guy (pronounced Alees ghee)Blache is another example of her playing with sexual stereotypes. In it the two policemen are required to dress as women to catch pickpockets. Notice that, though they have male faces they are accepted as women by everyone. Also the cloning in the police department is interesting as the officers do the mincing walk of that is more like cross dressers than like women. It was made in the Solex Company which Guy owned along with her husband about 1911. See Algie the Miner also in the Archive.",
      "id": "OfficerHenderson"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "14 min",
    "imdbRating": "5.1",
    "imdbVotes": "50",
    "Genre": "Short, Comedy",
    "Plot": "Captain Rogers, of Central Police Station, receives a complaint from merchants that a gang of purse snatchers are terrorizing their patrons. Veiled sneers are directed against the efficacy of the police service, and Captain Rogers decides to check the evil. He selects two officers and instructs them to furnish themselves with fashionable raiment, such as would attract a purse snatcher to choose them as \"ready-money\" victims. Officers Henderson and Williams are on the job. (Officer Henderson makes a dashing appearance in his finery, enters a café and orders his lunch, keeping a sharp look-out for purse snatchers, in the meantime his attention is soon attracted by the bold glances that a flashily dressed man is sending in his direction. He starts a successful flirtation and agrees to meet the masher at the same place the next day. Henderson returns to his home and removes the feminine garments, which he hangs up in his closet. His pretty young wife is visiting her mother for a few days but gets lonesome and returns home ahead of time and finds the garments in her husband's closet. The next day the wife dressed herself up in the \"other woman's clothes\" and goes downtown hoping to meet her husband and trap him. Lunch hour being near, she returns into the same restaurant where her husband has made his date with his ardent admirer of yesterday. She takes her place at a table and is eagerly joined by the flashy stranger, who kisses her hand and vows his undying love. Mrs. Henderson, thoroughly frightened, wishes herself at home, and does not know how to rid herself of the presumptuous fellow who is making himself very obnoxious. Mrs. Henderson has a difficult time trying to extricate herself from a difficult position. In the meantime. Henderson has gone to his house to \"dress up\" for the day's work and finds the clothes gone. Not knowing that his wife has returned, he is at a loss to know what has become of the finery. The only thing he can do is to wear his uniform till he can locate his skirts again. Henderson goes on duty on his beat downtown and encounters Williams, all dressed up in the police finery, on the lookout for purse-snatchers. Naturally the officers hold a close, confidential chat and are so interested in each other that they do not see Mrs. Henderson approaching. Her husband has his hand on the fascinating stranger's arm and they engage in earnest, confidential terms. Mrs. Henderson has found her husband with the goods. Hysterical from her recent experience with her café admirer, poor Mrs. Henderson throws herself upon the surprised Williams and tears him to pieces. Henderson, trying to protect his friend from the onslaught of his wife, who is wearing his finery, drags her across the curbing and dumps her in the patrol wagon. Williams, all in pieces, gets in the \"hurry-up\" wagon with them, and Mrs. Henderson, in blank amazement asks what it is all about. Explanations follow and everybody forgives everybody else.",
    "Director": "Alice Guy",
    "Writer": "N/A",
    "Actors": "Fraunie Fraunholz, Marian Swayne",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0002983",
      "title": "A House Divided",
      "year": 1913,
      "imdbRating": "6.0",
      "imdbVotes": "569",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0210835",
      "title": "Matrimony's Speed Limit",
      "year": 1913,
      "imdbRating": "5.9",
      "imdbVotes": "469",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1389556",
      "title": "A Severe Test",
      "year": 1913,
      "imdbRating": "4.7",
      "imdbVotes": "20",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0210599",
      "title": "Canned Harmony",
      "year": 1912,
      "imdbRating": "5.7",
      "imdbVotes": "263",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0256909",
      "title": "Making an American Citizen",
      "year": 1912,
      "imdbRating": "5.3",
      "imdbVotes": "395",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0004413",
      "title": "The Ocean Waif",
      "year": 1916,
      "imdbRating": "6.3",
      "imdbVotes": "510",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0210675",
      "title": "Falling Leaves",
      "year": 1912,
      "imdbRating": "6.6",
      "imdbVotes": "1,821",
      "language": "None, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0759516",
      "title": "Course à la saucisse",
      "year": 1907,
      "imdbRating": "6.1",
      "imdbVotes": "323",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0000288",
      "title": "La concierge",
      "year": 1900,
      "imdbRating": "5.3",
      "imdbVotes": "209",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1649427",
      "title": "Une course d'obstacle",
      "year": 1906,
      "imdbRating": "5.3",
      "imdbVotes": "145",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1649428",
      "title": "Une histoire roulante",
      "year": 1906,
      "imdbRating": "5.8",
      "imdbVotes": "310",
      "language": "None",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0372119",
      "title": "Across the Mexican Line",
      "year": 1911,
      "imdbRating": "5.6",
      "imdbVotes": "31",
      "language": "None",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:45.465Z"
}