{
  "imdbId": "tt1274596",
  "title": "USS Seaviper",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SrWloM47vGo",
      "id": "SrWloM47vGo",
      "title": "USS Seaviper | Full Action War Movie | WW2 Submarines",
      "description": "USS Seaviper - The Captain of USS Seaviper must go ashore to conduct reconnaissance on an island near Sumatra, but the ship is left in the hands of Mister Cutter, after the Executive Officer is injured in battle. A conflict between Cutter and the Chief of the Boat puts the submarine in jeopardy.  Seaviper is trapped below the surface, with decreasing oxygen, and a Japanese destroyer hunting them from above. Damage to the boat also leave her survival in question. They must fight the Japanese destroyer and get the information about U-235 back to Pearl Harbor. \n2012. Stars: Tim Large, Jeremy King, Robb Maus\n**Under non-exclusive license from Framerate Technologies LLC.  All rights reserved**\n\n *SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox \nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:45:29.833Z",
      "thumbnail": "https://i.ytimg.com/vi/SrWloM47vGo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAbuaZ5b3hOn_bIGafL85pJ333xKQ",
      "duration": 6164,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "IN",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "102 min",
    "imdbRating": 2.4,
    "imdbVotes": 1007,
    "Genre": "Action, Drama, War",
    "Plot": "The German U-Boat, U-234, from the Port of Kiel is trading cargo with the Japanese. USS Seaviper must locate and stop this dangerous exchange. The Captain of USS Seaviper must go ashore to conduct reconnaissance on an island near Sumatra, but the ship is left in the hands of Mister Cutter, after the Executive Officer is injured in battle. A conflict between Cutter and the Chief of the Boat puts the submarine in jeopardy. Seaviper is trapped below the surface, with decreasing oxygen, and a Japanese destroyer hunting them from above. Damage to the boat also leave her survival in question. They must fight the Japanese destroyer and get the information about U-235 back to Pearl Harbor.",
    "Director": "Ralph A. Villani",
    "Writer": "Lynanne Rockhill",
    "Actors": "Tim Large, Jeremy King, Robb Maus",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt2101507",
    "tt1295026",
    "tt2876438",
    "tt2477218",
    "tt0025011",
    "tt0064571",
    "tt0036516",
    "tt1893195",
    "tt0048966",
    "tt0062688",
    "tt0050252",
    "tt0062819"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:56:29.680Z"
}