{
  "imdbId": "tt1223220",
  "title": "Antony and Cleopatra",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-antony-and-cleopatra",
      "id": "silent-antony-and-cleopatra",
      "title": "Antony and Cleopatra",
      "fileSize": 1042904260,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-antony-and-cleopatra",
      "language": "Italian",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 3225
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Short, Drama, History",
    "Plot": "The well-known story of Cleopatra and Mark Antony has stirred students of history and human nature in every generation since the famous drama and its origin. Mark Antony's triumphing over the fleeing assassins of Julius Caesar, at Phillipi, made him the greatest man in all the world. It remained for Cleopatra, Queen of Egypt, to end his glorious career. Heedless of the inevitable consequence, Cleopatra had abandoned herself to the luxurious extravagances and riotous living of the times. The advent of Mark Antony threatened her ease and happiness. Consequently, she set about to save her crown by practicing her seductive charms upon the victorious Antony. The hitherto invulnerable warrior was immediately enslaved. Dreams of power and ambition were ruthlessly disregarded to make room for his new and overwhelming love for the Egyptian sorceress. Mark Antony for the first time found something that rivaled in his affections his wonderful devotion to his country. Octavius Caesar, realizing the situation, sought to save Mark Antony from himself, but Mark Antony was not the man to listen to suggestions. Consequently, Octavius determined to vent his wrath upon Antony for deserting the Roman cause, excited the people against their former idol, and in a short while an army was ready to avenge Rome even against their once beloved Mark Antony. So busy and so happy in his love-making was Mark Antony in the palace of Tarsus that the possibility of a plot against him never entered his mind, until he was called upon to defend himself. He fought with all his old time valor, but he was fighting Romans now and soon the tide of battle turned against him. A messenger hurried with the news to Cleopatra. Cleopatra read the evil tidings and immediately ordered the messenger poisoned. Embittered by his disgrace, Mark Antony made his last effort to prove his love for Cleopatra. He returned to the palace of Tarsus and ended his life by his own hand at the feet of his charmer. Unwilling to survive the triumph of Octavius, Cleopatra bares her breast to the deadly sting of a serpent.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2160081",
    "tt1207008",
    "tt1113818",
    "tt0470339",
    "tt0463594",
    "tt0330942",
    "tt0482779",
    "tt0367144",
    "tt0417062",
    "tt0002356",
    "tt0231716",
    "tt0178933"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}