{
  "movieId": "tt1245916",
  "title": "Wholesale Souls, Inc.",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/WholesaleSoulsInc",
      "id": "WholesaleSoulsInc",
      "title": "Wholesale Souls, Inc.",
      "description": "Wholesale Souls, Inc., Andrew Gingerich's feature directorial debut, is a modern-day tragic comedy on a personal scale. High school student James Young (Gregory Ley) sells his soul over the internet for a little extra spending money. But when it is purchased by a company known as Wholesale Souls, Inc., James tries to track down and buy it back. After frustrating encounters with Wholesale Souls, Inc. executive Stan McReynolds (Stan McReynolds), a man who may or may not be Satan incarnate, James grows increasingly paranoid and his relationship with his friends (Evan Riffe, Arin Baun, Erin Ray, Micah Buchele-Collins) becomes strained. Surrounded more and more by hallucinatory suspicions and personal tragedy, James makes a decision that will change his life and the lives of his friends forever.",
      "fileSize": 1402159958,
      "addedAt": "2026-01-07T00:07:11.888Z",
      "thumbnail": "https://archive.org/services/img/WholesaleSoulsInc",
      "language": "en-us",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 35321
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "77 min",
    "imdbVotes": null,
    "Genre": "Comedy",
    "Plot": "High school student James Young sells his soul over the Internet for a little extra spending money. But when it is purchased and resold by a company known as Wholesale Souls, Inc., James tries to track down and re-purchase his soul. After several frustrating encounters with Wholesale Souls, Inc. executive Stan McReynolds, a man who may or may not be Satan incarnate, James grows increasingly paranoid and his relationship with his friends becomes strained. Surrounded more and more by hallucinatory suspicions and personal tragedy, James makes a decision that will change his life and the lives of his friends forever.",
    "Director": "Andrew Gingerich",
    "Writer": "Parker Cagle-Smith (additional material), Andrew Gingerich, Gregory Ley (additional material), Evan Riffe (additional material)",
    "Actors": "Gregory Ley, Arin Baun, Evan Riffe, Erin Ray",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0791083",
    "tt0466342",
    "tt0483726",
    "tt0433412",
    "tt0841109",
    "tt0482088",
    "tt0867302",
    "tt0425253",
    "tt0468459",
    "tt0455400",
    "tt0425326",
    "tt0780126"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.888Z"
}