{
  "movieId": "tt1230545",
  "title": "Kung Fu Killer",
  "year": 2008,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=skb4P1QHYBc",
      "id": "skb4P1QHYBc",
      "title": "Kung Fu Killer - mit Donnie Yen - Martial Arts - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Donnie Yen, bekannt aus Ip Man 1, Ip Man 2, Ip Man 3 und Ip Man 4, lässt wieder die Fäuste fliegen!\n\nJetzt den Film “Kung Fu Killer” mit Donnie Yen online, in ganzer Länge bei #Moviedome sehen. Mehr ganze Filme entdecken: Abonnieren ► https://bit.ly/MoviedomeAbo \n\nEin Killer streift durch Hong Kong und hat es auf Martial-Arts-Kämpfer abgesehen. Nur ein Kung Fu Lehrer scheint ihn aufhalten zu können. \n\n\nJetzt “Kung Fu Killer” kostenlos als ganzen Film in deutsch sehen.\nDer Action Thriller “Kung Fu Killer” wurde 2014 in China und Hong Kong verfilmt.\nEine actiongeladener Krimi mit jeder Menge Kung Fu und einer Polizei, die auf unübliche Mittel zurückgreifen muss. Mit Donnie Yen, bekannt aus der IP MAN-Reihe. \nProduziert wurde der Film von Teddy Chan, Albert Lee und Alvin Chow. \n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme: www.moviedome.de\n\nFolge uns auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\n\n#Moviedome #KungFuKiller\n\nFilmlänge: 100 Minuten\nDVD-start (DE): 15.02.2016\n\n\nWer sind die Schauspieler?\nDie Charaktere werden von folgenden Schauspielern verkörpert: \nDonnie Yen (bekannt aus IP MAN, IP MAN 2, IP MAN 3 und IP MAN 4 - Das Finale)\nin der Rolle des Hahou Mo \nCharlie Yeung in der Rolle der Luk Yuen-Sum\nYu Xing (bekannt aus IP MAN) in der Rolle des Tam King-Yiu\nMichelle (Bing) Bai in der Rolle der Sinn Ying\nBaoqiang Wang (bekannt aus A Touch of Sin) in der Rolle des Fung Yu-Sau\nDavid Chiang in der Rolle des Chan Pak-Kwong\n\nDie Handlung und Szenen:\nEin skrupelloser Serienkiller treibt sein Unwesen in Hong Kong und ermordet bekannte Kung Fu Kämpfer. Die Polizei ist maßlos überfordert, bis sie ausgerechnet von einem inhaftierten Martial-Arts-Lehrer Hilfe angeboten bekommt. Hahou Mo hat versehentlich einen Mann getötet und hofft, für seine Mithilfe an dem Fall begnadigt zu werden. Eine erbarmungslose Jagd beginnt. Im Wettrennen zwischen Hahou, der Polizei und dem Killer geht es um Leben und Tod. Hahou Mo riskiert dabei nicht nur sein Leben, sondern auch die Sicherheit seiner Frau. Ein spannendes und actiongeladenes Katz-und-Maus-Spiel mit chinesischer Top-Besetzung. \n\n\nDie Synchronisation \nDonnie Yen; Sprecher: Viktor Neumann\nAlex Fong; Sprecher: Achim Buch\nSiuming Tsui; Sprecher: Martin May\nWang Baoqiang; Sprecher: Nils Rieke \nCharlie Yeung; Sprecher: Dagmar Dreke\nMichelle Bai; Sprecher: Katharina von Keller\n\n\nJetzt Film und Trailer kostenlos auf deutsch schauen\nKung Fu Killer I Trailer I 2014 I Alle Filminfos",
      "addedAt": "2025-12-26T00:36:20.366Z",
      "thumbnail": "https://i.ytimg.com/vi/skb4P1QHYBc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC_yR_4nxs0II3UeV6XbtQSsEpzkg",
      "duration": 6012,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "176 min",
    "imdbRating": 4.8,
    "imdbVotes": 886,
    "Genre": "Action",
    "Plot": "A Caucasian monk in Shanghai infiltrates the underworld to find the killers of his spiritual female Grandmaster.",
    "Director": "Philip Spink",
    "Writer": "Jacqueline Feather, David Seidler, John Mandel",
    "Actors": "David Carradine, Daryl Hannah, Jimmy Taenaka",
    "Language": "English",
    "Country": "Canada, United States",
    "Awards": "2 nominations total"
  },
  "relatedMovies": [
    "tt1060255",
    "tt0454402",
    "tt0985025",
    "tt1260932",
    "tt1192384",
    "tt0365675",
    "tt1314248",
    "tt0373051",
    "tt1104123",
    "tt0910993",
    "tt0827521",
    "tt1001548"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:36.102Z"
}