{
  "imdbId": "tt1241247",
  "title": "Saved by the Juvenile Court",
  "year": 1913,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-saved-by-the-juvenile-court",
      "id": "silent-saved-by-the-juvenile-court",
      "title": "Saved by the Juvenile Court",
      "fileSize": 80091123,
      "addedAt": "2026-01-07T00:11:15.973Z",
      "thumbnail": "https://archive.org/services/img/silent-saved-by-the-juvenile-court",
      "year": 1913,
      "collection": "feature_films",
      "downloads": 271
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 4.7,
    "imdbVotes": 28,
    "Genre": "Short, Drama",
    "Plot": "Through the pitiable destitution of the Rogers family, their fourteen-year-old son, Bob, is compelled to go to the railroad yards and pick coal in order to keep the members of the family from freezing. He is apprehended by a policeman who brings him before Judge Burton to answer to the charge of petty larceny. Following the time-honored method of rigidly interpreting the law, the judge sentences the little fellow to six months in jail. There he becomes a hardened criminal, being in the company of criminals of all sorts, and when he is released he robs a bank. He and his confederate escape with the money. Being pursued by a posse the culprits take refuge in a shack that is soon set on fire by his pursuers. In the revolver fight that follows, Bob is killed, thus ending a life that might have had a successful career. This is a short story of the first reel. The second and third reels show in contrast with the first the method of punishment employed by Judge Ben B. Lindsey, of Denver, Colo. Being reduced to dire straits by the death of her husband, Mrs. Anderson is compelled to take employment of meager returns. While she is striving to keep herself and her two little children, Charles and Alta, alive, the little ones, not being under the vigilance of their mother, become street waifs, and Charles is arrested for attempted robbery. He is taken before Judge Lindsey who gives him commitment papers and sends him, unattended, to the State industrial School at Golden, Colo., where he is trained along instructive lines. In the meantime, Alta, who has been a frequenter of low dance halls, is picked up by a policeman just as she is about to take her first drink. She, too, is taken before Judge Lindsey, who commits her to the girls' home at Morrison, Colo., where she is educated along lines that will best fit her for life. When the children return home sometime later they are surprised to see that their mother, through the assistance of Judge Lindsey, has opened a bakery shop. Calling upon the judge, Charles is given employment on the motorcycle brigade of a large department store, and one day while in the discharge of his duties he stops the runaway horse of a banker's daughter. Through his heroism he is given employment by the banker. He is so proficient in his work that he is soon given a confidential position. In time Charles and Beatrice, the daughter, fall in love with each other. Alta, who has been assisting her mother in the bakery, meets Lawrence Riches and after a brief courtship, Judge Lindsey is called upon to officiate at a double wedding.",
    "Director": "Otis Thayer",
    "Writer": "George Creel",
    "Actors": "Ida L. Greggory, Ben Lindsey",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0002784",
    "tt0002795",
    "tt0002910",
    "tt0003075",
    "tt0003497",
    "tt0003516",
    "tt0778062",
    "tt0464694",
    "tt0002816",
    "tt0470339",
    "tt0463594",
    "tt0003170"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.973Z"
}