{
  "imdbId": "tt12794540",
  "title": "4 Tage bis zur Ewigkeit",
  "year": 2022,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XCbkO274pJc",
      "id": "XCbkO274pJc",
      "title": "4 Tage bis zur Ewigkeit (LIEBESTHRILLER ganzer Film Deutsch, Historische Filme, Liebesdrama Filme)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Nach der geheimnisvollen Legende von Idilia Dubb. Deutschland, 19. Jahrhundert, im Mittelrheintal. Die 17-jährige Idilia (Lea van Acken - \"Kreuzweg\") wacht schwer verletzt inmitten einer düsteren Burgruine auf und kann sich an nichts erinnern.\n\n4 TAGE BIS ZUR EWIGKEIT (2022)\nOriginaltitel: 4 Tage bis zur Ewigkeit\nMit: Lea van Acken, Eric Kabongo, André Hennicke\nRegie: Simon Pilarski, Konstantin Korenchuk\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nMittelrheintal im 19. Jahrhundert: Idilia Dubb (Lea van Acken) wacht verletzt inmitten einer unheimlichen Burgruine auf. Nachdem sie feststellt, dass sie sich an nichts erinnern kann, was passiert ist, kommt schnell eine innere Unruhe auf. Ihr Tagebuch, welches sie dabei hat, nimmt ihr jedoch ein wenig die Angst. Zeile für Zeile entschlüsselt sie nicht nur die eigene Vergangenheit, sondern stößt auch auf eine heimliche Romanze mit dem leidenschaftlichen Caven (Eric Kabongo), der für Idilias Verlobten Franz Hagerberg (André M. Hennicke) arbeitet. Doch ist dies wirklich alles so passiert, wie es schwarz auf weiß steht? Sie vermag es nicht zu sagen. Es folgt ein nervenzehrender Überlebenskampf in den meterhohen Burgmauern, wobei Idilia allmählich die Nerven verliert.\n#Netzkino #ganzerFilm #Liebesthriller\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:39.376Z",
      "thumbnail": "https://i.ytimg.com/vi/XCbkO274pJc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCmiy_xvPP0m6adFPU6uTg21gWa2g",
      "duration": 6486,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "108 min",
    "imdbRating": 6,
    "imdbVotes": 30,
    "Genre": "Drama, History, Romance",
    "Plot": "Based on the mysterious legend of Idilia Dubb. Germany, 19th century, Middle Rhein Valley. The dreamy Idilia (Lea van Acken) awakes injured in the midst of a gloomy castle ruin and can't remember anything that happened before. When she discovers in horror that there is no escaping the towering castle walls, she begins a grueling fight for survival. Only her nebulous diary can help her decipher the past, which exposes a secret romance with Abyssinian actor Caven (Eric Kabongo), a performer in a human zoo exhibition run by her fiancee Franz Hagerberg (André M. Hennicke). Idilia's written record, however, blurs the lines between reality and fiction.",
    "Director": "Konstantin Korenchuk, Simon Pilarski",
    "Writer": "Konstantin Korenchuk, Simon Pilarski",
    "Actors": "Lea van Acken, Eric Kabongo, André Hennicke",
    "Language": "German",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0027727",
    "tt19800090",
    "tt0035294",
    "tt0012532",
    "tt0014854",
    "tt0015022",
    "tt14522892",
    "tt0030675",
    "tt11198810",
    "tt0034272",
    "tt14109724",
    "tt0052270"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:11.330Z"
}