{
  "imdbId": "tt1268864",
  "title": "The Blonde Captive",
  "year": 1931,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheBlondeCaptive",
      "title": "TheBlondeCaptive",
      "description": "An expedition sent to the primitive aboriginal outback of Australia hears rumors of a lost white woman. They do make it to Australia and then eventually to a very remote area. There they do find a white women who was shipwrecked way back and is married to a tribal Aborigine and is mother to his blond child. She does not want to go back with them. That is the thread of the story. The title may misleading. This is not action or drama packed and there is no blond captive. It`s more or less an old film that exploit the interest in primitive peoples and human evolution for entertainment value. Where it differs from others is that it makes a clear effort to appear scientific and includes Harvard professors and actual famous names in science.",
      "id": "TheBlondeCaptive"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pp8zmk5n-nE",
      "title": "The Blonde Captive (1931) JUNGLE ADVENTURE",
      "description": "Stars: Lowell Thomas\nDirectors: Clinton Childs, Ralph P. King\n\nAn expedition is sent into the primitive Australian outback to search for a lost white woman who was shipwrecked and married to a tribal Aborigine!",
      "id": "pp8zmk5n-nE",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "metadata": {
    "Rated": "Passed",
    "Runtime": "59 min",
    "imdbRating": "4.4",
    "imdbVotes": "85",
    "Genre": "Action, Adventure, Thriller",
    "Plot": "Lowell Thomas, Paul Withington, M.D. of Harvard University, and Clifton Childs, an archaeologist, gather to recount their trip to Australia. Using information from Professor Henry Fairfield Osborn's book Men of the Old Stone Age , Thomas gives an account of how archaeologists have come to believe that skeletons found in caves around the world are from Middle Paleolithic man. One skeleton in particular, located in a cave in the valley of Neanderthal near Düsseldorf, Germany, has set the standard for all such skeletons, which are deemed to be from one race, now called \"Neanderthal.\" Illustrations of the skull of a Neanderthal reveal a low brow, small brain capacity and large, animal-like jaw. The American Museum of Natural History has created a \"life-like\" model of a Neanderthal man. The purpose of the following expedition is to determine if any remnant of Neanderthal man exists today. After setting sail, the first stop is in Hawaii, where examples of the hula hula dance are shown, as well as surf riding, an ancient traditional art. The explorers travel on to Bali, where Balinese women are shown carrying baskets on their heads, weaving and dancing. The travelers move on to Pango Pango, which is part of the Samoan Islands, the ancestral home of the relatives of the Hawaiians, who also have their own version of the hula hula dance. Fiji is populated by Black Melanesians, who are shown singing and dancing as part of a ceremony. In Rotorua, New Zealand, examples of the powerful Maori lifestyle are shown, including their carved homes, songs and dances. Finally, the explorers sail into the harbor of Sydney, Australia, which, in addition to 1,000,000 people, is home to the indigenous koala bear. From Sydney, the explorers travel toward Ooldea, where they encounter their first Australian aborigines, whom scientists call the \"most primitive on earth.\" The aborigines have been driven from their original habitat into the desert. Next, the explorers land in Broome along the coast. On the outskirts of town is a chapel with an altar made of mother-of-pearl, originally built by the natives when the missionaries first arrived. Travelling through the desert, the scientists encounter lizards, duck-billed platypuses and kangaroos. They arrive at a reservation for aborigines and note that once there were about 15,000 aborigines, whereas less than half of that number exist today. The explorers return to the coast, where they charter a pearling schooner and sail the Timor Sea to a more remote place. On one small uncharted island, the scientists find sea turtles. Aboard the ship, Dr. Withington dissects a sea turtle and after he removes the heart from the body, it beats for twelve hours. The scientists also dissect a \"dugong,\" also known as a sea cow, which they have pulled from the sea. Finally, a plume of smoke is sighted along the coast, and the ship is greeted by aborigines on the beach. When they are escorted to the village, the explorers are impressed with the \"fine physical specimens,\" and note the scarification on their bodies. On some of the women, this denotes widowhood, and their short hair means that they are with their second husband. Although in the afternoon the heat can climb over one hundred degrees, the evenings are cool, and the aborigines use their pet dogs to keep warm. The scientists study each man of the tribe to find a relation to Neanderthal man, and after they are impressed by the amalgam of many types of humanity, they finally find one man who resembles a Neanderthal. Later, the scientists are shocked to discover that a white woman has been living amidst the aborigines. They find her in a cave with her aboriginal husband, and their blonde child. The woman explains that she is the widow of a pearling captain whose schooner crashed on the reef years before. She was the only survivor, and when she came to the aboriginal village, the widowers believed her to be the ghost of their wives because she was so pale. A boomerang contest determined who was to be her husband, and she has lived there ever since. The scientists offer to return the woman to civilization; however, she prefers to stay with her family. Fearing the onset of the monsoon season, the scientists set sail for home.",
    "Director": "Clifton Childs, Paul Withington",
    "Writer": "Lowell Thomas",
    "Actors": "Clifton Childs, Lowell Thomas, Paul Withington",
    "Language": "English",
    "Country": "Australia, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0025940",
      "title": "The Vanishing Shadow",
      "year": 1934,
      "imdbRating": "6.3",
      "imdbVotes": "137",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0021792",
      "title": "Defenders of the Law",
      "year": 1931,
      "imdbRating": "4.8",
      "imdbVotes": "47",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0099978",
      "title": "Laser Mission",
      "year": 1989,
      "imdbRating": "3.5",
      "imdbVotes": "2,764",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0112747",
      "title": "Cruel Jaws",
      "year": 1995,
      "imdbRating": "3.3",
      "imdbVotes": "969",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1694508",
      "title": "2010: Moby Dick",
      "year": 2010,
      "imdbRating": "2.4",
      "imdbVotes": "2,675",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt0057076",
      "title": "From Russia with Love",
      "year": 1963,
      "imdbRating": "7.3",
      "imdbVotes": "152,689",
      "language": "English, Russian, Turkish, French, Romany, Italian",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt1094162",
      "title": "AVH: Alien vs. Hunter",
      "year": 2007,
      "imdbRating": "1.5",
      "imdbVotes": "3,548",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt0073511",
      "title": "Paper Tiger",
      "year": 1975,
      "imdbRating": "5.8",
      "imdbVotes": "774",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Cult Cinema Classics"
    },
    {
      "imdbId": "tt0022028",
      "title": "King of the Wild",
      "year": 1931,
      "imdbRating": "6.0",
      "imdbVotes": "141",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "PizzaFlix"
    },
    {
      "imdbId": "tt0221905",
      "title": "Octopus",
      "year": 2000,
      "imdbRating": "3.0",
      "imdbVotes": "1,864",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt0022399",
      "title": "The Sky Spider",
      "year": 1931,
      "imdbRating": "2.4",
      "imdbVotes": "41",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0426556",
      "title": "Raging Sharks",
      "year": 2005,
      "imdbRating": "2.6",
      "imdbVotes": "988",
      "language": "English, Bulgarian",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-28T22:38:15.533Z"
}