{
  "movieId": "tt1278134",
  "title": "Usta",
  "year": 2009,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Turkish-TheMaster",
      "id": "Turkish-TheMaster",
      "title": "Usta",
      "description": "Title: Usta Summary: Directed by: Bahadir Karatas Actors: Yetkin Dikinciler, Fadik Sevin Atasoy, Sevket Çoruh Production Company: FIST Production Release Date: 8 May 2009 (Turkey) Aspect Ratio: 2.35 : 1 Add Full Plot",
      "fileSize": 968211818,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/Turkish-TheMaster",
      "year": 2009,
      "collection": "feature_films",
      "downloads": 658
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "118 min",
    "imdbRating": 7,
    "imdbVotes": 559,
    "Genre": "Drama",
    "Plot": "Usta tells the story of Dogan (Yetkin Dikinciler), a small-time car mechanic who has been dreaming of building a single-engine biplane. Dogan does not care about how many planes have been produced until then or whether his design will actually make a different for the world aeronautics world. All he wants do is to show the whole world that he can actually design a local single-engine plane and make it work.As Dogan has been working on that plane in his backyard for so long, his wife Emine (Fadik Sevin Atasoy) does not really share his enthusiasm. Emine has had a few miscarriages but she still wants to have a baby of her own in spite of the risk. When Dogan realizes that there are actually some people who do not believe that Dogan would achieve his dream, he decides to fly his not properly finished biplane in the local aeronautics fair but his plane crashes and what's worse his wife feels neglected and leaves Dogan at a moral crossroads. Torn between his marriage and his dream, what should Dogan do? Stop chasing his dream or save his falling apart marriage? Dogan's dilemma may sound too simple but it is actually the story of lots of Turkish people which goes untold. Unfortunately, Turkish people are educated in a general system where creativity and lateral thinking are mostly suppressed. Students who study in state-owned schools are,without exception, needs the support of a course system called \"dershane\", a system which is actually the Turkish counterpart of cram schools. Students, typically at week-ends (in some instances, also after the school hours, ), are drilled on diverse aspects of a student selection exam. Let alone high schools, even the best colleges and universities accept students based on an academic test administered at the end of a student's education.-A test in which students are obliged to choose one out of four-five options. Even the most successful students are actually the best choosers because they just achieve the result without producing anything tangible. What I mean is that many Turkish people like Dogan are indeed encouraged to save himself a wild goose chase as the professor says to Dogan \"A power glider is no big deal. It does not matter we did not invent them. We assemble them right here.The objective is to fly. Can you compete with that?\". For the founder of this modern republic, Mustafa Kemal, the fight to compete with that would be the real struggle from sparring to actual fight but for the present day Turkey you need to stop chasing your dreams and realize \"capital isn't enough,you've got to have contacts,associates, and community\" So kudos to Karatas and his team for this masterful re-examination of today's Turkey. As for the cast,acting and cinematography. The harmony between the old actors and the young ones blend it perfectly with the warm atmosphere of the movie. The chemistry between Atasoy and Dikinciler as husband and wife is laudable. The northwestern city Eskisehir, on the other hand, pleases the eyes with Porsuk River overlooking the fertile Phrygian Valley,with its fine architecture and aviation parks. The only that bored me in this movie was the technique of sequence shots because the movie just makes you feel that it's dragging at some points and when you realize that the runtime is no longer than two hours, you are just surprised, but I read that Bahadar Karatas used this technique so that the players would be allowed greater allowed. All in all, Usta is one of the best recent Turkish movies. It should have gotten a better box-office rating and it surely deserves more attention,especially from the local cinéastes.",
    "Director": "Bahadir Karatas",
    "Writer": "Ayfer Tunç, Bahadir Karatas",
    "Actors": "Yetkin Dikinciler, Fadik Sevin Atasoy, Sevket Çoruh",
    "Language": "Turkish",
    "Country": "Turkey",
    "Awards": "1 win & 3 nominations"
  },
  "relatedMovies": [
    "tt1446130",
    "tt1379199",
    "tt1257579",
    "tt1216496",
    "tt0971209",
    "tt1235124",
    "tt1220214",
    "tt1151359",
    "tt0838247",
    "tt1375790",
    "tt1235166",
    "tt1262981"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.887Z"
}