{
  "imdbId": "tt12935100",
  "title": "The Burning of Atlanta",
  "year": 2020,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0Q8_jdmLta4",
      "id": "0Q8_jdmLta4",
      "title": "The Burning of Atlanta | Full American History Drama Movie",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nThe Burning of Atlanta - is the story of the destruction of a major city near the end of the war, and the desperation and terror this causes in the lives of those who watch their entire society collapse around them.\n\n2020\nStars: Jezibell Anat, Gunner Bridger, Jerry Chesser \n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:46.799Z",
      "thumbnail": "https://i.ytimg.com/vi/0Q8_jdmLta4/maxresdefault.jpg",
      "duration": 4887,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "ID",
          "IN",
          "JM",
          "MY",
          "PH",
          "PK",
          "US",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "81 min",
    "imdbRating": 2.6,
    "imdbVotes": 126,
    "Genre": "Action, History",
    "Plot": "1864 After a huge battle and the brutal shelling of the population of Atlanta, Federal troops (\"Yanks\") take control of the city. Their plan is to use all of the goods remaining in the warehouse district of Atlanta to outfit their army for the upcoming March to the Sea, which they hope will end the War Between the States. Confederate spies move into the warehouse district, disguised as Yanks, to take stock of what is still there that might be of use to the army of the north. They find a lot. The word comes down from Confederate command to burn the entire district, destroying vast quantities of goods and uprooting hundreds of families that have been in the area for decades. \"The Burning of Atlanta\" is the story of the destruction of a major city near the end of the war, and the desperation and terror this causes in the lives of those who watch their entire society collapse around them.",
    "Director": "Christopher Forbes",
    "Writer": "Christopher Forbes",
    "Actors": "Jezibell Anat, Gunner Bridger, Jerry Chesser",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt14395688",
    "tt12484058",
    "tt15743386",
    "tt13374182",
    "tt9685652",
    "tt13186800",
    "tt19063544",
    "tt14111328",
    "tt6084202",
    "tt8667502",
    "tt10452224",
    "tt10622840"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:22:20.427Z"
}