{
  "movieId": "tt1213090",
  "title": "Lilas blanc",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-lilas-blanc",
      "id": "silent-lilas-blanc",
      "title": "Lilas blanc",
      "fileSize": 84744587,
      "addedAt": "2026-01-07T00:11:07.408Z",
      "thumbnail": "https://archive.org/services/img/silent-lilas-blanc",
      "language": "French",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 511
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "3 min",
    "imdbRating": 5.4,
    "imdbVotes": 131,
    "Genre": "Short, Music",
    "Plot": "I love films--particularly the older ones. I have seen hundreds, no perhaps thousands of silent films--including many of the really early ones by Edison, the Lumière Brothers and Georges Méliès--yet several shorts directed by Alice Guy absolutely blew me away tonight. I thought I knew a lot about the history of film--when suddenly several of Guy's films from 1905 and 1906 featured sound. Real, honest to goodness sound. The sound, of course, was not recorded on the film like later sound films but had the sound on an accompanying record that they tried to play in sync with the images. It was a primitive process, but the fact that they were working on it as early as 1905 shocked me. Yes, I knew about an experimental film Edison made with a guy and his violin at about 1897, but this was soon abandoned as impractical. I didn't know anyone was working on this in 1905--I thought the process was not picked up again until about 1920. What a shock.In this film, one of several Mr. Mayol did for Ms. Guy, he sings about white flowers. It's an amazing film historically and if you want to be really amazed, find Guy's and Mayol's \"Questions Indiscrètes\"--which is a sound film AND in color!!",
    "Director": "Alice Guy",
    "Writer": "N/A",
    "Actors": "Félix Mayol",
    "Language": "French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1213121",
    "tt1325742",
    "tt1649395",
    "tt3189794",
    "tt1649298",
    "tt1649361",
    "tt6668862",
    "tt1649369",
    "tt0262231",
    "tt1649316",
    "tt1649365",
    "tt1649367"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:07.408Z"
}