{
  "movieId": "tt1320236",
  "title": "Blind Revenge",
  "year": 2009,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3WAbGrbCLU0",
      "id": "3WAbGrbCLU0",
      "title": "Blind Revenge | Full Thriller Movie | Daryl Hannah",
      "description": "Blind Revenge - Sir Paul, a distinguished author, blinded in a horrific accident, advertises for an amanuensis, an assistant to help him with his writing. He employs the amiable Jane Ryder to be his eyes as he revisits scenes from his past and works on what he intends to be his final opus. Jane appears to be ideal: attractive, intelligent, unruffled by her employer's abrupt eccentricities. But, gradually, we come aware that Jane has another agenda. Incrementally, Sir Paul's familiar surroundings are altered. Strange things happen around the house and he becomes increasingly dependent on his new assistant. Jane plays increasingly sadistic games until their relationship breaks down.\n2009.  Stars: Tom Conti, Daryl Hannah, Miriam Margolyes\n**This film is under license from Vision Films Inc. All rights reserved**\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:58.414Z",
      "thumbnail": "https://i.ytimg.com/vi/3WAbGrbCLU0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAS0k5JYv-OLULKaM0OHuTd552JDw",
      "duration": 5249,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "TR"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "88 min",
    "imdbRating": 5.4,
    "imdbVotes": 1095,
    "Genre": "Mystery, Thriller",
    "Plot": "Sir Paul, a distinguished author, blinded in a horrific accident, advertises for an amanuensis, an assistant to help him with his writing. He employs the amiable Jane Ryder to be his eyes as he revisits scenes from his past and works on what he intends to be his final opus. Jane appears to be ideal: attractive, intelligent, unruffled by her employer's abrupt eccentricities. But, gradually, we come aware that Jane has another agenda. Incrementally, Sir Paul's familiar surroundings are altered. Strange things happen around the house and he becomes increasingly dependent on his new assistant. Jane plays increasingly sadistic games until their relationship breaks down...",
    "Director": "Raúl Ruiz",
    "Writer": "Gilbert Adair",
    "Actors": "Tom Conti, Daryl Hannah, Miriam Margolyes",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "2 nominations total"
  },
  "relatedMovies": [
    "tt0971209",
    "tt0838247",
    "tt1375790",
    "tt1521787",
    "tt1533114",
    "tt1176724",
    "tt1282156",
    "tt1014766",
    "tt1273235",
    "tt0893411",
    "tt0488604",
    "tt1046894"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:58:46.244Z"
}