{
  "imdbId": "tt1385591",
  "title": "Diamond Heist",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gj86_Eoci80",
      "id": "gj86_Eoci80",
      "title": "Magic Boys (Diamond Heist) | Full Movie | Michael Madsen | Vinnie Jones",
      "description": "Magic Boys (Diamond Heist) - After witnessing a murder, a hapless pair of misfits escape their own near death experience by posing as male strippers – only to find themselves neck deep in even bigger trouble.\n2012.  Stars: Michael Madsen, Vinnie Jones, Nikolett Barabas\n**Under non-exclusive license from Shoreline Entertainment.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:33.279Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/gj86_Eoci80/maxresdefault.webp",
      "duration": 5664,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AE",
          "AR",
          "AU",
          "BD",
          "BR",
          "CA",
          "GB",
          "IN",
          "LK",
          "MY",
          "NZ",
          "PE",
          "PH",
          "PK",
          "SA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "90 min",
    "imdbRating": 2.8,
    "imdbVotes": 624,
    "Genre": "Adventure, Comedy, Drama",
    "Plot": "When the world of male strippers and diamond smugglers collide the outcome is not what you'd expect. A comedy with European flair and gun-toting theatrics, 'Magic Boys' is chock-full of action and unremitting twists and turns. When two male strippers mysteriously disappear from outside his London club, Terence, a gruff and notorious diamond smuggler needs to find a replacement fast. His old colleague and former diamond man Jack Varga comes to the rescue offering up his own recruits, but as is to be expected, Varga has ulterior motives. Enter the two misfits, David and Zoli who have just lost their jobs at the champagne factory, now under the ownership of Jack Varga. Through a hapless series of events, David and Zoli find a handwritten contract employing the 'Magic Boys' for an irresistible sum of money. They arrive in London via private jet and soon realize the mess they've gotten themselves into: that the 'Magic Boys' are in fact male strippers. Meanwhile, Varga has kidnapped Terence's lovely courier Cherry and threatens to kill her unless she provides him with information on Terence's diamond smuggling activities. After a near death experience, Cherry strikes a deal with Varga and he lets her go. All the complex pieces fall into place at Terence's birthday bash, although much of the action literally happens behind the scenes. Neither Terence, nor Varga are aware that Cherry has brought them together to avenge the death of her father, himself a diamond merchant who was killed by a vicious competitor. Cherry has left it up to Terence and Varga to expose the identity of the killer.",
    "Director": "Róbert Koltai, Éva Gárdos",
    "Writer": "Ivo Marloh, Dénes Orosz, Róbert Koltai",
    "Actors": "Vinnie Jones, Michael Madsen, Kátya Tompos",
    "Language": "English, Hungarian",
    "Country": "Hungary, United Kingdom, Canada",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2838540",
    "tt1582465",
    "tt4364194",
    "tt0060584",
    "tt0008519",
    "tt0006357",
    "tt0311354",
    "tt0025639",
    "tt0040720",
    "tt0329531",
    "tt0014646",
    "tt1780983"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:17:40.217Z"
}