{
  "movieId": "tt1308729",
  "title": "Bullet to the Head",
  "year": 2012,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/THEHEAD",
      "id": "THEHEAD",
      "title": "THE HEAD",
      "description": "“A scientist invents a serum that keeps a dog's head alive after its body dies. When the scientist dies of a heart attack, his crazed assistant cuts off his head and, using the serum, keeps the doctor's head alive and forces it to help him on an experiment to give his hunchbacked nurse assistant a new body.”(imdb.com) Imaginatively titled for US release as “The Head,” this older German cousin of “The Brain That Wouldn’t Die” is also known as “Die Nackte und der Satan” (“The Naked and the Satan”).  Curiously, the two films share some aspects -- decapitation, a full-body transplant, strippers, a disembodied head that speaks without lungs, All dialogue is in dubbed English. My source was flat and gray, so I boosted the contrast a bit before uploading. Research by oldbones indicates this movie is PD.",
      "fileSize": 3289330209,
      "addedAt": "2026-01-07T00:06:58.270Z",
      "thumbnail": "https://archive.org/services/img/THEHEAD",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 22342
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "92 min",
    "imdbRating": 5.7,
    "imdbVotes": 53382,
    "Genre": "Action, Crime, Thriller",
    "Plot": "In New Orleans, hit men James Bonomo, a.k.a. Jimmy Bobo, and Louis Blanchard execute dirty cop Hank Greely in a hotel room. But they are betrayed and Louis is stabbed in a bar by a mercenary named Keegan while waiting for the payment of the contract. Meanwhile, Washington D.C. police detective Taylor Kwon comes to New Orleans to investigate the murder of Greely, who had stolen evidence from the New Orleans Police Department. Soon he is shot by two dirty detectives but Jimmy saves his life. Jimmy brings Taylor to the shop of his daughter Lisa and she removes the bullet from his shoulder and nurses him. Taylor and Jimmy form the most unlikely partnership to investigate the crimes and after contacting the intermediate Ronnie Earl that had hired Jimmy and Louis, they discover a network of corruption formed by the lawyer Marcus Baptiste and the entrepreneur Robert Nkomo Morel.",
    "Director": "Walter Hill",
    "Writer": "Alessandro Camon, Alexis Nolent, Colin Wilson",
    "Actors": "Sylvester Stallone, Jason Momoa, Christian Slater",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt0077474",
    "tt1329232",
    "tt2239096",
    "tt2240966",
    "tt1653700",
    "tt1027683",
    "tt1678051",
    "tt1675161",
    "tt3540136",
    "tt1269734",
    "tt3398252",
    "tt0817545"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:58.270Z"
}