{
  "imdbId": "tt1314248",
  "title": "Sea Beast",
  "year": 2008,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_fum5fULI0Q",
      "id": "_fum5fULI0Q",
      "title": "Sea Beast | FULL MOVIE | 2008 | Monster, Action, Horror",
      "description": "Sea Beast (2008) Full Movie\n\nCaptain Will McKenna and marine biologist Arden Jaymes discover why the fishing village of Cedar Bay is being depleted of its resources. What’s been devouring the fish in the sea has come ashore in search of something more substantial: human flesh. Now, as a massive storm hurls toward Cedar Bay, cutting off all outside help and contact, a mythical battle is waged between man and beast. Only Will and Arden can stop it before the creatures continue devouring Cedar Bay. And beyond.\n\nStarring:\nCorin Nemec, Camille Sullivan, Miriam McDonald, Daniel James Wisler, Gary Hudson, Gwynyth Walsh, Brent Stait\n\n2008\nDirected by Paul Ziller\n\nMORE Popcornflix MOVIES, FREE on YouTube!\r\n\r\n Action: https://bit.ly/2XC8pvv\r\n Romance: https://bit.ly/2NVnIQ2\r\n Horror: https://bit.ly/2LeNNaK\r\n Crime: https://bit.ly/2NK201z\r\n Drama: https://bit.ly/2G6Uasy\r\n Comedy:  https://bit.ly/2LPCNQD\r\n Western: https://bit.ly/2S7FRc4\r\n Popcornflix Channel page: https://bit.ly/2Saak9p\r\n\r\nWatch more free movies and TV series at Popcornflix.com, or on the Popcornflix app available on Roku, Amazon FireTV, iOS, Android, Chromecast, and AppleTV.\r\n\r\n#Popcornflix, Full length free movies and TV series.\r\nLike us on Facebook: https://www.facebook.com/Popcornflix\r\nFollow us on Twitter: https://twitter.com/Popcornflixnews\r\nPopcornflix is owned/operated by Screen Media Ventures",
      "addedAt": "2025-12-23T23:36:58.515Z",
      "thumbnail": "https://i.ytimg.com/vi/_fum5fULI0Q/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCcNB53VX9DCk92jGIkX4OV5R4zuQ",
      "duration": 5244,
      "language": "en",
      "channelName": "Popcornflix",
      "channelId": "UCVFYikepF-avelvuIaQ_lHA"
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "87 min",
    "imdbRating": 4.2,
    "imdbVotes": 1890,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "The fishing vessel Solita crosses a storm during the night and the Skipper Will McKenna witnesses a weird creature attacking the crewman Joey. They return to the dock and Will has difficulties to pay the amount he owes to the former owner of the boat, Roy. The fish population is reducing in the area and the biologist Arden is investigating the possible causes. Meanwhile, Will's daughter Carly steals the keys of her father's cottage in a nearby island and plans to travel with her boyfriend Danny and their friends Erin and Drew to spend the weekend in the island. However, Drew is murdered by a deep sea predator on the dock and his pieces are found by Will and Arden. Carly, Danny and Erin do not have any news from their friend and travel to the island without Drew. Sooner Erin is murdered by the creature and Danny is bitten by a newborn reptile. Danny and Erin seek shelter in the cabin but they are trapped there by the creatures. In the continent, Will and Arden learn that the deep sea predator is a very dangerous species, after a series of lethal attacks, and they head to the island to rescue Carly.",
    "Director": "Paul Ziller",
    "Writer": "Neil Elman, Paul Ziller",
    "Actors": "Corin Nemec, Miriam McDonald, Daniel Wisler",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0930072",
    "tt1272025",
    "tt1657284",
    "tt1478325",
    "tt1047544",
    "tt1887703",
    "tt1065092",
    "tt1350498",
    "tt0460912",
    "tt1319736",
    "tt1527823",
    "tt0994917"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:20:10.168Z"
}