{
  "imdbId": "tt13576174",
  "title": "Dokhtar",
  "year": 2018,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/REZAMIRKARIMIDOKHTAR",
      "id": "REZAMIRKARIMIDOKHTAR",
      "title": "REZA MIRKARIMI Daughter ( DOKHTAR)",
      "description": "Reza Mirkarimi's THE DAUGHTER (DOKHTAR) The strict and traditional Mr Azizi leads an uneventful family life in an oil town of southern Iran. Then one day, exasperated by her father’s authoritarianism, Setareh announces she is off to Tehran to say farewell to one of her best friends who is leaving Iran for good. Unfortunately, the engagement celebrations of Setareh’s younger sister are taking place simultaneously. Despite her father’s objections Setareh takes the plane for Tehran. This act of disobedience sets in motion a series of perturbations that upset the calm tranquility of the paterfamilias. In French Strict et conservateur, Monsieur Azizi mène une vie paisible avec sa petite famille dans une ville pétrolière du sud de l’Iran. Exaspérée par l’autoritarisme de son père, Setareh lui annonce son intention de partir à Téhéran pour participer aux adieux d’une de ses meilleures amies qui quitte définitivement l’Iran. Or le même jour auront lieu aussi les fiançailles de la petite sœur de Setareh. Malgré l’opposition de son père, Setareh prend l’avion en direction de Téhéran. Cette insoumission sera l’élément déclencheur d’une vague de perturbations bousculant l’équilibre paisible du pater familias. Festival debut: 38th Moscow International Film Festival, Russia. June 23-30, 2016. Main Competition section script MEHRAN KASHANI camera HAMID KHOZOUEI ABYANEH design MOHSEN SHAH EBRAHIMI music MOHAMMAD REZA ALIGHOLI sound BAHMAN ARDALAN, AMIR HOSEIN GHASEMI cast FARHAD ASLANI, MERILA ZAREI, MAHOUR ALVAND producer REZA MIRKARIMI production REZA MIRKARIMI, ARVAND FREE ZONE ORGANIZATION world sales DREAMLAB FILMS WWW.DREAMLABFILMS.COM  Iran  2016, 103'",
      "fileSize": 164303291,
      "addedAt": "2026-01-07T00:06:45.468Z",
      "thumbnail": "https://archive.org/services/img/REZAMIRKARIMIDOKHTAR",
      "collection": "feature_films",
      "downloads": 1324
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Short, Music",
    "Plot": "N/A",
    "Director": "Alin Bagheri",
    "Writer": "Alin Bagheri",
    "Actors": "Kalmast",
    "Language": "Persian",
    "Country": "Iran",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt11192518",
    "tt8312534",
    "tt10143506",
    "tt0279784",
    "tt8106846",
    "tt8549488",
    "tt0135630",
    "tt10186352",
    "tt0037792",
    "tt34677647",
    "tt1503085",
    "tt0017268"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.468Z"
}