{
  "imdbId": "tt1380196",
  "title": "The Sergeant",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-sergeant",
      "id": "silent-the-sergeant",
      "title": "The Sergeant",
      "fileSize": 417005729,
      "addedAt": "2026-01-07T00:11:24.924Z",
      "thumbnail": "https://archive.org/services/img/silent-the-sergeant",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 277
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "16 min",
    "imdbRating": 6.1,
    "imdbVotes": 62,
    "Genre": "Short, Western",
    "Plot": "A story laid in the Great Yosemite Valley during the eighties. Col. Westley has an only daughter who is the one softening influence in his rugged nature. She is fond of taking morning rides over the trails, and is usually accompanied by Robt. Adams, a sergeant at the post, and who is detailed by the father to look after her safety. The companionship of these young people soon ripens into love, and despite the disparity of the rank of Adams and his sweetheart's father, they plight their troth. At the opening of the story we see them riding away from the post. Upon arriving at Nevada Falls, a favorite spot, they leave their horses and proceed on foot in order that they may ascend to a more advantageous height from which to view the gorgeous scenery that surrounds the grand historical Yosemite Valley. While engaged in this pastime, an Indian renegade steals their horses, leaving them afoot many miles from the post. The evening is stealing upon them when they discover their loss and in their effort to follow the footprints of their horses they lose their way and are compelled to spend the night in the wilderness. The Colonel becoming alarmed, sends out a searching party that finally succeeds in finding the missing couple. Upon returning to the post the sergeant is placed under arrest, despite the pleading of his unhappy sweetheart. Now a lapse of n month occurs and we see a thrilling battle with the Indians, in which the Colonel, accompanied by his daughter, is cut off from the men and about to be taken by the redskins. It is at this time that Adams, only a private, shows his heroism by making a desperate dash through the lines of the enemy, rescuing the Colonel and his daughter from the murderous savages, though wounded almost to death. His recovery and promotion to 1st Lieutenant soon follow, and with the consent of the Colonel to his marriage with the lady of his choice, ends a pretty story of love, heroism and devotion to duty.",
    "Director": "Francis Boggs",
    "Writer": "Hobart Bosworth",
    "Actors": "Hobart Bosworth, Iva Shepard, Tom Santschi",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0001387",
    "tt0001351",
    "tt0300652",
    "tt0001613",
    "tt0000960",
    "tt0001013",
    "tt0001014",
    "tt0001896",
    "tt0359108",
    "tt0000904",
    "tt0001724",
    "tt0001925"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.924Z"
}