{
  "movieId": "tt1316458",
  "title": "The Escape on the Fast Freight",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheEscapeOnTheFastFreight",
      "id": "TheEscapeOnTheFastFreight",
      "title": "\"The Escape on the Fast Freight\" (1915) starring Helen Holmes",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   We have included this film in our program to illustrate the work and contributions of Helen Holmes, a star of Silent Hall of Fame. \"The Escape on the Fast Freight\" directed by Paul Hurst from a story by Edward T. Matlack, is a short action film from a serial by the name of \"The Hazards of Helen\" starring Helen Holmes.  This is episode 13 from a total of 119 weekly one reel films produced by Kalem, showing just how popular this serial was in 1914-1917.  The first 48 films starred Helen Holmes, the remaining 71 starred Helen Gibson.  They both played heroines that were independent and adventurous, resolving dangerous situations with quick thinking.  Their acting was very physical and they performed their often very dangerous stunts.  It is believed to be the longest film series in the silent era and one of the longest ever.  Very few of the films survive, and we are happy to  be able to show this rarity to our esteemed viewers. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 295853275,
      "addedAt": "2026-01-07T00:06:58.274Z",
      "thumbnail": "https://archive.org/services/img/TheEscapeOnTheFastFreight",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 2151
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-escape-on-the-fast-freight",
      "id": "silent-the-escape-on-the-fast-freight",
      "title": "The Escape on the Fast Freight",
      "fileSize": 279508889,
      "addedAt": "2026-01-07T00:11:15.975Z",
      "thumbnail": "https://archive.org/services/img/silent-the-escape-on-the-fast-freight",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 264
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "13 min",
    "imdbRating": 6.5,
    "imdbVotes": 81,
    "Genre": "Short, Thriller",
    "Plot": "Two yeggmen hold up Helen, on night duty at Ferndale, lock her in a closet, and escape. Later, standing on a bridge over the freight yards, Helen sees the two bandits aboard an outgoing freight, and drops onto the roof of the car from above as it crosses underneath. A chase along the roofs of the speeding cars ensues, all of the participants falling into the water as the freight crosses a river. The train is brought to a halt, Helen is rescued, the thieves are arrested, and Helen looks forward to next week's hazard.",
    "Director": "Paul Hurst",
    "Writer": "Edward T. Matlack",
    "Actors": "Helen Holmes, Leo D. Maloney, J. Gunnis Davis",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1488156",
    "tt1487926",
    "tt1316468",
    "tt1488145",
    "tt1488157",
    "tt0319903",
    "tt1534525",
    "tt1534533",
    "tt0437960",
    "tt0351988",
    "tt0002208",
    "tt0002553"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:15.975Z"
}