{
  "movieId": "tt1334226",
  "title": "Dead Man Drinking",
  "year": 2008,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DeadManDrinking",
      "id": "DeadManDrinking",
      "title": "Dead Man Drinking",
      "description": "Dead Man Drinking is a full-length independent feature-film released for free under a creative commons 3.0 license. A discussion by friends with long-winded histories and a love of drinking results in four of them running off to house-sit for a long weekend while playing Killer, a schoolyard game where each player has to \"take out\" targets over a period of time using everything from water pistols to bits of cardboard with \"sword\" written on them. As the game progresses and frustrations rise, sexual tensions surface and it’s obvious that with the possibility of only one winner, some people will do anything for victory. Who'll be the Dead Man Drinking? written & directed by Rohan Harris starring Jen Greiss, Peter Love, Hannah Moltoni and Kurtis Wakefield from the makers of Insecurity http://www.DeadManDrinking.com/ http://www.expectproblems.com/ WARNING: This film contains profanity and sexual references.",
      "fileSize": 7518615522,
      "addedAt": "2026-01-07T00:06:19.368Z",
      "thumbnail": "https://archive.org/services/img/DeadManDrinking",
      "language": "english",
      "year": 2008,
      "collection": "feature_films",
      "downloads": 113801
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "89 min",
    "imdbRating": 5.3,
    "imdbVotes": 24,
    "Genre": "Comedy",
    "Plot": "A discussion had by five friends results in four of them running off to house-sit for a long weekend while playing the game Killer, a schoolyard game where each player has to 'take out' targets over a period of time using everything from water pistols to bits of cardboard with 'sword' written on them. As the weekend progresses, tensions run higher as certain players become desperate to win - at any cost.",
    "Director": "Rohan Harris",
    "Writer": "Rohan Harris",
    "Actors": "Jen Greiss, Peter Love, Hannah Moltoni",
    "Language": "English",
    "Country": "Australia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1265599",
    "tt1172203",
    "tt0844671",
    "tt1308679",
    "tt1212399",
    "tt1037156",
    "tt1314248",
    "tt0430770",
    "tt1213644",
    "tt0944958",
    "tt1027658",
    "tt0907678"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.368Z"
}