{
  "imdbId": "tt1392998",
  "title": "Veiled Voices",
  "year": 2009,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/VeiledVoices2009",
      "title": "Veiled Voices (2009)",
      "description": "âThe film, the first of its kind...is not to be missed by any who wish to enter the world of contemporary Islam with its lively gender dynamics being refashioned under our very eyes.â â Margot Badran, author of Feminism in Islam: Secular and Religious Convergences Summary Women across the Arab world are redefining their role as leaders in Islam. Veiled Voices investigates the world of Muslim women religious leaders through the eyes of three women in Lebanon, Syria and Egypt. Filmed over the course of two years, Veiled Voices reveals a world rarely documented, exploring both the public and private worlds of these women. The stories featured in the film give insight into how Muslim women are now increasingly willing to challenge the status quo from within their religion, promoting Islam as a powerful force for positive transformation in the world. Each triumphs over difficult challenges as they carve out a space to leadâboth in Islam and in their communities. âI found myself being drawn into their lives and stories. The movie certainly offers a rare glimpse into the lives of Muslim women leaders. At times it surprised my own pre-conceived ideas about the women.â â Safiyyah Surtees, Muslima Media Watch Director Brigid Maher is a film and media arts professor at American University and an award-winning filmmaker. Her inspiration for Veiled Voices came while teaching broadcast media in Lebanon in 2005 on a Fulbright award. Maher traveled to Lebanon, Syria and Egypt to film, following the lives of the three sheikhas as they seek to carve out a space to lead in Islam and their communities. Her intimate portraits of these women provide a launching point for intellectual discussion among both Muslims and non-Muslims about the evolving role of women in religion. Maher's films, which have been shown at festivals around the world, often examine themes of cultural identity and discrimination.",
      "fileSize": 25068200,
      "id": "VeiledVoices2009"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "58 min",
    "imdbRating": 7.1,
    "imdbVotes": 7,
    "Genre": "Documentary",
    "Plot": "Veiled Voices is an hour long documentary that introduces the American audience to the world of Muslim women religious leaders, women who are reviving their leadership role in Islam across ...",
    "Director": "Brigid Maher",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English, Arabic",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt1543506",
      "title": "Misha Versus Moscow: The Battle for Georgia's Future",
      "year": 2009,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt8508676",
      "title": "Swansea Love Story",
      "year": 2010,
      "imdbRating": 6.8,
      "imdbVotes": 34,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1972567",
      "title": "217",
      "year": 2010,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2630684",
      "title": "Neanderthal Code",
      "year": 2008,
      "imdbRating": 7.8,
      "imdbVotes": 9,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt5584636",
      "title": "Günter Wallraff undercover - Wo Arbeit weh tut - Dokumentation",
      "year": 2008,
      "language": "German",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt4077512",
      "title": "Dog Lover",
      "year": 2010,
      "language": "Bosnian",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt1810688",
      "title": "Luke Forward: Arizona Wants the F-35 Joint Strike Force Fighter",
      "year": 2010,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt27001610",
      "title": "Darband",
      "year": 2007,
      "language": "Persian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2083126",
      "title": "311",
      "year": 2011,
      "imdbRating": 6.8,
      "imdbVotes": 20,
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1699673",
      "title": "More Than Meets the Eye",
      "year": 2011,
      "language": "English",
      "sourceType": "youtube",
      "channelName": "FilmRise Movies"
    },
    {
      "imdbId": "tt1475191",
      "title": "American Radical: The Trials of Norman Finkelstein",
      "year": 2009,
      "imdbRating": 7.8,
      "imdbVotes": 833,
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1674181",
      "title": "Eng",
      "year": 2009,
      "language": "German",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.887Z"
}