{
  "movieId": "tt1325742",
  "title": "Five O'Clock Tea",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-five-oclock-tea",
      "id": "silent-five-oclock-tea",
      "title": "Five O'Clock Tea",
      "fileSize": 57976687,
      "addedAt": "2026-01-07T00:10:59.117Z",
      "thumbnail": "https://archive.org/services/img/silent-five-oclock-tea",
      "year": 1905,
      "collection": "feature_films",
      "downloads": 577
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "3 min",
    "imdbRating": 5.2,
    "imdbVotes": 165,
    "Genre": "Short, Music",
    "Plot": "Dranem sings and dances to his music hall hit in this early sound film.It often comes as a surprise even to well informed film fans like the other reviewer that there were sound films this early. Yet Edison spoke about his plans to meld his sound-cylinders with movies, even before there were any commercial movies. Dickson can be seen in a sound film in 1895, playing the violin while two men dance. There were several sound films around the turn of the century, although those died off quickly. This series was one of several sets in at least four countries (Germany, England, where Hepworth produced 'Vivaphone' shorts, and in America, Edison did about fifteen of the, in 1914, under the label of 'Kinetophone'). The impulse died out with the rise of the First World War, not to be revived until the 1920s.Why? Technical issues like a lack of good recording equipment and loudspeakers, mostly, and the cost and just general difficulty of synchronizing sound and motion. In the meantime, this and others survive.",
    "Director": "Alice Guy",
    "Writer": "N/A",
    "Actors": "Dranem",
    "Language": "N/A",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1213121",
    "tt1213090",
    "tt1649395",
    "tt3189794",
    "tt1649298",
    "tt1649361",
    "tt6668862",
    "tt1649369",
    "tt0262231",
    "tt1649316",
    "tt1649365",
    "tt1649367"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.117Z"
}