{
  "imdbId": "tt1441912",
  "title": "The Way",
  "year": 2010,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h9pFyZM409I",
      "id": "h9pFyZM409I",
      "title": "Life Gets In The Way | Full Romantic Comedy Movie",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nLife Gets In The Way - A woman tries to pick up the pieces of a broken past and struggles with an unstable present in the big city of Los Angeles, where serious relationships are hard to find.\n\n2014\nStars: Donna Mills, Julie Sabray, Geoff Reeves\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:02.994Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/h9pFyZM409I/maxresdefault.webp",
      "duration": 4999,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "ID",
          "IN",
          "JM",
          "MY",
          "PH",
          "PK",
          "US",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "123 min",
    "imdbRating": 7.3,
    "imdbVotes": 37513,
    "Genre": "Comedy, Drama",
    "Plot": "\"The Way\" is a powerful and inspirational story about family, friends and the challenges we face while navigating this ever-changing and complicated world. Martin Sheen plays Tom, an American doctor who comes to St. Jean Pied de Port, France to collect the remains of his adult son (played by Emilio Estevez), killed in the Pyrenees in a storm while walking the Camino de Santiago, also known as The Way of Saint James. Rather than return home, Tom decides to embark on the historical pilgrimage to honor his son's desire to finish the journey. What Tom doesn't plan on is the profound impact the journey will have on him and his \"California Bubble Life\". Inexperienced as a trekker, Tom soon discovers that he will not be alone on this journey. On his journey, Tom meets other pilgrims from around the world, each with their own issues and looking for greater meaning in their lives: a Dutchman (Yorick van Wageningen), a Canadian (Deborah Kara Unger) and an Irish writer (James Nesbitt), who is suffering from a bout of writer's block. From the unexpected and, often times, amusing experiences along the way, this unlikely quartet of misfits creates an everlasting bond and Tom begins to learn what it means to be a citizen of the world again. Through Tom's unresolved relationship with his son, he discovers the difference between \"the life we live and the life we choose\".",
    "Director": "Emilio Estevez",
    "Writer": "Emilio Estevez, Jack Hitt",
    "Actors": "Martin Sheen, Emilio Estevez, Deborah Kara Unger",
    "Language": "English, Spanish, French, Catalan, Italian",
    "Country": "Spain, United States",
    "Awards": "1 win & 8 nominations total"
  },
  "relatedMovies": [
    "tt1341167",
    "tt1400335",
    "tt1305008",
    "tt1581787",
    "tt1401607",
    "tt1220888",
    "tt1083448",
    "tt1151359",
    "tt1262981",
    "tt1187044",
    "tt1577038",
    "tt1519663"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:40.056Z"
}