{
  "movieId": "tt1422757",
  "title": "Steal This Film",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/STEAL_THIS_FILM",
      "id": "STEAL_THIS_FILM",
      "title": "STEAL THIS FILM",
      "description": "In 2006, a group of friends decided to make a film about filesharing that we would recognise. There have been a few documentaries by 'old media' crews who don't understand the net and see peer-to-peer organisation as a threat to their livelihoods. They have no reason to represent the filesharing movement positively, and no capacity to represent it lucidly. We wanted to make a film that would explore this huge popular movement in a way that excited us, engaged us, and most importantly, focussed on what we know to be the positive and optimistic vision many filesharers and artists (they are often one) have for the future of creativity. Hopefully you'll enjoy the first part of STEAL THIS FILM ('Stockholm, Summer 2006'). It achieves some, but by no means all, of our goals. To continue we need your help. This film is free for you to share, watch on your DVD player or on your iPod, or show in cinemas. But if you like the work we've done and want us to carry on, use our donate link to send us a couple of dollars or euros. We will start making the second part straight away, and release it on www.stealthisfilm.com and on major BitTorrent trackers, when it's done. Each part, we estimate, will take about 2 months to complete. The plan for the second part is on this wiki. Feel free to add suggestions. The League Of Noble Peers August 2006 À nous la liberté!",
      "fileSize": 846965445,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/STEAL_THIS_FILM",
      "language": "English",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 73590
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "32 min",
    "imdbRating": 7,
    "imdbVotes": 489,
    "Genre": "Documentary, Short",
    "Plot": "Steal This Film is part one of a series, documenting the movement against intellectual property produced by The League of Noble Peers and released via the BitTorrent peer-to-peer protocol.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Peter Sunde, Gottfrid Svartholm, Aaron Swartz",
    "Language": "English, Swedish",
    "Country": "United Kingdom, Germany, Sweden",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1422758",
    "tt0479676",
    "tt0856228",
    "tt2008667",
    "tt9459600",
    "tt0000537",
    "tt0178247",
    "tt0334912",
    "tt3100486",
    "tt0178309",
    "tt0178981",
    "tt1515754"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}