{
  "imdbId": "tt1488157",
  "title": "The Wrong Train Order",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheWrongTrainOrder",
      "id": "TheWrongTrainOrder",
      "title": "\"The Wrong Train Order\" (1915) starring Helen Gibson",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   We have included this film in our program to illustrate the work and contributions of our star Helen Gibson. Let's all give our thanks to Larry Telles for making this film available to the public. Larry authored a book on the life of Helen Gibson. \"The Wrong Train Order\" is a short action drama from a serial by the name of \"The Hazards of Helen\", featuring Helen Gibson. This is episode 58 from a total of 119 weekly one reel films produced by Kalem, showing just how popular this serial was in 1914-1917. The first 48 films starred Helen Holmes, the remaining 71 starred Helen Gibson. They both played heroines that were independent and adventurous, resolving dangerous situations with quick thinking. Their acting was very physical and they performed their often very dangerous stunts. It is believed to be the longest film series in the silent era and one of the longest ever. The film is directed by James Davis from a story by Edward T. Matlack. In this episode everything goes wrong. Helen ends up on the rear observation deck of a runaway express train with the door to the inside closed, with the air-brake of the engine damaged, the engine itself full of steam and inaccessible, and the train speeding ahead on the wrong track. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 251039858,
      "addedAt": "2026-01-07T00:07:11.885Z",
      "thumbnail": "https://archive.org/services/img/TheWrongTrainOrder",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 2210
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-the-wrong-train-order",
      "id": "silent-the-wrong-train-order",
      "title": "The Wrong Train Order",
      "fileSize": 238824802,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-the-wrong-train-order",
      "language": "English",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 336
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "14 min",
    "imdbRating": 6.4,
    "imdbVotes": 28,
    "Genre": "Short, Thriller",
    "Plot": "Word that his son Jerry has been injured so upsets Torney that he delivers the wrong train orders to the engineer of the freight. Helen, having missed the Limited, accepts the invitation issued by the conductor of the freight and climbs aboard the caboose. Airbrake trouble develops while the train is speeding westward. In their effort to get at the seat of the trouble, both engineer and fireman are hurled to the ground. In the meantime, Torney has discovered his error. 'Phoning ahead, he frantically orders the operator at the Arling station to flag the freight. The runaway dashes past Arling, however, and Helen, seeing the operator vainly signaling, senses something amiss. Unable to operate the brake, the girl climbs to the roof of the train and fights her way forward atop the lurching cars. The Melius drawbridge is raised as the runaway approaches, but the tender, taking in the situation, lowers the structure barely in time to save the freight from plunging into the stream. Crossing the bridge, the runaway bears down upon a freight standing on the track ahead. As Helen climbs out on the pilot, a trackwalker throws open a siding switch, and thus averts a wreck. By this time, Helen has reached the emergency. Applying the air, the girl brings the runaway to a halt.",
    "Director": "J. Gunnis Davis",
    "Writer": "Edward T. Matlack",
    "Actors": "Helen Gibson, Robyn Adair, Clarence Burton",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1534533",
    "tt1534525",
    "tt1488156",
    "tt1487926",
    "tt1316458",
    "tt1316468",
    "tt1488145",
    "tt0319903",
    "tt0437960",
    "tt0002208",
    "tt0002553",
    "tt0005482"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}