{
  "imdbId": "tt14776558",
  "title": "Charles Beaumont Scripts - The Intruder (1962) (Live)",
  "year": 1962,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-intruder-1962-720p-blu-ray",
      "id": "the-intruder-1962-720p-blu-ray",
      "title": "The Intruder 1962: William Shatner [1:23:06] 720p Blu Ray",
      "description": "The Intruder AKA I Hate Your Guts, Shame and The Stranger (UK title) was not only Roger Corman's most daring and unusual film, but a unique movie in the history of cinema, as one of the few theatrical feature films to deal with school desegregation in the South.  William Shatner gives the performance of a lifetime as Adam Cramer, a sly, rabble-rousing racist who travels the South in the wake of the Supreme Court's Brown vs. Board of Education decision. Fomenting protests and riots and organizing white citizens groups with himself at their head.  Quietly soft-spoken and boldly charismatic Cramer arrives in a small town where the local white high school is about to get its first black students and manipulates the men, women, and students around him. Quietly taking control of the debate and the agenda, and turning a tense situation into a riot. He's opposed by a local newspaper editor who pays a terrible price for his thoughtful and reasonable nature. In the end, after maiming one man and nearly killing another. Cramer is stopped when he is exposed for what he is,  a weak and pathetic man when confronted directly. The film was shot on-location in the South despite the active opposition of local authorities and threats from members of the Ku Klux Klan. Once finished, Corman discovered that there was hardly a theater anywhere in America that was willing to play it, because the movie's subject was so incendiary. Thus, The Intruder became just about the only movie Corman ever made that lost money, and was much more widely seen in Europe, where it was greeted simply as a bold, unusual, and well-made film. Cast: William Shatner as Adam Cramer Frank Maxwell as Tom McDaniel Beverly Lunsford as Ella McDaniel Robert Emhardt as Verne Shipman Leo Gordon as Sam Griffin Charles Barnes as Joey Greene Charles Beaumont as Mr. Paton Katherine Smith as Ruth McDaniel George Clayton Johnson as Phil West William F. Nolan as Bart Carey Jeanne Cooper as Vi Griffin Phoebe Rowe as Mrs. Lambert Production: Directed by Roger Corman Screenplay by Charles Beaumont Based on The Intruder 1959 Novel by Charles Beaumont Produced by Roger Corman Cinematography Taylor Byars Edited by Ronald Sinclair Music by Herman Stein Production company Los Altos Productions Distributed by Pathé-America Distribution Company Cinema Distributors of America Shooting Location: It was shot in black and white over three and a half weeks on location in southeast Missouri. Some of the production took place in East Prairie, Charleston and Sikeston. Corman presented a watered-down version of the script to the townspeople, but they still did not like it. Before it was finished, local people objected to the film's portrayal of racism and segregation.",
      "fileSize": 805490821,
      "addedAt": "2026-01-07T00:12:10.588Z",
      "thumbnail": "https://archive.org/services/img/the-intruder-1962-720p-blu-ray",
      "language": "eng",
      "year": 1962,
      "collection": "feature_films",
      "downloads": 2908
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Comedy",
    "Plot": "N/A",
    "Director": "Phoenix West",
    "Writer": "Frank Linkz, Richard Pires, Phoenix West",
    "Actors": "Frank Linkz, Richard Pires, Phoenix West",
    "Language": "N/A",
    "Country": "N/A",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt15171376",
    "tt0055946",
    "tt0056026",
    "tt0056307",
    "tt0056692",
    "tt0056693",
    "tt0056325",
    "tt0055831",
    "tt0198388",
    "tt0168710",
    "tt0198696",
    "tt0056066"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:10.588Z"
}