{
  "movieId": "tt1404386",
  "title": "An Insignificant Harvey",
  "year": 2011,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/an-insignificant-harvey-2011-vodrip-xvid",
      "id": "an-insignificant-harvey-2011-vodrip-xvid",
      "title": "An Insignificant Harvey",
      "description": "A janitor at a small town ski resort, who also happens to be a little person, has his life dramatically change when he finds a stray husky and falls for an exotic dancer.",
      "fileSize": 1634491932,
      "addedAt": "2026-01-07T00:07:24.999Z",
      "thumbnail": "https://archive.org/services/img/an-insignificant-harvey-2011-vodrip-xvid",
      "language": "eng",
      "year": 2011,
      "collection": "feature_films",
      "downloads": 48
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "79 min",
    "imdbRating": 6.4,
    "imdbVotes": 660,
    "Genre": "Drama",
    "Plot": "Harvey Lippe' works as a janitor at a small ski resort in the peculiar Northern community of WhiteFox. Standing three feet four inches and abandoned at an orphanage as a child, he has grown up angry and miserable. Now in his early twenties he lives like a hermit in a small trailer, his only friend being Lucas Harold, the town drug dealer. Lucas attended the orphanage for several months before being adopted and subsequently moved to several fosters homes. He is rough around the edges, but has a big heart and a perspective few people give home credit for. Every evening Harvey walks the same route from his trailer, several miles through farmer's fields and hillside forest to get to work. But on this day he has a run in with a stray husky, which he at first thinks is a wolf. She follows him and that night he reluctantly allows her inside his trailer. Through her he meets Dakota Dixon, a dancer at a bizarre local strip joint. Dakota, Lucas, and Inca (as Harvey names her) develop into something Harvey has never had before, a family. Dakota and himself grow close and their relationship becomes intimate. Just when Harvey thinks his life may be worth living Dakota turns on him and Inca is almost killed in a snowmobile accident. He must pull himself together and decide what is worth fighting for, which is where his true story begins.",
    "Director": "Jeff Kopas",
    "Writer": "Jeff Kopas",
    "Actors": "Jordan Prentice, Kristin Adams, Steven McCarthy",
    "Language": "English",
    "Country": "Canada",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2094146",
    "tt1774428",
    "tt1880353",
    "tt2836316",
    "tt1083448",
    "tt0448022",
    "tt1552192",
    "tt2148928",
    "tt1743378",
    "tt1525836",
    "tt1628039",
    "tt1701218"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.999Z"
}