{
  "imdbId": "tt1475191",
  "title": "American Radical: The Trials of Norman Finkelstein",
  "year": 2009,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AmericanRadicalTheTrialsOfNormanFinkelstein2009",
      "title": "American Radical: The Trials of Norman Finkelstein (2009)",
      "description": "American Radical: The Trials of Norman Finkelstein (2009) Directed by: David Ridgen & Nicolas Rossier Music by: Judd Greenstein Country: Canada | USA | Israel | Lebanon | Occupied Palestinian Territory Language: English Color: Color Runtime: 84 min Released: 2009 Genre: Documentary \"A cautiously respectful documentary portrait of a political firebrand who presents himself as a beacon of moral truth in the murk of the Israeli-Palestinian conflict.\" âNew York Times \"A compelling portrait of a difficult man.\" âJewish Daily Forward \"American Radical is a nuanced and powerful portrait of the scholar Norman Finkelstien, one of the nation's most courageous and embattled intellectuals. It is a reminder that mendacity and timidity, when in the service of conventional beliefs, are more highly prized in most universities that truth. It illustrates that those who unmask the lies of the intellectual elite swiftly become their victims. The power and subtext of this film, however, is not in the wars fought between Finkelstien and those like Alan Dershowitz who seek to destroy him, but in Finkelstein's powerful fealty to his mother's suffering in the Warsaw Ghetto and later the Nazi death camps. Finkelstein sees in all who are oppressed his mother's degradation and pain. This is a movie that is, at its core, about the unshakable bond of love between a parent and a true and faithful son who refuses to forget or compromise.\" -- Chris Hedges, former New York Times War & Middle East Correspondent and author of \"American Fascists\" * * * A devoted son of Holocaust survivors and ardent critic of Israeli foreign policy, the polarizing American political scientist and author Norman Finkelstein has been called a lunatic and self-hating Jew by some, and an inspirational revolutionary by others. Exploring the deeply complex issues at the heart of the Palestinian-Israeli conflict, American Radical is the insightful and enraging documentary that follows Finkelstein around the world as he attempts to negotiate a voice among his impassioned critics and supporters. Uncompromising even in the face of his recent denial of tenure at DePaul University, Finkelstein is revealed as a complex and supremely lonely figure whose self-destructive nature often undermines his academic credibility. A guaranteed argument starter, this potent documentary plunges viewers into the psychological and intellectual underpinnings of a vitriolic personality. In a scene from American Radical, Norman Finkelstein and Alan Dershowitz debate at the studio of Democracy Now!. More films created by David Ridgen & Nicolas Rossier",
      "id": "AmericanRadicalTheTrialsOfNormanFinkelstein2009"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "84 min",
    "imdbRating": "7.8",
    "imdbVotes": "833",
    "Genre": "Documentary, Biography, History",
    "Plot": "A devoted son of Holocaust survivors and ardent critic of Israeli foreign policy, the polarizing American political scientist and author Norman Finkelstein has been called a lunatic and self-hating Jew by some, and an inspirational revolutionary by others. Exploring the deeply complex issues at the heart of the Palestinian-Israeli conflict, American Radical is the insightful and enraging documentary that follows Finkelstein around the world as he attempts to negotiate a voice among impassioned critics and supporters. Uncompromising even in the face of his recent denial of tenure at DePaul University, Finkelstein is a complex and supremely lonely figure whose self-destructive nature often undermines his academic credibility. A guaranteed argument starter, this potent documentary plunges viewers into the psychological and intellectual underpinnings of a vitriolic personality.",
    "Director": "David Ridgen, Nicolas Rossier",
    "Writer": "David Ridgen, Nicolas Rossier",
    "Actors": "Musa Abu-Hashhash, Nidal Barham, Noam Chomsky",
    "Language": "English",
    "Country": "United States, Canada, Occupied Palestinian Territory, Israel, Lebanon",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    {
      "imdbId": "tt3123418",
      "title": "Bizarre: A Circus Story",
      "year": 2016,
      "imdbRating": "N/A",
      "imdbVotes": "8",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0499562",
      "title": "The Secret Life of Adolf Hitler",
      "year": 1958,
      "imdbRating": "6.3",
      "imdbVotes": "137",
      "language": "English, German",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1457738",
      "title": "Building 173",
      "year": 2009,
      "imdbRating": "8.1",
      "imdbVotes": "41",
      "language": "English, Mandarin",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1352822",
      "title": "575 Castro St.",
      "year": 2009,
      "imdbRating": "6.2",
      "imdbVotes": "91",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0112631",
      "title": "Carl Th. Dreyer: My Métier",
      "year": 1995,
      "imdbRating": "6.7",
      "imdbVotes": "523",
      "language": "Danish, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1185616",
      "title": "Waltz with Bashir",
      "year": 2008,
      "imdbRating": "8.0",
      "imdbVotes": "61,713",
      "language": "Hebrew, Arabic, German, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1332128",
      "title": "Zeitgeist: Addendum",
      "year": 2008,
      "imdbRating": "8.2",
      "imdbVotes": "17,980",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1166827",
      "title": "Zeitgeist",
      "year": 2007,
      "imdbRating": "8.1",
      "imdbVotes": "48,342",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2296619",
      "title": "804",
      "year": 2011,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1935826",
      "title": "Into the Fire",
      "year": 2011,
      "imdbRating": "7.8",
      "imdbVotes": "84",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0911010",
      "title": "White Light/Black Rain: The Destruction of Hiroshima and Nagasaki",
      "year": 2007,
      "imdbRating": "8.2",
      "imdbVotes": "2,404",
      "language": "English, Japanese, Korean",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt0775438",
      "title": "Buy the Ticket, Take the Ride: Hunter S. Thompson on Film",
      "year": 2006,
      "imdbRating": "7.1",
      "imdbVotes": "1,168",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}