{
  "imdbId": "tt1487926",
  "title": "In Danger's Path",
  "year": 1915,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/InDangersPathEpisode33",
      "id": "InDangersPathEpisode33",
      "title": "\"In Danger's Path\" (1915) starring Helen Holmes",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     We have included this film in our program to illustrate the work and contributions of our star Helen Holmes.  \"In Danger's Path\" directed by J.P. McGowan from a story by Edward T. Matlack, is a short action film from a serial by the name of \"The Hazards of Helen\" starring Helen Holmes.  This is episode 33 from a total of 119 weekly one reel films produced by Kalem, showing just how popular this serial was in 1914-1917.  The first 48 films starred Helen Holmes, the remaining 71 starred Helen Gibson.  They both played heroines that were independent and adventurous, resolving dangerous situations with quick thinking.  Their acting was very physical and they performed their often very dangerous stunts.  It is believed to be the longest film series in the silent era and one of the longest ever.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 15433869,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/InDangersPathEpisode33",
      "year": 1915,
      "collection": "feature_films",
      "downloads": 3316
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "12 min",
    "imdbRating": 5.7,
    "imdbVotes": 37,
    "Genre": "Short, Thriller",
    "Plot": "\"Spud\" Doyle and \"Chicago\" Tim escape from Warren near Hobart Tower. Giving Helen a description of the men, Warren requests her to watch for them. Helen sees the two on the following evening and wires word of their presence. The crooks, guessing her intention, jump aboard a freight train lying on the siding. Helen decides to go home on the freight. The relief operator gives her a train order fixing the meeting point between the freight and an extra, requesting her to hand it to the trainmen. The yeggmen see her about to get on the train. Fearing Helen will betray them, the crooks make her a prisoner and throw her into an empty refrigerator car. The thought of what must happen if the train orders are not delivered makes Helen desperate. Using one of the meat hooks, she chops her way into the ice chamber and reaches the car top. Upon reaching the open, she recognizes the crossing which the freight is approaching as the meeting point. Running forward, she warns the engineer. The freight is halted in time to avert a crash. The crooks leap from the train and flee. The following evening, Helen and Warren meet the yeggmen. The latter defeat the detective after locking Helen in a shanty. Later, the telegrapher and Warren locate \"Spud\" and \"Chicago\" near the turntable. In the fight which ensues, the men tumble into the pit just as the yardmen, unaware of what is taking place, begin turning a big mogul. Helen rushes across the turntable to the motor house and shuts off the power just in time to save the helpless trio from being crushed to death. The yardmen appear upon the scene and rescue the combatants. The crooks are placed under arrest.",
    "Director": "J.P. McGowan",
    "Writer": "Edward T. Matlack",
    "Actors": "Helen Holmes, Leo D. Maloney, M.J. Murchison",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1488156",
    "tt1316468",
    "tt1488145",
    "tt1316458",
    "tt0351988",
    "tt0003755",
    "tt1488157",
    "tt0319903",
    "tt1534525",
    "tt1534533",
    "tt0437960",
    "tt0018654"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}