{
  "imdbId": "tt1452522",
  "title": "Die Hermannschlacht",
  "year": 1924,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-die-hermannschlacht",
      "id": "silent-die-hermannschlacht",
      "title": "Die Hermannschlacht",
      "fileSize": 1155515827,
      "addedAt": "2026-01-07T00:10:59.116Z",
      "thumbnail": "https://archive.org/services/img/silent-die-hermannschlacht",
      "year": 1924,
      "collection": "feature_films",
      "downloads": 316
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "54 min",
    "imdbRating": 5.3,
    "imdbVotes": 29,
    "Genre": "Drama, History, War",
    "Plot": "Deutschland is under the power of Rome; the heartless Empire, ever in need of new conquests, is merciless and its legions pillage and sack throughout the land with deep Gallic hatred. Hermann, son of the Cherusci prince Segimer, is a hostage at the service of Rome and has been given the name of \"Armin.\" Ultimately, he will lead an army of his countrymen and drive out the Roman tyrants.\"Die Hermannschlacht\", directed by Herr Leo König in the silent year of 1924, is a classical Teutonic silent film in its concepts and idiosyncrasies, It contains many of the elements that a genuine German count likes very much: exaggerated Teutonic myths and habits ( for example, how Germans invented euthanasia which, in those old says, consisted of throwing yourself down a hill when the end is near-a trifling matter when you know Walhalla awaits ), angry Gotts, epic nationalism and rude bearded Germans warriors wearing fur costumes with matching helmets with horns or wings ( fashionable ancient modes). The Romans may be the villains of the film but at the time of the film's release, German audiences would be thinking about the French occupation of the Ruhr area. It must be said that Herr König, in order to depict those ancient times in \"Die Hermannschlacht\", made accordingly a film that, in artistic aspects, seems as primitive as the Cherusci tribes. Of course there are problems within the German tribes including traitors, collaboration with the enemy and divided families but any genuine Teutonic will find the film his cup of tea (well, the Germans prefer a jar of schnapps )as the story is about his ancestors and will enlighten those unfortunates who are not Teutonic. The actors playing those rude old Germans do so in a very histrionic manner and sometimes the film sees older than the Cherusci tribes?\"Die Hemannschlacht\" was old fashioned even at the time when it was made, and today it seems deliciously kitsch but it's a unique and genuine primitive Teutonic silent, ja wohl!.And now, if you'll allow me, I must temporarily take my leave because this German Count must free one rich and fat heiress from her corset.Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com",
    "Director": "Leo König",
    "Writer": "Leo König",
    "Actors": "Antonie Jaeckel, Harry Liedtke, Mia Pankau",
    "Language": "None",
    "Country": "Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0014672",
    "tt0013741",
    "tt0092978",
    "tt0057811",
    "tt0044400",
    "tt0227607",
    "tt0159476",
    "tt0043590",
    "tt0035958",
    "tt0046029",
    "tt0014854",
    "tt0015022"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.116Z"
}