{
  "movieId": "tt14277840",
  "title": "Black Easter",
  "year": 2021,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IUkeQM_QsCA",
      "id": "IUkeQM_QsCA",
      "title": "Black Easter: Assassin 33 A.D. | Directors Cut | Full Movie | Action Sci-Fi",
      "description": "Black Easter - While doing research, a group of young geniuses accidentally stumble upon a secret terrorist plot to create a time machine to go back in time and change history.\n**Under non-exclusive license from Level 33 Entertainment.  All rights reserved**\n2017.  Stars: Derek Ting, Marikah Cunningham, Eric Keitel\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:44:41.746Z",
      "thumbnail": "https://i.ytimg.com/vi/IUkeQM_QsCA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDRUBgduz5JqRxGJlyENNw6WTvobg",
      "duration": 6837,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "113 min",
    "imdbRating": 3.2,
    "imdbVotes": 1055,
    "Genre": "Action, Adventure, Drama",
    "Plot": "Ram Goldstein and three of the world's top geniuses are commissioned to compete against other elite scientists in a race to create the first matter transfer machine. Ahmed Amir is financing the program at his technology institute. While engineering the project, Ram discovers time travel. However, he also uncovers that the institute is a shield for an extreme terrorist group with the intentions of using the technology as a weapon. Ram's friends are held hostage and he is forced to complete the machine. Meanwhile, Ahmed makes plans to travel back in time to kill Jesus and prevent the resurrection. Before Ram can escape, Ahmed hijacks the machine and sends a military team, led by Brandt, to kill Jesus. Their interference causes all hell breaks loose and mankind is thrown into an apocalypse. With no time to spare, only a genius with no faith and a man who lost his hold the fate of the world in their hands.",
    "Director": "Jim Carroll",
    "Writer": "Jim Carroll",
    "Actors": "Jordyn Barrera, Christina Birdsong, Donny Boaz",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt15743386",
    "tt13156466",
    "tt6916348",
    "tt10309088",
    "tt10305328",
    "tt4951982",
    "tt4743226",
    "tt3956336",
    "tt6083388",
    "tt7108074",
    "tt6065046",
    "tt7204400"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:55:15.247Z"
}