{
  "movieId": "tt1546651",
  "title": "Da' Booty Shop",
  "year": 2009,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=heMoYAdgXFc",
      "id": "heMoYAdgXFc",
      "title": "Da Booty Shop | Full Comedy Drama Movie | Nancy Bellany",
      "description": "**This film is under non-exclusive license from MVD Entertainment Group. All rights received** \n\nDa Booty Shop - Tyrone Johnson is in jail. As a result his sister Yolanda, an exotic dancer, inherits Tyrone's struggling hair salon business. She first sees the shop as a burden and waste of her time and puts the shop up for sale. But Yolanda eventually sees that the beauty biz could be a better future than the stripping biz, and changes her mind, angering the buyer, who retaliates with a vengeance. Yolanda decides to get her exotic dancing girlfriends together in order to keep the shop open... with a twist.\n\n2009\nStars: Nancy Bellany, Jemal David, Taleia Gilliam\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:09:52.066Z",
      "thumbnail": "https://i.ytimg.com/vi/heMoYAdgXFc/maxresdefault.jpg",
      "duration": 4975,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "86 min",
    "imdbRating": 2.9,
    "imdbVotes": 36,
    "Genre": "Comedy",
    "Plot": "Tyrone Johnson is in jail. As a result his sister Yolanda, an exotic dancer, inherits Tyrone's struggling hair salon business. She first sees the shop as a burden and waste of her time and puts the shop up for sale. But Yolanda eventually sees that the beauty biz could be a better future than the stripping biz, and changes her mind, angering the buyer, who retaliates with a vengeance. Yolanda decides to get her exotic dancing girlfriends together in order to keep the shop open... with a twist.",
    "Director": "Marcello Thedford",
    "Writer": "Marcello Thedford",
    "Actors": "Nancy Bellany, Taleia Gilliam, Kaja Martin",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1643233",
    "tt1414377",
    "tt1328642",
    "tt1067106",
    "tt2938070",
    "tt1151359",
    "tt1390404",
    "tt1262981",
    "tt1187044",
    "tt1124388",
    "tt1324053",
    "tt1134674"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:21.211Z"
}