{
  "movieId": "tt1575694",
  "title": "The Hit List",
  "year": 2011,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sdFcw4oRnoY",
      "id": "sdFcw4oRnoY",
      "title": "The Hit List (THRILLING ACTION THRILLER with CUBA GOODING JR., Complete German Action Movies 2025)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Als Allan abends in einer Bar den Kummer wegspülen will, lässt ihn ein Fremder eine Todesliste mit fünf Namen schreiben. Kurz darauf stirbt schon der Erste und natürlich wird Allan von der Polizei verdächtigt. Jetzt liegt es an ihm, den wahren Mörder aufzuhalten. Gut inszenierter Thriller mit CUBA GOODING JR. (\"Jerry Maguire\" & \"Men of Honor\") & COLE HAUSER (\"Pitch Black\").\n\nTHE HIT LIST (2011)\nOriginaltitel: The Hit List\nMit: Cuba Gooding Jr., Cole Hauser, Jonathan LaPaglia\nRegie: William Kaufman\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:Bei dem Ingenieur Allan Campbell (Cole Hauser) geht im Moment alles schief. Ein mexikanischer Gläubiger bedroht ihn, bei der anstehenden Beförderung wird er übergangen und seine Frau betrügt ihn mit seinem besten Freund. In einer Bar macht ihm ein Unbekannter (Cuba Gooding Jr.) das Angebot, all seine Probleme zu beseitigen. Er müsse ihm nur fünf Namen nennen. Ungläubig nennt ihm Allan seine vermeintlichen Peiniger, dabei ahnt er noch nicht, dass er damit eine Todes-Liste aufgegeben hat. Und dann wird tatsächlich der Erste ermordet.\n#Netzkino #ganzerFilm #cubagoodingjr\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:34:46.888Z",
      "thumbnail": "https://i.ytimg.com/vi/sdFcw4oRnoY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCfL180hiXasKGbhZYLKwHffTOlfg",
      "duration": 5188,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "90 min",
    "imdbRating": 5.4,
    "imdbVotes": 12116,
    "Genre": "Action, Thriller",
    "Plot": "In Spokane, an elite government killer goes rogue on the day that engineer Allen Campbell loses a promotion and finds his best man with his wife. Allen goes drinking that night and chats up a stranger who turns out to be Jonas, the hit man. Jonas asks Allen to give him a list of five people he'd like to see dead, so a drunk Allen lists his boss, the guy who got the promotion, a nasty bookie, the best man, and his wife. By the next morning, the boss is dead, and Allen realizes Jonas is for real. Can he stop Jonas?",
    "Director": "William Kaufman",
    "Writer": "Chad Law, Evan Law",
    "Actors": "Cuba Gooding Jr., Cole Hauser, Jonathan LaPaglia",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2179226",
    "tt1147687",
    "tt2240966",
    "tt2175184",
    "tt1535606",
    "tt1653700",
    "tt1977681",
    "tt1411232",
    "tt1308729",
    "tt1331329",
    "tt1694508",
    "tt1678051"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:11:56.975Z"
}