{
  "movieId": "tt15876060",
  "title": "Eastwood",
  "year": 2021,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8CE1CVXcrwY",
      "id": "8CE1CVXcrwY",
      "title": "Eastwood (2021) Documentary, Biography | The Life & Career of Hollywood Icon",
      "description": "Clint Eastwood, one of Hollywood's oldest living icons. Success did not come easy for Eastwood, but throughout his career he has reaped numerous triumphs, directed more than 44 films, and acted in more than 72. Winner of over 150 awards including four Oscars, the iconic Eastwood has not only secured his place in the history of Hollywood, but in the history of world cinema. Bravo!\n\nThis documentary has English & Spanish audio. And subtitled in many languages. \n\n\nDirector: Miguel Somoza\nWriter: Luisa B Arreaza\nVoice: Chris Jahn\n\n00:00 Full Documentary with subtitles.\n01:19 Clint Eastwood's journey from a struggling actor to a successful director in the Western film genre.\n06:00 Exploration of Clint Eastwood's career, collaborations, and influence in Hollywood and beyond.\n11:00 Eastwood's career as actor and director, from Dirty Harry to Pale Rider.\n16:12 Exploration of Clint's impact on war films, from Westerns to WWII perspectives.\n21:52 Clint Eastwood's diverse career in film, music, and directing, including his passion projects and collaborations with Steven Spielberg.\n27:40 Exploration of Clint Eastwood's impact on jazz and departure from Western genre in Unforgiven.\n33:00 Clint Eastwood's illustrious career in Hollywood, spanning from directing to acting, culminating in multiple Oscar wins.\n38:21 Exploration of Clint Eastwood's career, from early struggles to iconic roles and directorial achievements.\n43:13 Celebrating the legendary Clint Eastwood's prolific career in film industry and Hollywood history.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:15.008Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/8CE1CVXcrwY/maxresdefault.webp?v=674d6ccf",
      "duration": 2949,
      "language": "en",
      "year": 2021,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "45 min",
    "imdbVotes": 38,
    "Genre": "Documentary",
    "Plot": "A review of Eastwood's career with 2 massive errors within the first 5 minutes, the first of those within 30 seconds so I couldn't watch any more. Read my spoilers",
    "Director": "Miguel Somoza",
    "Writer": "Miguel Somoza",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt11102856",
    "tt15677286",
    "tt9012126",
    "tt14556014",
    "tt29232239",
    "tt12618064",
    "tt4538674",
    "tt17493304",
    "tt5123942",
    "tt13649700",
    "tt14552076",
    "tt14583726"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:35:32.865Z"
}