{
  "movieId": "tt1545660",
  "title": "Knights of Badassdom",
  "year": 2013,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u3pWd2ehUKY",
      "id": "u3pWd2ehUKY",
      "title": "Knights of Badassdom (ACTION ADVENTURE full movie German, German movies complete, new movies 2025)",
      "description": "💙 Filme komplett kostenlos auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Eine Gruppe von Freunden, beschwört auf einem Rollenspiel-Event versehentlich einen echten Dämon! Witziger Action-Abenteuerfilm mit Starbesetzung - PETER DINKLAGE (\"Game of Thrones\"), SUMMER GLAU (\"Firefly: Der Aufbruch der Serenity\") & STEVE ZAHN (\"Planet der Affen: Survival\")\n\nKNIGHTS OF BADASSDOM (2013)\nOriginaltitel: Knights of Badassdom\nMit: ‎Ryan Kwanten, Steve Zahn, Peter Dinklage, Summer Glau, Margarita Levieva, Tom Hopper\nRegie: Joe Lynch\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nJoe (Ryan Kwanten) wurde frisch von seiner Freundin verlassen und zerfließt in Selbstmitleid und Alkohol. Doch seine Mitbewohner und LARPer Hung (Peter Dinklage) und Eric (Steve Zahn) haben eine Idee: Sie packen den betrunkenen Joe ins Auto und fahren zum großen Live-Rollenspiel-Event „Evermore“.\nDort treffen die drei auf die attraktive Rollenspiel-Kriegerin Gwen (Summer Glau). Mit ihrer Hilfe - und eines bei eBay ersteigerten Zauberbuches - wollen Magier Eric und Zwerg Hung Joes Rollenspielcharakter wieder beleben. Aber ihr Buch besitzt tatsächlich magische Kräfte, wodurch eine Dämonenbraut aus der Hölle erscheint. Das Teufelsweib sieht aus wie Joes Ex-Freundin und macht blutrünstig Jagd auf die Rollenspieler. Die LARPer müssen sich zusammentun und beweisen, dass sie nicht nur Möchtegern-Helden sind. Die – echte. – Schlacht um Evermore beginnt…\n#Netzkino #ganzerFilm #PeterDinklage\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:44.185Z",
      "thumbnail": "https://i.ytimg.com/vi/u3pWd2ehUKY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDYAZjXtVtSPHxxKKM5X4LSxWph-w",
      "duration": 5130,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "86 min",
    "imdbRating": 5.6,
    "imdbVotes": 22081,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "In a valiant but pointless attempt to cheer up their freshly-dumped friend and former Dungeons and Dragons legend, Joe, two enthusiastic Live Action Role Players--Eric, a 27-level Grand Sorcerer in the making, and Hung, a medieval Master Rogue--drag their sad companion to a large-scale LARP campaign in the middle of a forest. However, things will soon spin out of control, as a malevolently cryptic dark incantation from the pages of a seemingly innocent prop book of spells, inadvertently summons a demonic succubus bent on destruction. Now, try to stop a slaughterous extra-dimensional being with several foam sticks and a handful of plastic swords.",
    "Director": "Joe Lynch",
    "Writer": "Kevin Dreyfuss, Matt Wall",
    "Actors": "Ryan Kwanten, Steve Zahn, Peter Dinklage",
    "Language": "English",
    "Country": "United States",
    "Awards": "2 nominations total"
  },
  "relatedMovies": [
    "tt2724064",
    "tt1659216",
    "tt1830713",
    "tt2690160",
    "tt1780983",
    "tt3062074",
    "tt2354196",
    "tt2151543",
    "tt1876261",
    "tt3019694",
    "tt2130142",
    "tt3152098"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:13.893Z"
}