{
  "movieId": "tt15096128",
  "title": "Crush",
  "year": 2022,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xme7wQz6NOY",
      "id": "Xme7wQz6NOY",
      "title": "Crush (GANZER HORRORFILM auf Deutsch, Filme 2025, Horror Thriller Filme in voller Länge kostenlos)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Die Verliebtheit eines heimlichen Verehrers in einen High-School-Athleten nimmt eine fatale Wendung...\n\nCRUSH (2013)\nOriginaltitel: Crush\nMit: Ashleigh Craig; Cody Hamilton; Lucas Till\nRegie: Malik Bader\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nHighschool-Schwarm Scott (Lucas Till) scheint alles zu haben, was sich ein Teenager von heute nur wünschen kann: Der Senkrechtstarter sieht nicht nur extrem gut aus, sondern steht auch bei seinen Mitschülern auf der Beliebtheitsskala ganz weit oben. Und dann gibt es da noch eine heimliche Verehrerin, deren offensichtliche Zuneigung dem sportlichen Jungspund anfangs sehr schmeichelt. Doch was passiert, wenn aus einer harmlosen Schwärmerei ganz plötzlich eine überaus ernste, gar tödliche Angelegenheit wird? Scott beginnt sich zu fragen, wer dahinterstecken könnte. Handelt es sich um seine langjährige platonische Freundin Jules (Sarah Bolger) oder vielleicht um Bess (Crystal Reed), eine schüchterne Klassenkameradin, die zunehmend eifersüchtig auf seine Freundschaft zu Jules reagiert? Auch Jeffrey (Reid Ewing) ist ein denkbarer Kandidat, hat seine unerwiderte Liebe zu Bess doch so manche Obsession ans Tageslicht gebracht. Im Grunde weiß Scott nur eines mit Sicherheit: Die Zeit drängt und die Identität des psychopatischen Stalkers muss aufgedeckt werden, ehe es zu spät ist.\n#Netzkino #ganzerFilm #horrorfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:49:36.422Z",
      "thumbnail": "https://i.ytimg.com/vi/Xme7wQz6NOY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBsLV63_2dICyNnTzUCfPnUwwF0nQ",
      "duration": 5466,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-MA",
    "Runtime": "93 min",
    "imdbRating": 6.3,
    "imdbVotes": 11224,
    "Genre": "Comedy, Romance",
    "Plot": "An aspiring artist and high school student who is forced, against her will, to join her high school track team. However, the situation isn't entirely bad, as it gives her an opportunity to pursue a girl that she has had a long-term crush on. However, things get even more complicated when she finds that she is falling for another teammate entirely. Soon she will see what real love feels like.",
    "Director": "Sammi Cohen",
    "Writer": "Kirsten King, Casey Rackham",
    "Actors": "Rowan Blanchard, Auli'i Cravalho, Isabella Ferreira",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt14522892",
    "tt14109724",
    "tt17663362",
    "tt21440964",
    "tt16357768",
    "tt14704394",
    "tt4181158",
    "tt19408396",
    "tt14311250",
    "tt13799986",
    "tt10276482",
    "tt6588950"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:43.073Z"
}