{
  "movieId": "tt1534533",
  "title": "The Open Track",
  "year": 1916,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheOpenTrackHelenGibson",
      "id": "TheOpenTrackHelenGibson",
      "title": "\"The Open Track\" (1916) starring Helen Gibson",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems     This is a short preview. You can watch the whole film here: https://silent-hall-of-fame.org/index.php/gems-for-donation     We have included this film in our program to illustrate the work and contributions of our star Helen Gibson. \"The Open Track\" (1916), directed by James Davis from a story by Edward T. Matlack, is a short action film from a serial by the name of \"The Hazards of Helen\" starring Helen Gibson.  This is episode 63 from a total of 119 weekly one reel films produced by Kalem, showing just how popular this serial was in 1914-1917.  The first 48 films starred Helen Holmes, the remaining 71 starred Helen Gibson.  They both played heroines that were independent and adventurous, resolving dangerous situations with quick thinking.  Their acting was very physical and they performed their often very dangerous stunts.  It is believed to be the longest film series in the silent era and one of the longest ever.   Helen Gibson is a railway station operator who gets caught in a federal investigation of counterfeit money.  There is a lot of action in this episode with one particularly dangerous stunt performed by Helen Gibson as she chases a runaway locomotive on motorcycle.   Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 19612113,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheOpenTrackHelenGibson",
      "year": 1916,
      "collection": "feature_films",
      "downloads": 2006
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "13 min",
    "imdbRating": 6.2,
    "imdbVotes": 25,
    "Genre": "Short, Thriller",
    "Plot": "Helen's cleverness exposes a band of counterfeiters who later succeed in turning the tables on the railroad detectives and tying the two men to the cowcatcher of a train which they then start off down the grade. Helen pursues the train on a motorcycle and boards it by a leap to the handrail of a freight. The engine is soon brought to a stop and the detectives released. Helen also lends her assistance later to the capture of the counterfeiters.",
    "Director": "J. Gunnis Davis",
    "Writer": "N/A",
    "Actors": "Helen Gibson, Robyn Adair, Clarence Burton",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1488157",
    "tt1534525",
    "tt1488156",
    "tt1487926",
    "tt1316458",
    "tt1316468",
    "tt1488145",
    "tt0319903",
    "tt0437960",
    "tt0002208",
    "tt0002553",
    "tt0139488"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.034Z"
}