{
  "movieId": "tt1525836",
  "title": "Gantz: Perfect Answer",
  "year": 2011,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gantz-2011-1080p-blu-ray",
      "id": "gantz-2011-1080p-blu-ray",
      "title": "Gantz (2011)",
      "description": "College student Kurono Kei notices former childhood friend Kato Masaru helping a drunk man who fell from a subway platform. Kei then jumps down to help his childhood friend. A few moments later, the subway train rapidly approaches and both men look on helplessly on as their life is about to end. The next moment, Kei and Masaru find themselves in a strange apartment with a mysterious giant black sphere and others who have recently died. The massive black sphere in the center of the living room is \"GANTZ\". GANTZ then assigns the people gathered in the room on missions to exterminate aliens. They are given a set time and if successful will receive points. A total of 100 points will allow them to leave this purgatory like place or send someone else back to life. If they fail, they can perish forever.",
      "fileSize": 2254023926,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/gantz-2011-1080p-blu-ray",
      "language": "jpn",
      "year": 2011,
      "collection": "feature_films",
      "downloads": 664
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gantz-perfect-answer-2011-blu-ray-1080p",
      "id": "gantz-perfect-answer-2011-blu-ray-1080p",
      "title": "Gantz: Perfect Answer (2011)",
      "description": "Kurono Kei and Kato Masaru are summoned by the mysterious black globe GANTZ. They continue the fight against extraterrestrial beings and, as they continue to battle, they become stronger. They can't escape unless they kill their enemy, the Saint. Kei opts to keep fighting to survive, but Kato Masaru hates the world which is controlled by violence and refuses to fight. As the two friends finds themselves opposing each other in a continuous game of violence, a critical last choice is to be made...",
      "fileSize": 2396833815,
      "addedAt": "2026-01-07T00:08:32.017Z",
      "thumbnail": "https://archive.org/services/img/gantz-perfect-answer-2011-blu-ray-1080p",
      "language": "jpn",
      "year": 2011,
      "collection": "feature_films",
      "downloads": 1480
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "141 min",
    "imdbRating": 6.2,
    "imdbVotes": 4854,
    "Genre": "Action, Adventure, Drama",
    "Plot": "Kato's (Ken'ichi Matsuyama) death changes Kurono's (Kazunari Ninomiya) view of life completely. He decides to keep fighting until he earns 100 points so that he can bring back Kato. GANTZ calls back several other unwilling participants that were allowed to leave after scoring 100 points. Before Kurono succeeds in resurrecting Kato, he unexpectedly comes back. GANTZ and the fighters take on another enemy worse than ever before. To make matters worse, GANTZ starts acting up. GANTZ chooses the next target... this time it's not an alien but a human girl. Each unwilling participant in GANTZ's twisted game has a different motive for fighting, whether to protect a loved one or to do what they think is right.",
    "Director": "Shinsuke Satô",
    "Writer": "Hiroya Oku, Yûsuke Watanabe",
    "Actors": "Kazunari Ninomiya, Ken'ichi Matsuyama, Yuriko Yoshitaka",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2836316",
    "tt1887703",
    "tt1468703",
    "tt1507563",
    "tt1981080",
    "tt2325993",
    "tt1657284",
    "tt1518861",
    "tt2202798",
    "tt1610528",
    "tt2236182",
    "tt1564571"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.017Z"
}