{
  "movieId": "tt1667130",
  "title": "The Green Wave",
  "year": 2010,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheGreenWave2010",
      "id": "TheGreenWave2010",
      "title": "The Green Wave (2010)",
      "description": "Synopsis Animated blogs and tweets from Iran form the backbone of this enlightening and sometimes shocking reconstruction of the 2009 Green Revolution. In May of that year, the youthful green-clad crowds were still enraged, and the atmosphere in the stadium where presidential candidate Mousavi held his speech was, according to eyewitnesses, explosive. The desire for change was huge. \"It helped me to regain my faith in humanity,\" one person recalls. Election Day itself was a deception on a massive scale: the supply of ballot papers would suddenly run out, and polling stations were closed for puzzling reasons. This marked the beginning of the dark period in which Mousavi was put under house arrest; Ahmadinejad seized power and demonstrators were shot. The authorities crushed the huge protests that took place under the slogan \"Where Is My Vote?\", by murdering Neda, the most notorious victim. We see these events onscreen as they were recorded with mobile phones and digital cameras. The blogs and tweets visualized using animation give an insider's view to the true extent of the suppression. One student, for example, ended up in a dark cell with 200 wounded prisoners, some of whom had already died. And another student recalls the day she was released: \"I left a small prison only to enter a much bigger one - a prison called Iran.\" Cast: Navíd Akhavan Payam Akhavan Shirin Ebadi Pegah Ferydoni Mitra Khalatbari Shadi Sadr Produced by: Roshanak Khodabakhsh .... associate producer Jan Krüger .... producer Oliver Stoltz .... producer Production Co: Dreamer Joint Venture Filmproduction",
      "fileSize": 35968994,
      "addedAt": "2026-01-07T00:07:05.032Z",
      "thumbnail": "https://archive.org/services/img/TheGreenWave2010",
      "collection": "feature_films",
      "downloads": 3780
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "80 min",
    "imdbRating": 7.4,
    "imdbVotes": 363,
    "Genre": "Documentary",
    "Plot": "A documentary on Iran's 2010 Green Revolution.",
    "Director": "Ali Samadi Ahadi",
    "Writer": "Ali Samadi Ahadi, Oliver Stoltz",
    "Actors": "Mohsen Kadivar, Mitra Khalatbari, Shadi Sadr",
    "Language": "German, Persian, English",
    "Country": "Germany",
    "Awards": "1 win & 5 nominations"
  },
  "relatedMovies": [
    "tt1765782",
    "tt9459600",
    "tt1556190",
    "tt1757880",
    "tt8508676",
    "tt1972567",
    "tt3228494",
    "tt4077512",
    "tt2124189",
    "tt1810688",
    "tt1475191",
    "tt2205413"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.032Z"
}