{
  "imdbId": "tt1695350",
  "title": "Theory NTSC",
  "year": 2008,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BloodSpell_NTSC_DVD",
      "id": "BloodSpell_NTSC_DVD",
      "title": "BloodSpell: Special Edition DVD (NTSC)",
      "description": "BloodSpell is the unique animated \"punk fantasy\" feature film by Machinima pioneers Strange Company, made available in its entirety for viewing online under Creative Commons. This is the Special Edition DVD set, consisting of two DVD images (burnable in a normal DVD burner) including: - The full feature film at DVD quality - English and German subtitles - Four commentaries on the film from Hugh Hancock and his cast and crew. - Deleted scenes, animatics and more from the film. - A complete series of documentaries on the making of BloodSpell. In the world of BloodSpell, some people are infected with magic in their blood. When that blood is spilled, the magic is released, to harm or heal. When Jered, a young monk trained to hunt the Blooded, realises he has magic in his own blood, he must flee into the slums and magical hideouts of the Blooded, pursued by the Church of the Angels who trained him. \"There's some damned fine storytelling and editing/production work here\" - Cory Doctorow, author and blogger \"Blood, Angels and loads of vicious smiting: what more could you ask for?\" - Alan Campbell, author of Scar Night. \"\"A movie that defies most of the rules of traditional film-making.\" - The Guardian What should I download? NOTE: These are the NTSC version discs, which the US, Canada, Japan and South Korea. If you live elsewhere in the world, you want the PAL edition, available here . Disc 1 contains the film, trailers, and commentaries. Download it here . Disc 2 contains deleted scenes and documentaries. Download it here . These are large files - Firefox may not cope well with the download, and Google Chrome will refuse to download them! If you have problems, we recommend using a dedicated download manager (like FDM or FTP client (like Filezilla ) to download the images.",
      "fileSize": 11288558205,
      "addedAt": "2026-01-07T00:06:14.039Z",
      "thumbnail": "https://archive.org/services/img/BloodSpell_NTSC_DVD",
      "language": "UK English with English and German subtitles.",
      "year": 2008,
      "collection": "feature_films",
      "downloads": 7265
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "31 min",
    "imdbVotes": null,
    "Genre": "Short, Fantasy, Mystery",
    "Plot": "N/A",
    "Director": "Rouzbeh Rashidi",
    "Writer": "Rouzbeh Rashidi",
    "Actors": "Pooria Nick Dell, Ehsan Safarpour",
    "Language": "Persian",
    "Country": "Iran",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt8106846",
    "tt0216016",
    "tt1737581",
    "tt1006929",
    "tt1132130",
    "tt1235124",
    "tt0756683",
    "tt3532172",
    "tt1780962",
    "tt2459468",
    "tt2509978",
    "tt2536422"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.039Z"
}