{
  "movieId": "tt1645986",
  "title": "For Valour",
  "year": 2009,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ForValourAustralia",
      "id": "ForValourAustralia",
      "title": "For Valour",
      "description": "Title: For Valour Summary: The Victoria Cross is the most coveted and honored decoration available to members of the Australian Defence Force. Journey down the Remembrance Highway, from Sydney to Canberra's ... Directed by: Serge Ou Actors: Alex Becconsall, Kristopher Bos, Dennis Kreusler Production Company: Wildbear Entertainment Release Date: TV Movie 25 April 2009 Aspect Ratio: REMOVE_TAG The Victoria Cross is the most coveted and honored decoration available to members of the Australian Defence Force. Journey down the Remembrance Highway, from Sydney to Canberra's Australian War Memorial where 22 ordinary Australians are remembered for their extraordinary deeds of courage and sacrifice. Winners of the Victoria Cross, their stories are inspiring, their legacy indubitable. From as far back as the 1857 Indian Mutiny 96 Australian soldiers have received this honour - among them Neville (later Major General) Howse who faced enemy fire during the second Boar War to rescue a fallen trumpeter. Despite being shot in the neck and chest John Edmondson risked his life at the seige of Tobruk to aid an officer in distress,and during the Vietnam War Keith Payne entered enemy territory to aid the rescue of \"about 40? injured and lost soldiers. Featuring dramatic re-enactments and insightful interviews with war historians For Valour represents an outstanding triumph of will, exploring...",
      "fileSize": 569619921,
      "addedAt": "2026-01-07T00:06:25.399Z",
      "thumbnail": "https://archive.org/services/img/ForValourAustralia",
      "year": 2009,
      "collection": "feature_films",
      "downloads": 1101
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "55 min",
    "imdbRating": 6.4,
    "imdbVotes": 7,
    "Genre": "War",
    "Plot": "The Victoria Cross is the most coveted and honored decoration available to members of the Australian Defence Force. Journey down the Remembrance Highway, from Sydney to Canberra's Australian War Memorial where 22 ordinary Australians are remembered for their extraordinary deeds of courage and sacrifice. Winners of the Victoria Cross, their stories are inspiring, their legacy indubitable. From as far back as the 1857 Indian Mutiny 96 Australian soldiers have received this honour - among them Neville (later Major General) Howse who faced enemy fire during the second Boar War to rescue a fallen trumpeter. Despite being shot in the neck and chest John Edmondson risked his life at the seige of Tobruk to aid an officer in distress,and during the Vietnam War Keith Payne entered enemy territory to aid the rescue of \"about 40? injured and lost soldiers. Featuring dramatic re-enactments and insightful interviews with war historians For Valour represents an outstanding triumph of will, exploring the mateship, camaraderie and personal courage of the defenders of our great nation.",
    "Director": "Serge Ou",
    "Writer": "Michael Cove",
    "Actors": "Alex Becconsall, Kristopher Bos, Dennis Kreusler",
    "Language": "English",
    "Country": "Australia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1161861",
    "tt1332128",
    "tt1633245",
    "tt1561768",
    "tt0785012",
    "tt1094627",
    "tt1298590",
    "tt1316616",
    "tt1789074",
    "tt1969126",
    "tt1295026",
    "tt1688704"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.399Z"
}