{
  "movieId": "tt1694020",
  "title": "The Guilt Trip",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=phtxNVuKVUE",
      "id": "phtxNVuKVUE",
      "title": "The Guilt Trip (COMEDY with SETH ROGEN, Comedy Movies German completely new, full movie German)",
      "description": "💙 Filme auf Deutsch & komplett kostenlos streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Comedy-Größe SETH ROGEN (\"Ananas Express\" & \"Das ist das Ende\") ist in dieser witzigen Roadmovie-Komödie mit seiner Mutter, gespielt von HOLLYWOOD-Ikone BARBRA STREISAND (\"Funny Girl\" & \"A Star Is Born\"), auf einem 3.000 Meilen-Trip, bei dem kein Auge trocken bleibt\n\nUNTERWEGS MIT MUM (2012)\nOriginaltitel: The Guilt Trip\nMit: Seth Rogen, Barbra Streisand, Adam Scott, Casey Wilson, Yvonne Strahovski\nRegie: Anne Fletcher\nFSK: Freigegeben ab 0 Jahren\n\nINHALTSANGABE:\nUnterwegs mit Mum ist die Mutter aller Roadmovies – eine perfekte Beziehungskomödie über Mutter und Sohn. Auf Stippvisite bei Mutti folgt Andy einer spontanen Eingebung und lädt seine Mum ein, ihn auf einer Reise quer durchs ganze Land zu begleiten: 3.000 Meilen in 8 Tagen. Je weiter sie sich von zuhause entfernen, desto näher kommen die beiden sich auf diesem rasend komischen Mutter-und-Sohn-Trip. Und Andy erkennt, dass sie viel mehr gemeinsam haben, als er gedacht hätte.\n#Netzkino #ganzerFilm #SethRogen\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:36:14.525Z",
      "thumbnail": "https://i.ytimg.com/vi/phtxNVuKVUE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCv0M8Yz7SLfGjTcC_1vRDFfBMBAg",
      "duration": 5738,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "95 min",
    "imdbRating": 5.8,
    "imdbVotes": 41260,
    "Genre": "Comedy, Drama",
    "Plot": "Los Angeles based organic chemist Andrew Brewster has just sunk his life savings into developing and now marketing an environmentally friendly, effective and human safe home cleaning product. Despite these attributes, he is having problems making any sales to distributors and retailers. He has planned a cross country business trip via automobile to make sales pitches to various companies along the way, starting in New York City and ending in Las Vegas. While in New York, Andy plans to stay with his overbearing mother, New Jersey residing Joyce Brewster, with who he has a love/hate relationship and who he does not see very often anymore. He doesn't want to tell her of his sales failures thus far as he knows she will only add more than her two-cents into the matter, which he doesn't want. Joyce's focus of attention is on Andy's single status and what looks to be his stalled romantic life, out of which again he wants her to stay. Widowed when Andy was eight, Joyce has never remarried or dated for that matter, she not wanting to go through the trouble of a critical eye of another person in her life. Andy wishes she would make an effort with men both to make her happy and so that she will focus on her own life instead of his. When Joyce makes a revelation about her past love life to Andy just before he is ready to depart from New Jersey, Andy decides to invite Joyce along on the trip, making a final stop in San Francisco to revisit that past without telling her the reason. Joyce accepts. Through the ups and downs of their trip, Andy and Joyce may come to a better understanding of their relationship, Andy's business failures, and what is needed to move on with their lives as happy, productive people.",
    "Director": "Anne Fletcher",
    "Writer": "Dan Fogelman, Jason Conzelman",
    "Actors": "Barbra Streisand, Seth Rogen, Julene Renee",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt2838540",
    "tt2460976",
    "tt0485521",
    "tt1566938",
    "tt2008633",
    "tt1880212",
    "tt1674778",
    "tt2345503",
    "tt1385591",
    "tt1930546",
    "tt1582465",
    "tt3101386"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:21:20.421Z"
}