{
  "movieId": "tt1699498",
  "title": "Lake Effects",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=idhZBYR4Luc",
      "id": "idhZBYR4Luc",
      "title": "Lake Effects | Full Drama Comedy | Jane Seymour",
      "description": "Lake Effects - Sara and Lily grew up at Smith Mountain Lake. Sara became estranged from the family and without explanation moved to Los Angeles to study law. Her sister Lily, an artist, teaches locally and lives with their parents, Ray and Vivian, until Dad dies in an accident. Sara returns to help settle his estate, and all our ladies cross paths with an eclectic group of local oddballs, as they search for a Loch Ness-style monster they believe lurks in the lake's depths. A few real Smith Mountain Lake characters make appearances. The next week at the lake is filled with adventure, tears, and laughter as Vivian and her two daughters finally understand, through the guidance of Dad's spirit, if they still belong on the lake, even though Ray is gone. All paths converge at the Smith Mountain Lake Wine Festival, on course for a heart-warming and hilarious collision.\n2012.  Stars: Scottie Thompson, Jane Seymour, Madeline Zima\n**Under license from Vision Films Inc. All rights reserved**\n\n★ Awesome Movies \n\nWelcome to the Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under license from various copyright holders. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n★ Buy some items from our merch store - \nhttps://teespring.com/stores/classic-movies-channel\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:47:21.564Z",
      "thumbnail": "https://i.ytimg.com/vi/idhZBYR4Luc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD148suHDSi3dPhFOEEv2bdUs3CvA",
      "duration": 5733,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "94 min",
    "imdbRating": 5.6,
    "imdbVotes": 683,
    "Genre": "Comedy, Family, Romance",
    "Plot": "Sara and Lily grew up at Smith Mountain Lake. Sara became estranged from the family and without explanation moved to Los Angeles to study law. Her sister Lily, an artist, teaches locally and lives with their parents, Ray and Vivian, until Dad dies in an accident. Sara returns to help settle his estate, and all our ladies cross paths with an eclectic group of local oddballs, as they search for a Loch Ness-style monster they believe lurks in the lake's depths. A few real Smith Mountain Lake characters make appearances. The next week at the lake is filled with adventure, tears, and laughter as Vivian and her two daughters finally understand, through the guidance of Dad's spirit, if they still belong on the lake, even though Ray is gone. All paths converge at the Smith Mountain Lake Wine Festival, on course for a heart-warming and hilarious collision.",
    "Director": "Michael McKay",
    "Writer": "Scott Winters, Michael McKay, Carolyn Miller",
    "Actors": "Scottie Thompson, Jane Seymour, Madeline Zima",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1942787",
    "tt3214240",
    "tt1698639",
    "tt3210984",
    "tt1678037",
    "tt5863634",
    "tt0067818",
    "tt0038704",
    "tt0433412",
    "tt2460976",
    "tt13057170",
    "tt14444018"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:59:17.924Z"
}