{
  "imdbId": "tt1686784",
  "title": "Flying Swords of Dragon Gate",
  "year": 2011,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L7qNGbsFQfY",
      "id": "L7qNGbsFQfY",
      "title": "Flying Swords of Dragon Gate (ACTION ADVENTURE with JET LI Films German complete 2024, action film)",
      "addedAt": "2025-12-23T23:52:49.114Z",
      "thumbnail": "https://i.ytimg.com/vi/L7qNGbsFQfY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBzJfpmRzf32tsZ1Wo2KjYze2uq-A",
      "duration": 7342,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X1wbXEFBkNk",
      "id": "X1wbXEFBkNk",
      "title": "Flying Swords of Dragon Gate - Action, Abenteuer - mit Jet Li - Ganzen Film schauen bei Moviedome",
      "description": "*GANZER FILM - Epische Heldengeschichte mit spektakulärer Action*\n\nDen Spielfilm „Flying Swords of Dragon Gate“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Flying Swords of Dragon Gate“:\nIMDb: *6,7* von 10\nAmazon: *4,2* von 5\n\n*Die Handlung von „Flying Swords of Dragon Gate“*\nChina wird von dem skrupellosen Yu terrorisiert. Hoffnung keimt auf, als sich Martial-Arts-Meister und Freiheitskämpfer Zhao zum Ziel setzt, mit der Korruption und Unterdrückung aufzuräumen und so kommt es zum ultimativen und tödlichen Kampf.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Flying Swords of Dragon Gate“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Abenteuerfilm #Actionfilm #SamuraiFilm #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Long Men Fei Jia\nLaufzeit: 122 Minuten\nRegie: Hark Tsui (Regisseur von \"Detective Dee\" und \"Die letzte Schlacht am Tigerberg\")\nFSK: 16\nErstveröffentlichung: 2011\n\n\n*Das sind die Schauspieler*\nJet Li (bekannt aus „The Warlords\", \"Mulan\", \"The Expendables\")\nin der Rolle des Zhao Huai'an\nXun Zhou (bekannt aus „Der Ruf des Kaisers\", \"Cloud Atlas\")\nin der Rolle der Ling Yanqiu\nKun Chen (bekannt aus \"Detective Dee und der Fluch des Seeungeheuers\")\nin der Rolle des Yu Huatian\nGwen Lun-Mei (bekannt aus „Der See der wilden Gänse\", \"Women in Taipei\")\nin der Rolle der Chang Xiaowen\nChia-Hui Liu (bekannt aus \"The Man with the Iron Fists\", \"Kill Bill Vol. 1 und 2\")\nin der Rolle des Wan Yulou\n\n\n*Die Handlung und Szenen von „Flying Swords of Dragon Gate“*\nIm China der Ming-Dynastie treibt sich der Rebell Zhao (Jet Li) herum. Er hat sich zum Kampf gegen die kaiserlichen Eunuchen unter dem gewissenslosen Yu (Kun Chen) verschworen, da dieser in seinen Augen zu viel Macht besitzt und seine mörderischen Handlanger und Söldner durch das Land ziehen lässt. Dem will er mit Hilfe seiner Martial-Arts-Künste und seinem generellen Können als Kämpfer ein Ende bereiten. Im Kampf gegen die Unterdrückung und mehr oder weniger verdeckter Korruption gerät er in das Gasthaus „Zum Drachentor“, welches sich mitten in einer Wüste befindet. In der Spelunke trifft er sowohl auf Yu, wie auch auf seine frühere Geliebte Lung, die mit einer kaiserlichen Konkubine das Gasthaus aufsucht, in dem sich auch noch zusätzlich einige sehr trinkfreudige Mongolen befinden. Diese hoffen darauf, dass ein drohender Sandsturm eine mythische Stadt aus purem Gold offenbart. Ein Kampf scheint unausweichlich…\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Flying Swords of Dragon Gate“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:45.215Z",
      "thumbnail": "https://i.ytimg.com/vi/X1wbXEFBkNk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCT-8wJktbPeVzKAQ93BQTQzXNiPg",
      "duration": 7342,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "122 min",
    "imdbRating": 5.9,
    "imdbVotes": 8848,
    "Genre": "Action, Adventure",
    "Plot": "The Emperor's eunuchs have gained power and influence, the East Bureau and West Bureau spy and police the nation. They visit the shipyards, but only as a cover to execute those who would try and report their taking of bribes to the Emperor. Zhao Huai'an fights the leader of the East Bureau, defeating him and putting his head in a box and hanging it as a warning to other corrupt officials. The Emperor's chief concubine wants them to prevent the Emperor impregnating anyone aside from her. Three pregnant courtesans have been executed, a fourth is being hunted down. Officials stop a riverboat and are about to execute a woman but a masked hero intervenes. Zhao watches from nearby and the masked hero also claims to be Zhao. The imposter helps the courtesan flee to Dragons Gate, Zhao and his followers decide to fight the West Bureau to help delay them and aid in the escape.",
    "Director": "Hark Tsui",
    "Writer": "Hark Tsui",
    "Actors": "Jet Li, Xun Zhou, Kun Chen",
    "Language": "Mandarin",
    "Country": "China, Hong Kong",
    "Awards": "17 wins & 37 nominations total"
  },
  "relatedMovies": [
    "tt2836316",
    "tt1594917",
    "tt1525836",
    "tt1566486",
    "tt1872231",
    "tt0479997",
    "tt0780645",
    "tt1734203",
    "tt1637713",
    "tt1876446",
    "tt1887703",
    "tt1792794"
  ],
  "collections": [
    {
      "id": "martial-arts",
      "name": "Martial Arts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:20:18.565Z"
}