{
  "movieId": "tt1663708",
  "title": "Absolute Killers",
  "year": 2011,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ggOVJkYxM78",
      "id": "ggOVJkYxM78",
      "title": "Absolute Killers | Full Movie | Action Crime | Edward Furlong | Meat loaf",
      "description": "Absolute Killers - Johnny Graham, raised by the Torino crime family after the death of his parents, is repeatedly torn between loyalty to his adoptive family and his conscience. When Anthony Torino, the volatile heir-apparent, turns his deadly sights on the DA prosecuting him for the cold-blooded murder of his own cousin, Johnny is finally moved to act. Despite his role as family accountant, Johnny is quite the marksman.\n2011.  Stars: Edward Furlong, Grace Johnston, Meat Loaf\n**Under non-exclusive license from TriCoast Worldwide.  All rights reserved**\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:44:25.785Z",
      "thumbnail": "https://i.ytimg.com/vi/ggOVJkYxM78/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDDRuF0Gm_yJ8J44-JMNzMs7gMsRQ",
      "duration": 5845,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "AE",
          "AS",
          "BE",
          "BH",
          "CA",
          "CN",
          "DJ",
          "DZ",
          "EG",
          "EH",
          "ET",
          "FK",
          "FM",
          "GB",
          "GI",
          "GU",
          "IE",
          "IM",
          "IQ",
          "IR",
          "JO",
          "KW",
          "LB",
          "LU",
          "LY",
          "MA",
          "MH",
          "MP",
          "NL",
          "OM",
          "PM",
          "PN",
          "PR",
          "PW",
          "QA",
          "SA",
          "SD",
          "SH",
          "SO",
          "SS",
          "SY",
          "TH",
          "TN",
          "UM",
          "US",
          "VI",
          "YE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "97 min",
    "imdbRating": 4.2,
    "imdbVotes": 177,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "Johnny Graham, raised by the Torino crime family after the death of his parents, is repeatedly torn between loyalty to his adoptive family and his conscience. When Anthony Torino, the volatile heir-apparent, turns his deadly sights on the DA prosecuting him for the cold-blooded murder of his own cousin, Johnny is finally moved to act. Despite his role as family accountant, Johnny is quite the marksman. He convinces a reluctant Anthony into letting him eliminate DA Elizabeth Jones. Johnny's plan to simply warn her instead is thwarted by the arrival of a pair of Torino family goons sent to supervise his first hit. The ensuing shootout leaves Elizabeth wounded, one goon dead, and Johnny arrested. Johnny rolls on Anthony and enters the Witness Security Program. Shortly after Anthony is arrested, he escapes and contacts his mole to get the locations of Johnny and the others who were going to testify against him. When Vince, Torino family hit-man and Johnny's lifelong friend, shows at the sheep farm where Johnny has been hidden away, Johnny finds himself once again scrambling to save the lives of those who have crossed Anthony, including his own. Along the way, he realizes that he's not alone in this mission.",
    "Director": "Heather Hale",
    "Writer": "Eric Troyer, Heather Hale",
    "Actors": "Edward Furlong, Grace Johnston, Meat Loaf",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2299842",
    "tt2343761",
    "tt2359024",
    "tt2381989",
    "tt1951095",
    "tt2543702",
    "tt1337542",
    "tt3130734",
    "tt0887971",
    "tt1290475",
    "tt0995033",
    "tt2586118"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:54:51.844Z"
}