{
  "movieId": "tt16732214",
  "title": "The Blue Skies at Your Feet",
  "year": 2022,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-blue-skies-at-your-feet-2022-1080p-webrip",
      "id": "the-blue-skies-at-your-feet-2022-1080p-webrip",
      "title": "The Blue Skies at Your Feet (2022)",
      "description": "Miyu and Shuya are high school students. They have dated for 2 years. Miyu and Shuya have a promise that no matter what, they will watch a movie together on the first day of each new month. When Miyu and Shuya are on their way to the movie theater, Shuya suddenly cancels their date. Shuya seems like he is hiding something and he acts nervous. Later, Miyu goes to the place where she is supposed to meet Shuya, but she witnesses Shuya getting into a car accident. She panics, but when she wakes up she finds herself on the morning of the accident. Miyu keeps waking up on the day when Shuya got into an accident. (Source: AsianWiki) ~~ Adapted from the novel \"Kimi ga Otoshita Aozora\" (君が落とした青空) by Sakura Eeyo (櫻いいよ). ",
      "fileSize": 1850894994,
      "addedAt": "2026-01-07T00:11:57.680Z",
      "thumbnail": "https://archive.org/services/img/the-blue-skies-at-your-feet-2022-1080p-webrip",
      "language": "jpn",
      "year": 2022,
      "collection": "feature_films",
      "downloads": 1036
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "93 min",
    "imdbRating": 5.5,
    "imdbVotes": 194,
    "Genre": "Romance",
    "Plot": "Miyu Mizuno and Shuya Shinohara are high school students. They have dated for two years and promised that no matter what, they will watch a movie together on the first day of each new month. When Miyu and Shuya are on their way to the movie theater, Shuya suddenly cancels their date. Shuya seems like he is hiding something and he acts nervous. Later, Miyu goes to the place where she is supposed to meet Shuya, but she witnesses Shuya getting into a car accident. She panics, but when she wakes up she finds herself on the morning of the accident. Miyu keeps waking up on the day when Shuya got into an accident.",
    "Director": "Yûki Saitô",
    "Writer": "Keiko Kanome, Iiyo Sakura",
    "Actors": "Riko Fukumoto, Mizuki Itagaki, Genta Matsuda",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt19800090",
    "tt14522892",
    "tt14109724",
    "tt19850394",
    "tt12794540",
    "tt17663362",
    "tt15096128",
    "tt21440964",
    "tt16357768",
    "tt14704394",
    "tt10369964",
    "tt22353382"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:57.680Z"
}