{
  "imdbId": "tt1666335",
  "title": "The Calling",
  "year": 2014,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vsffIZQOlrI",
      "id": "vsffIZQOlrI",
      "title": "The Calling (MYSTERY THRILLER full movie German, new German movies complete 2025)",
      "description": "💙 Filme auf Deutsch & komplett kostenlos streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Spannende Romanverfilmung mit Starbesetzung – SUSAN SARANDON (\"Thelma & Louise\" & \"Der Klient\"), ELLEN BURSTYN (\"Der Exorzist\" & \"Requiem for a Dream\") & DONALD SUTHERLAND (\"Die Tribute von Panem\" & \"Stolz & Vorurteil\"): Eine abgehalfterte Polizistin einer verträumten Kleinstadt stolpert über einen erschütternden Mordfall.\n\nTHE CALLING: RUF DES BÖSEN (2014)\nOriginaltitel: The Calling\nMit: Donald Sutherland, Ellen Burstyn, Susan Sarandon, Topher Grace\nRegie: Jason Stone\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nHauptkommissarin Hazel Micallef (Susan Sarandon) führt mit ihrer Mutter (Ellen Burstyn), ihren Schmerzmitteln und ihren gelegentlichen Drinks ein ruhiges Leben. Als sie jedoch einen kranken Nachbarn besuchen will, deckt sie einen grausamen Mord auf, der ihre friedliche Existenz auf den Kopf stellt. Mithilfe eines Kollegen (Gil Bellows) und eines frisch versetzten Polizisten (Topher Grace) bringt sie eine Serie ähnlicher Morde im ganzen Land ans Licht. Nachdem ein Priester (Donald Sutherland) im Ort eine Verbindung zu einem uralten Ritual andeutet, konzentriert sich Hazels Suche auf einen religiösen Fanatiker mit einer tödlichen höheren Berufung. Der Film basiert auf einem Roman von Inger Ash Wolfe und entführt uns in die Grauzone zwischen Glaube und Angst.\n#ganzerFilm #SusanSarandon #DonaldSutherland\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:36:57.674Z",
      "thumbnail": "https://i.ytimg.com/vi/vsffIZQOlrI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCkN0LnezNSqiUtAWzjHXKxpUsDpg",
      "duration": 6490,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "108 min",
    "imdbRating": 5.9,
    "imdbVotes": 9735,
    "Genre": "Drama, Horror, Mystery",
    "Plot": "Hazel Micallef is the senior officer in the Fort Dundas, Ontario Police Department. Once having tried to commit suicide and a resulting chronic back injury are the reasons she will never be promoted, the position of Commanding Officer, of which she is acting, having been vacant for some time. Hazel self-medicates to dull the emotional and physical pain. Relatively young and inexperienced but enthusiastic Ben Wingate transferring from the Toronto Police Department to join her and the only other detective, Ray Green, coincides with the first homicide in Fort Dundas in four years, the victim aged Delia Chandler, a friend of Hazel's mother, retired judge Emily Micallef with who single Hazel lives. Delia's throat was slit, but the coroner is able to determine that the murderer posed Delia's mouth post-mortem, with the time for rigor mortis to set in meaning that he/she had to hold the mouth in place for upwards of an hour. With two subsequent murders in nearby communities with similar oral contortions leads to Hazel believing they are dealing with a serial killer who did not want to be caught, the reason for committing the murders in different jurisdictions. Ben is able to discover that there have been similar murders across the country. With some emerging evidence, Hazel consults Catholic priest Father Price, further leading to the thought that the killer is working on a ritualistic religious mission with more victims to come. With Hazel's own history and situation, it becomes a personal matter between her and the killer, arguably more for the killer than for Hazel herself.",
    "Director": "Jason Stone",
    "Writer": "Scott Abramovitch, Michael Redhill",
    "Actors": "Susan Sarandon, Gil Bellows, Ellen Burstyn",
    "Language": "English, Latin",
    "Country": "United States, Canada, United Kingdom",
    "Awards": "4 nominations total"
  },
  "relatedMovies": [
    "tt3139756",
    "tt2181778",
    "tt3778010",
    "tt1881060",
    "tt2425866",
    "tt5060166",
    "tt2484254",
    "tt3904278",
    "tt4908764",
    "tt2341985",
    "tt3721112",
    "tt5997358"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:21:42.639Z"
}