{
  "imdbId": "tt1618432",
  "title": "I'm in Love with a Church Girl",
  "year": 2013,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xq_PZ9wbaPE",
      "id": "Xq_PZ9wbaPE",
      "title": "I'm In Love With A Church Girl | Full Movie | Crime Drama | Ja Rule | Stephen Baldwin",
      "description": "I'm In Love With A Church Girl - Miles Montego (Ja Rule) has it all. Including a past. He was king of the streets as a high-level drug trafficker, and although he has tried to move on, the DEA isn't convinced. When Miles meets Vanessa, a woman who is different than any other he's met, he's drawn to her beauty and her spirituality.\n2013.  Stars: Zahn McClarnon, Michael Madsen, Martin Kove, Stephen Baldwin, Ja Rule\n**Under non-exclusive license from Cineverse Corp.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #DoveTV #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:47.062Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Xq_PZ9wbaPE/maxresdefault.webp",
      "duration": 7110,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "118 min",
    "imdbRating": 4.2,
    "imdbVotes": 2047,
    "Genre": "Crime, Drama, Romance",
    "Plot": "Miles Montego (Ja Rule) has it all - cars, boats, good looks, mansion, money, women, but more importantly, he has a past. Miles is a retired high level drug trafficker who is now completely legitimate. Even though Miles has turned over a new leaf, the DEA can't seem to let him out of their sights. Miles' only downfall is that he is extremely loyal to his circle of friends and former colleagues who are not retired from the lucrative business. Struggling to keep on the right side of the law, Miles meets the one girl of his dreams but she's not the usual type of girl that he's used to dating. Vanessa (Adrienne Bailon) is a church girl in every sense of the word. They are tested to their last ounce of faith and strength in God and each other. God continues to chip away at Miles through struggles from his past, having to live up to his reputation, feelings of unworthiness, the death of his mother, federal charges, his friends being indicted, the strain on his relationship with Vanessa, almost losing her in a near fatal car accident, and finally the spiritual breakdown and one on one with God that brings Miles to his knees.",
    "Director": "Steve Race",
    "Writer": "Galley Molina",
    "Actors": "Michael Madsen, Zahn McClarnon, Martin Kove",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0032179",
    "tt0038342",
    "tt0022662",
    "tt0033526",
    "tt0021770",
    "tt0039694",
    "tt0043830",
    "tt0051987",
    "tt0027568",
    "tt0026436",
    "tt0019979",
    "tt0023025"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:07.995Z"
}