{
  "movieId": "tt1789074",
  "title": "The Night Watch",
  "year": 2011,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the.-night.-watch.-2011.-hdtvrip",
      "id": "the.-night.-watch.-2011.-hdtvrip",
      "title": "The Night Watch (2011)",
      "description": "In post-war London, Viv Pearce is dating Reggie and runs a dating bureau with Helen Giniver, who lives with her older lover, authoress Julia Standing. Viv's younger brother Duncan, a gay man made to feel ashamed of his orientation, has been in prison and is sought out by his ex-cell-mate, Robert Fraser, who served time as a conscientious objector and is now concerned for the young man's welfare.",
      "fileSize": 858633557,
      "addedAt": "2026-01-07T00:12:33.208Z",
      "thumbnail": "https://archive.org/services/img/the.-night.-watch.-2011.-hdtvrip",
      "language": "eng",
      "year": 2011,
      "collection": "feature_films",
      "downloads": 166
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "89 min",
    "imdbRating": 6.4,
    "imdbVotes": 1277,
    "Genre": "Drama, Romance, War",
    "Plot": "In post-war London, Viv Pearce is dating Reggie and runs a dating bureau with Helen Giniver, who lives with her older lover, authoress Julia Standing. Viv's younger brother Duncan, a gay man made to feel ashamed of his orientation, has been in prison and is sought out by his ex-cell-mate, Robert Fraser, who served time as a conscientious objector and is now concerned for the young man's welfare. Viv encounters Kay Langrish, a wealthy, reclusive, butch lesbian and for both women this evokes memories of the period three years earlier (1944) when Kay was an heroic ambulance driver in a happy, loving relationship with Helen -- before Kay introduced her to her ex-lover Julia. At that time, Viv and Reggie are forced to procure the services of a dentist moonlighting as an abortionist. About to die from blood loss, and having been abandoned by Reggie, Kay saves her from prosecution by claiming she was a married woman who had miscarried. Three years before that (1941) Kay and Julia are still an item and Viv meets unhappily married soldier Reggie on a train. Kay pulls Helen from the wreckage of a bombed house, finding the innocent young woman she has always wanted to love and care for. We also learn the gruesome details of why Duncan was in prison, which follows a suicide pact with the boy he loved, in response to the war and the draft. As the scene returns to 1947 there are happier endings for some and optimist outlooks for others as they move forward.",
    "Director": "Richard Laxton",
    "Writer": "Sarah Waters, Paula Milne",
    "Actors": "Jenna Augen, Neal Barry, Claudie Blakley",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 win & 1 nomination total"
  },
  "relatedMovies": [
    "tt0785012",
    "tt0050634",
    "tt0049783",
    "tt0052600",
    "tt0053712",
    "tt0022879",
    "tt0088734",
    "tt0026104",
    "tt7915554",
    "tt0023742",
    "tt0051476",
    "tt0049871"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.208Z"
}