{
  "movieId": "tt1765738",
  "title": "Cadetes de San Martin no Rio",
  "year": 1939,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/cadetes-de-san-martin-1937",
      "id": "cadetes-de-san-martin-1937",
      "title": "Cadetes De San Martin (1937)",
      "description": "Cadetes de San Martín  es una película  argentina  en blanco y negro dirigida por  Mario Soffici  sobre guion de  José Antonio Saldías  que se estrenó el 3 de marzo de 1937 y que tuvo como protagonistas a  Ángel Magaña ,  Enrique Muiño ,  Elías Alippi  y  Orestes Caviglia . (Wikipedia) Produccion La historia original de Saldías tenía un punto culminante que era sospechosamente similar a un hecho real en el que el hijo de un diputado radical había sido expulsado por motivos sobre los cuales habían corrido versiones contradictorias. La cooperación del Colegio Militar de la Nación fue supedidata por el ministro de Guerra  Basilio Pertiné  a que se realizaran ciertos cambios narrativos, con lo cual el director llegó a la etapa de filmación condicionado por ellos. Sinopsis Un frigorífico es acusado de vender productos perjudiciales para la salud. El hijo de uno de los socios, cadete del Colegio Militar de la Nación, es expulsado de la institución cuando estalla el escándalo y su padre se mata, pero al aclararse que el culpable había sido su socio es readmitido. Comentarios  Manrupe y Portela opinan del filme: \"historia liviana y buenos exteriores reales, en una película que debería verse para estudiar el momento y la sociedad de esos tiempos\". El crítico  Di Núbila  señala que la química que generó Muiño con Magaña al establecer una relación de padre e hijo que se prolongó en  Viento Norte  y  El viejo doctor  para culminar en  Su mejor alumno . Destaca el cuidado puesto en la fotografía, escenografía, montaje, música y cámara que contribuyeron a contar una historia (aunque fuera lo que quedaba de lo que se había intentado contar) y concluye: \"Por todo eso, más haber apuntado sus cámaras hacia ambientes y personajes inéditos,  Cadetes de San Martín  pudo captar un público más exigente, cuyo interés permitió ganar las pantallas de nuevas y mejores salas. Con las multitudes reclutadas de ahí en adelante engrosó tanto el contingentes de aficionados al cine argentino que 1937 marcó la iniciación del más esplendoroso período de su época de oro\" Reparto Ángel Magaña Enrique Muiño Elías Alippi Orestes Caviglia Matilde Rivera Rosita Contreras Oscar Villa Blanca del Prado Héctor Coire Héctor Calcaño Fernando Borel Trío Vázquez Vigo Judith Sulian",
      "fileSize": 895915582,
      "addedAt": "2026-01-07T00:07:45.166Z",
      "thumbnail": "https://archive.org/services/img/cadetes-de-san-martin-1937",
      "language": "spa",
      "year": 1937,
      "collection": "feature_films",
      "downloads": 42
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "7 min",
    "imdbVotes": null,
    "Genre": "Documentary, Short",
    "Plot": "N/A",
    "Director": "Alberto Botelho",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "Portuguese",
    "Country": "Brazil",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1765953",
    "tt1446155",
    "tt2080409",
    "tt1248947",
    "tt1315413",
    "tt16899218",
    "tt33400258",
    "tt1846498",
    "tt0408098",
    "tt0812201",
    "tt13364232",
    "tt0896825"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:45.166Z"
}