{
  "movieId": "tt1743711",
  "title": "Red Eagle",
  "year": 2010,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R8A2tyTpV8I",
      "id": "R8A2tyTpV8I",
      "title": "RED EAGLE - Superhelden, Action - Jetzt den ganzen Film kostenlos in HD schauen bei Moviedome",
      "description": "►Ganzer Film. Superhelden Filme wie \"Red Eagle\" kostenlos und in voller Länge bei Moviedome entdecken.\n\nKnallharte Superhelden-Action aus Thailand, mit einem maskierten Rächer, der sich weder vor Batman noch vor Black Panther zu verstecken braucht. \n\nJetzt kostenlos und in ganzer Länge bei #Moviedome sehen.\n\n►Die Handlung:\nIn naher Zukunft droht Bangkok in einem Sumpf aus Verbrechen und Korruption zu versinken. Wehrlos stehen die Bürger der Polizei und den Politikern gegenüber, die eine menschenverachtende Politik betreiben. Doch es besteht noch Hoffnung: \"Red Eagle\", ein Superheld mit roter Maske, rächt die unterdrückte Bevölkerung und richtet den Abschaum der Stadt. Und dieser Superheld braucht weder die Avengers noch die Justice League um für Gerechtigkeit zu sorgen.\n\nAbonniere Moviedome kostenlos für mehr #ganzeFilme ► http://bit.ly/MoviedomeAbo\n\nJetzt den #Superhelden Film „Red Eagle“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #kostenlos #movie #film #spielfilm #HD #Superheld #Superhero #RedEagle #Action #Avengers #JusticeLeague #Batman \n\nEnglischer Titel: The Red Eagle\nFilmlänge: 124 Minuten\nRegie: Wisit Sasanatieng\nFSK: 18\nErstveröffentlichung: 2010\n\n\nDie Darsteller\nAnanda Everingham (bekannt aus „Shutter“) als Red Eagle\nYarinda Boonak (bekannt aus „Dew“) als Wassana\nWannasing Prasterkul (bekannt aus „Lhong“) als Lieutenant Chart Wuttikra\nRon Smoorenburg (bekannt aus „Jackie Chan ist Nobody“, „Kate“) als Black Devil\n\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nJetzt den Superheldenfilm „Red Eagle\" in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:34:12.478Z",
      "thumbnail": "https://i.ytimg.com/vi/R8A2tyTpV8I/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAstp_MI2wEcVFq3qdtlY1nUJduLw",
      "duration": 7818,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "130 min",
    "imdbRating": 5.2,
    "imdbVotes": 930,
    "Genre": "Action, Sci-Fi, Thriller",
    "Plot": "Year 2016, Bangkok is a rotten capital infested with chaos and criminals. Widespread corruption by politicians has dipped the moral compass to a new low, and the government's hasty plan to construct a nuclear power plant has spread fears among villagers and enivironmental activists. Amidst the mood of despair, a hero emerges. He goes after filthy politicians and vile criminals, handing out his own brand of justice when the law fails to fuction. No one knows his true identity. Every time he kills, he leaves a name card which says: The Red Eagle. But Red Eagle is a hunter who's also being hunted. An assassin, called Black Devil, has been sent by a crime lord to kill him. As his past returns to haunt him, the tortured hero is facing a conflict that will decide not just his own destiny, but the destiny of his entire nation.",
    "Director": "Wisit Sasanatieng",
    "Writer": "Wisit Sasanatieng",
    "Actors": "Ananda Everingham, Yarinda Boonnak, Wannasing Prasertkul",
    "Language": "Thai",
    "Country": "Thailand",
    "Awards": "1 win & 5 nominations"
  },
  "relatedMovies": [
    "tt1043651",
    "tt1705773",
    "tt1564571",
    "tt2175184",
    "tt6724510",
    "tt1353997",
    "tt2275499",
    "tt0489018",
    "tt2381317",
    "tt1136683",
    "tt1183733",
    "tt2130142"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:20:31.648Z"
}