{
  "movieId": "tt1727546",
  "title": "The Little Lamb: A Christmas Story",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/wankayar",
      "id": "wankayar",
      "title": "The Little Lamb: A Christmas Story",
      "description": "Title: The Little Lamb: A Christmas Story Summary: A lamb that had wandered off plays a significant part in the Nativity. Directed by: REMOVE_TAG Actors: Production Company: United World Films Release Date: 1955 (USA) Aspect Ratio: 1.33 : 1 A lamb that had wandered off plays a significant part in the Nativity.",
      "fileSize": 104333174,
      "addedAt": "2026-01-07T00:13:06.701Z",
      "thumbnail": "https://archive.org/services/img/wankayar",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 1628
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "9 min",
    "imdbRating": 5.3,
    "imdbVotes": 28,
    "Genre": "Short, Drama, Family",
    "Plot": "The Little Lamb (1955) is a nine-minute black-and-white live-action film sharing the story of the Nativity. It focuses on a little lamb who, by wandering off into the wilderness, leads two shepherds to receive a message from an angel. The angel tells them to visit Bethlehem where a savior has been born. They set out with their third companion shepherd taking the little lamb with them. They arrive in Bethlehem to find Joseph and Mary with the newborn baby Jesus in his manger. The baby is cold, and the shepherds place the little lamb beside the child to keep him warm. Realizing the significance of the birth, the shepherds kneel and pray while Mary watches over them. All the actors in the film are uncredited, but famed actress Maureen O'Sullivan, perhaps best known for appearing in Tarzan films in the 1930s, plays Mother Mary in this simple Nativity story.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Morris Ankrum, Maureen O'Sullivan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0344506",
    "tt1207008",
    "tt0231716",
    "tt0234435",
    "tt0470339",
    "tt0463594",
    "tt0417062",
    "tt0330942",
    "tt12658952",
    "tt0259898",
    "tt2015402",
    "tt0002356"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.701Z"
}