{
  "movieId": "tt1711507",
  "title": "The Legend of Action Man",
  "year": 2010,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheLegendOfActionMan_639",
      "id": "TheLegendOfActionMan_639",
      "title": "The Legend of Action Man",
      "description": "Made on an ultra-low budget of $200, Dingoman Productions proudly presents their first feature film, The Legend of Action Man, a comedy about a mediocre, self-proclaimed superhero Action Man (James McEnelly) who is warned that if he causes any more trouble around town he'll be put under house arrest. In comes Mark (Trey Dixon), a fresh-faced news intern looking for a big story to get his work on TV, and Action Man seems like an interesting subject. That is, until a murder is reported and the new duo suspects John Magnum (Chris Newhouse), a suspicious millionaire who just moved in down the block. Can Action Man save the city of Sugar Land from his first real villain, or is he in over his head?",
      "fileSize": 1813746883,
      "addedAt": "2026-01-07T00:07:05.033Z",
      "thumbnail": "https://archive.org/services/img/TheLegendOfActionMan_639",
      "year": 2010,
      "collection": "feature_films",
      "downloads": 33622
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "102 min",
    "imdbRating": 6.9,
    "imdbVotes": 28,
    "Genre": "Comedy, Mystery",
    "Plot": "In the quiet city of Sugar Land, one man fights to keep his city safe. Unfortunately, he's the one causing half the crimes, and Action Man is warned that if he steps out of line one more time he'll be put under house arrest. In comes Mark, a news intern looking for a story to get his work on the News, and Action Man seems like an interesting case. That is, until a murder is reported and the new duo suspects Jonathan Magnum, a suspicious millionaire who just moved in down the block. Can Action Man stop his first real villain, or is he in over his head?",
    "Director": "Andy Young",
    "Writer": "Derek Papa, Andy Young",
    "Actors": "James McEnelly, Trey Dixon, Derek Papa",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1100053",
    "tt2130142",
    "tt1158278",
    "tt0478210",
    "tt0039645",
    "tt0037960",
    "tt0033613",
    "tt0038577",
    "tt0036695",
    "tt0026085",
    "tt0034488",
    "tt0019690"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.033Z"
}