{
  "movieId": "tt1703911",
  "title": "Blind Alley",
  "year": 2011,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=knSHUkJwBWI",
      "id": "knSHUkJwBWI",
      "title": "Blind Alley - Im Schatten lauert der Tod (ganze Horrorfilme auf Deutsch, komplette Horrorfilme) *HD*",
      "description": "► Horrorfilm mit Leonor Varela (\"Blade II\") aus dem Jahr 2011.\n► Täglich neue Spielfilme online schauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Dir gefällt Netzkino? Dann lass uns ein Like da: http://bit.ly/NetzkinoFacebook\n\n..................................................................\n\nBLIND ALLEY - IM SCHATTEN LAUERT DER TOD (2011)\nOriginaltitel: El Callejón\nMit: Ana de Armas, Diego Cadavid, Leonor Varela\nRegie: Antonio Trashorras\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nVielleicht ist das Ende ihres elenden Daseins als Zimmermädchen doch endlich in Sicht! Schon morgen kann Rosas Traum von der Model-Karriere wahr werden. Nur noch schnell die Kleider gewaschen und früh zu Bett – das war zumindest der Plan. Doch ehe sie sich's versieht, ist die junge Kubanerin in einer noch schlimmeren Sackgasse gelandet: verbarrikadiert in einem Waschsalon, vor dessen Tür ein irrer Killer lauert. Wie kommt sie da raus und vor allem: wie hält sie den Killer davon ab zu ihr rein zu kommen?\n\n\n\n..................................................................\n\nNETZKINO WEBSITE\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n\nUNSERE APPS\n✘ Android - http://bit.ly/NetzkinoAndroid\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n✘ Google+ - https://plus.google.com/+netzkino\n\n........................................­..........................\n\nLUST AUF MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Horrorfilme: http://bit.ly/NetzkinoHorror\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists\n\n........................................­..........................",
      "addedAt": "2025-12-24T00:13:36.677Z",
      "thumbnail": "https://i.ytimg.com/vi/knSHUkJwBWI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBbAcaSmMWNvwsrs5Nrjckt5ilfqw",
      "duration": 4593,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5yWmf1AJOM8",
      "id": "5yWmf1AJOM8",
      "title": "Blind Alley - Im Schatten lauert der Tod - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Horrorfilm “Blind Alley - Im Schatten lauert der Tod” in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\nRosa erwartet ein lang ersehntes Fotoshooting, für das sie am Abend zuvor in einen Waschsalon muss, um ihr Outfit zu reinigen. Dort trifft sie auf einen freundlichen und gutaussehenden Herren, der sich als Soziopath entpuppt. Um ihr Leben zu retten, willigt sie ein, ein Spiel mit ihm zu spielen.\n\nJetzt “Blind Alley - Im Schatten lauert der Tod” kostenlos als ganzen Film auf deutsch sehen\nDer Thriller, mit dem Originaltitel “El callejón”, wurde in Spanien im Jahr 2011 verfilmt.\nDie junge Rosa trifft am späten Abend in einem Waschsalon auf einen sympathischen und gutaussehenden Mann. Nach einiger Zeit zeigt er sich als Serienkiller und gibt ihr die Chance ihr Leben zu retten, indem sie an einem sadistischen Spiel teilnimmt.\nProduziert wurde der Film von Enrique Parbus und Mercedes Gamero.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme ►www.moviedome.de\n\nFolge uns auch auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\n#Moviedome #Elcallejón #movie #film #spielfilm \n\nFilmlänge: 73 Minuten\nDVD-Start (DE): 12.04.2013\n\n\nWer sind die Schauspieler?\nDie Charaktere werden von folgenden Schauspielern verkörpert: \nAna de Armas (bekannt aus War Dogs und Blade Runner 2049) in der Rolle der Rosa\nLeonor Varela (bekannt aus Blade II und Goal! II) in der Rolle der Madre\nDiego Cadavid in der Rolle des Gabriel\nJudith Diakhate in der Rolle der Nyela\nJeff Gum in der Rolle des Mitch\n\nAna de Armas in Blind Alley - Im Schatten lauert der Tod\nAna de Armas verkörpert in “Blind Alley - Im Schatten lauert der Tod” die Hauptrolle der Rosa. In dem Thriller wird eines Abends das Leben des angehenden Models von einem Soziopathen bedroht.\nIhren internationalen Durchbruch erlangte die kubanisch-spanische Schauspielerin 2015 durch ihre Rolle der Bel in dem Erotik-Horror-Thriller “Knock Knock”. Seither ist sie in Filmen wie “Anabel” oder “Hands of Stone” neben Berühmtheiten wie Robert De Niro oder Scott Eastwood zu sehen. Die Schauspielerin gewann über die Jahre immer mehr Anerkennung und Lob für ihre Auftritte, darunter auch von Daniel Craig. Der 007-Darsteller hatte sich für die Dreharbeiten des “James Bond 007: Keine Zeit zu sterben” Ana de Armas an seiner Seite gewünscht und so werden die beiden 2021 gemeinsam in dem neuen Bond Film zu sehen sein.\n\nDie Handlung und Szenen von “Blind Alley - Im Schatten lauert der Tod”\nRosa hat ihre Heimat Kuba verlassen, um in Spanien im Showgeschäft erfolgreich zu werden. Als sie endlich die Chance auf einen Modeljob hat,  sieht sie eine Möglichkeit, endlich nicht mehr als Dienstmädchen arbeiten zu müssen.\nAls das junge Mädchen spät abends in einen Waschsalon geht, um ihr Outfit für den nächsten Tag zu reinigen, trifft sie dort auf einen sympathischen Mann, der ihr Gesellschaft leistet. Was sie dabei nicht weiß ist, dass es sich dabei um einen Serienkiller handelt, der ein sadistisches Spiel für Rosa vorbereitet hat.\n\nDie Synchronisation \nMaja Maneiro in der Rolle der Rosa\nSonja Spuhl in der Rolle der Madre\nRobert Glatzeder in der Rolle des Gabriel\nSabine Mazay in der Rolle der Nyela\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länger diverser Genres bei MovieDome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier.\n\nJetzt Film und Trailer kostenlos auf deutsch schauen\nBlind Alley - Im Schatten lauert der Tod I Trailer I 2011 I Alle Filminfos\n\nGenre\nDer Thriller “Blind Alley - Im Schatten lauert der Tod” kann kaum an Spannung überboten werden. Als Zuschauer fiebert man den gesamten Horrorfilm lang mit der Hauptdarstellerin mit und wird von einem Vorfall nach dem anderen mitgerissen.\nWer auf der Suche nach blankem Horror und Schrecken ist, trifft mit diesem Thriller definitiv die richtige Wahl.\n\nGanzer Film auf deutsch\n“Blind Alley - Im Schatten lauert der Tod” ist ab sofort in voller Länge auf deutsch verfügbar. In der Synchronisation aus dem Englischen in die deutsche Sprache sind weder spannende Dialoge noch wichtige Pointen des Handlungstrangs verloren gegangen.",
      "addedAt": "2025-12-26T00:35:59.724Z",
      "thumbnail": "https://i.ytimg.com/vi/5yWmf1AJOM8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBBcV5ujSUB_Slww1ESohuXV1PNrA",
      "duration": 4570,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "76 min",
    "imdbRating": 4.4,
    "imdbVotes": 1030,
    "Genre": "Horror, Thriller",
    "Plot": "A beautiful young dancer, Rosa (Ana De Armas) comes home from an audition (which comprises the background for the opening credits), feeling quietly confident about getting a break. Just as she arrives, her very sketchy cellphone rings, to tell her she has a call-back the next day. Excited, she visits the nearby laundromat to wash her costume, where she is spooked by various members of her neighbourhood's nightly denizens.",
    "Director": "Antonio Trashorras",
    "Writer": "Antonio Trashorras",
    "Actors": "Ana de Armas, Diego Cadavid, Leonor Varela",
    "Language": "Spanish",
    "Country": "Spain, Mexico, Colombia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1579252",
    "tt1869470",
    "tt1386583",
    "tt1767382",
    "tt2175184",
    "tt1836212",
    "tt2082276",
    "tt1727358",
    "tt1227789",
    "tt1745672",
    "tt1727258",
    "tt1411232"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:27.621Z"
}