{
  "movieId": "tt1765974",
  "title": "Operation Ivy",
  "year": 1952,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/OperationIVY1952",
      "id": "OperationIVY1952",
      "title": "Operation IVY",
      "description": "\"The island of Elugelab is missing!\" President Eisenhower heard this short report on the Mike shot in Operation IVY from Gordon Dean, Chairman of the Atomic Energy Commission. Mike was the first full-scale hydrogen explosive device to be tested, yet was only a scientific test of a thermofusion implosion device concept. Mike was not a deliverable weapon. The island where the device was detonated was vaporized. The hole Mike left was big enough to accommodate 14 Pentagon-size buildings and deep enough to hold 17 story building under water, in a crater one mile in diameter and approximately 175 feet deep. Mike's yield was an incredible 10.4 megatons, signaling the proof-tested expansion of the nuclear explosive technology concepts from nuclear fission to thermofusion. Thermofusion is the same process that occurs in the core of the Sun. This test, however, was not the first test of a liquid thermonuclear explosive. The first test ever conducted into the fusion principle occurred during Operation GREENHOUSE at Eniwetok in 1951, with the 225 kiloton George test. Another test of hydrogen in the center of a nuclear weapon before Mike was during the GREENHOUSE Item test at Eniwetok, proving a critical stockpiling yield efficiency concept, called \"boosting.\" The detonation of the Mike device was the climax of an intense debate over what would be the nation's correct response to the startling news in 1949 that the Soviet Union had detonated a nuclear weapon. Many wanted the U.S. to develop the means to produce and field a large number of fission bombs of varying yields which could be used for tactical purposes. Others believed that the country should institute a crash program like the Manhattan Project to develop a Super weapon based on the idea of forcing together or fusing light atoms with a fissile device to produce enormous amounts of energy. After a bitter fight among scientific, government and military officials, the President opted for a crash program to demonstrate the Super bomb, now called a hydrogen or thermonuclear weapon. Many designs were evaluated and rejected until the Mike proposal came along. This concept involved the cooling of hydrogen fuel to a liquid form, near absolute zero, and fusing the hydrogen nuclei into helium using a nuclear fission bomb as a trigger. The Mike device was a 22-foot-long, 5-foot-diameter cylinder housing canisters of liquid hydrogen fuel. These liquid fuel canisters were heavily encased with the nuclear fission explosive trigger. The Mike shot occurred on October 31, 1952, as scientists watched from 40 miles away as the mushroom cloud rose into the stratosphere. Mike was followed on November 15, 1952 by the King shot, the largest all-fission device ever tested by the United States. It was a uranium super oralloy Mark 18 prototype implosion core in a Mark 6D casing, with an advanced warhead that enabled it to produce 500 kilotons of equivalent TNT explosive energy. About the Mike phase narrator: Reed Hadley narrated and hosted this portion. Parallel to his public life as a radio, television, and movie star -- with the credit of a star on the Hollywood Walk of Fame -- Reed Hadley worked in a top secret military role as a presenter for Armed Forces Special Weapons Project (AFSWP) films. AFSWP produced films through the United States Air Force Lookout Mountain Laboratory located in Hollywood, California. These AFSWP films covered analysis and documentary archives in nuclear weapons testing, special weapons systems development, as well as Civil Defense films. A key role of the laboratory was to produce films for national defense projects archives, military training films, and documentation for top secret oversight and appropriations committees of United States Congress. About the King phase narrator: Carey Wilson narrated this portion. Wilson was a very influential producer and scriptwriter in Hollywood -- principally with MGM -- and led a double life role as a \"Q-Clearance\" presenter and contributing scriptwriter in top secret films produced by the Atomic Energy Commission and the Armed Forces Special Weapons Project (AFSWP). Q-Clearance was a top secret classification within the Atomic Energy Commission, later renamed to the Department of Energy. Interviewed in this film was the firing team commander, Stanley W. Burriss. He was an engineer by profession. He later became among the greatest forces for creating the U.S. Fleet Ballistic Missile, and later, critical contibutions to generations of Polaris, Poseidon, and Trident weapons systems. He managed this unprecedented scientific, engineering, and command management undertaking, which had profound effects on the civilian space program. Burriss retired as president of Lockheed Missiles and Space Company, after 25 years with Lockheed, and died in the spring of 1979. Captain Jack S. Hartwick, appearing near the beginning of the film in the bridge, was the commander of the USS Estes, host to the Mike device firing control and Joint Task Force 132 operations command center. Major General Percy Clarkson was supreme commander of Joint Task Force 132. Some notes about filming techniques of 1950s color filming: 1950s color film was not capable of satisfactory sensitivity to light in darkness. A workaround was to film during the daylight, using a blue filter. The low sensitivity to blue light -- the most sensitive was yellow -- of the color film made for dark scenes that simulated nighttime or hours of darkness. Notice the bright reflections of ambient light and the tall shadows during the \"hours of darkness\" scenes. This was not the moon creating these shadows. The film's hours of darkness scenes appear very dark in digitized form, played on a personal computer. Burning the DVD file as a data import file (without reencoding in MPEG2!) will have a much brighter picture when played on a home TV or theater system. Comments concerning DOE/DoD film releases in VHS: Disappointment and irritation are the common reactions to the DOE release procedure of transferring their Digital Betacam format masters to VHS. This change in colorspace formats creates very pale, horizontal lines in the picture. The ritual procedure of releasing sanitized and unclassified DOE/DoD films through the Authorized Derivative Declassification (ADD) experts at Kirtland is to edit the transfer of 16 mm celluloid to Digital Betacam master tapes by selectively turning off the capture of audio, video, or both to preserve DOE/DoD secrets. VHS NTSC tape releases are then derived from Digital Betacam tapes. Related sites: http://www.archive.org/details/OperationGreenhouse1951 http://www.archive.org/details/TumblerSnapper1952 http://www.archive.org/details/CastleCommandersReport1954 http://www.archive.org/details/MilitaryEffectsonOperationRedwing1956",
      "fileSize": 4146599752,
      "addedAt": "2026-01-07T00:06:45.465Z",
      "thumbnail": "https://archive.org/services/img/OperationIVY1952",
      "language": "English",
      "year": 1952,
      "collection": "feature_films",
      "downloads": 147938
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "63 min",
    "imdbRating": 7.1,
    "imdbVotes": 23,
    "Genre": "Documentary",
    "Plot": "A documentary account of the preparation for, and execution of Operation Ivy, the eighth series of American nuclear tests including Ivy shot \"Mike\", the first successful full scale test of a multi-megaton, thermonuclear weapon (hydrogen bomb) and \"King\" a second test with an air drop bomb. The tests took place on Enewetak Atoll in the Marshall Islands.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Norris E. Bradbury, P.W. Clarkson, Alvin. C. Graves",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt5172084",
    "tt13721236",
    "tt14091630",
    "tt0000537",
    "tt0178247",
    "tt0185893",
    "tt0276783",
    "tt0334912",
    "tt3100486",
    "tt0178309",
    "tt0178981",
    "tt1515754"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:45.465Z"
}