{
  "imdbId": "tt1742682",
  "title": "The Colombian Connection",
  "year": 2014,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7W_UMZ6H048",
      "id": "7W_UMZ6H048",
      "title": "The Colombian Connection (Actionfilm auf Deutsch in voller Länge, Actionfilme kostenlos anschauen)",
      "description": "► Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Knallharter Action-Thriller um Verrat und einen Auftrag ohne Ausweg – mit Tom Sizemore (“Der Soldat James Ryan” & “Black Hawk Down”)!\n\nTHE COLOMBIAN CONNECTION (2011)\nOriginaltitel: Through the Eye\nMit: Robert Thorne, Tom Sizemore, Bertie Higgins, Bianca Malinowski\nRegie: Julian Higgins\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nEs ist das Jahr 1976. Jack Hooks ist ein ehemaliger Cop, der von seinem Partner Frank Rossi verraten wurde und für ein Verbrechen, mit dem er nichts zu tun hatte, in den Knast soll. Die DEA jedoch weiß, dass er zu Unrecht verurteilt wurde und bietet ihm einen Deal an: Er wird begnadigt, wenn er dabei hilft, seinen alten Freund Frank bei dessen Drogengeschäften auffliegen zu lassen. Dass es sich bei diesem Deal um ein „Do-or-Die“-Job handelt ist allen bewusst, denn die Drogenmafia versteht keinen Spaß. Um das Vertrauen des ebenso mächtigen wie gewalttätigen Drogenboss Carlos Huerta zu gewinnen muss Jack eine Ladung Drogen durch die Meerenge zwischen Kuba und Yucatan, genannt „The Eye“, bringen. Hier sind die Polizei und das Militär stets präsent. Jack nimmt das Risiko auf sich, denn Carlos versorgt Frank mit Drogen und wird somit zum Ziel für Jacks Auftrag. Aber die Gangster kommen ihm auf die Schliche und ihm bleibt nur noch die Flucht in den mexikanischen Dschungel…\n#Spielfilm #ganzerFilm #Actionthriller\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinem monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-24T00:06:01.847Z",
      "thumbnail": "https://i.ytimg.com/vi/7W_UMZ6H048/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDwZz8DgFqldXiDweRTBrFr-ZoamA",
      "duration": 5952,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "100 min",
    "imdbRating": 3.7,
    "imdbVotes": 302,
    "Genre": "Action, Crime, Mystery",
    "Plot": "1976 is a dangerous year in the Straits of Yucatan. Jack Hooks, a former cop set up by his corrupt partner is sent to jail for a drug crime he didn't commit. After being yanked out of prison with an early-release deal offered by the DEA, he is sent on a do-or-die mission to bring down the drug trade of his former partner Frank Rossi and his contacts. Hooks has no choice but to plunge into the marijuana-smuggling underworld by making one big run through \"The Eye\": the narrow channel that flows between Cuba and Mexico, and into the heart of a violent Colombian drug ring. At the head of the ring is Carlos Huerta, the ruthless drug lord who is Rossi's supply source and Jack's final objective--if he can escape the Colombian jungles before his clandestine relationship with Huerta's young courtesan is discovered and threatens his freedom and the lives of himself and his crew. By Bertie Higgins, Julian Higgins, and Larry Madill.",
    "Director": "Julian Higgins",
    "Writer": "Bertie Higgins, Julian Higgins, Larry Madill",
    "Actors": "Robert Thorne, Tom Sizemore, Bertie Higgins",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "4 wins & 3 nominations total"
  },
  "relatedMovies": [
    "tt5767628",
    "tt0023478",
    "tt0029596",
    "tt0023145",
    "tt3390572",
    "tt0179249",
    "tt0032763",
    "tt7937440",
    "tt0035570",
    "tt2893780",
    "tt3213078",
    "tt1742334"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:12:02.075Z"
}