{
  "imdbId": "tt1716759",
  "title": "Pressed",
  "year": 2011,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vGp6uF5M8MA",
      "id": "vGp6uF5M8MA",
      "title": "Pressed | Full Movie | Hollywood Action Crime | Luke Goss",
      "description": "Pressed - Brian, (Luke Goss, DEATH RACE 2, HELLBOY II) is desperately trying to seek a \"quick fix\" business deal that will put him back on top financially after being let go from his executive position at one of the top investment firms. Brian decides to go \"all in\", investing the rest of his savings into a short-term drug deal that would allow him to preserve his high-end life style.  When two recluse teenagers unknowingly intercept the illicit drug money hidden in the back seat of a car, Brian’s deal is botched. He soon finds himself in a desperate situation as he owes a merciless drug lord the missing money. At the same time the teenagers learn that they've stolen from the wrong people. What follows is a twisted tale of greed, deceit, murder and wealth.  In this Crime-thriller, three relationships collide in a fantastic saga where only one will get out alive.\n2011.  Stars: Luke Goss, Tyler Johnston, Jeffrey Ballard\n**This film is under non-exclusive license from Framerate Technologies LLC.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:45:12.337Z",
      "thumbnail": "https://i.ytimg.com/vi/vGp6uF5M8MA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBG_9nuzcs0AYoQdH9xiHYXYq_NEQ",
      "duration": 6196,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "88 min",
    "imdbRating": 4.6,
    "imdbVotes": 1466,
    "Genre": "Action, Crime, Drama",
    "Plot": "Two joyriders Jesse and Sam discover something hidden in the back seat of the car that could change their lives forever. Brian, unknown to Jesse and Sam, is desperately trying to seek a \"quick fix\" business deal that will put him back on top financially after being let go from his executive position at one of the top investment firms. Brian decides to go \"all in\", investing the rest of his savings into a short-term drug deal. After Jesse and Sam intercept the illicit drug money, they soon learn that they've stolen from the wrong people. A twisted tale of greed, deceit, murder and wealth, PRESSED is an action-drama feature where three relationships collide. It changes lives, some of them for good.",
    "Director": "Justin Donnelly",
    "Writer": "Justin Donnelly, Christopher Donaldson",
    "Actors": "Luke Goss, Tyler Johnston, Jeffrey Ballard",
    "Language": "English",
    "Country": "Canada",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2836316",
    "tt2466346",
    "tt1893195",
    "tt1390397",
    "tt2175098",
    "tt1743985",
    "tt2165735",
    "tt2650986",
    "tt1206086",
    "tt2119552",
    "tt2717558",
    "tt0817545"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:56:02.795Z"
}