{
  "imdbId": "tt1753786",
  "title": "Mercury Plains",
  "year": 2016,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aQ97XgGZiFQ",
      "id": "aQ97XgGZiFQ",
      "title": "Mercury Plains – Wüstensöhne (ACTIONFILM mit SCOTT EASTWOOD, ganzer Actionfilm auf Deutsch 2025)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Nach einer durchzechten Nacht in Mexiko wacht SCOTT EASTWOOD (\"Texas Chainsaw 3D\") ohne Bargeld auf. Hilfe erhält er von einer mysteriösen Gruppe, die ihn auch direkt rekrutiert. Bald wittert er jedoch, dass hier etwas nicht stimmt...\n\nMERCURY PLAINS (2016)\nOriginaltitel: Mercury Plains\nMit: Scott Eastwood, Nick Chinlund, Andy Garcia, Jorge A. Jimenez\nRegie: Charles Burmeister\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nEine durchzechte Nacht in Mexiko: Nachdem der junge texanische Draufgänger Mitch (Scott Eastwood) zusammen mit seinem Kumpel in einer Strip-Bar ordentlich einen drauf gemacht hat, handelt er sich eine amtliche Portion Ärger ein. Keine Spur von seinem Freund und auch sein Bargeld ist verschwunden. Am nächsten Morgen wird Mitch über eine Zufallsbekanntschaft von einem mysteriösen Captain rekrutiert, der ihm viel Geld für seine Dienste verspricht. Der charismatische Captain (Nick Chinlund) leitet eine paramilitärische Gruppe Jugendlicher, die angeblich im Auftrag des FBI gegen die mexikanischen Drogenkartelle kämpft. In der Wüstenbasis angekommen, steigt Mitch schnell in der Gunst des Captains. Doch Mitch wird den Eindruck nicht los, dass an der ganzen Sache etwas faul ist. Als die Kämpfe immer blutiger werden, die Zahl der getöteten Opfer auf beiden Seiten steigt und Mitch einen auffälligen, knallgelben Koffer voll Bargeld erbeutet, trifft er eine weitreichende Entscheidung: Mitsamt dem Koffer möchte er zurück in die USA flüchten. Doch dafür muss er zuerst den Captain ausschalten...\n#Netzkino #ganzerFilm #scotteastwood \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:47:48.184Z",
      "thumbnail": "https://i.ytimg.com/vi/aQ97XgGZiFQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD9_JruCzX5hKn3zo4oQhsm4lTTSw",
      "duration": 6044,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "102 min",
    "imdbRating": 4.3,
    "imdbVotes": 1466,
    "Genre": "Action, Adventure, Drama",
    "Plot": "A troubled young man runs away to Mexico, where he is recruited to join a paramilitary group of teens fighting the drug cartels. Isolated in the desert, he proves himself by becoming The Captain's top soldier, but questions the group's true purpose. As the Mexican police close in, he realizes that his only way out is to escape back to America, but first he must outwit The Captain.",
    "Director": "Charles Burmeister",
    "Writer": "Charles Burmeister",
    "Actors": "Scott Eastwood, Nick Chinlund, Andy Garcia",
    "Language": "English, Spanish",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2457330",
    "tt6083388",
    "tt2215673",
    "tt5066556",
    "tt7108074",
    "tt6065046",
    "tt4547120",
    "tt7204400",
    "tt6215044",
    "tt4951982",
    "tt4743226",
    "tt3417334"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:23:43.944Z"
}