{
  "imdbId": "tt1757880",
  "title": "Take One: A Documentary Film About Swedish House Mafia",
  "year": 2010,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/PearlsOnTheOceanFloordocumentary2010",
      "title": "PearlsOnTheOceanFloordocumentary2010",
      "description": "Synopsis Pearls on the Ocean Floor is a thought-provoking documentary examining the lives of Iranian female artists living and working in and outside the Islamic Republic. This incisive study, featuring interviews with artists Shadi Ghadirian, Shirin Neshat, and Parastou Forouhar, captures the uncertainty of this momentous time in Iranâs history. Speaking with grace and honesty, these women express what is seldom seen in the western media: unique individual perspectives regarding issues of identity, gender, and the the role that art plays in challenging the traditional stereotypes often associated with women in Iran. -- UKIFF With: Shadi Ghadirian, Shirin Neshat, Parastou Forouhar, Haleh Anvari, Sara Rahbar, Leila Pazooki, Afshan Ketabchi, Malekeh Nayiny, Gohar Dashti, Pooneh Maghazehe, and Taravat Talepasand -------------------------------------------------------------------------------- The ubiquitous images of security forces cracking down on demonstrators in Iran garnered global media attention throughout the last twelve months. Last June all eyes were on the Islamic Republic of Iran as its citizens took to the streets to protest the results of a disputed election. Thirty years after the Islamic Revolution of 1979, a proud nation once again stood at a crossroads. The Green movement, built of a courageous populace seeking justice from an entrenched and imploding regime, continues to seek change in Iran, despite shockingly brutal government forces. There is no better time than the present to examine this fascinating nation and no better approach than through the visual imagery of female artists. It is women who have collectively bore the brunt of an oppressive regime and the bias of a western media that has repeatedly constructed one-dimensional images portraying them as humorless, repressed, second-class citizens in black chadors. Robert Adantoâs Pearls on the Ocean Floor challenges this stereotype and caricature obscuring the vibrant and robust culture in Iran and its diaspora. Professor Hamid Dabashi recently wrote, âa much more patient reading of the visual and performing arts of this generation is needed before we know what in the world it is doing.â Indeed, as the younger generation invents a new identity for the 21st century, replacing the religious ideology and revolutionary fervor of the stateâs credo, contradictions abound. Photographer Shadi Ghadirian explains that her work âtouches upon our struggle to hold on to our parentsâ and grandparentsâ traditional values and practices while experiencing the benefits of modernity without getting caught up in its vicesâ¦ Change is an inevitable process,â she says. Facing issues of identity, gender, and social restrictions, the artists featured in Pearls on the Ocean Floor speak with a compelling quiet reserve and a striking boldness. Their work reveals encounters between religion and secular modernity, change and tradition, contemporary life and history. These brave women know now more than ever that their voices must be heard and their people understood. Through their words and their art, the real Iran will be discovered and this important historical moment has been documented. -- Pearls On the Ocean Floor Official website",
      "id": "PearlsOnTheOceanFloordocumentary2010"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "45 min",
    "imdbRating": "7.2",
    "imdbVotes": "656",
    "Genre": "Documentary",
    "Plot": "A short film captured during Swedish House Mafia set from 2008 to 2011.",
    "Director": "Christian Larson, Henrik Hanson",
    "Writer": "N/A",
    "Actors": "Axel Hedfors, Sebastian Ingrosso, Steve Angello",
    "Language": "English, Swedish",
    "Country": "Sweden",
    "Awards": "N/A"
  },
  "relatedMovies": [
    {
      "imdbId": "tt1765782",
      "title": "Depeche Mode: Tour of the Universe - Barcelona 20/21.11.09",
      "year": 2010,
      "imdbRating": "8.3",
      "imdbVotes": "324",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt9459600",
      "title": "Silent Traces: Discovering Early Hollywood Through the Films of Charlie Chaplin",
      "year": 2010,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1556190",
      "title": "Nostalgia for the Light",
      "year": 2010,
      "imdbRating": "7.6",
      "imdbVotes": "6,254",
      "language": "Spanish, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt8508676",
      "title": "Swansea Love Story",
      "year": 2010,
      "imdbRating": "6.8",
      "imdbVotes": "34",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1667130",
      "title": "The Green Wave",
      "year": 2010,
      "imdbRating": "7.4",
      "imdbVotes": "363",
      "language": "German, Persian, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1972567",
      "title": "217",
      "year": 2010,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt3228494",
      "title": "The Mermaids' Tears: Oceans of Plastic",
      "year": 2010,
      "imdbRating": "8.4",
      "imdbVotes": "14",
      "language": "French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt4077512",
      "title": "Dog Lover",
      "year": 2010,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "Bosnian",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    },
    {
      "imdbId": "tt2124189",
      "title": "The Revelation of the Pyramids",
      "year": 2010,
      "imdbRating": "7.7",
      "imdbVotes": "1,813",
      "language": "French, English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt1810688",
      "title": "Luke Forward: Arizona Wants the F-35 Joint Strike Force Fighter",
      "year": 2010,
      "imdbRating": "N/A",
      "imdbVotes": "N/A",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Movie Central"
    },
    {
      "imdbId": "tt1475191",
      "title": "American Radical: The Trials of Norman Finkelstein",
      "year": 2009,
      "imdbRating": "7.8",
      "imdbVotes": "833",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2205413",
      "title": "Apollo 17: The Untold Story of the Last Men on the Moon",
      "year": 2011,
      "imdbRating": "7.0",
      "imdbVotes": "266",
      "language": "English",
      "sourceType": "archive.org"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T18:59:34.123Z"
}