{
  "imdbId": "tt1756659",
  "title": "The Orion",
  "year": 2010,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/TheOrion2010",
      "id": "TheOrion2010",
      "title": "The Orion (2010) Ø§ÙØ±ÙÙÙ",
      "description": "A student named Elham falls in love with likable Amir and loses her virginity. But her lover doesnât intend to marry her and so Elham finds herself in a desperate situation. When it comes out that the girl is no longer a virgin, she and her former boyfriend end up in court. Under such pressure, Amir quickly changes from an understanding friend into a pragmatist: he pushes his ex-lover to change her testimony and deny that it was he who dishonored her. According to tradition, there is only one way Elhamâs father can solve her unfortunate situation. Director Zamani Esmati cogently spells out the hopeless position of an intelligent, educated woman in a traditionally-structured Muslim society. Behind the compelling minimalist visuals of his psychological drama, shot in the best tradition of Iranian cinema, the filmmaker questions what kind of society considers Elhamâs tragic story acceptable. Renowned director and screenwriter Jafar Panahi contributed to this film as an editing consultant. -- KVIFF Cast: Nasim Kiani, Mehrdad Sheykhi, Hamed Baraghani, Mohamad Reza Farzad Dir. of Photography: Mansoor Heydari Editor: Zamani Esmati, Jafar Panahi Producer: Zamani Esmati Production: Nama Honar Karlovy Vary (Forum of Independents), London (World Cinema), Abu Dhabi (New Horizons Competition) Zamani Esmati's guerrilla-shot drama is a searing indictment of the treatment of women in certain sections of Iranian society. Zamani Esmati's guerrilla-shot drama, made on the streets of modern day Iran, is a searing indictment of the treatment of women in certain sections of that society. Elham (Nasim Kiani) is a young student who loses her virginity to astronomy professor Amir. Terrified that their secret will come out, Amir arranges a clandestine meeting for the couple with a backstreet doctor in the hope that he will sew up her hymen and cover any traces of their unmarried indiscretion. Things do not, however, run according to plan. Fully financed by Esmati and shot on location without seeking any official permits, Orion is a dread-filled, admittedly rough- around-the-edges look into a twilight Iran where threat and danger lurk beyond every corner. This often elliptical, fragmented tale nevertheless carries unforgettable power, right through to its bleak, ambiguous ending. -- BFI",
      "fileSize": 14070021,
      "addedAt": "2026-01-07T00:07:05.034Z",
      "thumbnail": "https://archive.org/services/img/TheOrion2010",
      "collection": "feature_films",
      "downloads": 1545
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "80 min",
    "imdbRating": 6.3,
    "imdbVotes": 54,
    "Genre": "Drama",
    "Plot": "Three old friends, amir(astronomor), mehdi(film maker) and rezaei(doctor), who were friends back there at high school are now gathered together to help elham (amir s girlfriend),but they face some problems made by the society they live in. of course these problems are much more heavier for elham,being a girl.",
    "Director": "Ali Zamani Esmati",
    "Writer": "Ali Zamani Esmati",
    "Actors": "Hamed Baraghani, Mohamad Reza Farzad, Nasim Kiani",
    "Language": "Persian",
    "Country": "Iran",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt1779491",
    "tt1794829",
    "tt1390397",
    "tt1468703",
    "tt1020558",
    "tt1446682",
    "tt2378045",
    "tt1972567",
    "tt1512093",
    "tt1763178",
    "tt1341167",
    "tt1509130"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:05.034Z"
}