{
  "imdbId": "tt1772258",
  "title": "Diary of a Sergeant",
  "year": 1945,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/misc-1129-diary-of-a-sergeant-1945",
      "id": "misc-1129-diary-of-a-sergeant-1945",
      "title": "Diary Of A Sergeant (1945)",
      "description": "This film on the rehabilitation of an injured soldier who lost his hands in action stars Harold Russell, the Academy Award-winning lead actor in \"Best Years of Our Lives.\" In this film, Harold Russell plays an American soldier who lost his hands in a training accident and goes on to tell the story of his medical rehabilitation at Walter Reed Army Medical Center in Washington D.C. The scenes show how he and his fellow amputees at the hospital at first despaired, and then found new hope in the prostheses and training available to amputees through the Army's medical corps. Russell learned to wear and to operate the hooks which replaced his hands, and became competent to perform many tasks he had once thought no longer possible.",
      "fileSize": 241482893,
      "addedAt": "2026-01-07T00:09:54.328Z",
      "thumbnail": "https://archive.org/services/img/misc-1129-diary-of-a-sergeant-1945",
      "year": 1945,
      "collection": "feature_films",
      "downloads": 42
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "22 min",
    "imdbRating": 7.4,
    "imdbVotes": 100,
    "Genre": "Documentary, Short",
    "Plot": "Harold Russell, an American soldier who lost his hands in a training accident, tells the story of his medical rehabilitation at Walter Reed Army Medical Center in Washington DC, how he and his fellow amputees at the hospital at first despaired and then found new hope in the prostheses and training available to amputees through the Army's medical corps. Russell learns to wear and to operate the hooks which replace his hands and becomes competent to perform many tasks he had once thought no longer possible. Discharged from the Army, he is welcomed into Boston College by college president William J. Murphy, S.J.",
    "Director": "Joseph M. Newman",
    "Writer": "N/A",
    "Actors": "Alfred Drake, Harold Russell",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0038264",
    "tt0038175",
    "tt15527684",
    "tt0276867",
    "tt8835616",
    "tt0036630",
    "tt2152805",
    "tt6710554",
    "tt1523561",
    "tt1966357",
    "tt0139491",
    "tt6056976"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:54.328Z"
}