{
  "imdbId": "tt1835948",
  "title": "Edge of the Empire",
  "year": 2010,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ucdeWG8q9pM",
      "id": "ucdeWG8q9pM",
      "title": "Edge of the Empire – Der Kampf um das Königreich - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt das Asia-Kampfepos \"Edge of the Empire – Der Kampf um das Königreich\" in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo \n\nDer Film spielt vor über 1.000 Jahren in der südlichen Mongolei. Als die Han das Volk der Tai brutal abschlachteten, schwor sich der junge Kumpawa, dass er seine Leute rächen und sie als ihr Anführer in die Freiheit führen würde. 20 Jahre später ist aus ihm ein Krieger geworden, der seine Fähigkeiten auf einem Fest unter Beweis stellen will. doch als der Han Libong sieht, dass einige der Tai auch im Umgang mit Waffen geschult sind, was ihnen streng verboten ist, wird ein neuer Führer eingesetzt, der die Steuern erhöht und drakonische Strafen verhängt. Genug ist genug, jemand muss handeln, und so versammelt Kumpawa die besten Kämpfer der Tai um sich, doch ihnen tritt eine Armee von 200.000 Han-Soldaten entgegen.\n\nJetzt “Edge of the Empire – Der Kampf um das Königreich” kostenlos als ganzen Film auf deutsch sehen.\n\n„Edge of the Empire – Der Kampf um das Königreich“ ist ein Actionfilm aus dem Jahr 2010 von Nirattisai Kaljareuk mit Arnut Rapanit, Arnuz Lapanich und Lalisa Sontirod. Ein toller Film über das Schicksal der Thais, die sich gegen die Han-Herrschaft auflehnen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #HD #movie #film #spielfilm #Action # \n \nFilmlänge: 114 Minuten \nDVD-Start (DE): 20.01.2014\n\nDie Darsteller \nArnut Rapanit in der Rolle Gumpawa \nLalisa Sontirod in der Rolle der Bunchawee\nAed Carabao in der Rolle des Bunpan\nSara Legge in der Rolle der Bua Kham\n\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\n\nGanzer Film auf deutsch \nDen Action-Film “Edge of Empire – Der Kampf um das Königreich” in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:47.246Z",
      "thumbnail": "https://i.ytimg.com/vi/ucdeWG8q9pM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCe_roQRvxKg7HlWTI-NZfCJLbUfA",
      "duration": 6836,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "117 min",
    "imdbRating": 5.3,
    "imdbVotes": 121,
    "Genre": "Action",
    "Plot": "\"Edge Of The Empire\" is based on a 1973 novel by Sanya Pholprasit. Set in southern Mongolia over 1,000 years ago, a small tribe called Tai was a colony under the power of the Great Han who enslaved them. Oppressed by the Han, the Tai unites to strike back for their freedom, justice, and country. This Thai historical epic revolves around heroes who sacrificed themselves to fight against the invasion of intruders and sought for the freedom of the country.",
    "Director": "Nirattisai Kaljareuk",
    "Writer": "N/A",
    "Actors": "Ad Carabao, Sara Legge, Arnut Rapanit",
    "Language": "Thai",
    "Country": "Thailand",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1411232",
    "tt1390397",
    "tt1468703",
    "tt1020558",
    "tt1331329",
    "tt1527823",
    "tt1694508",
    "tt1080019",
    "tt0423474",
    "tt1636629",
    "tt1561768",
    "tt1442571"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:20.233Z"
}