{
  "movieId": "tt1876303",
  "title": "Dream Cafe",
  "year": 1927,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dream-cafe_1927",
      "id": "dream-cafe_1927",
      "title": "Dream Cafe",
      "fileSize": 373796605,
      "addedAt": "2026-01-07T00:08:15.375Z",
      "thumbnail": "https://archive.org/services/img/dream-cafe_1927",
      "language": "English",
      "year": 1927,
      "collection": "feature_films",
      "downloads": 604
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "10 min",
    "imdbRating": 4.4,
    "imdbVotes": 16,
    "Genre": "Short, Musical",
    "Plot": "Starting in the 1920s, the Vitaphone portion of Warner Brothers had a special sound unit that experimented with talking pictures. Many were made before the big Warner release of \"The Jazz Singer\" and it was only because of them that these later full-length films were possible. However, there was a huge problem with these early films--the sound was not placed on film like it would later be but was on a separate record. This offered a variety of problems--such as synchronization problems, the records only worked a few times and then degraded and the records and films often got separated from each other. Only due to the internet have the various folks around the world been able to assemble these films once again and several sets have recently been released.This act starring Jimmy Clemons is a weird one and is a great example of a vaudeville-style act that didn't have a prayer of making it in films other than with these Vitaphone shorts. Clemons plays a drunk who recites poetry. His act is periodically interrupted by women who enter and dance a high-brow style dance. Then, at the end, Clemons does some of the most athletic and bizarre dancing you'll ever see. Only this portion is worth seeing--the rest is a serious chore to endure.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "James Clemens, Eileen Marcy, Wanda Allen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0430452",
    "tt0312544",
    "tt0778617",
    "tt5503754",
    "tt0367593",
    "tt0146584",
    "tt0147118",
    "tt0430477",
    "tt0179680",
    "tt1893190",
    "tt3251338",
    "tt0309243"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:15.375Z"
}