{
  "movieId": "tt1888554",
  "title": "Milltown Pride",
  "year": 2011,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MEhKwN1xPYE",
      "id": "MEhKwN1xPYE",
      "title": "Milltown Pride | Full Movie | Feel Good American Baseball Drama | Exclusive",
      "description": "Milltown Pride tells the story of a young man who dreams of playing professional baseball, his rise as a baseball star, his fall from grace, and the redemption he finds through faith and love.\nStars: Thomas Sneed, Rebecca Kaser, Ben Ascher\n*Licensed from FilmHub. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#baseball #MovieCentral #christianmovies",
      "addedAt": "2025-12-24T01:40:14.641Z",
      "thumbnail": "https://i.ytimg.com/vi/MEhKwN1xPYE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCtLSRXXM8YIlOxGwC3FfUzvQ1KHg",
      "duration": 8071,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "135 min",
    "imdbRating": 6.5,
    "imdbVotes": 227,
    "Genre": "Drama, Sport",
    "Plot": "There comes a time when every young man must sever the ties of home to seek his way in the world. For 17-year-old Will Wright, the point of departure comes with the crack of a bat as he makes the cut at Newton Mill. But it's not going to be an easy road. During the late 1920s in South Carolina, \"town folk\" rarely set foot on \"mill hill.\" Young Will has no problem breaking with tradition but his traditionalist father, Ezekiel Wright, explicitly forbids it. Yet Will feels the call to play ball so deep that he leaves home against his father's wishes and becomes the first \"townie\" ever to play for Newton. Golden dreams of a baseball career seem within his grasp-if only he can catch the eye of a minor league scout at the league championship. First, he has to survive a summer among the roaring, lint-blanketed world of textile spindles and looms. The clash of cultures is obvious from day one when Pike Spangler, \"Big Stick\" for the Newton Mill Sluggers, goes out of his way to knock Will down a few pegs. But the palpable tensions between mill players and Will fall away when the rookie finally starts swattin' one homer after another- earning a new nick-name: \"Iron Will.\" The team is ready to welcome anyone who can help them win-all except Pike, for whom enmity with the town boy runs deep and personal. After-game celebrations create new tension for Will who was raised in a conventional \"tee-totaling\" home. The mill team is home to a flow of beer and bootleg whiskey difficult for any player to resist-especially if he wants to be accepted as one of the boys. Will learns the ropes from Chick Spangler-an old pal who has lived in the mill village all his life. Chick has never been to church and sees no problem with drinking-even though it's against the law under Prohibition. Pricked by his conscience, Will fights the temptation to go along with the crowd. His resolve is encouraged by a high-spirited mill girl named Ginnie Douglas. Though not much of a baseball fan at the outset, Ginnie is intrigued by Will's growing popularity among the boys at the mill. Will is intrigued by Ginnie. When she invites the ball players to hear baseball evangelist, Billy Sunday, the meeting proves a turning point in Chick's life. Will hears the call to follow Jesus Christ but remains unmoved. As the dog days of summer approach with league playoffs, Will feels a constant glare from Pike who lost ability to play ball because of an accident. Pike's hatred for Will is fueled when he sees Ginnie's interest flowing so easily toward the townboy. Pike makes up his mind that \"Iron Will's\" fall from grace will be as dramatic as his meteoric rise. Only one player can be \"Big Stick\" at Newton, only one will get a crack at the minor leagues and only one man will rise above personal ambition and selfish desire to be the true pride of Newton Mill.",
    "Director": "Tim Rogers",
    "Writer": "David Burke",
    "Actors": "Thomas Sneed, Rebecca Kaser, Ben Ascher",
    "Language": "N/A",
    "Country": "United States",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt1694510",
    "tt1874434",
    "tt2205904",
    "tt0990413",
    "tt2459160",
    "tt0942384",
    "tt2094146",
    "tt0039204",
    "tt19800090",
    "tt0041239",
    "tt0079012",
    "tt0033681"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:49:00.704Z"
}