{
  "movieId": "tt1874515",
  "title": "Gossip",
  "year": 1929,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/gossip_1929",
      "id": "gossip_1929",
      "title": "Gossip",
      "fileSize": 2040996809,
      "addedAt": "2026-01-07T00:08:32.019Z",
      "thumbnail": "https://archive.org/services/img/gossip_1929",
      "language": "English",
      "year": 1929,
      "collection": "feature_films",
      "downloads": 187
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "21 min",
    "imdbVotes": 9,
    "Genre": "Short, Comedy",
    "Plot": "Gossip (1929)* 1/2 (out of 4) Bland Vitaphone short has a husband (John Miljan) and wife (Claire Whitney) arguing about which sex gossips more. Just then a friend (Robert Emmett Keane) they both know comes to visit but he isn't aware that they are now married. Soon this friend is gossiping to each of them about the other and sure enough problems start. GOSSIP might have had good intentions but the end result is quite the mess. It's funny that this short clocks in at 20-minutes, which is double the time that most of these Vitaphone films ran. I'm not sure why they felt the need to add an additional ten-minutes to the running time but it certainly didn't help matters. The biggest problem is that not much happens in this film. The husband and wife fight. The friend shows up. The friend talks trash about the husband to the wife. The friend talks trash to the wife about the husband. Was the point to say that men gossip more? If so, did the filmmakers really think this short would have men across the country agreeing that they do gossip more? I'm not sure what the point of this was but it at least featured three good performance but these are the only positive things about it.",
    "Director": "Bryan Foy",
    "Writer": "Lawrence Grattan",
    "Actors": "Robert Emmett Keane, Claire Whitney, John Miljan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1893199",
    "tt1131583",
    "tt0019010",
    "tt0122388",
    "tt1492912",
    "tt0191809",
    "tt0314115",
    "tt0146563",
    "tt0174101",
    "tt0329729",
    "tt1706294",
    "tt1698474"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:32.019Z"
}