{
  "movieId": "tt1815802",
  "title": "Two Sisters",
  "year": 1907,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-two-sisters",
      "id": "silent-two-sisters",
      "title": "Two Sisters",
      "fileSize": 221461958,
      "addedAt": "2026-01-07T00:11:24.926Z",
      "thumbnail": "https://archive.org/services/img/silent-two-sisters",
      "language": "French",
      "year": 1907,
      "collection": "feature_films",
      "downloads": 807
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "11 min",
    "imdbRating": 4.8,
    "imdbVotes": 33,
    "Genre": "Short",
    "Plot": "Two sisters live together with their aged mother, who sits in a chair, taking care of each other. However, one of them meets a man who chucks her under the chin and leaves, which causes mama to lean to the side. When the disloyal sister sends a letter, writing she is tired of a life of hardship, mama dies. A year later, the sisters meet on the street, where the faithful sister is reduced to selling flowers. They embrace and go to the now wealthy sister's home. There, however, the man attempts to have his way with her.This rather early film by Albert Capellani is an elaboration affair. It consists of 14 scenes and tells a cogent, if rather silly and sentimental story in a nice mixture of studio and outdoor shots. Capellani attempts to tell his story with some flair, but his handling is too prudish be telling. There is, however, one shot of the maid making free with her mistress' cosmetics which indicates that the household is not as moral as it might be.Capellani would continue directing through the 1920s in movies of greater length and his subjects and handling would improve.",
    "Director": "Albert Capellani",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0434281",
    "tt0434455",
    "tt0434199",
    "tt0434157",
    "tt0482887",
    "tt0164493",
    "tt0434085",
    "tt0433791",
    "tt0434198",
    "tt0461304",
    "tt0460831",
    "tt3110548"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:11:24.926Z"
}