{
  "imdbId": "tt1928242",
  "title": "Who Is Simon Miller?",
  "year": 2011,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/who.-is.-simon.-miller.-2011.-dvdrip.-xvi-d-evo",
      "id": "who.-is.-simon.-miller.-2011.-dvdrip.-xvi-d-evo",
      "title": "Who Is Simon Miller?",
      "description": "Like most families, the Millers have their challenges. Simon's (Loren Dean) frequent business trips have created some distance between him and the rest of the family, leaving Meredith (Robyn Lively) stretched and struggling to keep things together. Daughter Sarah, an 18-year-old honor student, has recently gotten herself into trouble at school while son Kevin, 15, struggles to engage with anything outside of a video game. But these issues all prove to be trivial when Simon goes missing.",
      "fileSize": 1238676443,
      "addedAt": "2026-01-07T00:13:06.704Z",
      "thumbnail": "https://archive.org/services/img/who.-is.-simon.-miller.-2011.-dvdrip.-xvi-d-evo",
      "language": "eng",
      "year": 2011,
      "collection": "feature_films",
      "downloads": 32
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 5.1,
    "imdbVotes": 177,
    "Genre": "Family",
    "Plot": "Like most families, the Millers have their challenges. Simon's (Loren Dean) frequent business trips have created some distance between him and the rest of the family, leaving Meredith (Robyn Lively) stretched and struggling to keep things together. Daughter Sarah, an 18-year-old honor student, has recently gotten herself into trouble at school while son Kevin, 15, struggles to engage with anything outside of a video game... But these issues all prove to be trivial when Simon goes missing. Sensing something is not right, the family frantically searches Simon's office for information. Discovery of a stash of passports, all with Simon's picture but each with a different alias, reveals that their father has been keeping more than a few secrets. In a frantic phone call, Simon urges the family not to tell anyone of his disappearance, not even the authorities, right before the line goes dead. Who is Simon Miller? And what exactly has he gotten himself - and now his family - into? Shocked, scared and unsure if they can even trust the dad they thought they knew, the three embark on their own international mission to get him back. With Meredith's sharp instincts, Sarah's foreign language skills and Kevin's natural tech-genius, they try to unravel the mystery behind his disappearance. It's a heart-pounding family thriller that tests the limits to which families will fight for each other.",
    "Director": "Paolo Barzman",
    "Writer": "Sheryl J. Anderson, Jeff Davenport, Steven Manuel",
    "Actors": "Robyn Lively, Loren Dean, Skyler Day",
    "Language": "English",
    "Country": "Canada",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2094146",
    "tt1083448",
    "tt1577038",
    "tt1942787",
    "tt1185244",
    "tt1698639",
    "tt1678037",
    "tt1217213",
    "tt1320261",
    "tt2334034",
    "tt2779840",
    "tt2251519"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.704Z"
}