{
  "movieId": "tt1939656",
  "title": "Blissful Lies",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b591HqyeD_w",
      "id": "b591HqyeD_w",
      "title": "Blissful Lies | Full Drama Movie | Leann Hunley",
      "description": "**This film is under exclusive license from Ytinifni Pictures. All rights reserved** \n\nBlissful Lies - Explores the enviable bonds of five best friends who, in the midst of growing up together, are just starting to realize how much they still have to learn about life. They quickly find the limits of their relationships are tested when secrets and lies rapidly interrupt their picture perfect existence, threatening the stability of years of friendship.\n\n2012\nStars: Leann Hunley, Zach Rose, Teri Medina Galvan\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:04.332Z",
      "thumbnail": "https://i.ytimg.com/vi/b591HqyeD_w/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBWnn6lZofcFXn-j7GD58p7LFL3wQ",
      "duration": 8445,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "141 min",
    "imdbRating": 6.1,
    "imdbVotes": 38,
    "Genre": "Drama",
    "Plot": "Explores the enviable bonds of five best friends who, in the midst of growing up together, are just starting to realize how much they still have to learn about life. They quickly find the limits of their relationships are tested when secrets and lies rapidly interrupt their picture perfect existence, threatening the stability of years of friendship. At the center of their universe is mother to one group member and Brown-Thomas University Chancellor, Addison Hamilton. Uncertainty in her own life leads her down a path of no return as she finds herself a little too involved with someone many years her junior. While each person is forced to take responsibility for their hidden secret, they wonder if ultimately, it's just too much to move forward as the 'family' they once claimed to be. Join us on the journey, which allows true love to surface despite obvious obstacles, fearful hatred to emerge with a vengeance and betrayal of even the most loyal of friends. As lives are left in tattered pieces, everyone is forced to choose.... Will the group fall apart at the seams or will the strong bonds of everlasting friendship withstand the fire of deceit?",
    "Director": "Jennifer Brown-Thomas",
    "Writer": "Jennifer Brown-Thomas",
    "Actors": "Leann Hunley, Zach Rose, Teri Medina Galvan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1881060",
    "tt2417530",
    "tt2299842",
    "tt2334034",
    "tt2106670",
    "tt2154780",
    "tt2212658",
    "tt1893195",
    "tt1866919",
    "tt2838540",
    "tt2509978",
    "tt2355473"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:57:21.938Z"
}