{
  "movieId": "tt1925479",
  "title": "Officer Down",
  "year": 2013,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1WUe5MKx56k",
      "id": "1WUe5MKx56k",
      "title": "Officer Down - Dirty Copland - Crime, Action - Jetzt den ganzen Film kostenlos schauen bei Moviedome",
      "description": "Abonniere #Moviedome kostenlos für mehr #ganzeFilme ► http://bit.ly/MoviedomeAbo\n\nJetzt den Crime Action - Film „Officer Down - Dirty Copland“ in ganzer Länge bei #Moviedome sehen.\n\n►Zum Film:\nStephen Dorff, James Woods, Stephen Lang, Dominic Purcell: Dieser Film wartet mit vielen namhaften Schauspielern aus dem Action-Bereich auf!\n\n►Die Handlung:\nWeil bei einer Drogenrazzia so einiges schief läuft, wird der Polizist David Callahan angeschossen und unerwartet von einem Fremden gerettet. Callahan kann von vorne anfangen, und ein paar Dinge in seinem verkorksten Leben richten, doch dann meldet sich der Fremde wieder. Diesmal braucht er die Hilfe des Polizisten, denn er will die junge Stripperin Zhanna Dronov retten.\n\nAbonniert Moviedome kostenlos für mehr #ganzeFilme ► http://bit.ly/MoviedomeAbo\n\nJetzt den #Crime Film \"Officer Down - Dirty Copland“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #kostenlos #movie #film #spielfilm #HD #action #thriller #Crime #Polizist #StephenDorff #spannend #Razzia\n\nEnglischer Originaltitel: Officer Down\nFilmlänge: 93 Minuten\nRegie: Brian A. Miller\nFSK: 16\nErstveröffentlichung: 2013\n\n\nDie Darsteller\nStephen Dorff (bekannt aus „Blade“, „Krieg der Götter“) als Detective David ‚Cal‘ Callahan\nStephen Lang (bekannt aus „Avatar - Aufbruch nach Pandora“, „Don’t Breathe“) als Lieutenant Jake ‚Lieu‘ LaRussa\nJames Woods (bekannt aus „John Carpenter’s Vampires“, „Videodrome“) als Captain Verona\nDominic Purcell (bekannt aus „Prison Break“, „Blade:Trinity“) Royce Walker\n\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nJetzt den Actionfilm „Officer Down - Dirty Copland “ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:34:36.852Z",
      "thumbnail": "https://i.ytimg.com/vi/1WUe5MKx56k/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDrIBTH4Rl3QhTKgFf-RaWWp0kn6g",
      "duration": 5601,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "98 min",
    "imdbRating": 5.5,
    "imdbVotes": 5984,
    "Genre": "Crime, Drama",
    "Plot": "In Bridgeport, Connecticut, Detective David 'Cal' Callahan is a family man, married to Alexandra with a teenage daughter, Lanie. Cal has an unscrupulous past, drug and alcohol addicted, and he was reborn when he was shot by a drug dealer and saved by a stranger. When a stranger meets Cal in a bar, he tells Cal that he was the one who saved him and gives the journal of his deceased daughter to Cal. He tells Cal that she committed suicide after she was beaten up and raped by Angel, a regular at the night-club where she danced, owned by the drug dealer Royce Walker. Cal investigates Angel and when he sees the man in his car in front of the school where Lanie studies, he believes that Angel is a pedophile and Cal decides to take action. But he finds that he is a marionette and someone is pulling the strings and watching him dance.",
    "Director": "Brian A. Miller",
    "Writer": "John Chase",
    "Actors": "Stephen Dorff, Stephen Lang, David Boreanaz",
    "Language": "Russian, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2650986",
    "tt2359024",
    "tt2069948",
    "tt2381989",
    "tt2389182",
    "tt1951095",
    "tt2306521",
    "tt2119552",
    "tt2717558",
    "tt0817545",
    "tt1618432",
    "tt2497808"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:20:43.164Z"
}