{
  "imdbId": "tt1946381",
  "title": "Red Sky",
  "year": 2014,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bnYgsLlBd9A",
      "id": "bnYgsLlBd9A",
      "title": "Red Sky - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Action Film \" Red Sky “ in ganzer Länge bei #Moviedome sehen.\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nDer in Ungnade gefallene Kampfpilot Butch Masters führt eine Suchmannschaft bei der Suche nach einer Massenvernichtungswaffe namens Rainmaker an. Dabei bemerkt er, dass sein ehemaliger Partner Tom Craig mit Terroristen unter einer Decke steckt. Nun muss er alles daran setzen, seine Ehre sowohl im privaten als auch im beruflichen Umfeld zu retten. Außerdem verliebt sich Butch in eine schöne Journalistin.\n\nJetzt “ Red Sky ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg \n \nFilmlänge: 100 Minuten \nFSK: ab 12 Jahren\nDVD-Start (DE): 2014\n\nDie Darsteller\nCam Gigandet in der Rolle des Butch „Cobra“ Masters\nShane West in der Rolle des Tom „Rodeo“ Craig\nRachael Leigh Cook in der Rolle der Karen Brooks\nBill Pullman in der Rolle des John Webster\n\nJetzt ganze Filme bei #Moviedome anschauen \nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\nGanzer Film auf deutsch \nDen Action Film „ Red Sky ” in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:19.420Z",
      "thumbnail": "https://i.ytimg.com/vi/bnYgsLlBd9A/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDJcbHk1U5DlCvUf105-b8N043TOg",
      "duration": 6464,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "100 min",
    "imdbRating": 4.1,
    "imdbVotes": 1789,
    "Genre": "Action, Thriller",
    "Plot": "Butch 'Cobra' Masters aces his USNAF top gun squad, until they are all disgraced, blamed for an exercise turned tragically wrong as manipulated real-time information made them launch real rockets on a cave hideout for chemical arms. As suggested at court trial, his mates accept to avoid a conviction by applying for a voluntary dismissal, each finding a niche in civilian aircraft. When ambitious Pentagon official John Webster, the former squad's former superior, urgently needs their specialty of strike capacity in the Middle East but can't officially engage troops for diplomatic risks, the team is informally reassembled under promise of full rehabilitation. They are retrieved from placed as far as Moscow, complemented for research with his ex girl friend, now investigative reporter, supposed to prevent chemical weapon Rainmaster falling in the hands of crazy Kurdish militia in Syria, but layers of betrayal cause unforeseen trouble.",
    "Director": "Mario Van Peebles",
    "Writer": "Adam Prince, Randy Arrington, Mario Van Peebles",
    "Actors": "Cam Gigandet, Shane West, Rachael Leigh Cook",
    "Language": "English",
    "Country": "United States, Russia",
    "Awards": "2 nominations total"
  },
  "relatedMovies": [
    "tt0489070",
    "tt2307846",
    "tt2717318",
    "tt2558318",
    "tt1085492",
    "tt3417334",
    "tt3677466",
    "tt2048865",
    "tt3849692",
    "tt4025594",
    "tt2167202",
    "tt3540136"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:04.360Z"
}