{
  "movieId": "tt1948212",
  "title": "Watchers 2",
  "year": 2011,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X9jUeFZajes",
      "id": "X9jUeFZajes",
      "title": "Bad Nun: Deadly Vows (Watchers 2) | Full Horror Movie",
      "description": "Bad Nun: Deadly Vows - Catherine and her family recently moved into a converted church. Upon moving in, they have been harassed by an unknown religious stalker, claiming them to be sinners. Pamela, Catherine's grandmother soon begins to reveal she has secrets hidden to the local church, and not all is as it seems. Each night the Nun returns, and this time, she is looking to claim more than one soul.\n2019.  Stars: Becca Hirani, Sarah T. Cohen, Nicola Wright\n***Under license from ITN Distribution. All rights reserved.***\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:10.021Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/X9jUeFZajes/maxresdefault.webp",
      "duration": 5355,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "ID",
          "IN",
          "JM",
          "MY",
          "PH",
          "PK",
          "US",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "58 min",
    "imdbRating": 6.5,
    "imdbVotes": 27,
    "Genre": "Documentary",
    "Plot": "Why are the nations of the world in turmoil? What is happening with the sun and the moon? Why is it that birds are dropping out of the air dead, and why have fish numbering into the millions suddenly died without explanation? Why are there sinkholes of gigantic proportions appearing all over the earth, and what are the Torah Codes saying about the moon? What about the UFO seen over the Temple Mount? Something has changed, and Watchers 2 will try and investigate if what ancient texts have said for millenniums are true - that we are entering a period where there will be wars, earthquakes, and famines - including signs in the skies and the heavens. L.A. Marzulli offers brilliant comment as well as interview experts on this volume. Including: Chuck Missler, Rabbi Aaron Parry, Stan Deyo and Jim Wilhelmsen, Marshall Masters and Dr. Roger Leir will also give us his update on alien implants.",
    "Director": "Richard Shaw",
    "Writer": "N/A",
    "Actors": "L.A. Marzulli, Stan Deyo, Matityahu Glazerson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2205413",
    "tt34700831",
    "tt0770802",
    "tt2083126",
    "tt2296619",
    "tt13572380",
    "tt1935826",
    "tt1809401",
    "tt2057384",
    "tt2095797",
    "tt2234511",
    "tt1699673"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:55.989Z"
}