{
  "imdbId": "tt2063704",
  "title": "La Estrella",
  "year": 2013,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ys9GnKzWww0",
      "id": "ys9GnKzWww0",
      "title": "Estrella | PELÍCULA BÉLICA | en Español (LATAM)",
      "description": "Completamente en Español (LATAM)\n\nUn drama de guerra dirigido por Nikolai Lebedev. La película está basada en un cuento del mismo nombre de Emmanuil Kazakevich. \n\nEn 1944, se envió un grupo de exploradores del Ejército Rojo detrás de la línea del frente para aclarar la información sobre la formación enemiga. Después de cruzar la línea del frente, los soldados se convencen gradualmente de que el enemigo está reagrupando en secreto sus fuerzas para una contraofensiva decisiva. El comandante explorador decide infiltrarse discretamente en un cruce ferroviario, donde se encuentra el centro de mando...\n\nCalificación IMDb: 7,0\n\nAño de producción: 2002\n\nDirigida por: Nikolái Lebedev\nEscrito por: Aleksandr Borodyansky, Evgeny Grigoryev, Nikolai Lebedev\nDirector de fotografía: Yury Nevsky\nMúsica: Alexey Rybnikov\nDiseño de producción: Lyudmila Kusakova\nIntérpretes: Igor Petrenko, Ekaterina Vulichenko\n\n¡Suscríbete a nuestro canal de YouTube y asegúrate de hacer clic en la campana para no perderte las mejores películas soviéticas!",
      "addedAt": "2025-12-23T03:44:06.439Z",
      "thumbnail": "https://i.ytimg.com/vi/ys9GnKzWww0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBfLeO6G0N8uR0D4uRwPIci3F2eqQ",
      "duration": 5836,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 5.2,
    "imdbVotes": 163,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Estrella is a local girl who lives to indulge her loved ones, infecting them with her joy. Her boyfriend Salva dreams of a job that will enable him to leave the shabby outskirts of the city. Estrella and Salva have been together for so long that they can't imagine their lives without each other - The night that the two celebrate Salva's long-desired promotion, which will change their lives, Trini, Estrella's best friend, bursts into their home, fleeing from her husband's abuse. Estrella's life becomes a journey full of joys and sorrows, worrying so much about others that she forgets herself. In the end, Estrella will find that she must take charge of her life and fight for her own happiness.",
    "Director": "Alberto Aranda",
    "Writer": "Alberto Aranda, Belén Carmona",
    "Actors": "Ingrid Rubio, Marc Clotet, Mari Carmen Valiente",
    "Language": "Spanish, Catalan",
    "Country": "Spain",
    "Awards": "3 nominations"
  },
  "relatedMovies": [
    "tt3101386",
    "tt1946310",
    "tt3210376",
    "tt3120054",
    "tt0443465",
    "tt2460976",
    "tt3530146",
    "tt3512900",
    "tt3173758",
    "tt3884570",
    "tt1519663",
    "tt4648986"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:29:12.842Z"
}