{
  "movieId": "tt2008633",
  "title": "Radio Rebel",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZXccZprqONk",
      "id": "ZXccZprqONk",
      "title": "Radio Rebel – Unüberhörbar (Familienfilm mit Debby Ryan, kompletter Film auf Deutsch, ganzer Film)",
      "description": "► Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Dir gefällt Netzkino? Dann lass uns ein Like da: http://bit.ly/NetzkinoFacebook\n► Ausgezeichneter Teenie-Movie mit Debby Ryan (\"Sing It!\") aus dem Jahr 2012.\n\nRADIO REBELL – UNÜBERHÖRBAR (2012)\nOriginaltitel: Radio Rebel\nMit: Debby Ryan, Sarena Parmar, Adam DiMarco\nRegie: Peter Howitt\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nHigh School Schülerin Tara ist dermaßen schüchtern, dass sie vor der Klasse noch nicht einmal einen Buchstaben an die Tafel schreiben kann. Doch sie hat ein erstaunliches Geheimnis: Sie ist der \"Radio Rebel\". Wenn Tara nämlich zu Hause ihre Kopfhörer aufzieht, wird sie die selbstbewusste, offenherzige, inspirierende, anonyme Stimme im Radio. Als ihr Stiefvater, der Besitzer der SLAM Studios, das herausfindet, fördert er Tara. Als jedoch Schuldirektor Moreno, ein unangenehmer Zeitgenosse, den Abschlussball streicht, wird \"Radio Rebel\" von den Mitschülern die Schuld gegeben. Nun muss sich Tara persönlich beweisen.\n#Spielfilm #ganzerFilm #Familienfilm",
      "addedAt": "2025-12-24T00:10:49.614Z",
      "thumbnail": "https://i.ytimg.com/vi/ZXccZprqONk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBevQLz5STVjlSAhjKN1P3FWiUsEg",
      "duration": 5156,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "85 min",
    "imdbRating": 5.7,
    "imdbVotes": 11629,
    "Genre": "Comedy, Drama, Family",
    "Plot": "High schooler Tara, a girl so painfully shy that she can't even write a single letter on the board in front of a class, has an awesome secret - she is \"Radio Rebel\". When Tara puts on that headset in her room and does her daily podcast, she becomes a confident, outspoken, inspiring, anonymous voice on the airwaves. When her stepfather, the owner/producer guy at SLAM radio, finds out that Tara is Radio Rebel, Tara gets to move from her bedroom to a sound studio to do live shows for SLAM. Everything is the perfect amount of chaos until Principal Moreno, whose only goal in life seems to be to destroy others, cancels Prom and all the students blame Rebel.",
    "Director": "Peter Howitt",
    "Writer": "Danielle Joseph, Erik Patterson, Jessica Scott",
    "Actors": "Debby Ryan, Sarena Parmar, Adam DiMarco",
    "Language": "English",
    "Country": "United States, Canada",
    "Awards": "2 wins total"
  },
  "relatedMovies": [
    "tt1083448",
    "tt1577038",
    "tt3118746",
    "tt1986998",
    "tt3398066",
    "tt1400335",
    "tt4276834",
    "tt3567194",
    "tt5027402",
    "tt3038542",
    "tt4356480",
    "tt2304953"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:16:31.414Z"
}