{
  "movieId": "tt2194533",
  "title": "Comment les pauvres mangent à Paris",
  "year": 1910,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-comment-les-pauvres-mangent-paris",
      "id": "silent-comment-les-pauvres-mangent-paris",
      "title": "Comment les pauvres mangent Paris",
      "fileSize": 64321402,
      "addedAt": "2026-01-07T00:10:59.115Z",
      "thumbnail": "https://archive.org/services/img/silent-comment-les-pauvres-mangent-paris",
      "year": 1910,
      "collection": "feature_films",
      "downloads": 477
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "4 min",
    "imdbRating": 6.5,
    "imdbVotes": 18,
    "Genre": "Documentary, Short",
    "Plot": "\"How the Poor Dine in Paris,\" or \"How the Poor Eat in Paris,\" is an early or proto-documentary from Pathé that documents just what it says: poor people shop for or retrieve food from, as the title cards indicate, \"near the market hall, the cutlet seller, the leftovers from the large restaurants, and meals in the barracks.\" They're, then, shown eating the food, sometimes in inserted medium shots. The picture concludes with a title card reading, \"He who sleeps forgets his hunger,\" and a supposed homeless man sleeping in two different places. All in 14 shots not counting title cards, there's also some basic continuity editing when following the homeless figure as he smells food from a kitchen and rounds a corner to drink some water before finding a shaded area to sleep. Oddly, considering the haunting final title card, he had just ate some bread, too, before going to sleep.This is the first film on the Edition Filmmuseum's two-disc set \"Screening the Poor,\" which is quite a unique curation for its inclusion of films with magic lantern slide narratives--unique today, that is, as it more accurately reflects the multi-media presentations of early cinema exhibition. The first screened narrative in the set is actually of a magic lantern slide show. Like this film, it's included under the subsection of \"Slumming.\" DVD notes explain this film's inclusion as, besides recording the poor, it being difficult to distinguish extras acting in the film from the real clochards. There's a tell that indicates some who are certainly not actors, though: the return gaze. As in other early documentaries, travelogues, or actualities, there are a few caught looking back at the camera and, thus, at us, the spectator.Moreover, these quick glances aren't of the sort one might find in earlier films when such technology was more of a curiosity, nor is it of the sort from playful children chasing the camera seen elsewhere. No, these quick glances seem, to me at least, to reflect the intrusion of the cinematographic apparatus. This film isn't quite the social commentary or interpretative work one might expect from later documentaries, from John Grierson onward. It's what Tom Gunning classifies as a \"place\" view, as opposed to the other genre of these views, of \"process.\" In this sense, \"How the Poor Dine in Paris\" is a spectacle that \"others\" the poor for the spectator. Such is even more obvious in many of the colonialist pictures back then of exotic lands, while this one being set in the West, in Paris, reflects another world closer to home of the intended audience, so, here, it remains only a matter of class voyeurism. Today, of course, that's largely overshadowed by the historical curiosity, though.(From 35mm print at the British Film Institute)",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "None, French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt5328220",
    "tt0257522",
    "tt0477346",
    "tt4745838",
    "tt1187321",
    "tt2647246",
    "tt1168660",
    "tt0257371",
    "tt3658844",
    "tt0885116",
    "tt1187030",
    "tt0000537"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:59.115Z"
}