{
  "movieId": "tt2145829",
  "title": "Robot Overlords",
  "year": 2014,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YICSxasSccE",
      "id": "YICSxasSccE",
      "title": "Robot Overlords - Herrschaft der Maschinen - Science-Fiction, Action - Ganzer Film in HD",
      "description": "*GANZER FILM - Angriff der Maschinen: Ben Kingsley und Gillian Anderson in einem großen Sci-Fi-Actionfilm*\n\nDen Spielfilm „Robot Overlords - Herrschaft der Maschinen“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Robot Overlords - Herrschaft der Maschinen“:\nIMDb: *4,6* von 10\nAmazon: *3,1* von 5\n\n*Die Handlung von „Robot Overlords - Herrschaft der Maschinen“*\nIn naher Zukunft steht die Erde unter der Kontrolle gigantischer Roboter aus einer fernen Galaxie. Nach ihrem verheerenden Angriff herrschen sie mit absoluter Macht, während die wenigen überlebenden Menschen in ihren Häusern gefangen sind. Jeglicher Versuch, sich gegen die tyrannische Besatzung zu wehren, wird mit dem Tod geahndet. Mithilfe elektronischer Implantate überwachen die Maschinen jeden einzelnen Menschen lückenlos.\n\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Robot Overlords - Herrschaft der Maschinen“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\n\n#Moviedome #ganzerFilm #ScienceFictionFilm #FilmeKostenlos #MoviedomeFilm\n\nRegie: Jon Wright\nLaufzeit: 90 Minuten\nFSK: 12\nErstveröffentlichung: 2014\n\n\n*Das sind die Schauspieler von „Robot Overlords - Herrschaft der Maschinen“*\nGillian Anderson als Kate\nBen Kingsley als Robin Smythe\nElla Hunt als Alexandra\n\n\n*Die Handlung und Szenen von „Robot Overlords - Herrschaft der Maschinen“* \nIn naher Zukunft steht die Erde unter der Kontrolle gigantischer Roboter aus einer fernen Galaxie. Nach ihrem verheerenden Angriff herrschen sie mit absoluter Macht, während die wenigen überlebenden Menschen in ihren Häusern gefangen sind. Jeglicher Versuch, sich gegen die tyrannische Besatzung zu wehren, wird mit dem Tod geahndet. Mithilfe elektronischer Implantate überwachen die Maschinen jeden einzelnen Menschen lückenlos.\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Robot Overlords - Herrschaft der Maschinen“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:28:48.037Z",
      "thumbnail": "https://i.ytimg.com/vi/YICSxasSccE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB0c-A1fKUKmCq0M8tzUinODZDdXg",
      "duration": 5418,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "90 min",
    "imdbRating": 4.6,
    "imdbVotes": 7811,
    "Genre": "Action, Adventure, Sci-Fi",
    "Plot": "Alien robots come to Earth and assert their control over humanity. They claim that they only want to observe humanity. They enforce a strict no one allowed outside rule. They implant humans with a device that alerts sentries to anyone who goes outside and if they refuse to comply they are destroyed. They also employ humans to be their proctors. One of these men is Robin Smythe. He tries to get Kate Flynn to be his wife but she still mourns her husband whom Smythe says died. But her son Sean, doesn't believe it. He sends messages out asking anyone who knows anything about his father to tell him. One day he and three young people are fooling around when they discover that they turned off their implant. That's when they go outside and someone answers Sean's message and tells him where his father is. So he goes out to find him But Smythe pursues him and brings his mother as leverage. And when the robots corner Sean he somehow manages to control them. So the Robots are curious why he can do that. So they tell Smythe to capture him.",
    "Director": "Jon Wright",
    "Writer": "Mark Stay, Jon Wright",
    "Actors": "Ben Kingsley, Gillian Anderson, Callan McAuliffe",
    "Language": "English",
    "Country": "United Kingdom, Canada",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt3417334",
    "tt3453772",
    "tt4296026",
    "tt4943934",
    "tt2756412",
    "tt4627104",
    "tt2538128",
    "tt2518926",
    "tt2381317",
    "tt2130142",
    "tt2175927",
    "tt5720450"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:17:27.778Z"
}