{
  "movieId": "tt2194503",
  "title": "Ancient Code: Are You Ready for the Real 2012?",
  "year": 2009,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/ancient-code-2010-dvdrip",
      "id": "ancient-code-2010-dvdrip",
      "title": "Ancient Code: Are You Ready for the Real 2012?",
      "description": "Some say the end of mankind is near. Some say that financial turmoil is part of the process, along with global warming, warfare and the spread of mass psychosis. Children are fed drugs to keep them calm; nations are invaded by their neighbors; the climate is changing all around us; celebrities become our gods and materialism is the new mantra. But what is the real truth? Is there an answer to all this?",
      "fileSize": 1869540793,
      "addedAt": "2026-01-07T00:07:24.999Z",
      "thumbnail": "https://archive.org/services/img/ancient-code-2010-dvdrip",
      "language": "eng",
      "year": 2009,
      "collection": "feature_films",
      "downloads": 15
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "80 min",
    "imdbRating": 6,
    "imdbVotes": 10,
    "Genre": "Documentary",
    "Plot": "Some say the end of mankind is near. Some say that financial turmoil is part of the process, along with global warming, warfare and the spread of mass psychosis. Children are fed drugs to keep them calm; nations are invaded by their neighbors; the climate is changing all around us; celebrities become our gods and materialism is the new mantra. But what is the real truth? Is there an answer to all this? Does not the problem increase as the population of mankind multiplies beyond all reason? Are our material lives making us happier and if so, then why so many self-help books, films and philosophies? It can't be denied that the times are changing. Every day sees new challenges for our species, while we cause mayhem and madness on an unbelievable scale. But there is a ratio to it all, a rhyme and reason behind everything that we do and everything that affects us. In Ancient Code - The Movie, a group of experts will harness a power so great that our ancestors were in awe of it. This power has been hidden and lost. Knowledge of it has been destroyed. Many have sought to rediscover it and wield it and many have fallen foul of their own selfishness. Like mad magicians seeking to rule the world, men of renown have fleetingly seen the incredible nature of this Ancient Code and all too often they have missed the point. Today we too have missed the point. We spend our lives naming things and separating them, when they remain whole all the same. We vainly believe that we can disconnect ourselves. It needs no material gain. It needs no hatred and warfare. It needs no drugs. You are the key to the code.... Starring Graham Jarvis and featuring Dr. Tim Wallace-Murphy, Prof. Hugh Montgomery, Brian Allan, Steve Mitchell, Nick Ashron, Nick Pope, Johnny Ball, Philip Gardiner and the voice of O. H. Krill. An Ancient Code Production in association with Reality Films. Written by Philip Gardiner, with excerpts by Steve Mitchell, Mike Stone &amp; O. H. Krill. Directed by Philip",
    "Director": "Philip Gardiner",
    "Writer": "Philip Gardiner, Steve Mitchell, Mike Stone",
    "Actors": "Brian Allan, Nick Ashron, Johnny Ball",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1475191",
    "tt1674181",
    "tt1392998",
    "tt1371711",
    "tt1457738",
    "tt1352822",
    "tt1489137",
    "tt1531905",
    "tt2008667",
    "tt1450633",
    "tt1543506",
    "tt1765782"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:24.999Z"
}