{
  "imdbId": "tt2191888",
  "title": "Proxy",
  "year": 2013,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BAzTgB50Zhg",
      "id": "BAzTgB50Zhg",
      "title": "Proxy  (SPANNENDER THRILLER auf Deutsch, Horrorfilme in voller Länge, Psycho Thriller Filme)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Brutal, erschreckend und überraschend zugleich - ein verstörender Thriller mit unvorhersehbaren Wendungen und bestens platzierten Schocks: Nach dem Verlust ihres Kindes findet eine junge Frau Trost in der Freundschaft zu einer Frau, die jedoch nicht ganz ehrlich zu sein scheint...\n\nPROXY (2013)\nOriginaltitel: Proxy\nMit: Joe Swanberg, Kristina Klebe, Alexia Rasmussen, Alexa Havins\nRegie: Zack Parker\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nFür Esther war es ein Schock: Kurz vor der Geburt ihres Kindes wurde sie nach einem Arztbesuch auf dem Heimweg ohne Vorwarnung von einem vermummten Unbekannten niedergeschlagen. Als sie im Krankenhaus erwacht, ist ihr ungeborenes Kind tot. Seelische Unterstützung findet sie in einer Selbsthilfegruppe, wo sie Melanie kennenlernt, die einen ähnlichen Schicksalsschlag hinnehmen musste. Doch die scheinbar heile Fassade ihrer neuen Freundin beginnt allmählich zu bröckeln. Durch Zufall findet Esther heraus, dass Melanies Kind sehr wohl noch am Leben ist und sie die ganze Zeit belogen wurde. Esther trifft eine folgenschwere Entscheidung.\n#Netzkino #ganzerFilm #psychothriller\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:46:48.850Z",
      "thumbnail": "https://i.ytimg.com/vi/BAzTgB50Zhg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDlhnwAZRhd3GZds35_GOxplKxkXg",
      "duration": 7222,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "122 min",
    "imdbRating": 5.7,
    "imdbVotes": 4432,
    "Genre": "Horror, Thriller",
    "Plot": "While walking home from her latest OB appointment, a very pregnant Esther Woodhouse is brutally attacked and disfigured by a hooded assailant. This horrible event seems to be a blessing in disguise when Esther finds consolation in a support group. Her life of sadness and solitude is opened up to friendship, understanding, and even acceptance. However, friendship and understanding can be very dangerous things when accepted by the wrong people.",
    "Director": "Zack Parker",
    "Writer": "Kevin Donner, Zack Parker",
    "Actors": "Alexa Havins, Joe Swanberg, Kristina Klebe",
    "Language": "English",
    "Country": "United States",
    "Awards": "2 nominations"
  },
  "relatedMovies": [
    "tt2971388",
    "tt2348394",
    "tt2387433",
    "tt1984116",
    "tt3138558",
    "tt2103217",
    "tt1861279",
    "tt1789724",
    "tt2059171",
    "tt3745906",
    "tt2251281",
    "tt2062661"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:23:12.858Z"
}