{
  "movieId": "tt2160081",
  "title": "Ammunition Smuggling on the Mexican Border: Incidents of the Mexican Revolution",
  "year": 1914,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/silent-ammunition-smuggling-on-the-mexican-border-incidents-of-the-mexican-revolution",
      "id": "silent-ammunition-smuggling-on-the-mexican-border-incidents-of-the-mexican-revolution",
      "title": "Ammunition Smuggling on the Mexican Border: Incidents of the Mexican Revolution",
      "fileSize": 1047421245,
      "addedAt": "2026-01-07T00:10:50.368Z",
      "thumbnail": "https://archive.org/services/img/silent-ammunition-smuggling-on-the-mexican-border-incidents-of-the-mexican-revolution",
      "language": "English",
      "year": 1914,
      "collection": "feature_films",
      "downloads": 506
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "41 min",
    "imdbRating": 6.4,
    "imdbVotes": 24,
    "Genre": "Documentary, Short, Drama",
    "Plot": "Ammunition Smuggling on the Mexican Border (1914) ** (out of 4) Of all the films on the Treasures of the West collection, this here might be the most interesting even if it's not that entertaining. Basically during the Mexican Revolution Sheriff Buck and his deputy tried to capture some smugglers but instead they were taken hostage. The deputy was eventually killed but the sheriff managed to escape and weeks later they filmed this movie with all the real people playing themselves including Buck! For a more detailed history on the subject you can read the essay with the film or listen to the commentary track.However, as Stanley Kubrick always said, the truth is boring and you need to change it up for film. This film runs 41-minutes, which is an incredibly long time when you consider the year it was made but this isn't what kills the film. What really kills it is that the people involved are obviously just wanting to make some money on the incident and they don't really care about making a good film. There's really no sign of any talent anywhere as it often appears that the camera just starts off and the \"actors\" re-enact the scene without much thought on anything. Many scenes drag on for no reason. Other feature things happening that really don't have an impact on the film. I think this story could have been more interesting had they either cut it down or hired a real cast and crew to tell the story. As it is, this here is certainly worth watching just as a curio but there's very little actual entertainment.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Eugene Buck, Candelario Ortiz, Tom Gardner",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1283535",
    "tt1223220",
    "tt1410251",
    "tt9837386",
    "tt0885116",
    "tt0477402",
    "tt0470339",
    "tt0463594",
    "tt0330942",
    "tt0482779",
    "tt0367144",
    "tt2647224"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:50.368Z"
}