{
  "imdbId": "tt2257816",
  "title": "Midnight Stallion",
  "year": 2013,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6vWbDFbzwwU",
      "id": "6vWbDFbzwwU",
      "title": "Midnight Stallion – Der König der Pferde - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Familienfilm \"Midnight Stallion – Der König der Pferde\" in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo \n\nDie Farm von Jack (Kris Kristofferson, „A Star Is Born“) und seiner Frau Rita (Chelah Horsdal, „Aliens vs. Predator 2“) steht kurz vor dem Bankrott. Als jedoch deren fünfzehnjährige Tochter Megan (Jodelle Ferland, „The Cabin in the Woods“) den wilden Hengst Midnight entdeckt, scheint ein Ausweg gefunden. Allen Widrigkeiten zum Trotz versucht die Familie binnen kürzester Zeit Midnight zu zähmen und zu trainieren, um bei einem Rennen das rettende Preisgeld zu ergattern. Doch dann verletzt sich Jack schwer und es liegt nun an Megan die Farm zu retten\n\nJetzt \"Midnight Stallion – Der König der Pferde\" kostenlos als ganzen Film auf deutsch sehen.\n\nDieser wunderschöne und inspirierende Familienfilm präsentiert eine Geschichte, die tief unter die Haut geht und den Wert der Familie in den Vordergrund rückt.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #HD #movie #film #spielfilm #Drama #Familie #Pferde #Reiten \n \nFilmlänge: 86 Minuten \nDVD-Start (DE): 29.11.2013\n\nDie Darsteller \nKris Kristofferson in der Rolle des Jack Shephard\nJodelle Ferland in der Rolle der Megan Shephard\nChelah Horsdal in der Rolle der Rita Shephard\nPaul Jarrett in der Rolle des Melvin\nWilliam Dear in der Rolle des Whip T. Vicker\n\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nMidnight Stallion I 2013 I Alle Filminfos \n\nGanzer Film auf deutsch \nDen Familien-Film \"Midnight Stallion – Der König der Pferde\" in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:52.427Z",
      "thumbnail": "https://i.ytimg.com/vi/6vWbDFbzwwU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDNnnBRRBcYzXEN0p9bW9JuTanguw",
      "duration": 5414,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "97 min",
    "imdbRating": 5.3,
    "imdbVotes": 457,
    "Genre": "Action, Drama, Family",
    "Plot": "15 year old Megan Shephard and her parents will do anything to save their struggling farm. When the family discovers a wild stallion in a nearby forest they begin to wonder if this could be the answer to their prayers. Kris Kristofferson and Joedelle Ferland star in this heartwarming and inspiring tale that celebrates the spirit of family and the amazing courage and determination it takes to defeat all odds.",
    "Director": "William Dear",
    "Writer": "Mark Stouffer",
    "Actors": "Kris Kristofferson, Jodelle Ferland, Chelah Horsdal",
    "Language": "English",
    "Country": "Canada, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0340331",
    "tt0054788",
    "tt2139851",
    "tt2650986",
    "tt0910993",
    "tt2119552",
    "tt2717558",
    "tt1964618",
    "tt2179226",
    "tt0817545",
    "tt1986769",
    "tt2101507"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:23.722Z"
}