{
  "movieId": "tt2268433",
  "title": "End of a Gun",
  "year": 2016,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=f1KNmteyEMo",
      "id": "f1KNmteyEMo",
      "title": "End of a Gun: Wo Gerechtigkeit herrscht - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Action Thriller “End of a Gun - Wo Gerechtigkeit herrscht” mit Florin Piersic Jr. und Steven Seagal in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\nAls Decker mit ansieht, wie ein Mann eine Frau schlägt, geht er sofort dazwischen und tötet dabei den Angreifer. Zusammen mit der unbekannten Frau machen sie sich auf die Suche nach den zwei Millionen Dollar, die sich im Auto des Verstorbenen befinden sollen. Dabei geraten sie mit einem mächtigen Drogenboss aneinander, der ebenfalls auf der Jagd nach dem Geld ist.\n\nJetzt “End of a Gun - Wo Gerechtigkeit herrscht” kostenlos als ganzen Film auf deutsch sehen\n\nDer Action Thriller, mit dem Originaltitel “End of a Gun” wurde in den USA im Jahr 2016 verfilmt.\nDer ehemalige Bundesagent Decker arbeitet als Sicherheitsmann in einem Einkaufszentrum. Als er mitbekommt wie ein Mann eine Frau schlägt, greift er ein und bringt den Mann dabei um. Gemeinsam mit der Frau macht er sich auf die Suche nach dem beschlagnahmten Auto des Toten und den sich darin befindenden zwei Millionen Dollar.\nProduziert wurde der Film von Steven Seagal, Binh Dang und Daniel Grodnik.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme: www.moviedome.de\n\nFolge uns auch auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\nBestelle JETZT den NEUEN Film mit Steven Seagal und DMX bestellen!\n►http://bit.ly/JetztBEYONDTHELAW_Bestellen\n\n#Moviedome #EndofaGun #movie #thriller #action #krimi #EndofaGunWoGerechtigkeitherrscht #film \n\n\nFilmlänge: 83 Minuten\nDVD-Start (DE): 28.08.2017\n\nWer sind die Schauspieler?\nDie Charaktere werden von folgenden Schauspielern verkörpert: \nSteven Seagal (bekannt aus \"Alarmstufe: Rot\", \"Nico\", \"Hard to Kill\") in der Rolle des Decker\nLisa Durant in der Rolle der Lisa Durant\nFlorin Piersic Jr. (bekannt aus Killing Salazar) in der Rolle des Gage\nJonathan Rosenthal in der Rolle des Luc\nAlexandre Nguyen in der Rolle des Pee Wee\nAndrei Ciopec  in der Rolle des Ronnie\nJacob Grodnik in der Rolle des Trevor\n\nDie Handlung und Szenen von “End of a Gun - Wo Gerechtigkeit herrscht”\nDer ehemalige DEA-Agent Decker arbeitet mittlerweile als Sicherheitsmann in einem Einkaufszentrum. Obwohl es seine Aufgabe ist bei auffälligen Geschehnissen sofort Bericht zu erstatten, greift er ein, als er sieht wie ein Mann eine Frau attackiert und zusammenschlägt. Im Kampf gegen den Angreifer muss Decker den Mann umbringen.\nDie Folgen daraus sind eine Kündigung und eine Anklage.\nDie Frau stellt sich als Lisa vor und überzeugt Decker davon, gemeinsam den beschlagnahmten Wagen des Toten ausfindig zu machen und die zwei Millionen Dollar, die sich darin befinden, zu stehlen.\nDabei verheimlicht sie ihm, dass es sich dabei um Drogengeld handelt und ein mächtiger Drogenboss ebenfalls auf der Suche nach dem Geld ist.\n\nDie Synchronisation \nDie Rollen werden von folgenden Sprechern synchronisiert\nEkkehardt Belle in der Rolle des Decker\nMartin Sabel in der Rolle des Trevor\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. \n\nBeschreibung für Seite:\nJetzt Film und Trailer kostenlos auf deutsch schauen\nEnd of a Gun - Wo Gerechtigkeit herrscht I Trailer I 2016 I Alle Filminfos\n\nDiese Filme könnten Dir auch gefallen:\nRighteous Brothers, Top Gun",
      "addedAt": "2025-12-26T00:36:05.841Z",
      "thumbnail": "https://i.ytimg.com/vi/f1KNmteyEMo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCjJEDp1tJUN2D4PHnDV0c80kYzkg",
      "duration": 5191,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "86 min",
    "imdbRating": 3.6,
    "imdbVotes": 2348,
    "Genre": "Action, Crime, Thriller",
    "Plot": "A mall security guard -- and former federal agent -- crosses paths with a drug kingpin's enforcer after he saves a woman from danger.",
    "Director": "Keoni Waxman",
    "Writer": "Chuck Hustmyre, Keoni Waxman",
    "Actors": "Steven Seagal, Florin Piersic Jr., Jade Ewen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt5470222",
    "tt2119474",
    "tt3903852",
    "tt7043534",
    "tt3540136",
    "tt5847286",
    "tt5351458",
    "tt3398252",
    "tt3187378",
    "tt5344794",
    "tt0431114",
    "tt2240966"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:29.344Z"
}