{
  "movieId": "tt2306236",
  "title": "Layover",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=57rebjtAg4k",
      "id": "57rebjtAg4k",
      "title": "Abducted (Layover) | Full Movie | Crime Thriller",
      "description": "Abducted (Layover) - When the heiress of a luxury hotel chain is kidnapped at her rat trap motel outside Detroit by a band of ruthless human traffickers because she has seen too much, her oppressed assistant must figure out a way to rescue her.\n2012. Stars: Lauren Holly, Kaylee DeFer, Joe Lando\n**Under non-exclusive license from The Asylum.  All rights reserved**\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:05.966Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/57rebjtAg4k/maxresdefault.webp",
      "duration": 5467,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "NZ",
          "PH",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "91 min",
    "imdbRating": 4.5,
    "imdbVotes": 746,
    "Genre": "Crime, Mystery, Thriller",
    "Plot": "A flight to Chicago is forced by a storm to a layover in Detroit, to hotel tycoon Hollingsworth's bitchy wife, heiress and deputy Susanne's fury, which rises to dismissal on the spot when her P.A. Rebecca White fails to book her a fast flight or a decent hotel. Rude as ever, kind only to her equally spoiled dog, complaining to the noisy neighbors this time gets her abducted, first as nasty witness, after identification as valuable prize, by Vlad's bunch of Russian white slavers, who tricked some local girls there, supposedly for an East European contest with a shot at a modeling career. When Rebbecca misses her, the company sends a ranking executive and enlists the FBI, but only the P.A. can make sense of a cryptic clue in her recorded ransom message.",
    "Director": "Richard Schenkman",
    "Writer": "Naomi L. Selfman",
    "Actors": "Lauren Holly, Kaylee DeFer, Joe Lando",
    "Language": "English, Russian",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3089778",
    "tt1270296",
    "tt0893411",
    "tt0488604",
    "tt1046894",
    "tt0048919",
    "tt0048301",
    "tt2103217",
    "tt2299842",
    "tt1308729",
    "tt0027136",
    "tt1800671"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:47.648Z"
}