{
  "imdbId": "tt2345503",
  "title": "A Stolen Jackpot",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kf6CMtlVNe8",
      "id": "kf6CMtlVNe8",
      "title": "A Stolen Jackpot | Full Movie | Comedy Drama",
      "description": "A Stolen Jackpot - Tom Bennet is trying to do the right thing but his good intentions keep getting derailed by his scheming fiancé and a hustler who want his $350 million dollar lottery ticket. Mix in skullduggery with a stolen investment formula, a childhood sweetheart, and a couple of homicidal pensioners, and Tom has a long way to go before learning it's okay to lose once you've learned what's worth winning!\n2012.  Stars: Shirin Caiola, Maggie Curley, Robert Davidson\n**Under license from Vision Films Inc.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:22.804Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/kf6CMtlVNe8/maxresdefault.webp",
      "duration": 5743,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "95 min",
    "imdbRating": 6.5,
    "imdbVotes": 13,
    "Genre": "Comedy, Drama",
    "Plot": "Award winning movie. A Stolen Jackpot tells the story of love and luck turning on the toss of a coin. Tom Bennet is trying to do the right thing, but his good intentions keep getting derailed by his scheming fiancé and a hustler who want his $350 million dollar lottery ticket. Mix in skullduggery with a stolen investment formula, a childhood sweetheart, and a couple of homicidal pensioners, and Tom has a long way to go before he learns that it's okay to lose once you've learned what's worth winning!",
    "Director": "Satya Kharkar",
    "Writer": "Satya Kharkar (story), Mary Trimble (story), Mary Trimble",
    "Actors": "Shirin Caiola, Maggie Curley, Robert Davidson, Brent Foster",
    "Language": "English",
    "Country": "USA",
    "Awards": "1 win."
  },
  "relatedMovies": [
    "tt2838540",
    "tt1694020",
    "tt2460976",
    "tt0485521",
    "tt1566938",
    "tt2008633",
    "tt1880212",
    "tt1674778",
    "tt1385591",
    "tt1930546",
    "tt1582465",
    "tt3101386"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:17:12.265Z"
}