{
  "imdbId": "tt2359024",
  "title": "Blue Ruin",
  "year": 2013,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/blue-ruin-2013",
      "id": "blue-ruin-2013",
      "title": "Blue Ruin (2013)",
      "description": "Blue Ruin is a 2013 American indie thriller directed by Jeremy Saulnier. The film follows the story of Dwight Evans , portrayed by Macon Blair, a drifter living in his car at a beach town. His life takes a turn when he learns that the man responsible for his parents' murder is about to be released from prison. Dwight returns to his hometown to seek revenge, but the plan quickly spirals out of control. He lacks the skills and experience for such an act, leading to a series of violent confrontations that unfold in a raw and realistic manner. The film explores themes of vengeance, family ties, and the consequences of violence. As Dwight navigates the complexities of his quest for retribution, he finds himself entangled in a cycle of brutality that affects not only him but also those around him. The story is told with a focus on gritty realism, highlighting the emotional and physical toll of his journey.",
      "fileSize": 773619554,
      "addedAt": "2026-01-07T00:07:38.719Z",
      "thumbnail": "https://archive.org/services/img/blue-ruin-2013",
      "language": "eng",
      "year": 2013,
      "collection": "feature_films",
      "downloads": 284
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "90 min",
    "imdbRating": 7.1,
    "imdbVotes": 83561,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "Dwight Evans' lives his life as a beach vagrant. He has no contact with his sister, and his parents were murdered ten years prior. When he gets word that his parents' killer, Wade Cleland, is set to be released from prison, Dwight decides that he has nothing left to lose and sets out on a quest to avenge his parents' deaths. Dwight succeeds in killing Wade, but complications emerge when his botched getaway allows the Cleland family the opportunity to vow revenge.",
    "Director": "Jeremy Saulnier",
    "Writer": "Jeremy Saulnier",
    "Actors": "Macon Blair, Devin Ratray, Amy Hargreaves",
    "Language": "English",
    "Country": "United States, France",
    "Awards": "7 wins & 21 nominations total"
  },
  "relatedMovies": [
    "tt2381989",
    "tt1951095",
    "tt2543702",
    "tt2299842",
    "tt3130734",
    "tt2343761",
    "tt1290475",
    "tt2586118",
    "tt1663708",
    "tt2759066",
    "tt3147106",
    "tt3732950"
  ],
  "collections": [
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:38.719Z"
}