{
  "movieId": "tt2415112",
  "title": "A Bride for Christmas",
  "year": 2012,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-gbAP9-tOdE",
      "id": "-gbAP9-tOdE",
      "title": "All I Want Is Christmas (2012) Jingle All the Oy Vey",
      "description": "A Christmas obsessed Jewish boy on his way to sunny Florida figures out how to get the Christmas of his dreams by trading airline tickets and places with another boy on his way to snowy Christmastown, WA.\n\nOriginal title: Ira Finkelstein's Christmas\n\nDirector: Sue Corcoran\nWriters: Douglas Horn, Angie Louise, Sue Corcoran\nStars: Elliott Gould, David DeLuise, Elijah Nelson\nBudget: $750,000\n\n00:00 Full movie (with subtitles)\n05:21 Ira Finkelstein dreams of experiencing a snowy Christmas, despite his family’s Jewish traditions.\n12:45 Ira swaps places with Mikey at the airport, sending Mikey to Florida and himself to Christmastown.\n20:10 Ira arrives in Christmastown and begins to bond with his cousins while hiding his true identity.\n35:30 A bully named Jack ruins Ira’s gingerbread house, but Ira resolves to make the best of his Christmas.\n50:15 Ira and his new friends decide to put on a Christmas musical to bring the town together.\n1:10:00 Ira’s parents discover the switch and rush to Christmastown, just in time for the big performance.\n1:12:00 The musical is a success, and Ira learns the true meaning of family, tradition, and Christmas, celebrating with everyone in the town.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:43:52.915Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/-gbAP9-tOdE/maxresdefault.webp?v=675bb867",
      "duration": 5221,
      "language": "en",
      "year": 2012,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "84 min",
    "imdbRating": 6.6,
    "imdbVotes": 4999,
    "Genre": "Comedy, Romance",
    "Plot": "After Jessie calls off her third engagement, she swears off serious relationships until she finds the one. That is, until charming but chronically single Aiden comes along. But unbeknownst to Jessie, Aiden has bet his friends that he can convince a woman to marry him by Christmas, which is only four weeks away.",
    "Director": "Gary Yates",
    "Writer": "Barbara Kymlicka",
    "Actors": "Arielle Kebbel, Andrew W. Walker, Kimberley Sustad",
    "Language": "English",
    "Country": "Canada, United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3512900",
    "tt13057170",
    "tt2460976",
    "tt1607577",
    "tt2170744",
    "tt1699498",
    "tt1859650",
    "tt2444354",
    "tt2334090",
    "tt2006721",
    "tt10345022",
    "tt3101386"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:50:13.083Z"
}