{
  "movieId": "tt2415174",
  "title": "Moving Mountains",
  "year": 2014,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=M5tBpOiytEg",
      "id": "M5tBpOiytEg",
      "title": "Moving Mountains | Full Drama Movie",
      "description": "**This film is under license from Vision Films Inc. All rights reserved**\n\nMoving Mountains - Moving Mountains is the true story of one woman's heroic struggle to save her community. She must overcome the might of a billion dollar coal company, the massive governmental bureaucracy that is bent on protecting it and the many difficulties in her own life. When a coal mining operation causes the wells in her community to go dry Trish takes them on and this leads her into a struggle with the most powerful forces in her state. Trish Bragg starts out as a house wife with no money and little education but her big heart and dogged determination propel her into a battle against overwhelming odds. The results of this struggle lead to historic changes in the way coal mining is done and propels Trish into the forefront of the environmental struggles our country is still grappling with today. Based on the book Moving Mountains, this timely story will touch your heart and raise your spirits. It is a story of hope, faith and perseverance that will stay with you long after the movie is over.\n\n2014\nStars: Theresa Russell, Tina Alexis Allen, Michael Alban\n\n★ Awesome Movies \n\nWelcome to the Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under license from various copyright holders. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n★ Buy some items from our merch store - \nhttps://teespring.com/stores/classic-movies-channel\n\n#FullFreeMovies #FreeFullFaithMovies #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:11:31.014Z",
      "thumbnail": "https://i.ytimg.com/vi/M5tBpOiytEg/maxresdefault.jpg",
      "duration": 6266,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-PG",
    "Runtime": "104 min",
    "imdbRating": 6.5,
    "imdbVotes": 65,
    "Genre": "Drama, Family",
    "Plot": "Dove Family Approved Seal/Faith Friendly Moving Mountains is the true story of one woman's heroic struggle to save her community. She must overcome the might of a billion dollar coal company, the massive governmental bureaucracy that is bent on protecting it and the many difficulties in her own life. When a coal mining operation causes the wells in her community to go dry Trish takes them on and this leads her into a struggle with the most powerful forces in her state. Trish Bragg starts out as a house wife with no money and little education but her big heart and dogged determination propel her into a battle against overwhelming odds. The results of this struggle lead to historic changes in the way coal mining is done and propels Trish into the forefront of the environmental struggles our country is still grappling with today. Based on the book Moving Mountains, this timely story will touch your heart and raise your spirits. It is a story of hope, faith and perseverance that will stay with you long after the movie is over.",
    "Director": "Jeanie M. Clark",
    "Writer": "Penny Loeb",
    "Actors": "Theresa Russell, Tina Alexis Allen, Michael Alban",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3398066",
    "tt3402880",
    "tt4276834",
    "tt2739338",
    "tt4923846",
    "tt3283950",
    "tt1797487",
    "tt3118746",
    "tt3417316",
    "tt2224219",
    "tt2209744",
    "tt2257816"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:23:50.192Z"
}