{
  "imdbId": "tt2548070",
  "title": "The Paper Boat",
  "year": 2015,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TBIfQAqMkyc",
      "id": "TBIfQAqMkyc",
      "title": "The Paper Boat | Full Movie | Mystery Crime Drama",
      "description": "The Paper Boat - A brother and sister struggle with his health, an actress tries to stop prostitution, and an immigrant looks for a future as his girlfriend slips into insanity. A tragic accident brings them all together and reveals how they are connected.\n2015.  Stars: Daniel Wilkinson, Linda Bella, Steven Eckholdt\n*Licensed from Indie Rights Inc. All rights reserved*\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\nMORE FULL MOVIES - FREE on YouTube!\n\n Free Action Movies: https://bit.ly/3uMwRxq\n Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n Free Horror Movies: https://bit.ly/3aBBt2J\n Free Asylum Movies: https://bit.ly/3cipzeI\n Free Crime/Thriller: https://bit.ly/3o01prJ\n Free Drama Movies: https://bit.ly/3Pu4mN9\n Free Comedy Movies: https://bit.ly/3IE0wPd\n Free Western Movies: https://bit.ly/3RqTX6u\n Free Adventure Movies: https://bit.ly/3yHolAT\n MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:42:37.886Z",
      "thumbnail": "https://i.ytimg.com/vi/TBIfQAqMkyc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBHxDsiFA96X7tydnFM8duKRJQP_g",
      "duration": 5428,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbRating": 6.7,
    "imdbVotes": 25,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "In this contemporary, Los Angeles-based, drama a group of young people confront reality while trying to live their Hollywood dream. Brayden (Daniel Wilkinson), a young writer from Ireland obsessed with author Charles Bukowski, is trying to write his first novel. Brayden's girlfriend Claudia (Rachel Speth) also works for an entertainment industry that she hates. She is living in a world of craziness, searching for the cause of her father's death during her childhood. Brayden overwhelmed with Claudia's problems, falls for a beautiful and ambitious French actress named Estrella Carson (Linda Bella) who he meets in their apartment's laundromat. Estrella is young and carefree. While she tries to become a big name actress, she works in the dangerous world of prostitution. After encounters with sleazy film producer Blooming (Michael Q. Schmidt), she decides to leave prostitution. Nicholas (Burt Culver), a divorced computer engineer, is waiting for a liver transplant and is about to die. He is sad that he is not be able to see his little son grow. Nicholas' sister Grace (Bridget Bowes) has to raise money when she finds that the insurance company has refused to pay for Nicholas' liver transplant. She works as a nurse with her best friend, Jennifer (Lacey Martin), who helps her raise money for the cause. When their stories are about to collapse on themselves, a sad death brings all these characters together.",
    "Director": "Los Angeles Barea",
    "Writer": "Los Angeles Barea",
    "Actors": "Daniel Wilkinson, Linda Bella, Steven Eckholdt",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3319920",
    "tt4442130",
    "tt1661820",
    "tt1662500",
    "tt2304953",
    "tt2947064",
    "tt3667792",
    "tt2069948",
    "tt4693358",
    "tt5922124",
    "tt5326520",
    "tt2306521"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:51:48.139Z"
}