{
  "imdbId": "tt26443953",
  "title": "Accidental Truth: UFO Revelations",
  "year": 2023,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/accidental.-truth.-ufo.-revelations.-2023",
      "id": "accidental.-truth.-ufo.-revelations.-2023",
      "title": "Accidental Truth: UFO Revelations (2023)",
      "description": "\" Accidental Truth: UFO Revelations \" is a documentary directed by Ron James , exploring the hypothesis that advanced extraterrestrial intelligence is interacting with humanity. The film combines insights from various government insiders and experts, aiming to unveil truths that have long been suppressed. The documentary is based on over 15 years of investigation involving extensive interviews with experts like Lue Elizondo , Colonel John Alexander , and Dr. Michio Kaku . It seeks to connect the dots regarding government knowledge about UFOs and extraterrestrial life. Featuring testimonies from individuals with firsthand experience in government agencies, the film suggests credible acknowledgment of unexplained aerial phenomena. Officials in the film express their awareness of information they are not permitted to disclose. Dr. Michio Kaku provides analytical perspectives on the potential technologies and implications of such advanced intelligences, moving the narrative beyond mere speculation into a realm of serious scientific inquiry.Since its release on April 18, 2023 , the documentary has been noted as a significant contribution to UFO discourse, receiving numerous awards and generating discussions in governmental hearings concerning UFOs.",
      "fileSize": 1693778215,
      "addedAt": "2026-01-07T00:07:18.439Z",
      "thumbnail": "https://archive.org/services/img/accidental.-truth.-ufo.-revelations.-2023",
      "language": "eng",
      "year": 2023,
      "collection": "feature_films",
      "downloads": 84
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "89 min",
    "imdbRating": 6.2,
    "imdbVotes": 692,
    "Genre": "Documentary",
    "Plot": "The truth can no longer be contained by those duty-bound to hide it. Officials who interact with the public regarding the UFO question openly acknowledge that they know things that they can't reveal.",
    "Director": "Ron James",
    "Writer": "Ron James",
    "Actors": "John B. Alexander, Elizabeth April, Mike Bara",
    "Language": "English",
    "Country": "United States",
    "Awards": "16 wins & 2 nominations total"
  },
  "relatedMovies": [
    "tt11735158",
    "tt29232239",
    "tt21928932",
    "tt33504036",
    "tt27788353",
    "tt13622434",
    "tt26653795",
    "tt17157330",
    "tt33078577",
    "tt33813121",
    "tt32308418",
    "tt12618064"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:18.439Z"
}