{
  "movieId": "tt2951810",
  "title": "Pastor Shirley",
  "year": 2013,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ErRm2nZRNqc",
      "id": "ErRm2nZRNqc",
      "title": "Pastor Shirley | Full Drama Comedy Movie",
      "description": "**This film is under license from Vision Films Inc. All rights reserved**\n\nPastor Shirley - Jason's (Robert Ri'chard) heart and soul are stuck - stuck with the church his father ran before he passed away, and his dreams of making this community what he always hoped it could be: a place of worship, love, and sanctuary. Now a real estate mogul threatens to turn Jason's church into a strip mall he is forced to act quickly, so who does he call? Pastor Shirley (Paula Jai Parker)! Pastor \"Don't Take No Mess!\" Shirley is vocal and adamant about what she believes in, and the fate of the church hangs on this eccentric masseuse-turned-community organizer and spiritual warrior, as she fights the good fight with Jason.\n\n2013\nStars: Tiara Ashleigh, Andre Boyer, Jerome Ro Brooks\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:32.810Z",
      "thumbnail": "https://i.ytimg.com/vi/ErRm2nZRNqc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCbZJkxlZ6TCtqAsMQ56lXhZyXuHQ",
      "duration": 4757,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "79 min",
    "imdbRating": 6.2,
    "imdbVotes": 42,
    "Genre": "Comedy",
    "Plot": "Jason's (Robert Ri'chard) heart and soul are stuck - stuck with the church his father ran before he passed away, and his dreams of making this community what he always hoped it could be: a place of worship, love, and sanctuary. Now a real estate mogul threatens to turn Jason's church into a strip mall he is forced to act quickly, so who does he call? Pastor Shirley (Paula Jai Parker)! Pastor \"Don't Take No Mess!\" Shirley is vocal and adamant about what she believes in, and the fate of the church hangs on this eccentric masseuse-turned-community organizer and spiritual warrior, as she fights the good fight with Jason.",
    "Director": "J. Horton",
    "Writer": "Camara Davis",
    "Actors": "Tiara Ashleigh, Andre Boyer, Jerome Ro Brooks",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1941648",
    "tt2706120",
    "tt1582465",
    "tt3101386",
    "tt4755566",
    "tt2767896",
    "tt2389182",
    "tt2724064",
    "tt2378281",
    "tt1545660",
    "tt2352802",
    "tt2065945"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:58:05.593Z"
}