{
  "movieId": "tt2947064",
  "title": "Chasing Gold",
  "year": 2016,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gzaVYdElmQw",
      "id": "gzaVYdElmQw",
      "title": "Chasing Gold | Full Crime Drama Movie | Fiona Dourif | Paul Sorvino",
      "description": "**The film is under non-exclusive license from Artist View Entertainment Inc.  All rights reserved**\n\nChasing Gold - Ten years after losing his family in a tragic car accident, ageing police commander Frank Walsh (Paul Sorvino) discovers that a troubled young woman, Judy (Fiona Dourif), is his daughter from a past relationship. That same night, Frank’s best friend, a retired cop, is murdered in a home invasion and robbed of a cache of gold. Frank must now chase the killer, find the missing gold, and help Judy survive her demons in order to come to terms with his own past. Starring Paul Sorvino (Law & Order, Romeo + Juliet, Goodfellas), Matt Bushell (S.W.A.T.: Firefight, Twilight, Leatherheads), Fiona Douriff (When We Rise, Curse of Chucky, True Blood), and Todd Bridges (That’s My Boy, Everybody Hates Chris, Diff’rent Strokes).\n\n2016\nStars: Fiona Dourif, Robert Z'Dar, Paul Sorvino\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:09:57.266Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/gzaVYdElmQw/maxresdefault.webp",
      "duration": 5390,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "ID",
          "JP",
          "NZ",
          "PH",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "90 min",
    "imdbRating": 6.4,
    "imdbVotes": 100,
    "Genre": "Crime, Drama, Mystery",
    "Plot": "Ten years after losing his family in a tragic car accident, aging police commander Frank Walsh (Paul Sorvino) discovers that a troubled young woman, Judy (Fiona Dourif), is his daughter from a past relationship. That same night, Frank's best friend, a retired cop, is murdered in a home invasion and robbed of a cache of gold. Frank must now chase the killer, find the missing gold, and help Judy survive her demons in order to come to terms with his own past.",
    "Director": "Edmond G Coisson",
    "Writer": "Leonard J. Brink, Edmond G Coisson, Glessna Barabas Yurgen Coisson",
    "Actors": "Fiona Dourif, Robert Z'Dar, Paul Sorvino",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1662500",
    "tt3667792",
    "tt3319920",
    "tt4693358",
    "tt5922124",
    "tt2548070",
    "tt5326520",
    "tt4442130",
    "tt5833186",
    "tt7945098",
    "tt1661820",
    "tt9641092"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:28.988Z"
}