{
  "movieId": "tt29486765",
  "title": "The G",
  "year": 2023,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wWlj5ZqBP9I",
      "id": "wWlj5ZqBP9I",
      "title": "The G-String Murders / Lady of Burlesque 1943 | Gypsy Rose Lee, Barbara Stanwyck | Colorized Movie",
      "description": "Mirth! Murder! Melody! Mystery! and Girls! Girls! Girls!\nA burlesque dancer finds herself at the center of a murder mystery backstages, and she must unveil the killer's identity before the final curtain falls!\n\nOriginal title: Lady of Burlesque (1943) AKA: The G-String Murders\n\nBlack & White version: https://youtu.be/I-e9dPnFL34\n\nDirector: William A. Wellman\nWriter: Gypsy Rose Lee, James Gunn \nStars: Barbara Stanwyck, Michael O'Shea, J. Edward Bromberg \nGenre: Comedy, Mystery, Romance, Burlesque, Musical, Performing Arts\n\nThis film is available with additional French & Spanish dubbed audio. Go to video settings ⚙️  to change your audio / subtitle language options.\n\n\n00:00 Full Movie (with subtitles)\n00:05 A diverse theatre performance with comedy and music, featuring a variety of acts and performers.\n10:26 A mysterious and intriguing conversation unfolds between the characters, involving a potential heist and the sale of a valuable item.\n17:31 A mysterious and dramatic sequence of events unfolds in a theater, involving a police station, a dark figure, and a revelation about the main character's past as a comedian.\n26:11 A dramatic and mysterious conversation unfolds in a restaurant, involving deception and intrigue.\n34:18 A dramatic encounter between characters in a theater, involving deception and conflict.\n45:10 A murder investigation unfolds with multiple suspects and a missing weapon.\n52:06 A murder mystery unfolds during a theater production, with suspicion falling on various characters.\n57:51 A comedic actor gets involved in a murder mystery, leading to unexpected twists and turns.\n1:07:46 A murder mystery unfolds as a group of individuals are questioned about their involvement in the crime.\n1:16:15 A detective solves a murder mystery involving a missing $10,000, poisoned cigars, and a determined killer.\n1:23:35 A dramatic and mysterious encounter unfolds in a night session, leading to unexpected revelations and a sense of joy.\n \n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:10.173Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/wWlj5ZqBP9I/maxresdefault.webp?v=657a58f1",
      "duration": 5398,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "106 min",
    "imdbVotes": 673,
    "Genre": "Crime, Thriller",
    "Plot": "A mysterious older woman seeks revenge on the corrupt legal guardian who destroyed her life.",
    "Director": "Karl R. Hearne",
    "Writer": "Karl R. Hearne",
    "Actors": "Dale Dickey, Romane Denis, Daniel Brochu",
    "Language": "English",
    "Country": "Canada",
    "Awards": "4 wins & 1 nomination total"
  },
  "relatedMovies": [
    "tt29344984",
    "tt10964866",
    "tt12773826",
    "tt13831544",
    "tt2992252",
    "tt27919777",
    "tt13889602",
    "tt10298870",
    "tt9129136",
    "tt10141026",
    "tt9378826",
    "tt7153650"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:39:42.365Z"
}