{
  "imdbId": "tt3061534",
  "title": "Mara and the Firebringer",
  "year": 2015,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ufx42I2W5ow",
      "id": "Ufx42I2W5ow",
      "title": "Mara and the Firebringer (FANTASY ADVENTURE full movie German, Fantasy Movies German complete)",
      "description": "💙 Filme auf Deutsch & komplett kostenlos streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Fantasy-Filmhighlight für die ganze Familie aus Deutschland: Mara Lorbeer, ein fünfzehnjähriges Mädchen, findet heraus, dass sie die Welt retten muss, weil der nordische Gott Loki droht, sich aus seinen Ketten zu befreien...\n\nMARA UND DER FEUERBRINGER (2015)\nOriginaltitel: Mara und der Feuerbringer\nMit: Carin C. Tietze, Christoph Maria Herbst, Eva Habermann, Jan Josef Liefers\nRegie: Tommy Krappweis\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nDie vierzehnjährige Mara (Lilian Prent) hat nur einen Wunsch: normal sein. Wenn das nur so einfach wäre… In der Schule gilt sie als Außenseiterin, zu Hause wird sie von ihrer Mutter (Esther Schweins) mit Esoterikkursen drangsaliert und zu allem Überfluss suchen sie auch noch regelmäßig düstere Tagträume heim. Als Mara plötzlich erfährt, dass es sich nicht um Träume, sondern um Visionen handelt und ausgerechnet sie eine Seherin sein soll, gerät ihr Leben ordentlich aus den Fugen. Denn Mara hat keine geringere Aufgabe auferlegt bekommen, als den drohenden Weltuntergang zu verhindern – steht Ragnarök, die Götterdämmerung, wirklich unmittelbar bevor?\nMithilfe von Dr. Reinhold Weissinger (Jan Josef Liefers), Universitätsprofessor für germanische Mythologie, stürzt sich Mara in ein aufregendes Abenteuer, in dem sie ganz auf ihre Stärken vertrauen muss. Geht von dem selbstverliebten Loki (Christoph Maria Herbst) und seiner geheimnisvollen Frau Sigyn (Eva Habermann) wirklich die größte Gefahr aus? Und was hat es mit dem bedrohlichen Feuerbringer auf sich? Mara gerät immer tiefer in eine magische Welt, in der sie all ihren Mut beweisen und über sich hinauswachsen muss…\n#Netzkino #ganzerFilm #Fantasyabenteuer\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:37:06.353Z",
      "thumbnail": "https://i.ytimg.com/vi/Ufx42I2W5ow/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBSFZ9vOw8ExMW6IZsWYYqTmqlzCQ",
      "duration": 5638,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 5.8,
    "imdbVotes": 731,
    "Genre": "Drama, Fantasy",
    "Plot": "Mara Lorbeer, a fifteen year old girl, finds out that she has to save the world because the Norse god Loki is threatening to break free of his chains.",
    "Director": "Tommy Krappweis",
    "Writer": "Tommy Krappweis, Sebastian B. Voss",
    "Actors": "Lilian Prent, Jan Josef Liefers, Esther Schweins",
    "Language": "German",
    "Country": "Germany",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt2784936",
    "tt3450900",
    "tt2547172",
    "tt3159412",
    "tt3210710",
    "tt4042994",
    "tt5338222",
    "tt3171764",
    "tt4404296",
    "tt3228702",
    "tt4760656",
    "tt4295286"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:21:47.562Z"
}