{
  "imdbId": "tt3019694",
  "title": "Not My Day",
  "year": 2014,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eYNaB32b0F8",
      "id": "eYNaB32b0F8",
      "title": "My Day | Full Movie | Drama Thriller",
      "description": "My Day - Life is tough for teenage runaway Ally, on the streets of London. Forced to work as a drug mule, life just got even tougher. A delivery goes wrong & she must pay back her dealer boss, one way or another. This is Her Life, thank God it's not yours.\n2019.  Stars: Hannah Laresa Smith, Mike Kinsey, Karl Jackson\n**Under non-exclusive license from Distribution Solutions/Alliance Entertainment. All rights reserved** \n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:09:01.603Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/eYNaB32b0F8/maxresdefault.webp",
      "duration": 5416,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "110 min",
    "imdbRating": 6.5,
    "imdbVotes": 5061,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "Till Reiners, mid-30s, has been a teller at Osthofen Mutual Bank for almost 15 years, leading a settled, regular life. His marriage to ambitious purse designer MIRIAM is happy, but in danger of getting into a rut after all those years of harmony. The die hard hard rock lover's life is not exactly exciting, except for when his 4-year-old son has a crying fit because he lost his favorite snuggle bunny. All of a sudden, Till is torn from his daily routine when a bank robber storms his branch and takes Till hostage after his getaway car breaks down. When the kidnapper takes his mask off, Till recognizes NAPPO, a former con who just got out of jail and wanted a loan from Till to buy a new car the other day, but Till turned him down for professional reasons. As the police set up roadblocks and Miriam awaits her husband's call, Nappo decides to abandon Till in the trunk of the car the next morning and disappear with his loot. But it doesn't work out that way. Till and Nappo have to flee together. Pretty soon, Till has had enough. He summons all his courage and demands to call his wife, but the call turns into a fiasco. Due to a misunderstanding, Till gets the impression his wife doesn't care for him at all. Completely confused after this phone call, Till throws caution to the wind and dives into adventure with his kidnapper, Nappo. The odd couple even discovers a shared passion, their mutual love for hard rockers \"Donar\". Till really starts having a good time when he's able to use his banking skills to arrange an extremely lucrative deal for Nappo. More and more, Till relishes the gangster life and his newfound freedom, which takes him across the border to Holland. Little does Till realize the police are already treating him as a suspect and accomplice in the bank robbery. Miriam refuses to believe her husband is in cahoots with the gangster, and sets out for Amsterdam to find her husband without the help of the police. However, Miriam winds up in danger due to the shady deal Till has arranged. Her husband, meanwhile, has realized his old, \"square\" life maybe wasn't so bad after all, and has to risk all to rescue his beloved wife in a dramatic showdown.",
    "Director": "Peter Thorwarth",
    "Writer": "Stefan Holtz, Ralf Husmann, Peter Thorwarth",
    "Actors": "Moritz Bleibtreu, Axel Stein, Jasmin Gerat",
    "Language": "German, English, Dutch, Albanian",
    "Country": "Germany",
    "Awards": "2 nominations total"
  },
  "relatedMovies": [
    "tt3062074",
    "tt3152098",
    "tt3899796",
    "tt2724064",
    "tt1545660",
    "tt3292154",
    "tt1659216",
    "tt4060576",
    "tt3672742",
    "tt1830713",
    "tt2690160",
    "tt4566574"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:37.335Z"
}