{
  "imdbId": "tt3147106",
  "title": "Pleasure Island",
  "year": 2015,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=daUh9PttrFA",
      "id": "daUh9PttrFA",
      "title": "Pleasure Island | Full Crime Drama Movie",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nPleasure Island - A mysterious man, Dean, returns to his hometown of Grimsby after many years abroad in the Army. His arrival is met with animosity, particularly from his father, an avid pigeon racer. Dean is drawn back to confront his demons, and confess a secret to a childhood friend, Jess, only to discover she has been struggling since the untimely death of her husband. Whilst attempting to raise her child and battling a crumbling economy and dearth of opportunities, she is pulled into a harsh underworld. Dean must help her, throw her a lifeline, but the situation only darkens. When their lives are threatened he will do all it takes to make sure she is safe.\n\n2015\nStars: Ian Sharp, Gina Bramhill, Rick Warden\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:49.547Z",
      "thumbnail": "https://i.ytimg.com/vi/daUh9PttrFA/maxresdefault.jpg",
      "duration": 6162,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "107 min",
    "imdbRating": 4.8,
    "imdbVotes": 156,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "A mysterious man, Dean, returns to his hometown of Grimsby after many years abroad in the Army. His arrival is met with animosity, particularly from his father, an avid pigeon racer. Dean is drawn back to confront his demons, and confess a secret to a childhood friend, Jess, only to discover she has been struggling since the untimely death of her husband. Whilst attempting to raise her child and battling a crumbling economy and dearth of opportunities, she is pulled into a harsh underworld. Dean must help her, throw her a lifeline, but the situation only darkens. When their lives are threatened he will do all it takes to make sure she is safe.",
    "Director": "Mike Doxford",
    "Writer": "Mike Doxford, Simon Richardson, Ian Sharp",
    "Actors": "Ian Sharp, Gina Bramhill, Rick Warden",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt2586118",
    "tt2759066",
    "tt3732950",
    "tt2543702",
    "tt3130734",
    "tt5193784",
    "tt3173594",
    "tt1290475",
    "tt3731176",
    "tt2359024",
    "tt2381989",
    "tt3203620"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:22:25.991Z"
}