{
  "imdbId": "tt3108158",
  "title": "The World of Kanako",
  "year": 2014,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/the-world-of-kanako-2014-1080p-blu-ray",
      "id": "the-world-of-kanako-2014-1080p-blu-ray",
      "title": "The World Of Kanako (2014)",
      "description": "A beautiful honors student named Kanako suddenly goes missing. Her father, former detective Akihiro Fujishima, begins an obsessive search for her, tracking down her former middle school teacher, classmates, and her juvenile delinquent friend Endo for clues. Fujishima is a lonely man who's seemingly blind to the fact that his own actions caused the collapse of his family. He becomes convinced that his search for Kanako somehow holds the key to fixing all of that, but as he continues his investigation, he's faced with a series of shocking revelations along the way and discovers that Kanako lived an entirely different life from the pristine image she presented. ~~ Adapted from the novel \"Hateshinaki Kawaki\" by Akio Fukamachi.",
      "fileSize": 2358056216,
      "addedAt": "2026-01-07T00:12:33.207Z",
      "thumbnail": "https://archive.org/services/img/the-world-of-kanako-2014-1080p-blu-ray",
      "language": "jpn",
      "year": 2014,
      "collection": "feature_films",
      "downloads": 2744
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "118 min",
    "imdbRating": 6.5,
    "imdbVotes": 6075,
    "Genre": "Drama, Mystery, Thriller",
    "Plot": "Kanako, a beautiful girl and one of the best students at school, goes missing with all the belongings left behind in her room. Her father Akikazu is now asked by his ex-wife to look for their daughter. He starts a desperate search of Kanako using any means, in the hope of getting his \"ideal\" family back in place despite the fact that the very reason of the family breakup was because of his problematic personality and behaviors. Following tracks of her past and present and talking to her \"friends,\" he starts to get to know his daughter whom he never knew or didn't even attempt to know. When Akikazu is led to one clue, he realizes the world Kanako was facing beyond his imagination... Can the father find his daughter, and get back his perfect happy family he has dreamed of after all these years?",
    "Director": "Tetsuya Nakashima",
    "Writer": "Akio Fukamachi, Tetsuya Nakashima, Miako Tadano",
    "Actors": "Kôji Yakusho, Nana Komatsu, Satoshi Tsumabuki",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "3 wins & 2 nominations"
  },
  "relatedMovies": [
    "tt3525764",
    "tt3274704",
    "tt2435970",
    "tt1866919",
    "tt6207878",
    "tt1544608",
    "tt4762758",
    "tt4607722",
    "tt1883121",
    "tt1874707",
    "tt1582271",
    "tt1401236"
  ],
  "collections": [
    {
      "id": "mystery",
      "name": "Mystery"
    },
    {
      "id": "thriller",
      "name": "Thriller"
    },
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:33.207Z"
}