{
  "movieId": "tt3187378",
  "title": "The Asian Connection",
  "year": 2016,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EmZR4moMZsQ",
      "id": "EmZR4moMZsQ",
      "title": "The Asian Connection - Actionkracher mit Steven Seagal - Ganzer Film in HD bei Moviedome",
      "description": "*GANZER FILM - Knallharter Actionkracher mit Steven Seagal in der Hauptrolle*\n\nDen Spielfilm „The Asian Connection“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „The Asian Connection“:\nIMDb: *3,2* von 10\nAmazon: *4,3* von 5\n\n*Die Handlung von „The Asian Connection“*\nJack (John Edward Lee) und Sam (Byron Gibson), zwei amerikanische Auswanderer, plündern mehrere Banken in Südostasien, ohne zu ahnen, dass sie dabei versehentlich das Vermögen eines mächtigen Drogenbosses (Steven Seagal) entwenden. Dieser setzt alles daran, sein Geld zurückzubekommen – koste es, was es wolle. Als Sam ums Leben kommt, bleibt Jack keine andere Wahl, als sich mit Avalon (Pim Bubear), der Liebe seines Lebens, zusammenzuschließen. Gemeinsam wagen sie einen riskanten Raubzug, inspiriert vom berüchtigten Duo Bonnie und Clyde.\n\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „The Asian Connection“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\n\n#Moviedome #ganzerFilm #Actionfilm #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: The Asian Connection\nRegie: Daniel Zirilli\nLaufzeit: 90 Minuten\nFSK: 16\nErstveröffentlichung: 2016\n\n\n*Das sind die Schauspieler von „The Asian Connection“*\nSteven Seagal als Gan Sirankiri\nMichael Jai White als Greedy Greg\nByron Gibson als Sam\nDean Alexandrou als Timon\n\n\n*Die Handlung und Szenen von „The Asian Connection“* \nJack (John Edward Lee) und Sam (Byron Gibson), zwei amerikanische Auswanderer, plündern mehrere Banken in Südostasien, ohne zu ahnen, dass sie dabei versehentlich das Vermögen eines mächtigen Drogenbosses (Steven Seagal) entwenden. Dieser setzt alles daran, sein Geld zurückzubekommen – koste es, was es wolle. Als Sam ums Leben kommt, bleibt Jack keine andere Wahl, als sich mit Avalon (Pim Bubear), der Liebe seines Lebens, zusammenzuschließen. Gemeinsam wagen sie einen riskanten Raubzug, inspiriert vom berüchtigten Duo Bonnie und Clyde.\n\n                                                                                                 \nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „The Asian Connection“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:30:19.977Z",
      "thumbnail": "https://i.ytimg.com/vi/EmZR4moMZsQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCJIgdeKZN0TQj7-IbC6g-Ai5bFUw",
      "duration": 5492,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xw3RrmJjx78",
      "id": "xw3RrmJjx78",
      "title": "The Asian Connection - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Crime-Thriller “The Asian Connection” in ganzer Länge mit Steven Seagal bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nSam und sein Freund Jack finanzieren sich durch Banküberfälle ein luxuriöses Leben in Thailand. Das geht so lange gut, bis sie versehentlich einen einflussreichen Drogenhändler bestehlen. Dieser will sein Geld um jeden Preis zurück und scheut dabei weder Gewalt, noch den Tod. \n\n\nJetzt “The Asian Connection” kostenlos als ganzen Film auf deutsch sehen\nDer Actionfilm mit dem Originaltitel “The Asian Connection” wurde in der USA im Jahr 2016 verfilmt.\nDie Amerikaner Sam und Jack führen ein luxuriöses Leben in Asien, welches sie durch Banküberfälle finanzieren. Als sie, ohne es zu wissen, das Geld eines Drogenhändlers stehlen hat dies schwerwiegende Folgen.\nProduziert wurde der Film von Damiano Tucci und Steven Seagal.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme ►www.moviedome.de\n►Der neue SEAGAL, zurück mit DMX in BEYOND THE LAW - Jetzt bei uns ►https://bit.ly/BeyondTheLaw_JetztBestellen\n\nFolge uns auch auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\n#Moviedome #TheAsianConnection #movie #film #spielfilm  #action #thriller #drama\n\nFilmlänge: 90 Minuten\nDVD-Start (DE): 20.09.2018\n\n\nWer sind die Schauspieler?\n\nDie Charaktere werden von folgenden Schauspielern verkörpert: \nSteven Seagal (bekannt aus Nico und Alarmstufe: Rot) in der Rolle des Gan Sirankiri\nMichael Jai White (bekannt aus Thick as Thieves und Spawn) in der Rolle des Greedy Greg\nJohn Edward Lee (bekannt aus Navy CIS und Uncaged TV) in der Rolle des Jack Elwell\nRon Smoorenburg  in der Rolle des Tower\nSahajak Boonthanakit in der Rolle des Niran\nByron Gibson  in der Rolle des Sam\nDean Alexandrou  in der Rolle des Timon\n\nDie Handlung und Szenen von “The Asian Connection ”\nSam und sein Freund Jack sind aus Amerika nach Thailand gezogen und finanzieren ihr Leben dort durch zahlreiche Banküberfälle. Besonders Jack genießt das Luxusleben in vollen Zügen mit seiner Freundin Avalon. Als sie bei einem Raub unwissend das Geld des Drogenbarons Gan Sirankiri stehlen, versucht dieser um jeden Preis die beiden zu fassen und sein Geld wiederzubekommen. Nachdem Sam bei einer Schießerei stirbt, führt das Paar die Bank Raubzüge als Duo weiter.\n\nDie Synchronisation \nEkkehardt Belle in der Rolle des Gan Sirankiri\nStefan Weißenburger in der Rolle des Grenzpolizisten\nJörn Linnenbröker in der Rolle des Jack Elwell\nMartin Sabel in der Rolle des Klahan Sirankiri\nRobert Levin in der Rolle des Niran\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länger diverser Genres bei MovieDome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier.\n\nJetzt Film und Trailer kostenlos auf deutsch schauen\nThe Asian Connection I Trailer I 2016 I Alle Filminfos\n\nDiese Filme könnten Dir auch gefallen:\nKilling Salazar, End of a gun, The Perfect Weapon, Beyond the Law, Exit Wounds",
      "addedAt": "2025-12-26T00:36:01.790Z",
      "thumbnail": "https://i.ytimg.com/vi/xw3RrmJjx78/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDO1i4ZHE6HZ2YHX0mHa4X4uCZjpA",
      "duration": 5492,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "90 min",
    "imdbRating": 3.2,
    "imdbVotes": 2111,
    "Genre": "Action, Crime, Drama",
    "Plot": "Two American expatriates, Jack and Sam, unwittingly steal a drug lord's money when they rob a series of banks in Southeast Asia and become the target of the gang's vengeance. When Sam is killed, Jack turns to the love of his life, Pom, and the couple becomes a modern-day Bonnie and Clyde that takes the fight to the gang.Together they must get the job done whilst still protecting jack's nice and nephew.",
    "Director": "Daniel Zirilli",
    "Writer": "D. Glase Lomond, Tom Sizemore, Daniel Zirilli",
    "Actors": "Pim Bubear, John Edward Lee, Steven Seagal",
    "Language": "English",
    "Country": "United States, Thailand",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3703908",
    "tt3881026",
    "tt4025514",
    "tt3263096",
    "tt7115466",
    "tt3449322",
    "tt3390572",
    "tt2893780",
    "tt3213078",
    "tt1742334",
    "tt2112277",
    "tt7886442"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:28.714Z"
}