{
  "imdbId": "tt3159412",
  "title": "Prairie Dog",
  "year": 2015,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bWM6c9lY0II",
      "id": "bWM6c9lY0II",
      "title": "Fang (Prairie Dog) | Full Movie Adventure Drama",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nFang (Prairie Dog) - A lone sheriff of the vast lands and valleys of Brada County is confronted with a dual mystery. A pair of sociopathic criminals being chased across the plains have disappeared, and reports keep surfacing of a large, shadowed animal roaming the farmlands of the county. With the assistance of an environmental consultant and the mayor of the nearby town of Sombra Hollow, the sheriff races to find the connection between the mysteries that haunt the valleys of Brada County.\n\n2015\nStars: John W. Bowers, Sebastian David, Tighe Gill\n\n Welcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:25.677Z",
      "thumbnail": "https://i.ytimg.com/vi/bWM6c9lY0II/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDW56IzlgiAF_k-pkP8Pvw_iyKarQ",
      "duration": 5645,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "94 min",
    "imdbRating": 4,
    "imdbVotes": 566,
    "Genre": "Adventure, Drama, Fantasy",
    "Plot": "A lone sheriff of the vast lands and valleys of Brada County is confronted with a dual mystery. A pair of sociopathic criminals being chased across the plains have disappeared, and reports keep surfacing of a large, shadowed animal roaming the farmlands of the county. With the assistance of an environmental consultant and the mayor of the nearby town of Sombra Hollow, the sheriff races to find the connection between the mysteries that haunt the valleys of Brada County.",
    "Director": "C. Blake Evernden",
    "Writer": "C. Blake Evernden",
    "Actors": "John W. Bowers, Sebastian David, Tighe Gill",
    "Language": "English",
    "Country": "Canada",
    "Awards": "6 wins & 3 nominations"
  },
  "relatedMovies": [
    "tt3210710",
    "tt4404296",
    "tt0055117",
    "tt0056211",
    "tt0061549",
    "tt2784134",
    "tt0029162",
    "tt2215673",
    "tt4296026",
    "tt2224219",
    "tt0002130",
    "tt0015174"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:57:56.370Z"
}