{
  "imdbId": "tt3123418",
  "title": "Bizarre: A Circus Story",
  "year": 2016,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/HellInACircus_201611",
      "id": "HellInACircus_201611",
      "title": "Hell In A Circus",
      "description": "1933 directed by Victor Schertzinger starring Conrad Nagel, Leila Hyams, Tommy Conlon, Claire Windsor, Stanley Fields. After an actress leaves her husband and son for greener pastures, the seedy broad gets what she deserves and meets an untimely death from fire. The husband and son carry on, meeting another dame who’s strong, talented and faithful, (just like it happens in real life). Described as a “poverty row epic,” this little film from Tiffany Studios covers a lot of ground and packs a lot of drama in its short duration. Also known as “The Constant Woman.” This copy has been sharpened a bit.",
      "fileSize": 2975421605,
      "addedAt": "2026-01-07T00:06:25.401Z",
      "thumbnail": "https://archive.org/services/img/HellInACircus_201611",
      "language": "eng",
      "year": 2016,
      "collection": "feature_films",
      "downloads": 8100
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "63 min",
    "imdbVotes": 8,
    "Genre": "Documentary, Biography, History",
    "Plot": "'Bizarre: A Circus Story' is a unique tale about passion, triumph and heartache. Part portraiture, it centers around Master Lu Yi, revered as the father of modern acrobatics. It follows his fascinating life story with all the victories, grief, and wisdom of a 75-year-old circus master. From his rise among the Communist Party as an acrobatic leader to his time as a prisoner during China's Cultural Revolution, Master Lu Yi's triumph to freedom is nothing short of a miracle. Known among his students as \"Johnny Appleseed,\" he has been spreading his love and knowledge of the circus for over 50 years. Based at the Circus Center in the heart of San Francisco, he continues to build his legion of circus lovers. But it takes more than just talent and training to survive in the circus. It's grueling, competitive, and painful. 'Bizarre: A Circus Story' is also part performance based and features breathtaking performances by members of the circus community, from world-renowned performers to youth artists, who have dedicated their lives to this special art form. Shot entirely on the RED Epic and Phantom Flex, these unique performances use super slow motion to provide a rare glimpse at the raw strength, talent and poise it requires to be a circus performer. These enchanting interludes portray circus artists in a totally new way. This extraordinary story is proof that this ancient tradition not only continues to thrive, it's evolving in the modern world.",
    "Director": "Meg Pinsonneault",
    "Writer": "Meg Pinsonneault",
    "Actors": "Allison Daniels, Jon Deline, Eve Diamond",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt1475191",
    "tt0499562",
    "tt8020616",
    "tt0112631",
    "tt4382650",
    "tt5029668",
    "tt7188868",
    "tt2614776",
    "tt5794194",
    "tt5838396",
    "tt2870648",
    "tt3233418"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.401Z"
}