{
  "imdbId": "tt3189794",
  "title": "Robert Macaire et Bertrand",
  "year": 1905,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RobertMacaireEtBertrand",
      "id": "RobertMacaireEtBertrand",
      "title": "Robert Macaire et Bertrand",
      "description": "Robert Macaire et Bertrand aka Robert Macaire and Bertrand USA/UK aka Robert Macaire és Bertrand Hungary aka Robert Macaire et Bertrand, les Rois des Cambrioleurs France, proper Directed by Georges Melies Country: France 1906 Country: USA 1907 What it is: Comic slapstick chase movie Two thieves rob a bank and lead the police on a merry chase. Many of the Melies films I've covered are so full of fantastic content that I have no problem justifying my coverage of them. This one is the most problematic in that regard. There are only two touches that throw it into the realm of the fantastic; the first has an explosion launching the thieves on a long journey into the air, and the second is a balloon ascent which, based on the background, shows them being taken into outer space. Both of these elements are pretty slight as far as the content goes, though. This is not to say there isn't a fair amount of special effects; the trains are obviously not real, and the depiction of an earthquake certainly adds to the special effects content. Mostly, it's slapstick comedy; it's sporadically effective, but far from Melies's best work. - by Dave Sindelar",
      "fileSize": 128176357,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RobertMacaireEtBertrand",
      "year": 1906,
      "collection": "feature_films",
      "downloads": 3035
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Short",
    "Plot": "N/A",
    "Director": "Alice Guy",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "French",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1649298",
    "tt1649361",
    "tt6668862",
    "tt1649369",
    "tt1649316",
    "tt1649365",
    "tt1649367",
    "tt0139714",
    "tt0223340",
    "tt1649427",
    "tt1649428",
    "tt0000450"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}