{
  "movieId": "tt3165630",
  "title": "The Benefactor",
  "year": 2015,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UN8Wh0227XA",
      "id": "UN8Wh0227XA",
      "title": "RICHARD GERE in The Benefactor (FULL MOVIE in German free, moving films, new film)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Richard Gere spielt in Der Glücksbringer einen Menschenfreund, der als reicher Gönner etwas zu stark in die Beziehung eines jungen Paares eingreift, um das als reine Herzensgüte abschreiben zu können.\n\nDER GLÜCKSBRINGER - LIEBE GIBT ES NICHT UMSONST (2015)\nOriginaltitel: The Benefactor\nMit: Richard Gere, Dakota Fanning, Theo James\nRegie: Andrew Renzi\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie junge Frau Olivia (Dakota Fanning) hätte wohl Probleme, ihr Leben finanziell aus eigener Kraft zu meistern, doch sie genießt das Glück einen Gönner zu haben, der sie unterstützt. Der Philantrop Franny (Richard Gere) ist ein alter Freund ihres Vaters, der selber keine Nachkommen hat und so mit Freuden der Tochter seines alten Bekannten hilft. Plötzlich wirft ein Unfall den älteren Herren aus der Bahn und der Kontakt zwischen Franny und Olivia kommt für eine Weile zum Erliegen. Als Olivia den Kontakt zu ihm wieder aufnimmt, ist sie bereits verheiratet und erwartet ein Kind. Franny will sich nun voller Freude um die komplette Familie Olivias kümmern. Doch ihrem Ehemann Luke (Theo James) kommt das Ganze ein wenig merkwürdig vor. Er kann sich nicht vorstellen, dass der Mann ganz ohne Hintergedanken oder Motive seinen Reichtum mit ihnen teilen möchte...\n#Netzkino #ganzerFilm #richardgere\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:59.863Z",
      "thumbnail": "https://i.ytimg.com/vi/UN8Wh0227XA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAKvhDlXxsLuMbBKErJXH0sfXVr0Q",
      "duration": 5571,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "93 min",
    "imdbRating": 5.2,
    "imdbVotes": 5406,
    "Genre": "Drama",
    "Plot": "An aged philanthropist reunites with the pregnant daughter of his close friends who tragically died in an accident that he feels responsible for causing. His inner demons have driven him to abuse drugs which causes the reunion to become strained between the daughter and her husband. His story is told through flashbacks to the day of the tragic accident.",
    "Director": "Andrew Renzi",
    "Writer": "Andrew Renzi",
    "Actors": "Richard Gere, Dakota Fanning, Theo James",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 2 nominations"
  },
  "relatedMovies": [
    "tt3505712",
    "tt3344694",
    "tt2784936",
    "tt3319920",
    "tt2741564",
    "tt4229926",
    "tt4331620",
    "tt4195368",
    "tt4025514",
    "tt3061534",
    "tt4923846",
    "tt2950052"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:23.104Z"
}