{
  "movieId": "tt3181898",
  "title": "Edgar Allan Poe's Lighthouse Keeper",
  "year": 2016,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u4elbYZVVGg",
      "id": "u4elbYZVVGg",
      "title": "Edgar Allan Poe's: Lighthouse Keeper | Full Movie | Horror Thriller",
      "description": "Edgar Allan Poe's Lighthouse Keeper - Marooned on a remote peninsula and haunted by frightening specters, a young man must confront the grotesque denizens of the night, or heed the Lighthouse Keeper's cryptic warning to, 'Always keep a light burning!'\n2016.  Stars: Vernon Wells, Matt O'Neill, Rachel Riley\n***Under license from ITN Distribution. All rights reserved.***\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:39.639Z",
      "thumbnail": "https://i.ytimg.com/vi/u4elbYZVVGg/maxresdefault.jpg",
      "duration": 5347,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "88 min",
    "imdbRating": 3.9,
    "imdbVotes": 1607,
    "Genre": "Horror",
    "Plot": "A castaway awakes on a beach with wounded forehead and sees a woman leaving the place. He takes his satchel and follows her. While climbing a cliff, he falls and faints. He wakes up with amnesia in a lighthouse and the keeper Walsh explains that they are isolated in a remote peninsula where nobody can leave. The only means of transportation to San Francisco is a ferry that will arrive two weeks later. Last but not the least, he warns that he shall always keep a light burning during the night. He goes to the woods in the morning and meets the woman again. He learns that her name is Nora and they fall in love with each other. When he returns to the lighthouse, Nora explains that Walsh is crazy and she cannot go there. During the night, the young man blows out the candle and sees spectral creatures. What are the secrets of Walsh, Nora and the lighthouse?",
    "Director": "Benjamin Cooper",
    "Writer": "Benjamin Cooper, Carl Edge, Edgar Allan Poe",
    "Actors": "Vernon Wells, Matt O'Neill, Rachel Riley",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3778010",
    "tt5931338",
    "tt14373844",
    "tt2425866",
    "tt3743042",
    "tt5937770",
    "tt4419364",
    "tt6166250",
    "tt4247682",
    "tt5060166",
    "tt3113386",
    "tt2565974"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:22:03.031Z"
}