{
  "movieId": "tt33400258",
  "title": "The Story of Norton I, Emperor of the United States",
  "year": 1936,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/thestoryofnortoni",
      "id": "thestoryofnortoni",
      "title": "The Story of Norton I: Emperor of the United States (1936)",
      "description": "This black-and-white theatrical short was part of Columbia Pictures'  Strange As It Seems  series. The series was inspired by the syndicated comics of John Hix, whose  Strange As It Seems  franchise was the chief rival to Robert Ripley's  Believe It or Not!  franchise. The 9-minute short, inspired by a Hix comic that originally was published in April 1934, appears to feature the earliest dramatic portrayal of Emperor Norton extant on film. To learn more about the film, see  this 2016 article  from The Emperor Norton Trust, a San Francisco-based nonprofit that advances the legacy of Emperor Norton. Presented here is a scan of the Trust's own 16mm copy of the film. This copy of the film is doubly rare, as it is the complete original version of the film, including the Columbia Pictures titles. Copies of the film in other collections — including the Library of Congress and the Pacific Film Archive at UC Berkeley — are of a 1947 reissue by the Academic Film Company. In this reissue, the film is retitled Emperor Norton , and the original Columbia title cards are switched out. Film contributed by   The Emperor Norton Trust , a Boston-based nonprofit that advances the legacy of Emperor Norton, through its  AR chive of E mperor N orton in A rt, Music & Film (ARENA) . (Originally contributed when the Trust was known as The Emperor's Bridge Campaign and based in San Francisco.) Film may be under copyright. It is presented here solely for non-commercial, educational purposes. Digitized by  the Internet Archive.",
      "fileSize": 8268215093,
      "addedAt": "2026-01-07T00:12:44.281Z",
      "thumbnail": "https://archive.org/services/img/thestoryofnortoni",
      "year": 1936,
      "collection": "feature_films",
      "downloads": 7490
    }
  ],
  "metadata": {
    "Rated": "Approved",
    "Runtime": "10 min",
    "imdbVotes": null,
    "Genre": "Documentary, Short",
    "Plot": "The veritable story of a citizen of San Francisco who, after being destroyed in the 1857 stock market crash, believed himself to be the emperor of the United States. When he died, 10,000 people attended the funeral.",
    "Director": "Leonard Poole",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1846498",
    "tt15529086",
    "tt2292978",
    "tt0247443",
    "tt1177174",
    "tt1765953",
    "tt1765738",
    "tt1446155",
    "tt0247304",
    "tt0310340",
    "tt0027073",
    "tt0417963"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:44.281Z"
}