{
  "imdbId": "tt3402594",
  "title": "The Demolisher",
  "year": 2015,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vak-sTRte6A",
      "id": "vak-sTRte6A",
      "title": "The Demolisher (Ganzer Thriller auf Deutsch, Komplette Actionfilme kostenlos anschauen, Spielfilm)",
      "description": "► Komplette Filme kostenlos anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Actionreicher Thriller von Gabriel Carrer aus dem Jahr 2015.\n\nTHE DEMOLISHER (2015)\nOriginaltitel: The Demolisher\nMit: Ry Barrett, Tianna Nori, Jessica Vano\nRegie: Gabriel Carrer\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nSkrupellose Anhänger eines kriminellen Kults haben seine Frau in den Rollstuhl geprügelt - und Bruce sieht rot. Tiefschwarz verborgen unter Helm und undurchdringlicher Schutzausrüstung durchstreift der unscheinbare Kabeltechniker fortan jede Nacht die heruntergekommenen Straßen seiner Stadt. Traumatisiert übt er Rache an denen, die er für schuldig hält, und gerät immer tiefer in einen dunklen Sog aus Wahnsinn und Besessenheit. Wartend auf eine Erlösung, die niemals kommt, kreuzen sich Bruces Wege mit denen von Marie, einer jungen Frau, die nur durch ein Missverständnis zum Ziel seines blutigen Kreuzzugs wird. In der fast menschenleeren Düsternis einer einzigen Großstadtnacht entspinnt sich ein atemloses Katz-und-Maus-Spiel auf Leben und Tod, das schon bald völlig außer Kontrolle gerät...\nIn der Tradition der schmutzigen Grindhouse-Klassiker der 80er Jahre, irgendwo zwischen EXTERMINATOR und MANIAC, entfesselt Regisseur Gabriel Carrer ein monströses Biest von einem Film, dessen energetisch pulsierender Synthie-Soundtrack den Zuschauer auf eine intensive Reise in ein verstörtes Hirn entführt. Hauptdarsteller Ry Barrett verkörpert den dunklen Rächer in einer schauspielerischen Tour de Force, begleitet von einer gnadenlos brillanten Kamera, die sich in Reminiszenz an Nicolas Winding Refn gierig an einem Cocktail aus Schmutz, Blut und Neon betrinkt. Unter all seiner Gewalt ist THE DEMOLISHER jedoch bei weitem nicht nur Adrenalinrausch, sondern eine bedrückende Studie menschlicher Obsession im Schatten tiefer Verzweiflung. Ein PUNISHER für eine neue Generation, den keiner so schnell vergessen wird... (Amazon)\n#Spielfilm #ganzerFilm #Actionthriller\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinem monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-24T00:06:07.768Z",
      "thumbnail": "https://i.ytimg.com/vi/vak-sTRte6A/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDNXgmo1VFWITLaUHgCCZW3dIbDfw",
      "duration": 5139,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "85 min",
    "imdbRating": 3.3,
    "imdbVotes": 696,
    "Genre": "Action, Horror, Thriller",
    "Plot": "Bruce (Ry Barrett) is an ordinary repairman tormented by a crippling sense of responsibility for his disabled wife Samantha, an ex-policewoman (Tianna Nori), the survivor of a gang-related assault. Bruce's increasing hyper-sensitivity to the injustice suffered by his wife steer him down a dark path of vigilantism, and with his rapidly disintegrating mental health, paranoia and overwhelming sense of doom, Bruce channels his inner rage towards a young woman, Marie (Jessica Vano) and finds refuge in a world of extreme violence. Both a character study and a psychological examination of trauma, The Demolisher is an unapologetic portrayal of what can happen when a fragile mind is pushed too far.",
    "Director": "Gabriel Carrer",
    "Writer": "Ry Barrett, Andrew Bussey, Martin Buzora",
    "Actors": "Ry Barrett, Tianna Nori, Jessica Vano",
    "Language": "English",
    "Country": "Canada",
    "Awards": "2 wins & 1 nomination"
  },
  "relatedMovies": [
    "tt4025594",
    "tt4895910",
    "tt4685626",
    "tt4943934",
    "tt4557208",
    "tt6874406",
    "tt1919090",
    "tt2282703",
    "tt1954419",
    "tt2034176",
    "tt2130142",
    "tt8128866"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:12:10.766Z"
}