{
  "movieId": "tt3512900",
  "title": "When Sparks Fly",
  "year": 2014,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kMQEra8eCoY",
      "id": "kMQEra8eCoY",
      "title": "When Sparks Fly (ROMANTIC COMEDY with MEGHAN MARKLE, watch full length romantic comedy)",
      "addedAt": "2025-12-23T23:52:18.766Z",
      "thumbnail": "https://i.ytimg.com/vi/kMQEra8eCoY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDEGIooAbKPuS7yzFqE8ri3f1Rfiw",
      "duration": 5286,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-G",
    "Runtime": "86 min",
    "imdbRating": 5,
    "imdbVotes": 1639,
    "Genre": "Comedy, Drama, Romance",
    "Plot": "Young journalist Amy Peterson (Markle) is not as happy with her big city life as she'd hoped, and it's starting to show in her work. She's also not thrilled with her current boyfriend, Phil (Munro), a GQ-handsome businessman who doesn't quite click with her. When circulation at the Chicago Post starts to wane, Amy's editor sends her back to her hometown to write an article about growing up in her parents' (MacKechnie and Samuda) fireworks business. With the Fourth of July at hand, this human-interest story will be just what the Chicago Post needs. Amy arrives home to write her article, but is quickly derailed by her best friend, Sammie (Pesic), who enlists Amy to be the official planner of her upcoming Fourth of July wedding to - of all people - Amy's ex-boyfriend, Hank (Jacot). As Amy struggles to cater to Sammie's wedding demands and work on her newspaper assignment, her feelings for Hank start to resurface. Is Hank feeling the same way? Will their old flame rekindle as the time approaches for sparks to fly?",
    "Director": "Gary Yates",
    "Writer": "Carol Starr Schneider",
    "Actors": "Meghan Markle, Lochlyn Munro, Lauren K. Robek",
    "Language": "English",
    "Country": "United States, Canada",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt5364518",
    "tt2415112",
    "tt3120054",
    "tt0443465",
    "tt3530146",
    "tt3173758",
    "tt3884570",
    "tt3101386",
    "tt1946310",
    "tt4648986",
    "tt3210376",
    "tt2063704"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:27:28.560Z"
}