{
  "imdbId": "tt3605304",
  "title": "Black Fly",
  "year": 2014,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=A5IM-6nZdGw",
      "id": "A5IM-6nZdGw",
      "title": "Black Fly | Full Drama Thriller Movie",
      "description": "***This film is under non-exclusive license from Shoreline Entertainment. All rights reserved***\n\nBlack Fly - Jake and Noel Henson are two estranged brothers haunted by a troubled past. Their father died in a hunting accident, their mother committed suicide and over the years they lost touch. After escaping from his abusive uncle, Jake seeks refuge with Noel who now lives with his girlfriend Paula in the old family farmhouse. Located on an isolated island, it's the perfect place to find solace and re-connect after years of separation. Or so Jake thinks... Soon after his arrival, Jake realizes his older brother has become a hard drinker with an explosive temper.\n\n2014\nStars: Matthew MacCaull, Dakota Daulby, Christie Burke\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:28.131Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/A5IM-6nZdGw/maxresdefault.webp",
      "duration": 5306,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AE",
          "AR",
          "AU",
          "BD",
          "BR",
          "GB",
          "IN",
          "LK",
          "MY",
          "NZ",
          "PE",
          "PH",
          "PK",
          "SA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "88 min",
    "imdbRating": 5.8,
    "imdbVotes": 604,
    "Genre": "Thriller",
    "Plot": "Jake and Noel Henson are two estranged brothers haunted by a troubled past. Their father died in a hunting accident, their mother committed suicide and over the years they lost touch. After escaping from his abusive uncle, Jake seeks refuge with Noel who now lives with his girlfriend Paula in the old family farmhouse. Located on an isolated island, it's the perfect place to find solace and re-connect after years of separation. Or so Jake thinks... Soon after his arrival, Jake realizes his older brother has become a hard drinker with an explosive temper. A short fuse of paranoia and abuse has been ignited in the farmhouse and the days unfold with creeping unease. It's family versus morality as Noel's psychopathic tendencies propel them all into a nail-biting nightmare. For Jake, he must question \"the ties that bind\". Will he be strong enough to stop his brother's terrifying rampage?",
    "Director": "Jason Bourque",
    "Writer": "Jason Bourque",
    "Actors": "Matthew MacCaull, Dakota Daulby, Christie Burke",
    "Language": "English",
    "Country": "Canada",
    "Awards": "5 wins & 13 nominations"
  },
  "relatedMovies": [
    "tt5352846",
    "tt0758740",
    "tt2543702",
    "tt3138558",
    "tt3563890",
    "tt3593922",
    "tt2510028",
    "tt2059171",
    "tt3745906",
    "tt3130734",
    "tt2251281",
    "tt3089778"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:21:36.911Z"
}