{
  "imdbId": "tt3610098",
  "title": "The Ghost of the Canyon",
  "year": 1920,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/GhostOfTheCanyon",
      "id": "GhostOfTheCanyon",
      "title": "\"Ghost of the Canyon\" (1920) starring Helen Gibson",
      "description": "  This gem is presented by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   We have included this film in our program to illustrate the work and contributions of Helen Gibson, a star of Silent Hall of Fame. Let's all give our thanks to Larry Telles for making this film available to the public. Larry authored a book on the life of Helen Gibson.  \"Ghost of the Canyon\" is a short action drama. Scenario and direction are by Robert Myles, story by R.A.Dillion, photographed by Carl Widen. In 1915-1917 Helen Gibson starred a serial by the name of \"The Hazards of Helen\".  She is considered the first professional stunt woman.  Very few of her films survive, so we are happy to be able to show you this rarity. Two railroad companies compete for a very lucrative contract.  Helen's father is the first in command, and her fiance the second in one of the companies.  The rival company organizes a sabotage, which is exposed by Helen.  Unfortunately for her, she is alone against three men who tie her up to the railroad tracks.  She faces imminent death unless she finds a way to free herself from the ropes. Copyright Disclaimer Under Section 107 of the Copyright Act 1976: \"Allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"    ",
      "fileSize": 319386028,
      "addedAt": "2026-01-07T00:06:25.400Z",
      "thumbnail": "https://archive.org/services/img/GhostOfTheCanyon",
      "year": 1920,
      "collection": "feature_films",
      "downloads": 12897
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "25 min",
    "imdbRating": 6.7,
    "imdbVotes": 20,
    "Genre": "Short, Western",
    "Plot": "This 2-reeler stars Helen Gibson, the famous stunt woman serial queen of the teens, in a story about competing railroad lines trying to win the big contract by getting their shipments delivered first. But there's a problem. It seems there a ghost at a certain point in the line that rises up and scares the train engineer. He thinks it's the ghost of a fellow worker who died on that very spot. Gibson takes matters into her own hands and investigates, but she is snagged by the henchmen from the other railroad line and is tied to the tracks. Will she get run over by a speeding train? Will the ghost appear again? Gibson ranked with Pearl White, Ruth Roland, and Helen Holmes as a major serial queen of the teens. By 1920 the serials were losing their appeal and these ladies tried moving into shorts and feature films. Gibson never made much of a dent in features, but continued as a bit player in films until 1962.",
    "Director": "N/A",
    "Writer": "N/A",
    "Actors": "Helen Gibson, S.D. Wilcox, Millard K. Wilson",
    "Language": "None, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3610118",
    "tt3610606",
    "tt1598572",
    "tt0471648",
    "tt1182302",
    "tt1495996",
    "tt2647254",
    "tt1515754",
    "tt0010279",
    "tt0988639",
    "tt4456236",
    "tt0159700"
  ],
  "collections": [
    {
      "id": "western",
      "name": "Western"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:25.400Z"
}