{
  "imdbId": "tt37984759",
  "title": "Rock N Cop the movie",
  "year": 2025,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RockNCop",
      "id": "RockNCop",
      "title": "Rock N Cop",
      "description": "Ryu is travelling by car but suddenly he enters a black hole and is taken to the future of Neo Macao. Based on the Urashiman anime from 1983 and several years in production from student project in 2004 till 2025 with help of AI Vidu finally releasing the Rock N Cop the movie. Plot: A young boy slipped into Neo-Macao of A.D. 2125 from Hong Kong of A.D. 2025, and he lost his memory. Detective Myaa of a brunch police station Magnapolice-38 gives him a name as Ryû Urashima, and assigns him as a special police officer, because there is a high possibility that he has something like a supernatural power due to the time travel. Ryû and his colleagues Claude and girlfriend Sophia fight against a huge crime organization Neo-crime. Starring Johan Karlberg in his debut leading role at age 20 together with the MySpace sensation Jesica Levi, other cast members Nathaliea Roeper, Dong Yong, Angela Lao and Andrew Lau. Filmed between 2004 and 2007. Re edit at 2025 with Vidu.ai",
      "fileSize": 2463985818,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RockNCop",
      "language": "chi",
      "year": 2025,
      "collection": "feature_films",
      "downloads": 2101
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Sci-Fi",
    "Plot": "Ryu is travelling by car but suddenly he enters a black hole and is taken to the future of Neo Macao.",
    "Director": "Johan Karlberg",
    "Writer": "Johan Karlberg",
    "Actors": "Johan Karlberg, Jesica Levi, Dong Yong",
    "Language": "Chinese",
    "Country": "Macao, China, Hong Kong",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt26584495",
    "tt3460068",
    "tt17887614",
    "tt27440937",
    "tt14407336",
    "tt21308888",
    "tt9281138",
    "tt30290719",
    "tt14713328",
    "tt18482470",
    "tt9600274",
    "tt14672882"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}