{
  "movieId": "tt3829920",
  "title": "Only the Brave",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XolkCJZl3OM",
      "id": "XolkCJZl3OM",
      "title": "Only The Brave (GANZER KRIEGSFILM auf Deutsch, Kriegsdrama Filme in voller Länge, Filme kostenlos)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Oktober 1944: Eine Einheit japanischstämmiger US-Soldaten wagt das Unmögliche – den Durchbruch durch feindliche Linien, um eingeschlossene Kameraden zu retten. Ein erbarmungsloser Kampf beginnt – für Ehre, Mut und das Überleben.\n\nONLY THE BRAVE (2006)\nOriginaltitel: Only the Brave\nMit: Tamlyn Tomita, Lane Nishikawa, Greg Watanabe, Mark Dacascos, Kenneth Choi\nRegie: Lane Nishikawa\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDer Film schildert die ergreifende Geschichte des US-amerikanischen 100. Infanteriebataillons. Dieses bestand ausschließlich aus japanisch-stämmigen US-Bürgern. Wie es dazu kam?\nAls die japanischen Streitkräfte 1941 den amerikanischen Stützpunkt Pearl Harbor angriffen, wurden in der Folge japanisch-stämmige Amerikaner bis zum Ende des Krieges in Internierungslagern inhaftiert - einfach nur, weil sie wie der Feind aussahen!\nVon dem Willen getrieben, ihre Loyalität unter Beweis zu stellen, meldeten sich 1.400 Freiwillige, um das 100. Infanteriebataillon zu bilden. Sie wurden daraufhin nach Afrika, Italien und schließlich  Frankreich entsendet, wo sie mit einer schier unmöglichen Mission betraut wurden - der Rettung der vom Feind eingeschlossenen 36. texanischen Division.\nWährend der 2 Jahre, die sich die Einheit im Gefecht befand, wurden ihre Angehörigen mit unvergleichlichen 21 Medals of Honor, 9.486 Purple Hearts, 53 Distinguished Service Crosses, 588 Silver Stars und 5,200 Bronze Stars ausgezeichnet, was sie zur meistdekorierten Einheit ihrer Größe in der amerikanischen Militärgeschichte macht.\nDies ist ihre Geschichte...\n#Netzkino #ganzerFilm #kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:46:20.414Z",
      "thumbnail": "https://i.ytimg.com/vi/XolkCJZl3OM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAlVWgFm-7EPJMMG2N6Pf7QkJ6p_A",
      "duration": 6008,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "134 min",
    "imdbRating": 7.6,
    "imdbVotes": 85788,
    "Genre": "Action, Biography, Drama",
    "Plot": "In 2007 Prescott, Arizona, Eric Marsh of the Prescott Fire Department is frustrated fighting forest fires when the Type 1 or \"Hotshot\" front line forest fire fighting crews from afar overrule his operational suggestions to his area's sorrow. To change that, Marsh gets approval from the Mayor to attempt to organize an unprecedented certified municipal-based Hotshot crew for Prescott. To that end, Marsh needs new recruits, which includes the young wastrel, Brendan McDonough, to undergo the rigorous training and qualification testing for the most dangerous of fire fighting duty. Along the way, the new team meets the challenge and the hailed Granite Mountain Hotshots are born. In doing so, all the men, especially McDonough, are changed as new experience and maturity is achieved in fire-forged camaraderie. All this is put to the test in 2013 with the notorious Yarnell Hill Fire that will demand efforts and sacrifices no one can ignore.",
    "Director": "Joseph Kosinski",
    "Writer": "Sean Flynn, Ken Nolan, Eric Warren Singer",
    "Actors": "Josh Brolin, Miles Teller, Jeff Bridges",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 nominations total"
  },
  "relatedMovies": [
    "tt3844876",
    "tt3881026",
    "tt0029850",
    "tt0067069",
    "tt5189828",
    "tt4400994",
    "tt6083388",
    "tt5851014",
    "tt6353716",
    "tt6236198",
    "tt0066549",
    "tt5456104"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2026-01-13T19:04:01.265Z"
}