{
  "movieId": "tt3844876",
  "title": "The Legend of Ben Hall",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5W8qTlBezmE",
      "id": "5W8qTlBezmE",
      "title": "The Legend Of Ben Hall | Full Movie | Action Drama | True Story",
      "description": "The Legend Of Ben Hall - After two years on the run, bushranger Ben Hall considers surrendering to the law when his old friend John Gilbert entices him back into the game. Taking on fresh recruit John Dunn, the gang rides again, and before long they become the most wanted men in the country. When they are declared outlaws, the three decide to flee forever. As Hall seeks to make peace with his tortured past, a trusted friend becomes an informant. The law sets a cunning trap for the outlaws, and on the cold morning of May 5th 1865, Hall emerges alone from his camp... and walks into legend forever.\n2017.  Stars: Jack Martin, Jamie Coffa, William Lee\n**Under non-exclusive license from Distribution Solutions/Alliance Entertainment. All rights reserved** \n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:53.615Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/5W8qTlBezmE/maxresdefault.webp",
      "duration": 8397,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "139 min",
    "imdbRating": 5.8,
    "imdbVotes": 2431,
    "Genre": "Action, Biography, Drama",
    "Plot": "After two years on the road, bushranger Ben Hall (Jack Martin) considers surrendering to the law when his old friend John Gilbert (Jamie Coffa) entices him back into the game. Taking on a fresh recruit John Dunn (William Lee), the gang ride again, before long becoming the most wanted men in the British Empire. When they are declared outlaw, the three decide to flee the colony forever. As Ben Hall seeks to make peace with his tortured past, their trusted friend becomes a police informant. They set a cunning trap for the outlaws, and on the cold morning of May 5th 1865, Ben Hall emerges alone from his camp - and walks into legend forever.",
    "Director": "Matthew Holmes",
    "Writer": "Matthew Holmes",
    "Actors": "Jack Martin, Jamie Coffa, William Lee",
    "Language": "English",
    "Country": "Australia",
    "Awards": "16 wins & 13 nominations total"
  },
  "relatedMovies": [
    "tt3829920",
    "tt3881026",
    "tt0029850",
    "tt0067069",
    "tt5189828",
    "tt4400994",
    "tt6083388",
    "tt5851014",
    "tt6353716",
    "tt6236198",
    "tt0066549",
    "tt5456104"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:19.540Z"
}