{
  "imdbId": "tt4030354",
  "title": "Timber the Treasure Dog",
  "year": 2016,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MRa0aC9snSQ",
      "id": "MRa0aC9snSQ",
      "title": "Timber the Treasure Dog (FAMILY ADVENTURE in full length, Adventure Films German complete)",
      "addedAt": "2025-12-23T23:51:45.119Z",
      "thumbnail": "https://i.ytimg.com/vi/MRa0aC9snSQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC3t5kLjTOoyscA-lR0Le7ROzRHpQ",
      "duration": 5105,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "89 min",
    "imdbRating": 4.5,
    "imdbVotes": 243,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "Timber is an energetic Alaskan Husky who shows up at the doorstep of MIKEY JONES, a 12 year old boy living with his 16 year old sister, CLAIR and his father, EMMET at their ranch in Montana. Left to Mikey by his grandpa, Timber arrives just in time because this family needs his help and fast! CASPER STONEWALL, the local villain is buying up all the ranches that can't pay off their deeds to the bank and Emmet's ranch is one of them. Nobody wants to lose their home but unless they find a small fortune, there's nothing Emmet can do to stop him. Luckily, Timber holds a key clue to the local legend of a buried treasure that all but Mikey and BILLIE, a 12 year old tomboy girl and Mikey's best friend, believe to be just a myth. With nobody buying the story of the lost treasure of Cloud Peak, Mikey, Timber, their family bulldog; BARBEQUE, Billie and her pet Golden Lab; KAIA set off on an adventure of a lifetime in an attempt to save their homes! Unfortunately, Stonewall and his two bungling henchmen, MARCUS and PHIL, are also aware of story of the lost treasure. In fact, Stonewall is buying all the properties in the area so he can dig it up for himself. Mikey and Indy's hunt may just ruin his plan so they pursue our gang of treasure seekers to stop them before they locate the gold. By the time, Emmet, Clair, and Billie's mom; JAMIE, find out what's going on, they might not have enough time to save the kids and the adventure dogs from the ruthless Stonewall. However, they are sure going to try! Action, comedy, danger and romance ensue as riddles, booby traps, wolf attacks, underground caves, hidden waterfalls, a even a witch named ALICE are encountered along the way, providing help or hindrances for our intrepid adventurers! TIMBER THE TREASURE DOG is an adventure for the whole family that teaches the lesson: \"Success isn't measured by the gold we have but by the people we love and the place we call home.\"",
    "Director": "Ari Novak",
    "Writer": "Nick Campagna, Rolfe Kanefsky, Ari Novak",
    "Actors": "Wilford Brimley, Kix Brooks, Casey Fitzgerald",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt4687848",
    "tt5340882",
    "tt3899796",
    "tt3292154",
    "tt6581990",
    "tt4060576",
    "tt3672742",
    "tt4566574",
    "tt3062074",
    "tt5001456",
    "tt5758726",
    "tt3019694"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:27:07.154Z"
}