{
  "movieId": "tt4195368",
  "title": "Flying Colors",
  "year": 2015,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/flying-colors-2015-1080p-blu-ray",
      "id": "flying-colors-2015-1080p-blu-ray",
      "title": "Flying Colors (2015)",
      "description": "Kudo Sayaka is a 2nd-grade high school student, a gal (Gyaru) who wears miniskirts and dyes her hair blonde. Even though she is a high school student, her actual academic grade level is on par with 4th-grade elementary school students. During the summer, Sayaka attends a private institution, where she meets Teacher Tsubota. Besides her mother, Teacher Tsubota is the first adult to praise her, and through his guidance and instruction, Sayaka begins to change.",
      "fileSize": 2310155335,
      "addedAt": "2026-01-07T00:08:24.396Z",
      "thumbnail": "https://archive.org/services/img/flying-colors-2015-1080p-blu-ray",
      "language": "jpn",
      "year": 2015,
      "collection": "feature_films",
      "downloads": 2038
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "117 min",
    "imdbRating": 7.3,
    "imdbVotes": 4374,
    "Genre": "Comedy, Drama",
    "Plot": "Sayaka Kudo is a gyaru who wears miniskirts and dyes her hair blonde. Although she is a 2nd year senior high school student, she is on par academically with 4th grade elementary school students. She frequently transfers between school because she is unable to make friends, and was once suspended for being caught with cigarettes. To prepare her for her university entrance examination, her mother decides to send her to Seiho Cram School. However, when the school director, Yoshitaka Tsubota, hears about Sayaka's academic problem, he makes it his personal achievement to help her enter the university of her choice, Keio University, a prestigious university that is considered one of the most difficult to enter in Japan. After her father labels her an \"air-head\", Sayaka became determined to study hard to prove her father wrong. Over the course of the summer holidays of her second year through to the exams at the end of her third year in senior high school, Sayaka studies extremely hard. She even removes her blond hair dye and cuts her hair to show her resolve. Her results progressively improves and her academic deviation value increases tremendously from 30 to 70 in this short span of time.",
    "Director": "Nobuhiro Doi",
    "Writer": "Hiroshi Hashimoto, Nobutaka Tsubota",
    "Actors": "Kasumi Arimura, Nanami Abe, Morio Agata",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "4 wins & 5 nominations total"
  },
  "relatedMovies": [
    "tt4331620",
    "tt3593666",
    "tt4076926",
    "tt2547172",
    "tt3630652",
    "tt2735292",
    "tt3339354",
    "tt4648986",
    "tt1754736",
    "tt3480060",
    "tt4912452",
    "tt4838534"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:24.396Z"
}