{
  "imdbId": "tt4686604",
  "title": "On the Road to Berlin",
  "year": 2015,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=M8V4uN8w2Jw",
      "id": "M8V4uN8w2Jw",
      "title": "On the Road to Berlin | WAR MOVIE | with Arabic subtitles",
      "description": "الفيلم مأخوذ عن فيلم Two in the Steppe ، وهو قصة كتبها الكاتب السوفيتي المخضرم الشهير إيمانويل كازاكيفيتش ومذكرات حرب كونستانتين سيمونوف. 1942. تحقق محكمة عسكرية في أفعال الشاب المعتقل عديم الخبرة الملازم أوجاركوف.\n\nيعتقد الضابط إيفان سينييف ، الذي كان في مهمة مع أوغاركوف ، أن أوغاركوف أظهر الجبن. حكمت المحكمة العسكرية على أوغاركوف بإطلاق النار عليه. سيحرس الجندي دزوراباييف المعتقل حتى تنفيذ الحكم. فجأة دخل الألمان القرية واخترقوا الدفاعات. يتخذ Dzhurabayev القرار الصحيح الوحيد - لاقتحام قواته مع Ogarkov. والآن يسير حارس وسجين على الطرق العسكرية ويخوضان معارك عشوائية على قدم المساواة. يغطون أنفسهم بنفس المعطف ، ويأكلون من نفس العلبة. تنشأ بينهما صداقة صامتة ومستحيلة ...\n\nسنة الإنتاج: 2015\n\nإخراج: سيرجي بوبوف\nبقلم: يفغيني نيكيشوف\nتصوير: شاندور بيركيشي\nالموسيقى: رومان دورميدوشين\nتصميمات الإنتاج: سيرجي فيفراليف ، إيرينا أوتشينا\nالممثلون: فاليري نيناشيف ، يوري بوريسوف ، أمير عبد الخالق ، ماريا كاربوفا\n\nاشترك في قناتنا على YouTube وتأكد من النقر على الجرس حتى لا تفوتك أفضل الأفلام السوفيتية!",
      "addedAt": "2025-12-23T03:44:57.493Z",
      "thumbnail": "https://i.ytimg.com/vi/M8V4uN8w2Jw/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBzkW_pjSjmrnLIXFiRVWCMrVTGnA",
      "duration": 5144,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4ESkx6fP6jE",
      "id": "4ESkx6fP6jE",
      "title": "On the Road to Berlin | WAR MOVIE | Spanish subtitles",
      "description": "La película está basada en Two in the Steppe, una historia del famoso escritor veterano soviético Emmanuil Kazakevich y los diarios de guerra de Konstantin Simonov. 1942. Un tribunal militar está investigando las acciones de un joven teniente sin experiencia arrestado Ogarkov.\n\nEl oficial Ivan Sinyayev, que estaba en una misión junto con Ogarkov, piensa que Ogarkov mostró cobardía. El tribunal militar condena a fusilar a Ogarkov. El soldado Dzhurabayev custodiará al detenido hasta la ejecución de la sentencia. De repente, los alemanes entran en el pueblo, rompiendo las defensas. Dzhurabayev toma la única decisión correcta: abrirse paso hacia sus tropas junto con Ogarkov. Y ahora un guardia y un prisionero caminan por los caminos militares, participando en batallas aleatorias como iguales. Se cubren con el mismo abrigo, comen de la misma lata. Una amistad silenciosa e imposible se desarrolla entre ellos...\n\nAño de producción: 2015\n\nDirigida por: Serguéi Popov\nEscrito por: Yevgeny Nikishov\nDirector de fotografía: Shandor Berkeshi\nMúsica: Roman Dormidoshin\nDiseños de producción: Sergei Fevralev, Irina Ochina\nIntérpretes: Valery Nenashev, Yury Borisov, Amir Abdykalykov, Maria Karpova\n\n¡Suscríbete a nuestro canal de YouTube y asegúrate de hacer clic en la campana para no perderte las mejores películas soviéticas!",
      "addedAt": "2025-12-23T03:45:09.004Z",
      "thumbnail": "https://i.ytimg.com/vi/4ESkx6fP6jE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA7DD1IOBStIQ52aFFmJ9PR4bfvrg",
      "duration": 5144,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Pkjl55XvUQo",
      "id": "Pkjl55XvUQo",
      "title": "On the Road to Berlin | WAR MOVIE",
      "description": "The movie is based on Two in the Steppe, a story by the famous Soviet veteran writer Emmanuil Kazakevich and war diaries by Konstantin Simonov. 1942. A military tribunal is investigating the actions of an arrested inexperienced young lieutenant Ogarkov. \n\nOfficer Ivan Sinyayev, who was on a mission together with Ogarkov, thinks that Ogarkov showed cowardice. The military court sentences Ogarkov to be shot. Private Dzhurabayev is to guard the detainee until the execution of the sentence. Suddenly the Germans enter the village, breaking through the defenses. Dzhurabayev takes the only right decision - to break through to his troops together with Ogarkov. And now a guard and a prisoner are walking along the military roads, engaging in random battles as equals. They cover themselves with the same overcoat, eat from the same tin. A silent, impossible friendship develops between them...\n\nYear of production: 2015\n\nDirected by: Sergei Popov \nWritten by: Yevgeny Nikishov\nDirector of photography: Shandor Berkeshi \nMusic: Roman Dormidoshin \nProduction designers: Sergei Fevralev, Irina Ochina \nStarring: Valery Nenashev, Yury Borisov, Amir Abdykalykov, Maria Karpova\n\nSubscribe to our YouTube channel, and be sure to click the bell so that you won’t miss the best Soviet movies! \n\n#Russian_cinema #WW2 #Yura_Borisov #FullMoviesWithEngSubs",
      "addedAt": "2025-12-23T03:45:55.062Z",
      "thumbnail": "https://i.ytimg.com/vi/Pkjl55XvUQo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD10EgaJikuq0D7THrFLBv1xoQtvw",
      "duration": 5144,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "82 min",
    "imdbRating": 6.5,
    "imdbVotes": 960,
    "Genre": "Drama, War",
    "Plot": "Summer 1942, a young a communications officer accused of cowardliness is sentenced to death by firing squad. A surprise attack by the Germans delays the execution and the convict and his guard are forced to flee. While attempting to deliver the convict to headquarters a friendship develops between the guard and his captive as the two go through several adventures and battle the Germans.",
    "Director": "Sergei Popov",
    "Writer": "Emmanuil Kazakevich, Evgeniy Nikishov, Konstantin Simonov",
    "Actors": "Amir Abdykalov, Yura Borisov, Maksim Demchenko",
    "Language": "Russian, German",
    "Country": "Russia",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    "tt2884018",
    "tt2942196",
    "tt2477218",
    "tt2557276",
    "tt3519772",
    "tt3707104",
    "tt3915184",
    "tt2876438",
    "tt7436642",
    "tt2409418",
    "tt7063474",
    "tt2101507"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-02T19:34:00.357Z"
}