{
  "imdbId": "tt4687848",
  "title": "Railroad Tigers",
  "year": 2016,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xfSTn3WcStM",
      "id": "xfSTn3WcStM",
      "title": "Railroad Tigers - mit Jackie Chan - Abenteuer, Action - Ganzen Film kostenlos schauen bei Moviedome",
      "description": "*GANZER FILM - Spektakuläre Stunts und eindrucksvolle Action mit Jackie Chan*\n\nDen Spielfilm „Railroad Tigers“ mit Jackie Chan kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Railroad Tigers“:\nIMDb: *5,7* von 10\nAmazon: *4,1* von 5\n\n*Die Handlung von „Railroad Tigers“ mit Jackie Chan*\nAls die japanische Besatzungsmacht 1941 ihr Einflussgebiet über eine militärische Transportlinie in Ostchina ausweitet, schlägt die Stunde einiger rebellischer Bahnarbeiter. Angeführt von Ma Yuan schwingen sich die sogenannten \"Railroad Tigers\" zur letzten Bastion des chinesischen Widerstandes auf...\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Abenteuerfilm #Actionfilm #JackieChan #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Tie Dao Fei Hu\nLaufzeit: 124\nRegie: Sheng Ding (Regisseur von \"Little Big Soldier\")\nFSK: 16\nErstveröffentlichung: 2016\n\n\n*Das sind die Schauspieler*\nJackie Chan (bekannt aus „Police Story\", \"Rush Hour\", \"Nobody\")\nin der Rolle des Ma Yuan\nJaycee Chan (bekannt aus „Mulan - Legende einer Kriegerin\")\nin der Rolle des Rui Ge\nKai Wang (bekannt aus \"A Better Tomorrow 4\", \"The Disguiser\")\nin der Rolle des Fan Chuan\nFan Xu (bekannt aus \"Aftershock\", \"A Sweet Life\")\nin der Rolle der Auntie Qin\n\n\n*Die Handlung und Szenen von „Railroad Tigers“* \nMa Yun (Jackie Chan), ein Schaffner bei der chinesischen Eisenbahn, ist der Anführer einer „Railroad Tigers“ genannten Gruppe von Rebellen, die sich während des Zweiten Weltkriegs darauf spezialisiert hat, japanische Züge zu überfallen und auszurauben, um mit der Beute die chinesische Bevölkerung zu ernähren. Doch erst als ihnen der chinesische Soldat Da Guo (Darren Wang) den Auftrag gibt, eine Brücke zu sprengen, um den Vormarsch der japanischen Armee in von China kontrolliertem Gebiet aufzuhalten, erhalten die patriotischen Freiheitskämpfer endlich die Gelegenheit, wirklich etwas Entscheidendes zum Krieg beizutragen. Doch dazu müssen Ma Yun und seine Rebellenkumpanen erst mal einen mit haufenweise Munition beladenen Zug der Japaner kapern – eine Mission, an der sogar die chinesische Armee gescheitert ist…\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Railroad Tigers“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:37.885Z",
      "thumbnail": "https://i.ytimg.com/vi/xfSTn3WcStM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDDnt1pM1gaDMkV897mU91Llgi-HQ",
      "duration": 7462,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-PG",
    "Runtime": "124 min",
    "imdbRating": 5.8,
    "imdbVotes": 5186,
    "Genre": "Action, Adventure, Comedy",
    "Plot": "In December 1941, The railway from Tianjin to Nanjing in East China became a key military transportation route, heavily guarded by Japanese soldiers. Ma Yuan, a railroad worker and his group of freedom fighters find themselves on the wrong side of the tracks when they decide to ambush a heavily armed military train filled with desperately needed provisions. Unarmed and outnumbered, they must rely on their wits to battle an entire army.",
    "Director": "Sheng Ding",
    "Writer": "Sheng Ding, Keke He, Alex Jia",
    "Actors": "Jackie Chan, Jaycee Cho-Ming Chan, Zitao Huang",
    "Language": "Mandarin, Japanese, English",
    "Country": "China",
    "Awards": "2 nominations total"
  },
  "relatedMovies": [
    "tt4030354",
    "tt5340882",
    "tt3899796",
    "tt3292154",
    "tt6581990",
    "tt4060576",
    "tt3672742",
    "tt4566574",
    "tt3062074",
    "tt5001456",
    "tt5758726",
    "tt3019694"
  ],
  "collections": [
    {
      "id": "martial-arts",
      "name": "Martial Arts"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:20:15.099Z"
}