{
  "movieId": "tt4667610",
  "title": "American Badger",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3MmzO7i-m4g",
      "id": "3MmzO7i-m4g",
      "title": "American Badger | Full Movie | Action Drama | Kirk Caouette",
      "description": "When the lives of a troubled woman and an unhinged stranger intertwine, lost in lust, they embark on a violent vigilante's path filled with promises and lies.\n2021.  Stars: Kirk Caouette, Andrea Stefancikova, Michael Kopsa\n*Licensed from Good Deed Entertainment. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:04:10.952Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/3MmzO7i-m4g/maxresdefault.webp",
      "duration": 4785,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "82 min",
    "imdbRating": 3.7,
    "imdbVotes": 616,
    "Genre": "Action, Drama, Thriller",
    "Plot": "He goes by the name Badger because his real name is Dean, and that's the lamest name ever for a hit-man. But really, it was his ex-wife that gave him that name before she died. Since her death he has been a recluse; like all American Badgers. In fact he has hardly spoken a word to anyone except his Handler in 4451 days. But all that is about to change with his latest assignment. His job is to make friends with a call girl and extract information from her about the inner workings of an Albanian gang she works for. Her name is Velvet and she is the closest thing the Albanian mob boss Vasily has to family; she is like a daughter to him -- in the most twisted way - a sex trafficked daughter. The Badger isn't good at making friends, but he's excellent at following orders; so despite his initial objections, he finds Velvet and makes an awkward, yet heroic introduction. Even though he identifies himself as a hardened recluse, he quickly realizes that he is much more vulnerable than he thought he was. As their new friendship takes a sharp turn into an unlikely romance, his Handler tells him that it is time to kill the girl, Vasily's partners, and Vasily himself. What does a badger do when it is cornered on all sides? Badgers are very territorial and will fight to the death to protect the things they care about. The ensuing carnage was to be expected, but the freedom and confidence he gives Velvet was something that nobody would have seen coming.",
    "Director": "Kirk Caouette",
    "Writer": "Kirk Caouette",
    "Actors": "Kirk Caouette, Andrea Stefancikova, Michael Kopsa",
    "Language": "English",
    "Country": "Canada",
    "Awards": "1 win total"
  },
  "relatedMovies": [
    "tt10309088",
    "tt4976192",
    "tt5781146",
    "tt9037864",
    "tt7816392",
    "tt7897478",
    "tt6439748",
    "tt5456104",
    "tt7204400",
    "tt6902332",
    "tt13818610",
    "tt10323676"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:10:53.590Z"
}