{
  "imdbId": "tt4827878",
  "title": "The Rendezvous",
  "year": 2016,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ow1lBUIsCn4",
      "id": "Ow1lBUIsCn4",
      "title": "The Rendezvous | Full Action Adventure Movie | Alfonso Bassave",
      "description": "The Rendezvous - Rachel, a Jewish-American doctor, and Jake, an Arab-American government bureaucrat, go on a goose chase across the Middle East trying to solve the mysterious death of Rachel's treasure-hunting brother. From Los Angeles to the deserts of Jordan and the ancient city of Petra, they find themselves hunted by a doomsday group called the Armageddonites who believe Rachel and Jake possess the missing Dead Sea Scroll that could bring about the end of days. Caught in the middle of a plot to hasten the end of mankind, Rachel and Jake need to solve the murder, find the scroll, and find trust in each other.\n2016.  Stars: Stana Katic, Raza Jaffrey, Alfonso Bassave\n**Under non-exclusive license from Distribution Solutions.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:51.182Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Ow1lBUIsCn4/maxresdefault.webp",
      "duration": 5573,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG-13",
    "Runtime": "92 min",
    "imdbRating": 5.2,
    "imdbVotes": 957,
    "Genre": "Action, Adventure",
    "Plot": "Rachel, a Jewish-American doctor, and Jake, an Arab-American government bureaucrat, go on a goose chase across the Middle East trying to solve the mysterious death of Rachel's treasure-hunting brother. From Los Angeles to the deserts of Jordan and the ancient city of Petra, they find themselves hunted by a doomsday group called the Armageddonites who believe Rachel and Jake possess the missing Dead Sea Scroll that could bring about the end of days. Caught in the middle of a plot to hasten the end of mankind, Rachel and Jake need to solve the murder, find the scroll, and find trust in each other.",
    "Director": "Amin Matalqa, Annemarie Jacir",
    "Writer": "Sarah Isaias, Terrel Seltzer",
    "Actors": "Stana Katic, Raza Jaffrey, Alfonso Bassave",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt1753786",
    "tt4030354",
    "tt4247682",
    "tt2457330",
    "tt3157640",
    "tt4687848",
    "tt5720450",
    "tt6231588",
    "tt5340882",
    "tt2784134",
    "tt6083388",
    "tt3899796"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:15.290Z"
}