{
  "movieId": "tt4887484",
  "title": "Sailor Beware!",
  "year": 1955,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/BewareSailors",
      "id": "BewareSailors",
      "title": "Sailor Beware!",
      "description": "Title: Sailor Beware! Summary: Sailor Beware. is a 1956 British romantic comedy film directed by Gordon Parry. It was released as Panic in the Parlor in the United States. The film is an adaptation of the successful ... Production Company: British Broadcasting Corporation (BBC) Release Date: TV Movie 6 June 1955 Sailor Beware. is a 1956 British romantic comedy film directed by Gordon Parry. It was released as Panic in the Parlor in the United States. The film is an adaptation of the successful stage play of the same name. It follows the story of a sailor betrothed to be married, but wary that home-life may echo that of her parents: a hen-pecked husband and battle-axe mother. It is one of Michael Caine's first films; he has a small, uncredited role as a sailor.",
      "fileSize": 544842770,
      "addedAt": "2026-01-07T00:06:14.038Z",
      "thumbnail": "https://archive.org/services/img/BewareSailors",
      "year": 1955,
      "collection": "feature_films",
      "downloads": 3258
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "60 min",
    "imdbRating": 6.4,
    "imdbVotes": 21,
    "Genre": "Comedy, Drama",
    "Plot": "Sailor Beware. is a 1956 British romantic comedy film directed by Gordon Parry. It was released as Panic in the Parlor in the United States. The film is an adaptation of the successful stage play of the same name. It follows the s...",
    "Director": "N/A",
    "Writer": "Falkland L. Cary, Philip King",
    "Actors": "Jean Burgess, James Copeland, Sheila Shand Gibbs",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt1727546",
    "tt0047900",
    "tt0048188",
    "tt0048370",
    "tt0048380",
    "tt0048037",
    "tt0048312",
    "tt0049397",
    "tt0046799",
    "tt0045620",
    "tt0049683",
    "tt0047437"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:14.038Z"
}