{
  "movieId": "tt4926042",
  "title": "Night of the Wild",
  "year": 2015,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mHpRLUH4f98",
      "id": "mHpRLUH4f98",
      "title": "Night of the Wild | Full Horror Sci-Fi Movie",
      "description": "**This film is under license from The Asylum.  All rights reserved**\n\nNight of the Wild - In a seemingly quiet town a mysterious meteor shower produces a sinister green meteorite that seems to have a dangerous effect on the dogs that who once were the kind well-behaved dogs we once knew turn into vicious killers and the residents are forced to engage in a battle of man vs beast as man's best friend turns into their worst enemy and one teenage girl named Roslyn has to fight her way through the vicious canines accompanied by her faithful dog Shemp they must find a way to survive against the dogs they once called man's best friend.\n\n2015\nStars: Rob Morrow, Kelly Rutherford, Tristin Mays\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:09:48.221Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/mHpRLUH4f98/maxresdefault.webp",
      "duration": 5332,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "NZ",
          "PH",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "89 min",
    "imdbRating": 3.2,
    "imdbVotes": 824,
    "Genre": "Action, Horror, Sci-Fi",
    "Plot": "In a seemingly quiet town a mysterious meteor shower produces a sinister green meteorite that seems to have a dangerous effect on the dogs that who once were the kind well-behaved dogs we once knew turn into vicious killers and the residents are forced to engage in a battle of man vs beast as man's best friend turns into their worst enemy and one teenage girl named Roslyn has to fight her way through the vicious canines accompanied by her faithful dog shemp they must find a way to survive against the dogs they once called man's best friend",
    "Director": "Eric Red",
    "Writer": "Delondra Mesa",
    "Actors": "Rob Morrow, Kelly Rutherford, Tristin Mays",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt4943934",
    "tt1920846",
    "tt5742568",
    "tt3774802",
    "tt6874406",
    "tt6710826",
    "tt2130142",
    "tt8128866",
    "tt2175184",
    "tt8439934",
    "tt0197521",
    "tt0121694"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:13.601Z"
}