{
  "movieId": "tt5126922",
  "title": "The Pirates of Somalia",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k2URyBDNeGI",
      "id": "k2URyBDNeGI",
      "title": "Pirates of Somalia - Al Pacino, Evan Peters - Ganzen Film kostenlos in HD schauen bei Moviedome",
      "description": "*GANZER FILM - Starbesetzter Spielfilm nach wahren Ereignissen*\n\nDen Spielfilm „Pirates of Somalia“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Pirates of Somalia“:\nIMDb: *6,7* von 10\nAmazon: *4,2* von 5\n\n*Die Handlung von „Pirates of Somalia“*\nNach dem College-Abschluss träumt Jay Bahadur (Evan Peters) davon, ein erfolgreicher Journalist zu werden. 2008 reist er auf den Rat des erfahrenen Kollegen Seymour Tolbin (Al Pacino) nach Somalia, um ein Buch zu schreiben. Er hat zwar keinen konkreten Plan, dafür aber jede Menge Ehrgeiz. Begleitet von seinem Übersetzer Abdi (Barkhad Abdi) kriegt er tiefe Einblicke in das Leben und die Organisation der hiesigen Piraten. Doch es scheint alles nicht genug zu sein - um einen Verleger für sein Buch zu finden, begibt sich Jay in weitere Gefahren…\n\n*Über den Film*\nDer Film basiert auf realen Ereignissen aus dem Buch von Jay Bahadur und ist mit hochkarätigen Stars wie Oskar® Preisträger Al Pacino (Der Pate), Oscar®-Nominee und Golden Globe-Preisträgerin Melanie Griffith (Working Girl), Oscar®-Nominee Barkhad Abdi (Captain Phillips) und Evan Peters (X-Men: Apocalypse, American Horror Story) besetzt.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Pirates of Somalia“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Spielfilm #DramaFilm #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: The Pirates of Somalia\nLaufzeit: 116 Minuten\nRegie: Bryan Buckley\nFSK: 16\nErstveröffentlichung: 2017\n\n\n*Das sind die Schauspieler*\nEvan Peters (bekannt aus „X-Men: Zukunft ist Vergangenheit\", \"Dahmer\")\nin der Rolle des Jay Bahadur\nAl Pacino (bekannt aus „Der Pate\", \"The Irishman\", \"House of Gucci\")\nin der Rolle des Seymour Tolbin\nMelanie Griffith (bekannt aus \"Nach eigenen Regeln\", \"Der Tod kommt zweimal\")\nin der Rolle der Maria Bahadur\nBarkhad Abdi (bekannt aus „Captain Phillips\", \"Good Time\", \"Eye in the Sky\")\nin der Rolle des Abdi\n\n\n*Die Handlung und Szenen von „Pirates of Somalia“*\nJay Bahadur (Evan Peters) ist gerade mit dem College fertiggeworden. Nun träumt er davon, ein erfolgreicher Journalist zu werden. 2008: Sein erfahrener Kollege Seymour Tolbin (Al Pacino) gibt ihm den Rat, nach Somalia zu reisen und das Erlebte in einem Buch zu verarbeiten. Jay folgt dem Ratschlag. Er hat keinen konkreten Plan, aber umso mehr Ehrgeiz. Begleitet von seinem Übersetzer Abdi (Barkhad Abdi) bekommt Jay genaue Einblicke darin, wie die somalischen Piraten leben. Aber Jay will immer tiefer in die fremde und gefährliche Welt einsteigen. Damit er einen Verleger für sein Buch findet, setzt sich der junge Journalist größten Gefahren aus…\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Pirates of Somalia“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:25.343Z",
      "thumbnail": "https://i.ytimg.com/vi/k2URyBDNeGI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD0f7cv1gbfyBdNYOKUxCHzHs-LPw",
      "duration": 7067,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "116 min",
    "imdbRating": 6.7,
    "imdbVotes": 11700,
    "Genre": "Biography, Drama",
    "Plot": "In 2008, rookie journalist Jay Bahadur forms a half-baked plan to embed himself among the pirates of Somalia. He ultimately succeeds in providing the first close-up look into who these men are, how they live, and the forces that drive them.",
    "Director": "Bryan Buckley",
    "Writer": "Bryan Buckley, Jay Bahadur",
    "Actors": "Al Pacino, Evan Peters, Melanie Griffith",
    "Language": "English, Somali",
    "Country": "South Africa, United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt3829920",
    "tt6113488",
    "tt5540992",
    "tt5752606",
    "tt5716464",
    "tt5591786",
    "tt3844876",
    "tt5601792",
    "tt1659619",
    "tt5029668",
    "tt6212478",
    "tt2392830"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:20:06.394Z"
}