{
  "imdbId": "tt5127252",
  "title": "Common Wormwood",
  "year": 2016,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/wormwood_frank-olson",
      "id": "wormwood_frank-olson",
      "title": "Wormwood",
      "description": "Based on the life of scientist, Frank Olson  who worked for a secret government biological warfare program (the USBWL ) at Fort Detrick , Maryland. WORMWO0D focuses on the events leading up to and following Olson's controversial death, which the US government originally claimed was a tragic accident, but later admitted was likely a suicide, caused by a mental breakdown brought on after being unknowingly dosed with LSD  at a working retreat with colleagues from the CIA who were involved in Project MKUltra . It also follows Frank Olson's son in the present day, who discusses his belief that his father may have been murdered due to being perceived as a potential security risk. Interspersed between interviews and archival footage are live action reenactments of the final days of Frank Olson's life and the various theories involving his death.   source Writing for The New York Review of Books, scholar Michael Ignatieff concludes, \"Though I still resist the facts, the facts, as [Eric] Olson’s research has established, are that Allen Dulles , Richard Helms , and other unnamed persons at the highest levels of the American government ordered the death of Eric’s father [Frank Olson] because they feared he knew too much about US biological warfare during the Korean War , and about the torture and execution of Soviet agents and ex- Nazi \"expendables\" in black sites in Europe during the early 1950s. Having killed him, the CIA confected the story that Olson's death was a suicide brought on by stress, and later attributed his jump from the window to the effects of a cocktail laced with LSD. It now appears that the LSD was administered at a CIA retreat in Maryland to discover exactly what Olson knew. When this experiment revealed that he was indeed \"unreliable,\" he was taken to New York and disposed of .\"   source See also: 1953 CIA Assassination Manual: Page 9 - Section 2. Accidents",
      "fileSize": 1876124643,
      "addedAt": "2026-01-07T00:13:06.705Z",
      "thumbnail": "https://archive.org/services/img/wormwood_frank-olson",
      "language": "eng",
      "year": 2017,
      "collection": "feature_films",
      "downloads": 1902
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "59 min",
    "imdbVotes": null,
    "Genre": "Documentary, Animation",
    "Plot": "Director Malin Shield makes his highly personal portrait of the housing project Gråbo outside old hansa town Visby. We may encounter some residents that together give the otherwise drab suburb an almost magical shimmer where everything becomes a little larger than reality.",
    "Director": "Malin Skjöld",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "Swedish",
    "Country": "Sweden",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt14091630",
    "tt0276867",
    "tt0475080",
    "tt12606824",
    "tt16899218",
    "tt6056976",
    "tt6564690",
    "tt5794194",
    "tt5095004",
    "tt6406878",
    "tt10161390",
    "tt8228460"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:13:06.705Z"
}