{
  "movieId": "tt5598030",
  "title": "Trailer",
  "year": 1980,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mommartz_Tango_duch_Deutschland_1980",
      "id": "Mommartz_Tango_duch_Deutschland_1980",
      "title": "1980 Tango durch Deutschland (Trailer)",
      "description": "Tango Through Germany: Eddie Constantine is given the chance to lead a new and better life but he fails. Musik: Astor Piazzolla / Kamera: Lutz Mommartz, Martin Schäfer, Dieter Fietzke, Jürgen F. Hagemann Ton: Herbert Baumann, Jürgen Zech / Maske: Marie-Luise Engel / Mitarbeit: Georg Bühren, Wolfgang Braden, Walter Foelske, Jürgen Kuhfuß /Schnitt: Ina Rasche / Produktionsleitung: Ulli Kratzsch Schauspieler: Eddie Constantine, Maya Faber-Jansen, Detlef F. Neufert, Manfred Bölk, Anna Plakinger, Gerta Reinhardt, Georg Bradtke, Jango Edwards and his friends road-show,Hartmut Redottée, Bastian Feldmann, Klaus Hang u.v.a Mit Eddie und einem kleinen Team wollte ich durch die Lande ziehen, jeweils vor Ort eine Aktion ausdenken und filmen. Als die Filmförderung mitmachte, wollte er nicht mehr ohne Drehbuch und verlangte ein Honorar. Mit seiner Frau Maya Faber-Jansen erarbeitete er seine Lebensgeschichte. Ein neuer Kameramann mußte gefunden werden, weil es Dieter Fietzke zu mulmig wurde. Auf Wunsch beider übernahm Martin Schäfer die Kamera Pech für mich, weil der ganz andere Bilder dachte als ich. Und so nahm die Katastrophe ihren Lauf. (LM)",
      "fileSize": 341235851,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/Mommartz_Tango_duch_Deutschland_1980",
      "language": "ger",
      "year": 1980,
      "collection": "feature_films",
      "downloads": 5365
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "14 min",
    "imdbVotes": null,
    "Genre": "Short, Comedy",
    "Plot": "A parody of Bruce Lee movies done in an extended trailer format.",
    "Director": "Scott Rhodes",
    "Writer": "Scott Rhodes",
    "Actors": "Robert Arocho, Chris Callaghan, Ulysses E. Campbell, Paul Hendriks",
    "Language": "English",
    "Country": "USA",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0176684",
    "tt0015477",
    "tt2459468",
    "tt12180592",
    "tt10906518",
    "tt0048920",
    "tt0381908",
    "tt0000653",
    "tt0007802",
    "tt0440334",
    "tt0002133",
    "tt0308284"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}