{
  "imdbId": "tt5679554",
  "title": "Coffin 2",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aD9WpO4Oln8",
      "id": "aD9WpO4Oln8",
      "title": "Coffin 2 | Full Movie | Horror Thriller",
      "description": "Coffin 2 - The mystery man known as “Trick” is back... but not on his terms. Trick finds himself trapped in a cage with four others, all immobilized from the neck down. When Trick realizes that one of the other hostages is an old foe, Detective Epperson, the two begin working together to uncover the connection between them and their captor — a masked man they suspect to be the infamous Deathstalker Killer. Meanwhile, Agent Bobby Church of the FBI is tracking Epperson’s disappearance, which happened while the detective was following a lead in the Deathstalker case. The search soon leads Church to Epperson's former partner, Scott, himself looking into the abduction of his friend, Olivia. When Scott and Church discover cellphone pictures of Olivia in the cage with Trick and Epperson, they must race against the clock to find the location of the cage before time runs out... and the hostages are executed one-by-one.\n2017.  Stars: Robert Allen Mukes, Johnny Alonso, Laura James\n**Under license from Leomark Studios.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:44:55.393Z",
      "thumbnail": "https://i.ytimg.com/vi/aD9WpO4Oln8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDQsaH1dWChjBqiFoqecGYr5JVTCA",
      "duration": 6095,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "AE",
          "AF",
          "AM",
          "AZ",
          "BD",
          "BH",
          "BN",
          "BT",
          "CC",
          "CN",
          "CX",
          "GE",
          "HK",
          "ID",
          "IL",
          "IN",
          "IQ",
          "IR",
          "JO",
          "JP",
          "KG",
          "KH",
          "KP",
          "KR",
          "KW",
          "KZ",
          "LA",
          "LB",
          "LK",
          "MM",
          "MN",
          "MO",
          "MV",
          "MY",
          "NP",
          "OM",
          "PH",
          "PK",
          "PS",
          "QA",
          "SA",
          "SG",
          "SY",
          "TH",
          "TJ",
          "TM",
          "TR",
          "TW",
          "UZ",
          "VN",
          "YE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "101 min",
    "imdbRating": 3.2,
    "imdbVotes": 3599,
    "Genre": "Crime, Horror, Thriller",
    "Plot": "After years on the run, the mystery man known as \"Trick\" is back, but not on his own terms. Trick finds himself trapped in a cage with four other hostages - all of them paralyzed from the neck down. When Trick realizes that one of the other hostages is an old foe, Detective Epperson, the two begin working together to uncover the connection between them and their captor - a masked man they suspect is the infamous Deathstalker Killer. Meanwhile, Agent Bobby Church of the FBI is investigating Epperson's disappearance and discovers the detective vanished while he had been following a lead in the Deathstalker case. The search soon has Church crossing paths with Epperson's former partner, Scott, himself looking into the abduction of his friend, Olivia. After Scott and Church discover cellphone pictures of Olivia in the cage with both Trick and Epperson, they know they must race against the clock to find the location of the cage before time runs out, and the hostages are executed one-by-one.",
    "Director": "Kipp Tribble",
    "Writer": "Kipp Tribble",
    "Actors": "Robert Allen Mukes, Johnny Alonso, Kipp Tribble",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3869392",
    "tt0052609",
    "tt0088828",
    "tt0036653",
    "tt2103217",
    "tt0995033",
    "tt6387040",
    "tt3203620",
    "tt5847286",
    "tt5848714",
    "tt0489318",
    "tt3787068"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:55:37.512Z"
}