{
  "movieId": "tt5794194",
  "title": "Other Losses",
  "year": 2015,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/other-losses-die-verschwiegene-geschichte-deutschlands-nach-1945",
      "id": "other-losses-die-verschwiegene-geschichte-deutschlands-nach-1945",
      "title": "Other Losses – Die Verschwiegene Geschichte Deutschlands Nach 1945",
      "description": "Dokumentation über die verschwiegene Geschichte Deutschlands nach 1945",
      "fileSize": 579160302,
      "addedAt": "2026-01-07T00:10:12.693Z",
      "thumbnail": "https://archive.org/services/img/other-losses-die-verschwiegene-geschichte-deutschlands-nach-1945",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 104
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "63 min",
    "imdbVotes": null,
    "Genre": "Documentary, History",
    "Plot": "During the Second World War, British Prime Minister Winston Churchill and US President Franklin Roosevelt agreed to the Morgenthau Plan to destroy Germany after the war. As soon as the fighting stopped in 1945, Poland and Russia annexed eastern Germany creating 16 million starving refugees with British and Russian approval. Prisoners in US and French camps were denied protection due under the Geneva Convention and starved to death. More Germans died of allied action after the war than during the war. More than nine million Germans died in the greatest mass slaughter ever known. The film is based on research by author James Bacque whose books have sold over 300,000 copies world-wide, plus research by US Army Senior Historian Col. Dr. Ernest F. Fisher Jr, It also includes the mass charity extended by sympathizers in Canada and the US who disagreed with official policy and who helped to feed the starving enemy. All this has been hidden for over 70 years as the military industrial complex has ruled in the west.",
    "Director": "James Bacque",
    "Writer": "N/A",
    "Actors": "N/A",
    "Language": "English",
    "Country": "Canada, Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt2827918",
    "tt3123418",
    "tt4382650",
    "tt3122370",
    "tt6564690",
    "tt0178933",
    "tt0471163",
    "tt0471294",
    "tt0257088",
    "tt0471384",
    "tt5095004",
    "tt4189440"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:10:12.693Z"
}