{
  "movieId": "tt5851014",
  "title": "Savage Dog",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kqnEo7W9bmk",
      "id": "kqnEo7W9bmk",
      "title": "SAVAGE DOG - Actionkracher mit SCOTT ADKINS (Ganzer Film Deutsch, neue Filme Deutsch komplett 2025)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Erlebt Action-Superstar SCOTT ADKINS (\"John Wick: Chapter 4\" & \"Undisputed\"-Reihe) in einem harten Action-Kracher in dem er sich gegen die korrupten Bosse eines indochinesischen Gefangenenlagers zur Wehr setzt...\n\nSAVAGE DOG (2017)\nOriginaltitel: Savage Dog\nMit: Scott Adkins, Marko Zaror, JuJu Chan Szeto, Cung Le, Vladimir Kulich, Keith David\nRegie: Jesse V. Johnson\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nIndochina – 1959. Eine heruntergekommene Stadt wird von vietnamesischen Warlords und europäischen Kriegsverbrechern kontrolliert. Fünf solcher gefährlichen Männer leiten das Arbeitslager Den-Dhin-Chan. Gefangen an diesem grausamen Ort, hat sich der frühere Preisboxer Martin Tillman (Scott Adkins) einen Namen im Turnierkampf gemacht und die wohlhabendsten Gefangenen haben hohe Summen auf ihn gesetzt. Als Tillmans Entlassung naht, möchte er eigentlich nur nach Hause. Aber die korrupten Gefängnisbosse tun alles, um seine Freilassung zu verhindern. Nachdem Tillman auf brutale Weise alles entrissen wird, was ihm lieb und teuer war, sieht er sich zur Konfrontation mit den fünf Aufsehern gezwungen und nimmt Rache.\n#Netzkino #ganzerFilm #ScottAdkins\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:38.266Z",
      "thumbnail": "https://i.ytimg.com/vi/kqnEo7W9bmk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDYXAJfJKNE-W1mVAj6jQd8EtCDQA",
      "duration": 5650,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "94 min",
    "imdbRating": 5,
    "imdbVotes": 3933,
    "Genre": "Action, Drama",
    "Plot": "Indochina, 1959. A Wild West town controlled by the criminal class: Vietnamese warlords and European war criminals. Den-Dhin-Chan Labor Camp is run by four such dangerous men. The worst prison in the land, it is here that a European, former-champion boxer Martin Tilman (Scott Adkins) has made a name for himself fighting tournaments, on which wealthy criminals gamble in high stakes events. When Tilman is due for release, he just wants to return home, but the corrupt forces running the jail will do everything in their power to keep him locked down. When all that Tilman holds dear is taken away in a vicious act of violence, he is forced to confront the five men responsible and take his revenge.",
    "Director": "Jesse V. Johnson",
    "Writer": "Jesse V. Johnson",
    "Actors": "Scott Adkins, Marko Zaror, JuJu Chan Szeto",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt3881026",
    "tt5189828",
    "tt4400994",
    "tt3829920",
    "tt6083388",
    "tt6353716",
    "tt6236198",
    "tt5456104",
    "tt7160176",
    "tt7108074",
    "tt3121200",
    "tt4843618"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:10.824Z"
}