{
  "imdbId": "tt5868924",
  "title": "Devil's Whisper",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vqvb175gh7c",
      "id": "Vqvb175gh7c",
      "title": "Devil's Whisper | Full Horror Thriller Movie",
      "description": "*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nDevils Whisper - 15-year-old Alejandro Duran, who comes from a religious Latino family, aspires to one day be a Catholic priest. But when he discovers a mysterious box he unwittingly unleashes a demonic spirit bent on possessing him. Alex must find a way to defeat this evil entity before it destroys him and everyone he loves. On the surface, Devil's Whisper is a psychological horror film about demonic possession but underneath it's a character driven drama about repressed psychological trauma and the cycle of abuse.\n2019.  Stars: Luca Oriel, Dave Abdalian, Violkys Bustamante\n\n**This film is under non-exclusive license from Distribution Solutions/Alliance Entertainment. All rights reserved**\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:09:19.903Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Vqvb175gh7c/maxresdefault.webp",
      "duration": 5129,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "85 min",
    "imdbRating": 4.2,
    "imdbVotes": 787,
    "Genre": "Horror, Thriller",
    "Plot": "15 year-old Alejandro Duran, who comes from a religious Latino family, aspires to one day be a Catholic priest. But when Alex discovers a mysterious box he unwittingly unleashes a demonic spirit bent on possessing him. Alex must find a way to defeat this ancient demon, which has been tormenting children since the dawn of man, before it destroys him and everyone he loves. On the surface Devil's Whisper is a supernatural horror film about demonic possession but at its core it's a psychological thriller about repressed memories, childhood trauma and the cycle of abuse.",
    "Director": "Adam Ripp",
    "Writer": "Adam Ripp, Oliver Robins, Paul Todisco",
    "Actors": "Luca Oriel, Tessie Santiago, Marcos A. Ferraez",
    "Language": "English",
    "Country": "United States, Indonesia",
    "Awards": "7 wins & 6 nominations total"
  },
  "relatedMovies": [
    "tt7336182",
    "tt8332666",
    "tt7857076",
    "tt7267530",
    "tt4634402",
    "tt9390026",
    "tt9382596",
    "tt7831358",
    "tt7246106",
    "tt3695346",
    "tt10772662",
    "tt5774450"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:19:22.016Z"
}