{
  "imdbId": "tt6118340",
  "title": "The Basement",
  "year": 2018,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8jrI6vCOBTs",
      "id": "8jrI6vCOBTs",
      "title": "The Basement: The Gemini Killer - Horror-Thriller mit Mischa Barton - Ganzer Film kostenlos in HD",
      "description": "*GANZER FILM - Ein scheinbar unschuldiger Mann wird von einem berüchtigten Serienmörder aus L.A. entführt*\n\nDen Spielfilm „The Basement: The Gemini Killer“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „The Basement: The Gemini Killer“:\nIMDb: *4* von 10\nAmazon: *3* von 5\n\n*Die Handlung von „The Basement: The Gemini Killer“*\nEin brutaler Serienkiller zieht mordend durch die Gegend und hinterlässt eine blutige Spur voller Opfer. Eines Tages wird auch Kellys Ehemann vom Täter entführt und in ein dunkles Verlies verschleppt. Dort beginnt für Craig ein grausamer Albtraum. Der Mörder leidet unter einer gespaltenen Persönlichkeit und wechselt zwischen zwölf unterschiedlichen Identitäten. Inmitten dieser seelischen Zerrissenheit sucht Craig verzweifelt nach einer der Persönlichkeiten, die ihm zur Flucht verhelfen könnte.\n\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „The Basement: The Gemini Killer“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\n\n#Moviedome #ganzerFilm #HorrorFilm #FilmeKostenlos #MoviedomeFilm\n\nRegie: Brian M. Conley, Nathan Ives\nLaufzeit: 88 Minuten\nFSK: 18\nErstveröffentlichung: 2018\n\n\n*Das sind die Schauspieler von „The Basement: The Gemini Killer“*\nJackson Davis als Bill Anderson\nMischa Barton als Kelly Owen\nCayleb Long als Craig Owen\n\n\n*Die Handlung und Szenen von „The Basement: The Gemini Killer“* \nEin brutaler Serienkiller zieht mordend durch die Gegend und hinterlässt eine blutige Spur voller Opfer. Eines Tages wird auch Kellys Ehemann vom Täter entführt und in ein dunkles Verlies verschleppt. Dort beginnt für Craig ein grausamer Albtraum. Der Mörder leidet unter einer gespaltenen Persönlichkeit und wechselt zwischen zwölf unterschiedlichen Identitäten. Inmitten dieser seelischen Zerrissenheit sucht Craig verzweifelt nach einer der Persönlichkeiten, die ihm zur Flucht verhelfen könnte.\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „The Basement: The Gemini Killer“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:29:09.044Z",
      "thumbnail": "https://i.ytimg.com/vi/8jrI6vCOBTs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB1PItn1NXPHp-jP58G-c5ljhQOaQ",
      "duration": 5285,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/DontLookInTheBasement_201511",
      "id": "DontLookInTheBasement_201511",
      "title": "Dont Look In The Basement",
      "description": "This film has fallen into the Public Domain.",
      "fileSize": 2665547767,
      "addedAt": "2026-01-07T00:06:19.369Z",
      "thumbnail": "https://archive.org/services/img/DontLookInTheBasement_201511",
      "collection": "feature_films",
      "downloads": 2399
    }
  ],
  "metadata": {
    "Rated": "TV-MA",
    "Runtime": "88 min",
    "imdbRating": 4,
    "imdbVotes": 4185,
    "Genre": "Horror",
    "Plot": "After taking an extended \"hiatus\" to kick his drug habit, life is looking up for renowned rock musician, Craig Owen (Cayleb Long). He has a beautiful new wife, Kelly (Mischa Barton), a Malibu mansion perched high above the Pacific, and a new album moving up the charts. While running an ill-fated errand one evening, Craig is abducted by L.A.'s notorious serial killer, Gemini (Jackson Davis). Awakening in Gemini's basement with his arms and legs bound to an old school desk, Craig discovers that Gemini plans to enact his own capture, torture and possible execution by switching places with Craig. Distraught over Craig's disappearance, Kelly alternates between desperately searching for him and holding vigil with her best friend, Bianca (Bailey Borders). As the hours pass, a sub-plot involving adultery, deception and possibly even murder begins to suggest that everything in Craig's and Kelly's life may not be as perfect as it seems. After Gemini appears as a series of equally sadistic characters, Craig begins to engage his would-be killer in a series of complex psychological battles with the hope that his captor will drop his guard long enough for Craig to escape. Just as his designated hour of execution approaches, Craig frees himself from his restraints and and escapes from the basement. But will he get back to Kelly before he is recaptured by Gemini? If not, he knows a horrific fate awaits him.",
    "Director": "Brian M. Conley, Nathan Ives",
    "Writer": "Nathan Ives, Brian M. Conley, Sean Decker",
    "Actors": "Jackson Davis, Cayleb Long, Mischa Barton",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 1 nomination"
  },
  "relatedMovies": [
    "tt8924952",
    "tt8055402",
    "tt6829180",
    "tt4374286",
    "tt5774450",
    "tt6772950",
    "tt8991200",
    "tt7721742",
    "tt4418152",
    "tt6143782",
    "tt6384998",
    "tt7169100"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:19.369Z"
}