{
  "imdbId": "tt6192716",
  "title": "The Red Effect",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vE8JUDSIDH4",
      "id": "vE8JUDSIDH4",
      "title": "The Red Effect | Full Controversial Drama Movie",
      "description": "**This film is under license from Vision Films Inc. All rights reserved**\n\nThe Red Effect - Tensions rise in a southeast Washington, DC community following the deadly shooting of an unarmed black teenager at the hands of a white man. An impromptu television interview shortly after the shooting captures a powerful rant by life-long black community member Glenn Johnson who has managed against all odds to find his calling as the leader of a program that aims to give adults in his community a second chance at life.\n\n2017\nStars: Rachel Addai, Nateice Aisha, Tracey Allyn\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:46:52.869Z",
      "thumbnail": "https://i.ytimg.com/vi/vE8JUDSIDH4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCOhELdNxwKB58wzOxkjHSt36TnkQ",
      "duration": 5491,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "92 min",
    "imdbRating": 7.2,
    "imdbVotes": 28,
    "Genre": "Drama",
    "Plot": "Tensions rise in a southeast Washington, DC community following the deadly shooting of an unarmed black teenager at the hands of a white man. An impromptu television interview shortly after the shooting captures a powerful rant by life-long black community member Glenn Johnson who has managed against all odds to find his calling as the leader of a program that aims to give adults in his community a second chance at life. The same program from which the shooting victim recently graduated. Actor Pierre Walters's epic portrayal of Glenn as a no-nonsense instructor trying vehemently to help his students better themselves and overcome perceptions and stereotypes blends seamlessly as he becomes the voice of his community - a voice desperately needed after experiencing decades of racial inequality. Actress Tracy Allyn leads in the media investigation as Naomi Morgan, a young, white reporter not willing to back down even after being told by her black editor that it's an open and shut case. The strong supporting cast of Glenn's students deliver such realistic performances that the audience feels what it's like to live in their impoverished community. Directed by Jordan Miller, The Red Effect is an intense and thought-provoking film that doesn't hold back from asking the difficult questions. What is \"right\" in an America where negative perceptions reign?",
    "Director": "Jordan Miller",
    "Writer": "Larry Brown, Stuart Evans, Greg Miller",
    "Actors": "Rachel Addai, Nateice Aisha, Tracey Allyn",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 win & 3 nominations"
  },
  "relatedMovies": [
    "tt3881026",
    "tt6966538",
    "tt6777170",
    "tt6218794",
    "tt6207878",
    "tt7224496",
    "tt3902120",
    "tt7611096",
    "tt5189828",
    "tt5167966",
    "tt2582784",
    "tt3203620"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T14:58:35.741Z"
}