{
  "movieId": "tt6105150",
  "title": "Sliders",
  "year": 2018,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AYl8OCih4do",
      "id": "AYl8OCih4do",
      "title": "Easy Money (Sliders) | Full Drama Movie",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nEasy Money (Sliders) - After the recent death of their father, brothers \"Jamal Smith\" (California Brougham) \"K.C & JoJo Smith\" (Sportcoat O.A.K & Royal Highness) begin working the late night for Sullivan Brothers Janitorial Service. Their new cleaning assignment lands them at a credit recovery office where one of the brothers decides to swipe more than just his time card!\n\n2018\nStars: Michael Blackson, California Brougham, Philla Brougham\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:12.653Z",
      "thumbnail": "https://i.ytimg.com/vi/AYl8OCih4do/maxresdefault.jpg",
      "duration": 3864,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "ID",
          "IN",
          "JM",
          "MY",
          "PH",
          "PK",
          "US",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "65 min",
    "imdbRating": 2.9,
    "imdbVotes": 33,
    "Genre": "Drama",
    "Plot": "After the recent death of their father, brothers \"Jamal Smith\" (California Brougham) \"K.C &amp; JoJo Smith\" (Sportcoat O.A.K &amp; Royal Highness) begin working the late night for Sullivan Brothers Janitorial Service. Their new cleaning assignment lands them at a credit recovery office where one of the brothers decides to swipe more than just his time card!While working, K.C over hears a conversation from an office employee in the building after hours that once an individual dies it takes at least 45 days before their bank and credit card information is fully deleted from all systems. K.C then sets a plan in motion to use the cards to purchase items and return them back to stores for full cash value. As the move looks to be easy and money is coming in hand over fist, K.C and JoJo decide to let their cousins \"Darnell\" (Omar Gooding) &amp; Shawn (Scruncho) in on the hustle. Unfortunately, the money hungry cousins as well as K.C. start getting reckless and begin to bring a lot of unwanted attention to their little scheme.Completely unknown to K.C, JoJo and their cousins, one of the cards taken from an office drawer was a black card with millions of dollars on it. This particular black card also happens to belong to a rich gangsta named \"Donald West\"(Yonel Dorelis). When West finds out his card is missing, he dispatches his crew to infiltrate the Union Credit Recovery Bank Headquarters and get to the bottom of where his card is. Finally through a series of minor purchases, wild strip club nights, and flossin', Mr. West's associates finds out K.C and his cousins has the card and move to reclaim his property by any means necessary!!",
    "Director": "Charles Steven Durán, La La King",
    "Writer": "La La King, Darien Smith",
    "Actors": "Michael Blackson, California Brougham, Philla Brougham",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt7915554",
    "tt7752082",
    "tt6753132",
    "tt4976192",
    "tt9233728",
    "tt9592278",
    "tt8332772",
    "tt6923840",
    "tt6835804",
    "tt6893370",
    "tt5781146",
    "tt6212478"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:21:04.335Z"
}