{
  "imdbId": "tt6189898",
  "title": "Apenas Reflejos",
  "year": 1986,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/apenas-reflejos-1986",
      "id": "apenas-reflejos-1986",
      "title": "Apenas Reflejos (1986)",
      "description": "Apenas reflejos  es una película de  Argentina  filmada en video dirigida por  Hugo Bab Quintela  sobre su propio guion que se produjo en 1986 y no se estrenó comercialmente. Tuvo como actores principales a  Rodolfo Ranni ,  Miguel Ligero ,  Graciela Dufau ,  Ricardo Darín  y  Cristina Murta . (Wikipedia) Sinopsis Cuando fallece su madre viuda, un joven va a ver a la antigua amante de su padre y rememoran la vida de los mismos que transcurrió durante los dos primeros gobiernos de Perón. Reparto Actor Personaje Rodolfo Ranni Alejandro Miguel Ligero Arturo Graciela Dufau Genoveva, esposa de Alejandro Ricardo Darín Hijo de Alejandro María Luisa Robledo Madre de Alejandro Cristina Murta Amante de Alejandro",
      "fileSize": 571304874,
      "addedAt": "2026-01-07T00:07:25.000Z",
      "thumbnail": "https://archive.org/services/img/apenas-reflejos-1986",
      "language": "spa",
      "year": 1986,
      "collection": "feature_films",
      "downloads": 65
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "105 min",
    "imdbVotes": null,
    "Genre": "Drama",
    "Plot": "Apenas Reflejos (Barely Reflections) is a fairly short movie which tells the story of a family, featuring lead actor Rodolfo Ranni as the main character. The time period on which the story focuses, is no less than the first mandate of President Perón, with a view on the social struggles he had to endure during that time.The film emphasizes mainly on Alejandro (Rodolfo Ranni). Everything revolves around his life: the relationship with his son, the conflicts with his wife, the difficulties of having an affair, the political arguments with his father, and some work issues, amongst other things. As the movie transpires, we can establish a parallel between Perón's government and Alejandro's life, both slowly fading away. It's not a film on which performances stand out, but it is, nonetheless, a pleasant watching experience, given its simplicity, the interesting historical setup, the soundtrack - there are a couple of nice themes - and the charming characters populating it. Closing in, Apenas Reflejos is a movie that gets the job done, despite the fact that it doesn't excel on any particular area.",
    "Director": "Hugo Bab Quintela",
    "Writer": "N/A",
    "Actors": "Rodolfo Ranni, Miguel Ligero, Graciela Dufau",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt0186908",
    "tt0311716",
    "tt0089721",
    "tt0092688",
    "tt0091364",
    "tt0090197",
    "tt0092850",
    "tt0091134",
    "tt0091166",
    "tt0091269",
    "tt0089599",
    "tt0091528"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:25.000Z"
}