{
  "movieId": "tt6218794",
  "title": "Israfil",
  "year": 2017,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Israfil2017",
      "id": "Israfil2017",
      "title": "Israfil ( 2017)",
      "description": "Synopsis: Mahi is a widow mourning the death of her only son. One day she bumps into Behrooz, her teenage sweetheart, who had left Iran following the scandal of his relationship with her. Despite their families’ objections, the previous relationship begins to re-assert itself. Mahi, however, finds out that Behrooz is emotionally involved with a young woman, Sara, who in turn  learns of her fiancé’s previous love. Sara is now in two minds about  marrying Behrooz and emigrating to Canada. On the horns of these emotional entanglements the three characters have to make decisions not only about their emotions, but also their future lives. Director: Ida Panahandeh Screenplay: Arsalan Amiri & Ida Panahandeh Director of Photography: Morteza Gheidi Editing: Hayedeh Safiyari Music:  Majid Pousti Director’s statement: Making my second feature was very challenging after the well-received Nahid. I didn’t want the success of my first feature to inhibit me from innovating in my second. Indeed, I wanted to use a more creative visual language and employ a novel cinematic narration. Through my direction and film editing, I’ve tried to give each character a distinct dimension, but all within the context of a uniform visual and audio style. In this way I hope to portray a love story that is accessible to people of all cultures, whilst also maintaining all that is specific to Iran. The Israfil of the title refers to the archangel who brings the dead back to life on Resurrection day. In our narrative it is love that is rekindled. The film focuses on three main characters and their interpretation of events: two women from different cultures and generations who love a man each in their own way. Rather than giving in to traditional values, they redefine love through today’s emotional requirements. Israfil is thus a modern love story.",
      "fileSize": 24301119,
      "addedAt": "2026-01-07T00:06:30.620Z",
      "thumbnail": "https://archive.org/services/img/Israfil2017",
      "collection": "feature_films",
      "downloads": 555
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "95 min",
    "imdbRating": 5.9,
    "imdbVotes": 451,
    "Genre": "Drama, Romance",
    "Plot": "Mahi is a widow mourning the death of her only son. One day she bumps into Behrouz, her teenage sweetheart, who had left Iran following the scandal of his relationship with her. Despite their families' objections, the previous relationship begins to re-assert itself. Mahi, however, finds out that Behrouz is emotionally involved with a young woman, Sara, who in turn learns of her fiance's previous love. Sara is now in two minds about marrying Behrouz and emigrating to Canada. On the horns of these emotional entanglements the three characters have to make decisions not only about their emotions, but also their future lives.",
    "Director": "Ida Panahandeh",
    "Writer": "Arsalan Amiri, Ida Panahandeh",
    "Actors": "Pejman Bazeghi, Hediyeh Tehrani, Hoda Zeinolabedin",
    "Language": "Persian",
    "Country": "Iran",
    "Awards": "5 nominations"
  },
  "relatedMovies": [
    "tt3902120",
    "tt5167966",
    "tt4372736",
    "tt7123974",
    "tt7642542",
    "tt5978724",
    "tt5253282",
    "tt6284950",
    "tt3499358",
    "tt3912442",
    "tt3831344",
    "tt6121428"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:30.620Z"
}