{
  "imdbId": "tt6353716",
  "title": "The Frozen Front",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r-FVkzfaGSs",
      "id": "r-FVkzfaGSs",
      "title": "1945 - Frozen Front (WAR FILM based on true events, war drama full film in German)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Atemberaubende Szenerien, auf wahren Ereignissen basierend - Dieser epische Kriegsfilm schildert eine vergessene Schlacht in den letzten Tagen des Zweiten Weltkriegs. Inmitten eisiger Schneelandschaften kämpfen 500 Männer und Frauen unter einem jungen Kommandanten ums Überleben – und um die Zukunft ihres Landes.\n\n1945 - FROZEN FRONT (2019)\nOriginaltitel: Preboj\nMit: Domen Valic, Jernej Gašperin, Ana Spik\nRegie: Dejan Babosek\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nIm eiskalten März des Jahres 1945 befindet sich die deutsche Balkanarmee bereits auf dem hastigen Rückzug in Richtung Norden, als die 12.000 Mann starke Truppe der 14. SS-Division im Menina-Tal auf eine kleine Partisaneneinheit trifft. Unverhofft eingekreist von den deutschen Soldaten ziehen sich die knapp fünfhundert slowenischen Kämpfer unter dem Kommando des erst 22-jährigen Franc Sever Franta in die verschneiten Wälder der Hochebene zurück. Ihr Schicksal erscheint im Angesicht einer derartigen Übermacht besiegelt. Geplagt von Hunger, Kälte und Verzweiflung suchen die Partisanen einen Ausweg aus der weißen Hölle . Ausgeliefert dem Kugelhagel der Deutschen muss ihnen der Durchbruch gelingen.\n#Netzkino #ganzerFilm #Kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:46.049Z",
      "thumbnail": "https://i.ytimg.com/vi/r-FVkzfaGSs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC9G2WarvniNRLY6j85tu7e16dkfw",
      "duration": 5157,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "140 min",
    "imdbRating": 3.9,
    "imdbVotes": 326,
    "Genre": "Action, Drama, History",
    "Plot": "January 1945. The first French regiment of paratroopers to fight with an American unit to liberate Alsace in France. An Allied Division must take the forest bordering the town of Jebsheim, several days before the attack that would later be called the 'French Stalingrad.' Prisoners of the cold, snow, and harsh winter conditions, and pounded by German forces, the French and American soldiers learn the violence and hell of war In this struggle for freedom and survival, they will face an unexpected enemy.",
    "Director": "David Aboucaya",
    "Writer": "David Aboucaya",
    "Actors": "Manuel Gonçalves, Laurent Guiot, Laurent Cerulli",
    "Language": "French",
    "Country": "France",
    "Awards": "5 nominations total"
  },
  "relatedMovies": [
    "tt5189828",
    "tt7160176",
    "tt4738360",
    "tt6084202",
    "tt1986769",
    "tt3881026",
    "tt0054436",
    "tt0041940",
    "tt1020558",
    "tt0055884",
    "tt0051565",
    "tt4400994"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:15.365Z"
}