{
  "imdbId": "tt6326174",
  "title": "Silent Hall of Fame Documentary Breaking the Silence",
  "year": 2015,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/SilentHallOfFameDocumentary",
      "id": "SilentHallOfFameDocumentary",
      "title": "Silent Hall Of Fame Documentary (2015)",
      "description": "  This documentary is copyrighted by Silent Hall of Fame.   Please visit https://silent-hall-of-fame.org/   to support our non-profit mission and the legacy of silent movie stars by making a tax deductible contribution.   FEEL FREE TO FOLLOW US ON TWITTER @SilentFilmGems   This Silent Hall of Fame documentary \"Breaking the Silence\" was created to present to the public our stars and our mission, and to ask the viewers for their support.   This is now a multiple award-winning documentary!   It won the distinction \"Award of Merit\" at the San Francisco Film Awards, the Silver Award at the 2015 International Independent Film Awards, the Accolade Global Film Competition Award of Recognition and the extremely prestigious Diamond Award at the 2015 California Film Awards. Of equal merit is the inclusion of the documentary in the Official Selection of the San Jose International Short Film Festival and the Buffalo Niagara International Film Festival.     Production of                       Silent Hall of Fame Executive Producer             Alex Staykov Producers                             A. Reid, Pat Awest Directed and edited by         Kinga Kowalczyk Featuring                              Alex Staykov, Nina Roberts, Scott Roberts, John Klein, Gary Kent, George Keil, Hugh M. Neely, Dydia DeLyser Starring                                 all the stars of Silent Hall of Fame Cinematography                    Kacper Skowron Music                                     Eddie Baytos Release date                          March 20, 2015 Running time                        25 minutes Country                                 USA Language                               English   PLEASE NOTE: If you like the film you can post a rating and a review on IMDB here: http://www.imdb.com/title/tt6326174/?ref_=ttexst_exst_tt     Below you can read a few reactions to the film at the Silent Hall of Fame website:   Bravo! - John Klein, relative of our star Marceline Day (email message)   I am delighted by the entire theme, production, music and film clips. Your documentary brings a new awareness to the public of other silent film stars who deserve recognition while also mentioning the fact of lost films and the need to restore the films that are in storage. - Nina Roberts, grand-daughter of our star Joe Roberts (email message)   Hi Alex, thank you so much for sending me the link. I just watched it - very professionally made, and there is some amazing footage from silent movies with breathtaking stunts. - Shirley Freitas, great-granddaughter of our star Helen Holmes (email message)   Well done promotion for forgotten silent stars and the need to preserve their memories…I will post on my FB page. - Ned Thanhouser, Director and Producer, grandson of Edwin Thanhouser, the founder of the Thanhouser Company (email message)   Hi Alex, thanks for the link. I watched it this morning. Fantastic Job! - A. Michael Aus (email message)   I saw your documentary on silent era pioneers and loved it! Keep up your great work of recognizing the wonderful stars of the silent era! - silentmoviequeen (at YouTube)   Saw it, loved it - thanks so much! - alvisrocks (at NitrateVille)   Your documentary does a fine job emphasizing the importance of not only preserving silent films, but keeping them in circulation so that younger viewers can witness an important part of history unfold. Excellent work. - Zach Snow (email message)   I absolutely adored the documentary! Seeing so many of my favorite stars being shown was just incredible. And the end with Marceline Day's name imposed onto the star? Goosebumps! - Jessica Wahl (email message)   Watched it as soon as I got your email—what a lovely film! I will put a link to it on our library guide for videos. Thank you! - Leigh Rockey (email message)    ",
      "fileSize": 535747641,
      "addedAt": "2026-01-07T00:06:51.869Z",
      "thumbnail": "https://archive.org/services/img/SilentHallOfFameDocumentary",
      "year": 2015,
      "collection": "feature_films",
      "downloads": 8780
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "25 min",
    "imdbVotes": null,
    "Genre": "Documentary, Short",
    "Plot": "The film presents to the public Silent Hall of Fame, a nonprofit organization which works to preserve the legacy of currently overlooked, but formerly illustrious silent movie stars and bring them belated recognition and glory.",
    "Director": "Kinga Kowalczyk",
    "Writer": "N/A",
    "Actors": "Alex Staykov, Dydia Delyser, George Keil, Gary Kent",
    "Language": "English",
    "Country": "USA",
    "Awards": "4 wins."
  },
  "relatedMovies": [
    "tt6564690",
    "tt5734328",
    "tt4206510",
    "tt4290988",
    "tt2647116",
    "tt2844618",
    "tt2827918",
    "tt10960716",
    "tt7676544",
    "tt8228460",
    "tt9064686",
    "tt2162808"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.869Z"
}