{
  "imdbId": "tt6400614",
  "title": "Unacknowledged",
  "year": 2017,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/unacknowledged.-2017.308p",
      "id": "unacknowledged.-2017.308p",
      "title": "Unacknowledged (2017)",
      "description": "\"Unacknowledged\" is a 2017 documentary directed by Michael Mazzola that explores the historic files of the Disclosure Project, presenting evidence of extraterrestrial contact through witness testimonies, documents, and UFO footage. The film discusses the enforcement of UFO secrecy and claims that this has hindered technological advancement for over a century.",
      "fileSize": 2674287831,
      "addedAt": "2026-01-07T00:12:55.131Z",
      "thumbnail": "https://archive.org/services/img/unacknowledged.-2017.308p",
      "language": "eng",
      "year": 2017,
      "collection": "feature_films",
      "downloads": 133
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "100 min",
    "imdbRating": 7,
    "imdbVotes": 8918,
    "Genre": "Documentary",
    "Plot": "\"Unacknowledged\" focuses on the historic files of the Disclosure Project and how UFO secrecy has been ruthlessly enforced-and why. The best evidence for extraterrestrial contact, dating back decades, is presented with direct top-secret witness testimony, documents and UFO footage, 80% of which has never been revealed anywhere else. The behind-the-scenes research and high-level meetings convened by Dr. Steven Greer will expose the degree of illegal, covert operations at the core of UFO secrecy. From briefings with the CIA Director, top Pentagon Generals and Admirals, to the briefing of President Obama via senior advisor John Podesta, chairman of the Hillary Clinton Campaign, we take the viewer behind the veil of secrecy and into the corridors of real power where the UFO secrets reside. The viewer will learn that a silent coup d'état has occurred dating back to the 1950s and that the Congress, the President and other world leaders have been sidelined by criminal elements within the military-industrial-financial complex.",
    "Director": "Michael Mazzola",
    "Writer": "Michael Mazzola, Stephen Peek",
    "Actors": "Giancarlo Esposito, Steven M. Greer, Carl Sagan",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt7685784",
    "tt7188868",
    "tt4519562",
    "tt6323518",
    "tt5838396",
    "tt7676544",
    "tt10161390",
    "tt3123418",
    "tt5828918",
    "tt14409096",
    "tt9316022",
    "tt7295854"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:12:55.131Z"
}