{
  "movieId": "tt6613878",
  "title": "Clara",
  "year": 2018,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hfM-YbDxqKE",
      "id": "hfM-YbDxqKE",
      "title": "Clara | FULL MOVIE | Sci-Fi Romance",
      "description": "An obsessive astronomer (Patrick J. Adams, \"Suits\") and a curious artist (Troian Bellisario, \"Pretty Little Liars\") form an unlikely bond that leads them to a profound scientific discovery.\n\n#drama #scifi #romance #character #freemoviesonline #fullmoviefree #dramamovies #indie #astronomy #astronomers #science #scientists #artist #art #meet",
      "addedAt": "2025-12-26T21:38:51.651Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/hfM-YbDxqKE/maxresdefault.webp",
      "duration": 6321,
      "language": "en",
      "channelName": "FilmRise Movies",
      "channelId": "UC8IHAQMuiJdY6ALuhG7iU8Q",
      "regionRestriction": {
        "allowed": [
          "AG",
          "AI",
          "AS",
          "AW",
          "BB",
          "BM",
          "BQ",
          "BS",
          "BZ",
          "CU",
          "DM",
          "DO",
          "FM",
          "GD",
          "GU",
          "GY",
          "HT",
          "JM",
          "KN",
          "KY",
          "MH",
          "MP",
          "MS",
          "PR",
          "SR",
          "TC",
          "TT",
          "UM",
          "US",
          "VC",
          "VI"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "105 min",
    "imdbRating": 6.7,
    "imdbVotes": 6162,
    "Genre": "Drama, Sci-Fi",
    "Plot": "Dr. Isaac Bruno, an astronomer and astrophysics professor at Ontario University in Toronto, has been obsessed with needing to discover that there is life in the cosmos besides on Earth. This obsession has been a negative Catch-22 in his life: he has needed this focus to fill a void in his personal life following a tragedy that partly led to the dissolution of his marriage to fellow astronomer Dr. Rebecca Jenkins, while the frustration he has felt in such a discovery not yet having been made has resulted in him acting inappropriately in all aspects of his life. That professional behavior has in turn led to he being indefinitely suspended from the university, which also means no access to university resources or equipment hindering that search. It is bad timing as advances in telescope technology, such as TESS, not only provides much data to the community, but any evidence as to the possibility of life would provide access to that technology. Desperate for help without many resources, he advertises for an unpaid assistant, beyond the provision of room and board. The only application he receives is from Clara, an artist not only with no astrophysics background but little education let alone at a post-secondary level, she who he suspects is more interested in the room and board in being seemingly homeless. Beyond her dog Eeva, her prized possessions are a collection of rocks she carries with her everywhere, obtained most from her world travels, one from and indicative of each continent. Isaac ends up hiring her on her plea of hard work and learning fast. Regardless of what Isaac may or may not find with Clara's help, she, who has a keen sense of observation being an artist, may provide him with something more valuable for his life in a holistic sense.",
    "Director": "Akash Sherman",
    "Writer": "Akash Sherman, James Ewasiuk",
    "Actors": "Patrick J. Adams, Troian Bellisario, Ennis Esmer",
    "Language": "English, Spanish",
    "Country": "Canada, United States",
    "Awards": "2 wins & 4 nominations total"
  },
  "relatedMovies": [
    "tt5215088",
    "tt5730248",
    "tt4922674",
    "tt5770864",
    "tt8948208",
    "tt5017936",
    "tt7724770",
    "tt3831344",
    "tt3198000",
    "tt5612564",
    "tt10309088",
    "tt7204400"
  ],
  "collections": [
    {
      "id": "sci-fi",
      "name": "Science Fiction"
    },
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:22:39.914Z"
}