{
  "imdbId": "tt6777170",
  "title": "24 Frames",
  "year": 2017,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/24frames2017",
      "title": "24 Frames ( 2017)",
      "description": "Cannes 2017 A Master's Final Frames • Abbas Kiarostami's \"24 Frames\" Daniel Kasman, Mubi 26 May 2017 Between the dreamer and the world, we find cinema. Movingly presented at the largest cinema in Cannes, the Iranian auteur's final film may be the most experimental ever shown at the festival. “24 Frames began with musings on epochal paintings and evolved with the photographs I had taken over the years.” The final film by Abbas Kiarostami. Movingly presented in a special screening at the largest cinema in Cannes, Abbas Kiarostami’s final feature 24 Frames may be the most experimental film ever shown at the festival. Inspired by his desire to know what happens before and after what's depicted in an image, Kiarostami and a team of supremely talented animators and sound artists have rendered in motion 23 of the Iranian director’s photographs and one Bruegel painting, each brought to life for four and a half minutes. Throughout his career, Kiarostami, who died at the age of 76 last July, asked playful questions about where the line between cinema and life, construction and reality lay, and in later films like Ten (2002), Five Dedicated to Ozu (2003), Shirin (2008), and Like Someone in Love (2012), he has more directly confronted the audience with these innate ambiguities. The constant return suggests the permeable line—the levels of play and fictionalizing—of what cinema chooses to show or leave out, is always relevant, and its nature is always changing—for instance, in the director taking advantage of digital cameras early on. And this film embraces digital technology more than any film by Kiarostami before it. Never has a film by this supposedly realist filmmaker ever been as artificial as 24 Frames: each photo is extensively digitally manipulated by interpolating animals and motion, conflating what was the photo for what is the film, leaving the audience stranded in a fantastic limbo of imagined reality. Reminiscent of the contemplative landscape films of American structuralist avant-garde filmmaker James Benning—which recently have also been imperceptibly digitally toyed with—each of Kiarostami’s animated photos creates a dialectical play between on and off screen space, flat horizontals (like a seaside fence) and deep movement on the z-axis (crashing waves), and the tension and anticipation of what you hear and what you see. The photos, some in color but most in wetly saturated black and white, return again and again to beachfronts, snowy embankments, charcoal-black tree trunks and flat views out of windows. These windows, or sometimes railings or a car window, subdivide the image into little parcels which contain their own action or inaction, composition or abstraction. The animated animals add an entirely new aspect to this kind of landscape study, as most of the photo-films contains some kind of animal story, whether as natural as a flock of birds leaving only to enter the image again at the end of a shot, suspense over gunfire on the soundtrack with vulnerable creatures on screen, or subtle but elaborate choreography between animals. A quintessential Kiarostami question emerges: Just what was in the original photographs, what did they look like and how is he creating new images? The effects themselves are a bit jerky and sometimes ragged in its integration, but this also adds to Kiarostami’s clear intention that audiences are aware of the fantasy. Yet 24 Frames remains magical because, photo after photo, what has been accomplished seems utterly impossible: could CGI animators be that good? Or are the corralled animals actually directed and controlled so precisely to work with existing photographs? Either way or both, or even a fourth unknown technique, it matters not, as the result is a self-aware sense of questioning wonder—how did they do that? Concerned so much with absence and presence, with cycles of leaving and returning, death and life, 24 Frames inevitably but nevertheless powerfully takes on a deeper sense as we reach the final frame, the last shot of the last film of a beloved master. It replaces the animals of so many other shots with a sleeping woman, an editing suite playing, in slow motion, the final kiss in an old Hollywood picture, and behind both, a window outside. Between the dreamer and the world, we find cinema. (Daniel Kasman, Mubi) *     *     * Kiarostami liked wind and waves, crows and snow, and these elements return again and again, like contract players in a recurring dream. People, by contrast, are largely notable by their absence. We see them scurrying along a Paris street, or steering a truck that breaks up the murder of crows. The implication is that their (our?) presence is an unwelcome distraction, disrupting a natural world that runs to its own mysterious rhythm. Frame 16, for instance, shows a small yellow motorboat being slowly nudged ashore by the tide while a gaggle of ducks gather at the tideline to scold it. These ducks are engaged in their own duck-like business. They can’t be doing with the arrival of this manmade gatecrasher. (Xan Brooks, theguardian)",
      "id": "24frames2017"
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "114 min",
    "imdbRating": "6.8",
    "imdbVotes": "2,309",
    "Genre": "Drama",
    "Plot": "What happens in the moments before and after a photograph is taken? 24 Frames answers this question and unites the two artistic languages Kiarostami dedicated his life to. Melancholic and joyous, serious and mischievous, it's a refined meditation on the passage of time and on the fragility of existence - themes central to the cinema of this revered Iranian director.",
    "Director": "Abbas Kiarostami",
    "Writer": "Mohammad Mohammadian",
    "Actors": "Mohamad Ramezani Pour",
    "Language": "English",
    "Country": "Iran, France",
    "Awards": "3 wins"
  },
  "relatedMovies": [
    {
      "imdbId": "tt0100234",
      "title": "Close-Up",
      "year": 1990,
      "imdbRating": "8.2",
      "imdbVotes": "24,478",
      "language": "Persian, Azerbaijani",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt3881026",
      "title": "Rendel: Dark Vengeance",
      "year": 2017,
      "imdbRating": "4.6",
      "imdbVotes": "2,479",
      "language": "Finnish, English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt6966538",
      "title": "Anna Karenina: Vronsky's Story",
      "year": 2017,
      "imdbRating": "6.3",
      "imdbVotes": "460",
      "language": "Russian",
      "sourceType": "youtube",
      "channelName": "Mosfilm"
    },
    {
      "imdbId": "tt6218794",
      "title": "Israfil",
      "year": 2017,
      "imdbRating": "5.9",
      "imdbVotes": "451",
      "language": "Persian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt6207878",
      "title": "No Date, No Signature",
      "year": 2017,
      "imdbRating": "7.2",
      "imdbVotes": "6,877",
      "language": "Persian",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt7224496",
      "title": "Oblivion Verses",
      "year": 2017,
      "imdbRating": "6.5",
      "imdbVotes": "752",
      "language": "Spanish",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt3902120",
      "title": "The 312",
      "year": 2017,
      "imdbRating": "5.9",
      "imdbVotes": "178",
      "language": "English",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt7611096",
      "title": "667",
      "year": 2017,
      "imdbRating": "7.4",
      "imdbVotes": "9",
      "language": "Hokkien, Teochew, Hakka, Cantonese, Chinese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt5189828",
      "title": "Mohawk",
      "year": 2017,
      "imdbRating": "4.7",
      "imdbVotes": "1,740",
      "language": "English, Mohawk, French",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt5167966",
      "title": "One Week Friends",
      "year": 2017,
      "imdbRating": "6.8",
      "imdbVotes": "1,575",
      "language": "Japanese",
      "sourceType": "archive.org"
    },
    {
      "imdbId": "tt2582784",
      "title": "Flower",
      "year": 2017,
      "imdbRating": "6.0",
      "imdbVotes": "10,706",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Popcornflix"
    },
    {
      "imdbId": "tt3203620",
      "title": "The Dinner",
      "year": 2017,
      "imdbRating": "4.5",
      "imdbVotes": "10,028",
      "language": "English",
      "sourceType": "youtube",
      "channelName": "Netzkino"
    }
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2026-01-07T00:06:06.565Z"
}