{
  "imdbId": "tt6873690",
  "title": "The World Without You",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4SfunESHHxg",
      "id": "4SfunESHHxg",
      "title": "The World Without You | Full Movie | Emotional Drama",
      "description": "The World Without You - Based on the acclaimed novel by Joshua Henkin, The World Without You deals with a grieving family that gathers on the Fourth of July weekend to honor the memory of their journalist son, Leo Frankel, who was killed in Iraq the previous year. They are confronted with old hurts as well as many dark secrets that threaten to tear the fragile threads barely holding the family together.\n2019.  Stars: James Tupper, Radha Mitchell, Perrey Reeves\n**Under license from Legacy Distribution.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\nMORE FULL MOVIES - FREE on YouTube!\n\n Free Action Movies: https://bit.ly/3uMwRxq\n Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n Free Horror Movies: https://bit.ly/3aBBt2J\n Free Asylum Movies: https://bit.ly/3cipzeI\n Free Crime/Thriller: https://bit.ly/3o01prJ\n Free Drama Movies: https://bit.ly/3Pu4mN9\n Free Comedy Movies: https://bit.ly/3IE0wPd\n Free Western Movies: https://bit.ly/3RqTX6u\n Free Adventure Movies: https://bit.ly/3yHolAT\n MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#BornOnTheFourthOfJuly #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:04.176Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/4SfunESHHxg/maxresdefault.webp",
      "duration": 5719,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-14",
    "Runtime": "95 min",
    "imdbRating": 6.3,
    "imdbVotes": 106,
    "Genre": "Drama",
    "Plot": "Based on the acclaimed novel by Joshua Henkin, The World Without You deals with a grieving family that gathers on the Fourth of July weekend to honor the memory of their journalist son, Leo Frankel, who was killed in Iraq the previous year. They are confronted with old hurts as well as many dark secrets that threaten to tear the fragile threads barely holding the family together. Leo's mother, Marilyn, entrenched in grief, drops a bombshell when she announces she's leaving her husband, David, who has moved on from his mourning and still holds a grudge against Leo for his decision to go to Iraq and leave his wife and toddler behind. Marilyn's desire to find what actually happened to Leo has become an obsession with her risking everything to find the truth. Meanwhile, Leo's widow, Thisbe, hasn't come to terms with how falling in love with a new man will change her dynamic with the family, and she struggles with how best to let them know without causing further despair. Clarissa, the eldest, desperately wants to conceive, a compulsion now threatening her own marriage. Personal quarrels and long-held animosity between Leo's siblings plague the family and are only intensified by his memorial, while his sister, Noelle, grapples with the fact that she was the last to see Leo alive during a trip to Jerusalem. Quarrels, battles, and emotional outbursts continue to distract from the real reason the family has come together, which is to honor their son, brother, father, and husband. Will this dysfunctional family reunion bring them closer together, or drive them further apart?",
    "Director": "Damon Shalit",
    "Writer": "Joshua Henkin, Dan Pulick",
    "Actors": "Perrey Reeves, Radha Mitchell, Lynn Cohen",
    "Language": "English",
    "Country": "United States",
    "Awards": "3 wins"
  },
  "relatedMovies": [
    "tt4364194",
    "tt8337320",
    "tt9214844",
    "tt9037866",
    "tt9071322",
    "tt9211804",
    "tt9552352",
    "tt11276530",
    "tt8549590",
    "tt9816396",
    "tt9552162",
    "tt9110380"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:16:34.776Z"
}