{
  "imdbId": "tt6923840",
  "title": "Naked Normandy",
  "year": 2018,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/hell-in-normandy",
      "id": "hell-in-normandy",
      "title": "Hell In Normandy",
      "description": "World War II in the days leading up to the Normandy Invasion/D-Day. Omaha Beach - one of the Allied Forces/American beach heads is where a parachute unit is sent to destroy a German installation.",
      "fileSize": 287456535,
      "addedAt": "2026-01-07T00:08:39.345Z",
      "thumbnail": "https://archive.org/services/img/hell-in-normandy",
      "collection": "feature_films",
      "downloads": 5328
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "105 min",
    "imdbRating": 5.9,
    "imdbVotes": 1256,
    "Genre": "Comedy, Drama",
    "Plot": "In Mêle-sur-Sarthe, a small Norman village, the agricultural crisis seriously affects the exhausted and ruined breeders, who are looking for ideas to draw attention to their dying profession. They are organizing a demonstration and a roadblock on the RN 12 near Mortagne-au-Perche. An American art photographer, Blake, who specializes in the nude, in search of the perfect place to create his next photographic work, finds himself blocked by the demonstration. During the meeting between Blake and Georges Balbuzard, peasant and mayor of the city, the latter decides to create a media buzz to help his fellow farmers: he hires him to photograph the people of the village naked, because they are professionally already bare. But the Normans are reluctant to undress, especially the village butcher Roger who knows that all men would very much like to see the naked body of his wife Gisèle, former Miss Calvados. Against the backdrop of ancestral family quarrels and generalized modesty, will modern art photography composed of nudes in the middle of Champ Chollet and the political buzz really take place? Blake is impatient, because the orientation of the sun will soon be unfavorable and the extras are slow to arrive .",
    "Director": "Philippe Le Guay",
    "Writer": "Victoria Bedos, Olivier Dazat, Philippe Le Guay",
    "Actors": "François Cluzet, François-Xavier Demaison, Julie-Anne Roth",
    "Language": "French, English",
    "Country": "France",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt6893370",
    "tt5459382",
    "tt3846674",
    "tt4859168",
    "tt6186940",
    "tt2139869",
    "tt1352771",
    "tt8315092",
    "tt5068162",
    "tt1971310",
    "tt7738450",
    "tt4364194"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:39.345Z"
}