{
  "imdbId": "tt6982524",
  "title": "Im Westen nur Bohnen",
  "year": 2006,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/RobertSpindlerRichardSchwarzAlbertFrischMarkusPiffImWestennurBohnen_0",
      "id": "RobertSpindlerRichardSchwarzAlbertFrischMarkusPiffImWestennurBohnen_0",
      "title": "Im Westen nur Bohnen",
      "description": "Black-Silver präsentiert 'Im Westen Nur Bohnen'. Ein Western, in dem die Gier nach Gold den Verstand der Figuren dominiert. In den Rocky Mountains, 1860. Die ungleichen Brüder Bärenklaue und Siesta treffen sich nach langer Zeit unerwartet in einer Pony-Express Station wieder. Am Faulenzer Siesta hat sich nicht viel verändert: Er zieht immer noch durch den Westen - ohne Ziel, ohne Arbeit und ohne Colt. Bärenklaue hingegen scheint ausgesorgt zu haben: Bei dem eher erfolglosen Versuch sich als Trapper durchzuschlagen hat er Gold gefunden - ganze 960 Unzen hat er aus dem Fluss geholt. Damit will er sich jetzt im westlichsten Westen niederlassen und sehr zu seinem Missfallen beschließt Siesta kurzerhand, ihn auf dem Weg zu begleiten. Da Bärenklaue nicht auf Siestas Rat hört, den 'unnötigen Ballast' irgendwo liegen zu lassen, verspricht die Reise abenteuerlich zu werden. Denn schon bald treffen die beiden auf die komischten Gestalten, die ein reges Interesse an Bärenklaues Gold zeigen. Der bibelfeste irische Einwanderer Mac, der mysteriöse Du-Pre und schließich der skrupellose Kopfgeldjäger Slick Stew ...",
      "fileSize": 1625768987,
      "addedAt": "2026-01-07T00:06:51.867Z",
      "thumbnail": "https://archive.org/services/img/RobertSpindlerRichardSchwarzAlbertFrischMarkusPiffImWestennurBohnen_0",
      "year": 2006,
      "collection": "feature_films",
      "downloads": 1846
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "82 min",
    "imdbVotes": null,
    "Genre": "N/A",
    "Plot": "The successful gold digger Bärenklaue wants to travel further West to settle down on a little homestead, but his troublesome brother Siesta complicates his journey.",
    "Director": "Robert Spindler",
    "Writer": "Robert Spindler",
    "Actors": "N/A",
    "Language": "German",
    "Country": "Austria",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt32493438",
    "tt27992077",
    "tt1349632",
    "tt8084578",
    "tt0482962",
    "tt26820087",
    "tt17977694",
    "tt18761394",
    "tt28640482",
    "tt0469153",
    "tt1282408",
    "tt25601256"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:51.867Z"
}