{
  "imdbId": "tt6916348",
  "title": "The Warrior Queen of Jhansi",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TivVKi5Yuus",
      "id": "TivVKi5Yuus",
      "title": "The Warrior Queen of Jhansi (ACTION FILM based on true events, Historical Adventure German)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Eine mitreißende und inspirierende Geschichte über eine unbestreitbar wichtige und unterbewertete historische Königin - Basiert auf einer wahren Geschichte, in der die Königin von Jhansi ihre Armee gegen die britische Ost-Indien-Gesellschaft im Jahre 1857 anführt.\n\nDIE KRIEGERKÖNIGIN VON JHANSI (2019)\nOriginaltitel: The Warrior Queen of Jhansi\nMit: Devika Bhise, Jodhi May, Rupert Everett\nRegie: Swati Bhise\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nLakshmibai (Devika Bhise) ist Königin von Jhansi und führte 1857 ihre Armee in die berüchtigte Meuterei gegen die British East India Company. Von Königin Elizabeth bis Königin Victoria – zweieinhalb Jahrhunderte Vorherrschaft der East India Company werden aufs Spiel gesetzt, um Indiens Kriegerkönigin zu vernichten. Lakshmibais Leidenschaft, ihr Mut und ihr strategischer Scharfsinn, machen die junge Frau zu eine der größten Generäle der indischen Armee. Die Kriegerkönigin von Jhansi ist die Geschichte einer Frau, die für die Freiheit ihres Volkes lebte, kämpfte und starb.\n#Netzkino #ganzerFilm #History\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:27.297Z",
      "thumbnail": "https://i.ytimg.com/vi/TivVKi5Yuus/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAij7cKCGeRVR8ha9iXrbfs74okIw",
      "duration": 6144,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "102 min",
    "imdbRating": 4.9,
    "imdbVotes": 765,
    "Genre": "Action, Adventure, Drama",
    "Plot": "The Warrior Queen of Jhansi tells the story of Lakshmibai, the historic Queen of Jhansi who fiercely led her army against the British East India Company in the infamous mutiny of 1857. From Queen Elizabeth to Queen Victoria, two-and-a half-centuries of East India Company rule will be reversed by its attempt to crush India's Warrior Queen. Lakshmibai is known as one of the most prominent figures within the independence movement of India. The passion to free her province from colonial rule led this young woman to become one of the greatest generals of the Indian army and to go down in history for her bravery, strategic acumen, and as a force to reckon with by the East India Company and the British Raj. The Warrior Queen of Jhansi is the story of the woman who lived, fought and died for the freedom of her people.",
    "Director": "Swati Bhise",
    "Writer": "Devika Bhise, Swati Bhise, Olivia Emden",
    "Actors": "Derek Jacobi, Jodhi May, Rupert Everett",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "1 win"
  },
  "relatedMovies": [
    "tt10309088",
    "tt10305328",
    "tt4951982",
    "tt4743226",
    "tt3956336",
    "tt6083388",
    "tt15743386",
    "tt14277840",
    "tt7108074",
    "tt6065046",
    "tt7204400",
    "tt6215044"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:06.317Z"
}