{
  "movieId": "tt7120400",
  "title": "The Unlikely Good Samaritan",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6XU9-pXoqh4",
      "id": "6XU9-pXoqh4",
      "title": "The Unlikely Good Samaritan | Full Drama Movie | Eric Roberts",
      "description": "The Unlikely Good Samaritan - A modern retelling of the Good Samaritan parable.  The Unlikely Good Samaritan follows the paths of two men: Sam, an ex-convict and mysterious drifter looking to escape his past and find new meaning in life, and Chris, a proud, small-town pastor and new husband, attempting to impress his congregation and deal with an issue that could shatter his wholesome image. The men s paths collide in a dramatic and intriguing way, challenging the characters to reexamine what a good person really looks like.\n2019.  Stars: Charlie Aligaen, Stephen Fuller Austin, Clay Clarkson\n**The film is under non-exclusive license from Cineverse Corp.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:57.720Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/6XU9-pXoqh4/maxresdefault.webp",
      "duration": 4534,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "76 min",
    "imdbRating": 5.2,
    "imdbVotes": 56,
    "Genre": "Drama",
    "Plot": "The Unlikely Good Samaritan follows the paths of two men: Sam, an ex-convict and mysterious drifter looking to escape his past and find new meaning in life, and Chris, a proud, small-town pastor and new husband, attempting to impress his congregation and deal with an issue that could shatter his wholesome image. The men s paths collide in a dramatic and intriguing way, challenging the characters to reexamine what a good person really looks like.",
    "Director": "Brandon Toy, Nathan Clarkson",
    "Writer": "Nathan Clarkson",
    "Actors": "Charlie Aligaen, Stephen Fuller Austin, Clay Clarkson",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt4364194",
    "tt8337320",
    "tt9214844",
    "tt9037866",
    "tt9071322",
    "tt9211804",
    "tt9552352",
    "tt11276530",
    "tt8549590",
    "tt9816396",
    "tt9552162",
    "tt9110380"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:27.730Z"
}