{
  "imdbId": "tt7321742",
  "title": "400 m IFF",
  "year": 1969,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/Mommartz_400M_IFF_1969",
      "id": "Mommartz_400M_IFF_1969",
      "title": "1969 400 m IFF",
      "description": "IFF is the name for the available, already superimposed film material, from which approximately 400 m where used for this film and the rest for \"Social sculpture\". Otto Kellner, Norbert Stratmann and Joseph Beuys step inside the already filming camera of Lutz Mommartz inside his apartment. Lutz Mommartz without a word exposures the visitors to the audience. With Beuys this situation had been agreed, the others came by chance and had to improvise instinctively. That the audio recordinmg was not turned on in the first two minutes, should be a sign for the astonished author. Especially since the start of the filmimg operation could be seen clearly. But that resulted in the with expectations associated premiere in Oberhausen to annoyance and to a quote in the press: \"And here Mommartz experienced his Waterloo\" The folowing film with Joseph Beuys about the anonymous audience has the title: \"Soziale Plastik\" (Social sculpture) With \"400 m IFF\" Mommartz went back to a certain type of technique, which he had developed more than four years ago and which at that time, how he stresses expressevly, primarily was not ment for filming. The film in this case is not anymore the art object, for which the central interest has to apply. It is only the releasing moment. It is primarily about, how a person behaves in situations, in which he or she can not count on experiences. Thus it is about a behavior research procedure and not about film art. Mommartz demonstrates in his films the abilities of reaction of his \"test subjects\". Even a man such as Joseph Beuys, who works with this thesis, appeared consterned. With Mommartz we see the failure of three persons. They all notice the exceptional situation, but do not have the sovereignty to handle them. And almost during the procedures on the canvas the audience becomes the participant, by expering the question, how he or she would have behaved in the same situation. (KLAUS ULRICH REINKE, XV.WESTD. SHORT FILM DAYS, REPORT 1969) With 400 m IFF Mommartz experienced his Waterloo! (PRESS TEXT, LOST SOURCE)",
      "fileSize": 2367816490,
      "addedAt": "2026-01-07T00:06:38.752Z",
      "thumbnail": "https://archive.org/services/img/Mommartz_400M_IFF_1969",
      "language": "ger",
      "year": 1969,
      "collection": "feature_films",
      "downloads": 4238
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "20 min",
    "imdbVotes": null,
    "Genre": "Short",
    "Plot": "N/A",
    "Director": "Lutz Mommartz",
    "Writer": "N/A",
    "Actors": "Joseph Beuys, Otto Kellner, Norbert Stratmann",
    "Language": "German",
    "Country": "West Germany",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt7322114",
    "tt7322102",
    "tt7320904",
    "tt7322080",
    "tt7322088",
    "tt7322208",
    "tt7322294",
    "tt7322334",
    "tt9138122",
    "tt0456057",
    "tt0152240",
    "tt1816543"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:38.752Z"
}