{
  "imdbId": "tt7320482",
  "title": "The Soul Collector",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H451eYWiYwA",
      "id": "H451eYWiYwA",
      "title": "The Soul Collector (HORROR MOVIE full length in German, full horror movies, watch movie, new movies)",
      "addedAt": "2025-12-23T23:49:24.424Z",
      "thumbnail": "https://i.ytimg.com/vi/H451eYWiYwA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLChj1lxsDDOaPGIluuGAteAqMgHsQ",
      "duration": 5945,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "100 min",
    "imdbRating": 5.1,
    "imdbVotes": 4514,
    "Genre": "Horror",
    "Plot": "Bankruptcy forces William Ziel to return to the farm he inherited from his estranged father in an attempt to start a new life with his young, fragmented family. Lazarus, the farm hand who took care of William's father Frederick in his lonely final hours, reappears soon after William, Sarah and adopted daughter Mary, arrive at Hemelop- Aarde. A supposed chance meeting between Mary and Lazarus develops into a bond between two kindred spirits. But Lazarus, the old soul who struggles to find peace in this place of sad memories, carries a dark secret that constantly haunts him: the demon child with its insatiable appetite for human souls that weighs so heavily in the sack he carries everywhere with him. Despite Sarah's misgivings, this unfathomable character wins over William and Mary. At first, Sarah's apprehension seems unfounded but, judging by the reaction of the local community to his return from wanderings afar, she may be right and the Ziels' newfound domesticity could be at risk. A series of disturbing events unfolds: first the old woman dying at the kraal, then the killing in the dark forest causes the circle to draw closer to include the Ziels. Can they survive unscathed?",
    "Director": "Harold Holscher",
    "Writer": "Harold Holscher, Harold Holscher, Johannes Ferdinand Van Zyl",
    "Actors": "Tshamano Sebe, Inge Beckmann, Keita Luna",
    "Language": "English, Tswana",
    "Country": "South Africa",
    "Awards": "23 wins & 5 nominations total"
  },
  "relatedMovies": [
    "tt19720316",
    "tt35045506",
    "tt7336182",
    "tt8332666",
    "tt10053426",
    "tt3602422",
    "tt10280220",
    "tt6747818",
    "tt1604560",
    "tt3584496",
    "tt6250650",
    "tt7857076"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:25:43.694Z"
}