{
  "movieId": "tt7339930",
  "title": "The Last Days of Billy the Kid",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EjYi9JUewUI",
      "id": "EjYi9JUewUI",
      "title": "The Last Days of Billy the Kid | Full Western Movie",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nThe Last Days of Billy the Kid - This motion picture chronicles the last days of the most iconic outlaw of the old west. Forget what you have heard before (most of that is rumors anyway) and ride with Billy the Kid as he tries to find sanctuary in a desperate landscape. The high price on his head has made Billy an evasive target for bounty hunters from all over the old west, and Billy knows that every time he rides out, he has a chance of getting bushwhacked. Unlike any other account of the Billy the Kid saga, \"The Last Days of Billy the Kid\" captures the fury, paranoia, and heartbreak that defined the last days of the gunslinger's existence.\n\n2017\nCast: Jason Cash, Jerry Chesser, Jezibell Anat, William Adams\n\n★ Awesome Movies \n\nWelcome to the Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under license from various copyright holders. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n★ Buy some items from our merch store - \nhttps://teespring.com/stores/classic-movies-channel\n\n#FullFreeMovies #FullWesternMovies #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:44.795Z",
      "thumbnail": "https://i.ytimg.com/vi/EjYi9JUewUI/maxresdefault.jpg",
      "duration": 4808,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "80 min",
    "imdbRating": 1.3,
    "imdbVotes": 157,
    "Genre": "Western",
    "Plot": "This motion picture chronicles the last days of the most iconic outlaw of the old west. Forget what you have heard before (most of that is rumors anyway) and ride with Billy the Kid as he tries to find sanctuary in a desperate landscape. The high price on his head has made Billy an evasive target for bounty hunters from all over the old west, and Billy knows that every time he rides out, he has a chance of getting bushwhacked. Unlike any other account of the Billy the Kid saga, \"The Last Days of Billy the Kid\" captures the fury, paranoia and heartbreak that defined the last days of the gunslinger's existence.",
    "Director": "Christopher Forbes",
    "Writer": "Jezibell Anat, Christopher Forbes",
    "Actors": "William Adams, Jezibell Anat, Thomas Barlet",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt10452224",
    "tt10622840",
    "tt19063544",
    "tt3979950",
    "tt13374182",
    "tt2935888",
    "tt12484058",
    "tt12935100",
    "tt15743386",
    "tt14395688",
    "tt13186800",
    "tt9685652"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:22:16.069Z"
}