{
  "imdbId": "tt7336182",
  "title": "Outback",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mhuy07C4yUs",
      "id": "mhuy07C4yUs",
      "title": "Outback´(SPANNENDER THRILLER auf Deutsch, Survival Filme, Horrorfilme in voller Länge ansehen)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Das junge amerikanische Paar Wade und Lisa reist nach Australien, um die Natur zu erleben – doch als Lisa Wades Heiratsantrag ablehnt, geraten die Spannungen hoch. Tief im Outback fällt ihr GPS aus, und sie stranden mitten in der Wildnis. Ein packender Survival-Thriller über Überleben, Beziehungskrisen und den Kampf gegen die Natur.\n\nOUTBACK (2019)\nOriginaltitel: Outback\nMit: Lauren Lofberg; Taylor Wiese; Brendan Donoghue\nRegie: Mike Green\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDas junge amerikanische Paar Wade (Taylor Wiese) und Lisa (Lauren Lofberg) reist nach Australien, um die Natur in ihrer reinsten Form zu erleben. Doch der Trip beginnt schon steinig, als Lisa Wades Heiratsantrag auf dem Hinflug ablehnt. Während sich die beiden weiterhin anstrengen und an ihrer Beziehung arbeiten, fahren sie in Australien landeinwärts zum Uluru – besser bekannt als Ayers Rock. Auf den abgelegenen Wegen setzt ihr GPS aus, woraufhin sie mitten im Nirgendwo stranden. Eine Notsituation, auf die die beiden denkbar schlecht vorbereitet sind. Jetzt muss sich das Paar zusammenraufen und bis ans Äußerste gehen, um das australische Outback irgendwie zu überleben.\n#Netzkino #ganzerFilm #survival\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:36:50.687Z",
      "thumbnail": "https://i.ytimg.com/vi/mhuy07C4yUs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDy1qaL2MDNqTtrFQB_13cZWihsrg",
      "duration": 5160,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "86 min",
    "imdbRating": 5,
    "imdbVotes": 2479,
    "Genre": "Drama, Horror, Thriller",
    "Plot": "Outback tells the terrifying tale of a young couple lost in the wilderness and fighting for survival. Wade and Lisa head to Australia hoping to recharge their failing romance. When their GPS fails, they leave their car and head off on foot to find a new route. As night falls, they must spend the night in the bush without food, water, or weapons, surrounded by snakes, scorpions, and wild dogs. Now, one decision could mean the difference between life...and certain death.",
    "Director": "Mike Green",
    "Writer": "Brien Kelly, Mike Green",
    "Actors": "Lauren Lofberg, Taylor Wiese, Brendan Donoghue",
    "Language": "English",
    "Country": "Australia",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt7857076",
    "tt7267530",
    "tt9390026",
    "tt6384998",
    "tt7090638",
    "tt3517984",
    "tt11948716",
    "tt11167046",
    "tt12283036",
    "tt3709442",
    "tt2554842",
    "tt2741564"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:21:39.159Z"
}