{
  "movieId": "tt7525778",
  "title": "The Package",
  "year": 2018,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1sGLtTl-rm8",
      "id": "1sGLtTl-rm8",
      "title": "The Package - Killer Games - mit  Dolph Lundgren - ganzen Film kostenlos schauen in HD bei MovieDome",
      "description": "Jetzt den Actionfilm “The Package - Killer Games” mit Dolph Lundgren in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nEin spannungsgeladener #Actionfilm mit Stars wie Steve Austin und Dolph Lundgren. Tommy erledigt Aufträge für die Mafia. Als er nur ein Paket an “den Schweden” ausliefern soll, sieht zunächst alles ganz einfach aus. Doch da täuscht sich Tommy gewaltig. \n\nJetzt “The Package - Killer Games” kostenlos als ganzen Film in deutsch sehen\nDer Actionfilm, mit dem Originaltitel “The Package”, wurde in den USA im Jahr 2013 verfilmt.\nDer Schuldeneintreiber Tommy muss einen Job für die Mafia erledigen, um die Schulden seines Bruders zu begleichen. Doch dieser Job wird ihn fast sein Leben kosten. \nProduziert wurde der Film von Justin Bursch und Brad Krevoy.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme: www.moviedome.de\n\nFolge uns auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\n#MovieDome #ThePackage #movie #film #spielfilm \n\nFilmlänge: 99 Minuten\nDVD-Start (DE): 11.10.2013\n\nWer sind die Schauspieler?\nDie Charaktere werden von folgenden Schauspielern verkörpert: \nDolph Lundgren (bekannt aus “Aquaman”, “The Expendables” oder “The Tracker”), in der Rolle des The German (Originalfassung - “Der Schwede” in der deutschen Version)\nSteve Austin (bekannt aus Kindsköpfe 2, Recoil oder Maximum Conviction) in der Rolle des Tommy Wick\nMike Dopud (bekannt aus The 100 oder Criminal Minds) in der Rolle des Julio\nEric Keenleyside in der Rolle des Big Doug\nJohn Novak in der Rolle des Nicholas\nDarren Shalavi in der Rolle des Devon \n\n\nDie Handlung und Szenen von “The Package - Killer Games”\nTommy ist Schuldeneintreiber in der mafiösen Unterwelt und bekommt einen ganz besonderen Auftrag. Er soll ein Paket ausliefern. Big Doug, Mafia Boss und Tommys Auftraggeber, verspricht dafür, Tommys Bruder Eddie alle seine Schulden zu erlassen. Eddie liegt Tommy sehr am Herzen, obwohl er vom rechten Weg abgekommen zu sein scheint. Also nimmt Tommy den Auftrag an und soll das Paket an einen anderen Mafiaboss namens “Der Schwede” liefern. Was zunächst einfach klingt, wird sich als eine der schwersten Aufgaben seines Lebens entpuppen. Denn nicht nur der Schwede möchte die wertvolle Fracht: Die Konkurrenz schickt gleich eine ganze Horde an Killern auf den Schuldeneintreiber, um das Paket um jeden Preis zu bekommen. Die actionreiche Schlacht beginnt.\n\n\nDie Synchronisation \nDie deutsche Synchronisation der Verfilmung wurde durch die Firma DMT - Digital Media Technologie GmbH, Hamburg durchgeführt. \nDolph Lundgren; Sprecher: Manfred Lehmann\nSteve Austin; Sprecher: Tilo Schmitz\nEric Keenleyside; Sprecher: Jürgen Holdorf\nKristen Kerr; Sprecher: Kerstin Draeger\nDarren Shalavi; Sprecher: Erik Schäffler\nMike Dopud; Sprecher: Sascha Draeger\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier.",
      "addedAt": "2025-12-26T00:36:19.307Z",
      "thumbnail": "https://i.ytimg.com/vi/1sGLtTl-rm8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDeBchPhTYEyPEF2PJTtmwb2mWOIQ",
      "duration": 5714,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "TV-MA",
    "Runtime": "94 min",
    "imdbRating": 5.6,
    "imdbVotes": 23179,
    "Genre": "Comedy, Thriller",
    "Plot": "When a group of teenage friends go on a spring break camping trip, an unfortunate accident sets off a race against time to save their friend's most prized possession.",
    "Director": "Jake Szymanski",
    "Writer": "Kevin Burrows, Matt Mider",
    "Actors": "Daniel Doheny, Geraldine Viswanathan, Sadie Calvano",
    "Language": "English",
    "Country": "United States, Canada",
    "Awards": "1 win & 2 nominations total"
  },
  "relatedMovies": [
    "tt2278050",
    "tt8332666",
    "tt7831358",
    "tt4994992",
    "tt13486266",
    "tt14236094",
    "tt11279862",
    "tt13918608",
    "tt12059016",
    "tt11322040",
    "tt3233506",
    "tt13423326"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T22:21:35.484Z"
}