{
  "movieId": "tt7549892",
  "title": "Terrified",
  "year": 2017,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=y378NsgDRJU",
      "id": "y378NsgDRJU",
      "title": "Terrified (PSYCHO HORRORFILM ganzer Film Deutsch 2025, Horrorfilme in voller Länge kostenlos)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein Mann findet seine verängstigte Frau vor – aus den Rohren ihres Badezimmers drohen Stimmen mit dem Tod. Als sich unheimliche Phänomene in der ganzen Nachbarschaft häufen, bittet ein Polizist zwei Paranormal-Experten um Hilfe.\n\nTERRIFIED (2017)\nOriginaltitel: Aterrados\nMit: Maximiliano Ghione; Norberto Gonzalo; Elvira Onetto\nRegie: Demián Rugna\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nIn einem Wohnviertel von Buenos Aires gehen unerklärliche bis geradewegs beängstigende Dinge vor sich. So hört Hausfrau Clara (Natalia Señoriales) seltsame Geräusche aus ihrem Abfluss. Da ahnt sie noch nicht, dass sie den Tag nicht überleben, sondern auf brutale Weise ums Leben kommen wird. Nebenan scheint sich hingegen das Böse direkt unter dem Bett des verängstigten Walter (Demián Salomón) eingenistet zu haben. Seit Tagen findet der Mann keinen Schlaf und hat nun eine Kamera im Zimmer aufstellt, um zu dokumentieren, was vor sich geht. Auch eine weitere Nachbarin, Alicia (Julieta Vallina), erlebt die Hölle auf Erden, als ihr zehnjähriger Sohn Pucho (Matias Rascovschi) von einem Bus überfahren wird. Hängen diese Ereignisse zusammen oder ist alles einfach nur ein grausamer Zufall? Der gesundheitlich angeschlagene, einst mit Alicia liierte Polizist Funes (Maximiliano Ghione) versucht die Sache aufzuklären. Unterstützung erhält er dabei von Mario (Norberto Gonzalo), Mora (Elvira Onetto) und Dr. Rosentok (George Lewis), die allesamt auf paranormale Phänomene spezialisiert sind …\n#Netzkino #ganzerFilm #horrorfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:47:43.839Z",
      "thumbnail": "https://i.ytimg.com/vi/y378NsgDRJU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC3O6IPjHW5hM0pN9M1WhCB2_kgcQ",
      "duration": 5286,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "87 min",
    "imdbRating": 6.5,
    "imdbVotes": 29078,
    "Genre": "Horror",
    "Plot": "Allbreck, Jano and Rosentock are researchers of paranormal phenomena. Commissioner Maza tries to give an explanation to inexplicable events that are occurring in a neighborhood of Buenos Aires. Together they will try to reveal the mystery within the affected houses before the evil destroys the existence of human society as we know it.",
    "Director": "Demián Rugna",
    "Writer": "Demián Rugna",
    "Actors": "Maximiliano Ghione, Norberto Gonzalo, Elvira Onetto",
    "Language": "Spanish",
    "Country": "Argentina",
    "Awards": "3 wins & 8 nominations total"
  },
  "relatedMovies": [
    "tt6988208",
    "tt4610748",
    "tt6193454",
    "tt3986820",
    "tt6554976",
    "tt3705822",
    "tt5640126",
    "tt3787068",
    "tt5296086",
    "tt2931376",
    "tt3517984",
    "tt4966046"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:23:41.530Z"
}