{
  "movieId": "tt7690310",
  "title": "The land of fire",
  "year": 2018,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/UrsusInTheLandOfFireAppleTV",
      "id": "UrsusInTheLandOfFireAppleTV",
      "title": "Ursus In The Land Of Fire",
      "description": "1963 directed by Giorgio Simonelli starring Ed Fury, Luciana Gilli, Adriano Micantoni, Claudia Mori,Nando Tamberlani and Guiseppe Addobbati. Hamilan, a cruel and ambitious general,(and all around seedy individual) murders his king and places himself on the throne with the former king's sinister niece as his queen. Ursus to the rescue!",
      "fileSize": 3107,
      "addedAt": "2026-01-07T00:07:11.887Z",
      "thumbnail": "https://archive.org/services/img/UrsusInTheLandOfFireAppleTV",
      "language": "eng",
      "collection": "feature_films",
      "downloads": 2707
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "N/A",
    "imdbVotes": null,
    "Genre": "Action",
    "Plot": "Land of fire As ,the name says fire is constant in every sphere of life ,on earth ,like water ,without the existence of fire the existence of human beings were not possible The word fire is meant even to describe passion among our selves Joe a wild and travel photographer always had the passion and fire within to explore new boundaries for his passion for photography,love for different cuisines and last but not the least like every photographer he loved exploring and trying out girls of every continent , When he Google searched about east Indian ,probabilities he was like dam I didn't see the paradise of the world ,so he packs his back and leaves for incredible India On the airport he meets a stranger who is not so stranger Marilyn from mat Geo who is a social activist and has come in an expedition in Delhi and Agra for research work Well Joe exchanges number and parts way ,but in evening they meet up for a drink at a night club at haze Khazar ,a strange incident what happens next will unfold in real unexpected ways ,which will make a wild photographer from mystic wanderer.",
    "Director": "Amrit Sinha, Jitendra Chauthani",
    "Writer": "Jitendra Chauthani, Amrit Sinha",
    "Actors": "Amrit Sinha, Megan Rack",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt4976192",
    "tt5781146",
    "tt2278050",
    "tt4951982",
    "tt4374286",
    "tt6603378",
    "tt5001456",
    "tt4454078",
    "tt6951892",
    "tt5758726",
    "tt7262882",
    "tt2243900"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:07:11.887Z"
}