{
  "movieId": "tt7685784",
  "title": "The 2017 World Series",
  "year": 2017,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/AlltheMoneyintheWorld2017",
      "id": "AlltheMoneyintheWorld2017",
      "title": "All the Money in the World 2017",
      "description": "All the Money in the World (2017) Synopsis The story of the kidnapping of 16-year-old John Paul Getty III and the desperate attempt by his devoted mother to convince his billionaire grandfather Jean Paul Getty to pay the ransom. All the Money in the World Directed by Ridley Scott United States, Italy, 2017 Drama, Biography, Crime 132",
      "fileSize": 27156383,
      "addedAt": "2026-01-07T00:06:09.634Z",
      "thumbnail": "https://archive.org/services/img/AlltheMoneyintheWorld2017",
      "collection": "feature_films",
      "downloads": 2164
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "90 min",
    "imdbRating": 7.1,
    "imdbVotes": 33,
    "Genre": "Documentary, Sport",
    "Plot": "The first championship for any franchise always delivers a satisfying celebration. But when it happens during the recovery from a natural disaster - it generously serves as a welcome and exhilarating distraction for its fans and city. The Houston Astros thrilled fans with a riveting and fearless Postseason run through the Red Sox, Yankees, and Dodgers. That's strong. They won 101 games during a challenging, tremendous regular season led by Jose Altuve and bolstered by the late-season acquisition of Justin Verlander. Meanwhile, homegrown heroes Altuve, Alex Bregman, Carlos Correa, Dallas Keuchel, Lance McCullers Jr., and Willie Mays World Series MVP George Springer made the team especially exciting. The offense smashed 27 home runs to tie the Major League record for homers hit by one team in a single Postseason, including 15 smashes in the World Series. Under the leadership and direction of Owner and Chairman Jim Crane and General Manager Jeff Luhnow, the Astros staged one of the most successful building efforts ever seen. And Manager A.J. Hinch and Carlos Beltran - of 2004 Astros Postseason fame - combined with veterans Brian McCann, Josh Reddick, and Charlie Morton for exceptional clubhouse chemistry. These Astros personify the resilience and hope of their fans and community, and their World Series title represents the fruits of exemplary strategy, preparation, and execution. It all added up to a strong celebration of the ever-confident, nonstop-believing Astros.",
    "Director": "Jed Tuminaro",
    "Writer": "Aaron Cohen",
    "Actors": "Jose Altuve, Cody Bellinger, Alex Bregman",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt7676544",
    "tt14409096",
    "tt2205904",
    "tt7188868",
    "tt4519562",
    "tt2221420",
    "tt1307879",
    "tt4860278",
    "tt0255441",
    "tt6323518",
    "tt0376855",
    "tt0080741"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:06:09.634Z"
}