{
  "movieId": "tt7738450",
  "title": "Thunder Road",
  "year": 2018,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5H2MUaJL3lo",
      "id": "5H2MUaJL3lo",
      "title": "Der Chaos-Cop - Jetzt den ganzen Film kostenlos schauen bei Moviedome",
      "description": "*GANZER FILM - Rundumtalent Jim Cummings schrieb das Drehbuch, führte Regie und spielt zudem die Hauptrolle*\n\nNeue Filme auf deutsch kostenlos bei Moviedome gucken.\n\nRundumtalent Jim Cummings schrieb das Drehbuch, führte Regie und spielt zudem die Hauptrolle in „Der Chaos-Cop“.\n\nJetzt das Drama \" Der Chaos-Cop “ in ganzer Länge bei #Moviedome sehen.\n\n►Die Handlung:\nFür Jimmy läuft's einfach nicht: Der Cop aus Texas steckt mitten in der Scheidung, muss das Herz seiner Tochter für sich gewinnen und darauf klarkommen, dass der Kassettenrekorder auf der Beerdigung seiner Mutter nicht funktioniert hat. Nicht leicht für jemanden, der auf bisherige Rückschläge mit Wut, Aggression und einem merkwürdigen Tanzstil reagiert hat.\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nJetzt die #DerChaosCop kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama #JimCummings #DerChaosCop\n\nEnglischer Originaltitel: Thunder Road\nFilmlänge: 90 Minuten\nRegie: Jim Cummings\nFSK: 12\nErstveröffentlichung: 2018\n\n\nDie Darsteller\nJim Cummings (bekannt aus „Thunder Road“, „The Wolf of Snow Hollow“) \nin der Rolle des Officer Jim Arnaud\nKendal Farr (bekannt aus „Playing God“)\nin der Rolle der Crystal Arnaud\nNican Robinson (bekannt aus „Tote Mädchen lügen nicht“)\nin der Rolle des Officer Nate Lewis\nJocelyn DeBoera (bekannt aus „Greener Grass“, „Dead Snow - Red vs. Dead“)\nin der Rolle der Rosalind Arnaud\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nJetzt das Comedy Drama \" Der Chaos-Cop “ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:34:39.971Z",
      "thumbnail": "https://i.ytimg.com/vi/5H2MUaJL3lo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAv1afK6FnbNAdLWOVxG7Y5pyEEQg",
      "duration": 5417,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "92 min",
    "imdbRating": 7,
    "imdbVotes": 20281,
    "Genre": "Comedy, Drama",
    "Plot": "Jim Arnaud, a police officer in a Texas town, always tries to do the right thing, but he has more often than not done the wrong thing resulting in having a less than perfect life. He often tries to plan his actions whenever he can, but his impetuous nature and hot-temperedness often makes him do something else he didn't plan, while he also does not have the best gauge of what is socially acceptable or what is standard social convention. In that imperfect life, he didn't have the best relationship with his dancer/dance teacher mother, as didn't his two siblings. He and his wife Ros have been separated for a year now on her initiative, which has resulted in him only seeing their now nine year old daughter Crystal on the weekends. And many of his fellow officers only tolerate him, including the police chief, with his married partner, Nate Lewis, looking out for him as much as he can do so. Two events have the potential to unravel Jim's life even further. First, his mother passes away. He still wants to do right by her even after death, and by association wants even more to do right for Crystal in having that parent-offspring relationship he didn't have with his mother. And second, Ros not only files for divorce, but in planning on moving out of town with her current boyfriend Chris, petitions for full custody of Crystal.",
    "Director": "Jim Cummings",
    "Writer": "Jim Cummings",
    "Actors": "Jim Cummings, Kendal Farr, Nican Robinson",
    "Language": "English",
    "Country": "United States",
    "Awards": "14 wins & 16 nominations total"
  },
  "relatedMovies": [
    "tt6923840",
    "tt6893370",
    "tt5459382",
    "tt4859168",
    "tt6186940",
    "tt2139869",
    "tt1352771",
    "tt8315092",
    "tt5068162",
    "tt1971310",
    "tt4364194",
    "tt3902120"
  ],
  "collections": [
    {
      "id": "2010s",
      "name": "2010s Cinema"
    }
  ],
  "is_curated": true,
  "verified": true,
  "lastUpdated": "2025-12-30T17:27:36.473Z"
}