{
  "movieId": "tt8049858",
  "title": "The Wishing Forest",
  "year": 2018,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zMGnjERE7SY",
      "id": "zMGnjERE7SY",
      "title": "Quest for the Unicorn (The Wishing Forest) | Full Fantasy Movie",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nQuest for the Unicorn (The Wishing Forest) - A beautiful desperate widow goes on a dangerous quest to meet a mythical wish-granting unicorn who lies deep in the cannibal-infested \"Wishing Forest.\" Along the way, she encounters a mighty warrior and a deceptive thief, who may or may not be trustworthy. But danger lurks everywhere and they are being tracked by the deadliest cannibal of all, a bloodthirsty savage who worships a magical feral Goddess who feasts on the hearts of his victims.Welcome to Movie Central. Subscribe and watch more Awesome Movies. \n\n2018\nStars: Karin Brauns, Robert Amstler, Samuel Story\n\nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:07.024Z",
      "thumbnail": "https://i.ytimg.com/vi/zMGnjERE7SY/maxresdefault.jpg",
      "duration": 4482,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "ID",
          "IN",
          "JM",
          "MY",
          "PH",
          "PK",
          "US",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "61 min",
    "imdbRating": 3,
    "imdbVotes": 173,
    "Genre": "Fantasy",
    "Plot": "A beautiful desperate widow goes on a dangerous quest to meet a mythical wish-granting unicorn who lies deep in the cannibal-infested \"Wishing Forest.\" Along the way, she encounters a mighty warrior and a deceptive thief, who may or may not be trustworthy. But danger lurks everywhere and they are being tracked by the deadliest cannibal of all, a bloodthirsty savage who worships a magical feral Goddess who feasts on the hearts of his victims.",
    "Director": "Jadzia Perez, Leia Perez",
    "Writer": "Jamie Grefe",
    "Actors": "Karin Brauns, Robert Amstler, Samuel Story",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt8106846",
    "tt4374286",
    "tt7293920",
    "tt5664222",
    "tt5886388",
    "tt8159584",
    "tt6988208",
    "tt5770864",
    "tt7642542",
    "tt6193454",
    "tt6554976",
    "tt4157728"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:49.902Z"
}