{
  "movieId": "tt8228460",
  "title": "Above 592 metres",
  "year": 2018,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/dipwad2_zoho_5921",
      "id": "dipwad2_zoho_5921",
      "title": "592",
      "description": "592 ",
      "fileSize": 4401508882,
      "addedAt": "2026-01-07T00:08:07.357Z",
      "thumbnail": "https://archive.org/services/img/dipwad2_zoho_5921",
      "collection": "feature_films",
      "downloads": 1441
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "25 min",
    "imdbRating": 6.6,
    "imdbVotes": 15,
    "Genre": "Documentary, Short",
    "Plot": "On the slopes of the Spanish Pyrenees, the construction of the Itoiz Dam in the 1990s flooded seven villages. A line of raw rock encircles the contained green water, marking the landscape with a scar that recalls the still acute injury of the residents displaced 592 metres higher up. The landscape has changed and the relationship between men and their environment has been disturbed. After having fought for years against the flooding of the villages and lands, today they are the distant observers of a suffered change. Ilargi is a farmer and Javier is a park ranger responsible for protecting vultures. They each embody a very different relationship with animals and space. One is close, with a relationship that involves touch as she provides the cows with care. The other, necessarily far from the birds of prey, mainly watching them with binoculars, is in a purely visual relationship. The film lies here, in this difference of distance and point of view created by the disruption of the scenery and, with it, that of an entire ecosystem, in a strong duality of elements, between life and death.",
    "Director": "Maddi Barber",
    "Writer": "Maddi Barber",
    "Actors": "N/A",
    "Language": "Spanish",
    "Country": "Spain",
    "Awards": "2 nominations total"
  },
  "relatedMovies": [
    "tt9012126",
    "tt14556014",
    "tt9064686",
    "tt6564690",
    "tt7676544",
    "tt4290988",
    "tt5734328",
    "tt12287582",
    "tt14161232",
    "tt10161390",
    "tt3155794",
    "tt0021576"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:07.357Z"
}