{
  "imdbId": "tt8235296",
  "title": "The Trump Prophecy",
  "year": 2018,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Gpo4Abj71Mc",
      "id": "Gpo4Abj71Mc",
      "title": "The Trump Prophecy | Full Drama Movie | True Story Of Courage",
      "description": "Witness the incredible true story of one man’s personal journey to healing that led to an international movement. Retired firefighter Mark Taylor finds himself in a crisis of faith as he struggles with a diagnosis of PTSD. But, in 2011, everything changes when he experiences a revelation from God about change in leadership in our nation prior to the 2016 Presidential Election. As he works to understand his remarkable experience, he shares his hopeful vision and it spreads across the globe.\n2019.  Stars: Chris Nelson, Paulette Todd, Karen Boles\n**The film is under non-exclusive license from Cinedigm Corp.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:09:01.166Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Gpo4Abj71Mc/maxresdefault.webp",
      "duration": 6621,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "120 min",
    "imdbRating": 1.5,
    "imdbVotes": 2658,
    "Genre": "Biography, Drama",
    "Plot": "A fireman and public servant Mark Taylor hears a special message from God about change in our nation. When Mary Colbert, a networker and connector of Christian ministries, hears Mark's message she feels called to start a national prayer movement which grows to thousands of people across our nation praying together for the leadership of America and a return to the godly principles we were founded upon. The Trump Prophecy tells the story of Mark Taylor and Mary Colbert through the election of 2016 followed by a reflective time hearing from leaders in various sectors of faith, business, finance, military, and world affairs who respond with their perspective on what it takes to make America great again.",
    "Director": "Stephan Schultze",
    "Writer": "Mary Colbert, Rick Eldridge, Jimmy Hager",
    "Actors": "Chris Nelson, Paulette Todd, Karen Boles",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt15262802",
    "tt4623902",
    "tt6212478",
    "tt5433398",
    "tt4642192",
    "tt5431284",
    "tt9071322",
    "tt3829920",
    "tt3246874",
    "tt6113488",
    "tt5540992",
    "tt5126922"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:36.500Z"
}