{
  "imdbId": "tt8284860",
  "title": "The Huntress: Rune of the Dead",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ma15M-kbKHI",
      "id": "ma15M-kbKHI",
      "title": "The Huntress: Rune of the Dead | Full Action Fantasy Movie | Viking Huntress",
      "description": "The Huntress: Rune of the Dead - Two daughters miss their dad. He hasn't returned from a Viking raid 2 years ago. The older sister Runa does her dad's chores such as bow hunting. She's having bad dreams/visions. Are they omens?\n2019.  Stars: Moa Enqvist Stefansdotter, Yohanna Idha, Viva Östervall Lyngbrant\n***This film is under license from ITN Distribution. All rights reserved.***\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:49.860Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ma15M-kbKHI/maxresdefault.webp",
      "duration": 6321,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "ID",
          "JM",
          "MY",
          "PH",
          "US",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "109 min",
    "imdbRating": 4.4,
    "imdbVotes": 3380,
    "Genre": "Action, Drama, Fantasy",
    "Plot": "811 AD, a family, isolated in their home, deep in the woods a few days travel from Birka. They are poor. The hunting and fishing has been bad for some time, and the father, Joar, takes the desperate measure of going on a Viking raid. Joar does not return for a long time, and the family starts to fear he never will. Runa, the oldest daughter, takes over her father's chores in his absence. She misses him dearly and nourishes a tender hope that he, once again, will return to them. But in her heart somehow she knows the suffering of the family has just begun. There is something in the air, something in the water, the wind and in the soil. Runa is becoming aware of something vile, something dangerous out in the forest. One day when she is out hunting she finds a bleeding man, a warrior, almost unconscious. She brings him inside and the family tends to his wounds. As he heals, she realizes he is sent to protect the family from an approaching evil. And he brings news of her father.",
    "Director": "Rasmus Tirzitis",
    "Writer": "Rasmus Tirzitis, Faravid Af Ugglas",
    "Actors": "Moa Stefansdotter, Yohanna Idha, Viva Östervall Lyngbrant",
    "Language": "English",
    "Country": "Sweden, United States",
    "Awards": "28 wins & 3 nominations total"
  },
  "relatedMovies": [
    "tt0055609",
    "tt0074845",
    "tt6830716",
    "tt7036540",
    "tt4205896",
    "tt6916348",
    "tt8948208",
    "tt9685652",
    "tt0113142",
    "tt0184503",
    "tt0116390",
    "tt7730102"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:22:27.546Z"
}