{
  "imdbId": "tt8291244",
  "title": "In Search of Ozu",
  "year": 2018,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/in-search-of-ozu",
      "id": "in-search-of-ozu",
      "title": "In Search Of Ozu",
      "description": "Oscar-nominated filmmaker Daniel Raim took a pilgrimage to Japan to get his own firsthand look at some of these iconic items, among them the bright-red teakettle and the patterned teacups that accent the household of  Equinox Flower  (1958). The archival treasures on display in Raim’s film, a tribute to Ozu that pays special attention to his vibrant color films, also include artifacts from his sets: the white cotton hat he often wore, the tripod he used to compose his famous low-angle “pillow” shots, and the notebooks in which he meticulously planned his compositions.",
      "fileSize": 3783507440,
      "addedAt": "2026-01-07T00:08:46.616Z",
      "thumbnail": "https://archive.org/services/img/in-search-of-ozu",
      "language": "jpn",
      "year": 2018,
      "collection": "feature_films",
      "downloads": 2132
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "46 min",
    "imdbRating": 7.6,
    "imdbVotes": 75,
    "Genre": "Documentary",
    "Plot": "In this documentary, filmmaker Daniel Raim delves into Yasujiro Ozu's remarkable late work, in which the master made the leap from black and white to color. In his stirring tribute to the great filmmaker, Raim examines Ozu's life and work through archival treasures such as his diary and the red teakettle from the family drama \"Equinox Flower\" (1958); sits down with Ozu's nephew and the producer of the director's gently elegiac final film, \"An Autumn Afternoon\" (1962); and interweaves many scenes and images from the vibrant and humane films with which the director capped his career.",
    "Director": "Daniel Raim",
    "Writer": "Daniel Raim",
    "Actors": "Hideyuki Nagai, Kazuhiro Odashima, Hidenori Okada",
    "Language": "Japanese, English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt10161390",
    "tt9316022",
    "tt7295854",
    "tt8228460",
    "tt7980152",
    "tt8758548",
    "tt9064686",
    "tt10084944",
    "tt7685784",
    "tt7188868",
    "tt4519562",
    "tt6323518"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:08:46.616Z"
}