{
  "imdbId": "tt8239806",
  "title": "The White Storm 2: Drug Lords",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QE-ge6IIbHE",
      "id": "QE-ge6IIbHE",
      "title": "The White Storm 2: Drug Lords | Awesome HK Action Movie",
      "description": "The White Storm 2: Drug Lords - There is an iron rule in the Ching Hing Gang: No drug dealing. The gang leader, Yu Nam, has two right-hand men. One chooses to live in the bright world, while one is in the black. 15 yeas later, what will happen when they reunion?\n2019.  Stars: Andy Lau, Louis Koo, Kiu Wai Miu\n**Under non-exclusive license from Cineverse Corp.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:08:44.142Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/QE-ge6IIbHE/maxresdefault.webp",
      "duration": 5824,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "99 min",
    "imdbRating": 6,
    "imdbVotes": 1673,
    "Genre": "Action, Crime",
    "Plot": "There is an iron rule in the Ching Hing Gang: No drug dealing. The gang leader, Yu Nam (by Kent Cheng), has two right-hand men: one is Tin (by Andy lau), a bright and sober adherent of principles and loyalty; the other is Jizo (by Louis Koo), a cold-blooded smart man who secretly runs a drug business without Nam's knowledge. Ordered by the top leader, Tin taught Jizo a lesson by cutting off one of his fingers and expelled him from the gang. On the same night, policeman Fung (by Michael Miu)'s wife was killed in Jizo's nightclub during an operation. Meanwhile, Tin swore to change sides after his beloved girlfriend walked out of his life. 15 years later, the local drug market is now quadripartite. Jizo becomes the biggest drug dealer in Hong Kong; while Tin has now established himself as a financial tycoon and a philanthropist, and is offering a $100 million bounty to eliminate the No.1 drug dealer in Hong Kong. It causes a stir in both the society and the underworld. Inevitably, a battle between the two tycoons is underway.",
    "Director": "Herman Yau",
    "Writer": "Eric Lee, Erica Li, Herman Yau",
    "Actors": "Andy Lau, Louis Koo, Michael Kiu Wai Miu",
    "Language": "Cantonese",
    "Country": "China, Hong Kong",
    "Awards": "3 wins & 6 nominations total"
  },
  "relatedMovies": [
    "tt5847286",
    "tt6830716",
    "tt4205896",
    "tt7043534",
    "tt7937440",
    "tt5822564",
    "tt6716912",
    "tt8400758",
    "tt9894470",
    "tt3520056",
    "tt6067752",
    "tt8385420"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:18:02.683Z"
}