{
  "movieId": "tt8228906",
  "title": "Little Nights, Little Love",
  "year": 2019,
  "sources": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/little-nights-little-love-2019-1080p-blu-ray",
      "id": "little-nights-little-love-2019-1080p-blu-ray",
      "title": "Little Nights, Little Love (2019)",
      "description": "27-year-old IT manager Boku Sato works for a market survey company. One night, his boss Fujima was devastated over the disappearance of his family and damages some equipment. Sato, on the other hand, spills coffee over the servers causing them to lose their client's data. Due to the incident, he was demoted and was tasked to give out questionnaires at the Sendai station. Nobody was willing to participate in filling out the survey except Saki, a woman in a recruit suit with the word \"shampoo\" on her hand. Another story is of Minako, a 27-year-old beautician. Kasumi introduces her to Manabu, her younger brother, but all Manabu ever does is call Minako on the phone. While she does enjoy their conversations, Minako finds it hard to take the next step and they never actually go out together. Kasumi tells Minako he intends to ask her to be his girlfriend if he wins the boxing match.",
      "fileSize": 2375259287,
      "addedAt": "2026-01-07T00:09:38.891Z",
      "thumbnail": "https://archive.org/services/img/little-nights-little-love-2019-1080p-blu-ray",
      "language": "jpn",
      "year": 2019,
      "collection": "feature_films",
      "downloads": 516
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "119 min",
    "imdbRating": 6.2,
    "imdbVotes": 462,
    "Genre": "Drama, Romance",
    "Plot": "Sato is 27 years old, lives in the northern prefecture of Sendai and is single. He is searching for the spark and explosion that will change his life and give him love and romance. He decides to position himself in front of the train station and solicit answers from the commuters through a survey. A woman with style halts to help. Coincidentally, there is something distinctive about her.",
    "Director": "Rikiya Imaizumi",
    "Writer": "Kôtarô Isaka",
    "Actors": "Haruma Miura, Mikako Tabe, Yûma Yamoto",
    "Language": "Japanese",
    "Country": "Japan",
    "Awards": "1 nomination"
  },
  "relatedMovies": [
    "tt9816396",
    "tt10206614",
    "tt9747440",
    "tt10345022",
    "tt9760234",
    "tt10344986",
    "tt10160650",
    "tt7915554",
    "tt10886166",
    "tt6893370",
    "tt10768194",
    "tt5215088"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2026-01-07T00:09:38.891Z"
}