{
  "imdbId": "tt8310924",
  "title": "Faith, Hope & Love",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OQOiW5UqIBk",
      "id": "OQOiW5UqIBk",
      "title": "Faith, Hope & Love (FULL ROMANCE COMEDY in German, Romantic Comedy Full Movie, Romance Movies)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 In der romantischen Komödie Faith, Hope & Love kommen sich ein trostloser Witwer und eine kürzlich geschiedene Frau durch gemeinsame Tanzstunden näher.\n\nFAITH, HOPE & LOVE (2019)\nOriginaltitel: Faith, Hope & Love\nMit: Peta Murgatroyd, Robert Krantz, Michael Richards\nRegie: J.J. Englert & Robert Krantz\nFSK: Freigegeben ab 0 Jahren\n\nINHALTSANGABE:\nDer erfolgreiche Agenturbesitzer Jimmy hat die Freude am Leben, und die Freude an seinem Glauben verloren. Drei Jahre nach dem Tod seiner Frau wird Jimmy von seinen Töchtern dazu überredet, zum Tanzkurs zu gehen, damit er sich nicht weiter zurückzieht. In der Tanzschule von Besitzerin Faith entdeckt er in dieser eine ähnlich verlorene Seele wie sich selbst. Um Faiths Tanzschule zu retten, braucht sie für einen Wettbewerb einen Tanzpartner, der Amateur ist, und der tänzerisch unscheinbare Jimmy überzeugt mit genügend Talent. Während des Trainings kommen sich beide nicht nur näher, sondern entdecken auch, dass Jimmys wiedergefundener Glaube auch für Faith eine große Rolle spielt.\n#Netzkino #ganzerFilm #liebeskomödie\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:26.398Z",
      "thumbnail": "https://i.ytimg.com/vi/OQOiW5UqIBk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAfVpFIws4lyDR9e6tF7rrRPHtESw",
      "duration": 6101,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "PG",
    "Runtime": "106 min",
    "imdbRating": 6.4,
    "imdbVotes": 1349,
    "Genre": "Comedy, Romance",
    "Plot": "A couple years after his wife's death, Jimmy Hope is struggling to move on with his life, at work and at home where he's trying to raise his two daughters alone. Faith Turley is recently divorced and doing her best to cope with the pain of it, but her troubles are compounded by the fact that her life's dream, her dance studio, is in jeopardy of being shut down. To raise funds to save it, she enters a \"Pro and a Schmo\" dance contest and searches for a partner who's a non-professional. Jimmy's younger daughter Demetra prays every night that her dad will be Faith's dance-contest partner because: \"Our house needs a Mommy and our Daddy needs someone to love him.\" God hears her prayers, and Jimmy and Faith become dance partners. Over the next few months, on and off the dance floor, she teaches him to have hope again; he helps restore her faith; and together they learn how to love again.",
    "Director": "J.J. Englert, Robert Krantz",
    "Writer": "Robert Krantz",
    "Actors": "Peta Murgatroyd, Robert Krantz, Edward Asner",
    "Language": "English",
    "Country": "United States",
    "Awards": "1 nomination total"
  },
  "relatedMovies": [
    "tt9816396",
    "tt10206400",
    "tt10964168",
    "tt8717018",
    "tt10346362",
    "tt9760234",
    "tt1950235",
    "tt4897124",
    "tt10176734",
    "tt2139881",
    "tt9690756",
    "tt6893370"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-28T07:24:05.804Z"
}