{
  "imdbId": "tt8358682",
  "title": "Alone We Fight",
  "year": 2018,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_9LyMgAC4IA",
      "id": "_9LyMgAC4IA",
      "title": "Alone We Fight | Full Action War Movie | WWll",
      "description": "**This film is under non-exclusive license from Distribution Solutions/Alliance Entertainment. All rights reserved**\n\nA small band of American soldiers venture into enemy territory on a mission to stop a German unit from breaking through the Allied line.\n\n2018\nStars: Aidan Bristow, Matthew James McCarthy, Corbin Bernsen\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #FullWarMovies #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:09:47.512Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/_9LyMgAC4IA/maxresdefault.webp",
      "duration": 5493,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "91 min",
    "imdbRating": 2.9,
    "imdbVotes": 566,
    "Genre": "Action, War",
    "Plot": "This is a movie about the relationship between several GI's, all that's left from a much larger unit of Rangers. The have already been captured, fight to get away, and finally return to their unit, losing friends in the process. After coming back to an aid station and makeshift headquarters they are advised of a German advance that if not stopped, will roll over the wounded and Nurses. Their mission is to blow up a petrol station and deny the Germans the fuel needed to continue the attack. Anyone looking for Saving Private Ryan has chosen the wrong movie. But if you want to watch a movie where unit relationships are explored, small unit combat is portrayed, and what it's like sometimes when the chips are down, this one isn't bad.",
    "Director": "Justin Lee",
    "Writer": "Justin Lee",
    "Actors": "Aidan Bristow, Matthew James McCarthy, Corbin Bernsen",
    "Language": "English",
    "Country": "United States",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt6409762",
    "tt2459244",
    "tt9685652",
    "tt6836772",
    "tt15262370",
    "tt9904802",
    "tt5344794",
    "tt12226808",
    "tt4379420",
    "tt4985906",
    "tt7605084",
    "tt14188284"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:10.924Z"
}