{
  "imdbId": "tt8549254",
  "title": "Bundy and the Green River Killer",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oRifSyJ1Bs0",
      "id": "oRifSyJ1Bs0",
      "title": "Bundy And The Green River Killer | Full Crime Thriller Movie",
      "description": "Bundy And The Green River Killer - Based on terrifying true life elements which inspired Silence of the Lambs. In 1984, police in Washington State are investigating a spate of serial murders committed by a mysterious man known as The Green River Killer. With no leads to go on, the detective in charge of the case consults with psychologists in an attempt to get inside the mind of the killer. But when that doesn't produce a positive result and the killings continue, the detective realizes that the only way to understand what makes a serial killer tick is to meet one. So he visits the imprisoned Ted Bundy, one of the most notorious serial killers in American history.\n2019. Stars: Mark Homer, Andromeda Godfrey, Rahel Kapsaski\n**Under non-exclusive license from Distribution Solutions/Alliance Entertainment. All rights reserved** \n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\nMORE FULL MOVIES - FREE on YouTube!\n\n Free Action Movies: https://bit.ly/3uMwRxq\n Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n Free Horror Movies: https://bit.ly/3aBBt2J\n Free Asylum Movies: https://bit.ly/3cipzeI\n Free Crime/Thriller: https://bit.ly/3o01prJ\n Free Drama Movies: https://bit.ly/3Pu4mN9\n Free Comedy Movies: https://bit.ly/3IE0wPd\n Free Western Movies: https://bit.ly/3RqTX6u\n Free Adventure Movies: https://bit.ly/3yHolAT\n MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #LatestActionMovies #YouTubeMovies",
      "addedAt": "2025-12-27T00:09:46.801Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/oRifSyJ1Bs0/maxresdefault.webp",
      "duration": 5259,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "GB",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "Not Rated",
    "Runtime": "85 min",
    "imdbRating": 3.4,
    "imdbVotes": 1367,
    "Genre": "Crime, Drama, Thriller",
    "Plot": "Based on terrifying true life elements which inspired Silence of the Lambs. In 1984, police in Washington State are investigating a spate of serial murders committed by a mysterious man known as The Green River Killer. With no leads to go on, the detective in charge of the case consults with psychologists in an attempt to get inside the mind of the killer. But when that doesn't produce a positive result and the killings continue, the detective realizes that the only way to understand what makes a serial killer tick is to meet one. So he visits the imprisoned Ted Bundy, one of the most notorious serial killers in American history. The detective has his resolve tested as he gets a disturbing insight into the murderous mind, but when the information Bundy provides assists the hunt for the Green River Killer the detective perseveres. Eventually he builds a twisted relationship with Bundy which forces the detective to confront his own psychological demons before he finally comes face to face with the Green River Killer.",
    "Director": "Andrew Jones",
    "Writer": "Andrew Jones",
    "Actors": "Matthew Baunsgard, Oliver Berry, Lola Claire",
    "Language": "English",
    "Country": "United Kingdom",
    "Awards": "N/A"
  },
  "relatedMovies": [
    "tt9211804",
    "tt3138122",
    "tt5117372",
    "tt3952864",
    "tt4789618",
    "tt3203620",
    "tt5848714",
    "tt10298870",
    "tt5193784",
    "tt3173594",
    "tt3731176",
    "tt7099566"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:20:09.463Z"
}