{
  "imdbId": "tt8655738",
  "title": "Eternal Code",
  "year": 2019,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_x9YrkZrCD4",
      "id": "_x9YrkZrCD4",
      "title": "Eternal Code | Full Movie | Crime Thriller",
      "description": "Eternal Code - After a revolutionary invention with great implications Bridget finds a character flaw in the company they've partnered with to develop the prototype that could be the fountain of youth. When she pulls the plug and step away from their original deal she quickly realizes they will stop at nothing to get it back. After her family gets kidnapped to sway a favorable vote their hopes rely on their teen daughter Miranda and her unlikely allies Corey and Stephanie.\n2019. Stars: Richard Tyson, Scout Taylor-Compton, Billy Wirth\n*Licensed from Vision Films Inc. All rights reserved*\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:11:07.397Z",
      "thumbnail": "https://i.ytimg.com/vi/_x9YrkZrCD4/maxresdefault.jpg",
      "duration": 6352,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "IE",
          "NZ",
          "US"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "N/A",
    "Runtime": "105 min",
    "imdbRating": 3.3,
    "imdbVotes": 3816,
    "Genre": "Action, Crime, Thriller",
    "Plot": "After a revolutionary invention with great implications Bridget finds a character flaw in the company they've partnered with to develop the prototype that could be the fountain of youth. When she pulls the plug and step away from their original deal she quickly realizes they will stop at nothing to get it back. After her family gets kidnapped to sway a favorable vote their hopes rely on their teen daughter Miranda and her unlikely allies Corey (a suicidal military veteran) and Stephanie (a prostitute).",
    "Director": "Harley Wallen",
    "Writer": "Harley Wallen",
    "Actors": "Richard Tyson, Scout Taylor-Compton, Billy Wirth",
    "Language": "English",
    "Country": "United States",
    "Awards": "5 wins & 8 nominations"
  },
  "relatedMovies": [
    "tt7043534",
    "tt5847286",
    "tt5351458",
    "tt2268433",
    "tt3903852",
    "tt12773826",
    "tt7886442",
    "tt3580692",
    "tt3540136",
    "tt3848892",
    "tt10964866",
    "tt3398252"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:23:04.231Z"
}