{
  "movieId": "tt9742794",
  "title": "The Vault",
  "year": 2021,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YwKdJ2ctUck",
      "id": "YwKdJ2ctUck",
      "title": "The Vault | Full Action Adventure Movie",
      "description": "**The film is under non-exclusive license from Artist View Entertainment Inc.  All rights reserved**\n\nThe Vault - After terrorist take over a museum, a Reformed Jewel Thief must decide if he should help them steal a priceless diamond or if he should save the day.\n\n2005\nStars: Laci Szabo, Suzanne Karseras, Bas Rutten \n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:33.995Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/YwKdJ2ctUck/maxresdefault.webp",
      "duration": 5241,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "ID",
          "JP",
          "NZ",
          "PH",
          "US",
          "ZA"
        ]
      }
    }
  ],
  "metadata": {
    "Rated": "R",
    "Runtime": "118 min",
    "imdbRating": 6.4,
    "imdbVotes": 34425,
    "Genre": "Action, Thriller",
    "Plot": "Thom, a genius engineering graduate, is interested in the Bank of Spain's safe. The Bank building is more than 100 years old, with no building blueprints available and a security system that includes an underground river that will flood the safe room if their walls are breached. As soon as Thom learns that a legendary lost treasure is going to be held at the bank's safe for just ten days, he devises, together with charismatic art dealer Walter \"Cunningham,\" a detailed plan to break in. They will only have 105 minutes to do so while the Bank's staff will be distracted, watching the 2010 Football World Cup final match, played by Spain's national football team and broadcast on a giant screen, coincidentally placed just in front of the Bank of Spain building.",
    "Director": "Jaume Balagueró",
    "Writer": "Rafa Martínez, Andrés M. Koppel, Borja Glez. Santaolalla",
    "Actors": "Freddie Highmore, Astrid Bergès-Frisbey, Sam Riley",
    "Language": "English, Spanish, Italian, German",
    "Country": "Spain, France, United States",
    "Awards": "2 wins total"
  },
  "relatedMovies": [
    "tt8514632",
    "tt14804080",
    "tt6902332",
    "tt13818610",
    "tt15262370",
    "tt10323676",
    "tt9037864",
    "tt6876854",
    "tt14174168",
    "tt12942958",
    "tt12906784",
    "tt13437998"
  ],
  "collections": [],
  "is_curated": true,
  "verified": false,
  "lastUpdated": "2025-12-29T02:21:50.792Z"
}