{
  "imdbId": "youtube-JLh__8NaU1k",
  "title": "El Día de Plenilunio | DRAMÁTICA | Con subtítulos en español",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JLh__8NaU1k",
      "id": "JLh__8NaU1k",
      "title": "El Día de Plenilunio | DRAMÁTICA | Con subtítulos en español",
      "description": "La película trata sobre la interconexión de acontecimientos que, a primera vista, no significan nada, pero que en realidad tienen un impacto en la vida de completos desconocidos. El espectador se sumerge en el flujo de viajes en el espacio y el tiempo. No hay un único personaje principal ni un único esquema narrativo, no hay una trama en el sentido habitual de la palabra. Esta película es un reflejo de la vida, donde los destinos de las personas se cruzan de manera extraña, creando en la pantalla la imagen de la Rusia de finales de los 90. Cada personaje lleva su propia historia, su propio secreto sin resolver, como un transeúnte en la calle a quien notas e inmediatamente lo pierdes de vista para siempre.\n\nAño de producción: 1998\n\nDirector: Shakhnazarov Karen\nEscritores: Alexander Borodyansky, Karen Shakhnazarov\nCompositor: Anatoly Kroll\nOperador: Karyuk Gennady\nDiseño de producción: Kusakova Lyudmila\n\nReparto: Ilyin Vladimir, Fateeva Natalya, Sukhov Fedor, Koreneva Elena, Storozhik Valery, Germ Anna, Panin Andrey, Stychkin Evgeny, Priemykhov Valery, Vasilyeva Nadezhda, Zotov Vasily, Tsygankov Andrey, Chindyaykin Nikolay, Shevchenkov Alexey, Yankovsky Philip, Anisimova Galina, Afanasyev Valery, Sinyakina Anna",
      "addedAt": "2025-12-23T03:44:20.454Z",
      "thumbnail": "https://i.ytimg.com/vi/JLh__8NaU1k/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDPr_qjTE6j_Ll4I6xR13XgzA6U5g",
      "duration": 5498,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T03:44:20.454Z"
}