{
  "imdbId": "youtube-baoLSItwT_0",
  "title": "The Brain Machine 1972 | Sci-Fi | James Best, Barbara Burgess | Full Movie | Subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=baoLSItwT_0",
      "title": "The Brain Machine 1972 | Sci-Fi | James Best, Barbara Burgess | Full Movie | Subtitles",
      "description": "It Has No Conscience, It Shows No Mercy!\nSeveral people volunteer for a scientific experiment about mind-reading and memory, but the experiment goes horribly wrong.\n\nOriginal title: The Brain Machine (1972) AKA:  Mind Warp / Gray Matter / Time Warp\nDirector: Joy N. Houck Jr.\nWriters: Thomas Hal Phillips, Christian Garrison \nActors: James Best, Barbara Burgess, Gil Peterson \nGenres: Classics, Sci-Fi, Thriller\n\n00:00 Full Movie\n02:15 💥 A top-secret file and a project file are missing from the underground lab, and it is suspected that Dr. Krisner is responsible.\n13:08 🕵️ A senator and a general discuss the importance of a brain machine for defense and surveillance purposes.\n20:13 😱 Reverend Neill is being interviewed and experiences a mix of pleasant and painful memories, while also expressing discomfort and a speech impediment.\n30:19 🔬 A group of doctors and researchers are conducting an experiment involving biofeedback training and impulse feed on the brain.\n44:38 🎥 A team is preparing to conduct an experiment involving a brain probe procedure.\n53:12 😱 During a C.I.C. experiment, Minnie Lee confesses to killing her baby and causing her father's death, leading to a chaotic situation in the control room.\n1:03:05 ⚠️ A minister and a scientist discuss the existence of a personal God, leading to a deadly situation in a computer lab.\n1:17:45 💥 A catastrophic event occurs when a patient breaks free and exposes himself and others to 500,000 volts of electricity during an experimental therapy.\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "baoLSItwT_0",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:41:47.987Z"
}