{
  "imdbId": "youtube-JY-eRChaJVU",
  "title": "2024 New Hollywood Movie | A Family Uncovers Deadly Secrets On A Haunted Farm | Blood Harvest",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JY-eRChaJVU",
      "id": "JY-eRChaJVU",
      "title": "2024 New Hollywood Movie | A Family Uncovers Deadly Secrets On A Haunted Farm | Blood Harvest",
      "description": "2024 New Hollywood Movie | A Family Uncovers Deadly Secrets On A Haunted Farm | Blood Harvest\n\n*Blood Harvest* - A family moves back to an old, secluded farm in their mother’s hometown, a small, seemingly peaceful town with a terrifying and very dark past. The farm, passed down through generations, holds long-buried secrets that no one in the family was prepared to uncover. At first, everything seems idyllic, but as the family settles in, strange occurrences begin to unravel the comforting façade of their new life. Whispers of the town’s violent history and tragic events stir up a sense of unease, and the family quickly learns that this is no ordinary place. \n\nOne of the children, a gifted clairvoyant, starts to experience disturbing visions of the past. These eerie flashes show horrific scenes of murders, hauntings, and unspeakable acts that took place on the very land they now call home. With his sister by his side, they begin digging into the town’s grim history and the farm’s role in the darkness that has plagued it for generations. The more they uncover, the more the spirits of the past seem to awaken, furious at being disturbed. Soon, they realize that the truth may be far worse than they imagined. \n\nThe longer the family stays, the more they find themselves entangled in a supernatural web of danger. The town’s evil history comes alive in terrifying ways, threatening to drag them into a nightmare from which there is no escape. As the children’s visions grow more vivid and dangerous, the family begins to understand that their presence on the farm may have unleashed something sinister. The closer they get to the truth, the more perilous their situation becomes, and they must decide whether to leave or face the malevolent forces that have haunted the land for centuries.\n\n2024.  Stars: Jason London, Robert LaSardo, Simon Phillips\n*Licensed from Vision Films. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#2024hollywoodmovies #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:38:36.437Z",
      "thumbnail": "https://i.ytimg.com/vi/JY-eRChaJVU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBu-uR7BF_YcKw2p8UVWhO83hu1RA",
      "duration": 4732,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:38:36.437Z"
}