{
  "imdbId": "youtube-o617PIN8pWc",
  "title": "Film-Noir | Strange Affair (1945) Erich von Stroheim, Mary Beth Hughes, Dan Duryea | Colorized",
  "year": 1945,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=o617PIN8pWc",
      "title": "Film-Noir | Strange Affair (1945) Erich von Stroheim, Mary Beth Hughes, Dan Duryea | Colorized",
      "description": "Quick on the trigger! Quick to kill! \nFlamarion, expert marksman, is entertaining people in a show which features Connie, beautiful woman and her husband Al. Flamarion and Connie fall in love and decide to get rid of the alcoholic husband.\n\nOriginal title: The Great Flamarion (1945) AKA: Strange Affair\n\nBlack & White original version: https://youtu.be/UaywM8HS1n4\n\n\nDirector: Anthony Mann\nWriters: Anne Wigton, Heinz Herald, Richard Weil\nStars: Erich von Stroheim, Mary Beth Hughes, Dan Duryea\nGenres:  Colorized, Crime, Drama, Film-Noir, Mystery, Romance, Thriller\n\n\n00:00 Full Movie (with subtitles)\n02:55 Murder investigation unfolds during a theater performance, revealing secrets and suspects.\n10:56 Drama unfolds as characters navigate through a web of deception and betrayal in a colorized film-noir.\n17:04 Mysterious events unfold as characters navigate through complex relationships and hidden motives.\n22:10 A mysterious love affair unfolds between Flamarion and Alma, leading to unexpected consequences.\n26:58 A tale of love, deception, and danger unfolds as relationships are tested in the midst of alcohol abuse and dreams of a better life.\n32:09 A dramatic conversation between characters revealing hidden motives and strained relationships.\n37:14 A complex relationship unfolds between characters leading to potential betrayal and consequences.\n41:45 A mysterious and tense film noir unfolds as characters navigate through complex relationships and impending danger.\n51:37 A mysterious encounter leads to a fateful decision between two lovers in a film noir setting.\n59:13 Mystery unfolds as Brandt searches for Connie, encountering dead ends and new leads in his investigation.\n1:09:35 A summary of a classic film noir involving a mysterious affair and its consequences.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "o617PIN8pWc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:32.064Z"
}