{
  "imdbId": "youtube-YLQmJgqCjQ4",
  "title": "The Doll of Satan (1969 Horror) Italian film directed by Ferruccio Casapinta",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YLQmJgqCjQ4",
      "id": "YLQmJgqCjQ4",
      "title": "The Doll of Satan (1969 Horror) Italian film directed by Ferruccio Casapinta",
      "description": "Elizabeth inherits a spooky old castle from her late uncle. Strange occurrences and ghostly sightings begin to haunt her and her fiancé. As they delve deeper into the castle's secrets, they uncover a dangerous plot by a group of people who want to steal the castle's hidden treasure.\n\nOriginal title: La bambola di Satana (1969) \nAlternative titles: Satan's Doll, Der Satan ohne Gesicht, La Poupée de Satan, 撒旦的木偶, A Sátán babája\n\nWatch the (Members Only) uncensored version: https://youtu.be/i30nLdb0UXY\n\n\nDirector: Ferruccio Casapinta\nWriters: Ferruccio Casapinta, Giorgio Cristallini, Carlo M. Lori\nStars: Erna Schürer, Roland Carey, Aurora Battista\nGenre: Italian cinema, Giallo, Horror\n\n\n00:00 Full Movie\n00:00 A Mysterious Inheritance - Elizabeth inherits a haunted castle from her late uncle.\n05:21 A Sinister Presence - Strange occurrences and ghostly encounters begin to plague Elizabeth and her fiancé.\n12:30 Unraveling the Mystery - Elizabeth and Jack, with the help of a mysterious woman, start to uncover the truth behind the haunting.\n25:00 A Dangerous Game - A confrontation ensues between the protagonists and the villains.\n35:00 A Shocking Revelation - A shocking revelation about the castle's dark past is unveiled.\n45:00 A Climactic Showdown - A showdown between good and evil takes place.\n55:00 Elizabeth and Jack must overcome the darkness of the past.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:12.154Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/YLQmJgqCjQ4/maxresdefault.webp?v=6724326c",
      "duration": 5385,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:12.279Z"
}