{
  "imdbId": "youtube-zcNe4Njq648",
  "title": "Richard Boone | I Bury the Living (1958, Horror) Colorized Movie by Albert Band",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zcNe4Njq648",
      "title": "Richard Boone | I Bury the Living (1958, Horror) Colorized Movie by Albert Band",
      "description": "Out of a time-rotted tomb crawls an unspeakable horror!\nA newly appointed cemetery chairman believes that, merely by inserting a black plot-marking pin into a wall-sized map of the cemetery, he can cause the deaths of that plot’s owner.\n\nOriginal title: I Bury the Living (1958)\n\nBlack & White version: https://youtu.be/pHY2LvTFwaA\n\n\nDirector: Albert Band\nWriters: Louis Garfinkle\nStars: Richard Boone, Theodore Bikel, Peggy Maurer\nGenre:  Colorized classics, Cult, Horror, Thriller\n\n\n00:00 Full Movie (with subtitles)\n05:26 Exploration of a cemetery map leads to shocking consequences during a fateful visit.\n12:12 A lunch meeting takes an unexpected turn, revealing surprising connections and emotional revelations.\n20:47 A man reflects on a string of mysterious deaths and the eerie power of suggestion.\n26:46 An investigation into unexplained deaths deepens, raising suspicions and the threat of resignation.\n32:18 Tensions rise as Bob and Ann’s mysterious conversation leads to a confrontation and possible fallout.\n38:09 A wave of suspicious deaths strikes after a cemetery meeting, sparking confusion and fear.\n47:16 Mystery thickens as characters face an uncertain fate, with a man missing and murder in the air.\n56:50 Black and white pins on a map reveal chilling secrets as an investigation uncovers shocking truths.\n1:12:10 A race against time unfolds as the investigation into mysterious deaths uncovers unsettling discoveries.\n\n\n@CultCinemaClassics\n\n https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "zcNe4Njq648",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:11.808Z"
}