{
  "imdbId": "youtube-5OP23M02OA4",
  "title": "Break Up / Controsesso (1964) Italian Comedy | Colorized | Full Movie",
  "year": 1964,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5OP23M02OA4",
      "id": "5OP23M02OA4",
      "title": "Break Up / Controsesso (1964) Italian Comedy | Colorized | Full Movie",
      "description": "He who goes against sex... goes against nature!\nThree interconnected stories explore the complex and taboo aspects of sexual desire and repression in 1960s Italy.\n\nBlack & White version: https://youtu.be/srMH0z-IDEU\n\n\nOriginal title: Controsesso (1964) AKA: Countersex / Break Uo\n\nDirectors: Renato Castellani, Marco Ferreri, Franco Rossi\nWriters: Cesare Zavattini, Leonardo Benvenuti, Piero De Bernardi\nStars: Nino Manfredi, Anna Maria Ferrero, Ugo Tognazzi\nThis film is subtitled in many languages.\n\n0:00 Full Movie\n01:11 opening scene - A chaotic and comedic series of events unfold involving lost tickets, a forgotten coat, and a hidden stash of cocaine.\n3:18 A chaotic and comedic series of events unfold involving lost tickets, a forgotten coat, and a hidden stash of cocaine.\n13:40 A chaotic and confusing series of events involving drugs, relationships, and unexpected encounters.\n26:17 A chaotic and nonsensical conversation between two people, involving pregnancy, Christmas, and a broken floor.\n35:00 A humorous scene unfolds in a classroom setting, involving a teacher, students, and a baby.\n49:56: A conversation between individuals discussing various topics and interactions in a store.\n56:02 A chaotic and comedic scene unfolds as characters interact in a theater setting.\n1:10:39 A conversation about love, business, and personal struggles over cocktails.\n1:19:39 A chaotic situation unfolds, involving negotiations, legal matters, and unexpected events.\n1:26:52 A confusing and chaotic conversation involving negotiations, agreements, and a mysterious situation.\n1:33:15 A chaotic and humorous train journey to Milan with unexpected events.\n\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:39:42.454Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/5OP23M02OA4/maxresdefault.webp",
      "duration": 6394,
      "language": "en",
      "year": 1964,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:42.627Z"
}