{
  "imdbId": "youtube-F2b9WTLZMnk",
  "title": "WHAT is he? Phantom from Space (1953) Sci-Fi, Horror | Colorized | Full Movie",
  "year": 1953,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=F2b9WTLZMnk",
      "title": "WHAT is he? Phantom from Space (1953) Sci-Fi, Horror | Colorized | Full Movie",
      "description": "His secret power menaced the world!\nAfter a UFO sighting, a mysterious phantom in a bizarre outfit starts attacking people in San Fernando Valley.\n\nOriginal title: Phantom from Space (1953) \n\nBlack & White version: https://youtu.be/1b3WM7m3o1o\n\n\nDirector: W. Lee Wilder\nWriters: William Raynor, Myles Wilder\nStars: Ted Cooper, Rudolph Anders, Noreen Nash \nGenres: Cult Classic, Horror, Sci-Fi\n\nThis film is available with dubbed French audio, and many subtitle options.  👉 go to video settings ⚙️  to change your audio / subtitle language.\n\n\n00:00 Full Movie\n00:39 A chaotic event unfolds in the skies over North America, prompting emergency response and confusion.\n06:18 A police officer investigates a series of mysterious events involving a missing head and a suspicious character with a helmet.\n11:59 A mysterious murder case unfolds with unexpected interventions and a mobile disruption.\n16:56 A man in an unusual outfit causes a disturbance at an oil mine, leaving witnesses in fear and confusion.\n20:18 A conversation about a potential suspect and a mysterious object detected off the coast of Alaska.\n23:56 A mysterious investigation unfolds as authorities track down a potential threat.\n28:12 A group of people search for a missing person while encountering various obstacles.\n35:20 A discovery leads to confusion and intrigue during a scientific investigation.\n45:17 A mysterious situation unfolds as a person goes missing in a locked room.\n48:26 The video discusses the discovery of a superhuman with advanced intelligence and a unique physical composition.\n55:59 A mysterious alien presence is being pursued by authorities after causing disturbances on Earth.\n59:56 A tense situation unfolds as a journalist and others try to prevent a potential threat from escalating.\n1:05:59 A group of people try to communicate with an alien being in a laboratory.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "F2b9WTLZMnk",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:39:20.144Z"
}