{
  "movieId": "youtube-cDfYhyhyCVE",
  "title": "The Bat 1959 | Vincent Price, Agnes Moorehead | Mystery, Horror | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cDfYhyhyCVE",
      "id": "cDfYhyhyCVE",
      "title": "The Bat 1959 | Vincent Price, Agnes Moorehead | Mystery, Horror | Full Movie",
      "description": "A crazed killer known as \"The Bat\" is on the loose in a mansion full of people.\n\nOriginal title: The Bat (1959)\n\nColorized version https://youtu.be/-1UuKmwVKpY\n\nDirector: Crane Wilbur\nWriters: Crane Wilbur, Crane Wilbur \nStars: Vincent Price, Agnes Moorehead, Gavin Gordon\nGenres: Classics, Horror, Mystery, Thriller\n\nThis film is available with English, French, German, Italian & Spanish dubbed audio.  Go to video settings ⚙️  to change your audio / subtitle language options.\n\n00:00 Full Movie\n01:08 Cornelia Van Gorder, an author, rents a house called the Oaks for the summer, but the staff she brought with her is considering leaving due to rumors about a killer called the Bat and rabid bats in the area.\n6:11 A bank officer and his doctor plot to steal a million dollars worth of securities and fake the officer's death in a hunting accident.\n12:42 A woman and her maid experience strange occurrences in their house, including hearing noises and encountering a man without a face, while a notorious criminal known as the Bat is on the loose.\n22:36 A bat bites the maid in the house, causing concern for rabies.\n28:36 A doctor visits Miss Van Gorder's house after her maid is bitten by a bat, and they discuss the strange occurrences happening in the house.\n33:09 Miss Van Gorder receives a signed first edition of a book from Judie and discusses her new servants and the possibility of hidden treasure in the house.\n39:09 A murder occurs in a house and the Bat is suspected as the killer.\n46:49 A group of people discuss the Bat and his motives, while Mark Fleming is found dead.\n55:45 A mysterious killer known as the Bat terrorizes a group of people in a house.\n1:10:01 Miss Van Gorder goes missing and the house is in chaos as a detective is found dead.\n1:13:57 The Bat is still on the loose, but the hidden room and safe have been discovered and the stolen money recovered.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:45.975Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/cDfYhyhyCVE/maxresdefault.webp?v=65418f62",
      "duration": 4804,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:46.106Z"
}