{
  "movieId": "youtube-FcLQuh9jSC8",
  "title": "KONFUZIUS - Historienfilm, Action - Ganzen Film kostenlos in HD schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FcLQuh9jSC8",
      "id": "FcLQuh9jSC8",
      "title": "KONFUZIUS - Historienfilm, Action - Ganzen Film kostenlos in HD schauen bei Moviedome",
      "description": "*GANZER FILM – Episches Biopic über das Leben des weltbekannten Philosophen*\n\nDen Spielfilm „Konfuzius“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Konfuzius“:\nIMDb: *6,1* von 10\nAmazon: *4,1* von 5\n\n*Die Handlung von „Konfuzius“*\nDas chinesische Reich ist noch nicht geeint, sondern gespalten durch unzählige Herrscher, die sich untereinander bekämpfen. Konfuzius (Chow Yun-Fat) wird als Berater an den Hof von Lu berufen, wo er sich durch seinen milden Herrschaftsstil jedoch schnell Feinde macht. Und obwohl er durch seine Strategie sogar einen Staatsstreich verhindern kann, wird er durch eine List des Herrschers von Qi vom Hofe gejagt. Konfuzius muss seine Familie verlassen und wandert mit einigen treuen Gefährten durch das Land, auf der Suche nach einer neuen Heimat…\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Konfuzius“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #MartialArts #Abenteuerfilm #Biopic #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Kong Zi\nLaufzeit: 125 Minuten\nRegie: Mei Hu\nFSK: 16\nErstveröffentlichung: 2010\n\n\n*Das sind die Schauspieler*\nChow Yun-Fat (bekannt aus „Tiger & Dragon\", „The Killer“)\nin der Rolle des Confucius\nXun Zhou (bekannt aus „Der Ruf des Kaisers\", „Cloud Atlas“)\nin der Rolle der Nanzi\nJianbin Chen (bekannt aus \"Three Kingdoms\", „Empresses in the Palace“)\nin der Rolle des Ji Sunsi\nQuan Ren (bekannt aus \"Heroes of War - Assembly\")\nin der Rolle des Yan Hui\n\n\n*Die Handlung und Szenen von „Konfuzius“* \nUnsere Geschichte spielt in einer Zeit, in der das große Chinesische Reich zersplittert und gespalten war durch unzählige Herrscher, die sich untereinander bekämpfen. Konfuzius wird an den Hof von Lu berufen, wo er sich durch seinen milden Herrschaftsstil jedoch schnell Feinde macht. Und obwohl er durch seine Strategie sogar einen Staatsstreich verhindern kann, wird er vom Hofe gejagt.\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Konfuzius“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:31.296Z",
      "thumbnail": "https://i.ytimg.com/vi/FcLQuh9jSC8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBpZ1hlHCerdVxouGjVE1j5IS8DQA",
      "duration": 7513,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:33:31.385Z"
}