{
  "imdbId": "youtube-10MFVT7p_3Q",
  "title": "Film-Noir | The Bigamist 1953 | Ida Lupino, Edmund Gwenn, Joan Fontaine | Movie, Subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=10MFVT7p_3Q",
      "title": "Film-Noir | The Bigamist 1953 | Ida Lupino, Edmund Gwenn, Joan Fontaine | Movie, Subtitles",
      "description": "A Motion Picture With a Theme Unusual in the Extreme!\nHarry Graham (Edmond O'Brien) and his wife and business partner, Eve (Joan Fontaine), are in the process of adopting a child. But a private investigator Jordan (Edmund Gwenn) uncovers the fact that Graham has another wife, Phyllis (Ida Lupino), and a small child in Los Angeles.\n\nOriginal title: The Bigamist (1953)\n\nWatch the Colorized version: https://youtu.be/ZC-FII_bkig\n\nDirector: Ida Lupino\nWriters: Lawrence B. Marcus, Lou Schor \nStars: Joan Fontaine, Ida Lupino, Edmund Gwenn \nGenres: Classics, Drama, F rated, Film-Noir\nBudget: $175,000\n\nThis film is available with audio in English, French, Italian & Spanish.  Go to video settings ⚙️  to change your audio / subtitle language.\n\n\n00:00 Full Movie\n00:19  A couple named Harry and Eve Graham go through the adoption process and are interviewed by an adoption agency.\n13:19  Mr. Jordan investigates the whereabouts of Harry Graham in Los Angeles.\n19:27  A man reflects on his double life and loneliness while taking a bus tour of Beverly Hills.\n27:07  Two strangers bond over Chinese food in a restaurant.\n34:37  A couple spends time together and plans to travel, but one of them decides to end the relationship.\n43:28  A couple discusses their relationship and plans for adoption before one of them receives news about a family emergency.\n57:35  A man named Harry confesses to his ex-wife, Eve, that he cheated on her and is going to be a father.\n1:01:59  A man confesses to his wife that he cheated on her and offers to pay her to leave him\n1:08:41  A man confesses to his wife that he wants a divorce and regrets hurting her, while she pleads for forgiveness.\n\n\n@CultCinemaClassics",
      "id": "10MFVT7p_3Q",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:40:15.730Z"
}