{
  "imdbId": "youtube-VgzegGZKR6E",
  "title": "The Night They Took Miss Beautiful (1977, Drama) Victoria Principal, Gary Collins | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VgzegGZKR6E",
      "title": "The Night They Took Miss Beautiful (1977, Drama) Victoria Principal, Gary Collins | Movie",
      "description": "Beauty, Brains, and Bio-Terror: One Deadly Mission.\nCriminals hijack an airplane carrying five glamorous beauty contest finalists, but unknowingly they’ve also kidnapped a government agent carrying a dangerous virus that is to be used in bacterial warfare.\n\nOriginal title: The Night They Took Miss Beautiful (1977)\n\nDirector: Robert Michael Lewis\nWriter: Lou LaRose, George Lefferts\nStars: Gary Collins, Chuck Connors, Henry Gibson, Victoria Principal & also features 3 Playmates: Stella Stevens, Lillian Müller, and Rosanne Katon\nGenre: Drama, Thriller\n\n00:00 Full Movie (with subtitles)\n02:30 Annual beauty pageant competition hosted in Miami beach, showcasing finalists and their talents.\n07:49 A behind-the-scenes look at a beauty pageant competition and the challenges faced by the contestants.\n12:18 A dramatic event unfolds during a beauty pageant competition involving a missing flight and its consequences.\n20:15 Emergency landing due to cabin pressure issue leads to tense moments and eventual safe evacuation.\n28:46 Summary of a dramatic incident involving a missing airplane and FBI involvement.\n34:49 Discussion of a plan involving a ransom demand for the release of hostages and a possible escape.\n45:15 Comedic beauty pageant competition with unexpected consequences unfolds in a dramatic setting.\n52:11 A dangerous virus plot unfolds on a hijacked flight, putting the USA at risk of destruction.\n55:45 A group discusses a dangerous situation involving a virus and a missing man, leading to a potential threat to a friendly country.\n1:01:59 A dramatic conversation unfolds between characters discussing a plan involving a deserted base in the Keys.\n1:16:33 Drama unfolds as hostages are taken in a high-stakes situation, leading to negotiations and a potential rescue attempt.\n1:21:33 A tense negotiation unfolds as a plane hijacking plot is foiled, culminating in a dramatic showdown.\n1:31:14 Drama unfolds as a beauty pageant contestant faces danger and rescue in a thrilling sequence of events.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "VgzegGZKR6E",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:42.552Z"
}