{
  "imdbId": "youtube-L6e_HCmOGfw",
  "title": "John Wayne | Randy Rides Alone (1934, Western) Directed by Harry Fraser  | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L6e_HCmOGfw",
      "id": "L6e_HCmOGfw",
      "title": "John Wayne | Randy Rides Alone (1934, Western) Directed by Harry Fraser  | Colorized Movie",
      "description": "Ride alongside Randy as he faces danger, deceit, and the wild frontier alone.\nJailed for murders he didn't commit, Randy escapes only to stumble into the den of the real murderers.\n\nOriginal title: Randy Rides Alone (1934)\nThis movie is available with English, French & Spanish audio, and also subtitled in many more languages.\n\nBlack & White version: https://youtu.be/4PTADOuzv9M\n\n\nDirector: Harry L. Fraser \nWriters: Lindsley Parsons, Lindsley Parsons \nStars: John Wayne, Alberta Vaughn, George 'Gabby' Hayes \nGenre: Colorized, Action, Drama, Mystery, Romance, Western Movie\n\n\n00:00 Full Movie (with subtitles)\n00:08 A mysterious incident unfolds at a Western Saloon involving a sheriff, Randy, and a missing sum of money.\n13:12 A niece learns of her uncle's death and collaborates with authorities to seek justice.\n18:43 In a Western town, a lone ranger helps a fugitive escape, leading to a series of mysterious events.\n22:27 A search for clues leads to a deserted campsite and a potential suspect.\n28:41 The fugitive is taken in by a group of outlaws, who have their own agenda for keeping him with them.\n33:33 A man named Matt helps uncover the truth about missing money and a criminal gang \n34:50 The criminal gang tries to force cooperation to find the money.\n48:27 The main suspect is apprehended by the sheriff, and the truth is revealed, leading to the arrest of the real criminals.\n52:10 Matt is proven innocent and decides to leave with someone else.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:19.403Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/L6e_HCmOGfw/maxresdefault.webp",
      "duration": 3142,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:19.499Z"
}