{
  "imdbId": "youtube-WVhIjNPspV4",
  "title": "Forever with You (Geudae-wa yeong-wonhi)(1958)",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WVhIjNPspV4",
      "id": "WVhIjNPspV4",
      "title": "Forever with You (Geudae-wa yeong-wonhi)(1958)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00356\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00356\n\n감독(Director) : 유현목(Yoo Hyeon-Mok)\n출연 : 이룡,도금봉,최봉,최명수,최남현,이빈화,김승호,장민호\n\n줄거리 : 광필(이룡), 달수(최봉), 상문(최명수)은 소매치기를 하는 깡패 소년들이다. 빵집에서 일하는 애란(도금봉)과 광필은 소꿉친구로 서로 좋아하는 사이이다. 세 명의 깡패 소년은 미군 창고를 털다가 광필만 잡혀 소년원에 간다. 광필은 면회 온 애란이 술집에서 일한다는 말을 듣고 탈옥하여 그녀를 찾아간다. 애란을 만나다가 광필은 그를 잡으러온 형사를 차에 치게 하여 다시 감옥에 들어가 10년 만에 출소한다. 광필은 애란을 만나기를 기대하고 나오지만 그동안 보낸 편지와 소포는 신부가 된 상문이 보낸 것이었다. 그간 달수는 애란과 결혼하여 캬바레를 경영하며 암흑가 조직을 꾸리고 있었다. 광필은 병원에 누워있는 애란을 찾아가 그녀의 9살 된 딸 은지를 만난다. 광필은 은지가 자신의 딸이라 생각하지만 아무것도 할 수 있는 일이 없어 좌절한다. 달수의 조직은 살해한 밀수꾼의 시체가 떠올라 경찰의 추적을 받고, 달수의 사주를 받은 캬바레 마담은 사업을 하자며 광필을 인천으로 데려가다 경찰에 체포된다. 신부의 보증으로 풀려난 광필은 애란의 임종을 지키러 병원에 달려가지만 달수는 광필이 경찰에 밀고했다며 그를 죽이려 한다. 피투성이가 된 광필은 애란의 병실에 도착하지만 이미 그녀는 죽은 후였다. 광필과 딸 은주, 신부 상문만 세상에 남겨진다.\n\nCasts : Do Keum-Bong, Lee Yong, Choi Nam-Hyeon\n\nSYNOPSIS : Gwang-pil (Lee Ryong), Dal-su (Choi Bong) and Sang-mun (Choi Myeong-su) are gangster boys who pick pockets. Ae-ran (Do Geum-bong), who works at a bakery, and Gwang-pil have known each other from childhood and are lovers. The three gangster boys rob a US army warehouse, but only Gwang-pil is caught and placed in a juvenile reformatory. Hearing that Ae-ran works as a barmaid, Gwang-pil escapes from the reformatory to see her. While Gwang-pil meets her, he is caught by a cop who has been chasing him. He is sent back to prison. Ten years later he is discharged. Expecting to meet Ae-ran, Gwang-pil realizes that the letters and parcels were sent by Sang-mun, who had become a priest. Dal-su, who had married Ae-ran, and became a boss in the underworld, runs a nightclub. Gwang-pil visits Ae-ran at a hospital and meets her 9-year-old daughter, Eun-ji. He suspects that she is his own daughter, but he is helpless because there is nothing he can do. Dal-su and his followers are wanted, because the body of someone his men had killed rises to the surface. The manageress of his nightclub is arrested. While under the order of Dal-su, she proposes to do business with her and takes Gwang-pil to Incheon. With the guarantee of the priest, Gwang-pil is released and goes to the hospital to be present at Ae-ran's deathbed. But Dal-su tries to kill Gwang-pil because he misunderstands him. Bloodstained, Gwang-pil arrives at the hospital, but she has died. Gwang-pil, Eun-ji and Sang-mun are left behind.",
      "addedAt": "2025-12-26T00:24:25.070Z",
      "thumbnail": "https://i.ytimg.com/vi/WVhIjNPspV4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDS-IWy_x7dTeH0p_CaQKZ4JgWs7Q",
      "duration": 6607,
      "language": "ko",
      "year": 1958,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:25.164Z"
}