{
  "imdbId": "youtube-E39xP0vaBbQ",
  "title": "The Hooligan Murders: This Cop Is a Bastard (KRIMI THRILLER | Unzensiert exklusiv für Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E39xP0vaBbQ",
      "id": "E39xP0vaBbQ",
      "title": "The Hooligan Murders: This Cop Is a Bastard (KRIMI THRILLER | Unzensiert exklusiv für Members)",
      "description": "THE HOOLIGAN MURDERS: THIS COP IS A BASTARD (2013)\nOriginaltitel: The Fall of the Essex Boys\nMit: Nick Nevern, Jay Brown, Robert Cavanah, Peter Barrett, Simon Phillips\nRegie: Paul Tanter\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDer verdeckte Ermittler Darren Nichols (Nick Nevern, \"Terry\") verfolgt eine heiße Spur. Er ist einer Bande von Schmugglern auf den Fersen. Die Gauner um Anführer Mickey Steele (Robert Cavanah, \"Sahara\") schmuggeln im großen Stil illegale Partydrogen über die Nordsee und verticken sie in der Clubszene. Um ihre Geschäfte unbehelligt durchführen zu können und sich ihre Macht zu sichern, schrecken die Männer auch vor Mord nicht zurück. Doch dann wird die Tochter eines Kollegen von Inspektor Phil Stone (Ewan Ross, \"The Hooligan Wars\") tot aufgefunden. Indizien führen zu den Essex Boys und die Jagd auf die Schmuggler wird zu einem brutalen Rachefeldzug. Hinzu kommt es zu internen Unstimmigkeiten zwischen den Gangmitgliedern, Paranoia und Misstrauen breiten sich aus. Eine explosive Mischung, die nur auf den Funken wartet.\n#Netzkino #ganzerFilm #Thriller\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "addedAt": "2025-12-24T00:00:46.495Z",
      "thumbnail": "https://i.ytimg.com/vi/E39xP0vaBbQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCsM4uIP0z8SIH0aOjJNX4FXC2-8w",
      "duration": 5229,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:00:46.495Z"
}