{
  "movieId": "youtube-ZBHL4zV6sko",
  "title": "Bekas – Das Abenteuer von zwei Superhelden (ABENTEUERFILM ganzer Film auf Deutsch, Road Movies)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZBHL4zV6sko",
      "id": "ZBHL4zV6sko",
      "title": "Bekas – Das Abenteuer von zwei Superhelden (ABENTEUERFILM ganzer Film auf Deutsch, Road Movies)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Dieser angenehm andere Road-Movie-Abenteuerfilm zeigt zwei Brüder auf einer Reise zu einem scheinbar unerreichbaren Ziel. Dabei zeigt er, wie wichtig Zuversicht und Vertrauen sind, während die beiden Hauptdarsteller dem Zuschauer die Herzen brechen werden...\n\nBEKAS – DAS ABENTEUER VON ZWEI SUPERHELDEN (2012)\nOriginaltitel: Bekas\nMit: Zamand Taha, Sarwar Fazil, Diya Mariwan, Suliman Karim Mohamad\nRegie: Karzan Kader\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nKurdistan, Irak 1990. Die Brüder Zana (7) und Dana (10) leben als Waisenkinder auf den Straßen des von Saddam Hussein regierten Landes. Als eines Tages ‘Superman’ im örtlichen Kino gezeigt wird, klettern die beiden auf ein Dach, um einen Blick auf den größten Helden aller Zeiten zu erhaschen. Von da an wird Amerika zur ‘Stadt ihrer Träume’, einem magischen Ort, an dem sie unbedingt leben wollen. Doch um eine solche Reise zu wagen, braucht man Pässe und viel Geld. Die Situation scheint aussichtslos. Schließlich machen sich Dana (Sarwar Fazil) und Zana (Zamand Taha) auf dem Rücken eines Esels namens Michael Jackson mit einer Landkarte, einem wertlosen Medaillon, Brot und Wasser auf den Weg. Die staubige, triste Straße zur Grenze birgt jedoch Hindernisse und Gefahren, die die Beziehung der Brüder auf eine harte Probe stellt. Werden die beiden einen Weg über die streng bewachte Landesgrenze finden und ihren Traum verwirklichen können?\n#Netzkino #ganzerFilm #abenteuer\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:47:17.409Z",
      "thumbnail": "https://i.ytimg.com/vi/ZBHL4zV6sko/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAD4W1Gb4rGTQhBRcwBlNIQvMOMqw",
      "duration": 5541,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}