{
  "imdbId": "youtube-qjSAUzPH_kU",
  "title": "John Carradine | The Cosmic Man 1959 (Sci-Fi, Thriller) Directed by Herbert Greene | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qjSAUzPH_kU",
      "title": "John Carradine | The Cosmic Man 1959 (Sci-Fi, Thriller) Directed by Herbert Greene | Colorized",
      "description": "Invisible X-Ray Horror, here to spy on the Earth!\nA spherical UFO proves to contain one alien visitor. How to deal with him? Investigators disagree...\n\nOriginal title: The Cosmic Man (1959)\n\nBlack & White version: https://youtu.be/p1mLRCsSWKM\n\n\nDirector: Herbert S. Greene\nWriter: Arthur C. Pierce\nStars: John Carradine, Bruce Bennett, Angela Greene\nGenres: Adventure, Sci-Fi, Thriller\n\n\n00:00 Full Colorized Movie (with subtitles)\n02:07 Encounter with a mysterious Unidentified Flying Object from space\n03:29 Military \"intelligence\" agencies investigate, triggers speculation on antigravity technology and potential for space supremacy.\n10:41 Discussion on extraterrestrial craft discovery, collaboration between military and science, and theories on anti-gravity.\n12:10 Cathy & Kenny.\n17:03 Mysterious events unfold as military personnel encounter strange occurrences and discuss scientific theories.\n25:38 Encounter with an alien entity leads to fear and suspicion in a small town, as scientists try to understand its nature and intentions.\n41:42 Scientists study a mysterious sphere with potential for unlimited energy, while facing challenges.\n44:08 A group of scientists investigates a powerful sphere with potential destructive capabilities from outer space.\n53:50 Extraterrestrial cosmonaut warns Earth about the importance of developing new values and principles for future intergalactic interactions.\n55:54 A mysterious Cosmic Man poses a threat with unknown powers, leading to a race against time.\n1:02:37 A mysterious visitor interacts with a family, plays chess, and ultimately leaves Earth peacefully.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdab9LsjsyqpseqaKefjzFvQ",
      "id": "qjSAUzPH_kU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:41:55.044Z"
}