{
  "imdbId": "youtube-FY5dLZpUAQ8",
  "title": "Heathens & Thieves - Luck is with Evil (WESTERN FILM in German complete, Thriller)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FY5dLZpUAQ8",
      "title": "Heathens & Thieves - Luck is with Evil (WESTERN FILM in German complete, Thriller)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Den zwei Outlaws wird ihre Goldgier zum Verhängnis, als sich herausstellt, dass nicht nur sie, sondern gleich mehrere Schießwüterische hinter einem vermuteten Goldschatz her sind.\n\nHEATHENS & THIEVES - DAS GLÜCK IST MIT DEM BÖSEN (2012)\nOriginaltitel: Heathens and Thieves\nMit: Andrew Simpson, Gwendoline Yeo\nRegie: Megan Peterson, John Douglas Sinclair\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nNord-Kalifornien 1870: Das Gerücht, ein chinesischer Eisenbahn-Arbeiter sei mit gestohlenem Gold auf einer verlassenen Ranch untergetaucht, erregt die Gemüter. Als die beiden Wilderer Saul und Bill davon hören, schmieden die beiden Verzweifelten einen Plan: Saul, der jüngere von beiden, lässt sich bei dem chinesischen Farmer Zhen und seiner hübschen Frau Kun Hua, bei dem er den Schatz vermutet, als Landarbeiter anstellen - dabei ist ihm jeder Trick recht, um hinter das Geheimnis des Goldes zu kommen. Sauls Partner Bill dagegen wartet versteckt auf die passende Gelegenheit anzugreifen. Doch das Spiel geht nicht auf: Als plötzlich eine Handvoll zwielichtiger Männer aufkreuzen, die ebenfalls von dem gestohlenen Schatz erfahren haben, kommt es zu einigen heftigen Auseinandersetzung. Saul und Bill müssen sich eingestehen, dass sie sich noch viel übleren Männern als sich selbst stellen müssen ? wollen sie das riskante Spiel aus Bluff und Verrat nicht nur überleben, sondern am Ende auch das Gold in ihren Besitz bringen, müssen sie ihre Pläne ändern.\n#Netzkino #ganzerFilm #western \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "FY5dLZpUAQ8",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}