{
  "imdbId": "youtube-_8c_H_lUMxo",
  "title": "Amazing Mr. Callaghan (1955, Thriller) Anthony Wright, Lysiane Rey, Colette Ripert | French Film",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_8c_H_lUMxo",
      "title": "Amazing Mr. Callaghan (1955, Thriller) Anthony Wright, Lysiane Rey, Colette Ripert | French Film",
      "description": "Dangerous! Deadly!\nA ship, La Circé, has sunk, and it might be criminal. The vessel belongs to Storata, who is asking the insurance company for one hundred million Francs. Callaghan works for them, and he investigates on dry land and at sea. The brilliant detective discovers that Storata has deliberately sunk his own ship to defraud the insurance company.\n\nColorized version: https://youtu.be/CbY1a7DVXj8\n\n\nOriginal title: À toi de jouer... Callaghan!!! (1955) AKA: Amazing Mr. Callaghan / Beside Murder\nThis film is available in French and subtitled in many languages.\n\nDirector: Willy Rozier\nWriters: Willy Rozier, Peter Cheyney\nCast: Antony Wright, Lysiane Rey, Raymond Cordy, Paul Cambo\nGenres: Classics, French cinema, Crime, Drama, Thriller\n\nNEXT UP Followed by: Plus de whisky pour Callaghan! / No more whiskey for Callaghan! (1955) https://youtu.be/HyZljA0mbzc\n\n\n00:00 Full Movie (with subtitles) \n02:07 Mysterious thriller involving a multilingual man named Callaghan and his encounters in France.\n11:07 High-stakes poker game unfolds at a luxurious casino involving Mr. Morrison and Viscount Raoul de Bois-Joly.\n18:14 Mystery unfolds as detective Slim Callaghan investigates a gambling den and a colonel's debt issue.\n26:33 Mr. Callaghan investigates a suspicious boat sinking and uncovers a deadly conspiracy.\n36:07 Characters discuss a possible suicide or murder, insurance policies, and large sums of money.\n43:17 Mysterious events unfold as a private detective uncovers a criminal scheme involving a boss named Storata and a mysterious figure Barton.\n50:24 Mysterious detective investigates murder conspiracy involving insurance fraud and a gang leader in a French thriller film.\n58:03 Mysterious events unfold as characters navigate through deception, betrayal, and hidden motives.\n1:16:40 Mysterious events unfold as characters uncover a complex plot involving deception and murder.\n\n@CultCinemaClassics",
      "id": "_8c_H_lUMxo",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:27.364Z"
}