{
  "imdbId": "youtube-Xc_Ou65Y334",
  "title": "비오는 날의 오후 3시 (1959) / Three o'clock P.M. in a rainy day (Bi-oneun nal-ui ohusesi)",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xc_Ou65Y334",
      "title": "비오는 날의 오후 3시 (1959) / Three o'clock P.M. in a rainy day (Bi-oneun nal-ui ohusesi)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00525\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00525\n\n감독(Director) : 박종호(Park Jong-Ho)\n출연 : 김지미, 최무룡, 최지희, 남양일, 이빈화, 남궁원, 김동원, 황정순, 복혜숙, 김칠성, 장인혜, 손시향  특별출연 역, 박재란  특별출연 역, 이민   \n\n줄거리 : 미국교포인 헨리 장(이민)과 전쟁으로 약혼자를 잃은 안수미(김지미), 수미의 약혼자 인규(최무룡)를 중심으로 펼쳐지는 삼각관계를 다루고 있다. 고아인 안수미는 약혼자 인규를 통해 가족을 얻는다. 그러나 전쟁에 나갔던 인규의 사망소식과 함께 그 가족은 사라지고 절망에 빠진 수미는 우연히 미국교포로 미 8군에서 군목부장으로 있던 헨리 장을 만나면서 새로운 삶을 얻게 된다. 그러나 그와의 행복도 잠시, 그들의 결혼식 날 죽은 줄만 알았던 인규가 돌아오면서 그녀는 헨리에게 아무런 설명도 없이 사라지고 만다. 평소 헨리 장에게 호감을 갖고 있던 인규의 동생 인숙(최지희)이 헨리를 집으로 초대하면서 그 둘은 재회하게 되고, 수미는 심한 갈등에 빠진다. 결국 둘 중 어느 누구도 선택하지 못했던 수미는 갑작스러운 심장병으로 죽어간다.\n\nCasts : Kim Ji-mee ,Choi Moo-ryong ,Choi Ji-hee ,Nam Yang-il ,Lee Bin-hwa ,Nam Koong Won ,Kim Dong-won ,Hwang Jung-seun ,Bok Hye-suk ,Kim Chil-seong ,Jang In-hye\n\nSYNOPSIS : This film is about a love triangle between Korean-American Henry Jang (Lee Min), Su-mi (Kim Ji-mi), and her fiance, In-gyu. Su-mi, an orphan, is granted a new family that of her fiance, In-gyu. When In-gyu joins the Army and is reported dead in battle, it drives Su-mi into despair. She, however, soon meets a new love, Henry, who is serving as a chaplain in the American army stationed in Korea. But on their wedding day, In-gyu suddenly reappears and Su-mi vanishes without giving any explanation to Henry. When In-gyu's sister, who has a crush on Henry, invites him to her home, Su-mi runs into Henry once again. Su-mi cannot decide between the two men, and complicating matters, she is dying of heart disease.",
      "id": "Xc_Ou65Y334",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:23:08.067Z"
}