{
  "imdbId": "youtube-MT0_EKqYjhk",
  "title": "Village of Haze (Angemaeul)(1982)",
  "year": 1982,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MT0_EKqYjhk",
      "title": "Village of Haze (Angemaeul)(1982)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03674\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03674\n\n영화글 : https://www.kmdb.or.kr/story/5/1324\n\n감독(Director) : 임권택(Im Kwon-Taek)\n출연 : 정윤희(수옥),안성기(깨철),박지훈,진봉진,오영화,이예민,김지영(마을 아낙),조남경,최동준(마을 주민),조인선,주상호(마을 주민),조학자,곽은경,김기범,양일민,나정옥,홍동은,권일정,고설봉,오중근,장정국,안진수,신양균,이재학,임옥경,최상호,김진,정규영,태일,성명순,한명환,이석구,김경란,양춘\n\n줄거리 : 수옥(정윤희)은 두메산골의 초등학교로 발령받아 서울에서 내려온다. 수옥은 동네 어귀 버스 정류장에서 처음 본 남루한 차림의 깨철(안성기)에게서 섬뜩한 느낌을 받는다. 그녀는 동족부락인 이 마을에서 이방인인 깨철에게 마을 여자들이 밥도 주고 잠자리도 제공해주는 것을 보고 그의 존재에 대해 관심을 갖게 된다. 그러던 어느 날 동네 남자 중 하나인 화천이 깨철이 자신의 처와 간통했다며 깨철을 구타하는 사건이 발생한다. 동네 남자들은 성불구자인 깨철이 어떻게 간통을 하냐며 사실을 부인한다. 수옥은 마을여자들과 깨철의 성적관계를 의심하던 중 술집여자인 산월을 시켜 깨철이 성불구자임을 확인한다. 그러나 얼마 후 한 동네 아낙이 옥수수 밭에서 정사를 벌이는 모습을 목격하게 되고, 집성촌이자 모두가 친척관계로 얽혀 있는 이 마을에서 도시와 같은 익명성을 보장해주지 못하는 마을의 성격에 대해 생각해본다. 동네 남자들은 술집의 벙어리 처녀 산월과의 관계를 통해 성적 욕구를 해소하지만, 도덕성과 전통을 강조하는 폐쇄적인 마을에서 마을 여자들에게 억압된 성적 욕망도 풀고 익명성도 보장해줄 수 있는 인물은 깨철이 뿐이었다는 사실을 알게 된다. 깨철은 동족부락을 유지하도록 만드는 존재였던 것이다.\n동네 사람들 중 하나인 동료교사를 통해 자신의 의심을 확인한 수옥은 호기심이 충족되자 깨철에게서 관심이 멀어져가던 중, 서울에서 약혼자 영훈이 내려온다는 소식을 접한다. 수옥은 큰 기대에 차 기차역으로 달려 나가지만, 며칠을 역에 나가 기다려도 영훈은 오지 않는다. 크게 상심한 수옥은 비오는 날 우연히 방앗간에서 깨철을 만나게 되고, 깨철에게 거의 강간을 당하다시피 정사를 나누게 된다. 수옥은 영훈을 기다리며 눌려있던 성적 욕구가 깨철을 통해 분출됨을 느낀다. 얼마 후 수옥은 영훈과의 결혼을 위해 마을을 떠나게 된다. 수옥을 배웅 나온 새로 부임해온 여선생은 동네 어귀에 앉아 있는 예사롭지 않은 깨철을 수옥이 그랬던 것처럼 섬뜩함을 느끼며 바라본다. 수옥은 깨철의 존재를 알려주려다가 그만두고 떠난다.\n\nCasts : Jeong Yun-Hee, Ahn Seong-Ki, Lee Ye-Min, Kim Ji-Young, Park Ji-Hun\n\nSYNOPSIS : Su-ok's first post is at an elementary school at a mountain village. In tattered rags, Kae-chul stands at the village entrance with a strange glint in his eyes. There is something frightening about him. Kae-chul is a stranger in the village. One day, Hwa-chun beats Kae-chul up saying that he's rape his wife. All the villagers say that Kae-chul is impotent. Su-ok goes to greet her fiancee one day. When he doesn't come, Su-ok returns disheartened. She goes into an oil warehouse to escape the rain. There, Su-ok is drawn to Kae-chul and they make love. The villagers completely ignore Kae-chul and his presence is hardly felt in the village. The day Su-ok leaves, a newly appointed female teacher arrives, seeing the brightly lit eyes of Kae-chul.",
      "id": "MT0_EKqYjhk",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:24:34.697Z"
}