{
  "imdbId": "youtube-Vi0HBVLqNWQ",
  "title": "Sabaka (1954, Adventure) Boris Karloff, Nino Marcel, June Foray | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vi0HBVLqNWQ",
      "title": "Sabaka (1954, Adventure) Boris Karloff, Nino Marcel, June Foray | Movie",
      "description": "You'll Never Forget the Thundering Feet of 150 Elephants! The Wild-Eyed Terror of a Mad Buffalo Stampede!\nIn India, a fearless young elephant trainer is on a quest for revenge against a ruthless cult that murdered his family. When the local Maharajah turns a blind eye, he sets out alone, accompanied by his trusty allies - an elephant and a tiger, to take down a fiery cult that threatens their land. Will vengeance be his or will the cult's flames engulf all they hold dear?\"\n\nOriginal title: Sabaka (1954) AKA: The Hindu\n\nThis film is subtitled in many languages\n\nDirector & Writer: Frank Ferrin\nStars: Nino Marcel, Boris Karloff, Lou Krugman, June Foray\nGenre: Action & Adventure, Classics\n\n\n00:00 Full Movie (with subtitles)\n02:58 Mysterious encounters with a fire demon lead to consequences in a jungle village.\n09:26 A Maharajah helps a low-caste man rebuild his life after a fire, while dealing with evil worshippers and a loose tiger.\n21:23 Plot summary of a 1954 adventure film involving a village, fire demon worshipers, and a tiger named Taku.\n27:45 A plot to incite fear and chaos during a festival leads to a confrontation with the military.\n34:46 A man seeks justice for his sister's murder during a festival, facing challenges and suspicions.\n38:56 Intrigue and betrayal unfold during a sacred Hindu ceremony, leading to a confrontation and capture of a suspected murderer.\n51:31 Intrigue unfolds as a man is wrongfully accused of being a fire demon worshiper in the movie Sabaka (1954).\n56:18 Adventure unfolds as Gunga embarks on a dangerous journey to save his elephant Teela from a fire demon cult.\n1:07:52 Deception leads to a deadly plan to sacrifice an elephant in a village, but the truth is revealed.\n\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "Vi0HBVLqNWQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:07.477Z"
}