{
  "imdbId": "youtube-luHarTc90QA",
  "title": "The Irony of Fate, Part Two | ROMANTIC COMEDY",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=luHarTc90QA",
      "id": "luHarTc90QA",
      "title": "The Irony of Fate, Part Two | ROMANTIC COMEDY",
      "description": "Part One: https://youtu.be/ms5Ga6kNvHM\n\nOn December 31, the American version of the Russian film \"The Irony of Fate, or Enjoy Your Bath!\" Will be released on the Netflix platform. Here is the original story of the Soviet director Eldar Ryazanov. Favorite New Year movie of all Russians!\n\nSECOND EPISODE. The Irony of Fate, or Enjoy Your Bath! is a 1976 Soviet romantic comedy television film directed by Eldar Ryazanov. The screenplay was written by Emil Braginsky and Ryazanov, loosely based on the director's 1971 play, Once on New Year's Eve. Filmed in 1975 at the Mosfilm Studios, The Irony of Fate doubles as a screwball comedy and a love story tinged with sadness. It was one of the most successful Soviet television productions and remains a highly popular New Year's Eve classic in Russia and the post-Soviet states, with millions tuning in to rewatch it every New Year's Eve.\n\nThe key subplot is the drab uniformity of Brezhnev-era public architecture. This setting is explained in a humorous animated prologue, in which architects are overruled by politicians and red tape. As a result, the identical, functional but unimaginative multistory apartment buildings found their way into every city, town, and suburb across the Soviet Union.\n\nFollowing their annual tradition, a group of friends meet at a banya (a traditional public \"sauna\" bath) in Moscow to celebrate New Year's Eve. The friends all get very drunk toasting the upcoming marriage of the central male character, Zhenya Lukashin (Andrey Myagkov) to Galya (Olga Naumenko). After the bath, one of the friends, Pavlik (Aleksandr Shirvindt), has to catch a plane to Leningrad. Zhenya, on the other hand, is supposed to go home to celebrate New Year's Eve with his fiancée. Both Zhenya and Pavlik pass out. The remaining friends cannot remember which person from their group is supposed to catch the plane. They mistakenly send Zhenya on the plane instead of Pavlik.\n\nYear of production: 1976\n\nDirected by: Ryazanov Eldar\nWrited by: Ryazanov Eldar, Braginsky Emil\nMusic: Mikael Tariverdiev\nOperator: Nakhabtsev Vladimir\nProduction designer: Borisov Alexander\nStarring: Dobrzhanskaya Lyubov, Akhedzhakova Leah, Myagkov Andrey, Yakovlev Yuri, Brylska Barbara, Naumenko Olga, Belyavsky Alexander, Burkov Georgy, Roninson Gotlib, Sokolova Lyubov, Talyzina Valentina, Shirvindt Alexander\n\n#About_fate #Netflix #New_Year_movie #romantic_comedy #USSR",
      "addedAt": "2025-12-23T03:45:36.538Z",
      "thumbnail": "https://i.ytimg.com/vi/luHarTc90QA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDR_O9XmOirRaB6D1ospyrHNo5ybQ",
      "duration": 5065,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T03:45:36.538Z"
}