{
  "imdbId": "youtube-6pHzELxQ1Qk",
  "title": "Johnny Cash | The Pride of Jesse Hallam (1981, Drama) directed by Gary Nelson | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6pHzELxQ1Qk",
      "title": "Johnny Cash | The Pride of Jesse Hallam (1981, Drama) directed by Gary Nelson | Full Movie",
      "description": "When illiterate coal miner Jesse Hallam uproots his life from Kentucky to Cincinnati for his daughter's critical surgery, he faces unexpected hurdles in the city, notably his inability to read. Determined to provide for his family, he sells their farm and embarks on a brave quest to learn to read, write, and ultimately graduate from high school, all to secure his daughter's well-being.\n\nOriginal title: The Pride of Jesse Hallam (1981)\n\n\nThis film is subtitled in many languages.\n\nDirector: Gary Nelson\nWriter: Suzanne Clauser\nStars: Johnny Cash, Brenda Vaccaro, Ben Marley, Eli Wallach\nGenres: Classics, Cult Film, Drama\n\n\n00:00 Full Movie (with subtitles)\n00:46 A father seeks medical treatment for his daughter and enrolls his son in a new school while looking for a job.\n14:33 A father struggles to balance work, family, and his son's upcoming surgery amidst challenges and setbacks.\n23:24 Struggling father fights for son's education while working as a lumper in a produce market.\n29:44 Illiterate father works at a market to support sick daughter, faces challenges, and seeks help to learn to read and write.\n38:18 Challenges of adult illiteracy and the journey of learning to read through dedicated practice.\n47:40 Struggling adult learner Jesse Hallam gets help from teacher Mariana Galucci in learning to read using the Laubauch System.\n56:54 A father reads to his daughter, struggles with getting a driver's license, and reminisces about fishing trips.\n1:02:54 A heartwarming story of a boy adapting to a new life, finding joy in books, fishing, and family bonds.\n1:12:01 A father encourages his son to pursue education despite challenges in reading, fostering pride and hope for the future.\n1:18:50 A father struggles with illiteracy and his children's education, facing challenges and making tough decisions.\n1:29:58 Determination to overcome illiteracy and pursue education despite challenges.\n\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "6pHzELxQ1Qk",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:40.651Z"
}