{
  "movieId": "youtube-mv7KKlrG1j0",
  "title": "One Child’s Christmas Miracle | Finding Santa: A Christmas Adventure | Full Family Christmas Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mv7KKlrG1j0",
      "id": "mv7KKlrG1j0",
      "title": "One Child’s Christmas Miracle | Finding Santa: A Christmas Adventure | Full Family Christmas Movie",
      "description": "One Child’s Christmas Miracle | Finding Santa: A Christmas Adventure | Full Family Christmas Movie - Eight year old Julius lives at an orphanage and secretly believes in Santa Claus until he loses not only his belief in Santa but also himself. But then something strange happens, and suddenly Julius finds himself in a magic world.\n\nWatch Finding Santa: A Christmas Adventure, a full Hallmark Christmas movie where eight-year-old Julius, living in an orphanage, struggles with losing his belief in Santa Claus and himself. But when something magical occurs, he is transported to a wondrous world full of holiday magic and adventure. Perfect for fans of Hallmark Christmas movies, magical holiday films, full free Hallmark Christmas movies, heartwarming festive stories, and enchanting winter adventures, Finding Santa: A Christmas Adventure delivers wonder, joy, and the true spirit of Christmas for the whole family.\n\nStars: Dennis Storhøi, Bodil Jørgensen, Flora Ofelia Hofmann Lindahl\n*Licensed from Tri Coast. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-26T23:59:25.681Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/mv7KKlrG1j0/maxresdefault.webp",
      "duration": 4863,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:25.736Z"
}