{
  "imdbId": "youtube-bmHFoKFsxjQ",
  "title": "JET LI in DIE LEGENDE DER WEISSEN SCHLANGE (Martial Arts Actionfilm auf Deutsch, ganzer Actionfilm)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bmHFoKFsxjQ",
      "title": "JET LI in DIE LEGENDE DER WEISSEN SCHLANGE (Martial Arts Actionfilm auf Deutsch, ganzer Actionfilm)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein atemberaubendes und fantastisches Actionspektakel von Siu-Tung Ching (\"A Chinese Ghost Story 1-3\", \"Das Königreich der Yan\"). Basierend auf einer alten chinesischen Volkssage glänzt das Movie mit rasanten Martial-Arts-Szenen, die bis zur letzten Minute fesseln. Sehen Sie eine chinesische Action-Produktion der Extraklasse – und Superstar JET LIi in einer seiner aufregendsten Rollen.\n\nDIE LEGENDE DER WEISSEN SCHLANGE (2011)\nOriginaltitel: Bai she chuan shuo\nMit: Jet Li, Shengyi Huang, Raymond Lam\nRegie: Siu-Tung Ching\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nAls Kräutersammler Xu Xian (Raymond Lam) in Lebensgefahr gerät, eilt ihm eine geheimnisvolle Schöne (Eva Huang) zur Hilfe. Diese entpuppt sich jedoch als keine gewöhnliche Frau, sondern als ein Schlangendämon, welcher in Gestalt einer Frau auftritt – White Snake. Die Beiden verlieben sich Hals über Kopf ineinander. Doch ihr Glück währt nur kurz, denn eine mysteriöse Seuche bricht über das Land herein und stürzt es in ein Chaos. White Snake hilft erneut, indem sie ihre Kräfte einsetzt, um ein Heilmittel für die leidende Bevölkerung zu kreieren. Das ruft den mächtigen Zauberer Fa Hai (Jet Li) auf den Plan. Er hält die Magie White Snakes für böse und will die Dämonenfrau vernichten. Es kommt zum Showdown, zum Kampf auf Leben und Tod...\n#Netzkino #ganzerFilm #JetLi\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "bmHFoKFsxjQ",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "martial-arts",
      "name": "Martial Arts"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}