{
  "movieId": "youtube-yhfonOg-kTY",
  "title": "ARACHNID - Spinnen-Horrorfilm - Abenteuer, Horror - Ganzen Film kostenlos schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yhfonOg-kTY",
      "id": "yhfonOg-kTY",
      "title": "ARACHNID - Spinnen-Horrorfilm - Abenteuer, Horror - Ganzen Film kostenlos schauen bei Moviedome",
      "description": "*GANZER FILM - Horrorfilm mit Monster-Spinne*\n\nDen Spielfilm „Arachnid“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Arachnid“:\nIMDb: *4* von 10\nAmazon: *3,4* von 5\n\n*Die Handlung von „Arachnid“*\nAuf einer kleinen Insel im Südpazifik treibt ein mutiertes Spinnenmonster sein Unwesen. Eine Gruppe von Forschern, Abenteurern und Soldaten kämpft mit aller Macht gegen das Ungeheuer und ums eigene Überleben.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Arachnid“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #KriegsDrama #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Arachnid\nLaufzeit: 95 Minuten\nRegie: Jack Sholder\nFSK: 16\nErstveröffentlichung: 2001\n\n\n*Das sind die Schauspieler*\nChris Potter (bekannt aus „Der Babynator\", \"Heartland\")\nin der Rolle des Lev Valentine\nAlex Reid (bekannt aus „The Descent - Abgrund des Grauens\")\nin der Rolle der Loren Mercer\nJosé Sancho (bekannt aus \"Spricht mit ihr\", \"Live Flesh - Mit Haut und Haar\")\nin der Rolle des Dr. Samuel Leon\nNeus Asensi (bekannt aus \"Das Mädchen deiner Träume\")\nin der Rolle der Susana\n\n\n*Die Handlung und Szenen von „Arachnid“* \nUnter Leitung von Dr. Samuel Leon (José Sancho) bricht eine Expedition zu einer Insel auf. Zu der Truppe gehören neben der Pilotin Mercer (Alex Reid), auch der Wissenschaftler Henry Capri (Ravil Isyanov), ein paar Gehilfen und der Einheimische Toe Boy (Robert Vicencio), der als Führer durch das Areal dienen soll. Hintergrund der Expedition sind ein paar Todesfälle auf der Insel, für die es bis dahin keine Erklärung gibt. Schon kurz nach dem die Gruppe ihr Reiseziel unsanft erreicht hat, das Flugzeug musste notgelandet werden, häufen sich merkwürdige Zwischenfälle, die immer bedrohlicher werden. Das sorgt jedoch nicht dafür, dass sich die Expeditionsteilnehmer zurückziehen, sie wolle ihe Mission vielmehr weiterhin erfüllen. Doch dann machen sie eine grausige Entdeckung, die alles über den Haufen wirft, was sie geplant haben. Jetzt müssen sie kämpfen, um wenigstens das nackte Leben retten zu können.\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Arachnid“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:37.010Z",
      "thumbnail": "https://i.ytimg.com/vi/yhfonOg-kTY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCqljd-t6i-KdFUEgP-BdJaF3LJKQ",
      "duration": 5495,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:33:37.104Z"
}