{
  "imdbId": "youtube-rHeBO9PYryI",
  "title": "Everything you could wish for this Christmas (🎄FULL CHRISTMAS MOVIE in German, Romantic Comedies)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rHeBO9PYryI",
      "title": "Everything you could wish for this Christmas (🎄FULL CHRISTMAS MOVIE in German, Romantic Comedies)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n🎄 Heiter-romantische Festtags-Komödie für die ganze Familie: Kurz vor Weihnachten versucht eine junge Geschäftsfrau, die von der Schließung bedrohte größte Firma ihrer Heimatstadt zu retten. Amor eilt zur Hilfe. \n\nALLES WAS DU DIR ZU WEIHNACHTEN WÜNSCHST (2006)\nOriginaltitel: All she wants for Christmas\nMit: Monica Keena, Tobias Mehler, Steve Bacic\nRegie: Ron Oliver\nFSK: ohne Altersbeschränkung\n\nINHALTSANGABE:\nIn dem seltsamen kleinen Städtchen Forest City wird Weihnachten noch in Ehrfurcht gefeiert. Im Inneren der Stadt produziert die Firma Aikens Decorations den schönsten Weihnachtsschmuck im ganzen Land. Judith 'Noelle' Dunwoody, eine langjährige und sehr begabte Mitarbeiterin der Rechnungsabteilung, träumt von einem Umzug in eine Großstadt wie New York. Dort würde sie die Produkte von Aikens gerne professionell vermarkten. Als ein mysteriöser Fremder in Forest City auftaucht und als Arbeiter bei Aikens anfängt, verdichten sich die Gerüchte, dass die Firma geschlossen werden soll. Nun beginnt für Noelle und die Gemeinde der kleinen Stadt der Kampf um die Existenz und den wahren Sinn von Weihnachten.\n#Netzkino #ganzerFilm #Weihnachten\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "rHeBO9PYryI",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.125Z"
}