{
  "movieId": "youtube-4RkGHF118t0",
  "title": "The Incredible Petrified World (1959, Thriller) John Carradine, Robert Clarke | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4RkGHF118t0",
      "id": "4RkGHF118t0",
      "title": "The Incredible Petrified World (1959, Thriller) John Carradine, Robert Clarke | Movie",
      "description": "Terror at the center of the Earth!\nFour people are trapped in a hidden underwater world after their diving bell malfunctions during an oceanic expedition. They must navigate unexpected dangers and challenges of survival in a dramatic situation.\n\nOriginal title: The Incredible Petrified World \n\nColorized version: https://youtu.be/JEw3loQDZQY\n\n\nThis film is available with subtitles in many language options.\n\nDirector: Jerry Warren\nWriter: John W. Steiner\nStars: John Carradine, Robert Clarke, Phyllis Coates \nGenres: Classics, Cult Film, Action, Adventure, Sci-Fi, Thriller\n\n\n00:00 Full Movie (with subtitles)\n00:21 Exploration of the mysterious depths of the ocean, revealing fascinating underwater creatures and phenomena.\n04:50 Exploration team prepares for deep-sea dive with high hopes and uncertainties.\n10:58 Facing challenges in deep sea expedition, risking their lives due to technical failure.\n15:49 Exploration of underground caves leads to dangerous discoveries and escape attempts.\n27:56 Explorers face challenges and make discoveries while navigating treacherous waters.\n37:11 Explorers trapped underwater encounter a mysterious man who has been there for 14 years.\n39:49 Discover a volcano and face uncertainty and danger as they plan their next move.\n44:45 Failed underwater bell experiment leads to personal sacrifice and realization.\n50:07 Exploration team faces challenges in underwater mission, relying on support to balance pressure and achieve success.\n56:16 Exploration team faces challenges and betrayal in underwater adventure.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:07.889Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/4RkGHF118t0/maxresdefault.webp?v=65f011ff",
      "duration": 3813,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:08.025Z"
}