{
  "imdbId": "youtube-bti9S4rRGTg",
  "title": "예라이샹(夜來香)(1966) / Yeraehyang (Yeraehyang) (1966)",
  "year": 1966,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bti9S4rRGTg",
      "title": "예라이샹(夜來香)(1966) / Yeraehyang (Yeraehyang) (1966)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01277\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01277\n\n영화글 : https://www.kmdb.or.kr/story/10/2032\n\n감독(Director) : 정창화(Chung Chang-wha)\n출연 : 신성일(조세영), 문정숙(이란), 최남현(박사장), 허장강(허상무), 주연(정숙)\n\n줄거리 : 법대 4학년인 조세영(신성일)은 4.19 때 부상을 입고 우연히 난희(문정숙)의 집으로 들어갔다가 나이트클럽의 마담인 연상의 그녀를 만나게 된다. 집도 부모형제도 없어 오갈 데 없는 자신에게 피까지 수혈해 주고 따뜻하게 보살펴주는 난희의 마음에 세영은 감동해 눈물 흘리고, 두 사람 사이에는 차츰 사랑이 싹튼다. 세영은 어느 부잣집의 가정교사로 들어가게 되는데, 그 집 딸 정숙(주연)으로부터 열렬한 구애를 받는다. 정숙은 난희에게 세영을 위해서라도 그를 양보하라고 말하지만 난희를 향한 세영의 마음은 흔들리지 않는다. 난희는 정숙의 아버지 박원혁(최남현) 사장이 일제시절 일본의 앞잡이로 활동했던 사람으로, 난희의 아버지를 죽게 하고 어머니까지 가로챈 자신의 원수라는 사실을, 상해에서 온 아버지의 친구로부터 듣게 된다. 난희는 나이트클럽의 파티에서 원수 박원혁을 죽이고 감옥에 수감된다. 정숙이 자신의 이복자매임을 알게 된 난희는 면회온 세영에게 이제 자신을 잊고 동생인 정숙을 사랑해 주라고 하고는 눈물을 흘리며 돌아선다. 교도소를 나선 세영은 `당신은 내 운명 위에 핀 아름다운 꽃 예라이샹이요. 다시 밝은 세상에서 만나는 날까지 부디 잘 있어요'라고 말하며 교도소 담길을 쓸쓸히 걷는다.\n\nCasts : Kang Shin-sung-yill, Moon Jeong-Suk, Choi Nam-Hyun, Heo Chang-kang, Ju Yeon\n\nSYNOPSIS : A self-supporting student injured during the 4. 19 Student Uprising gets help from an woman of his senior, a mistress at a night club. They fall in love with each other. Meanwhile, he becomes a private tutor for a rich family, and his student falls madly in love with him. But he has not wavered a bit. To get him to marry their daughter, the rich family throws a party and invites the mistress. They divulge her background in front of all the guests. Humiliated, the mistress runs away from the house and dies in a car accident.",
      "id": "bti9S4rRGTg",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw",
      "regionRestriction": {
        "blocked": [
          "BY",
          "RU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:42.535Z"
}