{
  "imdbId": "youtube-P2LWhfDvDNA",
  "title": "A Storybook Christmas (CHRISTMAS COMEDY full movie free, comedy full length new)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=P2LWhfDvDNA",
      "id": "P2LWhfDvDNA",
      "title": "A Storybook Christmas (CHRISTMAS COMEDY full movie free, comedy full length new)",
      "description": "🎄 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Eventplanerin Celeste staunt, als ein Mann als Nanny für ihre Nichte anheuert. Doch bald erkennt sie, dass er nicht nur das ideale Kindermädchen, sondern auch ihre Weihnachtsliebe sein könnte.\n\nWEIHNACHTEN WIE IM BILDERBUCH (2019)\nOriginaltitel: A Storybook Christmas\nMit: Ali Liebert, Jake Epstein, Habree Larratt\nRegie: Curtis Crawford\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nEvent-Planerin Celeste Everette (Ali Liebert) hat vor den Feiertagen jede Menge beruflichen Stress. Daher befürchtet sie, sich nicht genügend um ihre junge Nichte Finley (Habree Larratt) kümmern zu können, die kürzlich ihre Eltern verloren hat. Deshalb ruft sie eine Agentur an und engagiert für die Kleine eine Nanny, die bis zum Jahresbeginn bei ihnen einziehen soll. Diese entpuppt sich überraschenderweise als ein Mann namens Taylor (Jake Epstein) und Celeste ist zunächst nicht wirklich begeistert. Da sie so kurzfristig jedoch keinen Ersatz bekommen kann, bleibt ihr nichts anderes übrig, es – trotz seiner auf sie reichlich seltsam wirkenden Methoden – mit Taylor zu versuchen. Es dauert nicht lange und Celeste realisiert, dass sie in ihm nicht nur den einzig richtigen Kinderbetreuer für Finley, sondern vielleicht auch die perfekte Weihnachtsliebe für sich selbst gefunden haben könnte.\n#Netzkino #ganzerFilm #weihnachtsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-23T23:48:35.462Z",
      "thumbnail": "https://i.ytimg.com/vi/P2LWhfDvDNA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDLDr1lRtA4QFuk-v7IcGlS-6nuuA",
      "duration": 4766,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T23:48:35.462Z"
}