{
  "movieId": "youtube-LU0llubfGts",
  "title": "Film-Noir | The Strange Love of Martha Ivers 1946 | Barbara Stanwyck, Kirk Douglas | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LU0llubfGts",
      "id": "LU0llubfGts",
      "title": "Film-Noir | The Strange Love of Martha Ivers 1946 | Barbara Stanwyck, Kirk Douglas | Full Movie",
      "description": "Fate drew them together... and only murder could part them!\nA man is reunited with his childhood friend and her husband, who believe he knows the truth about the death of her rich aunt years earlier. \n\nOriginal title: The Strange Love of Martha Ivers (1946)\n\nColorized version: https://youtu.be/AEoa2y-RGMY\n\nDirector: Lewis Milestone \nWriters: Robert Rossen, John Patrick\nStars: Barbara Stanwyck, Van Heflin, Lizabeth Scott, Kirk Douglas \nCostumes: Edith Head\nGenre:  Classics, Action, Drama, Film-Noir, Romance\n\nThis video is available subtitled in more than 30 languages. Click on ⚙️ and choose your preferred language. \n\n\n00:00 Full Movie\n06:04  Martha Ivers is brought back to her wealthy aunt's house after attempting to run away multiple times, and their strained relationship becomes evident during a heated argument.\n10:11  A small town is shaken by a mysterious death and the potential involvement of a young couple.\n20:09  Two strangers meet in a small town and have a conversation about their past and future plans.\n31:07  A couple discusses their troubled relationship and the impact of their past on their present.\n37:45  Two strangers meet at a hotel and strike up a conversation.\n49:28  Sam Masterson visits Walter O'Neil and asks for his help in getting a girl named Toni Marachek out of jail, revealing his past as a gambler.\n55:37  Martha and Sam reminisce about their past relationship and Martha's marriage to Walter.\n1:02:42  Toni Marachek is released from jail but is confronted by a district attorney who threatens to send her back unless she cooperates.\n1:12:45  A man named Sam Masterson gets involved in a blackmail scheme and confronts Walter O'Neil, who hired someone to attack him. Martha, Walter's wife, is caught in the middle.\n1:22:08  A man named Sam meets with Mr. Masterson to discuss a potential partnership in a factory.\n1:28:41  Martha confesses her involvement in a crime and her fear of Walter's control.\n1:38:35  A couple's toxic relationship escalates, leading to a tragic outcome.\n1:48:12  Martha and Walter plot to frame Sam for murder and escape punishment for their crimes.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:42:41.317Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/LU0llubfGts/maxresdefault.webp?v=659e1a90",
      "duration": 6878,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:42:41.449Z"
}