{
  "imdbId": "youtube-Fm229Xcte1A",
  "title": "Jet Li - Kung Fu Cult Master (ACTION ABENTEUER ganzer Film Deutsch, Action Filme Deutsch komplett)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Fm229Xcte1A",
      "title": "Jet Li - Kung Fu Cult Master (ACTION ABENTEUER ganzer Film Deutsch, Action Filme Deutsch komplett)",
      "description": "💙 Filme komplett auf Deutsch & in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 90er-Jahre Action-Abenteuer mit Martial-Arts-Ikone JET LI (\"Fearless\" & \"The One\"): Nachdem seine Eltern umgebracht werden, begibt sich ein junger Held auf der Suche nach Rache und Ehre auf eine abenteuerliche Reise...\n\nKUNG FU CULT MASTER (1993)\nOriginaltitel: Yi tin to lung gei: Moh gaau gaau jue\nMit: Jet Li, Sammo Kam-Bo Hung, Sharla Cheung, Chingmy Yau, Richard Ng, Francis Ng, Collin Chou, Ekin Cheng, Lam Ching-ying\nRegie: Wong Jing, Sammo Kam-Bo Hung\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDer junge Held Chang Mo Kei (Jet Li) wird von einem mystischen Todesfluch getroffen und muss sich seinen Weg zurück zu Rache und Ehre kämpfen. Seine Eltern wurden von einem bösartigen Kult ermordet, der seine gesamte Familie auslöschen wollte. Trotz seiner fehlenden Kampferfahrung und dem tödlichen Gift, das ihn schwächt, begibt er sich auf eine Reise, auf der er zahlreiche Verbündete findet, darunter Kriegerinnen und exzentrische Helden, die sich seiner Mission anschließen.\nZusammen stellen sie sich dem Kult entgegen und kämpfen gegen übermächtige Feinde, die ihre Fähigkeiten, Loyalität und ihren Mut auf die Probe stellen. Mit spektakulären Kampfchoreografien von Sammo Hung, wilden Drahtkampfszenen und einer Prise Humor bietet der Film ein unvergessliches Martial-Arts-Erlebnis.\n#Netzkino #ganzerFilm #JetLi\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "Fm229Xcte1A",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "martial-arts",
      "name": "Martial Arts"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:58:46.170Z"
}