{
  "imdbId": "youtube-jgvEvgYXa4o",
  "title": "Glen or Glenda 1953 (Edward D. Wood Jr, Bela Lugosi, Lyle Talbot (Drama Movie)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jgvEvgYXa4o",
      "id": "jgvEvgYXa4o",
      "title": "Glen or Glenda 1953 (Edward D. Wood Jr, Bela Lugosi, Lyle Talbot (Drama Movie)",
      "description": "Strange Loves... of those who live and love but can never marry!\nA psychiatrist shares the stories of a person exploring cross-dressing (Glen or Glenda) and another individual with characteristics of both sexes (Alan or Anne).\n\nOriginal tilte: Glen or Glenda (1953) AKA: He or She / The Transvestite / I Changed My Sex\n\nColorized version https://youtu.be/unimG4UjB2Y\n\n\nDirector & Writer: Edward D. Wood Jr.\nStars: Edward D. Wood Jr, .Bela Lugosi, Lyle Talbot & Dolores Fuller\nGenre: Classics, Drama\nThis film is subtitled in many languages.\n\n00:00 Full Movie\n02:00 The video discusses the continuous exploration of the unknown, the diversity of life, and the challenges faced by individuals in society.\n10:16 The video discusses gender transition and societal acceptance, challenging traditional norms.\n16:00 The video discusses the modern man and woman, their daily lives, and the impact of societal norms on their appearance and behavior.\n18:38 The video discusses the unique case of Glen and Glenda, who share the same body but have different gender identities.\n23:18 A man is struggling with his gender identity and is unsure whether to tell his fiancée before their wedding.\n27:56 The video discusses the challenges faced by individuals with gender identity issues and the impact on their relationships.\n32:09 A story of love, identity, and acceptance unfolds as Glen-Glenda makes a life-changing decision.\n50:24 The video discusses the stories of Glen and Alan-Anne, who both experienced gender identity issues and underwent gender transition.\n54:58 Alan's journey of transitioning from a man to a woman, including medical procedures and hormone treatments.\n1:01:37 The video discusses the story of Alan, who transitioned to Anne and found happiness as a woman.\n1:04:51 The video discusses the transformation of Glen into Glenda and the impact on their relationships.\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:39:45.135Z",
      "thumbnail": "https://i.ytimg.com/vi/jgvEvgYXa4o/maxresdefault.jpg?v=65fa8b0f",
      "duration": 4114,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:45.223Z"
}