{
  "imdbId": "youtube-JT_erSxCd3g",
  "title": "순애보(1957) The Pure Love (Sun-aebo)",
  "year": 1957,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JT_erSxCd3g",
      "title": "순애보(1957) The Pure Love (Sun-aebo)",
      "description": "For detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00345\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00345\n\n감독(Director): 한형모(Han Hyeong-mo)\n출연(Cast): 성소민(Seong So-min), 이빈화(Lee Bin-hwa), 김의향(Kim Ui-hyang), 최봉(Choe Yong-gu), 김신재(Kim Sin-jae) \n\n(줄거리) 바닷가에 홀로 살던 화가 최문선(성소민)은 우연히 물에 빠진 인순(김의향)을 구해주고 인연을 맺는다. 서울에서 내려온 스튜어디스 인순은 문선에게 호감 이상의 감정을 가지지만, 문선은 인순에 대하여 별다른 감정을 가지지 않는다. 그러던 중 문선은 이웃에 살던 지인들인 윤명희(이빈화) 가족을 15년 만에 만나고, 명희의 오빠 명근(현상섭)의 잡지 일을 돕기 위하여 서울로 가게 된다. 서로를 사랑하게 된 명희와 문선은 장래를 약속한다. \n서울에서 문선을 만난 인순은 사랑을 고백하지만, 문선은 완곡하게 인순의 사랑을 거절한다. 한편 문선의 잡지사 동료 황인수(최봉)는 몇 년째 병석을 지키고 있는 아내(김신재)를 두고 있으나, 명희와 인순에게 추근거린다. 명희와 문선이 약혼하는 날, 인순은 꼭 할 말이 있다고 문선을 부르고, 문선이 오기 전 인수는 자신을 거부하는 인순을 칼로 찔러 죽인다. 인수는 인순의 집에 들어서는 문선에게 흉기를 휘둘러 그의 눈을 멀게 하고 기절한 그의 손에 칼을 쥐어주고 도망친다. 눈이 먼 채 누명을 쓰게 된 문선은 자신의 운명을 받아들이고, 자신의 무죄를 주장하지 않는다. 결국 문선의 인격에 감동한 인수의 자백으로 문선은 풀려나고, 그는 명희에게 알리지 않고 고향으로 내려가는 기차를 탄다.\n\n(Synopsis) Choi Mun-seon (Seong So-min), a painter who lives alone on a beach, rescues drowning In-sun (Kim Ui-hyang). In-sun, a stewardess from Seoul, has more than platonic feelings for him, but he has no special feelings for her.Mun-seon meets Yun Myeong-hee who lived in his neighborhood 15 years ago. In order to help Myeong-hee's brother, Myeong-geun (Hyeon Sang-seob), who works for a magazine company, Mun-seon goes to Seoul. Myeong-hee and Mun-seon fall in love with each other. When In-sun meets Mun-seon in Seoul, she confesses her love for him, but he turns it down in a roundabout way. Meanwhile, Hwang In-su (Choi Bong), Mun-seon's co-worker at the company, teases Myoeng-hee and In-sun, while his wife (Kim Sin-jae) has been bedridden for years. On Myeonghee's and Mun-seon's engagement day, In-sun calls Mun-seon, saying that she has something to tell him. Before he arrives, In-su stabs In-sun to death because she turns him down. In-su blinds Mun-seon with a knife and he faints. Before In-su runs away, he puts his knife in Mun-seon's hand. Blind and stigmatized, Mun-seon accepts his fate and gives up defending himself. In the end, In-su is so touched by Mun-seon's personality that he confesses his crime. Freed, Mun-seon gets on a train to his hometown without letting Myeong-hee know.",
      "id": "JT_erSxCd3g",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:57.951Z"
}