{
  "imdbId": "youtube-gmXSFGeEAow",
  "title": "Bats (The Awakening) | Latest Full Horror Movie | 2021",
  "year": 2021,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gmXSFGeEAow",
      "id": "gmXSFGeEAow",
      "title": "Bats (The Awakening) | Latest Full Horror Movie | 2021",
      "description": "***This film is under license from ITN Distribution. All rights reserved.***\n\nBats: The Awakening - Following a nuclear power plant melt down, a nearby village known as Nosferatu Village, became radiated, and subsequently abandoned for more than a decade. The year is 1984, and the public are now permitted to return, and a small group come back to their family home to discover a radiated bat living in their attic. The family must survive the night to escape, but the monster has other plans as they soon begin to find themselves infected with a deadly plague that will kill them if the beast doesn't. Waiting for sun to rise, they must figure a way to survive the night, battling against the creature.\n\n2021\nStars: Megan Purvis, Georgia Conlan, Amanda-Jade Tyler\n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #LatestActionMovies #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:45:46.313Z",
      "thumbnail": "https://i.ytimg.com/vi/gmXSFGeEAow/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBAk28dQZtq7yC8e-QcXDMOzbNIyA",
      "duration": 4991,
      "language": "en",
      "year": 2021,
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:45:46.313Z"
}