{
  "imdbId": "youtube-eB_DxSZO6mA",
  "title": "The Shape of Things to Come (1936 Sci-Fi) Directed by William Cameron Menzies",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eB_DxSZO6mA",
      "title": "The Shape of Things to Come (1936 Sci-Fi) Directed by William Cameron Menzies",
      "description": "In 1940, businessman John Cabal struggles to enjoy Christmas as the threat of war looms over Everytown, leading him to become a Royal Air Force pilot after a devastating bombing raid. As the war drags on into the 1960s, society collapses into a dark age marked by hyperinflation and a deadly plague that wipes out half of humanity. By 1970, warlord Rudolf, the \"Boss\" of Everytown, rejects Cabal's offer to join the peace-seeking organization \"Wings Over the World,\" but is ultimately overthrown when they use a \"Gas of Peace\" to take control. Under Cabal's leadership, civilization is rebuilt by 2036, but tensions rise as the populace demands a break from progress, culminating in a debate about humanity's future as Cabal prepares for the first crewed flight to the Moon.\n\n\nColorized version: https://youtu.be/iwTDqHrJ4vc\n\n\nDirector: William Cameron Menzies\nWriter: H.G. Wells\nStars: Raymond Massey, Edward Chapman, Ralph Richardson\nGenres: Drama, Literary, Sci-Fi, War\n\n\n0:00 Full movie with subtitles\n5:21 Cabal warns of impending war as tensions rise across the globe.\n14:40 Aerial bombings devastate Everytown, plunging society into chaos.\n28:33 The plague spreads, and the ruthless \"Boss\" seizes control of Everytown.\n36:01 John Cabal arrives, declaring the end of war and the rise of order.\n55:02 Cabal's forces unleash \"Gas of Peace\" to overthrow the Boss's regime.\n1:14:31 Humanity unites under science, preparing for the first moon launch.\n1:26:00 Cabal reflects on humanity's endless pursuit of progress and the stars.\n\n\nThemes:\nHumanity’s Struggles: A central theme is the conflict between those embracing progress and those clinging to outdated traditions or chaos.\nOptimism in Science: The movie promotes the idea that scientific progress is essential for humanity's survival.\nVisual Innovation: The futuristic cityscapes and grand sets were groundbreaking, influencing sci-fi cinema for decades.\n\n\n@CultCinemaClassics",
      "id": "eB_DxSZO6mA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:33:13.979Z"
}