{
  "imdbId": "youtube-yxkuKrE-y2o",
  "title": "The King Maker (actiongeladener ABENTEUERFILM mit JOHN RHYS-DAVIES, ganzer Actionfilm auf Deutsch)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yxkuKrE-y2o",
      "title": "The King Maker (actiongeladener ABENTEUERFILM mit JOHN RHYS-DAVIES, ganzer Actionfilm auf Deutsch)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Tolles Actionabenteuer mit \"Indiana Jones\"- & \"Herr der Ringe\"-Star JOHN RHYS-DAVIES: 1547 strandet der Portugiese Fernando in Siam, wird zum Leibwächter des Königs – und gerät mitten in ein gefährliches Machtspiel um den Thron.\n\nTHE KING MAKER (2005)\nMit: Gary Stretch, John Rhys-Davies, Cindy Sirinya Bishop\nRegie: Lek Kitaparaporn\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\n1547 reist der Portugiese Fernando De Gama nach Südostasien, um in die Dienst des Königreichs von Lanna zu treten. Ein Sturm versenkt sein Schiff, doch er überlebt. Er wird von arabischen Sklavenhändlern gerettet und nach Ayutthaya in Siam gebracht. Dort kauft ihn die schöne Maria, Tochter des Portugiesen Phillippe Del Tores.\nIn der Schlacht gegen Lanna zeigt Fernando solchen Mut, dass er mit seinem siamesischen Freund Tong zum Leibwächter des Königs ernannt wird. Dessen Frau Sudachan plant derweil die Ermordung des Königs und seines Sohnes Yodfa, um mit ihrem Geliebten Phan den Thron zu besteigen.\n#Netzkino #ganzerFilm #johnrhysdavies \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "yxkuKrE-y2o",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}