{
  "movieId": "youtube-4gzE8HkRrz0",
  "title": "Conduct Unbecoming 1975 (Crime, Mystery) Michael York, Richard Attenborough, Trevor Howard",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4gzE8HkRrz0",
      "id": "4gzE8HkRrz0",
      "title": "Conduct Unbecoming 1975 (Crime, Mystery) Michael York, Richard Attenborough, Trevor Howard",
      "description": "An unspeakable crime among officers and ladies.\nAt a British Regimental party in Colonial India, the widow of Captain Scarlett is assaulted in the garden, and she accuses one of the newly arrived junior Lieutenants of the crime.\n\nOriginal title: Conduct Unbecoming (1975)\nThis film is subtitled in many language options.\n\nDirector: Michael Anderson\nWriters: Robert Enders, Barry England\nStars: Michael York, Richard Attenborough, Trevor Howard, Christopher Plummer, Susannah York\nGenres: Crime, Drama, Mystery, Military & War\n\n\n00:00 Full Movie (with subtitles)\n06:06 Military etiquette and scandal unfold as new officers navigate regiment traditions and interact with alluring widow.\n09:37  Intrigue and misconduct unfold among military officers at a regiment, leading to tension and consequences.\n23:40 Military court-martial proceedings following an incident at a ball involving an attack on a woman.\n29:38 Military court trial unfolds with accusations, defense, and conflicting testimonies regarding an alleged assault on a widow.\n37:19 Officer faces unfair trial, accused by Mrs. Scarlett, but ultimately pleads guilty to avoid disgrace and is kept in regiment as punishment.\n47:24 Military trial reveals details of an attack on a woman by a fellow officer.\n53:43 Misconduct investigation reveals a disturbing game played in the regiment, leading to a series of shocking revelations.\n1:03:31 Investigation reveals a connection between two attacks on women, involving a regimental game and a sword.\n1:12:52 Military officer accused of assault; investigation reveals true attacker and motive.\n1:23:24 Investigation into a series of attacks within a regiment leads to a trial with unexpected twists.\n1:32:59 Betrayal, honor, and guilt unravel in a regiment as dark secrets come to light.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:07.250Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/4gzE8HkRrz0/maxresdefault.webp?v=66d79bc4",
      "duration": 6412,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "GB"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:07.362Z"
}