{
  "imdbId": "youtube-9fcD03bsVuA",
  "title": "Trust - A Tendency To Suck | Full Movie | Adventure Romance | Dian Bachar | Erin Kiniry",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9fcD03bsVuA",
      "title": "Trust - A Tendency To Suck | Full Movie | Adventure Romance | Dian Bachar | Erin Kiniry",
      "description": "Real life sucks. After graduating from college without a job or a girlfriend, Colin doesn’t know what’s next. While contemplating this (and after being locked out of his mom’s house), a mysterious woman (Dulcinea) takes an interest in him. As he finds out, she could have been genuine…or she could have been a front for the gang of burglars who robbed the house! Colin makes the mistake of calling the neighborhood patrol who care more about their own love lives than about getting his stuff back. When Cregg, chief Neighborhood Patrol officer, takes Colin out for a drink, they bump into the gang and Dulcinea. Colin ingratiates himself in the group, and Cregg takes this to mean this whole thing was an inside job. They chase each other through the desert, exploring drag clubs and flatlands. Everyone’s allegiance is in question, but Colin quickly learns that this “real life” that he was dreading so much is going to be a lot different than he expected. \n2017. Stars: Zachary Mooren, Dian Bachar, Michael Borre, Amy Bruckner\n*Licensed from Leomark Studios. All rights reserved*\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\nMORE FULL MOVIES - FREE on YouTube!\n\n Free Action Movies: https://bit.ly/3uMwRxq\n Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n Free Horror Movies: https://bit.ly/3aBBt2J\n Free Asylum Movies: https://bit.ly/3cipzeI\n Free Crime/Thriller: https://bit.ly/3o01prJ\n Free Drama Movies: https://bit.ly/3Pu4mN9\n Free Comedy Movies: https://bit.ly/3IE0wPd\n Free Western Movies: https://bit.ly/3RqTX6u\n Free Adventure Movies: https://bit.ly/3yHolAT\n MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "9fcD03bsVuA",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-24T01:42:43.623Z"
}