{
  "imdbId": "youtube-UaywM8HS1n4",
  "title": "The Great Flamarion (Film-Noir, 1945) by Anthony Mann with  Erich von Stroheim | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UaywM8HS1n4",
      "id": "UaywM8HS1n4",
      "title": "The Great Flamarion (Film-Noir, 1945) by Anthony Mann with  Erich von Stroheim | Movie",
      "description": "Great with a gun!!\nPart of an entertainment act, a beautiful but unscrupulous female performer manipulates all the men in her life in order to achieve her aims.\n\nOriginal title: The Great Flamarion (1945) AKA: Strange Affair / Dead Pigeon\n\nColorized version: https://youtu.be/o617PIN8pWc\n\n\nDirector: Anthony Mann\nWriters: Anne Wigton, Heinz Herald, Richard Weil\nStars: Erich von Stroheim, Mary Beth Hughes, Dan Duryea\nGenres:  Classics, Crime, Drama, Film-Noir, Mystery, Romance, Thriller\n\n\n00:00 Full Movie (with subtitles)\n02:55 A murder mystery unfolds during a performance at a theater, leading to interrogations and revelations.\n10:47 A tale of betrayal and regret unfolds as Flamarion confesses to a crime, leading to a tense confrontation.\n18:26 A mysterious interaction unfolds between Connie and Flamarion, revealing secrets and tensions.\n22:10 A story of love, betrayal, and revenge unfolds as Flamarion navigates complex relationships.\n26:58 Troubling signs of alcoholism, concerns for safety, and a complicated relationship between characters.\n32:03 Betrayal and deception unfold as Al and Connie discuss their failed performances and uncertain future together.\n37:14 Betrayal and consequences unravel in a tense conversation between Eddie and Al, leading to a potential departure.\n41:45 A dramatic turn of events unfolds as characters navigate through a complex web of relationships and decisions.\n51:44 A mysterious conversation unfolds between Al and a woman, leading to unexpected events.\n59:13 Mysterious encounters lead Brandt on a quest to find Connie, encountering various obstacles along the way.\n1:06:10 Betrayal and revenge unfold in a film featuring deceit, manipulation, and a tragic ending.\n\n\n@CultCinemaClassics\n\n Members-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:32.407Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/UaywM8HS1n4/maxresdefault.webp?v=661397bc",
      "duration": 4489,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:32.545Z"
}