{
  "imdbId": "youtube-nMT_Kuwt_EE",
  "title": "Home Town Story 1951 (Marilyn Monroe, Jeffrey Lynn) Romance, Comedy | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nMT_Kuwt_EE",
      "id": "nMT_Kuwt_EE",
      "title": "Home Town Story 1951 (Marilyn Monroe, Jeffrey Lynn) Romance, Comedy | Full Movie",
      "description": "After failing to be re-elected, politician Blake Washburn returns home and becomes editor of the local newspaper. When he notices the influence the paper has on the public, he uses it to appeal to potential voters in the next election.\n\nOriginal title: Home Town Story (1951)\n\nColorized version:  https://youtu.be/D3cVEb4rPkQ\n\n\nThis film is available with multiple subtitle options.\nDirector & Write: Arthur Pierson\nStars: Jeffrey Lynn, Donald Crisp, Marjorie Reynolds, Alan Hale Jr. & Marilyn Monroe\nGenres: Comedy, Drama, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:39 A glimpse into the interactions and relationships of characters in a small town.\n07:57 Romantic relationships and career struggles unfold in a small town setting.\n11:42 A glimpse into the daily interactions and relationships of a newspaper editor and his family.\n20:10 Investigative journalist uncovers pollution in small town, confronts factory manager, and plans exposé.\n21:43 Discussion on newspaper production, editorial decisions, and public interest in business profits.\n29:17 Local newspaper editor faces ethical dilemma and personal struggles in small town.\n37:40 Discussion on business profitability and customer value in a newspaper company.\n39:04 Discussion on the impact of industrialization on society and personal anecdotes.\n46:59 Medical emergency unfolds as Katie is rushed to surgery in Capitol City.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:39:29.303Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/nMT_Kuwt_EE/maxresdefault.webp?v=65fa8d23",
      "duration": 3660,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:29.435Z"
}