{
  "imdbId": "youtube---V_TY2AKM0",
  "title": "Docteur Justice (1975 Action film) with John Phillip Law, Gert Fröbe, Nathalie Delon",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=--V_TY2AKM0",
      "id": "--V_TY2AKM0",
      "title": "Docteur Justice (1975 Action film) with John Phillip Law, Gert Fröbe, Nathalie Delon",
      "description": "Doctor Justice is a crusading physician with the World Health Organization and also a swimming champion, karate expert and philosopher must investigate a series of pirate attacks.\n\nTeaser preview: https://youtu.be/kBcRoFYxLVQ\n\nOriginal title: Docteur Justice (1975) AKA: Doctor Justice / Karate fighters\nThis film is available in French & German audio, and subtitled in many languages.\n\nDirector: Christian-Jaque\nWriters: Christian-Jaque, Raphael Marcello \nStars: John Phillip Law, Gert Fröbe, Nathalie Delon\nGenres: French cinema, Action, Cult film\n\n\n00:00 Full Movie (with subtitles)\n01:45 Mystery unfolds as a chef discovers salt instead of oil on a ship, leading to investigations and revelations.\n06:52 Intrigue unfolds as Dr. Justice navigates a high-stakes situation involving a demanding individual and a conference in Bruges.\n14:34 Mysterious doctor with martial arts skills gets involved in a dangerous situation and faces a cunning adversary.\n21:13 Mysterious encounters and discussions unfold, leading to a planned visit to a fish farming center near the Dutch border.\n27:37 Mysterious events unfold as Max receives a package and is asked for a large sum of money. Eric's involvement leads to dangerous consequences.\n39:00 A doctor reveals secrets about a job involving a port city and a doctor's next task. Betrayal, revenge, and responsibility unfold.\n50:38 Revelation of Max's dual identity as the gang leader and chef, implicating him in piracy activities.\n55:00 Investigation leads to a mission in Colombia involving Max and Eric's revenge.\n1:02:49 Mystery unfolds as Dr. Justice investigates suspicious activities on a ship, leading to unexpected revelations.\n1:12:05 Undercover operation on a ship involving oil smuggling, negotiations, and a surprise plan.\n1:30:11 Discovery of a dangerous plan involving a powerful serum and overpopulation prevention.\n1:36:52 Plot summary of a French action film involving a mad scientist's plan to sterilize humanity using pollution and a heroic doctor's investigation.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdaVNpTE5NfgyPqL-rKc8VsL",
      "addedAt": "2025-12-27T00:36:53.663Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/--V_TY2AKM0/maxresdefault.webp?v=66286725",
      "duration": 6423,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:53.784Z"
}