{
  "imdbId": "youtube-HXPMEjqx0Ak",
  "title": "The General's Mustache ( Janggun-ui Suyeom )(1968)",
  "year": 1968,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HXPMEjqx0Ak",
      "title": "The General's Mustache ( Janggun-ui Suyeom )(1968)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01748\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01748\n\n영화글 : https://www.kmdb.or.kr/story/10/1758\n\n감독(Director) : 이성구(Lee Seong-Ku)\n출연 : 신성일(김철훈),윤정희(나신혜),김승호(형사),김성옥,김동원,김신재,곽규석,박옥초,전창근,한은진(철훈 어머니),정민,정애란,문오장,여운계(하숙집 딸),박기택,유하나,조덕성,임해림,임성보,권일정,윤신옥,황인철,백일섭(기자),이일웅,최창호,송창수,공시훈,이영호,박철,손전,장현호,김세라\n\n줄거리 : 사진기자 김철훈(신성일)이 의문의 죽음을 당하는 사건이 일어난다. 노회한 박 형사(김승호)는 젊고 지적인 형사(김성옥)과 함께 김철훈의 주변 인물들을 상대로 탐문 수사를 벌인다. 집주인과 어머니, 여동생을 만났지만 별다른 진전이 없다. 형사들은 철훈에게 편지를 보낸 소설가 한정우를 만나 김철훈이 쓰려고 했던 소설 「장군의 수염」 이야기를 듣는다. 조국을 해방시킨 위대한 장군을 추종해온 국민이 장군처럼 수염을 기르지만 주인공만은 이에 동조하지 않고 외톨이가 된다는 것이 소설의 내용. 이야기를 들은 형사들은 한정우로부터 별다른 혐의점을 찾지 못하고, 한때 김철훈과 동거했던 전직 댄서 신혜(윤정희)를 찾아가 김철훈에 대한 자세한 이야기를 듣는다. 신혜가 들려주는 이야기에 따르면 김철훈은 낭만적인 사람이지만 현실 부적응자였다. 김철훈의 낭만적 감성에 반했던 신혜는 그에게 지쳐 그를 떠나버리고 만다. 김철훈의 죽음은 그 후의 일. 경찰들은 김철훈의 죽음을 자살로 결론짓는다.\n\nCasts : Shin Seong-Il, Yoon Jung-Hee, Kim Seung-Ho\n\nSYNOPSIS : One day, a photographer Kim Chul-woon is found dead. To solve the mysteries of this sudden death, the crafty detective Park (Kim Seung-ho) begins an investigation with a young and smart detective (Kim Seong-ok) and interviews people related to Kim Chul-hoon. He meets Kim's landlord and his younger sister without success. Then the detectives meet a novelist Han Jung-woo who sent a letter to Chul-woon and hears about 『The General's Mustache』 , a novel Kim wrote after meeting the novelist Han. It's a story about every person in the country growing a mustache to follow the general who played a crucial role in the independence of the country except for the main character who disagreed. Eventually, the main character becomes a lonely and isolated person. Hearing the plot of the novel doesn't lead detectives anywhere. Next, they hear more in detail about Kim Chul-hoon from Shin-hye (Yoon Jeong-hee), a former dancer who used to be Kim's lover. According to Shin-hye's story, Kim was a romantic man but had trouble adapting to reality. Shin-hye was attracted to the romantic air that Kim had but eventually leaves him. Kim's death takes place after their parting. Detectives conclude Kim's death was a suicide.",
      "id": "HXPMEjqx0Ak",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:06.828Z"
}