{
  "imdbId": "youtube-99Qykqxqddc",
  "title": "What Happens in an Alley ( Golmogan Punggyeong )(1962)",
  "year": 1962,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=99Qykqxqddc",
      "id": "99Qykqxqddc",
      "title": "What Happens in an Alley ( Golmogan Punggyeong )(1962)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00750\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00750\n\n감독(Director) : 박종호(Park Jong-Ho)\n출연 : 김승호(고주사),김진규(황호성),김지미(은미),최무룡(영택이),장동휘,조미령,이빈화,김희갑,정애란,황정순,강미애,양춘,이룡,남미리,윤인자,송억,김희철,공진수,이경림,방순자,윤려선,문선영\n\n줄거리 : 세금 공무원인 고주사(김승호)는 아홉이나 되는 자식들을 먹여 살리느라 마음과 몸이 편할 날이 없다. 고주사의 어머니(정애란)는 담배 가게라도 차려보려고 하지만 그것도 밑천이 필요한지라 여의치 않다. 고주사의 동생 영택(최무룡)은 소설가 지망생이지만, 돈벌이를 하지 못해 늘 형에게 구박을 받자 집을 나가버린다. 고주사의 매부이자 책방을 하는 황호성(김진규)은 아이가 없다는 핑계로 아내(이빈화)를 등한시하고 다방마담(김지미) 은미와 연애를 하며 아이를 낳아달라고 한다. 은미는 다방주인인 송사장(장동휘)의 아이를 임신한 상태에서 그에게 버림받고, 호성과 결혼해 그 난관을 벗어나려 한다. 한편 송사장은 탈세를 위해 고주사에게 뇌물을 주지만 고주사는 완강히 거절한다. 그러나 고주사는 어머니가 아파 입원하자 어쩔 수 없이 송사장에게 돈을 빌린다. 송사장은 이를 빌미로 고주사의 약점을 잡아 탈세를 하려한다. 이미 다방 주인에게 매수된 고주사의 부하직원은 과장에게 고주사가 뇌물을 받고 탈세를 도와줬다고 거짓고발을 한다. 마지막까지 송사장의 협박에 굴하지 않던 고주사는 궁지에 몰리게 되고, 결국 사표를 내고 사라진다. 호성의 아내는 호성이 바람을 피고 있다는 사실을 알고 친정으로 떠난다. 뒤늦게 은미의 거짓말과 아내의 소중함을 깨달은 호성은 은미를 버리고 아내를 찾아간다. 은미는 호성이 자신과 결혼할 생각이 없다는 것을 알고 송사장에게 다시 매달리지만, 송사장은 은미와 일하던 다방 레지(남미리)에게 다방을 넘겨준다. 송사장은 자신을 찾아온 은미를 모른 척하며 구타하고 은미는 길에서 쓰러져 죽고 만다. 자살을 결심했던 고주사는 어머니와 아내(조미령), 자식들을 떠올리며 마음을 되잡고 돌아온다. 고주사의 동생 영택은 마침내 소설에 당선되고 받은 상금으로 송사장에게 빌린 돈을 갚는다. 송사장은 탈세혐의로 경찰에 잡혀가고, 고주사의 누명이 어느 정도 벗겨진다. 돌아온 고주사는 아홉 명의 자식을 다 기르기에는 무리라는 생각에 자식이 없는 매부 부부에게 자식 둘을 준다. 다 모인 아이들은 마지막으로 아버지 앞에서 함께 노래를 부르고 울면서 헤어진다.\n\nCasts : Kim Seung-Ho, Cho Mi-Ryeong, Jeong Ae-Ran\n\nSYNOPSIS : A civil official who supports nine children with his meager salary firmly rejects bribes. But his family thinks he is incompetent. One day when the corrupt officials in his office are fired, but he is promoted. His wife and children, celebrating his promotion, swear to live more honestly.",
      "addedAt": "2025-12-26T00:23:59.155Z",
      "thumbnail": "https://i.ytimg.com/vi/99Qykqxqddc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDPZz_MoDymsOG7dzmDRQSqvkfFyQ",
      "duration": 7130,
      "language": "ko",
      "year": 1962,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:59.213Z"
}