{
  "imdbId": "youtube-Gqehff6CV80",
  "title": "구두닦이(1961) / A Shoeshine Boy(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Gqehff6CV80",
      "title": "구두닦이(1961) / A Shoeshine Boy(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00663\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00663\n\n감독(Director) : 현상열(Hyeon Sang-yeol)\n출연 : 박광수, 박금희, 김영옥, 남춘역, 추석양, 이종하, 박정은, 조미령, 김희갑\n\n줄거리 : 부모를 잃은 영철(박광수)은 구두를 닦으며 아픈 동생 영희(박금희)를 돌보며 배고프게 살아간다. 범죄무리 우두머리 왕초(추석양), 소매치기 짱구(이종하) 그리고 사창가에서 일하는 미화(조미령)의 유혹에도 불구하고 영철은 올바르게 살고자 담배 장사를 하는 명순(김영옥)과 함께 새로 자리를 잡은 구두닦이 동석(박정은)을 돕기 시작한다. 그러나 어느 날 비극적인 사고가 발생하고 영철은 중요한 선택을 하게 된다. \n※ 비토리오 데시카 감독의 대표작 '구두닦이'(1946)와 같은 제목을 가진 만큼 네오리얼리즘 경향이 강한 작품이라는 평가를 받은 이 영화는 영상이 모두 유실되었으며 원본 사운드 네거티브 4권(약 40분 분량)만 현존한다. 내용의 이해를 돕기 위해 줄거리 요약 및 장면 설명 화면자막 그리고 현장스틸 이미지를 삽입하였다. \n\nCAST : Park Gwang-su, Park Geum-hui, Kim Yeong-ok, Nam Chun-yeok, Chu Seok-yang, Lee Jongha, Park Jeong-eun, Jo Mi-ryeong, Kim Hee-kap\n\nSYNOPSIS : Following the death of his parents, Yeong-cheol shines shoes in the streets, struggling to care for his sick younger sister Yeong-hui and make ends meet. Despite the persuasive efforts of low-life criminal boss Wang-cho, pickpocket Jjang-gu, and prostitute Mi-hwa, Yeong-cheol vows to lead an honest life by looking after Yeong-hui with cigarette salesgirl Myeong-sun and helping newly arrived shoeshine boy Dong-seok settle in. However, a tragic accident forces Yeong-cheol to make an important decision that may change his life.\n※ Sharing the same Korean title with Vittorio De Sica’s classic Shoeshine (1946), this film was noted at the time of release for its strong neorealistic approach. All of the picture elements have been lost and only 4 original sound negative reels (around 40 minutes) survive today. The plot summary and scene descriptions have been added in the form of title cards as well as a selection of production stills to aid the viewing experience.",
      "id": "Gqehff6CV80",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:46.747Z"
}