{
  "movieId": "youtube-OANGhypaYCg",
  "title": "The Hand of Destiny (Unmyeong-ui son)(1954)",
  "year": 1954,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OANGhypaYCg",
      "id": "OANGhypaYCg",
      "title": "The Hand of Destiny (Unmyeong-ui son)(1954)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00270\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00270\n\n영화글 : https://www.kmdb.or.kr/story/10/2053\nDVD  소책자 : https://www.kmdb.or.kr/history/book/2356\n\n감독(Director) : 한형모(Han Hyeong-Mo)\n출연 : 이향(신영철),윤인자(마가렛, 정애),주선태(간첩단 두목 박)\n\n줄거리 : 술집에서 바걸로 일하며 북한의 스파이로 활동하는 마가렛(윤인자)은 우연히 도둑으로 몰린 고학생 신영철(이향)을 구해주고, 그를 자신의 집으로 불러들여 치료하고 먹을 것을 준 후 돌려보낸다. 부두에서 하역 노동자로 일하는 영철과 다시 만난 마가렛은 그에게 옷과 구두를 사주는 등 호의를 베풀고 은근히 자신의 마음을 고백한다. 그 후 마가렛은 영철과 즐거운 시간을 보내지만, 그 과정에서 간첩으로서의 정체성과 영철과의 사랑 사이에서 번민한다. 신영철이 방첩대 대위임을 알게 된 마가렛은 의식적으로 그를 피하고, 영철은 자신을 만나주지 않는 마가렛 때문에 괴로워한다. 어느 날 영철은 간첩이 어느 여인과 접선할 것이라는 첩보를 받고 간첩을 미행하다 총격전까지 벌이게 된다. 접선 장소에서 기다리던 마가렛은 자신들을 소탕하러 온 영철을 발견하고 몸을 피한다. 간첩단 두목 박(주선태)은 마가렛을 이용하여 영철을 제거하기로 하고, 마가렛은 괴로워하면서도 그를 유인하는 임무를 맡는다. 유인 과정에서 마가렛의 정체를 알게 된 영철은 배신감을 느끼지만, 사랑하는 그녀를 위해 죽을 결심을 한다. 그러나 마가렛은 차마 영철을 쏘지 못하고, 그를 대신해 박의 총을 맞으며, 영철은 박과의 결투 끝에 그를 죽인다. 총을 맞아 부상을 당한 마가렛은 영철의 손에 죽기를 원하고, 영철은 눈물을 흘리며 그녀를 쏜다.\n\n\nCasts : Lee Hyang,Yoon In-Ja,Joo Seon-Tae\n\nSYNOPSIS : Margaret (Jeong-ae, Yun In-ja), a North Korean spy and madam of a cabaret, saves Sin Yeong-cheol(Lee Hyang), who is on the run as a thief under suspicion. In-Ja, who loves him, helps him escape after caring for him and giving him food. One day Margaret happens to meet Yeong-cheol, who works as a manual laborer on the wharf. She buys him clothes and shoes and confesses her love for him. Later they are happy as lovers, but she is uncomfortable remembering herself as a spy. One night after they had made love, she happens to see his ID card which identifies him as an anti-espionage lieutenant. Shocked, she then tries to avoid him and he is heartbroken. One day he receives a piece of intelligence that a spy will contact a woman. He secretly follows the spy, which later ends up in a gun fight. Margaret, who had been waiting for the spy sees Yeong-cheol, and hides herself.Park, the head of the spies, uses Margaret to kill Yeong-cheol. She is in dismay, but is obligated to draw his attention, and kill him. Meanwhile, Yeong-cheol discovers her true identity, but decides to die for the woman he loves. Margaret just cannot shoot him, and protects him when someone shoots at him. She gets hit instead. Yeong-cheol finally kills the chief after a long fight. Wounded Margaret wants to die in Yeong-cheol's arms so he shoots her, weeping.",
      "addedAt": "2025-12-26T00:25:23.593Z",
      "thumbnail": "https://i.ytimg.com/vi/OANGhypaYCg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA0umKH0X8diWDvwsevpi4ImkaNcQ",
      "duration": 5397,
      "language": "ko",
      "year": 1954,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:23.619Z"
}