{
  "imdbId": "youtube-PNXf_ibPc7o",
  "title": "Festival(Chugje)(1996)",
  "year": 1996,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PNXf_ibPc7o",
      "title": "Festival(Chugje)(1996)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04830\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04830\n\n감독(Director) : 임권택(Im Kwon-Taek)\n출연 : 안성기(이준섭),오정해(이용순),한은진(준섭모),정경순(장혜림),박승태(외동댁),이금주(최지현),안병경,김경애,남정희,이해룡,이예민,이얼,배태일,임진택,홍원선,방은미,신성일,박용진,최동준,김종구,김기천,유일강,안진수,이석구,김우석,김경란,강희,박예숙,조학자,홍승기,민경진,장기용,박충선,하덕성,김기범,추봉,손전,김길호,길다로,홍동은,윤일주,이지산,양일민,박광진,방영,김철홍,백진아(아역),최지혜(아역),손꽃잎(아역),이사라(아역),장대승(아역),김동화(아역),김병재(우정출연),배장수(우정출연),김석중(우정출연),김재찬(우정출연),임금택(우정출연),위용환(우정출연)\n\n줄거리 : 40대 명망있는 작가 이준섭은 5년이 넘게 치매를 앓아온 시골노모가 돌아가셨다는 연락을 받고 분주히 고향을 찾는다. 87세 할머니의 죽음은 많은 사람들에게 다른 감정으로 다가간다. 특히 치매에 걸린 시어머니를 모셔온 형수의 감정은 홀가분함과 애석함이 교차한다. 한편, 준섭의 모친상을 통해 그의 문학세계를 재조명하는 기사를 쓰러온 기자 장혜림은 관찰자로 장례식의 이모저모를 취재하기 바쁘다. 장례가 시작되고, 어머니의 죽음을 놓고 생기던 그 골이 깊어진다. 그러나 장례식이 진행되면서 가족들의 갈등은 서서히 풀리고, 할머니를 모시지 않은 삼촌 준섭을 원망하던 용순은 준섭이 쓴 동화를 읽고 눈물을 흘린다. 장례가 끝나자 노모가 남겨준 큰 사랑과 삶의 지혜를 가족들은 각자의 가슴속에 간직하게 된다.\n\nCasts : Ahn Seong-Ki, Oh Jeong-Hae, Han Eun-Jin, Jeong Kyeong-Sun, Bark Seung-Tae, Lee Kum-Ju, Ahn Beung-Kung, Kim Kung-Ahe, Nam Jeong-Hee\n\nSYNOPSIS : Lee Joonsup is a famous writer in his 40s. One day, he is informed that his mother who has been ill for more than 5 yea rs has died. Before he goes to his mother's house in the countryside to assist with the funeral, he is busy cancelling a ll his appointments and telling everyone about his mother's death. A journalist, Jang Haerim, comes to the funeral to write an article about Joonsup's literary world. The funeral starts and enmity among the family of the deceased deepens as Joonsup's niece, Yongsoon, arrives. However, by the end of the fu neral, Yongsoon cries after reading Joonsup's fairy tale, and the relatives come to understand each other better. When t he funeral ends, all the relatives cherish the wisdom and love of life of Joonsup's deceased mother.\n\n인도네시아어 자막 제공 : 주인도네시아한국문화원\nIndonesian subtitles are provided by  the Korean Cultural Center Indonesia.",
      "id": "PNXf_ibPc7o",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:25:06.009Z"
}