{
  "imdbId": "youtube-boABdwFFyy4",
  "title": "William Shakespeare | The Taming of the Shrew (1929) by Sam Taylor | Colorized Movie",
  "year": 1929,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=boABdwFFyy4",
      "id": "boABdwFFyy4",
      "title": "William Shakespeare | The Taming of the Shrew (1929) by Sam Taylor | Colorized Movie",
      "description": "In sixteenth-century Padua, Hortensio loves Bianca, the youngest daughter of Baptista. However, Baptista will not allow the two to get married until his eldest daughter, the extremely headstrong Katherine, is betrothed. This task seems impossible because of Katherine's shrewish demeanor. Their prayers seem to have been answered with the arrival from Verona of the lusty Petruchio, whose father has just passed, leaving him to travel the world and marry. Having not yet met her, Petruchio agrees to court Katherine when he is told of her beauty and wit. Petruchio is even more excited at the prospect of marrying this \"wildcat\" of a woman after meeting her. Katherine will have none of it, even if it means her sister's spinsterhood, but has no choice but to marry him.\n\n\nBlack & White version: https://youtu.be/uK6vKByhnCk\n\n\nOriginal title: The Taming of the Shrew (1929)\nThis film is is subtitled with many language options.\n\nDirector: Sam Taylor\nWriters: William Shakespeare, Sam Taylor \nStars: Mary Pickford, Douglas Fairbanks, Edwin Maxwell\nGenre: Literary, Comedy, Romance, Colorized classics, Pre-code\n\n\n00:00 Full Movie (with subtitles)\n00:21 Romantic and comedic interactions between characters in a Shakespearean play.\n15:06 Dramatic interactions between Petruchio and Catherine in the Taming of the Shrew.\n22:03 A tumultuous wedding ceremony unfolds as Petruchio marries Kate against her will in a colorful adaptation of William Shakespeare's play.\n33:41 Dramatic portrayal of a tumultuous marriage in a colorized adaptation of Shakespeare's play.\n50:07 A man attempts to tame a woman through manipulation and control in a Shakespearean play adaptation.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdZNVUHeT81nfbCADIIM7UW2",
      "addedAt": "2025-12-27T00:36:21.174Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/boABdwFFyy4/maxresdefault.webp",
      "duration": 3904,
      "language": "en",
      "year": 1929,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:21.311Z"
}