{
  "imdbId": "youtube-SmEt5Z5rS8I",
  "title": "Crazy Horse (WESTERN FILM nach wahren Begebenheiten, ganze Western Filme auf Deutsch ansehen)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SmEt5Z5rS8I",
      "title": "Crazy Horse (WESTERN FILM nach wahren Begebenheiten, ganze Western Filme auf Deutsch ansehen)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Bewegendes Western-Biopic nach wahren Begebenheiten: Der Lakota-Krieger Crazy Horse führt sein Volk in legendäre Schlachten wie die am Little Bighorn gegen General Custer – und kämpft zugleich gegen Verrat, Verlust und den Untergang seiner Kultur.\n\nCRAZY HORSE (1996)\nOriginaltitel: Crazy Horse\nMit: Michael Greyeyes, Irene Bedard, John Terry, Wes Studi\nRegie: John Irvin\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nCrazy Horse wächst in einer Welt auf, in der sein Volk, die Lakota-Sioux, zunehmend von weißen Siedlern bedrängt wird. Als mutiger Krieger führt er sein Volk in entscheidende Schlachten, darunter auch die legendäre Schlacht am Little Bighorn gegen General Custer. Doch sein Leben ist geprägt von Verrat, Intrigen und dem tragischen Untergang seiner Kultur. Der Film zeigt sowohl die Größe als auch die Tragik einer der bekanntesten Indianer-Figuren der Geschichte.\n#Netzkino #ganzerFilm #Western\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "SmEt5Z5rS8I",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.125Z"
}