{
  "imdbId": "youtube-70KM-cuJ4vo",
  "title": "Der stille Berg (KRIEGSFILM Deutsch komplett, ganze Filme kostenlos, Erster Weltkrieg, Kriegsdrama)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=70KM-cuJ4vo",
      "title": "Der stille Berg (KRIEGSFILM Deutsch komplett, ganze Filme kostenlos, Erster Weltkrieg, Kriegsdrama)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Tirol, 1915: Der aus reichem Haus stammende Südtiroler Anderl (William Moseley) verguckt sich in Francesca. Die ist Italienerin, was in Anderls Umfeld für Ärger sorgt. Bald hat das Paar größere Sorgen: Italien erklärt Österreich-Ungarn den Krieg – er muss an die Front.\n\nDER STILLE BERG (2014)\nOriginaltitel: The Silent Mountain\nMit: William Moseley und Claudia Cardinale\nRegie: Ernst Gossner \nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nAnderl Gruber (William Moseley) ist der Sohn eines österreichischen Hoteliers. Der Vater Karl (Harald Windisch) möchte eine Seilbahn bauen und braucht dafür die Unterstüzung der italienischen Ingenieursfamilie Calzolari. Nur deshalb wird geduldet, dass Anderls Schwester Elisabeth den Sohn der Calzolaris heiratet. Auf der Hochzeit lernen sich Anderl und Angelos Schwester Francesca kennen. Francesca wird von ihrer Mutter Nuria (Claudia Cardinale) genötigt, ins Kloster zu gehen. Damit das junge Liebesglück nicht zerstört wird, versteckt Anderl Francesca im Keller des Hotels. Kurz darauf bricht der Krieg zwischen Italien und Österreich-Ungarn aus. Anderl zieht zunächst noch begeistert in den Krieg. Er erkennt aber bald die schrecklichen Ausmaße des Krieges, in dem auch seine Familie auseinandergerissen wird.\n#Netzkino #ganzerFilm #Kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "70KM-cuJ4vo",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}