{
  "movieId": "youtube-ztXiqXgMV4s",
  "title": "만다라(1981) / Mandara (Mandala)",
  "year": 1981,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ztXiqXgMV4s",
      "id": "ztXiqXgMV4s",
      "title": "만다라(1981) / Mandara (Mandala)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03537\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03537\n\n영화글 : https://www.kmdb.or.kr/story/10/1815\n\n감독(Director) : 임권택(Im Kwon-taek)\n출연 : 전무송(지산),안성기(법운),방희,기정수,윤양하,임옥경,박정자,박암,최성관,김우빈,이정애,나정옥,성명순,정지희,국정숙,이장미,나갑성,오중근,강유일\n\n줄거리 : 3개월의 동안거(冬安居) 기간, 버스 한 대가 검문소 앞에 멈춰 서고 군인의 검문이 시작된다. 승려증이 없는 스님이 끌려 내려가자, 젊은 스님도 따라 내린다. 그들은 각각 지산(전무송)과 법운(안성기)이다. 지산은 군인들이 시킨 염불을 하고 풀려난다. 법운은 한 절에서 술을 마시고 있는 지산을 다시 만난다. 지산은 부처는 불당에만 있는 것이 아니라고 말하고, 법운은 6년간의 수행에도 아무것도 얻지 못했음을 깨닫게 된다. 법운은 다시 길을 떠나는 지산을 따라나선다. 헤어짐과 만남을 반복하던 그들은 산속 작은 암자에서 동거에 들어간다. 한 무당의 점안식을 도와준 지산은 내 눈의 점안은 누가 해주냐며 술을 마시고, 가부좌를 틀고 얼어 죽는다. 법운은 지산을 다비하고, 그가 가지고 다니던 번민에 찬 얼굴의 불상을 그가 끝내 못 잊어한 옥순(방희)에게 전한다. 법운은 마지막으로 어머니(박정자)를 만난 후 긴 만행의 길을 떠난다.\n\nCast : Ahn Seong-ki, Jeon Mu-song, Bang Hee, Lim Ok-kyeong, Yoon Yang-ha\n\nSYNOPSIS (CONTAINS SPOILERS) : Six years after leaving the secular life to become a Buddhist monk, Beob-wun is still haunted by memories Young-ju, his ex-lover. He tries to find the path to the truth and meets Ji-san another monk who doesn't even have his holy orders. Their association leads to greater pain and conflicts for Beob-wun.  Ji-san dies in the snow, as partly a man resembling Buddha and a man drowning in the ways of the secular world. Beob-wun cremates Ji-san's corpse and seeks out Young-ju and his mom.  He also meets Ok-sun, a woman Ji-san could not forget.  These encounters reinforce his belief that the ways of the world are meaningless and continues on his path to find the truth.",
      "addedAt": "2025-12-26T00:24:12.059Z",
      "thumbnail": "https://i.ytimg.com/vi/ztXiqXgMV4s/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAsj8fYYst6TbjoJBbN-p1lgRMNiQ",
      "duration": 6763,
      "language": "ko",
      "year": 1981,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:12.152Z"
}