{
  "imdbId": "youtube-8K6ICEku5xA",
  "title": "(Romance) It's a Joke, Son! 1947 | Kenny Delmar, Una Merkel, June Lockhart | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8K6ICEku5xA",
      "title": "(Romance) It's a Joke, Son! 1947 | Kenny Delmar, Una Merkel, June Lockhart | Full Movie",
      "description": "It's no joke that this is tops for laughs!\nThe first Eagle-Lion film stars Kenny Delmar as Senator Beauregard Claghorn, his \"Allen's Alley\" resident-character heard on Fred Allen's radio program.\n\nColorized version https://youtu.be/dVlqCCLvdwA\n\n\nOriginal title: It's a Joke, Son! (1947)\nThis film is subtitled in many languages\n\nDirector: Benjamin Stoloff \nWriters: Robert E. Kent, Paul Gerard Smith\nStars: Kenny Delmar, Una Merkel, June Lockhart\nGenres: Classics, Comedy, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:34 Humorous interactions and discussions about North and South divide, with a touch of political satire.\n07:24 A humorous family interaction unfolds as unexpected money arrives, leading to playful banter and misunderstandings.\n19:53 Hilarious misunderstandings and antics unfold during a ladies' meeting and a punch preparation.\n25:06 Financial support for a truck leads to unexpected political nomination and success.\n31:19 Political shenanigans ensue as characters navigate a campaign filled with bribery, threats, and unexpected alliances.\n40:27 Political campaign speech filled with humor and satire, leading to unexpected outcomes.\n44:02 Investigation into the disappearance of a senatorial candidate leads to speculation and family concern.\n51:41 A comedic and chaotic situation unfolds as characters navigate a political campaign and kidnapping.\n57:30 Comical events unfold as Bard Claghorn disappears before the election, causing chaos and a victory parade.\n\n\n@CultCinemaClassics Members-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "8K6ICEku5xA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:49.215Z"
}