{
  "imdbId": "youtube-XVBxtAJAlf4",
  "title": "El Brazo de Diamantes | COMEDIA DE DETECTIVES | Subtitulos en Español",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XVBxtAJAlf4",
      "title": "El Brazo de Diamantes | COMEDIA DE DETECTIVES | Subtitulos en Español",
      "description": "Semión Gorbunkov se va de crucero. En Estambul, resbala y se rompe el brazo. Lo que no sabía es que era una señal para una banda de contrabandistas (una contrabandista real, Gena, también estaba en el mismo barco). Así que le vendan el brazo con oro y diamantes. Al regresar a casa, los gánsteres intentan recuperar sus pertenencias, mientras la policía intenta atraparlos usando a Gorbunkov y su brazo.\n\nUna comedia que conserva el sabor de una época y refleja la sensibilidad de una generación. Así pues, no es solo una comedia, sino un viaje a la realidad soviética cotidiana. El inspirado reparto, el inteligente uso de clichés y gags son los mejores ingredientes para crear una lección sobre la Unión Soviética. Una película que explora situaciones para una imagen fresca de las situaciones sociales. Una comedia con el don de crear una imagen diferente de la época, utilizando la ironía y los clichés, los deseos y los matices. Una película que se mantiene encantadora década tras década, y esa es la virtud fundamental del cine. Año de producción: 1968\n\nDirigida por: Gaidai Leonid\nEscrito por: Gaidai Leonid, Kostyukovsky Yakov, Slobodskoy Maurice\nMúsica: Zatsepin Alexander\n\nProtagonizada por: Filippov Roman, Shpigel Grigory, Kanevsky Leonid, Mordyukova Nonna, Papanov Anatoly, Chekan Stanislav, Nikulin Yuri, Mironov Andrey, Gulyaev Vladimir, Grebeshkova Nina, Romanov Nikolay, Svetlichnaya Svetlana",
      "id": "XVBxtAJAlf4",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-23T03:43:50.422Z"
}