{
  "imdbId": "youtube-Yes16ubQMBg",
  "title": "Die Stimme des Regenwaldes (ABENTEUERFILM nach wahren Begebenheiten, ganzer Film auf Deutsch 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Yes16ubQMBg",
      "id": "Yes16ubQMBg",
      "title": "Die Stimme des Regenwaldes (ABENTEUERFILM nach wahren Begebenheiten, ganzer Film auf Deutsch 2025)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Auf der Suche nach einer Erfahrung, die tiefer geht als die Oberflächlichkeit der modernen Welt, Schweizer Bruno Manser in den Dschungel von Sarawak, dem malayischen Teil der Insel Borneo, und findet sie bei dem nomadischen Penan-Stamm. - Bruno Manser war der bekannteste Umwelt- und Menschenrechtsaktivist der 1980er und 1990er Jahre.\n\nDIE STIMME DES REGENWALDES (2019)\nOriginaltitel: Bruno Manser - Die Stimme des Regenwaldes\nMit: Sven Schelker, Nick Kelesau, Elizabeth Ballang\nRegie: Niklaus Hilber\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\n1984: Auf der Suche nach einer Erfahrung, die tiefer geht als die Oberflächlichkeit der modernen Welt, reist der 29-jährige Schweizer Bruno Manser (Sven Schelker) in den Dschungel von Sarawak, dem malayischen Teil der Insel Borneo, und findet sie bei dem nomadischen Penan-Stamm. Es ist eine Begegnung, die sein Leben für immer verändert. Schon lange war es sein Traum, ein Leben abseits der Industrialisierung und des Konsums zu führen.\nAls die Existenz der Penan durch unerbittliche Abholzung bedroht ist, nimmt Manser den Kampf gegen die Abholzung mit Mut und Entschlossenheit auf. Sein Einsatz macht ihn zu einem der renommiertesten und glaubwürdigsten Umweltschützer seiner Zeit. Letztendlich kostet ihn das alles.\n#Netzkino #ganzerFilm #abenteuer\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:47:56.574Z",
      "thumbnail": "https://i.ytimg.com/vi/Yes16ubQMBg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLChfmygwm-DN0dN-t921ZJLLMyuUw",
      "duration": 8532,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}