{
  "imdbId": "youtube-jZR_-aE4Wgs",
  "title": "바보사냥(1984) / Hunting for Idiots (Babosanyang) (1984)",
  "year": 1984,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jZR_-aE4Wgs",
      "title": "바보사냥(1984) / Hunting for Idiots (Babosanyang) (1984)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03808\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03808\n\n감독(Director) : 김기영(Kim Ki-young)\n\n출연 : 엄심정 , 김병학 , 배규빈 , 김인문 , 김원섭\n\n줄거리 :  대학졸업정원제의 공포를 견디지 못해 자살을 기도하여 정신병원에 입원한 동료환자 홍익을 설득하여 병원을 탈출한다. 여러 사건을 겪다가 광부가 된 그들은 바보처녀 석호를 만나 토끼섬 건설을 위해 남해의 무인도로 향한다. 그러나 섬으로 출발하기 직전에 석호는 토끼섬은 정신착란자의 환상이라 판단하여 석호와 함께 도망친다. 버려진 홍익은 절망을 느끼나 정신병으로 아들을 죽게 한 주막의 할머니, 할아버지와 합세하여 무인도를 향해 나룻배를 띄운다. \n\nCasts : Eom Sim-jeong , Kim Byeong-hak , Bae Gyu-bin , Kim Inmoon , Kim Wonseop \n\nSYNOPSIS : Seok-ho is unable to overcome his fear that he will not graduate from college for only a limited number of the class will get their diplomas. Seok-ho tries to kill himself and ends up in a mental institution. Then he persuades his fellow patient, Hong-ik, to escape with him. After dealing with several incidents, they become miners. They meet a simple young woman. In order to construct an ideal land, they head for a deserted island in the South Sea. However, just before they're about to leave for the island, Seok-ho realizes that the island is a fantasy of an insane man so he runs off with the woman. Left behind, Hong-ik is disheartened but he gets together with the elderly innkeeper couple whose own son died of a mental illness. They head for the deserted island on a boat.",
      "id": "jZR_-aE4Wgs",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:17.450Z"
}