{
  "movieId": "youtube-L5kaUIuqKFo",
  "title": "The Widow (Mimang-in)(1955)",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L5kaUIuqKFo",
      "id": "L5kaUIuqKFo",
      "title": "The Widow (Mimang-in)(1955)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00283\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00283\n\nDVD 소책자 : https://www.kmdb.or.kr/history/book/2362\n\n감독(Director) : 박남옥(Park Nam-Ok)\n출연 : 이민자(이신자),이택균(택),최남현,유계선,나애심(진),박영숙(이사장의 처),신동훈(이성진 사장),노강,이성주(딸 주)\n\n줄거리 : 딸 주(이성주)를 데리고 피난생활을 하는 이신자(이민자)는 6·25 때 죽은 남편의 친구였던 이성진 사장(신동훈)의 도움으로 생계를 유지한다. 그러나 친구의 아내를 도와주어야 한다는 이 사장의 도의심은 신자에 대한 애정으로 변한다. 이를 눈치 챈 이 사장의 처(박영숙)는 강렬한 질투와 히스테리로 남편을 추궁하다 못해 우연히 알게 된 젊은 남자 택(이택균)에게서 마음의 빈터를 채우려 한다. 택과 사장 부인의 불장난은 택이 해수욕장에서 익사하려던 신자의 딸 주를 구출함으로써 각도가 달라진다. 신자는 이 사장의 유혹을 받으나 뚝섬에서 딸의 목숨을 구해준 청년 택과 사랑에 빠지게 되고, 택과의 동거를 위해 딸을 다른 집에 맡겨버린다. 그러나 전쟁 중 죽은 줄 알았던 택의 옛 애인 진(나애심)이 나타난다. 택은 신자를 떠나고 그녀는 방황한다. 이미 진에게 안착한 택은 신자에게 이별을 고하지만 택과의 애정생활 속에서 진실을 찾으려던 신자는 충격을 받아 택을 향해 칼날을 든다.\n\nCasts : Lee Min-Ja,Lee Tak-Kyun,Choi Nam-Hyeon,Yoo Kye-Seon,Na Ae-Sim\n\nSYNOPSIS : Sin-ja (Lee Min-ja) living in exile with her daughter Ju (Lee Seong-ju) ekes out a living thanks to a company president Lee Sung-jin (Sin Dong-hun), a friend of her husband who passed away during the Korean War. But Lee starts to fall in love with her as he helps her. Then Lee's wife (Park Yeong-suk) notices it and feels jealous, becoming ever more hysterical. She wants to fill the emptiness with the love for a young man she happens to know. His name is Taek (Lee Taek-gyun). One day Ju, the daughter of Sin-ja, is about to drown in the sea, and Taek saves her. The love affair between Taek and Lee's wife then changes. Lee tempts Sin-ja to love him, but she falls in love with Taek, who had saved her daughter's life. She even sends her daughter to somebody else's house to live with Taek. Taek's lover, Jin (Na Ae-sim), whom he thought had died during the war, appears out of the blue. Taek leaves Sin-ja, and she is at a loss. Taek settles in with Jin, and tells Sin-ja he wants to break up with her. Sin-ja raises a knife because she is just so shocked by this.",
      "addedAt": "2025-12-26T00:25:24.412Z",
      "thumbnail": "https://i.ytimg.com/vi/L5kaUIuqKFo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBtLAO0xPmy5Ol-mrDbvsU9be5QRQ",
      "duration": 4508,
      "language": "ko",
      "year": 1955,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:24.444Z"
}