{
  "imdbId": "youtube-B9pPVP47rgY",
  "title": "Special investigation headquarter A life of Miss Kim Su-Im(Teugbyeolsusabonbu Gim Suim-ui)(1974)",
  "year": 1974,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=B9pPVP47rgY",
      "id": "B9pPVP47rgY",
      "title": "Special investigation headquarter A life of Miss Kim Su-Im(Teugbyeolsusabonbu Gim Suim-ui)(1974)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02743\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02743\n\n주성철 영화평론가의 관련 글을 읽고 싶으시면 아래 주소를 클릭하세요.\n[삐용삐용B무비] https://www.kmdb.or.kr/story/74/1671\n\n감독(Director) : 이원세(Lee Won-Se)\n출연 : 윤소라,신일용,이순재,문오장,이강조,김영인,최무웅,김웅,최준,김기범,윤일주,로버트 아이어스,개리 악셀슨,바바리 몽고메리,애리시아 웹,체리 더그라스,레리 챤드러,윌리암 제이 드릭크너 쥬니어\n\n줄거리 : 1948년 주한 정보대장 페이드 대령의 첩 김수임은 남로당에 가입, 많은 정보를 제공하다 체포되어 오검사에게 지난날의 일들을 말한다. 이화 보통여자중학교에 입학한 수임은 이복 오빠인 최만용에게 끌려가 17살의 어린 나이로 농부에게 시집가서 이듬해 그 집을 나와 학교를 마치고 이화여전에 진학한다. 이강국이라는 청년과 열애에 빠진 수임은 졸업을 하고 병원에 취직하며, 강국은 박헌영의 지시로 월북한다. 몇년이 지나서 공산주의자가 되어 나타난 최만용은 이강국을 미끼로 그녀를 남로당에 입당시키고 수임은 사랑이라는 이름으로 북의 지령을 수행하였던 것이다. \n\n\nCasts : Shin Il-Ryong, Yoon So-Ra, Moon Oh-Jang\n\nSYNOPSIS : Kim Su-Im, the head of Information Agency in Korea Colonel Peard's mistress, joined the communists party of South Korea and provided various information. As she is arrested by prosecutor Oh, she told him her past. She entered in Ewha girls' shcool but she is pulled out by her half brother Choi Man-Yong to marry to a farmer at her age of 17. But the next year she ran out of home to finish her high school education and entered in Ewha Woman's University. She falls in live with a young man Lee Kang-Kuk and gets a jon in a hospital after graduation while Kang-Kuk goes to North Korea under the order of Park Heon-Young. A few years later, Choi Man-Yong appeared to her as a communist to make her join the communists party in South Korea by using Kang-Kuk as a bait. After that Su-Im carried out the missions ordered by North Korea under the alias Sarang.",
      "addedAt": "2025-12-26T00:23:56.512Z",
      "thumbnail": "https://i.ytimg.com/vi/B9pPVP47rgY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBi0828kSnDluoyMJ9_O4wSpTaEDA",
      "duration": 6280,
      "language": "ko",
      "year": 1974,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:56.555Z"
}