{
  "imdbId": "youtube-mmLEh-oaKEg",
  "title": "Der schwarze Tod (THRILLER FILME auf Deutsch komplett, Mystery Thriller ganzer Film, neue Filme)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mmLEh-oaKEg",
      "id": "mmLEh-oaKEg",
      "title": "Der schwarze Tod (THRILLER FILME auf Deutsch komplett, Mystery Thriller ganzer Film, neue Filme)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Spannend-düsterer Pest-Thriller vor mittelalterlicher Kulisse mit Superstar LENA HEADEY (\"Game of Thrones\" & \"300\") England im Pestjahr 1348: Eine Lady wartet auf ihren Mann – stattdessen bringt ein Ritter eine Geisel, ein dunkles Geheimnis und eine tödliche Bedrohung ins Dorf. Bald liegt mehr als nur Krankheit in der Luft.\n\nDER SCHWARZE TOD (2002)\nOriginaltitel: Anazapta\nMit: Jason Flemyng, Lena Headey, David La Haye\nRegie: Anazapta\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDas 14. Jahrhundert war ein schwarzes Kapitel in der Geschichte Englands. Ab 1348 erreichte Pest das Inselreich Großbritannien und fordert zahlreiche Opfer. In England wartet Lady Matilda (Lena Headley) auf ihren Gatten Sir Walter Mellerby (Jon Finch), der zuvor in den britisch-französischen Krieg gezogen war. Stattdessen erreicht Sir Nicholas (Jason Flemyng) das traute Heim der einsamen Lady.  Dieser hat Jacques (David La Haye) als Geisel bei sich, der wiederum der Sohn jenes französischen Grafen ist, der anscheinend Matildas Mann in Gefangenschaft hält. Die Protagonisten dieser Konstellation beabsichtigen nun die beiden Geiseln gegeneinander einzutauschen. Doch der ungewollte, französische Gast bringt kurz darauf Unheil über die kleine Gemeinde.  Ein uraltes Geheimnis erblickt nach und nach erneut das Tageslicht und nicht bald darauf, beginnt in dem Dorf eine mysteriöse Todesfallserie seinen Lauf zunehmen…\n#Netzkino #ganzerFilm #Thriller\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:46:23.532Z",
      "thumbnail": "https://i.ytimg.com/vi/mmLEh-oaKEg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC27CJLZ93xOWtQtin5ohuUGgZ_1w",
      "duration": 6588,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}