{
  "imdbId": "youtube-5myY1ILoN8E",
  "title": "Africa Screams (Abbott & Costello , 1949) Adventure, Comedy | Movie, Subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5myY1ILoN8E",
      "title": "Africa Screams (Abbott & Costello , 1949) Adventure, Comedy | Movie, Subtitles",
      "description": "Two booksellers search for diamonds in Africa, along the way meeting a visually-impaired gunner, a hungry lion, and a tribe of cannibals.\n\nOriginal title: Africa Screams (1949)\n\nDirector: Charles Barton\nWriters: Earl Baldwin, Martin Ragaway, Leonard Stern\nStars: Bud Abbott, Lou Costello, Clyde Beatty, Hillary Brooke\nGenres: Classics, Comedy, Adventure, Action\n\n00:00 Full Movie\n01:25  Stanley Livington is asked to draw a map from a book called 'Dark Safari' for $1,000.\n06:15  A comedic conversation between two characters about a silly-looking guy and a business deal.\n12:07  Stanley Livington, a self-proclaimed great hunter, meets Clyde Beatty and they discuss their experiences with taming lions.\n22:03  Stanley is asked to draw a map but ends up drawing directions to a department store instead.\n24:48  Stanley and Buzz get into various comedic mishaps while on an adventure in the jungle.\n30:42: Buzz and Stanley encounter Frank Buck while setting traps in the jungle.\n38:09  Stan and Ollie discuss diving into a river with crocodiles and impersonate animals.\n43:49  Stanley gets trapped inside a lion's cage and is unable to escape, leading to his demise.\n54:00  Stanley and Buzz find diamonds in the jungle.\n1:06:22  A man finds diamonds in the jungle and tries to hide them from his companions.\n1:09:52  A man named Stanley loses his diamonds and feels lost and alone.\n\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "5myY1ILoN8E",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "abbott-and-costello",
      "name": "Abbott and Costello"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:43:07.296Z"
}