{
  "imdbId": "youtube-vksAebPwzk0",
  "title": "Der Winterprinz - Miras magisches Abenteuer - Jetzt den ganzen Film kostenlos in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vksAebPwzk0",
      "title": "Der Winterprinz - Miras magisches Abenteuer - Jetzt den ganzen Film kostenlos in HD bei Moviedome",
      "description": "Jetzt den Fantasie-Familienfilm \" Der Winterprinz“ in ganzer Länge bei #Moviedome sehen.\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nEin magisches Winterabenteuer für die ganze Familie! \nKevin und Eiril müssen die Kräfte unserer Welt und des magischen Königreichs Ridderdalen vereinen, um den bösen Zauberer Lord Snerk zu stoppen.\nDer böse Lord, der darauf erpicht ist, das Tal der Ritter zu beherrschen, stiehlt eine magische Rüstung und ist entschlossen, die junge Königin wegen des fehlenden Teils, des Handschuhs zur Schneeerzeugung, zu jagen. Aber zwei mutige Kinder aus unserer Welt kommen zu ihrer Rettung.\n\nJetzt “ Der Winterprinz - Miras magisches Abenteuer” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Kinderfilm #Weihnachten\n \nFilmlänge: 93 Minuten \nFSK: 6\nRegie: Thale Persen\nDrehbuch: Lars Gudmestad, Harald Rosenlow-Eeg\nDVD-Start (DE): 2015\n\nDie Darsteller\nStella Stenmann in der Rolle der Mira\nBjarte Tjostheim in der Rolle des Anton\nTone Beate Mostraum in der Rolle der Sara\nVetle Qvewnild Werring in der Rolle des Kevin\nKyrre Hellum in der Rolle des Snerk\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nDen Fantasie-Familienfilm „ Der Winterprinz - Miras magisches Abenteuer ” in voller Länge auf deutsch ansehen.",
      "id": "vksAebPwzk0",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:35:12.509Z"
}