{
  "imdbId": "youtube-gUM6MZ96gMI",
  "title": "Attack Force Z 1981 (Action Movie) Mel Gibson blasting his way to hell and back!",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gUM6MZ96gMI",
      "id": "gUM6MZ96gMI",
      "title": "Attack Force Z 1981 (Action Movie) Mel Gibson blasting his way to hell and back!",
      "description": "Mission impossible, heroes unstoppable.\nDuring World War II, a special operations team of Australian commandos known as Attack Force Z is deployed to a remote Pacific island on a daring mission to extract key survivors and gather vital intelligence. Amidst the perilous jungle and enemy forces, the commandos must rely on their wits and training to succeed against overwhelming odds.\n\nOriginal title: Attack Force Z (1981)\nDubbed audio & subtitles available in many languages.\n\n\nDirector: Tim Burstall\nScript: Roger Marshall\nCast: John Phillip Law, Mel Gibson, Sam Neill, Chris Haywood, Sylvia Chang, John Waters\nGenres  Action, Drama, History, War\n\n\n00:00 – Full Movie with subtitles\n01:15 – 15 January 1945: Captain Kelly briefs his team on the mission to rescue plane crash survivors on a Japanese-occupied island.\n12:45 – Lieutenant Veitch eliminates a Japanese sentry, securing a safe path for the squad's advance.\n25:30 – Sergeant Costello discovers a hidden cache of enemy weapons, altering their strategic approach.\n38:15 – Able Seaman Bird engages in a tense standoff with Japanese soldiers, showcasing his combat prowess.\n51:00 – The team encounters local resistance fighters, forging an alliance to navigate the hostile territory.\n1:03:45 – Captain Kelly confronts a moral dilemma after uncovering sensitive information from a captured enemy officer.\n1:16:30 – The squad initiates a daring extraction under heavy fire, culminating in a critical decision that impacts their mission's outcome.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:27.575Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/gUM6MZ96gMI/maxresdefault.webp",
      "duration": 5389,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "TR"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:27.696Z"
}