{
  "imdbId": "youtube-SUDmlk45xx4",
  "title": "Ferien auf dem Reiterhof - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SUDmlk45xx4",
      "id": "SUDmlk45xx4",
      "title": "Ferien auf dem Reiterhof - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Familienfilm \" Ferien auf dem Reiterhof“ in ganzer Länge bei #Moviedome sehen.\n\nKathy wollte schon immer auf den Black-River-Reiterhof. Ihre Eltern halten von der Idee aber nicht viel, nach einem Rodeounfall des Vaters. Dennoch erlauben sie den Urlaub, damit Kathy Kontakte knüpfen kann. Im Camp wird sie mit Stacy und Lisa in eine Hütte gesteckt, was zunächst nicht so einfach scheint. Doch zu Pferde erweist sich Kathy als Naturtalent und gewinnt bald an Selbstbewusstsein...\n\n“Alles Glück dieser Erde liegt auf dem Rücken der Pferde“. Selten nur war ein altbekanntes Sprichwort so passend für einen Film wie für Ferien auf dem Reiterhof . Denn dieser Familienfilm ist wirklich ideal für kleine und große Pferdefans: Die authentische Reiterhofatmosphäre mit vielen Reit- und Dressur-Szenen lässt alle Mädchenherzen höher schlagen und die emotionale Story ist ein wunderschönes Beispiel für die Kraft der Freundschaft!\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\nJetzt den #Familienfilm “ Ferien auf dem Reiterhof ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama\n \nOriginaltitel: Horse Camp\nFilmlänge: 107 Minuten \nRegie: Joel Paul Reisig\nFSK: 6\nDVD-Start (DE): 2015\n\nDie Darsteller\nAnnelyse Ahmad in der Rolle der Miss Katy\nJordan Trovillion in der Rolle der Katy\nJoshua Ray Bell in der Rolle des Josh\nKristen Ryda in der Rolle der Stacy\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nDen Familienfilm \"Ferien auf dem Reiterhof“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:07.737Z",
      "thumbnail": "https://i.ytimg.com/vi/SUDmlk45xx4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDAxygjQjiJ1Rk1SEUeCCR3X0YIdA",
      "duration": 6440,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:07.798Z"
}