{
  "imdbId": "youtube-Drz_bK4GkTE",
  "title": "The Road to Sampo (Sampoganeun gil)(1975)",
  "year": 1975,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Drz_bK4GkTE",
      "title": "The Road to Sampo (Sampoganeun gil)(1975)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02890\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02890\n\n영화글\nhttps://www.kmdb.or.kr/story/10/1960\nhttps://www.kmdb.or.kr/story/10/1963\n\n감독(Director) : 이만희(Lee Man-Hee)\n출연 : 김진규(정씨),백일섭(노영달),문숙(백화),김기범,김용학,석인수,석명순,장인환,최재호\n\n줄거리 : 공사장을 떠돌아다니는 젊은 노동자 영달(백일섭)은 밥집 여주인과 바람을 피우다 들켜 도망 나온다. 영달은 눈밭에서 옷을 입다 중년의 정 씨(김진규)를 만난다. 정 씨는 교도소를 나와 10년 만에 고향 삼포로 향하는 길이다. 눈길을 헤치고 걸어가던 두 사람은 시장기를 때우러 식당에 들르고, 여주인으로부터 도망친 작부 백화(문숙)를 붙잡아주면 돈 만 원을 주겠다는 제안을 받는다. 눈보라를 헤치고 걸어간 끝에 그들은 다리 밑에서 백화와 마주친다. 백화가 호락호락하지 않아 영달과 줄곧 티격태격하지만, 세 사람은 함께 길을 떠나기로 한다.\n정처 없이 눈길을 걷던 그들은 폐가에서 하루 묵기로 한다. 모닥불 앞에서 영달은 자신의 과거를 회상하고, 예민해진 영달과 말다툼을 한 백화는 읍내로 내려가버린다. 백화를 찾으러 읍내로 내려간 정 씨와 영달은 선술집에서 싸우고 있는 그녀를 발견한다. 정씨는 아버지인 척 연기해 백화를 구해낸다. 그날 밤 영달과 백화는 같이 잠자리한다. 백화는 영달과 함께 살기를 원하지만 영달은 장바닥에 그녀를 떼어놓고 역으로 가버린다. 백화가 역으로 찾아오자 영달은 돈을 털어 기차표를 사준다. 하지만 백화는 기차를 타지 않는다. 영달은 일꾼들을 만나 공사판으로 떠나고 정 씨는 큰 다리가 놓인 삼포의 모습에 충격을 받는다.\n\nCasts : Baek Il-Seob, Kim Jin-Kyu, Moon Suk,. Kim Ki-Beom, Kim Yong-Hak, Seok In-Su\n\nSYNOPSIS : Going through a jail and a site of construction, a young laborer Young-Dal meets middle aged Mr. Jeong on his way to his hometown Sampo after ten years' absence. They become to know a waitress Baek-Hwa who runs away from a restaurant and then, they travel together.  Arriving at the destination Kangcheon Station, Mr. Jeong is disappointed at the changes of the old village by building a hotel. Young-Datl and Mr. Jeong stay at Sampo not as the hometown but as the site of living. Baek-Hwa leaves Sampo with a ticket Young-Dal buys her with his last money.",
      "id": "Drz_bK4GkTE",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:18.389Z"
}