{
  "imdbId": "youtube-cAv3OZhAJRQ",
  "title": "NEW HD RESTORATION🍕 Sins of Jezebel (1953) Paulette Goddard🍕BIBLICAL EPIC",
  "year": 1953,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cAv3OZhAJRQ",
      "id": "cAv3OZhAJRQ",
      "title": "NEW HD RESTORATION🍕 Sins of Jezebel (1953) Paulette Goddard🍕BIBLICAL EPIC",
      "description": "It's Friday @PizzaFLIX \nStars: Paulette Goddard, George Nader, Eduard Franz\nDirector: Reginald Le Borg\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TXEBMtSqYpWfok-xg95KXao\nExplore a lesser-known screen appearance by Paulette Goddard, an actress whose career uniquely bridged Hollywood’s studio golden age and the evolving postwar film industry. Rising to fame in the 1930s, Goddard became one of the era’s most recognizable stars, admired for her intelligence, independence, and versatility across comedy, drama, and prestige productions. By the early 1950s, her roles were more selective, making this production an intriguing example of her later film work.\n\nSet in the 9th century B.C., this sweeping Biblical drama unfolds in the ancient city of Jezreel, where King Ahab rules Israel and seeks to secure his dynasty through a politically advantageous marriage. Hoping to strengthen trade and power, Ahab takes Princess Jezebel of Phoenicia as his queen—despite dire warnings from the prophet Elijah and the loyal statesman Naboth.\n\nProduced by Lippert Productions, Inc. and Jezebel Productions, Inc., and directed by Reginald Le Borg, the film stars Paulette Goddard in a commanding portrayal of Jezebel, whose ambition, seduction, and devotion to the pagan god Baal plunge Israel into turmoil. George Nader plays Jehu, a celebrated soldier torn between duty, desire, and destiny, while Eduard Franz delivers a tragic performance as King Ahab.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nWritten by Richard Landau and produced by Sigmund Neufeld, the story traces Jezebel’s rise to power, the persecution of Elijah’s followers, and the devastating drought brought on by divine prophecy. As famine grips the land and faith is tested, Jehu ultimately rejects Jezebel’s influence, fulfills prophecy, and leads Israel toward restoration.\n\nA vivid example of 1950s Hollywood Biblical filmmaking, this epic blends romance, betrayal, and spiritual conflict into a powerful tale of ambition and consequence.\n\n#Fullmovie #SinsOfJezebel #ClassicFilm #BiblicalEpic #PauletteGoddard #GeorgeNader #GoldenAgeHollywood #1950sCinema #FilmHistory #ClassicMovies #Friday@PizzaFLIX #pizzaflix",
      "addedAt": "2025-12-26T23:40:44.445Z",
      "thumbnail": "https://i.ytimg.com/vi/cAv3OZhAJRQ/maxresdefault.jpg",
      "duration": 4503,
      "language": "en",
      "year": 1953,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:40:44.539Z"
}