{
  "imdbId": "youtube-Mhno3XhD7gQ",
  "title": "Rice ( Ssal )(1963)",
  "year": 1963,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Mhno3XhD7gQ",
      "id": "Mhno3XhD7gQ",
      "title": "Rice ( Ssal )(1963)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00945\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00945\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 신영균,최은희,남궁원,최걸,이기홍,송일근,임동훈,박상준,한은진,고선애,한미나,최난경,한미자,김명희,반만희,오경주,김희준,유영숙,김연순,이명은,최소자,김연화,허장강,김희갑,곽규석,김해룡,정동일,김한섭,정운강,김맹환,황건,신찬일,나종택,최삼,변기종,윤왕국,장훈,주증녀,윤인자,나애심,전옥,석금성,지계순\n\n줄거리 : 상이군인인 차용(신영균)은 아버지가 위독하다는 소식을 듣고 무주구천동 산골짜기에 있는 고향으로 돌아간다. 용이의 고향은 대부분이 메마른 황무지로 쌀을 구하기 힘들어 마을 사람들은 가난으로 고생하고 있다. 아버지가 죽은 후 용은 가난을 벗어나야겠다는 신념을 갖고 바위산에 굴을 뚫어 황무지에 물을 대는 계획을 세운다. 계모(한은진)의 전폭적인 지원과 동네 친구 건배(허장강), 갑득(김희갑)의 도움을 받아 마을 사람들을 모은 용이는 지방관청에 찾아가 보조금을 요청하지만 공무원들은 선거를 핑계로 지원을 미룬다. 굴 파기에 동조했던 마을 사람들이 영양실조와 고된 노동으로 하나 둘 쓰러지자 용이를 불신하기 시작한다. 게다가 이 마을의 부자인 송의원(최삼)은 용을 못마땅하게 생각해 그의 사업에 훼방을 놓기 시작한다. 동네무당 갑순 모(전옥)는 송의원에게 매수되어 용이의 사업이 산신령을 노하게 해서 사람들이 쓰러졌다고 소문을 퍼뜨린다. 한편 송의원의 딸 정희(최은희)는 용이와 결혼을 약속한 사이나 용은 다리를 다친 이후 정희를 만나기를 거부한다. 송의원이 정략결혼을 시켜버리려 하자 정희는 서울로 도망간다. 보조금이 나오지 않자 친구들도 등을 돌리고 용의 동생 영란(최난경)은 오빠를 돕고자 술집으로 간다. 4ㆍ19가 일어나 새 정부가 들어선 후에도 각 부처들은 다른 부처로 일을 미루기에만 바쁘다. 정희는 고향으로 돌아와 적극적으로 용이를 돕는다. 박정희 정부가 들어서고 정부가 용의 사업을 전폭적으로 지원하자 송의원을 비롯한 마을사람들은 모두 힘을 모은다. 마침내 굴이 뚫리고 황무지에 물줄기가 쏟아진다.\n\nCasts : Shin Young-Kyun, Choi Eun-Hee, Kim Hee-Gap,Choi Nan-Kyeong\n\nSYNOPSIS : Poor peasants in Gucheon-dong, Muju City have no land to cultivate, so they hardly ever eat even a grain of rice. So a man of tenacity begins to excavate a tunnel through a mountain to draw water from the Geum River. But it is not easy work, failing many times despite of his iron will. He completes the waterway by the virtue of desperate efforts of villagers who follow him and the full support of the government after the revolution on the 16th of May in 1961. Now there they can produce rice in Gucheon-dong.",
      "addedAt": "2025-12-26T00:24:48.806Z",
      "thumbnail": "https://i.ytimg.com/vi/Mhno3XhD7gQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAPY3ckzVQymrV8KY5tgMwxBkqrCA",
      "duration": 7494,
      "language": "ko",
      "year": 1963,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:48.913Z"
}