{
  "imdbId": "youtube-8JZ0NlN2-TU",
  "title": "Battle of Finland (WAR FILM full movie in full length German, German movies complete 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8JZ0NlN2-TU",
      "title": "Battle of Finland (WAR FILM full movie in full length German, German movies complete 2025)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Juni 1944: In der größten Schlacht Nordeuropas stellt sich die zahlenmäßig unterlegene finnische Armee der Roten Armee entgegen. Zwischen Panzern, Sturmgeschützen und Luftangriffen kämpfen Soldaten – und Söhne – für die Unabhängigkeit ihres Landes.\n\nSCHLACHT UM FINNLAND – TALI-IHANTALA 1944 (2007)\nOriginaltitel: Tali-Ihantala 1944\nMit: Rauno Ahonen, Mikkomarkus Ahtiainen, Frank Biermann\nRegie: Åke Lindman, Sakari Kirjavainen\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nJuni 1944. Die Rote Armee startet eine Großoffensive gegen Deutschland und Finnland. Den Finnen droht die totale Besetzung durch die Sowjetunion. Zahlenmäßig stark unterlegen bereitet die finnische Armee Gegenangriffe auf die Russen vor. General Lagus führt eine Panzerdivision und Jägerbrigaden ins Gefecht. Zum ersten Mal kämpft auch sein Sohn mit an vorderster Front. An der Kanone eines Sturmgeschützes erlebt er seine Feuertaufe. Zusammen mit dem jungen Panzerfahrer Virtanen attackieren sie die russischen Panzer. Leutnant Osmo führt das erste Panzerabwehrbataillon, welches die Russen mit Panzerfäusten aufhalten soll. Luftunterstützung erhalten sie von den Stukas und Focke-Wulfs des Gefechtsverbandes Kuhlmey. Die entscheidende Schlacht von Tali-Ihantala steht bevor.\n\nRegisseur Åke Lindman erzählt mit diesem Film den finnischen Kampf um Unabhängigkeit im Zweiten Weltkrieg. Die Schlacht von Tali-Ihantala gilt als die größte jemals in Nordeuropa geschlagene Schlacht. Die Figuren und Handlungen beruhen auf wahren Begebenheiten und Erzählungen von Veteranen.\n#Netzkino #ganzerFilm #Kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "8JZ0NlN2-TU",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}