{
  "imdbId": "youtube-IpIW54mN5Fk",
  "title": "Charlie Chan | The Trap (1946) [Crime] [Mystery] [Comedy]",
  "year": 1946,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IpIW54mN5Fk",
      "title": "Charlie Chan | The Trap (1946) [Crime] [Mystery] [Comedy]",
      "description": "\"The Trap\" (also known as \"Charlie Chan In the Trap), is a 1946 crime film directed by Howard Bretherton. The main premise is two members of a show troupe are murdered, and Charlie Chan is called in to solve the case.\n\nThis was Sidney Toler's final film and his final one as the detective Charlie Chan, his 17th of the series. Stricken with cancer during his last few films, Toler was so physically weak during filming that he could hardly walk or say his lines coherently.\n\n---\n\nDirected by Howard Bretherton, produced by Herman Schlom, written by Earl Derr Biggers, starring Sidney Toler as Charlie Chan, Victor Sen Yung as Jimmy Chan (as Sen Yung), Mantan Moreland as Birmingham Brown, Tanis Chandler as Adelaide Brandt, Larry J. Blake as Rick Daniels (as Larry Blake), Kirk Alyn as Sgt. Reynolds, Rita Quigley as Clementine, Anne Nagel as Marcia, Helen Gerald as Ruby, Howard Negley as Cole King (Impresario), Lois Austin as Mrs. Thorn, Barbara Jean Wong as San Toy, Minerva Urecal as Miss Weebles (the Housekeeper), Margaret Brayton as Madge Mudge, Bettie Best as Winifred, Jan Bryant as Lois and Walden Boyle as Doc Brandt. \n\n---\n\nSource: \"The Trap (1946 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 1 April 2013. Web. 07 April 2013. http://en.wikipedia.org/wiki/The_Trap_(1946_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "IpIW54mN5Fk",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T22:41:33.805Z"
}