{
  "movieId": "youtube-ErJRSoqC9Fs",
  "title": "The Fat Spy (1966, Comedy film) Jayne Mansfield, Phyllis Diller, & The Wild Ones",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ErJRSoqC9Fs",
      "id": "ErJRSoqC9Fs",
      "title": "The Fat Spy (1966, Comedy film) Jayne Mansfield, Phyllis Diller, & The Wild Ones",
      "description": "It's a killer... a Diller... a blast of laffs!  Off the coast of Florida, a nearly-deserted island is rumored to have the fountain of youth. A boatload of youths are headed there for a scavenger hunt.\n\nOriginal title: The Fat Spy (1966)\nThis film is subtitled in many language options.\n\nDirector: Joseph Cates\nWriter: Matthew Andrews \nStars: Phyllis Diller, Jack E. Leonard, Brian Donlevy, Jayne Mansfield & The Wild Ones\nGenres: 60s Movies, Comedy, Musical, B-movie\n\n\n00:00 A group of teenagers arrives on a mysterious island, sparking a treasure hunt.\n06:08 Junior learns about the teens' arrival and vows to investigate their intentions.\n13:40 Camille Salamander schemes to exploit the mythical Fountain of Youth for profit.\n24:35 Irving and Junior share a heartfelt moment, deepening their connection.\n45:00 Irving uncovers a vital clue about the Spanish shipwreck and its hidden treasure.\n57:23 The Fountain of Youth is revealed to be hidden in plain sight at Wellington's estate.\n69:50 The truth about the black twin roses, the key to eternal youth, is uncovered.\n76:33 Irving and Junior confront Camille and Herman, leading to a surprising resolution.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:33:21.710Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ErJRSoqC9Fs/maxresdefault.webp?v=677df557",
      "duration": 4922,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:33:21.810Z"
}