{
  "movieId": "youtube-uYGKerrhjO0",
  "title": "섬개구리 만세 (1972) / Long Live the Island Frogs! (Seomgaeguli manse)",
  "year": 1972,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uYGKerrhjO0",
      "id": "uYGKerrhjO0",
      "title": "섬개구리 만세 (1972) / Long Live the Island Frogs! (Seomgaeguli manse)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02589\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02589\n\n감독(Director) : 정진우(Chung Jin Woo)\n출연 : 신일용 , 유신희 , 정창성 , 이경희 , 박암\n\n줄거리 : 부부교사인 갑윤과 선희가 전남 신안내 사치섬에 도착했을때 섬은 선착장도 없는 낙도였다. 그들은 우매한 학부형과 주민들의 반발을 무릅쓰고 아이들을 학교로 불러모아 협동정신이 요구되는 농구부를 개설하여 연습시킨다. 드디어 사치분교 농구팀은 제1회 전국 스포츠 소년대회 전남 예선에서 우승을 하고, 서울대회까지 진출한다. 승승장구하던 사치분교의 승리 소식에 마을사람들은 열광하고, 환호소리에 걷지 못하던 상기가 일어서고, 태수는 엄마를 찾게 된다. 결승전에서 패배한 농구팀은 잠시 좌절감을 맛보지만 대통령의 초청장을 받고 기뻐하며 섬개구리들은 희망을 찾게 된다.\n\nCasts :Nam Jeong-im , Kim Gwang-su , Jo Mi-ryeong , Jeon Gye-hyeon , Gang Mi-ae\n\nSYNOPSIS :A couple, Kwon Gap-Yun and Kim Seon-Hee are teachers. When they arrive at Sachi island, it is an isolated island even without a wharf. They spend a whole month only to take children into school. To change the islanders' frustrated mind they start to introduce them sports which need cooperative spirits. But it is not many days before the islanders oppose them. In spite of that the teacher couple convinces them to practice again. At last they win a game in preliminary match of the first sports games for youth in Jeon Nam area and get a victory in the semifinals in Seoul game. Finally the island frogs get out of frustration and stands in dignity.",
      "addedAt": "2025-12-26T00:21:27.086Z",
      "thumbnail": "https://i.ytimg.com/vi/uYGKerrhjO0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCRK1RgRSdM3Ydp5yVmnNYTvacpng",
      "duration": 6794,
      "language": "ko",
      "year": 1972,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:27.130Z"
}