{
  "imdbId": "youtube-36Lie0s8d9M",
  "title": "Mary Higgins Clark: Haben wir uns nicht schon mal gesehen? (MYSTERY THRILLER ganzer Film, Krimis)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=36Lie0s8d9M",
      "title": "Mary Higgins Clark: Haben wir uns nicht schon mal gesehen? (MYSTERY THRILLER ganzer Film, Krimis)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Aushilfskellnerin Emily Winton (Nicolette Sheridan) wird von Stephen König (Page Fletcher) in ihrem Apartment überfallen und kommt nur knapp mit dem Leben davon. Der Angreifer behauptet, dass sie Schuld an ...\n\nOriginaltitel: Haven't We Met Before?\nMit: Nicollette Sheridan, Page Fletcher, Anthony Lemke\nRegie: René Bonnière\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nAushilfskellnerin Emily Winton wird von Stephen König in ihrem Apartment überfallen und kommt nur knapp mit dem Leben davon. Der schnell gefasste Angreifer behauptet, dass Emily Schuld an seinem Tod in einem früheren Leben sei. Denn er wäre die Reinkarnation eines Mannes, der 100 Jahre zuvor wegen eines Mordes gehängt wurde, den Emily in einem früheren Leben zu verantworten hatte. Detective Cobel hält die Geschichte für einen Trick, um Schuldunfähigkeit zu begründen. Er ist überzeugt, dass König für eine Reihe unaufgeklärter Morde verantwortlich ist. Königs Psychiaterin Dr. Stein glaubt jedoch ihrem Patienten und versucht, seinem Geheimnis auf die Spur zu kommen\n#Netzkino #ganzerFilm #krimi\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "36Lie0s8d9M",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}