{
  "imdbId": "youtube-QmfXjL0xFqI",
  "title": "Farewell my darling(Hagsaengbugunsin-wi)(1996)",
  "year": 1996,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QmfXjL0xFqI",
      "title": "Farewell my darling(Hagsaengbugunsin-wi)(1996)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04819\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04819\n\n영화글 : https://www.kmdb.or.kr/story/10/2022\n\n감독(Director) : 박철수(Park Cheol-Su)\n출연 : 방은진(금단),최성(아버지),문정숙(어머니),권성덕(호상),송옥숙(고마담),주진모(찬길),박재황(찬세),김일우(팔봉),정하현(혜리),추귀정(찬숙),박동현(태식),남포동(장달효),유명순(큰고모),홍윤정(작은고모),박지민(선영),김봉규(바우),최유경(미스리),김보라나(미스안),이무정(윤기사),주일몽(일가붙이),채훈(일가붙이),박철(일가붙이),임해림(일가붙이),홍충길(찬길친구),문철재(찬길친구),나갑성(찬길친구),김덕영(찬길친구),서평석(찬길친구),전영(찬길친구),이지산(찬길친구),임예심(동네아낙),정미경(동네아낙),손영순(동네아낙),조영이(동네아낙),국정희(동네아낙),최민금(동네아낙),한명환(자전거포주인),서창숙(찬세처),신동욱(국회의원),강민정(보화),하지윤(찬우딸),유은영(찬우딸),허재호(어린 찬우),정인학(어린 찬길),정기진(어린 찬세),김정미(어린 찬숙)\n\n줄거리 : 여느 날처럼 다방을 전전하던 박 노인은 폐달을 손보지 않은 자전거를 끌고 나갔다가 길바닥에서 사고로 사망한다. 박씨가 죽자 영화감독인 큰아들 찬우, 카페를 경영하는 골칫덩어리 딸 미선은 서둘러 고향으로 돌아오고 미국에 사는 셋째아들 찬세도 귀국한다. 적막한 시골엔 장례식 준비하느라 갑자기 분주해지면서, 초상집은 동네 사람들이 모여들며 소식을 묻고 옛 사람을 만나는 만남의 장이 된다. 자식들은 부친의 죽음을 애석해 하며 대성통곡하는데, 그 중에서도 부모 속을 썩이던 미선이 제일 가슴 아파하며 울음을 그치지 않는다. 상주인 찬우는 자기의 직업대로 부친의 죽음을 한편의 파노라마로 인식하고, 찬세는 신앙에 따라 유교식 장례절차가 진행되는 가운데 찬송가를 소리 높여 부른다. 게다가 박노인의 여동생은 보험 세일을 하며 장례식은 점차 죽인 자보다 산자의 몫으로 남는다.\n\nCasts : Bang Eun-Jin, Choi Seong, Moon Jeong-Suk, Kwon Seong-Deok, Choo Jin-Mo, Park Jae-Hwang, Kim Il-Wu, Song Ok-Suk, Jeong Ha-Yeon, Choo Kwi-Jeong, Nam Po-Dong, Yoo Myeong-Sun, Hong Yun-Jeong, Park Dong-Hyeon, Choi Yu-Kyeong\n\nSYNOPSIS : A humorous film on the traditional Korean way of mourning over the dead. Ironically, the house of mourning is full of both austerity and liveliness. When old Park dies, all the relatives scattered around the country come to his house in the countryside. Boxes of all kinds of alcohol are piled up like mountains and the deserted village is suddenly full of liveliness like a market place. Park's wife keeps silent while other people make noise - talking or crying loudly. All the relatives are busy seeking their own interest. The younger son sings Christian songs while Buddhist prayers are held. Park's sister tries to sell as many insurance packages as possible to the relatives and friends who have come to mourn. Park's half-brother and young wife's behavior shocks everyone. The people who gather for the funeral of the dead seem to be too occupied to pay the least attention to the deceased.",
      "id": "QmfXjL0xFqI",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:17.692Z"
}