{
  "imdbId": "youtube-0ydz0d3Ba0o",
  "title": "Stalingrad, Part One | WAR FILM",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0ydz0d3Ba0o",
      "id": "0ydz0d3Ba0o",
      "title": "Stalingrad, Part One | WAR FILM",
      "description": "Part Two: https://youtu.be/VB8NDI0oVBQ\n\n1942 All of central Europe is under the heel of the Germans. A member of the underground anti-fascist organization, Harro Schulze-Boysen, learns about the secret military operation \"Blau\", which gives the Germans the opportunity to capture the Caucasus. Schulze-Boysen reported everything to Moscow, but Stalin considered this disinformation. The German plan - to create an imitation offensive near Moscow in order to keep the Russians there - worked. Now, they decided in Berlin, they were guaranteed quick success in the southwestern direction.\n\nMoreover, the Russian counteroffensive near Kharkov floundered - some of our troops were surrounded, some retreated to Stalingrad. Stalingrad acquired special strategic importance for the warring parties. For the Germans, it was an open road to the south, to the Caucasus and India, as Hitler dreamed. Thus began the 200 days and nights of Stalingrad, terrible and bloody.\n\nYear of production: 1989\n\nDirector: Ozerov Yuri\nScreenwriter: Ozerov Yuri\nComposer: Levitin Yuri\nOperators: Slabnevich Igor, Gusev Vladimir\nProduction designers: Yasyukevich Felix, Kirs Vladimir\n\nCast: Nikonenko Sergey, Gomiashvili Archil, Nevzorov Boris, Ulyanov Mikhail, Lautsevichyus Lyubomiras, Freundlich Bruno, Booth Powers, Allende Fernando, Tsvetkov Valery, Fomicheva Oksana, Bondarchuk Fedor, Burenkov Evgeniy, Garmash Sergey, Goladze Tomaz, Goloborodko Alexander, Grekov Roman , Dmitriev Herbert, Ezepov Vyacheslav, Zasukhin Nikolay, Kryuchkov Nikolay, Kudinov Alexander, Lebedeva Olga, Levkovich Boris, Lobanov Vadim, Lacey Ronald, Petri Akhim, Rozstalny Vitaly, Smolyakov Andrey, Tiede Erich, Shakhvorostova (Totunova) Larisa, Troshin Vladimir, Uryumtsev Oleg, Oleg Utkin, Oksana Fandera, Siegfried Voss, Heise Ernst, Hellstorf Hellmuth, Henneberg Gerd Michael, Herbert Sturm, Schulze Horst, Junghans Gunther",
      "addedAt": "2025-12-23T03:44:43.979Z",
      "thumbnail": "https://i.ytimg.com/vi/0ydz0d3Ba0o/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCYXrF04Iu9DQTskbA9TYWu89-xdw",
      "duration": 5456,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T03:44:43.979Z"
}