{
  "movieId": "youtube-Z8K_ZjkGPKk",
  "title": "The St. Louis Bank Robbery (1959, Crime) Steve McQueen, Crahan Denton, David Clarke | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z8K_ZjkGPKk",
      "id": "Z8K_ZjkGPKk",
      "title": "The St. Louis Bank Robbery (1959, Crime) Steve McQueen, Crahan Denton, David Clarke | Movie",
      "description": "Never before in Police annals! Never before in film history!\nCareer criminals (David Clarke, Graham Denton) and a local youth (Steve McQueen) carefully plan and rehearse the robbery of a Missouri bank. Complications arise when the sister of one of the thieves starts voicing her well-founded suspicions.\n\nOriginal title: The St. Louis Bank Robbery (1959)\n\nColorized version: https://youtu.be/zNre18TVXN8\n\n\nThis film is available with subtitles in many languages.\n\nDirectors: Charles Guggenheim, John Stix\nWriter: Richard T. Heffron \nStars: Steve McQueen, Crahan Denton, David Clarke\nGenres: Crime,  Drama, Thriller\n\n\n00:00 Full Movie (with subtitles)\n06:40 A summary of the movie 'The St. Louis Bank Robbery' involving a group planning a bank robbery and its aftermath.\n17:17 A series of events unfold involving a bank robbery, a conversation about money, a meeting with Gino, and a confrontation between characters.\n31:23 A group plans a bank robbery, discussing their strategy and roles in detail.  They conduct a trial run with precise timing and coordination.while also mentioning a potential complication.\n41:51 A conversation between George and Ann takes a dramatic turn as they discuss their past and future plans, while John shares his experiences with starting and quitting various ventures.\n47:52 Suspicious activities at a bank lead to a potential robbery, involving a warning sign and a mysterious girl.\n56:18 A tense confrontation unfolds as George is coerced into a dangerous situation by Gino and Fowler.\n1:01:42 A tense conversation unfolds as characters discuss a plan to leave, leading to a confrontation and a bank robbery.\n1:10:04 Dramatic bank robbery unfolds with hostages, police involvement, and a tense standoff.\n1:19:37 A tense bank robbery leads to a violent standoff with the police, resulting in tragic consequences.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:39:03.568Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Z8K_ZjkGPKk/maxresdefault.webp?v=65b857cc",
      "duration": 5330,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:03.652Z"
}