{
  "imdbId": "youtube-26Pl0MAmJ2M",
  "title": "Der letzte Partisan - Die wahre Geschichte des Leonid Berenshtein (KRIEGSFILME auf Deutsch komplett)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=26Pl0MAmJ2M",
      "id": "26Pl0MAmJ2M",
      "title": "Der letzte Partisan - Die wahre Geschichte des Leonid Berenshtein (KRIEGSFILME auf Deutsch komplett)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 1941: Der jüdische Rotarmist Leonid Berenshtein entkommt dem Tod und schließt sich unter falschem Namen der Partisanenbewegung an – ein stiller Held inmitten des Grauens des Krieges.\n\nDER LETZTE PARTISAN (2021)\nOriginaltitel: Berenshtein\nMit: Yaroslav Kucherenko, Anton Karlinsky, Pavlo Aldoshyn\nRegie: Roman Shumunov\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\n2019: Der 95-jährige Leonid Berenshtein ist der letzte noch lebende Kommandant eines Partisanenbataillons aus dem Zweiten Weltkrieg. In seiner bescheidenen Wohnung in der israelischen Stadt Kiryat Ata, nahe Haifa, spricht er über seine Jugend (dargestellt von Yaroslav Kucherenko). Alles begann, als die Deutschen 1941 seine ukrainische Heimat einnahmen. Er erinnert sich an Frauen und Kinder, die vor seinen Augen verbrannt wurden, an gefallene und hingerichtete Kameraden aus dem Widerstand und an die Liebe seines Lebens, die er aufgeben musste, um sein Land zu verteidigen. Berenshtein blickt zurück auf seine Begegnung mit dem Holocaust und den Moment, in dem er sich entschloss, einen Befehl zu verweigern, um in ein deutsches Gefängnis einzubrechen und zum Tode verurteilte Juden zu befreien. Niemals vergessen hat er auch den Tag, an dem er die geheime Anlage ausfindig machte, in der die Nazis ihre letzte Hoffnung auf den Endsieg bauten und testeten: die V2-Raketen – Hitlers Wunderwaffe, die den kompletten Kontinent zerstören sollte …\n#Netzkino #ganzerFilm #kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:46:18.181Z",
      "thumbnail": "https://i.ytimg.com/vi/26Pl0MAmJ2M/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCGdd-JP_2iWsN1n8fCknAsrRFEZQ",
      "duration": 6658,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}