{
  "movieId": "youtube-x4HakcVSReg",
  "title": "THUG LIFE: All In The Game | Full Movie | Action Crime",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x4HakcVSReg",
      "id": "x4HakcVSReg",
      "title": "THUG LIFE: All In The Game | Full Movie | Action Crime",
      "description": "Ontario, Vince, Lucky and Littles, friends since birth, brothers till death. Coming from nothing they have begun to find themselves engaged in the ruthless Baltimore drug trade. They will stop at nothing to take control of it all, including taking out the most powerful mobster of the city - Michael Caprisci. As they systematically begin terminating the competition they have to engage a tangled yet simplistic plan to get Caprisci out of the game using of all people, his son Nicki, a slick, fast talker who prefers booze and women over his father’s lifestyle. In the end, Nicki's drug problem will aid the group in bringing his father down. As the plan develops, Ontario finds out that some of his own rank and file are conducting business behind his back. He needs to send a message to let them know who is in charge, but when one of his closest allies ends up starting a war, he has to make a decision on what is more important, business or friendship. So as the war begins, who will win? Or in this game…is there really a winner? Thug Life is an in-depth look into the world of street crime and those who rule the streets.\n2011.  Stars: Chris Clanton, Micaiah Jones, Nelson Irizarry\n**Under non-exclusive license from Vision Films Inc.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n**This content is under license from Alchemy Werks. All rights reserved**\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:44:48.962Z",
      "thumbnail": "https://i.ytimg.com/vi/x4HakcVSReg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBvxif5XbH91I4qXKzgWUT5MS7SqA",
      "duration": 4317,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:44:48.962Z"
}