{
  "imdbId": "youtube-ZDNB8SMphP0",
  "title": "Beyond the Front Line - Kampf um Karelien (KRIEGSFILM in voller Länge, Kriegsdrama Filme Deutsch)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZDNB8SMphP0",
      "id": "ZDNB8SMphP0",
      "title": "Beyond the Front Line - Kampf um Karelien (KRIEGSFILM in voller Länge, Kriegsdrama Filme Deutsch)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Dieser actionreiche Kriegsfilm nach wahren Begebenheiten basiert auf Tagebucheinträgen der beteiligten Frontsoldaten: Die blutige Geschichte des Infanterieregiments 61, das Finnland gegen die einfallende Rote Armee verteidigte...\n\nBEYOND THE FRONT LINE - KAMPF UM KARELIEN (2004)\nOriginaltitel: Framom främsta linjen\nMit: Tobias Zilliacus, Ilkka Heiskanen, Christoffer Weiss\nRegie: Åke Lindman\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nFinnland 1942. Die finnische Armee setzt alle verfügbaren Kräfte an der Ostfront ein, um die übermächtige Rote Armee aufzuhalten. Leutnant Harry Järv befehligt die Aufklärungs- und Kampftrupps des Infanterie-Regiments IR 61. Immer wieder begeben er und seine Männer sich hinter die Frontlinie, um gezielt russische Posten zu überfallen. Sie sind sehr erfolgreich, doch der psychische Druck für Järvs Männer wird immer größer, nicht zuletzt, weil die Russen Scharfschützen gegen sie einsetzen.\nIm Juni 1944 wird das Regiment in Marsch gesetzt, denn die Russen haben eine Großoffensive in Karelien gestartet. Oberstleutnant Marttinen bringt die letzten Sturmgeschütze in Stellung und schwört das IR 61 auf ein hartes Gefecht ein. Er will unter allen Umständen die Stadt Tienhaara auf der karelischen Landenge halten, denn Marttinen weiß: Wenn Tienhaara fällt, ist die Straße nach Helsinki frei und Finnland nicht mehr zu halten ...\n#Netzkino #ganzerFilm #kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:46:49.727Z",
      "thumbnail": "https://i.ytimg.com/vi/ZDNB8SMphP0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDECvLUS2_ueYHljixDx3lqKg1F9w",
      "duration": 7212,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}