{
  "imdbId": "youtube-k6ESQXS5Lgg",
  "title": "The Broadway Melody  (MGM, 1929) ANITA PAGE🍕 BESSIE LOVE🍕 OSCAR WINNER",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k6ESQXS5Lgg",
      "title": "The Broadway Melody  (MGM, 1929) ANITA PAGE🍕 BESSIE LOVE🍕 OSCAR WINNER",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Anita Page, Bessie Love, Charles King\nDirector: Harry Beaumont\n🍕OSCAR WINNER BEST PICTURE🍕\n0:00            PizzaFLIX Intro\n00:52          The Broadway Melody \n35:31          Rehearsal \"The Broadway Melody\" number\n41:22          Rehearsal “Love Boat”\n01:13:42    “The Wedding Of The Painted Doll” (restored)\n01:17:25    “The Boy Friend”\n\nStep back into the Golden Age of Hollywood with The Broadway Melody (1929), the Best Picture Oscar Winner that revolutionized the movie musical! \n\nThe dazzling Anita Page and Oscar-nominated Bessie Love are two ambitious sisters chasing their dreams on Broadway. Alongside Charles King, they navigate romance, rivalry, and showbiz struggles in this unforgettable backstage drama.\n\nThe Broadway Melody was a groundbreaking achievement directed by Harry Beaumont—the first full-length all-talking, all-singing musical and the first sound film to win an Academy Award! Featuring iconic early musical numbers like You Were Meant for Me and the title song The Broadway Melody, this cinematic milestone set the stage for MGM’s future dominance in the genre.\n\nExperience the magic of classic Hollywood musicals, Pre-Code cinema, and the dazzling performances that made Anita Page, Bessie Love, and Charles King household names. Don’t miss this essential piece of film history—watch now on PizzaFLIX, your home for classic movies!\n\n🎭 Subscribe for more Oscar-winning films, vintage musicals, and Pre-Code Hollywood gems!\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#ClassicMovies #PreCodeHollywood #The Broadway Melody #Harry Beaumont #Anita Page #Bessie Love #Charles King #hollywood history #vintage film #GoldenAgeCinema #VintageMusicals #OldHollywood #MovieHistory #classic hollywood #pizzaflix",
      "id": "k6ESQXS5Lgg",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:04:47.053Z"
}