{
  "movieId": "youtube-NUaAYtVLXQk",
  "title": "Deliler - Seven for Justice - Watch full movie in HD for free on Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NUaAYtVLXQk",
      "id": "NUaAYtVLXQk",
      "title": "Deliler - Seven for Justice - Watch full movie in HD for free on Moviedome",
      "description": "*GANZER FILM - Epischer, türkischer Abenteuerfilm*\n\n*Die Handlung*\nEine furchtlose Kämpfertruppe des Osmanischen Reiches wird von Sultan Mehmed II entsandt, um es mit dem gnadenlosen Herrscher Vlad „dem Pfähler“ aufzunehmen. Die kleine Kämpfertruppe hört auf den Namen „Deliler“ - die Verrückten - und begibt sich hinter feindliche Linien um durch das Element der Überraschung einen Sieg zu erringen.\n\nAbonniere Moviedome kostenlos für mehr ganze Filme ► http://bit.ly/MoviedomeAbo\n\nJetzt den Abenteuer Film „Deliler - Sieben für die Gerechtigkeit“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Abenteuerfilm #kostenlos #movie #film #spielfilm #HD #action #Deliler #OsmanischesReich #Kämpfer #Krieger #Türkei #History #Sultan \n\nEnglischer Titel: Vlad the Impaler\nFilmlänge: 120 Minuten\nRegie: Osman Kaya (Regisseur von „Kirmizi Kamyon“ und „Isimsizler“)\nFSK: 18\nErstveröffentlichung: 2018\n\n\nDie Darsteller\nGem Ucan (bekannt aus „Dirilis: Ertugrul“) als Gokkurt\nErkan Petekkaya (bekannt aus „Ayla“, „Paramparca“) als Vlad Tepes\nNur Fettahoglu (bekannt aus „Bozkir“, „Babil“, „Payitaht Abdüllhamid“) als Alaca\nIsmail Filiz (bekannt aus „Ketenpere“, „Barbaroslar“) als Asgar\nRuzgay Aksoy (bekannt aus „Groll“, „Ramo“, „Kara Sevda“) als Sultan Mehmed\n\nDie Handlung und Szenen von \"Deliler\":\nVlad (Erkan Petekkaya) ist der Herrscher über die Walachei und hat jüngst erst den vom Sultan Fatih Memet (Rüzgar Aksoy) entsandten Botschafter des Osmanischen Reichs hinrichten lassen. Daraufhin fackelt der Sultan nicht lange und befiehlt seinem Untertan Baba (Yetkin Dikinciler), Vlad umzubringen. Baba lässt sich nicht lange Bitten und schickt eine erfahrene Kämpfertruppe nach Târgoviște, der Hauptstadt der Walachei. Auf dem Weg dorthin, reiten die Männer Gökkurt (Cem Uçan), Çebi (Mehmet Pala), Suskun (Batın Uçan), Adsız (Baran Öztürk), Mübariz (Namık Rüstem Khanlı), Kongar (Mehmet Ali Karakuş), Aşgar (İsmail Filiz) und Kuman (Kamil Güler) durch ein kleines Dorf namens Alaca. Das Dorf wurde vor ihrer Ankunft von Vlads Männern überfallen. Als die Kämpfer sehen, was Vlads Krieger in Alaca angerichtet haben, steigert sich ihre Wut ins Unermessliche. Kurzerhand retten sie die Dorfbewohner und wollen sich danach Vlad vornehmen...\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nJetzt den Abenteuerfilm „Deliler“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:34:13.793Z",
      "thumbnail": "https://i.ytimg.com/vi/NUaAYtVLXQk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCDukWp58FoWBR21Ppv2jCHceLwgA",
      "duration": 7235,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:34:13.916Z"
}