{
  "movieId": "youtube-5KnUlCt658c",
  "title": "Algiers (Mystery, 1938) with Charles Boyer & Hedy Lamarr | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5KnUlCt658c",
      "id": "5KnUlCt658c",
      "title": "Algiers (Mystery, 1938) with Charles Boyer & Hedy Lamarr | Movie",
      "description": "You've got a date with danger, a Rendezvous with romance in the glamorous, mysterious Algiers.\nA wanted jewel thief ensconced in the Casbah meets a beautiful woman who makes him long for an escape.\n\nOriginal title: Algiers\n\nColorized version https://youtu.be/iXEI8AiyhSA\n\nThis film is available with subtitles in many language options.\n\nDirector : John Cromwell\nWriters : John Howard Lawson, James M. Cain, Henri La Barthe\nStars: Charles Boyer, Hedy Lamarr, Sigrid Gurie\nGenres: Drama, Mystery, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:34 Intriguing story of a notorious criminal hiding in Casbah, evading capture in Algiers.\n06:36 Intrigue unfolds as Pepe eludes the police and Regis seeks revenge in Algiers.\n12:34 Intriguing plot unfolds as characters navigate through a tense situation, with unexpected twists and turns.\n22:56 Intrigue and deception unfold in Algiers as characters plot to capture Pepe, with discussions of his potential demise and a plan to lure him out of hiding.\n28:21 Mysterious letter leads to suspicion and intrigue in Algiers.\n34:08 Emotional turmoil and longing for escape in Casbah, leading to a desire for freedom and a new life in Paris.\n39:49 Intrigue and suspense unfold as characters discuss Pierrot's whereabouts and their concerns for him.\n46:53 Romantic encounter in Paris leads to reminiscing about childhood and future plans.\n56:26 Tragic love story unfolds in the streets of Casbah, involving Pepe, Ines, and Pierrot.\n1:07:17 Romantic mystery unfolds in Algiers as characters express love, longing, and escape in Paris.\n1:19:34 Romantic drama unfolds in Algiers as Pepe le Moko faces a tragic fate, leading to emotional turmoil and a desperate letter delivery.\n1:25:49 Intrigue, deception, and a secret meeting unfold as Pepe receives shocking news about the arrest of Carlos and a mysterious letter from Gaby.\n1:28:40 Intrigue, deception, and love unfold in a dramatic encounter between Pepe and Gaby on a ship.\n\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:39:06.928Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/5KnUlCt658c/maxresdefault.webp?v=65f2685b",
      "duration": 5947,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:07.036Z"
}