{
  "imdbId": "youtube-P_Ay4h7kgsc",
  "title": "The Great Christmas Holiday Bake-Off | Sweethearts | Full Christmas Hallmark Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=P_Ay4h7kgsc",
      "id": "P_Ay4h7kgsc",
      "title": "The Great Christmas Holiday Bake-Off | Sweethearts | Full Christmas Hallmark Movie",
      "description": "The Great Christmas Holiday Bake-Off | Sweethearts | Full Christmas Hallmark Movie - CEO of the Morton Pumpkin Company decides to commemorate the 200th anniversary of the cutest town ever founded with a bake-off. The town sweetheart is expected to win. When her niece is left to stay, winning seems out of reach.\n\nWatch Sweethearts, a full Hallmark Christmas movie where the CEO of the Morton Pumpkin Company organizes a special bake-off to celebrate the 200th anniversary of the town. The town’s beloved sweetheart is expected to win, but when her niece comes to stay, the competition becomes more challenging than ever. Perfect for fans of Hallmark Christmas movies, heartwarming holiday films, full free Hallmark Christmas movies, cozy festive stories, and charming winter romances, Sweethearts delivers fun, festive cheer, and a delightful holiday baking adventure full of love and surprises.\n\nBaking Up Love | Stars: Michael Bonini, Jason Frederick, Katelin Stack\n*Licensed from Gemelli. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#christmasfilm #hallmarkmovie #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-26T23:59:23.383Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/P_Ay4h7kgsc/maxresdefault.webp",
      "duration": 5806,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:23.418Z"
}