{
  "imdbId": "youtube-CboUnAvSptM",
  "title": "Shango, the infallible gun (1970) Spaghetti Western - Full Movie",
  "year": 1970,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CboUnAvSptM",
      "title": "Shango, the infallible gun (1970) Spaghetti Western - Full Movie",
      "description": "Texas. The Civil War is over but a maniac Major, played by Fajardo, intends to keep his troops and townsfolk in the dark to maintain his power over the area. Ranger Shango (Anthony Steffen) is captured by the Major and framed for the murder of the local telegraph operator, the only person capable of receiving the news that the war has ended. However, Shango escapes, determined to bring down the insane Major and end the abuse of the poor townsfolk…Shango ( Shango, la pistola infallibile).\n\nDirected by Edoardo Mulargia as Edward G. Muller.\n\nShango is a typical Anthony Steffen spaghetti western, beautifully photographed with great music, lots of sweaty Mediterranean actors posing as Mexicans and a sneering Eduardo Fajardo as a Confederate Major who is reluctant to see the south go down in defeat. Lots of gun play, hurtling stunt men, put-upon villagers, and the reliable Steffen as Shango, a Texas Ranger who just wants folks to believe that the war is over. Good production values, great sets, fine music and lots of action make this one a winner, if you like spaghetti westerns. Franco Cleef’s restoration is fine with only an unavoidable slight hiss on the soundtrack.\n\nCast:\nAnthony Steffen as Shango\nEduardo Fajardo as Major Droster\nMaurice Poli as Martinez\nBarbara Nelli as Consuelo\nGiusva Fioravanti as Pedrito\nAttilio Dottesio as Fernandez\nGabriella Giorgelli as Pamela\nMassimo Carocci as Scott\nSpartaco Conversi as Bragna\nLiana Del Balzo as Tana",
      "id": "CboUnAvSptM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:29:25.234Z"
}