{
  "imdbId": "youtube-1BYtL2WSHUg",
  "title": "A Man Reflects On His Past (1958 Adventure) French Film by Willy Rozier with Jacques Bergerac",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1BYtL2WSHUg",
      "title": "A Man Reflects On His Past (1958 Adventure) French Film by Willy Rozier with Jacques Bergerac",
      "description": "In the summer, Monge, a French trapper, makes a living from smuggling. He catches stray horses in the United States and sells them in Canada. He has no permanent home. That summer, he found himself living with an Irish farming family somewhere in Saskatchewan. Hannah, the daughter of the house, falls in love with him, although she is already engaged to a certain Archer, the engaged man.\n\nOriginal title: Un homme se penche sur son passé\n\nDirector: Willy Rozier\nWriters: Maurice Constantin-Weyer, Willy Rozier\nStars: Jacques Bergerac, Barbara Rütting, Pierre Dudan\nGenres: French cinema, Adventure, Drama\n\n\n00:00 Full Movie (with subtitles)\n02:12 A man reflects on his past adventures in a French film by Willy Rozier.\n10:21 A man's journey of reflection and adventure in a French film from 1958.\n18:31 Reflections on past adventures and relationships in a French film from 1958.\n25:22 Reflections on a past adventure in a French film involving travel, love, and sacrifice.\n31:07 Reflections on past events and decisions made in a French film set in a cold wilderness.\n44:36 A man reflects on love, loss, and family dynamics surrounding a wedding celebration in a French film.\n53:54 A man reflects on his past adventures and struggles with his love for the Great North and his family.\n1:00:11 A woman reflects on her failing marriage and reconnects with an old neighbor, while discussing family and future plans.\n1:06:39 A man's tumultuous past unfolds as he faces betrayal, love, and tragedy in a French film.\n1:16:43 A man's desperate actions to protect his love and daughter lead to a daring escape in the snowy wilderness.\n1:22:45 A journey to save a sick child leads to a difficult decision near the border.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdaVNpTE5NfgyPqL-rKc8VsL",
      "id": "1BYtL2WSHUg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:36:36.539Z"
}