{
  "imdbId": "youtube-YDSW0po07Gc",
  "title": "Saving The Family Bakery | Christmas Cupcakes | HD Hallmark Christmas Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YDSW0po07Gc",
      "title": "Saving The Family Bakery | Christmas Cupcakes | HD Hallmark Christmas Movie",
      "description": "Saving The Family Bakery | Christmas Cupcakes | HD Hallmark Christmas Movie - When their family bakery may have to close its doors right before Christmas, rival sisters Kim and Gina must team up to win a national baking competition, save the family business, and perhaps even discover a bigger prize than they hoped.\n\nWatch Christmas Cupcakes, a full Hallmark Christmas movie where rival sisters Kim and Gina must put aside their differences to save their family bakery just before the holidays. Entering a national baking competition, they race against time to keep the business alive and discover that the sweetest prize may be the bond they rebuild along the way. Perfect for fans of Hallmark Christmas movies, heartwarming holiday films, full free Hallmark Christmas movies, cozy festive stories, and family-friendly winter romances, Christmas Cupcakes delivers holiday magic, charm, and the joy of love, family, and festive teamwork.\n\nStars: Cindy Busby, Erin Karpluk, Corey Loranger\n*Licensed from Vision Films. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#hallmarkmovie #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "YDSW0po07Gc",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:24.456Z"
}