{
  "imdbId": "youtube-k9-CuGdAtPo",
  "title": "A Splendid Outing (Hwalyeohan oechul)(1977)",
  "year": 1977,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k9-CuGdAtPo",
      "title": "A Splendid Outing (Hwalyeohan oechul)(1977)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03179\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03179\n\n영화글 : https://www.kmdb.or.kr/story/10/1266\n\n감독(Director) : 김수용(Kim Su-Yong)\n출연 : 윤정희,이대근,이영하,김정란,송미남,백정자,김혜성,노용원,양일민,최성관,김기종,최성호,오희찬,김지영,문미봉,석인수,나정옥,주상호,박부양,박달,김송남,박병기,노사강,박예숙,김경란,이정애,최남현(우정출연),이종만(우정출연),김만(우정출연)\n\n줄거리 : 자신을 잃을 정도의 스케줄 속에서 허탈과 혼돈에 빠져있는 여류인사 공도회 여사는 어느날 점술가로부터 전생에 대한 이야기를 듣고 미친듯이 고속도로로 차를 몰아 한 도시에서 광녀의 인도를 받으며 화려한 외출을 시작한다. 남편이라 일컫는 용달호라는 사나이와 7세된 딸 진영과 생활하던 그녀는 끝내는 몰래 배를 저어 그곳을 탈출한다. 서울로 온 공도회를 알아주는 사람은 아무도 없다. 그래서 그녀는 자기의 빌딩 옥상으로 올라가 떨어진다. 갑자기 조용해진 주위분위기에 공도회는 눈을 뜬다. 그녀는 그녀가 타고있던 차속에 있었다. 다시 고속도로로 들어선다. 뭐가 뭔지 모르는 상태에서..... 이렇게 해서 언제 누구에게 생길 화려한 외출을 여사가 다녀온 것이다.\n\nCasts : Yoon Jung-Hee, Lee Dae-Keun, Lee Young-Ha, Kim Jeong-Ran, Tong Mi-Nam\n\nSYNOPSIS : An important figure in society, Gong Do-hi's schedule is so tight that she could lose herself in it. At the point of collapse and feeling confused, Do-hi hears of her past life from a fortuneteller one day. Afterwards, Do-hi drives like crazy speeding along the highway into a city where she is guided by a madwoman and so starts her splendid outing. Do-hi lives with her so-called husband, Yong Dal-ho and their seven-year-old daughter, Jin-young. Ultimately, she secretly rows her boat and leaves her home. When she reaches Seoul, no one knows Do-hi. Therefore, she goes up to the roof of her building and jumps off. Suddenly, everything becomes silent. When Do-hi opens her eyes, she is back in her car. Do-hi returns to the highway. Not knowing what is what…",
      "id": "k9-CuGdAtPo",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:36.331Z"
}