{
  "imdbId": "youtube-np877x59mWw",
  "title": "Paper Man (1971, Mystery) Dean Stockwell, Stefanie Powers | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=np877x59mWw",
      "title": "Paper Man (1971, Mystery) Dean Stockwell, Stefanie Powers | Full Movie",
      "description": "Credit Card Conspiracy: When a Prank Turns Deadly...\nA prank that starts with a group of college students creating a fictitious person so they can get a credit card develops into a plot that takes a murderous turn...\n\nOriginal title: Paper Man (1971)\nThis film is subtitled in many languages. \n \nDirector: Walter Grauman\nWriter: James D. Buchanan\nStars:  Dean Stockwell, Stefanie Powers, James Stacy\nGenres:  Drama, Mystery, Sci-Fi\n\n00:00 Full Movie (with subtitles)\n00:19 Investigation into a mistaken identity involving a computer, leading to a credit mix-up and legal trouble.\n07:58 Creating a sophisticated computer program to generate a fake identity leads to unexpected consequences.\n17:36 Financial discrepancies at Dynatech lead to concerns and potential account closure.\n18:00 A mysterious encounter leads to unexpected revelations and decisions involving Henry Norman and Avery.\n28:51 A mysterious situation unfolds involving a young man named Joel, leading to confusion and intrigue.\n49:47 Mysterious discoveries lead to a search for Henry Norman's identity and a potential threat.\n50:31 Mysterious discovery of a man's existence and past leads to unexpected consequences.\n1:00:54 A man's troubled past resurfaces, leading to a journey of self-discovery and reconciliation with his actions.\n1:06:26 Mysterious events unfold as a man delves into his past and uncovers a hidden identity.\n1:20:49 Investigation into the mysterious disappearance of Henry Norman leads to shocking revelations.\n1:24:06 Investigation into a government report leads to a mysterious death caused by a computer program.\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "np877x59mWw",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:10.013Z"
}