{
  "imdbId": "youtube-b1_LSkFSJs8",
  "title": "The Case of the Frightened Lady (1940 film) The Scarf Murder Mystery | Marius Goring, Helen Haye",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b1_LSkFSJs8",
      "title": "The Case of the Frightened Lady (1940 film) The Scarf Murder Mystery | Marius Goring, Helen Haye",
      "description": "Based on an Edgar Wallace whodunit about an aristocratic family stalked by an unseen killer...\n\nOriginal title: The Case of the Frightened Lady (1940) AKA: The Frightened Lady (1940)\n\nThis movie is available with subtitles in many languages.\n\nBlack & White version: https://youtu.be/eM8dAacMNo0\n\n\nDirector: George King\nProducer: S. W. Smith\nWriter: Edgar Wallace, Edward Dryhurst, Robert Stevenson\nStars: Marius Goring, Felix Aylmer, Ronald Shiner, Helen Haye\nGenre: Classics, Colorized, Crime, Drama, Mystery, Literary\n\n\n00:00 Full Movie (with subtitles)\n01:28 Mysterious events unfold at Marks Priory as tensions rise and secrets are revealed.\n08:35 Murder mystery unfolds at Marks Priory as Studd is found strangled with an Indian scarf.\n16:17 Murder mystery unfolds as Chief Inspector Tanner investigates a suspicious death at a manor house.\n21:41 Investigation into a murder at Marks Priory involving suspects with conflicting alibis.\n29:32 Mysterious events unfold at Marks Priory as Dr. Amersham faces suspicion and secrets are revealed.\n37:44 A nobleman recounts suspicious events involving a doctor, a murder, and family secrets at Marks Priory.\n43:27 Mysterious events unfold at Marks Priory involving a murder, suspects, and hidden secrets.\n49:49 Murder mystery unfolds as detective questions Lady Lebanon about Dr. Amersham's death and hidden room.\n55:10 Murder mystery unravels secrets of a noble family, involving blackmail, hidden rooms, and suspicious characters.\n1:02:09 Mysterious events unfold at Marks Priory involving a murder plot and family secrets.\n1:11:48 A chilling confession of murder and manipulation unfolds in a conversation between two characters.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "b1_LSkFSJs8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:34:58.447Z"
}