{
  "movieId": "youtube-xu8UEoZUq4U",
  "title": "Jungle Love | The Bride and the Beast 1958 (Adventure, Fantasy) Colorized | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xu8UEoZUq4U",
      "id": "xu8UEoZUq4U",
      "title": "Jungle Love | The Bride and the Beast 1958 (Adventure, Fantasy) Colorized | Full Movie",
      "description": "After Laura and Dan get married in Africa, Laura becomes infatuated with Dan's pet gorilla. Through hypnosis, it is revealed that Laura was the Queen of the Gorillas in a past life.\n\nOriginal title: The Bride and the Beast (1958) \n\nBlack & White version: https://youtu.be/HhRAym8erbI\n\n\nDirector: Adrian Weiss\nWriters: Edward D. Wood Jr., Adrian Weiss\nStars: Charlotte Austin, Lance Fuller, Johnny Roth\nGenres: Colorized classics, Adventure, Fantasy, Mystery\n\nMany subtitle languages available for this movie\nThis movie has additional audio commentary by Tom Weaver, joined by Charlotte Austin & Bob Burns.  To activate the audio commentary go to settings ⚙️ and select \"Interlingue\" from the audio options menu.\n\n00:00 Full Movie\n06:12 A man is accused of murdering his three wives for insurance money, but the cause of death is unclear.\n12:35 A man is found not guilty despite suspicious circumstances.\n19:45 Returning home to find unexpected visitors & a mysterious woman trespassing in his property.\n33:53 A complicated love story leads to an unexpected wedding and a mysterious insurance policy.\n49:10 A man's new wife disappears, leading to a shocking revelation about her past.\n52:42 A complex and mysterious conversation unfolds between two characters, revealing hidden truths and dark pasts.\n1:01:26 A thrilling and suspenseful dialogue between two characters, involving deception, attempted murder, and the search for a missing wife.\n1:14:02 A mysterious phone call leads to a tangled web of deception and revenge.\n1:23:18 A complex plot involving deception, false identities, and murder unfolds in this video.\n\n\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:39:44.164Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/xu8UEoZUq4U/maxresdefault.webp?v=658a896f",
      "duration": 4697,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:44.234Z"
}