{
  "imdbId": "youtube-UAjwD_e4mQI",
  "title": "Q Planes (1939) [Comedy] [Thriller]",
  "year": 1939,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UAjwD_e4mQI",
      "title": "Q Planes (1939) [Comedy] [Thriller]",
      "description": "\"Q Planes\" (1939) released in the United States by Columbia Pictures as \"Clouds Over Europe\", is a British spy film directed by Tim Whelan and Arthur B. Woods, starring Ralph Richardson, Laurence Olivier and Valerie Hobson. The film was produced by Irving Asher with Alexander Korda as executive producer. The name \"Q Planes\" may have been derived from the British \"Q-ships\" that were used as spy and armed merchant vessels in the First World War. The film was helmed by American director Tim Whelan (Sidewalks of London (1938) and later, in 1940, co-director of The Thief of Bagdad) who was then in Britain working for Korda at Denham Studios.\n\n\"Q Planes\" (or in its American guise, \"Clouds Over Europe\") mixes the genres of spy thriller and comedy romance, and was intended to be a star vehicle for Olivier, but Richardson dominates much of the screen with a sardonic take on a spy, either working for Scotland Yard or British Military Intelligence. Released just months before the United Kingdom declared war on Germany in 1939, the film is a precursor to the \"strongly nationalistic, anti-German films that would reach their zenith in Britain during the war years\".\n\nAdvanced British aircraft prototypes carrying experimental and highly secret equipment being developed under government contract, are regularly vanishing with their crews on their test flights. No one can deduce the problem, not even spymaster Major Hammond (Ralph Richardson) or his sister Kay (Valerie Hobson), a newspaper reporter who is working undercover in the works canteen used by the crews at the Barrett & Ward Aircraft Company.\n\nAt first, Major Hammond is seen as an outsider at the aircraft factory, even by Mr. Barrett, the owner (George Merritt), but he soon finds a friend in a star pilot, Tony McVane (Laurence Olivier) who helps him try to unravel the case. Hammond becomes convinced that the company secretary at the factory, Jenkins (George Curzon) is a foreign agent and \"mole\", but Jenkins is killed by unseen gunmen before he can give up the names of his contacts.\n\nThe mystery remains unsolved when McVane returns to the aircraft factory, determined to make the next test flight. His aircraft, like the others, is brought down by a powerful ray beamed from the S.S. Viking, a mysterious salvage ship manned by a foreign crew. Along with his aircraft, McVane and his flight crew are taken hostage on the ship, where he discovers many other missing airmen have suffered the same fate. Gathering up weapons, McVane leads the British survivors in an attempt to take control of the ship. Major Hammond learns the truth and directs a Royal Navy ship (HMS Echo) to come to their rescue. In a short coda, Kay and McVane get together and Hammond learns, to his chagrin, that his longtime lady friend has married.\n\n--- \n\nDirected by Tim Whelan and Arthur B. Woods, produced by Irving Asher (producer) and Alexander Korda (executive producer), written by Brock Williams, Jack Whittingham and Ian Dalrymple, starring Ralph Richardson, Laurence Olivier and Valerie Hobson.\n\n---\n\nSource: \"Q Planes\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 May 2012. Web. 3 August 2012. http://en.wikipedia.org/wiki/Q_Planes.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "id": "UAjwD_e4mQI",
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-23T22:41:55.399Z"
}