{
  "imdbId": "youtube-hupKV4l9bcs",
  "title": "여인잔혹사 물레야 물레야(1983) / Spinning the Tales of Cruelty Towards Women (Yeoinjanhoksa mulreya mulreya)",
  "year": 1983,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hupKV4l9bcs",
      "title": "여인잔혹사 물레야 물레야(1983) / Spinning the Tales of Cruelty Towards Women (Yeoinjanhoksa mulreya mulreya)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03746\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03746\n\n영화글 : https://www.kmdb.or.kr/story/10/5235\n\n감독(Director) : 이두용(Lee Du-Yong)\n출연 : 원미경(길례),신일룡(윤보),문정숙(어머니),최성관(아버지),박민호,최성호,문미봉,양춘,현길수,최정원,태일,김지영,박용팔,서평석,이해룡,정규영,이인옥,이정애,김경란,권일정,석인수,김애라,임해림,박달,임택선,정영국,나정옥,모성회\n\n줄거리 : 양반의 딸인 어린 길례는 가난 때문에 세도가인 김 진사의 죽은 아들과 혼례를 치른다. 길례를 ‘열녀’로 만들어 집안을 빛낼 생각인 김 진사의 부인(문정숙)은 길례가 딴생각을 못하도록 집안일로 혹사시킨다. 그러나 성장한 길례(원미경)는 우연한 기회에 성에 눈을 뜨고, 김 진사의 죽은 딸의 남편 노릇을 하던 한생과 여러 차례 성관계를 갖는다. 이를 안 김 진사는 길례를 쫓아내면서, 길례에게 채 진사 집 머슴인 윤보(신일룡)와 새 삶을 시작할 수 있는 길을 터준다. 윤보를 따라 채 진사 집으로 들어간 길례는 종노릇을 할지언정 행복하게 살아간다. 그러나 채 진사가 번번이 길례를 탐하자 윤보는 채 진사를 죽이고 길례와 도망친다. 이후 윤보는 멸족한 줄로만 알았던 집안이 복권된 것을 알고 길례와 함께 부모의 집으로 돌아간다. 그 바람에 길례는 하루아침에 세도가인 윤 부자의 며느리가 된다. 그러나 그 영화도 잠시, 3년이 넘도록 아이가 없자 길례와 윤보는 고민에 빠진다. 불임의 원인이 윤보에게 있다는 것이 밝혀지자 길례는 씨내리를 강요받는다. 길례는 가문의 대를 이을 아들을 낳기 위해 원치 않는 성관계를 갖는다. 그렇게 해서 낳은 아들이 윤 부자 선산의 조상에게 바쳐지던 날, 남편으로부터 은장도를 받은 길례는 목매어 자살한다.\n\nCasts : Won Mi-Kyeong, Shin Il-Ryong, Choi Seong-Ho, Moon Jeong-Suk\n\nSYNOPSIS : Kil-rye is a maiden from a respectable but poor family. She marries the deceased son of the powerful Official Kim's household. Kil-rye acts as young widow but she is violated by Han-saeng. When this is found out, Kil-rye is able to run away thanks to the kindness of her father-in-law. Kil-rye meets Yun-bo, a servant in Official Chae's household, and marries him, becoming a servant herself. Afterwards, Yun-bo hears that the honor of his household is to be restored so he takes Kil-rye to his hometown and marries her. However, when she has no children, Yun-bo takes a mistress. Yun-bo realizes that he is the one who is infertile. He forces Kil-rye to continue the bloodline. Kil-rye has a son. However, when her husband hands her a knife, Kil-rye understands and hangs herself.",
      "id": "hupKV4l9bcs",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:40.897Z"
}