{
  "movieId": "youtube-gSUm3a67Dao",
  "title": "STEVEN SEAGAL in END OF A GUN (ACTION THRILLER auf Deutsch, Krimi Thriller Filme, ganzer Film)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gSUm3a67Dao",
      "id": "gSUm3a67Dao",
      "title": "STEVEN SEAGAL in END OF A GUN (ACTION THRILLER auf Deutsch, Krimi Thriller Filme, ganzer Film)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 STEVEN SEAGAL (\"Hard to kill\"), ein Sicherheitsbeamter eines Einkaufszentrums - und ehemaliger Bundesagent - kreuzt den Weg des Vollstreckers eines Drogenbosses, nachdem er eine Frau vor der Gefahr gerettet hat... \n\nEND OF A GUN (2016)\nOriginaltitel: End Of A Gun\nMit: Steven Seagal, Jade Ewen, Florin Piersic Jr.\nRegie: Keoni Waxman\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDer ehemalige Regierungsbeamte Decker (Steven Seagal) versucht mittlerweile als Sicherheitsmann in einem Einkaufszentrum irgendwie über die Runden zu kommen. Seine Aufgabe ist klar formuliert: Beobachten und Bericht erstatten, niemals selbst eingreifen. Doch als er mitbekommt, wie ein Mann eine Frau namens Lisa (Jade Ewen) zusammenschlägt, greift er ein … und muss dabei den Mann töten, um sie zu retten. Decker wird gefeuert und ihm droht auch eine Anklage. Da macht ihm die gerettete Lisa ein Angebot: Im von der Polizei beschlagnahmten Wagen ihres Freundes sind zwei Millionen Dollar versteckt. Gemeinsam mit ihr soll er diese stehlen. Doch Decker ahnt noch nicht, dass auch ein mächtiger Drogenkönig hinter dem Geld her ist und bereits seine Auftragskiller losgeschickt hat. Als diese Lisa dann in ihre Finger bekommen, sind die Prioritäten für Decker klar: Lisa hat Vorrang – um jeden Preis.\n#Netzkino #ganzerFilm #stevenseagal\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:49:10.718Z",
      "thumbnail": "https://i.ytimg.com/vi/gSUm3a67Dao/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD1Re076Le2kVZJjj703NiWQB_9SA",
      "duration": 5191,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}