{
  "imdbId": "youtube-6jce8u7n21U",
  "title": "Romantic Papa (Lomaenseuppappa)(1960)",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6jce8u7n21U",
      "title": "Romantic Papa (Lomaenseuppappa)(1960)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00546\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00546\n\n영화글 : https://www.kmdb.or.kr/story/10/5276\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 김승호(아버지),주증녀(어머니),최은희(장녀 음전),김진규(큰사위 전우택),남궁원(큰아들 어진),도금봉(둘째딸 곱단),신성일(둘째 아들 바른이),엄앵란(막내딸 이쁜이),김석훈(미스터 리),이빈화,주선태(도둑)\n\n줄거리 : 험회사 사원인 로맨스빠빠(김승호)는 아내(주증녀), 2남 3녀의 자식들과 함께 단란한 가정을 꾸리고 있다. 장녀 음전(최은희)은 대학을 졸업하고 관상대에 다니는 전우택(김진규)과 결혼한다. 큰아들 어진(남궁원)은 대학에 다닌다고 부모들을 속이고 영화감독이 되기 위해 촬영 현장에서 일한다. 둘째 딸 곱단(도금봉)은 여대생이고, 둘째 아들 바른이(신성일)와 막내딸 이쁜이(엄앵란)는 고등학생이다. 대가족의 생활을 꾸리기에는 그의 월급이 턱없이 부족하지만, 그는 넉넉한 웃음으로 가족들을 감싼다. 보험회사에 감원 바람이 불면서 그는 나이가 많다는 이유로 감원 대상이 되어 퇴직하지만, 가족들이 실망할 것이 걱정되어 실직 사실을 밝히지 못하고 자신의 시계를 팔아 월급이라며 가져다준다. 뒤늦게 이 사실을 알아차린 자식들은 아버지의 실직 이후 어떻게 살 것인지를 의논한다. 가족들은 아버지의 생일날에 그를 위해 파티를 열고, 맏사위는 아버지의 시계를 되찾아 생일선물로 건넨다.\n\nCasts : Choi Eun-Hee,Kim Jin-Kyu,Shin Seong-Il,Kim Seung-Ho,Joo Jeung-Nyeo\n\nSYNOPSIS : A husband (Kim Seung-ho) who works at an insurance company and is called 'Romantic Papa' by his five children lives happily with his wife (Ju Jeung-nyeo) and family. The eldest daughter, Eum-jeon (Choe Eun-hui), graduates from college and marries Jeon U-taek (Kim Jin-gyu). The eldest son, Eo-jin (Nam Gung-won), pretends to be going to college but works behind the scenes trying to prepare to be a movie director. The second daughter, Gop-dan (Do Geum-bong), is a college student, while as the second son Bareuni (Shin Seong-il) and the youngest daughter Ippeuni (Eom Aeng-ran) are high-school students. Although the father's salary is barely enough to feed the whole family, he takes care of his family with an optimistic nature and a penchant for laughter. However, due to his old age, the insurance company lays him off.  Worried about disappointing his family, he doesn't tell them the news. Although his sons and daughters eventually find out, they pretend not to know while trying to figure out a way to console their father. On his birthday, the entire family gets together and has a wonderful time.",
      "id": "6jce8u7n21U",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:26.181Z"
}