{
  "imdbId": "youtube-c8mb9XoEgTU",
  "title": "Buster Crabbe | The Challenger (1944) Action, Sport | by Sam Newfield | Colorized",
  "year": 1944,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c8mb9XoEgTU",
      "title": "Buster Crabbe | The Challenger (1944) Action, Sport | by Sam Newfield | Colorized",
      "description": "Fighting against odds... nothing could stop this fighting dynamo!\nWidower Gary Farrell can't afford, on his $45-weekly salary as a truck driver, to send his young son, Mickey, to a high-priced military school and decides to enter heavyweight-boxing tournament in an effort to win the $500 prize money.\n\nOriginal title: The Contender (1944) AKA: Challenger\nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/HcAtgdV4dQo\n\n\nDirector: Sam Newfield\nWriters: George Wallace Sayre, Jay Doten \nStars: Buster Crabbe, Arline Judge, Julie Gibson\nGenres: Colorized, Action, Drama, Sport \n\n\n00:00 Full Movie (with subtitles).\n02:44 A father and son discuss the son's education and future prospects at a military academy.\n06:05 A story unfolds around a boxing tournament with a $500 prize, where a man seeks advice and training to compete.\n10:56 Boxing champion Gary Farrel faces challenges and triumphs in a dramatic story.\n20:31 A young man impresses a woman and faces challenges in a boxing gym.\n27:07 A young fighter named Gary defeats Koko Kid in the first round of a boxing match, impressing the audience.\n28:58 A series of events unfold involving a fighter named Gary, a journalist, and a woman named Rita Langdon.\n33:15 A series of events unfold involving a proud father, a surprise gift, and a missing person in a dramatic setting.\n38:22 Introducing the heavyweight championship contenders Bomber Brown and Gary Farrel, with their upcoming fight causing tension and emotions among the spectators.\n47:50 Family dynamics and personal struggles revealed through candid conversations.\n52:36 Betrayal and financial struggles unravel relationships and trust in a drama film set in 1944.\n58:26 A story of love, pride, and redemption unfolds as Gary faces challenges in and out of the ring.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYDDUshEcMs1CHZW1booguo",
      "id": "c8mb9XoEgTU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:54.821Z"
}