{
  "imdbId": "youtube-Rl8C21m_rNo",
  "title": "The End of “Saturn” (1960s Soviet Spy Thriller) | WWII Soviet Intelligence | English Subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Rl8C21m_rNo",
      "id": "Rl8C21m_rNo",
      "title": "The End of “Saturn” (1960s Soviet Spy Thriller) | WWII Soviet Intelligence | English Subtitles",
      "description": "The End of “Saturn” — Based on the work by V. Ardamatsky, Saturn is Almost Invisible. This gripping Soviet spy thriller is the sequel to The Road to “Saturn”, continuing the dangerous and suspense-filled mission of Soviet intelligence during World War II.\n\nFrom 1942 to 1944, Soviet secret agent Krylov — operating under the Russified German alias “Kramer” — infiltrates the German espionage network and works deep inside the Abwehr spy school “Saturn” in Nazi-occupied Belarus. Risking his life daily, Krylov-Kramer transmits to Moscow intelligence crucial information: the names and identities of enemy saboteurs, their infiltration routes, and their mission signs. This enables the Soviet command to mislead the enemy by sending false radiograms on Soviet troop deployments.\n\nDirected by Villen Azarov, this piece of Cold War–era cinema combines espionage thriller intensity with historical drama accuracy, portraying authentic Soviet underground operations against Hitler’s intelligence. Featuring tense psychological duels, covert missions, and the shadowy world of WWII Soviet spies, The End of “Saturn” stands as a classic of 1960s Soviet war films. Now available with English subtitles, it’s a must-see for fans of Russian historical drama, espionage thrillers, and war films based on true events.\n\nYear of production: 1967\n\nDirector: Azarov Villen\nWriters: Bleiman Mikhail, Ardamatsky Vasily, Azarov Villen\nComposer: Flyarkovsky Alexander\nCamera operator: Dyatlov Mark\nProduction designer: Ushakov Semyon\n\nActors: Lyudmila Maksakova, Georgy Zhzhenov, Vladimir Pokrovsky, Vladimir Kashpur, Mikhail Gluzsky, Nikolay Grabbe, Vladimir Muravyov, Arkady Tolbuzin, Nikolay Prokopovich, Grigory Gai, Bruno Freundlich, Mikhail Volkov, Evgeny Kuznetsov, Nikolay Simkin, Lyudmila Shaposhnikova",
      "addedAt": "2025-12-23T03:43:49.420Z",
      "thumbnail": "https://i.ytimg.com/vi/Rl8C21m_rNo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAASRS9R8Y5UGhMO5IHw8BrB7JB_Q",
      "duration": 5708,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T03:43:49.421Z"
}