{
  "imdbId": "youtube-s4imsXGPGd8",
  "title": "Killer Retreat (This Weekend Will Change Your Life) | Full Drama Thriller Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s4imsXGPGd8",
      "title": "Killer Retreat (This Weekend Will Change Your Life) | Full Drama Thriller Movie",
      "description": "*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox \nKiller Retreat - A group of urbanites are seduced by a brochure offering change, personal growth, and a break from overcrowded and polluted London. They will be ensconced in yurts and tipis on a farm, far away from the city. The weekend is facilitated by a husband and wife combo who immediately confiscate all mobile phones. While their female host genuinely seeks to help unpack the group’s emotional baggage, her husband is less amenable, confidently quoting from the poet Rumi and the psychologist Carl Gustav Jung. He also targets the damaged, vulnerable and, of course, the physically attractive. Their lives change, but not in the way planned or imagined.\n2018. Stars: David Bamber, Niky Wardley, Caitlin Innes Edwards\n\n**This film is under non-exclusive license from Distribution Solutions/Alliance Entertainment. All rights reserved** \n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "s4imsXGPGd8",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:09:24.108Z"
}