{
  "movieId": "youtube-LkMIsIhLRyA",
  "title": "남부군 복원본(1990) / North Korean Partisan in South Korea (Nambugun) Restoration Version",
  "year": 1990,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LkMIsIhLRyA",
      "id": "LkMIsIhLRyA",
      "title": "남부군 복원본(1990) / North Korean Partisan in South Korea (Nambugun) Restoration Version",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04324\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04324\n\n영화글 : https://www.kmdb.or.kr/story/10/2051\n블루레이 소책자 : https://www.kmdb.or.kr/history/book/3430\n\n감독(Director) : 정지영(Jeong Ji-Young)\n출연 : 안성기(이태),최진실(박민자),최민수(김영),이혜영(김희숙),강태기(최소대장),트위스트 김(황대용),조형기(맹봉),독고영재(이봉각),신윤정(흰나리),허기호(김금일),문창근(왜가리),나기수(성만석),박홍근(하동무),남포동(선요원),박용팔(주성일),김지영(마을아낙),장승화(방준표),안종환(박형규),배병수(이동규),장병조(양지하),최명숙(최문희),임대호(마동무),임창정(전세용),노재희(앵두소년),차양희(박기서),김영신(허인선),강능원(최중대장),조병곤(지사장),이진우(신영균),전범수(고학진),백종선(마을여인),박정수(명자동무),황미선(안경희),김우석(토벌대장),문혁(아이),정형채(환자Ⅰ),이학재(환자Ⅱ),전미숙(통신사여대원)\n\n줄거리 : 북한군 점령하 전주에서 조선중앙통신사 기자로 활동하던 이태(안성기)는 한미연합군의 공세로 전주가 위험해지자 도당과 함께 엽운산 유격사령부에 합류한다. 전투부대 소대장으로 임명된 그는 김영(최민수) 등의 소대원을 거느리고 빨치산 활동을 벌인다. 1950년 11월 모두 출동 나간 사이에 닥친 토벌군 때문에 간호병 박민자(최진실)와 함께 탈출한 이태는 그녀와 사랑하는 사이가 되지만 고생 끝에 합류한 부대에서 사령부의 명령으로 헤어지게 된다. 이후 도당 유격대 사령부에 배속받은 이태는 정치선전 작업의 임무를 띠고 활동한다. 1951년 6월에는 남부군에 소속되어 남부군의 결합지인 지리산까지 이동 후 이현상 휘하에서 이봉각(독고영재), 김희숙(이혜영) 등과 함께 본격적인 비정규 군사활동을 벌이게 된다. 그러나 한동안 빛나던 전과를 거두던 남부군은 1951년 말부터 시작된 대대적인 토벌 작전과 함께 위기에 처하게 되고 고난의 후퇴를 벌인다. 그 과정에서 김영 등과 함께 낙오된 이태는 결국 1952년 3월 토벌군에 체포된다.\n\nCasts : Ahn Seong-Ki, Lee Hye-Young, Choi Jin-Sil, Choi Min-Su\n\nSYNOPSIS : Lee Tae, a war correspondent, joins the North Korean partisan in 1950.  But he soon feels torn by the partisan's activities and his own passivity. When the Operation Chung-ryong fails and Lee Tae and his men find themselves on the run from the punitive forces. Injured while on the run, Lee Tae is taken care by Park Min-ja and they soon fall in love.  But when he is called back to duty by headquarters, they are forced to go their separate ways. As the winter weather worsens, Lee Tae and his men fight in the Yakdam Peak battle and there he meets the poet Kim Young.  They discuss the futility of fighting one's own people. The North Korean partisan in South Korea cornered  in the hills of Mt. Jiri and there he meets the legendary Commander Lee Hyun-sang.  He is also astonished by Kim Hee-sook's courage. From this point on, he becomes an official member of the political party of the partisan. When the news of a truce is heard, the members are thrown into turmoil. Hunger and the weather drive them to destitution and during the last battle Lee Tae is taken prisoner by the punitive forces. His long battle for the partisan comes to a close.",
      "addedAt": "2025-12-26T00:23:00.365Z",
      "thumbnail": "https://i.ytimg.com/vi/LkMIsIhLRyA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDV9586AD7yXs8Im5jRWdgdBaAVPg",
      "duration": 9541,
      "language": "ko",
      "year": 1990,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:00.389Z"
}