{
  "imdbId": "youtube-oEV-gmm85Ak",
  "title": "Und wieder eine tierische Bescherung (WEIHNACHTSFILM in voller Länge auf Moviedome, kostenlos)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oEV-gmm85Ak",
      "id": "oEV-gmm85Ak",
      "title": "Und wieder eine tierische Bescherung (WEIHNACHTSFILM in voller Länge auf Moviedome, kostenlos)",
      "description": "Jetzt den Weihnachtsfilm “Und wieder eine tierische Bescherung” in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken und abonnieren ► http://bit.ly/MoviedomeAbo\n\nRod und Katherine genießen ihren Ruhestand in Florida. Beim gemeinsamen Spaziergang mit ihrer jüngeren Nachbarin Lisa treffen sie auf deren Ex-Freund David, der seiner neuen Freundin einen Heiratsantrag macht. Rod und Katherine beschließen, Lisa und David wieder zusammenzubringen. \n\n\nJetzt “Und wieder eine tierische Bescherung ” kostenlos als ganzen Film in deutsch sehen\nDie weihnachtliche Romanze mit dem Originaltitel “ 3 Holiday Tails”, wurde in den USA im Jahr 2011 verfilmt.\nRod und Katherine Wright verbringen ihren Ruhestand in Florida. Sie langweilen sich etwas und Katherine vermisst ihre Kinder. Glücklicherweise können sie sich mit ihrer jüngeren Nachbarin Lisa anfreunden. Während das Paar und Lisa gemeinsam ihre Golden Retriever Gassi führen, treffen sie zufällig auf Lisas Ex-Freund David. Lisa hat die Trennung noch nicht überwunden und ist sichtlich gekränkt: David ist gerade dabei, seiner neuen Freundin einen Heiratsantrag zu machen. Da beschließt das Rentnerpaar, auf eine Mission zu gehen: Sie wollen Lisa und David wieder zusammenbringen - und bekommen Hilfe von ihren Vierbeinern. \nProduziert wurde der Film von Cassidy Lunnen, Michael Jacobs und Fernando Szew.\n\n\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme: www.moviedome.de\n\nFolge uns auch auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\n\n\n#Moviedome #3HolidayTails#movie #film #drama #RomCom #RomantischeKomödie #Liebeskomödie\n\nFilmlänge: 86 Minuten\n\nDVD-Start (DE): 15.10.2012\n\nWer sind die Schauspieler?\nDie Charaktere werden von folgenden Schauspielern verkörpert: \nJulie Gonzalo (bekannt aus \"Cinderella Story\", \"Dallas\") in der Rolle der Lisa\nKelly Stables (bekannt aus \"Two and a Half Men\", \"The Ring 2\") in der Rolle der Kelly\nBruce Davison (bekannt aus \"Das Urteil\", \"X-Men\") in der Rolle des Rod Wright\nAlley Mills (bekannt aus \"Tricks\")  in der Rolle der Katherine Wright\nGattlin Griffith in der Rolle des Freddie\nK.C. Clyde in der Rolle des David Bennett\nAlex Peters in der Rolle der Myra\n\nDie Handlung und Szenen von “Und wieder eine tierische Bescherung” \nRod Wright und seine Frau Katherine verbringen ihren Ruhestand in Florida. Doch die beiden haben sich ihre Pension ganz anders vorgestellt: Während Rod die Langeweile plagt, vermisst Katherine ihre Kinder. Da es kurz vor Weihnachten ist, gehen ihr die gemeinsamen Kinder besonders ab.\nDas Paar hat sich mit der jüngeren Nachbarin Lisa angefreundet, die ihre Liebe zu Golden-Retrievern teilt.\nAls die drei gemeinsam mit ihren Hunden spazieren gehen, treffen sie zufällig auf Lisas Ex-Partner David. Lisa ist sichtlich verletzt, als sie erkennt, dass David dabei ist, seiner Freundin einen Heiratsantrag zu machen.\nWeil Katherine davon überzeugt ist, dass Lisa und David zueinander zurückfinden müssen, machen sie und Rod es sich zur Aufgabe, die beiden wieder zusammenzubringen. Dabei kommen ihnen die Vierbeiner zur Hilfe.\n\nDie Synchronisation \nDie Charaktere werden von folgenden Sprechern synchronisiert:\nDavid Bennett; Sprecher: Sascha Rotermund\nAlley Mills; Sprecherin: Ulrike Johannson \nJulie Gonzalo; Sprecherin: Simona Pahl\nAlex Peters; Sprecherin: Kim Mayhew \n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. \n\n\nJetzt Film und Trailer kostenlos auf deutsch schauen\nUnd wieder eine tierische Bescherung I Trailer I 2012 I Alle Filminfos\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \n\nBei Fragen wenden Sie sich bitte an:  copyright.berlin@plaion.com \nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com",
      "addedAt": "2025-12-26T00:36:14.088Z",
      "thumbnail": "https://i.ytimg.com/vi/oEV-gmm85Ak/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDoxfc9vBVK1JhWjWXo9Cg6g0gDGw",
      "duration": 5364,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:36:14.481Z"
}