{
  "movieId": "youtube-j-7JfQWZHgw",
  "title": "Samson - Historienfilm - mit Taylor James - Den ganzen Film kostenlos in HD schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=j-7JfQWZHgw",
      "id": "j-7JfQWZHgw",
      "title": "Samson - Historienfilm - mit Taylor James - Den ganzen Film kostenlos in HD schauen bei Moviedome",
      "description": "*GANZER FILM - Historien-Epos mit gigantischen Schlachten*\n\nDen Spielfilm „Samson“ kostenlos und in voller Länge auf Moviedome schauen.\n*So bewerten Filmfans* „Samson“:\nIMDb: *4,5* von 10\nAmazon: *3,1* von 5\n\n*Die Handlung von „Samson“*\n1170 vor Christus: Das Volk Israel lebt verzweifelt unter der eisernen Knechtschaft der Philister und wartet auf einen Erlöser. Samson scheint dieser Erlöser zu sein. Doch als er das Geheimnis seiner enormen Kraft seiner Frau Delila anvertraut, verrät sie ihn. Samson wird eingekerkert, geblendet und zur Sklavenarbeit gezwungen. Doch das ist noch nicht Samsons Ende.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Samson“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Historienfilm #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Samson\nLaufzeit: 110\nRegie: Bruce Macdonald, Gabriel Sabloff\nFSK: 12\nErstveröffentlichung: 2018\n\n\n*Das sind die Schauspieler*\nTaylor James (bekannt aus \"Zack Snyder’s Justice League“, „Vikings: Valhalla“)\nin der Rolle des Samson\nCaitlin Leahy (bekannt aus „Homecoming“, „Cruelty Free“)\nin der Rolle der Delilah\nBilly Zane (bekannt aus \"Titanic“, „Todesstille“)\nin der Rolle des King Balek\n\n\n*Die Handlung und Szenen von „Samson“* \nDer Hebräer Samson (Taylor James) wird wie durch ein Wunder von einer unfruchtbaren Frau geboren und verfügt bereits seit dem Kindesalter über übermenschliche Kräfte. Ein Engel prophezeite der Mutter einst, dass ihr Junge einer der größten Helden Israels werden wird und er seine Kräfte nur verliert, wenn sein dichtes, langes Haar geschoren wird. So kommt es, dass der Frauenheld und Muskelprotz zum Richter und Oberhaupt Israels aufsteigt und das Land gegen den Einfluss der Philister verteidigt.  Als er seiner Frau Delila (Caitlin Leahy) das Geheimnis seiner Macht anvertraut, verrät ihn die niederträchtige Frau. Er wird vom abscheulichen Rallah (Jackson Rathbone) gefangen genommen, geblendet und zu einem Sklaven gemacht. Der geschwächte und seiner Macht beraubte Samson will Rache nehmen, gerät dadurch jedoch in direkten Konflikt mit der mächtigen Armee der Philister. Letztlich liegt sein Schicksal ganz in den Händen von Jahwe...\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Samson“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:23.287Z",
      "thumbnail": "https://i.ytimg.com/vi/j-7JfQWZHgw/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAIVckM4KltNU1s1pbz58ne8mzuYw",
      "duration": 6341,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:33:23.347Z"
}