{
  "imdbId": "youtube-0aPcJuo8HGU",
  "title": "NEW HD RESTORATION🍕 A Life at Stake (1955) ANGELA LANSBURY🍕 KEITH ANDES",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0aPcJuo8HGU",
      "title": "NEW HD RESTORATION🍕 A Life at Stake (1955) ANGELA LANSBURY🍕 KEITH ANDES",
      "description": "It's Friday @PizzaFLIX \nStars: Angela Lansbury, Keith Andes, Douglass Dumbrille\nDirector: Paul Guilfoyle\n🍕GORGEOUS NEW HD RESTORATION🍕\nAngela Lansbury as you've never seen her before! This new HD restoration brings every shadow and suspenseful glance into extra-sharp focus. \n\nStep into the shadows of mid-century noir starring Angela Lansbury as a seductive, mysterious woman with deadly intentions. \n\nDirected by Paul Guilfoyle and featuring Keith Andes and Douglass Dumbrille, this psychological crime drama explores deceit, betrayal, and the thin line between love and danger. When a down-on-his-luck architect crosses paths with a glamorous socialite offering a high-stakes business deal, the allure of easy money quickly spirals into suspicion, obsession, and murder.\n\nThis forgotten film noir gem delves into themes of paranoia, femme fatales, and postwar anxiety, featuring a taut screenplay, moody cinematography, and an unforgettable performance by the young Angela Lansbury. Perfect for fans of classic thrillers, vintage Hollywood, and murder mysteries, this hidden treasure delivers suspenseful storytelling and a hauntingly tense atmosphere.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nPerfect for fans of vintage crime films, femme fatales, classic Hollywood, and stylish murder mysteries, this restored noir treasure is now ready to captivate a new generation of film lovers.\n\nDon’t forget to like, comment, and subscribe for more HD restorations of rare and classic films every week!\n\n#FilmNoir #AngelaLansbury #ClassicThriller #1950sMovies #RestoredFilms #VintageHollywood #MurderMystery #NoirCinema #PsychologicalThriller #HDClassic #RetroMovieNight #OldHollywood #FemmeFatale #CrimeDrama",
      "id": "0aPcJuo8HGU",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:04:00.753Z"
}