{
  "imdbId": "youtube-JMEJHj43eYI",
  "title": "Film-Noir | Reign of Terror (1949) directed by Anthony Mann | starring Robert Cummings",
  "year": 1949,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JMEJHj43eYI",
      "id": "JMEJHj43eYI",
      "title": "Film-Noir | Reign of Terror (1949) directed by Anthony Mann | starring Robert Cummings",
      "description": "In France, 1794, amidst a tumultuous political landscape, Robespierre instills fear in his adversaries with the sole aim of seizing control of the state. In his desperate efforts to safeguard his 'black book'—a pivotal list designating individuals for the guillotine in his quest for dominance—he becomes entangled in the treacherous realm of politics. With the stakes immeasurably high, he must ensure the list never falls into enemy hands, jeopardizing all he has strived for to maintain power and survival. This low budget masterpiece is far more intriguing and suspenseful than most epic films dealing with the same subject.\n\nBlack & White version: https://youtu.be/0X3VTCosonA\n\nOriginal title: Reign of Terror (1949) AKA: The Black Book / Reign of Terror\n\n\nThis film is available with English, Italian & Spanish audio, & also subtitled in many languages.\n\nDirector: Anthony Mann\nWriters: Philip Yordan, Æneas MacKenzie \nStars: Robert Cummings, Richard Basehart, Richard Hart, Arlene Dahl \nGenres: History, Film-Noir, Romance, Thriller, Colorized\n\n\n00:00 Full Movie (with subtitles)\n00:22 France engulfed in chaos and power struggles during the Reign of Terror.\n07:41 Intrigue and betrayal unfold as two factions, led by Barras and Robespierre, vie for power during the French Revolution.\n20:56 Intrigue unfolds as a dictator seeks a missing black book listing enemies, fearing betrayal within his Committee.\n22:12 A spy seeks to stop Robespierre from becoming a dictator by finding a key figure named Barras.\n30:48 Intrigue and betrayal unfold as key figures vie for power amidst a revolution, with a mysterious black book at the center of the conflict.\n37:16 Intrigue and deception unfold as characters search for a mysterious black book in a historical thriller.\n45:56 Political intrigue unfolds as characters search for a black book in a tense atmosphere.\n58:32 Intrigue and betrayal unfold as individuals search for a crucial book during the French Revolution.\n1:13:46 Political intrigue unfolds as Robespierre's dictatorship is challenged, leading to his downfall and the end of the Reign of Terror.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:41.522Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/JMEJHj43eYI/maxresdefault.webp",
      "duration": 5078,
      "language": "en",
      "year": 1949,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:41.624Z"
}