{
  "movieId": "youtube-sT9e76-RPik",
  "title": "Woman in the Shadows (1934, Crime) Directed by Phil Rosen | with Fay Wray | 4K Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sT9e76-RPik",
      "id": "sT9e76-RPik",
      "title": "Woman in the Shadows (1934, Crime) Directed by Phil Rosen | with Fay Wray | 4K Colorized Movie",
      "description": "John Bradley an ex-con plans to seek solitude in a remote cabin, but his peaceful isolation is shattered when Louise Loring, a woman fleeing her dangerous ex-lover, seeks refuge with him. As their romance blossoms, her vengeful ex-lover Tony Robson and his sidekick hunt them down. As Robson's pursuit intensifies, Bradley's past catches up with him, leading to a chain of events that propel him and Louise into a dangerous game of cat and mouse. With the law in pursuit and a treacherous plot unfolding, Bradley and Louise must rely on each other to confront their pasts and secure their future in a dramatic showdown that exposes the truth and delivers justice.\n\nBlack & White version: https://youtu.be/1WK8SCFoLf8\n\n\nOriginal title: Woman in the Dark (1934) AKA: Woman in the Shadows\nThis film is subtitled in many languages.\n\nDirector: Phil Rosen\nWriters: Dashiell Hammett, Sada Cowan, Charles Williams\nStars: Fay Wray, Ralph Bellamy, Melvyn Douglas, Roscoe Ates\nGenres: Colorized, Crime, Drama, Film Noir, Literary\n\n\n00:00 Full Movie (with subtitles) \n02:44 A released prisoner John Bradley, faces challenges and judgment from his community, while a woman stirs up gossip.\n08:51 Drama unfolds as Louise Loring seeks refuge at a stranger's house, sparking tension and revealing hidden motives.\n19:50 A woman faces manipulation and danger from a criminal, leading to a tense confrontation.\n24:00 A woman helps a man escape from the police after a violent incident, leading to a dangerous situation.\n30:45 A woman seeks help from an old friend while on the run, leading to unexpected encounters and a potential conflict with the law.\n39:05 A woman helps a man escape from the police and faces consequences for possessing stolen jewelry.\n48:52 A woman seeks help from her lawyer friend after being implicated in a theft case involving her ex-partner.\n54:21 A woman learns about a murder charge and plans an escape with her husband from a dangerous situation.\n1:01:41 Drama unfolds as secrets are revealed during a police investigation at a house.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:08.179Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/sT9e76-RPik/maxresdefault.webp",
      "duration": 3993,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:08.294Z"
}