{
  "movieId": "youtube-yQqMwFtqmNk",
  "title": "Returning Home to Find Love | Holiday in the Hamptons | Full HD 2025 Christmas Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yQqMwFtqmNk",
      "id": "yQqMwFtqmNk",
      "title": "Returning Home to Find Love | Holiday in the Hamptons | Full HD 2025 Christmas Movie",
      "description": "Returning Home to Find Love | Holiday in the Hamptons | Full HD 2025 Christmas Movie - Neither time nor distance truly extinguish the sparks of first love. When Jade Lewis returns to her grandfather's home in the Hamptons, she reconnects with her childhood love.\n\nWatch Holiday in the Hamptons, a full Hallmark Christmas movie where first love is reignited as Jade Lewis returns to her grandfather’s home in the Hamptons. Amid festive decorations, snowy landscapes, and cozy holiday cheer, she reconnects with her childhood sweetheart and discovers that true love never fades. Perfect for fans of Hallmark Christmas movies, romantic holiday films, full free Hallmark Christmas movies, heartwarming winter romances, and cozy festive love stories, Holiday in the Hamptons delivers magic, nostalgia, and the joy of love during the holidays.\n\nStars: Eric Roberts, Ashley Brinkman, Mario Silva\n*Licensed from Legacy. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#christmasmovie #hallmarkchristmasmovies #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-26T23:59:21.923Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/yQqMwFtqmNk/maxresdefault.webp",
      "duration": 4850,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "NZ",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:21.956Z"
}