{
  "movieId": "youtube-kYvK3n3SYXE",
  "title": "The Package: Killer Games (ACTION THRILLER | Unzensiert exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kYvK3n3SYXE",
      "id": "kYvK3n3SYXE",
      "title": "The Package: Killer Games (ACTION THRILLER | Unzensiert exklusiv für Netzkino-Members)",
      "description": "THE PACKAGE: KILLER GAMES (2012)\nOriginaltitel: The Package\nMit: Steve Austin, Dolph Lundgren, Eric Keenleyside, Mike Dopud, John Novak\nRegie: Jesse V. Johnson\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nEs klingt nach einem Routinejob für Türsteher und Geldeintreiber Tommy Wick (Steve Austin): Die Übergabe eines Päckchens an einen unbekannten Unterweltler namens Der Schwede (Dolph Lundgren). Auftraggeber ist Tommys Chef Big Doug (Eric Keenleyside), der mächtigste Gangsterboss der Stadt. Doch das Päckchen scheint es in sich zu haben. Denn plötzlich erhebt ein weiterer Gangster Anspruch auf die heiße Ware, Big Dougs Erzrivale Anthony (Michael Daingerfield). Und nicht nur dieser ist Tommy von nun an auf den Fersen. Gleich eine ganze Armee von nicht lang fackelnden Killern versucht, das Paket mit allen Mitteln in ihren Besitz zu bekommen. Bis aufs Zahnfleisch bewaffnet. Auch scheint es niemanden mehr zu geben, dem Tommy vertrauen kann. Und so pflastern Dutzende Tote seinen beschwerlichen Weg hin zum mysteriösen Schweden. Was der Bote nicht weiß: In Wahrheit geht es gar nicht um das Päckchen. Es geht um eine mörderische Intrige, in deren Zentrum sich Tommy plötzlich wiederfindet.\n#Netzkino #ganzerFilm #SteveAustin\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "addedAt": "2025-12-24T00:01:06.984Z",
      "thumbnail": "https://i.ytimg.com/vi/kYvK3n3SYXE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAAiuUAY43VmokfAzskB4z1xaLDEg",
      "duration": 5113,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:01:06.984Z"
}