{
  "imdbId": "youtube-uyou7cdQ1G0",
  "title": "They called him Bonebreaker (JACKI CHAN MARTIAL ARTS full movie in German, Classic Movies)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uyou7cdQ1G0",
      "title": "They called him Bonebreaker (JACKI CHAN MARTIAL ARTS full movie in German, Classic Movies)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Vom überheblichen Lausbub zum Kung-Fu-Meister: Wong Fei-hung erlernt den legendären „betrunkenen Stil“ – und muss sich im finalen Kampf beweisen. Action, Comedy und Martial-Arts-Kult. Mit Martial Arts Ikone JACKI CHAN!\n\nSIE NANNTEN IHN KNOCHENBRECHER (1980)\nOriginaltitel: Drunken Master / Jui kuen\nMit: Jackie Chan, Siu-Tin Yuen, Jeong-lee Hwang\nRegie: Yuen Woo-Ping\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDer junge Wong Fei-hung ist talentiert, aber überheblich. Seine ständigen Streiche bringen seinen Vater zur Verzweiflung, weshalb er den gefürchteten Bettler So Hap-yee engagiert, um dem Sohn Disziplin und Respekt beizubringen. Was Wong zunächst nicht weiß: Der heruntergekommene Alte ist ein legendärer Kung-Fu-Meister.\nDie Ausbildung ist hart, chaotisch und voller schmerzhafter Lektionen. Doch nach und nach erlernt Wong den geheimnisvollen „betrunkenen Stil“, eine Kampfkunst, die Unberechenbarkeit und Präzision vereint. Als er sich schließlich einem tödlichen Gegner stellen muss, zeigt sich, ob aus dem ungezogenen Jungen ein wahrer Meister geworden ist. Der Film begründete Jackie Chans weltweiten Durchbruch und revolutionierte das Martial-Arts-Kino durch die Kombination aus Akrobatik, Comedy und Action.\n#Netzkino #ganzerFilm #jackichan\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "uyou7cdQ1G0",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.123Z"
}