{
  "movieId": "youtube-8rrBUUWRlwc",
  "title": "The Marines Who Never Returned  ( Dora-oji Anneun Haebyeong )(1963)",
  "year": 1963,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8rrBUUWRlwc",
      "id": "8rrBUUWRlwc",
      "title": "The Marines Who Never Returned  ( Dora-oji Anneun Haebyeong )(1963)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00852\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00852\n\n영화글 : https://www.kmdb.or.kr/story/10/5668\n\n감독(Director) : 이만희(Lee Man-Hee)\n출연 : 장동휘(분대장),최무룡,구봉서,이대엽,전계현,강미애,전영선(영희),김운하,독고성,김웅,정민,나애심,김아미,차유미,한미나,채랑,최성,이해룡,장혁,조항,김왕국\n\n줄거리 : 한국전쟁 중 한 해병부대가 인천상륙작전에 참가한다. 호랑이 분대장(장동휘)이 이끄는 분대원들은 폐허가 된 시가로 들어가 북한군과 총격전을 벌인다. 한 모녀가 건물에서 뛰어나오다 소녀만 살아남는다. 건물 안의 학살된 양민들 속에서 여동생을 발견한 구일병(이대엽)은 절규한다. 서울 수복 후 부대는 북진하고, 분대원들은 고아가 된 소녀 영희(전영선)를 군대 자루 속에 넣어 다닌다. 최 해병(최무룡)이 전속되자, 구 일병은 그의 형이 여동생을 죽였다며 주먹다짐을 한다. 영희가 부대에 정식으로 소속되고, 분대원들은 기마전에서 승리한 상금으로 막걸리 파티를 한다. 크리스마스 이틀 전, 외박을 나가 양공주들과 시간을 보내고 있는 분대원들에게 부대 복귀 명령이 내려지고 분대원들은 중공군의 인해전술에 피해를 입은 전선으로 투입된다. 분대원들은 영희가 보낸 크리스마스 편지를 읽고, 분대장은 최후의 일전을 앞둔 대원들을 격려한다. 인해전술을 펼치며 밀려오는 중공군에 분대원들이 하나둘 죽고, 통신병인 김 해병(김운하)이 구원병을 요청하러 간 사이 분대원들은 남은 중공군과 전투를 벌인다. 김 해병은 영희를 만나 구 일병의 부탁대로 모두 무사하다고 거짓말을 한다. 중공군들이 후퇴하고, 구 일병의 주검 앞에 살아남은 분대장과 최 해병이 흐느껴 운다.\n\nCasts : Jang Dong-Hwi, Choi Mu-Ryong, Koo Bong-Seo, Lee Dae-Yeob\n\nSYNOPSIS : During the Korean War (1950-1953), a marine squad marches north fighting off Chinese army. The marines die one after another. Among them are friends from a small village. Only one of them survives the Chinese attack. He is sent to a hospital where his fiancee, a nurse, is waiting for him. This film depicts barbarism of the war, dying people and touching friendship among soldiers.",
      "addedAt": "2025-12-26T00:24:19.400Z",
      "thumbnail": "https://i.ytimg.com/vi/8rrBUUWRlwc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD3c9B60R3nHVqaPO1o1KAaUq49XQ",
      "duration": 6581,
      "language": "ko",
      "year": 1963,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:19.630Z"
}