{
  "imdbId": "youtube-kXLe11zlukw",
  "title": "Buster Keaton | The Villain Still Pursued Her (1940) directed by Edward F. Cline | Colorized Movie",
  "year": 1940,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kXLe11zlukw",
      "title": "Buster Keaton | The Villain Still Pursued Her (1940) directed by Edward F. Cline | Colorized Movie",
      "description": "You'll hate every hair of his mustache... as this pearl of innocence is trapped by the most dastardly villain that ever leered a leer! \n\nAfter learning of Mr. Middleton's passing and facing foreclosure, widow Wilson and daughter Mary are visited by Middleton's lawyer, Cribbs, who deceives them about Middleton's son's intentions. Mary, in an attempt to save her home, discovers Cribbs' deceit, but when she and Edward become engaged, Cribbs devises a scheme to ruin Edward's reputation, threatening their future happiness.\n\nOriginal title: The Villain Still Pursued Her (1940)\n\nBlack & White version: https://youtu.be/CfgvbK5x8J8\nThis film is subtitled in many languages.\n\nDirector: Edward F. Cline\nWriters: Elbert Franklin, Ethel La Blanche\nStars: Buster Keaton, Anita Louise, Hugh Herbert, Alan Mowbray, Richard Cromwell\nGenres: Colorized classics, Comedy\n\n\n00:00 Full Movie (with subtitles)\n01:30 Drama unfolds as characters face financial troubles and potential loss of their beloved home.\n07:56 A comedic chase involving a young man, Edward Middleton, and the Wilson family unfolds with unexpected twists.\n12:39 Misunderstandings and apologies lead to revelations about a young woman's true character and the complexities of relationships in a small town.\n17:49 Misunderstandings and chaos ensue at a wedding due to alcohol consumption and family traditions.\n25:06 Drama unfolds as Edward Middleton's behavior raises suspicions among his acquaintances.\n32:01 Dramatic events unfold as characters face tragedy, betrayal, and loss in a colorized movie directed by Edward F. Cline.\n38:08 A tale of hardship, betrayal, and redemption unfolds in a colorized movie directed by Edward F. Cline.\n44:21 Comedic chaos ensues as characters navigate misunderstandings and conflicts over a missing pie.\n53:27 A comedic chase involving mistaken identities, alcohol, and redemption unfolds in a colorized film.\n56:15 Mystery unfolds as characters investigate a forged check, leading to unexpected discoveries and a heartwarming reunion.\n1:00:37 Deception, pursuit, and revelation unfold as a sinister plot to inherit a fortune is uncovered.\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "kXLe11zlukw",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:05.829Z"
}