{
  "imdbId": "youtube-7fGPAckBtyw",
  "title": "Primal Rage (1988, Horror) by Vittorio Rambaldi | with Patrick Lowe, Cheryl Arutt | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7fGPAckBtyw",
      "id": "7fGPAckBtyw",
      "title": "Primal Rage (1988, Horror) by Vittorio Rambaldi | with Patrick Lowe, Cheryl Arutt | Movie",
      "description": "There's a new party animal on campus. She'll bring out the beast in you.\nA scientist at a Florida University accidentally creates a \"rage virus\" while conducting experiments to restore dead brain tissue in baboons. The virus soon spreads.\n\nOriginal title: Rage - Furia primitiva (1988)\nThis film is subtitled in many language options.\n\nWatch the uncensored Members Only version: https://youtu.be/GnzpF5zbVPE\n\n\nDirector: Vittorio Rambaldi\nWriters: Umberto Lenzi, James Justice\nStars: Patrick Lowe, Cheryl Arutt, Sarah Buxton\nGenres: Horror, Sci-Fi, Thriller, B-Movie\n\n\n00:00 Full Movie (with subtitles)\n03:02 Investigative journalist Sam Nash uncovers a scandal involving a stolen car and a suspected arsonist.\n07:29 Breakthrough in medical research on brain cell regeneration and ethical dilemmas.\n13:01 A chaotic sequence of events unfolds in a laboratory, involving monkeys, illegal activities, and a high IQ individual.\n22:10 A chaotic sequence of events involving a mysterious disappearance, a prank gone wrong, and a confrontation between characters.\n30:02 Interview with a military family member leads to discussions about personal backgrounds, hobbies, and family secrets.\n37:43 A series of events unfold involving a mysterious protein synthesis experiment and a missing person.\n51:37 A journalist confesses to killing Duffy, leading to a series of events involving a hospital, a mysterious drug, and a tragic outcome.\n1:07:29 A medical breakthrough leads to unexpected consequences and a dangerous encounter at a mental hospital.\n1:17:40 A passionate plea for love and forgiveness is expressed through heartfelt lyrics and dance.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:53.200Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/7fGPAckBtyw/maxresdefault.webp?v=65ffd2c9",
      "duration": 5449,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:53.317Z"
}