{
  "imdbId": "youtube-zvJAHgjHAqs",
  "title": "War of the Satellites (Horror, 1958) Dick Miller, Susan Cabot, Richard Devon | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zvJAHgjHAqs",
      "title": "War of the Satellites (Horror, 1958) Dick Miller, Susan Cabot, Richard Devon | Movie",
      "description": "An \"unknown force\" declares war against planet Earth when the United Nations disobeys warnings to cease and desist in its attempts at assembling the first satellite in the atmosphere.\n\nOriginal title: War of the Satellites (1958)\n\nColorized version https://youtu.be/WK6HUh7FBUk\n\n\nDirector: Roger Corman\nWriters: Irving Block, Lawrence L. Goldman\nStars: Dick Miller, Susan Cabot, Richard Devon, Eric Sinclair\nGenre:  Classics, Cult Film, Horror, Thriller, Sci-Fi, Adventure \nBudget: $70,000\n\n00:00 Full Movie (with subtitles)\n06:50 Extraterrestrial beings send a warning message to Earth about pollution and isolation measures.\n07:23 Extraterrestrial intelligence threatens Earth with a mysterious message, causing intrigue and volunteer missions.\n12:09 Alien invasion threat unfolds as Dr. Van Ponder's death triggers unrestricted funding for Project Sigma.\n17:34 Discussion about a looming extraterrestrial threat leads to a decision to surrender to an advanced alien race.\n20:48 Intense discussion on survival and resistance in Project Sigma, followed by a radiation density test.\n24:05 Intrigue unfolds as Dr. Lazar investigates a reactor incident, leading to a last-minute crew change for Rocket One.\n31:26 Intense space mission leads to unexpected consequences and moral dilemmas.\n41:41 A tragic mission unfolds in space, leading to a crew member's death and suspicion among the team.\n44:56 Discovery of a mysterious impostor leads to a shocking revelation during a medical examination.\n52:15 A mysterious threat endangers a space mission, leading to a desperate search for answers and a shocking revelation.\n1:01:00 Interstellar mission successfully destroys enemy satellite, expanding universe's boundaries.\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "zvJAHgjHAqs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:08.527Z"
}