{
  "imdbId": "youtube-pg6_yPMn9Js",
  "title": "속 돌아온 외다리 (1974) / Returned a Single-legged Man: 2 (Dol-a-on oedali sog)",
  "year": 1974,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pg6_yPMn9Js",
      "title": "속 돌아온 외다리 (1974) / Returned a Single-legged Man: 2 (Dol-a-on oedali sog)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요. \nFor detailed information on this film, visit : \n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02821\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02821\n\n감독(Director) : 이두용(Lee Doo-yong)\n출연 : 한용철 , 김문주 , 배수천 , 임재선 , 민세홍 \n줄거리 :   술집을 경영하는 마도로스 박이 숨겨둔 금괴를 찾기 위해 기무라 일당은 지속적으로 박을 괴롭힌다. 어느날 찾아온 손님 용철이 그들의 행패를 막아주자, 박은 술집을 용철에게 맡기고 자신을 보호해줄 것을 요청한다. 한편 분개한 기무라는 일본에서 무술전문가들을 초청하여 용철의 왼쪽다리를 자른다. 용철은 이에 괴로워하다, 금괴를 노리던 기무라에게 자신의 아버지마저 살해당하자 복수를 결심한다. 태미와 그 동생의 도움으로 받아 쇠다리를 만들어 착용한 용철은 기무라 일당에게 복수하고, 금괴를 훔쳐간 마도로스 박과 결전을 벌여 그를 물리치고 돌아선다.\n\nCasts: Han Yong-cheol , Kim Mun-ju , Bae Su-chun , Im Eun-ju , Min Se-hong\nSYNOPSIS : Park, a seaman, runs a bar in Dae Hyeon. Although he pays tax to Kimura's gang, their violence is beyond the limit. One day Yong-Cheol, a guest of the bar who comes to see his girl friend, stops their misconduct. This enrages Kimura and he invites martial art specialist from Japan. They cut Yong-Cheol's left leg. Yong-Cheol came to know that his girl friend Heo Suk becomes Kimura's mistress to transfer the gold to the Independence Army. He makes an iron artificial leg with help of a boy and defeats Kimura and his men. By the way Heo Suk commits suicide. The seaman Park is the murderer of Heo Suk's father. Yong-Cheol kills him in wrath and sets off with the gold for the Independence Army accompanied by the boy.",
      "id": "pg6_yPMn9Js",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:54.846Z"
}