{
  "imdbId": "youtube-Bo6w5g1L56Q",
  "title": "The Marijuana Menace 1938 | Crime, Drama, Propaganda | Colorized Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Bo6w5g1L56Q",
      "title": "The Marijuana Menace 1938 | Crime, Drama, Propaganda | Colorized Full Movie",
      "description": "Puff - Party - Tragedy!\nA high-school girl Joan Barrie, will inherit the fortune of her grandmother if she is able to fulfill a morals clause in the will. Meanwhile she gets involved with a ring of teen dope fiends who try to frame Joan to acquire the fortune themselves. But infiltrating the gang, there is an undercover reporter posing as a soda jerk gathering evidence.\n\nOriginal title: Assassin of Youth (1938)  AKA:  The Marijuana Menace\n\nBlack & White version: https://youtu.be/Q3KXl0Aug3A\n\n\nDirector: Elmer Clifton\nWriters: Charles A. Browne, Elmer Clifton, Leo J. McCarthy\nStars: Luana Walters, Arthur Gardner, Dorothy Short\nGenres: Colorized classics, Crime, Drama, Propaganda\n\n00:00  Full Movie\n00:22  A salesgirl helps a customer find clothes for a party, but later realizes she was given a $100 bill by mistake.\n06:59  The video is about a conversation between Mrs. Worthington, Mr. Konwent, and Miss Miller regarding their breakfast, travel, and the idea of being millionaires.\n13:43  A man named Mr. Wheeler buys a boat, but later realizes he has been swindled.\n18:46  The video is a transcript of a conversation between multiple characters discussing a man named Sam and their plans.\n29:02  A man confesses to his girlfriend that he pretended to be a millionaire and stole money to buy a yacht.\n31:26  A couple discusses their feelings and plans for the future.\n37:40  A man hires a detective agency to catch a group of crooks who have been victimizing him.\n45:55  A couple discovers a winning streak while gambling at a casino.\n1:01:40  John Wheeler wins a large sum of money and plans to use it to take over various establishments, including the Chuckerton.\n1:05:39  A conversation between two people about their upcoming weddings and travel plans.\n1:12:02  A woman tries to convince a man to give back the money he won in a gambling game before he loses it all.\n\n\n@CultCinemaClassics:",
      "id": "Bo6w5g1L56Q",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:38.866Z"
}