{
  "imdbId": "youtube-xp9mHaWUxZ0",
  "title": "Attack From Space (1965, Action) Ken Utsui, Sachihiro Ohsawa, Junko Ikeuchi | Film",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xp9mHaWUxZ0",
      "title": "Attack From Space (1965, Action) Ken Utsui, Sachihiro Ohsawa, Junko Ikeuchi | Film",
      "description": "A cosmic clash of heroes and aliens!\nBenevolent aliens from the planet Emerald send superhero Starman to protect Earth from invasion by an evil alien race called the Spherions. When Starman arrives on Earth, he discovers a conspiracy involving Earth's top scientists, and he must root out the traitors and also stop the impending alien invasion.\n\nOriginal title: Attack From Space (1965) AKA:  Super Giant Vs the Satellites / Attack from Outer Space\n\nColorized version: https://youtu.be/1TU5YNrM-Ng \n\n\nThis film is subtitled in many languages.\n\nDirectors: Koreyoshi Akasaka, Teruo Ishii, Akira Mitsuwa\nWriters: Ichirô Miyagawa\nCast: Ken Utsui, Sachihiro Ohsawa, Junko Ikeuchi\nGenres: Action, Sci-Fi\nCCC Movie review: https://boxd.it/6kaA9V\n\n\n00:00 Full Movie (with subtitles)\n01:04 Invasion threat from advanced alien civilization prompts creation of a powerful robot to protect Earth.\n18:29 Invasion from outer space threatens Earth as a scientist's plans are stolen, leading to a global emergency.\n23:15 Interstellar battle unfolds as resistance fights for freedom against an impending threat.\n37:44 A space station faces a threat from alien forces, leading to a race against time to launch a counterattack.\n53:05 Space station destruction mission completed with sacrifice and rescue\n1:15:12 Farewells and goodbyes in a space-themed movie scene with a touch of luck.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "xp9mHaWUxZ0",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:01.214Z"
}