{
  "imdbId": "youtube-vuLZXGr46rU",
  "title": "King Gojong and martyr An Jung-Geun (Gojonghwangje-wa uisa An Junggeun)(1959)",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vuLZXGr46rU",
      "title": "King Gojong and martyr An Jung-Geun (Gojonghwangje-wa uisa An Junggeun)(1959)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00460\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00460\n\n감독(Director) : 전창근(Jeon Chang-Keun)\n출연 : 김승호,전창근,최남현\n\n줄거리 : 망국의 기운이 감도는 구한말. 이토오 히로부미(최남현)와 친일 대신의 압력에 의해 을사조약이 체결된 지 얼마 후, 헤이그 밀사 사건을 빌미로 일제는 고종황제(김승호)의 퇴위를 강요한다. 삼흥학교에서 인재양성을 하던 안중근은 안창호의 연설을 듣고 의병운동에 참가할 것을 결심하고 연해주로 간다. 그는 한국의병 참모중장, 만주원정군 사령관으로서 동지들과 함께 일본군에 대항해 독립운동을 벌인다. 안중근과 동지들은 이토오 히로부미가 북만주를 시찰할 것이란 소식을 듣고 하얼빈역에서의 저격을 계획한다. 거사는 성공하지만 안중근과 동지들은 투옥된다. 그는 법정에서도 조선의 독립운동의 정당성을 주장하며 일제에 항거하다 사형당한다.\n\nCasts : Kim Seung-Ho, Jeon Chang-Keun, Choi Nam-Hyeon\n\nSYNOPSIS : At the end of the Joseon Dynasty, shortly after the Eulsa Treaty has been forced to be concluded by Ito Hirobumi(Choe Nam-hyeon) and the pro-Japanese courtiers, Japan pressures King Gojong(Kim Seung-ho) to step down from the throne. Meanwhile, An Jung-geun, who is cultivating men of ability at Samheung school, is deeply impressed by a speech made by An Chang-ho, and heads for Russia to volunteer the army fighting for independence of the country. As both a lieutenant general of the Korean militia and a commander of the Korean expeditionary force in Manchuria, he carries on the independence movement in defiance of Japanese coercion. When he and his comrades are tipped that Ito Hirobumi is going to make a tour of inspection to   northern Manchuria, they plan to shoot at Ito Hirobumi, the Japanese ruler. Their attempt succeeds, but they are arrested and sent to jail. At court, An Jung-geun holds fast to his views about the cause of independence against Japan, but he is finally executed in prison.",
      "id": "vuLZXGr46rU",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:24.186Z"
}