{
  "imdbId": "youtube-0NVw8zS7U2g",
  "title": "Feed - Nothing can separate us! (Gripping full-length film in German, complete German films)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0NVw8zS7U2g",
      "title": "Feed - Nothing can separate us! (Gripping full-length film in German, complete German films)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein packendes Psychodrama mit TOM FELTON (\"Harry Potter\" & \"Against the Sun\") & TROIAN BELLISARIO (\"Pretty Little Liars\"): Nach dem tragischen Verlust ihres Zwillingsbruders kämpft eine junge Frau gegen Schuldgefühle, Essstörungen und ihre inneren Dämonen...\n\nFEED (2017)\nOriginaltitel: Feed \nMit: Troian Bellisario, Tom Felton, Ben Winchell\nRegie: Tommy Bertelsen\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie Zwillinge Olivia (Troian Bellisario) und Matthew Grey (Tom Felton) wachsen in einem privilegiertem Umfeld auf, das hohe Erwartungen an sie stellt. Sie blicken einer rosigen Zukunft entgegen und auch mit 18 Jahren könnte ihre Beziehung nicht inniger sein - fast nichts kann sie trennen, nicht einmal ihre Träume. Eine Tragödie reißt die Geschwister in ihrem letzten gemeinsamen Schuljahr auseinander - die eine Hälfte muss nun lernen, ohne die andere auszukommen. Aber es gibt eine Möglichkeit, auch den Tod zu überwinden und die Geschwisterliebe der Zwillinge macht vor keinem Hindernis Halt...\n#Netzkino #ganzerFilm #TomFelton\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "0NVw8zS7U2g",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.125Z"
}