{
  "imdbId": "youtube-9zHDswcLRWk",
  "title": "죽엄의 다리 (1974) / Kicks of Death (Jug-eom-ui dali)",
  "year": 1974,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9zHDswcLRWk",
      "id": "9zHDswcLRWk",
      "title": "죽엄의 다리 (1974) / Kicks of Death (Jug-eom-ui dali)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02752\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02752\n\n감독(Director) : 이두용(Chung Jin Woo)\n출연 : 한용철 , 우연정 , 배수천 , 장일식 , 김문주 \n줄거리 : 939년 중일전쟁 직후 상해 일본군 아까사까는 한국독립군에게 무기를 밀매하여 사령부의 금고를 털어 군자금을 탈취해간 박철호라는 한국인을 체포하기 위해 현상금을 걸고, 팽은 박철호를 잡아 현상금을 챙긴다. 아까사까는 훔친 돈의 행방을 찾기 위해 박철호의 여동생 영란을 숨겨주고있다는 한용철을 찾고자 하고, 용철은 영란에게 오빠를 만나서 고향에 가게 해주겠다고 약속한다. 용철은 아버지는 친일적 과거를 들먹이며 아까사까를 찾아와 박철호를 내달라 하지만 거부당한다. 팽의 애인 장수화는 용철을 유혹해 영란이 있는 곳이 적힌 쪽지를 발견하나 이는 함정이였다. 영란을 찾으러 도착한 아까사까 일당과 팽 일당은 그곳에서 격돌하고, 그 사이 용철은 갇힌 박철호를 구해낸다. 이 후 아까사까에게 붙잡힌 용철은 심한 고문을 당한다. 결국 아까사까는 독립군 자금(다이아몬드)를 찾게 되나, 그 때 일본의 항복선언이 방송에 흘러나온다. 독립군은 고향에 돌아가자며 용철에게 말하지만, 용철은 아까사까와 팽을 찾아 차례로 수하지만, 마지막 아까사까의 총을 피하지 못한다.\n\nCasts :Han Yong-cheol , Woo Yeon-jeong , Bae Su-chun , Chang Il-sik , Kim Mun-ju \nSYNOPSIS :Immediately following the Sino-Japanese War in 1939, Akkasakka, a Japanese soldier in Shanghai set a bounty on a Korean named Park Cheol-ho who sold weapons to Korean Independence Fighters and stole the sinews of war from the command center’s safe. Paeng captured Park Cheol-ho and took the bounty. Akkasakka began searching for Han Yong-cheol who was supposedly harboring Park Cheol-ho’s younger sister Yeong-ran in order to find the stolen money. And Yong-cheol promises Yeong-ran that he would help her meet her brother and return to their hometown. Yong-cheol came to Akkasakka by mentioning his father’s past of helping the Japanese and requests to release Park Cheol-ho, but is denied. Paeng’s lover Jang Su-hwa seduces Yong-cheol and discovers a note stating where Yeong-ran is located, but this was a trap. Akkasakka who came in search of Yeong-ran met with Paeng’s group and fight there, and in the meantime, Yong-cheol saves Park Cheol-ho. Later, Yong-cheol is captured by Akkasakka and suffers extreme torture. Akkasakka finally finds the funding (diamonds) for the independence army, but right then, Japan’s surrender is broadcasted. The independence fighters ask Yong-cheol to return home together, but Yong-cheol gets his revenge on Akkasakka and Paeng. But he is unable to avoid the last gunshot by Akkasakka.",
      "addedAt": "2025-12-26T00:21:41.096Z",
      "thumbnail": "https://i.ytimg.com/vi/9zHDswcLRWk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC1-XvyKfZmitCp6zD1Qxl1dVvS1Q",
      "duration": 5481,
      "language": "ko",
      "year": 1974,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:41.458Z"
}