{
  "imdbId": "youtube-PiEk2DFNmAU",
  "title": "It's Not Her Sin (Geu yeoja-ui joega anida)(1959)",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PiEk2DFNmAU",
      "title": "It's Not Her Sin (Geu yeoja-ui joega anida)(1959)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00430\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00430\n\n영화글 : https://www.kmdb.or.kr/story/10/1992\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 노능걸(백상호),주증녀(성희),최은희(영숙),이민,전택이,박경주(검사),장일호,주선태,박상익,신동훈,박성대,동춘광,이은주,주인선,김정화\n\n줄거리 : 주불공사 백상호(노능걸)의 부인 성희(주증녀)는 외무부 계단에서 영숙(최은희)을 총으로 쏜다. 사건은 치정삼각관계로 신문에 보도되고 검사(박경주)는 백상호를 검찰로 불러 수사를 시작한다. 백상호가 부인이 이중생활을 한 것으로 오해하고 이혼하려 하자 영숙은 검사 앞에서 지난 일을 모두 이야기한다. 건달인 상근과 사귀다 임신까지 하게된 영숙은 수양언니인 성희에게 낙태 문제를 상의한다. 아이를 가지지 못하는 성희는 영숙과 평생의 비밀로 하기로 약속하고 남편이 외국에 나간 사이 영숙이 아이를 낳게 해 자신의 아들인 것처럼 키우기 시작한다. 그로부터 몇 년 후, 일본에서 돌아온 상근은 영숙에게 백만원을 달라고 요구한다. 영숙이 이 문제를 상의해오자 성희는 자신의 결혼 예물을 팔아 돈을 마련해주겠다고 약속한다. 이 돈을 마련하는 일로 해서 영숙은 성희의 집에 자주 드나들고, 자연스럽게 자신의 친아들 식이와 가까워진다. 영숙은 성희에게 다 필요 없으니 식이를 돌려달라고 하고 성희는 절대 그럴 수 없다고 한다. 영숙은 백상호에게 모든 걸 얘기하겠다며 외무부로 간다. 영숙을 뒤따라간 성희는 영숙을 총으로 쏘고 구속된다. 모든 사실을 고백한 영숙은 검사에게 성희를 용서해 달라고 하고, 풀려난 성희는 영숙에게 식이를 데려가라고 한다. 그러나 식이가 엄마라고 부르며 성희에게 안겨 우는 모습을 본 영숙은 약혼자인 명철과 함께 떠난다.\n\nCasts : No Neung-Keol, Choi Eun-Hee, Joo Jeung-Nyeo\n\nSYNOPSIS : Seong-hui (Ju Jeung-nyeo), wife of diplomat Baek Sang-ho(No Neung-geol), shoots at Yeong-suk (Choe Eun-hui) and is arrested by the police. The media report it is prompted by a love triangle and a prosecutor (Park Gyeong-ju) starts to interrogate Yeong-suk. Misunderstood that his wife has cheated him, Baek Sang-ho tries to divorce and Yeong-suk begins to tell him and the prosecutor about her past. When Yeong-suk was dating a loser of a guy named Sang-geun, she became pregnant, and asked for the advice of her half-sister Seong-hui.  Yeong-suk ended up giving her child to Seong-hui, who was unable to have children of her own. Seong-hui pretended to be the true mother of the child, and Sang-ho, absent when the clandestine exchange was made, has no idea of the truth.  A few years later, Sang-geun returns from Japan and demand one million won from Yeong-suk. She asks Seong-hui for help and Seong-hui promises to have the money ready by selling her jewelries. Since then Yeong-suk begins to frequently drop by Seong-hui's home again and she naturally comes to terms with her son Sik-i.  Yeong-suk regrets having given her son and demands that her baby be returned to her, but Seong-hui stubbornly refuses.  Yeong-suk then threatens to tell Sang-ho the truth, and heads for his workplace to do so.  Seong-hui follows her and fires a shot at her. After Yeong-suk tells the prosecutor the truth, she pleads with him to release her half-sister, and Seong-hui is set free. She finally permits Yeong-suk to live with her child. But Yeong-suk sees that her child really loves Seong-hui, and she leaves with her fiance Myeong-cheol, giving up her child to her half-sister once again.",
      "id": "PiEk2DFNmAU",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:00.111Z"
}