{
  "imdbId": "youtube-Wx9nBGHnH0U",
  "title": "The Disappearance of Flight 412 (1974, Mystery film) UFO sighting is real, Flight 412 found it",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Wx9nBGHnH0U",
      "id": "Wx9nBGHnH0U",
      "title": "The Disappearance of Flight 412 (1974, Mystery film) UFO sighting is real, Flight 412 found it",
      "description": "Colonel Pete Moore (Glenn Ford) is commander of the Whitney Radar Test Group, which has been experiencing electrical difficulties aboard its aircraft. To ferret out the problem, he sends a four-man crew on Flight 412. Shortly into the test, the jet picks up three blips on radar, and subsequently, two fighters scramble and mysteriously disappear. At this point, Flight 412 is monitored and forced to land by Digger Control, a top-level, military intelligence group that debunks UFO information. The intrepid colonel, kept in the dark about his crew, decides to investigate the matter himself.\n\nOriginal title: The Disappearance of Flight 412 (1974)\n\nDirector: Jud Taylor\nWriter: George Simpson\nStars: UFOs, Glenn Ford, Bradford Dillman, David Soul\nGenres: Science-Fiction, Drama, Mystery & Thriller\n\n\n00:00 Full Movie (with subtitles).\n00:18 Investigation into UFO sightings during a routine flight exercise leads to mysterious events.\n07:45 Military aircraft encounter unidentified flying objects during a routine mission.\n14:30 Mysterious events unfold as Flight 412 is rerouted to Hollowell amidst radio transmission issues and radar failures.\n26:47 Investigation into radar blips and disappearance of jets after UFO sighting.\n33:27 Military jets disappear mysteriously after encountering unidentified flying objects.\n38:44 Military personnel investigate UFO sighting and encounter restrictions at a restricted area.\n46:35 Military personnel are detained for debriefing, facing pressure to comply with orders related to national security.\n56:22 Military investigation into UFO sightings reveals hidden agendas and manipulation of truth.\n1:06:17 Military cover-up of UFO sightings leads to neglect of investigation and consequences for those involved.\n\n \n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:49.157Z",
      "thumbnail": "https://i.ytimg.com/vi/Wx9nBGHnH0U/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLDdJhFra-MYgP2uH8JakZ6JB_H8GA",
      "duration": 4336,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:49.236Z"
}