{
  "imdbId": "youtube-ydS6g6reNGw",
  "title": "Camp - Deadly Holidays (HORROR FILM in full length, entire horror films for free, films in German)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ydS6g6reNGw",
      "id": "ydS6g6reNGw",
      "title": "Camp - Deadly Holidays (HORROR FILM in full length, entire horror films for free, films in German)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Drei junge Amerikaner nehmen einen Sommerjob in einem spanischen Ferienlager an, das sich als marode und unheimlich erweist. Doch das wird zur Nebensache, als eine Zombie-Epidemie ausbricht und sie mit dem Lagerleiter ums Überleben kämpfen müssen... Vom Kultfilm \"REC\"-Regisseur ALBERTO MARINI.\n\nCAMP - TÖDLICHE FERIEN (2015)\nOriginaltitel: Summer Camp\nMit: Diego Boneta, Jocelin Donahue, Maiara Walsh\nRegie: Alberto Marini\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nChristy (Jocelin Donahue), Michelle (Maiara Walsh) und Will (Diego Boneta) wollen den Sommer über als Betreuer in einem spanischen Ferienlager arbeiten, wo die jungen Amerikaner den einheimischen Kindern Englischunterricht geben sollen. Doch im Vordergrund steht für sie natürlich ein entspannter Urlaub und ein paar schöne Tage. Doch schnell wird ihnen klar, dass dieser Plan nicht ganz aufgeht, denn das Camp liegt nicht nur mitten im Nirgendwo, sondern ist auch noch völlig heruntergekommen. Und dann gibt es in unmittelbarer Nachbarschaft auch noch einen Wohnwagen mit sehr merkwürdigen und ziemlich aggressiven Bewohnern. Doch wie schlimm es wirklich ist, müssen sie sehr bald feststellen. Denn für das Trio und den einheimischen Campleiter Antonio (Andrés Velencoso) beginnt ein Horrortrip, bei dem es sehr bald ums nackte Überleben geht und sie sich nicht nur vor den bedrohlichen Fremden, sondern auch vor sich selbst in Acht nehmen müssen…\n#Netzkino #ganzerFilm #horrorfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:49:19.732Z",
      "thumbnail": "https://i.ytimg.com/vi/ydS6g6reNGw/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD817fTrrpIHhC6XZQ-rwAy6RhD3w",
      "duration": 5045,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}