{
  "imdbId": "youtube-H73HiVcDzRs",
  "title": "Film Noir | The Big Chase 1954 | with Lon Chaney Jr. | Crime runs—but justice flies!",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H73HiVcDzRs",
      "title": "Film Noir | The Big Chase 1954 | with Lon Chaney Jr. | Crime runs—but justice flies!",
      "description": "The Big Chase is a 1954 American crime drama film directed by Arthur Hilton and written by Fred Freiberger, Orville H. Hampton. One of the film's scenes was directed by producer Robert L. Lippert Jr. This is the second film in which Langan appeared with Jergens, his real-life wife.\n\nSynopsis:\nA policeman with a pregnant wife on his side uses a helicopter to chase a payroll thief trying to escape to Mexico.\n\nMain Actors:\nGlenn Langan - Officer Pete Grayson\nAdele Jergens - Doris Grayson\nLon Chaney Jr. - Kip\nJim Davis - Brad Bellows\nDouglas Kennedy - Police Lt. Ned Daggert\nJay Lawrence - Jim Miggs\nJoe Flynn - Milton Graves\nPhil Arnold - Bunkie\nGil Perkins - payroll guard\nWheaton Chambers - Doctor Janssen\n\nBlack & White version:  https://youtu.be/QB6Si-ZHpYc\n\n\n\n00:00 – Full Movie with subtitles\n01:12 – Lieutenant Daggert begins narrating a thrilling criminal case while a journalist interviews him about crime detection.\n07:30 – Officer Pete Grayson graduates from the Police Academy, and his wife Doris shares her pregnancy news with excitement.\n15:00 – Convicts Brad Bellows and Jim Miggs plot their next heist upon Brad’s release, setting up the tension.\n25:00 – The gang executes a daring heist, leading to chaos and the start of a police investigation.\n35:00 – Pete and his partner Bolinger engage in a high-speed pursuit, risking their lives to catch the criminals.\n45:00 – The chase escalates as the criminals use every trick to evade capture, hijacking vehicles and fleeing through different terrains.\n53:00 – A helicopter joins the pursuit,  an aerial advantage in tracking the criminals heading for a desperate escape by boat.",
      "id": "H73HiVcDzRs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:32:59.906Z"
}