{
  "movieId": "youtube-kBpqVDtQyuc",
  "title": "Sherlock Holmes | A Study In Scarlet (1933) [Thriller]",
  "year": 1933,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kBpqVDtQyuc",
      "id": "kBpqVDtQyuc",
      "title": "Sherlock Holmes | A Study In Scarlet (1933) [Thriller]",
      "description": "\"A Study in Scarlet\" (1933) is a drama film directed by Edwin L. Marin and starring Reginald Owen as Sherlock Holmes and Anna May Wong as Mrs. Pyke. The title comes from Arthur Conan Doyle's novel of the same name, the first in the Holmes series, but the screenplay by Robert Florey was original.\n\nDespite her billing, Anna May Wong only appears on screen for less than ten minutes. Reginald Owen had played Dr. Watson in Sherlock Holmes the previous year; Owen was one of only four actors to play both Holmes and Watson (Jeremy Brett played Watson on stage in the United States prior to adopting the mantle of Holmes on British television, Carleton Hobbs played both roles in British radio adaptations while Patrick Macnee played both roles in US television movies).\n\n---\n\nDirected by Edwin L. Marin, written by Robert Florey (screenplay) and Arthur Conan Doyle (novel's title), starring Reginald Owen, June Clyde and Anna May Wong.\n\n---\n\nSource: \"A Study in Scarlet (1933 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 22 April 2012. Web. 29 July 2012. http://en.wikipedia.org/wiki/A_Study_in_Scarlet_(1933_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:42:02.931Z",
      "thumbnail": "https://i.ytimg.com/vi/kBpqVDtQyuc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD3lTN9hs1Aq24cAEnyBdNQjxDlcQ",
      "duration": 4279,
      "language": "en",
      "year": 1933,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "sherlock-holmes",
      "name": "Sherlock Holmes"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T22:42:02.931Z"
}