{
  "movieId": "youtube-AtRHSonDUpc",
  "title": "Multiverse - Parallele Dimensionen (SCI FI THRILLER ganzer Film Deutsch 2025, Thriller Filme neu)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AtRHSonDUpc",
      "id": "AtRHSonDUpc",
      "title": "Multiverse - Parallele Dimensionen (SCI FI THRILLER ganzer Film Deutsch 2025, Thriller Filme neu)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Vier brillante Physikstudenten experimentieren mit der Multiversumstheorie – bis etwas schiefgeht und sie plötzlich ihren eigenen Doppelgängern gegenüberstehen. Bald verschwimmen Realität und Parallelwelt, und niemand weiß mehr, wem er trauen kann.\n\nMULTIVERSE - PARALLELE DIMENSIONEN (2019)\nOriginaltitel: Multiverse\nMit: Paloma Kwiatkowski; Munro Chambers; Robert Naylor\nRegie: Gaurav Seth\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nDie Quantenphysik-Student*innen Loretta (Paloma Kwiatkowski), Gerry (Munro Chambers), Danny (Robert Naylor) und Amy (Sandra Mae Frank) stehen im Rahmen ihrer Forschungen kurz vor einem wichtigen, wissenschaftlichen Durchbruch. Doch bevor es soweit kommen kann, stirbt Loretta bei einem Autounfall und wirft das ganze Unterfangen aus der Bahn. Fünf Monate später taucht sie dann plötzlich wieder bei ihren Freund*innen auf. Die neue Loretta ist voller Enthusiasmus und bereit, sich an die Arbeit zu machen, scheint aber nicht zu wissen, was mit ihr damals passiert ist. Danny, Gerry und Amy sind sich nicht sicher, ob sie an ihrem Verstand zweifeln sollen oder ob tatsächlich etwas Unglaubliches geschehen ist. Innerhalb der nächsten Tage trifft dann jede*r von ihnen auf seinen eigenen Doppelgänger. Anstatt gemeinsam herauszufinden, was hier vor sich geht, kommt es zu Rivalitäten und Konflikten innerhalb der Gruppe …\n#Netzkino #ganzerFilm #scifi\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:47:20.943Z",
      "thumbnail": "https://i.ytimg.com/vi/AtRHSonDUpc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAe8U_XyB6XZVwv6MgR1baW62ENkw",
      "duration": 5425,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}