{
  "imdbId": "youtube-3dGyQfrZHR8",
  "title": "Decision: Liquidation | SPY MOVIE",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3dGyQfrZHR8",
      "title": "Decision: Liquidation | SPY MOVIE",
      "description": "Action film about a special operation to eliminate the terrorist Shamil Basayev. The film is based on actual events and touches on one of the most horrific pages of the recent past of the Russian Federation. As a result of a highly complex operation of the special services, terrorist leader Shamil Basayev was killed. It was him who became the prototype of the main negative character in the movie, Shamil Bazgayev. \n\nShamil Basayev is responsible for heinous acts of terrorism: \n- The Budennovsk attack (1995)\n- The kidnapping of Doctors Without Borders worker in Chechnya (2001) \n- Nord-Ost siege (2002)\n- Suicide bombing of the Chechen government headquarters (2002)\n- Series of suicide bombings (2003)\n- Bombing of gas pipelines and power transmission lines in the Moscow region (2004)\n- Terrorist attack in Grozny on May 9, 2004\n- Terrorist attacks in Moscow (2004)\n- Airplane Explosions (2004)\n- The Beslan school siege (2004)\n- Power system breakdown in Moscow\n- Arson at the Stanislavsky and Nemirovich-Danchenko Theater (2005)\n\nThe script of Decision: Liquidation was based on the memories of the direct participants of the FSB operation. \n\nYear of production: 2018\n\nDirected by: Alexandr Aravin\nWritten by: Alexey Buzin, Pavel Kosov, Pavel Pavlov\nDirector of photography:\nMusic: Yuri Poteyenko\nProduction designer: Alik Tagirov\nStarring: Igor Petrenko, Alexey Vertkov, Ayub Tsingiev, Dmitry Parastayev, Alexey Shevchenkov, Ivan Shakhnazarov\n\nSubscribe to our YouTube channel, and be sure to click the bell so that you won’t miss the best Soviet movies! \n\n#action #terrorism #special_operation #FullMoviesWithEngSubs",
      "id": "3dGyQfrZHR8",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw",
      "regionRestriction": {
        "blocked": [
          "PL"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-23T03:45:58.065Z"
}