{
  "imdbId": "youtube-_kwoHgEiceM",
  "title": "King of the Zombies 1941 (Horror, Comedy) Human sacrifices! Savage torture! Voodoo rites!",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_kwoHgEiceM",
      "title": "King of the Zombies 1941 (Horror, Comedy) Human sacrifices! Savage torture! Voodoo rites!",
      "description": "On a haunted island where the living dread the dead!\nWhen a group of travelers becomes stranded on a mysterious island, they must confront a mad scientist who uses voodoo to resurrect the dead and create an army of zombies.\n\nOriginal title: King of the Zombies (1941)\n\nBlack & White version: https://youtu.be/Z2Royl-3MjE\n\nDirector: Jean Yarbrough\nWriter: Edmond Kelso\nGenres: Colorized, Adventure, Comedy, Horror, \n\nMain Cast: \nDick Purcell as James McCarthy\nJoan Woodbury as Barbara Winslow\nMantan Moreland as Jefferson 'Jeff' Jackson\nHenry Victor as Dr. Miklos Sangre\nJohn Archer as  Bill Summes\n\n\n00:00 Full Movie (with subtitles)\n1:00 A strange encounter at a remote island mansion unveils dark secrets and supernatural forces.\n9:37 Unexpected visitors meet a mysterious island doctor and uncover the chilling truth about zombies and magic potions.\n16:09 Unsettling rituals and forbidden knowledge surface as the guests delve deeper into the island's mysteries.\n22:18 Voodoo rites, zombies, and hidden motives entangle the group in a dangerous island conspiracy.\n29:29 Ghosts, zombies, and a secret radio transmitter add to the mounting terror on the island.\n36:23 Suspicion and hidden secrets collide, as eerie events unravel on this isolated island.\n42:14 Hypnosis, zombies, and a missing person deepen the mystery as the group searches for answers.\n51:00 A man falls ill with a deadly fever, sparking a series of eerie occurrences tied to voodoo and zombies.\n58:50 The group faces a deadly mix of voodoo rituals and zombie threats as danger tightens its grip on the island.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "_kwoHgEiceM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:16.656Z"
}