{
  "movieId": "youtube-DD5_py-PtC8",
  "title": "Shame  / Not Wanted 1949 (Film-Noir, Drama) Elmer Clifton, Ida Lupino | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DD5_py-PtC8",
      "id": "DD5_py-PtC8",
      "title": "Shame  / Not Wanted 1949 (Film-Noir, Drama) Elmer Clifton, Ida Lupino | Colorized",
      "description": "Out of Innocent Confusion . . . was born HEARTBREAK! . . . In a picture that plunges heart-deep into the story of one girl's mistake! \nA beautiful but unsophisticated girl is seduced by a worldly piano player and gives up her out-of-wedlock baby, her guilt compels her to kidnap another child.\n\n\nOriginal title: Not Wanted (1949) AKA: Shame / Unwed Mother / Streets of Sin \nThis movie is available with subtitles in many languages. \n\nWatch the HD Black & White version: https://youtu.be/Je11gPeMJM8\n\n\nDirector: Elmer Clifton, Ida Lupino \nWriter: Paul Jarrico, Ida Lupino, Malvin Wald \nStars: Sally Forrest, Keefe Brasselle, Leo Penn\nGenre: Colorized, Drama, Triple F rated\nBudget: $153,000\n\n\n\n00;00 Full colorized Film (with subtitles)\n02:47 A glimpse into a dramatic film featuring a young woman's struggles and family dynamics in the 1940s.\n14:20 Young woman's struggles with family, aspirations, and encounters with a stranger named Drew Baxter.\n25:57 A chance encounter leads to a job offer and a surprise visit, highlighting the complexities of relationships and responsibilities.\n33:41 Classic film-noir featuring a woman's journey through unexpected circumstances and a budding romance in the 1940s.\n43:33 A woman expresses her feelings for a man who is leaving town, but he rejects her and explains his need to keep moving.\n53:29 A woman receives unexpected news and faces a difficult decision regarding her pregnancy.\n58:39 A young woman seeks help at a home for unwed mothers, hiding her pregnancy from her family and the father of the baby.\n1:06:49 A young woman struggles with the decision to give up her baby for adoption.\n1:21:34 A young woman faces the consequences of her actions after mistakenly believing a baby is hers.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYDDUshEcMs1CHZW1booguo",
      "addedAt": "2025-12-27T00:35:59.396Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/DD5_py-PtC8/maxresdefault.webp",
      "duration": 5471,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:59.525Z"
}