{
  "imdbId": "youtube-qSgvW7jD6mE",
  "title": "Girl Gang Terrorists (1956, Film-Noir) Jean Moorhead, Barbara Weeks, Art Millan | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qSgvW7jD6mE",
      "id": "qSgvW7jD6mE",
      "title": "Girl Gang Terrorists (1956, Film-Noir) Jean Moorhead, Barbara Weeks, Art Millan | Colorized",
      "description": "Teenage killers...fearing no law...taking their thrills without shame!\nA newspaper publisher's daughter, Paula, experiences neglect from her parents. She and her friends resort to crime, disguising themselves as men, holding up gas stations, and intimidating young men with guns, all while having make-out parties when her parents are away. Their 'black-market dealer' helps them sell stolen goods, directing them to vandalize the school at the request of mysterious, un-American clients, leading them into conflict with the law, apple pie, and even God himself.\n\nOriginal title: The Violent Years (1956) AKA: Girl Gang Terrorists / Teenage Girl Gang\n\nBlack & White version: https://youtu.be/fN0dYEa6lWk\n\nDirected by: William Morgan\nWriter credits: Edward D. Wood Jr.\nCast: Jean Moorhead, Barbara Weeks, Art Millan, Arthur Millan, Theresa Hancock, Joanne Cangi, Gloria Farr, Glenn Corbett, Lee ConstantI\nGenres: Colorized classics, Crime, Thriller, Drama, Film-Noir\n\n\n00:00 Full movie (with subtitles)\n01:42 A court session reveals parental failure in raising a troubled child, leading to a series of violent crimes.\n10:05 A film-noir about a gang of criminals targeting gas stations, leading to a dangerous encounter with hostages.\n17:33 Teenage girl seeks father's help to prevent juvenile delinquency in her bid for student body president.\n25:42 Teenage gang led by a confident leader plans school vandalism for profit, facing blackmail and betrayal.\n28:22 Intrigue unfolds as a group of individuals get entangled in a series of criminal activities and clashes with law enforcement.\n45:39 Lessons learned from a young girl's thrill-seeking behavior leading to a murder conviction.\n52:36 Legal decision regarding child custody and juvenile delinquency rooted in adult behavior.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:06.065Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/qSgvW7jD6mE/maxresdefault.webp",
      "duration": 3402,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:06.202Z"
}