{
  "imdbId": "youtube-6DXsBEa44no",
  "title": "Transference - Escape the Dark (PSYCHOTHRILLER full movie German, Thriller movies German complete)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6DXsBEa44no",
      "title": "Transference - Escape the Dark (PSYCHOTHRILLER full movie German, Thriller movies German complete)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Übernatürlicher Psychothriller von 2020! Ein Geschwisterpaar ist auf der Flucht - nachdem Emmas Kräfte einen Vorfall in einem Krankenhaus ausgelöst haben, versucht ihr Bruder Joshua sein Bestes, sie zu verstecken. Doch jemand ist ihnen auf den Fersen...\n\nDARK MUTANTS - OUT OF CONTROL (2019)\nOriginaltitel: Transference - Escape the Dark\nMit: Jeremy Ninaber, Melissa Joy Boerger, Matt Daciw, Matthew Ninaber, Tony Nash\nRegie: Matthew Ninaber\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDer zwölfjährige Joshua (Eamon Hanson) wird nach dem Tod seines Vaters dazu verpflichtet, sich um seine jüngere Schwester zu kümmern. Das Besondere daran: Seine Schwester besitzt eine besondere Fähigkeit, somit wird Joshuas größte Herausforderung sein, sie zu verstecken und nicht unbedingt zu beschützen. Zwanzig Jahre später kämpft Joshua (Jeremy Ninaber) mit den Ereignissen seiner Kindheit und den Entscheidungen, die er seitdem getroffen hat, fertig zu werden. Aus Verzweiflung hat er Emma (Melissa Joy Boerger) in eine psychiatrische Einrichtung gebracht und versucht, sie gegen ihren Willen dort zu halten. Um ihr Geheimnis zu wahren, wird er immer mehr in die kriminelle Untergrundwelt gerissen. So kommt er nicht umhin, das Personal auf ihrer Station und diejenigen, die Zeuge Emmas erschreckender Fähigkeiten werden, auszuzahlen. Doch er verdient nicht genug, um ihre Vergangenheit weiterhin zu verbergen. Als ein Besucher versucht, Emma aus der Obhut zu nehmen, kommt Joshua zu der wichtigsten Erkenntnis, die er für sich, seine Schwester und die Welt machen kann.\n#Netzkino #ganzerFilm #PsychoThriller\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "6DXsBEa44no",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}