{
  "imdbId": "youtube-CK0GEPOVnYs",
  "title": "Das Geheimnis des Ponys - ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CK0GEPOVnYs",
      "id": "CK0GEPOVnYs",
      "title": "Das Geheimnis des Ponys - ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Kinder-Fantasy-Film  \" Das Geheimnis des Ponys \" in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo \n\nDie 16-Jährige Juliet Bello (Jenny Cipolla) lebt mit ihrer Stiefmutter Kim (Kristine DeBell, Die große Keilerei) und ihren beiden Stiefbrüdern Craig (Max Gray Wilbur) und Pete (Dillon Olney) sowie ihrem Pony auf einer Ranch. Die Familie steckt nach dem Tod des Vaters in finanziellen Schwierigkeiten und es sieht so aus, als ob man die Farm an den windigen Geschäftsmann Montgomery Beetle (Jason Faunt, Power Rangers Time Force) verlieren würde. Juliet ist verzweifelt, doch plötzlich geschieht etwas, was die Farm retten könnte: Ihr Pony Horatio kann sprechen! Was ist, wenn die Welt davon erfährt? Welcher Mensch träumt nicht davon, dass sein Haustier sprechen kann? Erfolgsregisseur David DeCoteau lässt diesen Wunsch in Erfüllung gehen und präsentiert einen herzerwärmenden Film für die ganze Familie über ein magisches Pony und ein bezauberndes Wunder.\n\nJetzt “ Das Geheimnis des Ponys ” kostenlos als ganzen Film auf deutsch sehen.\n\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #drama #movie #film #spielfilm #action # #ganzer Film #HD #drama #kostenlos #drama #Kinderfilm #pferdefilm #Familenfim\n \nFilmlänge: 88 Minuten \nDVD-Start (DE): 2014\n\nHauptdarsteller:\nKristine DeBell in der Rolle der Kim\nJohnny Whitaker in der Rolle des Horatio\nJason Faunt in der Rolle des Mr. Beetle\nJenny Cipolla in der Rolle der Juliet\n\n\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\n\nGanzer Film auf deutsch \nJetzt den Kinder-Fantasy-Film “ Das Geheimnis des Ponys ” in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:34.388Z",
      "thumbnail": "https://i.ytimg.com/vi/CK0GEPOVnYs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAujQnIYPezIu9GbNLWl_Om1ZFtgA",
      "duration": 5274,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:34.540Z"
}