{
  "imdbId": "youtube-1Br-pKUNDls",
  "title": "Convent - Biss in alle Ewigkeit (HORROR KOMÖDIE ganzer Film auf Deutsch, ganze Splatter Filme)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1Br-pKUNDls",
      "title": "Convent - Biss in alle Ewigkeit (HORROR KOMÖDIE ganzer Film auf Deutsch, ganze Splatter Filme)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein blutiger Amoklauf an der St. Francis Klosterschule erschüttert vor 40 Jahren das Land. Seitdem steht das Gebäude leer, die Tat ist zur düsteren Legende geworden. Als eine Gruppe Studenten das alte Gemäuer betritt, erweckt sie das Grauen von einst erneut – und entfesselt eine albtraumhafte Gewalt, die tief in der Vergangenheit verwurzelt ist.\n\nCONVENT (2000)\nOriginaltitel: The Convent\nMit: Joanna Canton, Richard Trapp, Dax Miller\nRegie: Mike Mendez\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nVor 40 Jahren fand in der Klosterschule St. Francis ein Massaker statt. Seitdem steht das Geisterhaus leer. Eines Tages entschließt sich eine Gruppe von Collegestudenten, dort eine Party zu feiern. Denn Spukhäuser ziehen abenteuerlustige junge Leute magisch an. Der religiöse Hintergrund des Gebäudes hat zusätzlich eine Gruppe Satanisten angelockt, die eine der jungfräulichen Studentinnen schnappen und für ihr Opferritual missbrauchen. Das wiederum führt dazu, dass von Dämonen besessene Nonnen aus ihren Gräbern auferstehen und nach Blut verlangen. Die Metzelei beginnt und der Studentin Clorissa (Joanna Canton) wird schließlich klar, dass sie Christine (Adrienne Barbeau) auftreiben muss, die 40 Jahre zuvor das Massaker begangen hat. Nur sie kann klären, was es mit den Dämonen eigentlich auf sich hat.\n#Netzkino #ganzerFilm #horrorfilme\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "1Br-pKUNDls",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}