{
  "movieId": "youtube-cjMQrZ0L-jU",
  "title": "Drones -  Ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cjMQrZ0L-jU",
      "id": "cjMQrZ0L-jU",
      "title": "Drones -  Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Actionfilm “Drones” mit Elois Mumford in ganzer Länge bei #Moviedome sehen. Mehr #GanzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nDieses actiongeladene Drama zeigt mit seiner packenden Story auch, welche moralischen und ethischen Probleme der Einsatz von bewaffneten Drohnen in Kriegsgebieten mit sich bringt.\n\nJetzt “Drones” kostenlos als ganzen Film in deutsch sehen\nDer Film “Drones” wurde in den USA im Jahr 2013 produziert.\nDas Kriegs-Drama erzählt die Geschichte zweier Drohnenpiloten des U.S. Militärs. Von ihrer Kommandozentrale aus treffen sie Entscheidungen über Leben und Tod. Dabei setzen sie auch unschuldige Menschenleben aufs Spiel. \nProduziert wurde der Film von Rick Rosenthal, Trent Broin und James C. Hart.\n\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme: www.moviedome.de\n\nFolge uns auch auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\n\n#Moviedome #Drones #movie #film #Actionfilm \n\nFilmlänge: 82 Minuten\nDVD-Start (DE): 16.02.2015\n\nWer sind die Schauspieler?\nDie Darsteller werden von folgenden Schauspielern verkörpert: \nEloise Mumford (bekannt aus Fifty Shades of Grey) in der Rolle der Sue Lawson\nMatt O’Leary (bekannt aus Skyscraper oder Project Blue Book) in der Rolle des Jack Bowles\nAmir Khalighi in der Rolle des Mamoud Khalil\nWhip Hubley in der Rolle des Colonel Wallace\nWilliam Russ in der Rolle des General Lawson\nVivian Dugre in der Rolle der Major Garcia \n\n\nDie Handlung und Szenen von “Drones”\nLieutenant Sue Lawson und ihr Kollege Jack Bowles sind Drohnenpiloten auf einem U.S. Militärstützpunkt in Las Vegas. Ihr Auftrag: Das Aufspüren, Identifizieren und Eliminieren von Terroristen in Afghanistan. Sue und Jack sind durchgehend auf der Basis und steuern von dort aus Drohnen in Afghanistan um ihre Zielpersonen ausschalten. Sue, die Tochter eines Militärgenerals, handelt besonnen und nach moralischen Grundsätzen, während Jack impulsiv agiert und strikt Befehle befolgt. Eine explosive Mischung, als die beiden auf einen Terroristen angesetzt werden. Denn dieser benutzt unschuldige Frauen und Kinder als Schutzschild für sich selbst. Der Film stellt die Frage, welchen Preis man im Kampf gegen den Terror zahlen darf. Ein actiongeladenes Drama, das moralische Aspekte der modernen Kriegsführung thematisiert.   \n\n\n\nDie deutsche Synchronisation der Verfilmung wurde durch die Firma DMT - Digital Media Technologie GmbH, Hamburg durchgeführt. \nMatt O’Leary; Sprecher: Marios Gavrilis\nElois Mumford; Sprecher: Kaya Marie Möller\n\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier.",
      "addedAt": "2025-12-26T00:36:31.310Z",
      "thumbnail": "https://i.ytimg.com/vi/cjMQrZ0L-jU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCxtx-TaChPCeaYMW65zt4Q_8QI0g",
      "duration": 4778,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:36:31.402Z"
}