{
  "imdbId": "youtube-pAXBFl03saY",
  "title": "The Tae Baek Mountains(Taebaegsanmaeg(Taebaeksanmaek))(1994)",
  "year": 1994,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pAXBFl03saY",
      "id": "pAXBFl03saY",
      "title": "The Tae Baek Mountains(Taebaegsanmaeg(Taebaeksanmaek))(1994)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04724\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04724\n\n감독(Director) : 임권택(Im Kwon-Taek)\n출연 : 안성기(김범우),김명곤(염상진),김갑수(염상구),오정해(소화),신현준(정하섭),최동준(심재모),정경순(죽산댁),방은진(외서댁),이호재(전원장),정진권,국정환,신동호,박용진,안석환,윤주상,권태원,김길호,최종원,최일순,이해룡,나갑성,박정규,오지혜,박승태,김경애,박현아,이미경,이인희,송희연,박홍근,김필국,임기빈,박길수,조태봉,이석구,주영선,양택조,김기종,하덕성,이도련,최성관,손전,유연수,조용태,안병경,홍원표,김기천,김재엽,임진택,이정훈,윤혜영,홍원선,문지현,주상호,정진완,오희찬,추봉,유일문,신동욱,조학자,김경란,남정희,정미경,전숙,안진수,이예민,김우석,서평석,유경애,정미자,최민금,김경호,이종상,오도영,윤일주,박부양,한명환,박용팔,김기범,박종설,길달호,홍충길,석인수,임예심,유명순,강희,김애라,최연수,김한준(아역),양재경(아역),윤동원(아역),G-DRAGON(아역),주선웅(아역),김미림(아역),임다빈(아역),윤성구(아역),이창세(우정출연),김병재(우정출연),배장수(우정출연),송용덕(우정출연)\n\n줄거리 : 해방후 좌, 우익의 대결이 심화되는 파란의 역사속에서 48년 10월 여순반란사건이 터진다. 염상진을 중심으로 한 좌익들은 벌교를 장악, 반동을 숙청해 나가다가 반란군의 패퇴와 함께 조계산으로 후퇴한다. 돌아온 경찰 등 우익세력은 좌익 연루자와 가족들을 조사하고, 대동청년단 감찰부장 염상구는 형 염상진에의 증오심으로 이 일에 앞장서 빨치산 강동식의 아내를 겁탈하는 등 못된 짓을 일삼는다. 한편 도당 직속 정하섭은 무당 소화의 집에 잠입하고 소화는 심부름을 해 주면서 둘 사이에는 신분을 초월한 사랑이 싹튼다. 순천중학 교사이며 민족주의자인 김범우는 좌,우익 양쪽 모두 비판하지만 오히려 빨갱이로 몰려 고초를 겪는다. 율어를 해방구로 장악한 염상진 일행에 대해 토벌대 대장 심재모와 김범우는 민족의 문제를 자각, 합리적이고 온건한 정책을 펴나가나 지주들의 반발에 부딪힌다. 결국 심재모는 율어탈환에 성공하지만 전출당하고 만다. 김범우는 이데올로기의 광기에 희생되는 사람들의 모습을 아파하면서 전쟁을 예감하는데, 염상진의 빨치산은 1949년 겨울부터 군경의 동계대토벌작전으로 혹독한 굶주림과 절망 속에서 전쟁이 터졌다는 소식을 듣게 된다. 인민공화국 초기 각종 정책에 나름대로 기대를 가졌던 사람들은 현물세 징수와 인민재판 등에 점차 실망하게 되고, 숨어있던 염상구와 염상진이 숙명적으로 만나게 된다.\n\nCasts : Ahn Seong-Ki, Kim Myeong-Kon, Kim Gap-Su, Shin Hyeon-Jun, Oh Jeong-Hae, Choi Dong-Jun, Jeong Kyeong-Sun, Bang Eun-Jin, Lee Ho-Jae\n\nSYNOPSIS : This film depicts the story of a village people who suffered form the turmoil of fighting between the left wing and the right wing about the time of the Korean Conflict (1948-1953) The village people may represent all the Korean people who suffered during the Korean Conflict However, the main theme of this film is not the fight of ideologies, but humanism itself, which Director Im considers one of the most important things in human beings. This film attempts to look into the confused Korean modern history form a bird' eye view In particular nationalist Kim Bum-Woo is an example of the typical Korean intellectuals who suffered in the whirlpool of ideological fighting during that period. This film shows us four different situations. One is the situation of a nationalist (Kim Bum-Woo) The second is the situation of a leftist (Yum Sang-Jin) the third is the situation of a rightist (Yum Sang-Goo), and the fourth is the situation of a girl shaman (So-Hwa) which is the highlight of this film. Through the exorcism performed by So-Hwa, The protagonists try happiness of human beings in our own Korean way",
      "addedAt": "2025-12-26T00:24:57.785Z",
      "thumbnail": "https://i.ytimg.com/vi/pAXBFl03saY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDC-8oAauN2K5Wl1bLydvRt88y22Q",
      "duration": 9842,
      "language": "ko",
      "year": 1994,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:57.813Z"
}