{
  "movieId": "youtube-ABFoY0NwvVQ",
  "title": "Gottes General: Schlacht um die Freiheit - Epischer Historienfilm - Ganzer Film nur bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ABFoY0NwvVQ",
      "id": "ABFoY0NwvVQ",
      "title": "Gottes General: Schlacht um die Freiheit - Epischer Historienfilm - Ganzer Film nur bei Moviedome",
      "description": "*GANZER FILM - EPISCHER HISTORIENFILM*\n\nDen großartigen Historienfilm „Gottes General: Schlacht um die Freiheit“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Gottes General: Schlacht um die Freiheit“:\nIMDb: *6,5* von 10\nAmazon: *3,9* von 5\n\n*Die Handlung von „Gottes General: Schlacht um die Freiheit“*\nMexiko 1926. Nur wenige Jahre nach der Revolution bricht erneut ein blutiger Bürgerkrieg aus. Als Präsident Calle Kirchen stürmen und Priester ermorden lässt, kommt es zu einem Volksaufstand. Es bildet sich eine Widerstandsbewegung, die Cristeros. Ein erbitterter Kampf um die Freiheit bricht aus.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\n\nJetzt den ganzen Spielfilm „Gottes General: Schlacht um die Freiheit“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Historienfilm #WesternFilm #ganzeFilme #FilmeKostenlos\n\nOriginaltitel: For Greater Glory: The True Story of Cristiada\nLaufzeit: 145 Minuten\nRegie: Dean Wright\nFSK: 16\nErstveröffentlichung: 2012\n\n\n*Das sind die Schauspieler*\nAndy Garcia (bekannt aus „La Linea 2“, „Der Pate 3“)\nin der Rolle des Enrique Gorostieta\nOscar Isaac (bekannt aus „Ex Machina“, „Moon Knight“)\nin der Rolle des Victoriano ‚El Catorce‘ Ramirez\nCatalina Sandino Moreno (bekannt aus „A Most Violent Year“, „Maria voll der Gnade“)\nin der Rolle der Adriana\nSantiago Cabrera (bekannt aus „Big Little Lies“, „Che: Revolucion“)\nin der Rolle des Pater Vega\n\n\n*Die Handlung und Szenen von „Gottes General: Schlacht um die Freiheit“*\nIm Jahr 1926 führt der mexikanische Präsident Plutarco Elias Calles (Rubén Blades) einen erbitterten Krieg gegen die katholischen Menschen in seinem Land. Der Glaube ist ihm ein Dorn im Auge, den er mit aller Macht bekämpft. All jene, die sich zu Gott bekennen, müssen mit harten Strafen bis hin zum Tode rechnen. Selbst die ranghöchsten Heiligen im Land sind vor den Häschern von Calles nicht sicher. Einige der gläubigen Katholiken haben jedoch beschlossen, unter der Leitung von Enrique Gorostieta (Andy Garcia) für ihren Glauben zu kämpfen und so führen sie einen bewaffneten Guerilla-Kampf gegen die Regierungstruppen. Da sich der Konflikt immer weiter zuspitzt, bahnt sich für Gorostieta und seine kleine Glaubensarmee bald eine entscheidende Schlacht an, die entweder den Sieg der Freiheit oder aber den Tod aller Beteiligten zur Folge haben wird.\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\nGanzer Film auf deutsch \n\nJetzt den Western-Historienfilm „Gottes General: Schlacht um die Freiheit“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:54.089Z",
      "thumbnail": "https://i.ytimg.com/vi/ABFoY0NwvVQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAPyg6aI--1imtOyLX2fqwa2wHyxA",
      "duration": 8694,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:33:54.518Z"
}