{
  "imdbId": "youtube-HZvCHSxiueY",
  "title": "Christmas Brings Them Together | Christmas for Three | Full 2025 Christmas Hallmark Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HZvCHSxiueY",
      "title": "Christmas Brings Them Together | Christmas for Three | Full 2025 Christmas Hallmark Movie",
      "description": "Christmas Brings Them Together | Christmas for Three | Full 2025 Christmas Hallmark Movie - When a successful bachelor suddenly finds himself as the guardian of a 10-year-old boy, the mismatched worlds of Benito Luaces and social worker, Sophie Walker, collide.\n\nWatch Christmas for Three, a full Hallmark Christmas movie where a successful bachelor suddenly becomes the guardian of a 10-year-old boy, bringing his orderly life into unexpected chaos. As his world collides with social worker Sophie Walker, sparks fly and a heartwarming holiday romance begins to take shape. Perfect for fans of Hallmark Christmas movies, cozy holiday romances, full free Hallmark Christmas films, heartwarming family stories, and festive winter love tales, Christmas for Three delivers laughter, warmth, and the true spirit of Christmas.\n\nStars: Ashley Brinkman, Mario Silva, Naomi Matsuda\n*Licensed from Legacy. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#christmasfilm #hallmarkmovie #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "HZvCHSxiueY",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "NZ",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T23:59:26.077Z"
}