{
  "imdbId": "youtube-pHY2LvTFwaA",
  "title": "I Bury the Living (Horror, 1958) Richard Boone, Theodore Bikel, Peggy Maurer | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pHY2LvTFwaA",
      "title": "I Bury the Living (Horror, 1958) Richard Boone, Theodore Bikel, Peggy Maurer | Full Movie",
      "description": "A creature to freeze your blood! A story to chill your soul!\nCemetery director Robert Kraft discovers that by arbitrarily changing the status of plots from empty to occupied on the planogram causes the death of the plots' owners.\n\nOriginal title: I Bury the Living\n\nColorized version: https://youtu.be/zcNe4Njq648\n\n\nDirector: Albert Band\nWriters: Louis Garfinkle\nStars: Richard Boone, Theodore Bikel, Peggy Maurer\nGenre:  Classics, Cult Film, Horror, Thriller\n\n\n00:00 Full Movie (with subtitles)\n01:49 Exploring a mysterious cemetery with unexpected guests leads to chilling encounters.\n05:26 A summary of a horror movie involving a family business succession and unexpected responsibilities.\n12:12 Unexpected encounters lead to romantic feelings between Annie and Bob during lunchtime.\n14:01 Strange coincidences and eerie occurrences unfold during a funeral, leading to unsettling revelations.\n20:41 A man discusses a series of mysterious deaths and tries to convince another to take responsibility.\n26:46 A mysterious series of deaths prompts suspicion and investigation among a group of individuals.\n32:18 A phone call to a cemetery leads to mysterious conversations and ominous warnings.\n38:13 Mysterious deaths occur after a meeting at a cemetery, causing suspicion and fear in the town.\n47:16 A mysterious plot unfolds as characters discuss a murder and a missing person in a secluded location.\n56:56 Investigation into mysterious deaths leads to suspicion of supernatural forces and hidden motives.\n1:12:10 Unsettling events unfold as a man grapples with his involvement in mysterious deaths and a missing coat.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "pHY2LvTFwaA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:12.314Z"
}