{
  "imdbId": "youtube-N2H6757ZV3A",
  "title": "Five Fingers (GEISELNAHME THRILLER | Unzensiert exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=N2H6757ZV3A",
      "title": "Five Fingers (GEISELNAHME THRILLER | Unzensiert exklusiv für Netzkino-Members)",
      "description": "FIVE FINGERS (2006)\nOriginaltitel: Five Fingers\nMit: Ryan Phillippe, Laurence Fishburne, Gina Torres, Touriya Haoud, Saïd Taghmaoui, Colm Meaney\nRegie: Laurence Malkin\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nMartijn, ein idealistischer Pianist aus Holland, reist nach Marokko um dort ein Essenshilfsprogramm für unterernährte Kinder ins Leben zu rufen. Kurz nach seiner Ankunft jedoch wird Martijn von einer Gruppe Terroristen verschleppt, mit einer Droge betäubt und schließlich in einer abgelegenen Lagerhalle eingesperrt. Unter Todesdrohung muss sich der junge Mann auf ein mentales Schachspiel mit dem Entführer Ahmat einlassen, mit dem Ziel seinem schrecklichen Schicksal zu entfliehen und gleichzeitig die wahren Gründe für seine Entführung zu erfahren. Das brutale Spiel zwingt Martijn alles in Frage zu stellen, was ihn hier nach Marokko gebracht hat. Es ist ein Spiel, das Martijn einen Finger nach dem anderen kostet, ein unermesslicher Preis für einen jungen Virtuosen. Was will Ahmat wirklich und an welchem Punkt lüftet Martijn alle Hintergründe zu seiner Identität um nicht die ganze Hand zu riskieren?\n#Netzkino #ganzerFilm #LaurenceFishburne\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "id": "N2H6757ZV3A",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T23:59:45.260Z"
}