{
  "imdbId": "youtube-uW3_QzhGtCM",
  "title": "KOFA코멘터리극장: 원점(1967) / KOFA Cinema with Commentary: The Starting Point(1967)",
  "year": 1967,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uW3_QzhGtCM",
      "title": "KOFA코멘터리극장: 원점(1967) / KOFA Cinema with Commentary: The Starting Point(1967)",
      "description": "2025년 첫 번째 한국고전영화 음성해설 콘텐츠 ‘KOFA코멘터리극장’은 이만희 감독 서거 50주년을 기념하여 이만희 감독의 1967년작 “원점”을 선정했습니다. 정성일 평론가는 오프닝과 엔딩에서 위에서 아래로 하강하는 액션 시퀀스를 통해 이만희 영화 미학은 부자연스러움, 어처구니없음, 부조리함을 밀어붙이는 데 있다고 설명합니다. 더불어 이만희를 국가 검열로 고뇌하는 작가주의 감독으로 고정하기보다는 백결 각색자나 서정민 촬영감독 등 마음이 맞는 영화인들과 함께 장르/오락영화를 즐겁게 작업했던 모습에 주목하자고 제안합니다. 여러분이 코멘터리를 통해 한국고전영화를 조금 더 친근하게 느끼길 바랍니다. 더 나아가 여러분의 새로운 해석과 의견도 언제나 환영합니다.\n\nThe Korean Film Archive releases the KOFA Cinema with Commentary-an audio commentary content for Korean classical films. The first film in 2025 is Lee Man-hee's 1967 film “The Starting Point” to commemorate the 50th anniversary of his death. Chung Sung-ill describes Lee man-hee’s cinematic aesthetic lies in pushing unnaturalness and absurdity through action sequences that descend from the top to the bottom of the opening and closing scenes. In addition, he suggests that we pay attention to his joyful work on genre/entertainment films with filmmakers such as Baek-gyeol(an adaptor), and Seo Jeong-min(a director of photography), rather than fixing Lee as an auteur who anguishes at censorship. I hope you will feel a little more friendly with Korean classic films through commentary. Furthermore, we always welcome your new interpretations and opinions.   \n\n영화 “원점” 본편 감상 (streaming the film, The Starting Point)\nhttps://www.youtube.com/watch?v=vwMFTLeiREA\n\n기획 및 제작 진행: 정종화(Chung Chong-hwa), 윤서연(YOON Seo-yeon)\n제작: 블루키노(Blue Kino)\n영문 자막 번역: 더블디번역",
      "id": "uW3_QzhGtCM",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:21:29.956Z"
}