{
  "imdbId": "youtube-yYVjEIY_Gq0",
  "title": "Payoff – Die Abrechnung (ACTION KOMÖDIE ganzer Film auf Deutsch, Actionfilme in voller Länge)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yYVjEIY_Gq0",
      "title": "Payoff – Die Abrechnung (ACTION KOMÖDIE ganzer Film auf Deutsch, Actionfilme in voller Länge)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Korrupt-Cop Tavares und sein unbeugsamer neuer Partner Gomez geraten in Marseille aneinander – doch als der Mafia-Buchhalter ermordet wird, müssen die beiden wider Willen zusammenarbeiten. Ihre Spur führt ausgerechnet zu dessen Tochter, bevor auch die Mafia sie in die Finger bekommt.\n\nPAYOFF – DIE ABRECHNUNG (2003)\nOriginaltitel: Gomez & Tavarès\nMit: Stomy Bugy; Titoff; Elodie Navarre\nRegie: Gilles Paquet-Brenner\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nMax Tavares ist das Gesetz. Cool, arrogant und bestechlich. Dealer, Spieler und Local Hero. Tavares ist Cop in Marseilles. Bis jetzt ging alles gut: Er kassiert, im Gegenzug haben die Gauner ein ruhiges Leben. Jetzt wird alles anders. Sein neuer Partner heißt Gomez, der Unbestechliche. Es ist Feindschaft auf den ersten Blick. Für eine Vertiefung dieser Gefühle bleibt jedoch wenig Zeit.  Das dynamische Duo wird mit einem neuen Fall beauftragt. Der „Buchhalter\" der Mafia wird erhängt gefunden. Dass es kein Selbstmord war, ist klar. Eine heiße Spur führt zu der Strip-Tänzerin Paulina, der Tochter des Toten. Gomez und Tavares müssen sie finden, bevor die Mafia es tut.\n#Netzkino #ganzerFilm #Actionfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "yYVjEIY_Gq0",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}