{
  "imdbId": "youtube-8DIX1TARaAA",
  "title": "(Melodrama) Unwed Mother 1958 | Norma Moore, Robert Vaughn | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8DIX1TARaAA",
      "id": "8DIX1TARaAA",
      "title": "(Melodrama) Unwed Mother 1958 | Norma Moore, Robert Vaughn | Full Movie",
      "description": "20,000 anguished girls wrote this devastating story!\nBetty, a young woman from a rural area, relocates to Los Angeles and becomes entangled with a deceitful man, leaving her abandoned and expecting a child. After visiting a drunken abortionist, she decides to give the baby up for adoption, but has a change of heart. \n\nOriginal title: Unwed Mother (1958)\n\nColorized version: https://youtu.be/m0PC_uHRPnU\n\nDirector: Walter Doniger\nWriters: Anson Bond, Alden Nash\nStars: Norma Moore, Robert Vaughn, Diana Darrin\nGenre: Classsics, Drama\n\n\n00:00 Full Movie (with subtitles)\n01:54 Drama unfolds as a new employee navigates office dynamics and social interactions in a new city.\n10:45 A melodramatic tale of love, loss, and new beginnings unfolds as two individuals navigate through personal challenges and relationships.\n19:19 A young woman faces financial struggles and family disapproval after loaning money to her boyfriend's family.\n27:12 A dramatic tale of love, secrets, and financial struggles unfolds, leading to a desperate act of robbery.\n34:25 A young woman faces probation and marriage after involvement in a crime, leading to unexpected outcomes.\n43:28 A young woman faces challenges as an expectant unwed mother, navigating through societal norms and ethical dilemmas.\n55:25 A young woman, Betty, faces the decision of giving up her baby for adoption amidst discussions about heredity and motherhood.\n58:47 A young woman faces challenges as an unwed mother and receives support from her friends in naming her baby.\n1:06:01 A young woman struggles with the decision of giving up her baby for adoption or keeping him, while facing societal judgment and pressure.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:47.650Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/8DIX1TARaAA/maxresdefault.webp?v=66270eae",
      "duration": 4455,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:47.766Z"
}