{
  "movieId": "youtube-whH6ZWa0Dws",
  "title": "Spinebreaker Serial Killer! Crimes of Stephen Hawke (1936, Crime) Directed by George King Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=whH6ZWa0Dws",
      "id": "whH6ZWa0Dws",
      "title": "Spinebreaker Serial Killer! Crimes of Stephen Hawke (1936, Crime) Directed by George King Colorized",
      "description": "London is besieged by the killer nicknamed \"The Spinebreaker\".  Stephen Hawke must navigate a web of deceit and danger to protect his daughter and confront a menacing police chief in a thrilling race against time. \n\nOriginal title: The Crimes of Stephen Hawke (1936)\nThis film is available with subtitles in many languages.\n\nBlack and white version: https://youtu.be/38FLz0IphE8\n\n\nDirector and Producer: George King\nWriters: Jack Celestin, Frederick Hayward, H.F. Maltby\nStarring: Tod Slaughter, Marjorie Taylor, D.J. Williams\nGenres: Colorized, Crime, Drama, Thriller\n\n\n00:00 Full Movie (with subtitles).\n04:43 A tale of murder, deception, and intrigue unfolds in a 1936 crime-thriller film featuring Tod Slaughter.\n11:14 A wealthy man, Stephen Hawke, spoils his daughter Julia and plans a lavish party with influential guests.\n15:58 Deception, manipulation, and intrigue unfold at a party as Lord Brickhaven's absence causes tension and reveals hidden motives.\n24:40 Murder mystery unfolds at a party, with accusations and suspicions surrounding a guest named Stephen Hawke.\n28:05 A father discovers a shocking secret about his friend's true nature and seeks revenge.\n35:20 Mysterious departures, hidden identities, and ominous plans unravel in a thrilling tale of love and betrayal.\n43:28 Intrigue and deception unfold as a young woman faces threats and seeks protection in a mysterious encounter.\n46:02 A mysterious man hunts down a fugitive, while a thief seeks help and a plan to escape.\n52:11 Betrayal, secrets, and forbidden love unravel in a tale of deception and heartbreak.\n1:00:13 A man named Stephen Hawke reveals his true identity as the Spinebreaker and disrupts a planned marriage.\n1:03:11 A tale of deception, betrayal, and murder unravels as secrets are revealed in a thrilling pursuit.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:53.399Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/whH6ZWa0Dws/maxresdefault.webp",
      "duration": 4154,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:53.510Z"
}