{
  "imdbId": "youtube-1b3WM7m3o1o",
  "title": "Phantom from Space 1953 | Ted Cooper, Rudolph Anders, Noreen Nash | Horror, Sci-Fi Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1b3WM7m3o1o",
      "title": "Phantom from Space 1953 | Ted Cooper, Rudolph Anders, Noreen Nash | Horror, Sci-Fi Movie",
      "description": "It came from a billion miles of space to meet the strangest destiny ever told! \nWhen an asteroid crashes, an alien being with the power of invisibility lands in Santa Monica. The government authorities search begins to track down the mysterious creatures.\n\nOriginal title: Phantom from Space (1953) \n\nColorized version: https://youtu.be/F2b9WTLZMnk\n\nDirector: W. Lee Wilder\nWriters: William Raynor, Myles Wilder\nStars: Ted Cooper, Rudolph Anders, Noreen Nash \nGenres: Cult Classic, Horror, Sci-Fi\n\nThis film is available with dubbed French audio.  👉 go to video settings ⚙️  to change your audio / subtitle language.\n\n00:00 Full Movie\n00:39 A strange event unfolds in Washington DC, involving an unidentified object.\n06:18 A police officer is called to the scene of a crime involving a girl and a body at the train station.\n11:09 A detective arrives late to a crime scene and gathers information from the team, including a suspect's name.\n16:40 A conversation about a suspicious person at the beach leads to a change of plans.\n20:36 A phone call interrupts a conversation between a lieutenant and Jim, regarding a message for the lieutenant.\n24:37 Lieutenant Wakeman investigates a murder case with Barbara Randall and encounters some resistance.\n29:11 A group of people are trying to catch someone, encouraging each other to keep going and not give up.\n35:29 A man tries to control a dog named Venus and encounters some challenges.\n41:37 The discussion revolves around the idea of existence and dependency on a certain item, with the example of a patient on a life support machine.\n45:56 The characters are trapped in a locked building, searching for a missing person.\n53:25 The video discusses the use of space suits and the effects of radiation on the human body.\n58:29 A mysterious phone call leads to suspicion and a late-night visit.\n1:03:39 A chaotic situation unfolds as a reporter and pilot are caught in the middle of a dangerous mission.\n\n@CultCinemaClassics:",
      "id": "1b3WM7m3o1o",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:39:20.621Z"
}