{
  "imdbId": "youtube-8kjgZ23hVD0",
  "title": "Die Schöne und die Bestie (FANTASY HORRORFILM auf Deutsch komplett, Liebesthriller ganzer Film)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8kjgZ23hVD0",
      "title": "Die Schöne und die Bestie (FANTASY HORRORFILM auf Deutsch komplett, Liebesthriller ganzer Film)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Die klassische Geschichte von „Die Schöne und das Biest“ neu erzählt: Belle liebt das zurückgezogen lebende Biest, doch das Dorf hält es für einen Mörder. Nur gemeinsam können sie beweisen, dass der wahre Schuldige der böse Troll einer Hexe ist.\n\nDIE SCHÖNE UND DIE BESTIE (2010)\nOriginaltitel: Beauty and the Beast\nMit: Estella Warren, Rhett Giles, Victor Parascos\nRegie: David Lister\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie unsterbliche Geschichte der Schönen und des Biests. Wie Sie sie noch nie gesehen haben! Das Biest lebt zurückgezogen im Wald, von den Menschen gefürchtet, nur von einer Frau geliebt: der schönen Belle. Doch weder in den Gefilden des Waldes noch im Dorf, können Belle und das Biest jemals glücklich sein. Denn die Dorfbewohner glauben, dass das Biest für eine Reihe brutaler Morde verantwortlich ist. Sie machen sich auf, die Bestie ein für allemal zur Strecke zu bringen. Doch das Biest ist unschuldig. Und so müssen die Schöne und das Biest beweisen, dass es in Wahrheit der schreckliche Troll der bösen Hexe ist, der für das Blutbad verantwortlich ist...\n#Netzkino #ganzerFilm #fantasyhorror\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "8kjgZ23hVD0",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.124Z"
}