{
  "movieId": "youtube-qgx3Omy0rIU",
  "title": "ATM - Tödliche Falle (THRILLER mit JOSH PECK, Slasher Horrorfilme auf Deutsch, Mystery Thriller)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qgx3Omy0rIU",
      "id": "qgx3Omy0rIU",
      "title": "ATM - Tödliche Falle (THRILLER mit JOSH PECK, Slasher Horrorfilme auf Deutsch, Mystery Thriller)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Bei einem nächtlichen Besuch an einem Geldautomaten geraten drei Mitarbeiter in einen verzweifelten Kampf um ihr Leben, als sie von einem Unbekannten in die Falle gelockt werden. Mit JOSH PECK (\"Drake & Josh\" & \"Red Dawn\") & ALICE EVE (\"Zu scharf, um wahr zu sein\")\n\nATM - TÖDLICHE FALLE (2012)\nOriginaltitel: ATM\nMit: Brian Geraghty, Josh Peck, Alice Eve\nRegie: David Brooks\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nNew York im Winter: nach einer weihnachtlichen Betriebsfeier fragt David seine hübsche Kollegin Emily ob er sie nach Hause fahren soll. Zu Davids Freude willigt Emily ein, aber auch Kollege Corey lässt sich mitnehmen. Weil Corey noch auf einen Mitternachtssnack besteht aber kein Geld dabei hat, halten sie am nächsten Supermarktparkplatz, auf dem sie eine Kabine mit Geldautomaten finden. Bevor sie die Kabine wieder verlassen, fällt ihnen ein unheimlicher Mann auf, der sich zwischen die drei und ihr Auto stellt. Kurz darauf beobachten sie, wie der Mann brutal einen Menschen tötet. Sie haben nun die Wahl: Bleiben sie in der vermeintlich sicheren, aber stark unterkühlten Kabine oder versuchen sie an dem Killer vorbeizukommen. Dieser hat aber bereits Vorkehrungen getroffen und macht ihnen das Warten auf den erlösenden Sonnenaufgang zur Qual.\n#Netzkino #ganzerFilm #joshpeck \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:49:25.785Z",
      "thumbnail": "https://i.ytimg.com/vi/qgx3Omy0rIU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCk4Pv1IJQz9eSgU62hYZPAWi8J2A",
      "duration": 5195,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}