{
  "imdbId": "youtube-rvdcJCgYPMg",
  "title": "Half Shot at Sunrise (1930 Comedy Musical) directed by Paul Sloane",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rvdcJCgYPMg",
      "title": "Half Shot at Sunrise (1930 Comedy Musical) directed by Paul Sloane",
      "description": "World's greatest comedians are in the Army now! Clowns in khaki run wild on the Boulevards... bounce laughs off the Eiffel Tower... play riot in the Grin and Garter belt at Gay Paree!\nThe stage stars Wheeler and Woolsey play two soldiers who go absent without leave in Paris, during World War I.\n\nOriginal title: Half Shot at Sunrise (1930)\nThis film is available with subtitles in many language options.\n\n\nColorized version: https://youtu.be/gJ3ZA5rWXMY\n\nDirector: Paul Sloane\nWriters: James Ashmore Creelman, Anne Caldwell, Ralph Spence\nGenres: Classic film. Comedy, Musical\nBudget: $529,000\nMain Cast: \nBert Wheeler\nRobert Woolsey\nDorothy Lee\nGeorge MacFarlane\nEdna May Oliver\nLeni Stengel\nRoberta Robinson\n\n\n00:00 Full movie (with subtitles).\n01:23 Military chaos ensues as two men go AWOL in Paris, causing diplomatic tensions and jeopardizing crucial war plans.\n09:34 Banter and humor ensue as guests at a social event discuss fashion and gender roles.\n17:19 Mischievous antics ensue as characters navigate social interactions and military encounters.\n28:23: Scheming to catch impostors, a Colonel's daughter teams up with a sergeant in a humorous pursuit.\n37:04 Two individuals encounter a woman who plans to profit from their presence in Paris.\n46:07 Unusual dining requests lead to comical exchanges between a customer and waiter.\n55:11 Flirtatious banter between Jim and Eileen as Jim prepares to deliver important papers to General Hale.\n1:02:20 A comedic conversation unfolds between two characters discussing their origins and potential heroic actions.\n1:10:17 Mission to deliver important papers to General Hail amidst danger and sacrifice.\n\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "rvdcJCgYPMg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:35:43.508Z"
}