{
  "imdbId": "youtube-XcAsn1chkm8",
  "title": "[4K] 101번째 프로포즈 (1993) / The 101st Proposition (Baeghan 101 beonjjae peulopojeu(propose))",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XcAsn1chkm8",
      "title": "[4K] 101번째 프로포즈 (1993) / The 101st Proposition (Baeghan 101 beonjjae peulopojeu(propose))",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04649\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04649\n\n감독(Director) : 오석근(Oh Seok-geun)\n출연 : 문성근 , 김희애 , 김금용 , 김승우 , 정철야\n줄거리 :   39세의 만년대리 구영섭은 백번째 맞선에서 첼리스트인 지원을 만난다. 자신에게 과분한 상대라고 여기지만 지원의 따뜻한 말을 듣고 구애작전에 들어간다. 세상을 떠난 연인에 대한 슬픔과 솔직하고 순진한 영섭사이에 갈등을 느끼던 지원은 차츰 영섭에게 애정을 느끼게 된다. 어느날 그녀가 옛연인과 너무나 닮은 영섭의 상사와 우연히 마주치자, 영섭은 지원을 잃을 것 같은 불안감에 휩싸이고,예감처럼 지원은 과거 기억의 혼돈속에서 상사에게 마음을 돌린다. 새로운 자신의 모습을 찾기 위해 사법시험에 도전하지만 실패하고 지원에게 주려던 결혼반지도 강물에 버리고 공사장에서 일하는 영섭앞에...\n\nCasts : Moon Sung-keun , Kim Hee-ae , Kim Geum-yong , Kim Seung-woo , Jeong Cheol-ya \nSYNOPSIS : This man has nothing special He is neither rich nor handsome, neither attractive nor intelligent neither smart nor kind neither healthy nor strong neither tall nor pleasant He has no hope no future In a word he is an ugly man with no future He is old enough to marry He has started to meet girls to marry. Now he is looking for a 101st girl A young beautiful bride in a wedding dress in waiting for the bridegroom in a gorgeous wedding hall, Unfortunately, the bridegroom is Killed in a traffic accident before he reaches the wedding hall. The bride has no place to go The ugly man luckily has a chance to meet her She is the 101st girl for the man The man in not a good speaker nor does he have nice manners and etiquette. The girl is in great agony Fortunately, she finds in him \"truth\" He has \"truth\" in his mind. They achieve their goal of marrying.",
      "id": "XcAsn1chkm8",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:21:32.577Z"
}