{
  "imdbId": "youtube-cGKOQRC-1Zo",
  "title": "Marianne (MGM,1929) MARION DAVIES🍕 ROMANCE MUSICAL🍕",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cGKOQRC-1Zo",
      "title": "Marianne (MGM,1929) MARION DAVIES🍕 ROMANCE MUSICAL🍕",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Marion Davies, George Baxter, Lawrence Gray\nDirector: Robert Z. Leonard\n🍕MARION DAVIES In Her First Talking Picture🍕\nSet during the final days of World War I, the silver screen star captivates as a French farm girl torn between duty and desire. She’s promised to one man fighting on the frontlines… but falls for an American doughboy at home. What’s a girl to do?\n\nDirected by Robert Z. Leonard and co-starring George Baxter and Lawrence Gray, this classic romantic musical comedy from MGM brings the spirit of World War I to life through song, laughter, and heartfelt emotion. \n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕This 1929 gem highlights Marion Davies' remarkable transition from silent films to sound, showcasing her charm, comedic timing, and musical abilities. If you love romance, musicals, comedies, and classic love stories set against the backdrop of WWI, Marianne is a must-watch!\n\nBrought to you by PizzaFLIX, your go-to channel for vintage cinema classics, rare MGM treasures, and unforgettable performances. Discover the brilliance of George Baxter, Lawrence Gray, and the visionary direction of Robert Z. Leonard in this beautifully restored piece of film history.\n\nDon’t forget to like, comment, and subscribe for more Marion Davies, Golden Age Hollywood, and classic movie magic!\n\n#MarionDavies #Marianne1929 #ClassicHollywood #PizzaFLIX #OldHollywood #RomanticMusical #WorldWarIMovie #SilentFilmStars #AllTalkingPictures #RobertZLeonard #GeorgeBaxter #LawrenceGray #MGMClassics #PizzaFLIX #LoveStory #1920sCinema #EarlyTalkies #GoldenAgeOfHollywood #ClassicRomance #MusicalComedy #WWIMovies #SilentEraStars #HollywoodHistory #RetroCinema #BlackAndWhiteMovies #ClassicMovieLovers #ClassicFilmRestoration #FrenchLoveStory #HollywoodIcons #OldMoviesOnYouTube",
      "id": "cGKOQRC-1Zo",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:04:21.235Z"
}