{
  "movieId": "youtube-RTfa6jG3XPM",
  "title": "Something to Sing About (Musical, 1937) James Cagney, Evelyn Daw | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RTfa6jG3XPM",
      "id": "RTfa6jG3XPM",
      "title": "Something to Sing About (Musical, 1937) James Cagney, Evelyn Daw | Movie",
      "description": "Dancing...Romancing and Packing a Real Wallop!\nA New York bandleader journeys to Hollywood when he is offered a contract with a studio, but he is determined to do things his way and not theirs.\n\nOriginal title: Something to Sing About (1937) AKA: Hollywood Hollywood\n\nColorized version https://youtu.be/3dI_cWxSDus\n\n\nThis film is available with subtitles in many languages.\nDirector: Victor Schertzinger\nWriters: Victor Schertzinger, Austin Parker\nStars: James Cagney, Evelyn Daw, William Frawley\nGenres: Classics, Comedy, Musical\n\n\n00:00 Full Movie (with subtitles)\n01:57 A glimpse into the Hollywood scene in the 1930s through a farewell party for Terry Rooney.\n11:54 Struggles of a hoofer turned actor in Hollywood under the guidance of a demanding director.\n17:41 Glimpse into the Hollywood film industry in 1937, showcasing the dynamics between actors, directors, and studio executives.\n23:17 A glimpse into the drama and action behind the scenes of a Hollywood film in 1937.\n32:47 A chaotic search for a missing star leads to unexpected revelations and a dramatic turn of events in Hollywood.\n42:00 Celebrity chaos ensues as Terry Rooney's unexpected fame leads to a whirlwind of events in San Francisco and Hollywood.\n49:48 A Hollywood actor faces a dilemma when his contract forbids marriage, prompting a creative solution.\n53:08 Gossip and romance unfold on a Hollywood set, leading to unexpected love interests and behind-the-scenes drama.\n1:01:01 Drama unfolds as a Hollywood actor refuses to attend an opening night, causing tension with his manager.\n1:03:23 Drama unfolds as Rita returns from a trip, leading to misunderstandings and plans for a vacation in Hollywood.\n1:12:20 Drama unfolds as a Hollywood actor's secret marriage is revealed, causing chaos on set.\n1:20:42 Famous singer Mrs. Terry Rooney faces a last-minute performance opportunity at Palomino Roof amidst chaos and drama.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:22.667Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/RTfa6jG3XPM/maxresdefault.webp?v=65e6a3b6",
      "duration": 5231,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:22.803Z"
}