{
  "imdbId": "youtube-2blVjZvq0Vc",
  "title": "A Trip to Mars / Himmelskibet (1918) by Holger-Madsen | Adventure, Sci-Fi | Silent Film",
  "year": 1918,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2blVjZvq0Vc",
      "id": "2blVjZvq0Vc",
      "title": "A Trip to Mars / Himmelskibet (1918) by Holger-Madsen | Adventure, Sci-Fi | Silent Film",
      "description": "A group of researchers from Earth travel in a spaceship to Mars, where, to big surprise, they find a peaceful vegetarian and pacifist civilization.\n\nThe navy captain Avanti Planetaros is inspired by his astronomer-father to travel through outer space to reach other worlds. He becomes an aviator and, along with the young scientist Dr. Krafft, the driving force behind the construction of a space-ship. Despite oppostion from the mocking Professor Dubius, Planetaros gathers a crew of fearless men and takes off. During the long voyage, the crew becomes restless; a mutiny is narrowly avoided. Finally, they reach Mars and discover that the planet is inhabited by people who have reached a higher stage of development, free of diseases, sorrow, violence, sexual urges, and the fear of death. Avanti falls in love with Marya, daughter of the Prince of Wisdom, the head of the Martians. Marya shares his feelings and decides to return with him in order to bring the wisdom of the Martians to the backward Earthlings.\n\nColorized version https://youtu.be/zYP_tMZoqyk\n\nOriginal title: Himmelskibet AKA: A Trip to Mars \nThis film is available with subtitles in many language options.\n\nDirector: Holger-Madsen\nWriters: Sophus Michaëlis, Ole Olsen\nStars: Gunnar Tolnæs, Zanny Petersen, Nicolai Neiiendam\nGenres: Adventure, Fantasy, Sci-Fi, Silent\n\n\n00:00 Full Movie (with subtitles)\n00:10 Scientific expedition to Mars, building a spaceship with advanced energy source for a speedy journey.\n13:36 Dramatic events unfold during an expedition to Mars, with tensions rising among the crew members.\n27:28 Exploration of Mars leads to atonement and peace after a potential conflict.\n44:38 A journey to Mars leads to new experiences, love, and a profound understanding of life and death.\n1:04:49 A journey to a distant planet leads to revelations about love, unity, and the power of faith.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:14.235Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/2blVjZvq0Vc/maxresdefault.webp?v=65f268ff",
      "duration": 4815,
      "language": "en",
      "year": 1918,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:14.371Z"
}