{
  "movieId": "youtube-_r00hqf5YoA",
  "title": "Agatha Christie | And Then There Were None (1945) [Crime] [Mystery]",
  "year": 1945,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_r00hqf5YoA",
      "id": "_r00hqf5YoA",
      "title": "Agatha Christie | And Then There Were None (1945) [Crime] [Mystery]",
      "description": "\"And Then There Were None\" is a 1945 film adaption of Agatha Christie's best-selling mystery novel \"And Then There Were None\" directed by René Clair. The film changes certain characters' names and adheres to the ending of the play rather than that of the novel. Though its subject matter is dark, the screenplay injects considerable humor into the proceedings, lightening the tone of Christie's grim book. It was directed by René Clair from a screenplay by Dudley Nichols. Its cast featured Barry Fitzgerald, Walter Huston, Louis Hayward, Roland Young, June Duprez, Mischa Auer, C. Aubrey Smith, Judith Anderson, Richard Haydn and Queenie Leonard as the people stranded on the island. The film could arguably be seen as a precursor to the modern slasher film, though it certainly isn't gory, and the deaths are not played up for their horror, as they are in slasher films today.\n\nThe film won the Golden Leopard at the Locarno International Film Festival.\n\n---\n\nDirected by René Clair, produced by René Clair and Harry M. Popkin, written by Dudley Nichols and Agatha Christie (novel), starring Barry Fitzgerald as Judge Francis J. Quinncannon, Walter Huston as Dr. Edward G. Armstrong, Louis Hayward as Philip Lombard / Charles Morley, June Duprez as Vera Claythorne, Roland Young as Detective William Henry Blore, Mischa Auer as Prince Nikita \"Nikki\" Starloff, C. Aubrey Smith as General Sir John Mandrake, Judith Anderson as Emily Brent, Richard Haydn as Thomas Rogers and Queenie Leonard as Ethel Rogers. \n\n---\n\nSource: \"And Then There Were None (1945 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 2 May 2013. Web. 05 May 2013. http://en.wikipedia.org/wiki/And_Then_There_Were_None_(1945_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:24.768Z",
      "thumbnail": "https://i.ytimg.com/vi/_r00hqf5YoA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCRTU_o8OV6JBS0Q3cH7PqEwrmdmw",
      "duration": 5835,
      "language": "en",
      "year": 1945,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T22:41:24.768Z"
}