{
  "movieId": "youtube-im4LdCbhG4E",
  "title": "너 또한 별이 되어 (1975) / You Become a Star, Too (Neo ttohan byeol-i doe-eo)",
  "year": 1975,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=im4LdCbhG4E",
      "id": "im4LdCbhG4E",
      "title": "너 또한 별이 되어 (1975) / You Become a Star, Too (Neo ttohan byeol-i doe-eo)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요. \nFor detailed information on this film, visit : \n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02907\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02907\n\n감독(Director) : 이장호(Jeong In-yeob)\n출연 : 윤유선 , 신성일 , 우연정 , 이영호 , 이영옥\n줄거리 : 단란한 가정을 이루고 살던 상규는 복권에 당첨되어 아내 신옥, 딸 윤정이와 함께 교외의 어느 저택으로 삶의 보금자리를 마련한다. 그 집에 온 후 기이한 일들이 벌어지면서 윤정은 환각에 시달리는 정신병 환자가 되고, 상규는 미우라는 묘령의 여자를 만난다. 그녀는 인기가수가 된 철호와 어린시절 사랑에 빠졌으나 그의 배신으로 힘들어하고있다고 말한다. 상규는 자신도 모르게 그녀에게 빠져들게 되고, 윤정의 병은 깊어만 간다. 정신과 전문의인 한박사는 윤정이 죽은 여자에게 빙의되어 있고, 상규에게 미우가 그 죽은 여자일 거라 말한다. 상규는 마지막으로 미우와의 영혼의 하룻밤을 보낸 후 시체가 된 그녀를 보고 충격을 받아 기절하고, 영국의 심령학자와 사지꼬의 도움으로 윤정은 의식을 차린다. 뭇 남성들에게 상처받아 스스로 목숨을 끊고 한 맺혀 윤정에게 빙의되어 있던 미우는 영혼의 세계로 나비가 되어 떠난다.\n\nCasts: Yun Yu-sun , Shin Seong-il , Woo Yeon-jeong , Lee Yeong-ho , Lee Young-ok\nSYNOPSIS : A butterfly flies from the mountain to the city. Sang-Kyu, who works in a company, buys a house in the suburbs and lives with his wife and daughter, Yun-Jeong. But Yun-Jeong becomes a somnambulist because of the illusion of a butterfly flying to the house. Sang-Kyu happens to know Mi-Wu, a singer, who loves Song Cheol-Ho but wanders in her life after his death. On the other hand, Yun-Jeong regains her consciousness with the help of an English psychicist and a nun. After Sang-Kyu has a sex with Mi-Wu, he falls out of the window and loses his consciousness. As she feels affection for Sang-Kyu, Mi-Wu becomes a butterfly in the soul world and leaves him.",
      "addedAt": "2025-12-26T00:21:50.396Z",
      "thumbnail": "https://i.ytimg.com/vi/im4LdCbhG4E/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLADlPNIu6I2nuIn9HexCaq4qvgHOw",
      "duration": 6144,
      "language": "ko",
      "year": 1975,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:50.483Z"
}