{
  "imdbId": "youtube-7nq8FoMEON8",
  "title": "명동잔혹사(1972) / Cruel History of Myeong Dong(Myeongdongjanhogsa) (1972)",
  "year": 1972,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7nq8FoMEON8",
      "title": "명동잔혹사(1972) / Cruel History of Myeong Dong(Myeongdongjanhogsa) (1972)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02524\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/002524\n\n영화글 : https://www.kmdb.or.kr/story/74/1643\n\n감독(Director) : 변장호(Byun Jang-ho) , 최인현(Choe In-hyeon), 임권택(Im Kwon-taek)\n출연 : 허장강(Heo Chang-kang), 박노식(Park Nou-sik), 황해(Hwang Hae), 김지수(Kim Ji-su), 송재호(Song Jae-ho)\n\n제1화(시끄러울 것잉께): 감옥에서 나온 박민은 옛 명동을 찾기위해 황두식이 지배하는 술집으로 찾아간다. 옛애인 우희로인해 죽음의 위기에 처하지만 극적으로 탈출해, 황두식을 죽인다. 하지만 우희는 자신을 대신해 죽고, 자신이 살려준 꼬마에게 박민 역시 목숨을 잃는다.\n제2화(갖고 싶은 여자): 현은 숙과 결혼해 암흑가를 떠나려 하지만 보스의 배신으로 감옥에 갇힌다. 3년만에 탈옥해 보스에게 복수하지만, 숙은 이미 다른 남자의 아내였다. 절망한 그는 남편이 된 영배를 찾아가 결투를 청한다. 그때 숙이 두 남자 사이 뛰어들어 자결하고 두 남자 역시 싸움 끝에 죽고만다.\n제3화(대결): 제대한 상은 보스 장의 딸 희와 함께 조직생활을 청산하고 새 삶을 살려고 한다. 하지만 명동을 장악하려는 황의 음모로 장과 희는 희생당하고 분노한 상은 복수를 결심한다. 마침내 황을 죽인 후 상은 속죄하기 위해 경찰서로 향한다.\n\n1st episode(It must be noisy)....Park Min decides to regain Myeong Dong. After released from prison, he goes to a bar to fight with Hwang Du-Shik who controls that bar. He is almost to die due to his girl friend Wu-Hee, but escapes and kills Hwang. Finally Wu-Hee dies, too and he is also killed by a boy who once he saved his life.\n2nd episode(The woman who I really want)...Hyeon wants to leave gangster world by marrying to Suk. Instead he is in jail because of boss's betrayal. After released, he goes to Young-Bae who married Suk while he is in prison. He finds that Young-Bae really loves Suk, so he leaves alone. \n3rd episode(Confront)... Sang is searching for his father Young-Pyo who abandoned his mother. He is helped by Hee, Young-Pyo's daughter when he is injured by attack. After that he fights with Young-Pyo again......",
      "id": "7nq8FoMEON8",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:38.848Z"
}