{
  "movieId": "youtube-g-5gljkxcqE",
  "title": "A Sensitive, Passionate Man (1977, Drama) David Janssen, Angie Dickinson | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g-5gljkxcqE",
      "id": "g-5gljkxcqE",
      "title": "A Sensitive, Passionate Man (1977, Drama) David Janssen, Angie Dickinson | Full Movie",
      "description": "The marriage of a wealthy, outwardly happy couple is threatened by the husband's alcoholism.\n\nOriginal title: A Sensitive, Passionate Man (1977)\n\nDirector: John Newland\nWriters: Rita Lakin, Barbara Mahoney\nStars: Angie Dickinson, David Janssen, Mariclare Costello. \nGenres: Classics, Drama\n\n\n00:00 Full Movie (with subtitles).\n00:18 Exploration of love, relationships, and surprises during a special anniversary celebration.\n08:21 A family's evening unfolds with emotional conversations, work secrets, and bedtime routines.\n20:35 A man struggles with honesty and betrayal in his personal and professional life, leading to unexpected consequences.\n28:38 A man struggles with job loss and financial strain, leading to tension in his marriage and a lack of communication.\n36:17 A man struggles with alcoholism and career issues, leading to a health emergency and family concern.\n45:22 A man struggles with personal demons while navigating family dynamics and a career in the aerospace industry.\n52:48 A family faces turmoil as legal separation is pursued due to alcoholism, financial issues, and parental neglect.\n1:00:45 Family struggles with a troubled father, financial issues, and threats, while a woman seeks help from a friend.\n1:08:51 A family struggles with alcoholism, reconciliation, and financial issues during the New Year celebration.\n1:18:39 A family struggles with a man's alcoholism and mental health issues, leading to a decision for institutionalization.\n1:29:48 A heart-wrenching story of love, loss, and regret as a man faces his final days in the hospital.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYDDUshEcMs1CHZW1booguo",
      "addedAt": "2025-12-27T00:35:57.133Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/g-5gljkxcqE/maxresdefault.webp?v=667a6dae",
      "duration": 5896,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:57.230Z"
}