{
  "movieId": "youtube-0tDnW5Xhg44",
  "title": "Battle In Outer Space (1959 Sci-Fi) Space Wages War on Earth! Directed by Ishiro Honda",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0tDnW5Xhg44",
      "id": "0tDnW5Xhg44",
      "title": "Battle In Outer Space (1959 Sci-Fi) Space Wages War on Earth! Directed by Ishiro Honda",
      "description": "The Moon is Captured! The Earth is Next...The Biggest Battle Ever Put on Film!\nAliens invade Earth with the full force of their spaceships and weapons. Everyone turns to the most powerful nations on Earth to destroy them, resulting in the most fierce battle the galaxy as ever seen.\n\nOriginal title: 宇宙大戦争  (Uchû Daisensô)\nAlternative titles:  Battle In Outer Space / The Great Space War\n\nDirector: Ishirô Honda\nWriters: Shin'ichi Sekizawa, Jôjirô Okami\nWith : Ryô Ikebe, Kyôko Anzai, Minoru Takada, Koreya Senda\nGenres: Japanese Cinema, Action, Science-Fiction, Space Opera\n\n\n00:00 Full movie (with subtitles)\n05:01 Dr. Adachi explains the mysterious disasters caused by freezing rays.\n13:26 The SPIP spacecrafts are introduced as Earth's defense against Natal.\n20:13 Dr. Adachi and Dr. Richardson prepare for the Moon mission.\n36:28 The SPIP crew encounters alien missiles and engages in battle.\n44:16 The team discovers a hidden tunnel leading to the alien base.\n55:03 Iwamura sacrifices himself to protect the team from alien control.\n1:02:45 The crew successfully infiltrates the alien base on the Moon.\n1:10:12 A massive space battle erupts between Earth's forces and Natal's fleet.\n1:17:30 Earth's final assault destroys the alien mothership and remaining forces.\n1:23:15 Humanity celebrates victory and the world is declared safe.\n1:29:00 Dr. Adachi reflects on the importance of unity in the face of adversity.\n\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:33:43.470Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/0tDnW5Xhg44/maxresdefault.webp?v=67c6a740",
      "duration": 5410,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:33:43.593Z"
}