{
  "movieId": "youtube-xQLXbpwckko",
  "title": "This Is Not a Test (1962, Sci-Fi) Seamon Glass, Thayer Roberts | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xQLXbpwckko",
      "id": "xQLXbpwckko",
      "title": "This Is Not a Test (1962, Sci-Fi) Seamon Glass, Thayer Roberts | Full Movie",
      "description": "When the world falls apart, survival becomes the ultimate test!\nA deputy sheriff stops motorists on a mountain road after police dispatch reports of a possible nuclear attack.\n\nColorized version: https://youtu.be/wOBT7wr-Ky4\n\n\nOriginal title: This Is Not a Test (1962)\nThis film is subtitled in many languages\n\nDirector: Fredric Gadette\nWriters: Peter Abenheim, Betty Laskey, Fredric Gadette\nStars: Seamon Glass, Thayer Roberts, Aubrey Martin\nGenres: Classics, Drama, Sci-Fi\n\n\n00:00 Full Movie (with subtitles)\n00:56 Emergency situation arises during a test, leading to unexpected events and a sense of urgency.\n08:36 Unexpected encounter with police officer leads to mysterious explanations in the early morning.\n12:53 Clint Delany, a fearful man, is suspected of multiple murders after killing a young girl. His actions reveal a dark motive.\n16:49 Emergency situation requires swift action to control chaos and maintain order.\n20:33 A group faces a sudden crisis and must seek shelter in a truck to survive.\n25:36 Urgent situation arises as a boy with a knife is encountered, leading to a potential nuclear war threat.\n31:30 Unexpected discoveries lead to a fun adventure with food and drinks in a truck.\n37:46 A family discusses potential danger in the city while dealing with personal issues.\n45:12 Importance of finding a missing person emphasized during a search operation.\n56:54 Uncovering a deserted mining area leads to unexpected discoveries and memories from childhood.\n1:05:23 Unrest in the city as police are missing and chaos ensues, leading to a mysterious group encountering a burning warehouse.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:17.381Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/xQLXbpwckko/maxresdefault.webp?v=65e95651",
      "duration": 4326,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:17.483Z"
}