{
  "imdbId": "youtube-NR156RV81jg",
  "title": "Rough Riders Western | The Gunman from Bodie (1941) by Spencer Gordon Bennet | Colorized Movie",
  "year": 1941,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NR156RV81jg",
      "id": "NR156RV81jg",
      "title": "Rough Riders Western | The Gunman from Bodie (1941) by Spencer Gordon Bennet | Colorized Movie",
      "description": "A mysterious stranger who arrives in the town of Bodie, seeking vengeance for a past injustice. \nAs tensions rise and secrets are revealed, the stranger becomes embroiled in a web of betrayal and deceit, leading to a thrilling showdown that will determine the town's fate. \n\nOriginal title: The Gunman from Bodie (1941) AKA: Bad Man from Brodie\n\nBlack & White version: https://youtu.be/oqcAabjVCpE\n\n\nDirector: Spencer Gordon Bennet\nWriter: Adele Buffington\nStars: Buck Jones, Tim McCoy, Raymond Hatton\nGenres: Classics, Crime, Western, Drama\n\n\n00:00 Full Movie (with subtitles)\n05:51 A ranch is sold to a new owner, offering a high-paying job to a skilled foreman. Joe is hired as the foreman, despite another candidate being considered.\n10:05 Cowboy encounters trouble when a stranger brings news of a child in need, leading to suspicion and conflict.\n19:19 Law enforcement officer investigates a man's identity in a Western town, seeking help and encountering a cute child.\n20:32 Law enforcement officers investigate a murder, receive a message from a wanted man's mother, and discuss a reward for apprehending him.\n26:09 Conflict arises when Marshall confronts Cook about a murder, leading to a showdown with the Sheriff.\n32:08 Law enforcement investigates a murder case involving Bill Cook and Pete Gibbs, leading to suspicions and confrontations.\n37:53 Unexpected alliances form in a small town as tensions rise over land disputes and a fugitive on the run.\n43:28 Unexpected events unfold in Borden as Joe suspects Bodie Bronson's involvement in a mysterious incident.\n49:31 Law enforcement officer deals with gang violence and plans to confront a notorious criminal in the Wild West.\n54:26 Undercover operation to catch Wyatt and his hired guns at a cattle ranch leads to a tense standoff.\n1:00:03 Encounter between Thong Che Roberts and an acquaintance leads to reminiscing about past experiences and plans for the future.\n\n\n@CultCinemaClassics \n\nMore Rough Riders films: https://www.youtube.com/playlist?list=PL2gsu7VGzgdZlCUb5l-GWHJjH0dYFEH56\n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:46.268Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/NR156RV81jg/maxresdefault.webp",
      "duration": 3778,
      "language": "en",
      "year": 1941,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:46.454Z"
}