{
  "movieId": "youtube-tKWL7HXWh38",
  "title": "Rough Riders Western | Dawn on the Great Divide (1942) directed by Howard Bretherton",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tKWL7HXWh38",
      "id": "tKWL7HXWh38",
      "title": "Rough Riders Western | Dawn on the Great Divide (1942) directed by Howard Bretherton",
      "description": "Buck & The Rough Riders protect a wagon train and supplies for the railroad against a power hungry businessman who dresses his army of henchmen as Native American Indians.\n\nOriginal title: Dawn on the Great Divide (1942)\n\nBlack & White version: https://youtu.be/a6aZZBbtgA4\n\n\nDirector: Howard Bretherton\nWriters: Adele Buffington, James Oliver Curwood\nStars: Buck Jones, Mona Barrie, Raymond Hatton \nGenres: Classics, Adventure, Drama, Romance, Western, Colorized\n\nNOTE: the final film of Buck Jones and the final film of Monogram Pictures Rough Riders film series: https://www.youtube.com/playlist?list=PL2gsu7VGzgdZlCUb5l-GWHJjH0dYFEH56\n\n\n00:00 Full movie (with subtitles).\n01:46 Warning of impending danger to a wagon train carrying ammunition and supplies for the railroad.\n08:28 Cowboys prepare to stop at camp, discussing fights & responsibilities on the trail.\n16:13 Encounter with Trapper leads to unexpected outfit change and discussion on supplies and Indian threat.\n22:52 Tensions rise as characters discuss taking care of a young boy found with a mysterious item, leading to confrontations and revelations.\n33:18 Violent encounter leads to mistaken identity and tragic consequences.\n41:03 Troubles arise with the corps, suspicions of betrayal, and plans to intercept railroad supplies in a Western setting.\n47:30 Conflict arises over a secret marriage and a child, leading to threats and ultimatums in a Western setting.\n54:28 A beautiful dream is shared, plans are discussed, and a fine mess is acknowledged.\n1:01:16 Betrayal plans unfold during a high-stakes card game, leading to a deadly raid at dawn.\n\n\n@CultCinemaClassics \n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:53.524Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/tKWL7HXWh38/maxresdefault.webp",
      "duration": 4170,
      "language": "en",
      "year": 1942,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:53.708Z"
}