{
  "imdbId": "youtube-mY0t_DEN3UQ",
  "title": "A Prince Who Refused the Crown | Royal Runaways | Full 2025 Christmas Hallmark Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mY0t_DEN3UQ",
      "title": "A Prince Who Refused the Crown | Royal Runaways | Full 2025 Christmas Hallmark Movie",
      "description": "A Prince Who Refused the Crown | Royal Runaways | Full Christmas Hallmark Movie - A prince doesn't want to become King after his father dies, so he hides at a winery as a handyman to follow his own path.\n\nWatch Royal Runaways, a full Hallmark Christmas movie where a prince, unwilling to take the throne after his father’s death, escapes to a winery and works as a humble handyman to follow his own path. Amid the vineyards and holiday cheer, he discovers love, freedom, and the true meaning of happiness. Perfect for fans of Hallmark Christmas movies, romantic holiday films, full free Hallmark Christmas movies, cozy festive romances, and heartwarming winter love stories, Royal Runaways delivers charm, magic, and a royal holiday romance everyone will enjoy.\n\nStars: Ashley Brinkman, Eliza Roberts, Mario Silva\n*Licensed from Legacy. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#christmasfilm #christmasmovie #hallmarkmovies #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "mY0t_DEN3UQ",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "NZ",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T23:59:22.621Z"
}