{
  "movieId": "youtube-53LJ95U6THs",
  "title": "All the Kind Strangers 1974 (Horror, Thriller film) There's Nothing More Dangerous Than a Kind Face.",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=53LJ95U6THs",
      "id": "53LJ95U6THs",
      "title": "All the Kind Strangers 1974 (Horror, Thriller film) There's Nothing More Dangerous Than a Kind Face.",
      "description": "A man traveling through a backwoods area is held hostage by a group of orphans who want him to become their father. Unfortunately, the kids have a habit of killing adults who refuse that particular honor.\n\nOriginal title: All the Kind Strangers (1974)\nAlternative titles: Evil in the Swamp, 狼童, All die netten Fremden, Tüm Tür Yabancılar, Les Inconnus du désert, Toda clase de extraños\n \nDirector: Burt Kennedy\nWriter: Clyde Ware\nStars: Stacy Keach, Samantha Eggar, John Savage, Robby Benson, Arlene Farber\nGenres: Cult, Horror, Thriller, TV movie\n\n\n00:00 - Full Movie (with subtitles)\n01:14 - A man gives a young boy a ride, sparking an unexpected adventure through the countryside.\n08:04 - Meeting a rural family, the man is invited to join them for supper, creating a warm atmosphere.\n16:32 - Tension rises as a farm family welcomes a stranger, revealing dark secrets and hidden tensions.\n21:34 - Mysterious happenings unfold when a stranger encounters a family harboring deep secrets in a remote farmhouse.\n28:08 - An isolated family faces a chilling threat after a car goes missing, heightening their fears.\n36:41 - Children sabotage a man's car, leading to a critical vote on whether he and his wife should stay as parents.\n44:35 - A family finds themselves captive to a manipulative stranger who enforces his own rules.\n52:50 - Divided by tension, family members must decide whether to keep or let go of a stranger attempting to escape.\n1:03:48 - A family is torn apart by a manipulative intruder, culminating in a tense standoff involving a gun.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:50.291Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/53LJ95U6THs/maxresdefault.webp?v=66ef2f0c",
      "duration": 4454,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:50.399Z"
}