{
  "imdbId": "youtube-UHXv0xyNXxw",
  "title": "사의 찬미(1991) / Death song(Sa-ui chanmi) (1991)",
  "year": 1991,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UHXv0xyNXxw",
      "title": "사의 찬미(1991) / Death song(Sa-ui chanmi) (1991)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04484\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04484\n\n감독(Director) : 김호선(Kim Ho-sun)\n출연 : 장미희, 임성민, 이경영, 김혜리, 김성수 \n\n줄거리 : 1919년 우리나라 최초의 관비 유학생으로 일본에 건너간 윤심덕은 동경음악대학에 적을 두고 야망에 불태운다. 선천적으로 타고난 자유분방함과 넘치는 매력으로, 그녀 주위에는 항상 연모의 눈길을 보내는 남학생들이 있다. 그러던 중 윤심덕은 유학생들이 결성한 극예술협회의 중심인물인 김우진과 만난다. 와세다대학에서 연극을 공부하던 그는 고향에 아내와 딸을 둔 유부남이었다. 불같은 성격으로 거침없는 윤심덕과 나약하고 섬세한 김우진은 걷잡을 수 없는 사랑에 빠져들고, 홍난파는 윤심덕을 사랑하지만 깊은 우정으로 두 사람을 대한다. 성악가에서 대중가수로 전락하면서도 김우진을 보살피는 윤심덕, 절망한 김우진은 다시 일본으로 도피한다. 처음 만난 곳에서 재회한 둘은 서로의 사랑을 확인하고, 현해탄 선상에서 동반자살한다.\nCast : Chang Mi-hee, Yim Sung-min, Lee Geung-young, Kim Hye-ri, Kim Seong-su \n\nSYNOPSIS (CONTAINS SPOILERS) : A melodrama dealing with the life of Yoon Shim-dok, a modern woman and pioneer of free love in the 1920's, who drowns herself in the waters of the Korea Strait. Yoon Shim-dok is a poor girl studying vocal music at Tokyo University with the aid of a government scholarship. Hong Nan-pam a promising student majoring in composition, takes her to concerts and the theatre. However, he feels mistreated by her as he is unable to get the closeness he desires. Though she sees him as a close friend, she is totally devoted to Art. Korean students studying in Japan plan a performance tour to Korea during their summer vacation to raise funds for Korea's Independence Movement. Among them is Kim Woo-jin, a student of English Literature at Waseda University. Hong Nan-pa introduces Kim to Yoon Shim-dok. They are fated to know each other.",
      "id": "UHXv0xyNXxw",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:28.092Z"
}