{
  "imdbId": "youtube-FSYbXOKRLP0",
  "title": "Paradox - Kill Zone Bangkok - Martial Arts, Action - Ganzen Film kostenlos schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FSYbXOKRLP0",
      "title": "Paradox - Kill Zone Bangkok - Martial Arts, Action - Ganzen Film kostenlos schauen bei Moviedome",
      "description": "►Vom Regisseur von „Ip Man 1-4“! Ganzer Film in voller Länge!\n\nDen Action-Film „Paradox - Kill Zone Bangkok“ jetzt kostenlos und in ganzer Länge bei #Moviedome sehen.\n\n►Die Handlung:\nAls der Polizist Lee Chung-chi (Louis Koo) erfährt, dass seine 16-jährige Tochter verschwunden ist, zögert er nicht lange und reist von Hongkong nach Thailand, wo sie das letzte Mal gesehen wurde. Unterstützung erhält er dabei von Chui Kit (Wu Yue) und Tak (Tony Jaa), die dort für die lokale Polizei arbeiten.\nLee vermutet dabei nicht nur, dass das Verschwinden seiner Tochter mit dem Bürgermeister Bangkoks, welcher eine Herztransplantation benötigt, zusammenhängt, sondern auch,  dass der Assistent des Bürgermeisterkandidaten Cheng Hon-sau mit Sacha zusammengearbeitet hat, um seine Tochter zu entführen.\n\n\nAbonniere Moviedome kostenlos für mehr #ganzeFilme ► http://bit.ly/MoviedomeAbo\n\nJetzt den #MartialArts Film „Paradox - Kill Zone Bangkok“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #kostenlos #movie #film #spielfilm #HD #action #thriller #Paradox #KillZoneBangkok #IPMan #TonyJaa \n\nEnglischer Originaltitel: Paradox\nFilmlänge: 99 Minuten\nRegie: Wilson Yip\nErstveröffentlichung: 2018\n\n\nDie Darsteller\nLouis Koo (bekannt aus „Protégé“) als Lee Chung Chi\nYue Wu (bekannt aus „Ip Man 4: The Finale“) als Chui Kit\nKa-Tung Lam (bekannt aus „Ip Man“, „Internal Affairs - Die achte Hölle“) als Cheng Hon Shou\nTony Jaa (bekannt aus „Ong-Bak, „Revenge of the Warrior“) als Tak\n\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch\n \nJetzt den Martial-Arts-Actionfilm „Paradox - Kill Zone Bangkok“ in voller Länge auf deutsch ansehen.",
      "id": "FSYbXOKRLP0",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:34:17.034Z"
}