{
  "imdbId": "youtube-6X0SIqNPjPE",
  "title": "Night of the Blood Beast (Horror, 1958) Angela Greene, Michael Emmet | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6X0SIqNPjPE",
      "title": "Night of the Blood Beast (Horror, 1958) Angela Greene, Michael Emmet | Full Movie",
      "description": "They took a man to space, but brought back an alien.\nA team of scientists is stalked by an alien creature which implants its embryos in an astronaut's body during a space flight. After consuming the brain of one of the research scientists, the creature has absorbed his knowledge, and gains the ability to communicate using his voice. The team must now work to contain the threat before it's too late.\n\nColorized version: https://youtu.be/g-QDDlA30yQ\n\n\nOriginal title: Night of the Blood Beast (1958) AKA: The Creature from Galaxy 27\nThis film is subtitles in many languages.\n\nDirector: Bernard L. Kowalski\nWriters: Gene Corman, Martin Varno \nProducer: Roger Corman\nStars: Michael Emmet, Angela Greene, John Baer, Ed Nelson \nGenres: Cult classic, Horror, Sci-Fi, B-movie\n\n\n00:00 Full Movie (with subtitles)\n01:33 Communication issues arise during a space mission, leading to a mysterious death and investigation.\n11:01 Mysterious creature attacks scientists in a remote lab, causing chaos and confusion.\n17:54 Strange events unfold at a remote location, leading to mysterious blood anomalies and electromagnetic interference.\n23:26 Mysterious events unfold as Dr. Wyman's fate is questioned, revealing a shocking discovery.\n32:01 Discovery of alien creature prompts debate on how to handle it, leading to conflict and uncertainty.\n43:23 Intense discussion about the creature's intentions and the importance of giving it a chance to communicate.\n48:18 Survivors plan to confront a mysterious creature using Molotov cocktails as a last resort.\n51:13 A creature takes control of a group, leading to communication through Dr. Wyman's voice and discussions on immortality.\n57:53 A decision must be made to prevent the destruction of humanity by a powerful alien entity.\n\n\n@CultCinemaClassics \nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYLD4ZQC1D1o3WC_ePvnOng",
      "id": "6X0SIqNPjPE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:45.240Z"
}