{
  "imdbId": "youtube-D3cVEb4rPkQ",
  "title": "Marilyn Monroe | Home Town Story (1951) Drama | Colorized Movie",
  "year": 1951,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=D3cVEb4rPkQ",
      "title": "Marilyn Monroe | Home Town Story (1951) Drama | Colorized Movie",
      "description": "IT COULD HAPPEN ANYWHERE!\nBlake Washburn blames manufacturer MacFarland for his defeat in the race for re-election to the state legislature. He takes over his uncle’s newspaper to take on big business as an enemy of the people. Miss Martin works in the “Herald” newspaper office. When tragedy strikes, Blake must re-examine his views.\n\nOriginal title: Home Town Story (1951) AKA: The Headline Story\nThis movie is subtitled in many language\n\nBlack & White version: https://youtu.be/nMT_Kuwt_EE\n\nDirector & Write: Arthur Pierson\nStars: Jeffrey Lynn, Donald Crisp, Marjorie Reynolds, Alan Hale Jr. & Marilyn Monroe\nGenres: Colorized, Comedy, Drama, Romance\nThis film is available with subtitles in many language options.\n\n00:00 Full Movie (with subtitles)\n02:28 Blake returns home after losing the election and is greeted by friends and family.\n09:49 Janice and Blake discuss their marriage and future plans while Blake faces career challenges.\n15:22 Marilyn Monroe as Iris\n18:11 Blake Washburn plans to expose pollution in the McFarland factory and start a crusade in his newspaper.\n22:34 Blake is running a newspaper and conducting a crusade to increase circulation and profits.\n32:14 A newspaper editor and a businessman discuss the importance of profits for the customer.\n38:12 The video discusses the concept of profit and its importance in business.\n52:01 A little girl's life is saved thanks to the quick actions of Dr. Lee and the help of John McFarland.\n\n\n@CultCinemaClassics",
      "id": "D3cVEb4rPkQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:28.902Z"
}