{
  "imdbId": "youtube-6y1zhIYAmvo",
  "title": "Navy Blues (MGM, 1929) WILLIAM HAINES🍕 ANITA PAGE🍕 ROMANTIC COMEDY",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6y1zhIYAmvo",
      "title": "Navy Blues (MGM, 1929) WILLIAM HAINES🍕 ANITA PAGE🍕 ROMANTIC COMEDY",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: William Haines, Anita Page, Karl Dane\nDirector: Clarence Brown\nSet sail for laughter and romance with a rare early talkie from MGM starring lovebirds William Haines and Anita Page! Directed by acclaimed filmmaker Clarence Brown, this pre-Code romantic comedy blends sharp wit, sailor shenanigans, and old-Hollywood charm. Haines, known for his silent film success, shines in his first sound film, bringing charisma and comic timing as Jack Kelly, a navy bad-boy with a big heart. So successful was Haines' transition to sound that in 1930, one year after Navy Blues was released, he reigned as Hollywood's #1 male box-office star.\n\nAnita Page, his co-star from Speedway, delivers a touching performance as the woman determined to tame this rogue sailor. Featuring Karl Dane and packed with 1920s nostalgia, Navy Blues showcases the Golden Age of Hollywood, with classic naval themes, heartwarming romance, and the signature William Haines’ charm.  A must-watch for fans of classic movies, silent-to-sound transitions, vintage naval comedies, and early MGM film history.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Stream now on PizzaFLIX—your home for rare and restored classic films. Don’t forget to like, comment, and subscribe for more vintage gems starring legends like William Haines, Anita Page, and Clarence Brown.\n\n#WilliamHaines #AnitaPage #ClarenceBrown #NavyBlues1929 #ClassicComedy #MGM #PizzaFLIX #OldHollywood #VintageRomance #SailorComedy",
      "id": "6y1zhIYAmvo",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:04:15.811Z"
}