{
  "imdbId": "youtube-YI2KIQbewkY",
  "title": "Tentacles 1977 | (Action, Thriller) John Huston, Shelley Winters, Henry Fonda | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YI2KIQbewkY",
      "title": "Tentacles 1977 | (Action, Thriller) John Huston, Shelley Winters, Henry Fonda | Movie",
      "description": "Deadlier than the teeth of the tiger shark!\nA mutated giant octopus wreaks havoc on a California seaside community.\n\nOriginal title: Tentacoli (1977) \n\nThis film is available with subtitles in many language options.\n\nDirector: Ovidio G. Assonitis\nWriters: Jerome Max, Tito Carpi, Steven W. Carabatsos\nStars: John Huston, Shelley Winters, Bo Hopkins, Henry Fonda\nGenres: Action, Adventure, Comedy, Horror, Sci-Fi, Thriller\nBudget: $5,000,000 (estimated)\n\n\n0:00 Full Movie\n07:16 Mysterious events unfold as characters discuss a tragic accident and underwater experiments.\n12:29 A journalist investigates a strange death and encounters a team of divers. Tension rises as they prepare for a dangerous dive.\n19:10 Mysterious events unfold at a coastal town, involving a university professor, a businessman, and a sailing race.\n28:45 Mystery surrounds a series of events involving a diving accident, a missing child, and unusual radio communications.\n35:01 Thrilling events unfold as suspicions arise about responsibility for underwater deaths, leading to a tense confrontation.\n46:20 During a boat race, all the boats are sabotaged by a giant octopus and risky experiments.\n1:01:41 Mysterious events unfold as characters face unexpected challenges and communication barriers with sea creatures.\n1:16:07 Thrilling encounter with dangerous creatures leads to a plea for help and a desperate escape.\n\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "YI2KIQbewkY",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:07.735Z"
}