{
  "imdbId": "youtube-G9bA6f-NpDU",
  "title": "Love in misery (1941) BANNED in the UK! Walter Greenwood's World Sensation - now in 4K color",
  "year": 1941,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G9bA6f-NpDU",
      "title": "Love in misery (1941) BANNED in the UK! Walter Greenwood's World Sensation - now in 4K color",
      "description": "It is 1930, at the height of the Great Depression. The Hardcastle family live in Hankey Park. Mr Hardcastle is a coalminer; his son, Harry, is an apprentice at a local engineering firm and Sally, his daughter, works at a cotton mill.\n\nMr Hardcastle's mine is put on a three-day week.\n\nHarry wins £22 on his winning thruppence treble bet. Bookmaker Sam Grundy pays up without any trouble. At his father's suggestion, he takes his girlfriend Helen to the seaside resort of Blackpool on a holiday.\n\nHarry becomes unemployed when his apprenticeship ends. The family’s plight is made worse by reductions in means tested unemployment benefits (the dole), whilst Helen's unexpected pregnancy causes further tensions.\n\nSally is courted by factory worker and Labour Party activist Larry Meath but their marriage plans are put in doubt when Larry loses his job. Larry is fatally injured when he tries to restore calm in a clash with the police during an unemployment march. Sally reluctantly becomes Grundy's mistress to help keep her unemployed family.\n\nOriginal title: Love on the Dole (1941)\nDirected by John Baxter\nBased on the novel by Walter Greenwood\n\nMain cast:\nDeborah Kerr - Sally Hardcastle\nClifford Evans - Larry Meath\nGeorge Carney - Mr. Hardcastle\nMary Merrall - Mrs. Hardcastle\nGeoffrey Hibbert - Harry Hardcastle\nJoyce Howard - Helen Hawkins\nFrank Cellier - Sam Grundy\nMartin Walker - Ned Narkey\nMaire O'Neill - Mrs. Dorbell\nIris Vandeleur - Mrs. Nattle\nMarie Ault - Mrs. Jike\nMarjorie Rhodes - Mrs. Bull\nTerry Conlin - Ted Munter (uncredited)\nJordan Lawrence - Sam Hardie (uncredited)\nMuriel George - Landlady (uncredited)\nBen Williams - Factory Worker (uncredited)\nKenneth Griffith - Harry's Pal in Billiard Hall (uncredited)\nJohn Slater - Agitator on Demonstration (uncredited)\n\nFilm History 101: This film is a landmark in British cinema for the unflinching, realistic portrayal of working-class poverty and social unrest during the Great Depression,  and was initially banned from production by the British Board of Film Censors (BBFC) in 1936. Called it \"a very sordid story in very sordid surroundings\" and considered it \"dangerous.\" The film was only approved and released 5 years later in 1941, after social attitudes had shifted during World War II. Additionally, it was banned in Australia by the Chief Commonwealth Film Censor, with no official reason given for the ban.",
      "id": "G9bA6f-NpDU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:30:39.043Z"
}