{
  "movieId": "youtube-N6RH1rEcrQg",
  "title": "Ticket (Tiket)(1986)",
  "year": 1986,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=N6RH1rEcrQg",
      "id": "N6RH1rEcrQg",
      "title": "Ticket (Tiket)(1986)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03971\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03971\n\n영화글 : https://www.kmdb.or.kr/story/149/4305\n\n감독(Director) : 임권택(Im Kwon-Taek)\n출연 : 김지미(지숙),안소영(미스양),명희(미스조),이혜영(A)(미스홍),전세영(미스윤),박근형(김동민),최동준(민수),윤양하(박선장),장혁,김인문(한의사),이석구,김기주,이예민,주상호,김운하,오희찬,박종설,김애라,이인옥,이도련,홍성연,김정석,홍원선,손전,이백,오세장,채령(특별출연)\n\n줄거리 : 강원도 속초에서 티켓 다방을 운영하는 민지숙(김지미)은 직업소개소에서 미스 양(안소영), 미스 홍(이혜영), 세영(전세영)을 데리고 온다. 닳을 대로 닳은 미스 양과 미스 홍은 손님들을 유혹하는 데 익숙하지만, 대학생 민수(최동준)를 애인으로 둔 세영은 손님들의 성매매 요구를 거절한다. 민수가 학비와 경제적 어려움을 토로하자 세영은 그에게 돈을 마련해주겠다고 안심시킨다. 세영 때문에 손님이 줄자 민 마담은 세영을 호되게 야단친다. 세영은 박 선장(윤양하)과 점점 가까워지고 그에게 몸도 허락한다. 그리고 민수를 위해 박 선장에게 취직자리를 부탁한다. 배를 타기 위해 속초에 내려온 민수는 세영이 실제로 살아가는 모습을 보게 되고, 배를 타지 않고 떠났다가 다시 속초로 돌아온 민수는 세영의 도덕성을 심하게 비난한 후 결별을 선언한다. 십수 년 전, 투옥된 남편의 뒷바라지를 하다 생계가 어려워져 술집으로 굴러들어 오게 되고 그 후 도덕적 부끄러움 때문에 스스로 남편을 떠났던 민 마담은 세영이 자신과 같은 처지가 될 것을 걱정해 민수를 만나 세영을 버리지 말라고 부탁한다. 그러나 민수가 그녀의 부탁을 거절하자 지숙은 민수를 바다에 밀어버리고, 정신이상자가 되어 정신병원에 수감된다.\n\nCasts : Kim Jee-Mi, Jeon Se-Young, Lee Hye-Young, Park Keun-Hyeong, Ahn So-Young, Myeong Hee\n\nSYNOPSIS : In a city in Kangwon province, Ji-suk manages a bar with Miss Yang, Miss Hong, and Se-young. Miss Yang and Miss Hong get used to the customers hitting on them but Se-young rejects all advances and works to earn money for her college boyfriend. As the days pass by, the number of customers decreases due to Se-young so Ji-suk scolds her. Captain Pak comforts the disheartened Se-young but when her boyfriend Min-su finds out about this, he breaks it off with Se-young. Ji-suk tries to win Min-su over but he refuses her. Ji-suk runs into the arms of Dong-min. In between love and despair, Ji-suk pushes Min-su into the ocean and suffers a mental breakdown. In the aftermath, each of the other women leaves to start a new life.",
      "addedAt": "2025-12-26T00:24:33.827Z",
      "thumbnail": "https://i.ytimg.com/vi/N6RH1rEcrQg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBoQD7PPqHIQvqLSX1fWNQ0XljTow",
      "duration": 6477,
      "language": "ko",
      "year": 1986,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:33.878Z"
}