{
  "imdbId": "youtube-MTkOud2MBso",
  "title": "The Phantom Planet (Sci-Fi, 1961) Dean Fredericks, Coleen Gray | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MTkOud2MBso",
      "title": "The Phantom Planet (Sci-Fi, 1961) Dean Fredericks, Coleen Gray | Movie",
      "description": "Captives of a power far, far out!\nAstronauts (Dean Fredericks, Anthony Dexter) land on an asteroid and shrink to the size of its dwellers, who are under attack.\n\nColorized version: https://youtu.be/JvudhelWYXQ\n\n\nAvailable with English, French, Italian, & Spanish audio options. And subtitled in many more languages.\n\nOriginal title: The Phantom Planet (1961) \nDirector: William Marshall\nWriters: William Telaak, Fred De Gorter\nStars: Dean Fredericks, Coleen Gray, Anthony Dexter \nGenres: Action, Adventure, Sci-Fi\n\n\n00:00 Full Movie (with subtitles).\n00:20 Encounters on a mysterious planet lead to disappearances and unexplained phenomena in outer space.\n07:22 Interstellar mission encounters mysterious planet, leading to unexpected events and decisions.\n11:55 Astronauts from Pegasus IV encounter a series of challenges on a distant planet.\n27:53 Unexpectedly accused of causing injury on an alien planet, the Earth captain is brought to trial and found guilty, only to be released and offered a new perspective on his situation.\n32:49 The future of Frank Chapman on Rayton, a planet with primitive technology, where he must adapt and make a crucial decision.\n37:23 A stranded spaceship, mysterious disappearance, and a rescue mission unfold in the sci-fi film.\n43:33 Discussion about controlling gravity, high atomic density, potential threat from enemies, and a challenge for a brave duel.\n49:35 Intense physical duel between Rayton and Chapman leads to a plan to escape the planet.\n57:15 Astronauts face a threat from Solarites, who control gravity and pose a danger to Earth. They must fight back or risk destruction.\n1:08:51 A space mission encounters a mysterious planet, leading to unexpected events and emotional farewells.\n1:16:17 A sci-fi adventure unfolds as a group of people navigate through a mysterious planet and encounter unexpected challenges.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "MTkOud2MBso",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:44.585Z"
}