{
  "movieId": "youtube-psU0YDidS6o",
  "title": "Sherlock Holmes | Dressed to Kill (1946) [Thriller]",
  "year": 1946,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=psU0YDidS6o",
      "id": "psU0YDidS6o",
      "title": "Sherlock Holmes | Dressed to Kill (1946) [Thriller]",
      "description": "Dressed to Kill (also known as Prelude to Murder or Sherlock Holmes and the Secret Code in the UK), is the last of fourteen films starring Basil Rathbone as Sherlock Holmes and Nigel Bruce as Doctor Watson. Though not directly based on any of Sir Arthur Conan Doyle's Holmes stories, the film features several references to \"A Scandal in Bohemia\", with Holmes and Watson discussing the recent publication of the story in The Strand Magazine, and the villain of the film using the same trick on Watson that Holmes uses on Irene Adler in the story. The plot also bears some resemblance to \"The Adventure of the Six Napoleons\".\n\nThree cheap musical boxes (each one playing a subtly different version of \"The Swagman\"), manufactured in Dartmoor Prison, are sold at a local auction house. However, a criminal gang is determined to steal and recover all three, even if it means committing murder. Sherlock Holmes tries to recover the music boxes and crack the secret code contained in the tune before the gang can get what they want.\n\n---\n\nDirected and produced by Roy William Neill, written by Sir Arthur Conan Doyle (story), Frank Gruber and Leonard Lee, starring Basil Rathbone, Nigel Bruce and Patricia Morison, music by Jack Brooks.\n\n---\n\nSource: \"Dressed to Kill (1946 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 June 2012. Web. 1 July 2012. http://en.wikipedia.org/wiki/Dressed_to_Kill_(1946_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:42:14.477Z",
      "thumbnail": "https://i.ytimg.com/vi/psU0YDidS6o/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBgCW_nc0dK8XqdFOwXXMTU-mlRmQ",
      "duration": 4291,
      "language": "en",
      "year": 1946,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "sherlock-holmes",
      "name": "Sherlock Holmes"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T22:42:14.477Z"
}