{
  "movieId": "youtube-6EO1r0pLWXc",
  "title": "Tage der Freiheit - Schlacht um Mexiko - Historienfilm - Ganzen Film kostenlos schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6EO1r0pLWXc",
      "id": "6EO1r0pLWXc",
      "title": "Tage der Freiheit - Schlacht um Mexiko - Historienfilm - Ganzen Film kostenlos schauen bei Moviedome",
      "description": "*GANZER FILM - HISTORIENFILM*\nDen *mexikanischen Historienfilm* „Tage der Freiheit: Schlacht um Mexiko“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Tage der Freiheit: Schlacht um Mexiko“:\nIMDb: *6,1* von 10\nAmazon: *3,2* von 5\n\n*Die Handlung von „Tage der Freiheit: Schlacht um Mexiko“*\nDer fünfte Mai 1862 - an diesem Tag wird der Lauf der Weltgeschichte verändert. Die französische Armee unter Napoleon III., zu der Zeit die größte Streitmacht der Welt, will mit einem kurzen, überwältigenden Angriff Mexiko besetzen und danach an der Seite der Südstaaten gegen Abraham Lincoln kämpfen.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\n\nJetzt den ganzen Spielfilm „Tage der Freiheit: Schlacht um Mexiko“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Historienfilm #Actionfilm #Schlachtenfilm #ganzeFilme #FilmeKostenlos\n\nOriginaltitel: Cinco de Mayo: La batalla\nLaufzeit: 125 Minuten\nRegie: Rafa Lara\nFSK: 16\nErstveröffentlichung: 2013\n\n\n*Das sind die Schauspieler*\nChristian Vazquez (bekannt aus „Elysium“, „I Carry You with Me“)\nin der Rolle des Juan Osorno\nAngelica Aragon (bekannt aus „Dem Himmel so nah“)\nin der Rolle der Dona Soledad\nLiz Gallardo (bekannt aus „El bufalo de la noche“, „Mancora“)\nin der Rolle der Citlali\n\n\n*Die Handlung und Szenen von „Tage der Freiheit: Schlacht um Mexiko“*\nUnter der Führung von General Ignacio Zaragoza (Kuno Becker) stellt sich eine mexikanische Armee am 5. Mai 1862 gegen die Invasoren der französischen Expeditionsarmee. Es kommt zur historischen Schlacht bei Puebla, einer besonders wichtigen Auseinandersetzung im Verlaufe der Französischen Intervention in Mexiko. Lediglich 4000 Soldaten stehen den Mexikanern zur Verfügung, um gegen die deutlich überlegenen Franzosen anzutreten. Diese verfügen außerdem nur über wenig Erfahrung und haben keine militärische Ausbildung erhalten. Die meisten von ihnen sind lediglich Guerilla-Kämpfer und schlecht bewaffnet. Doch General Zaragoza ist fest entschlossen, aus dem lose zusammengewürfelten Haufen eine schlagfeste Truppe zu machen, die ihre Heimat beschützen und die Franzosen aus ihrem Land vertreiben kann.\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Tage der Freiheit: Schlacht um Mexiko“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:52.839Z",
      "thumbnail": "https://i.ytimg.com/vi/6EO1r0pLWXc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBJMFVrNDXX0Y-T2MNmiG7UkZbvMA",
      "duration": 7579,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:33:53.084Z"
}