{
  "imdbId": "youtube-PbRYKuwiuUg",
  "title": "The Ginko Bed(Eunhaengnamu chimdae)(1995)",
  "year": 1995,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PbRYKuwiuUg",
      "title": "The Ginko Bed(Eunhaengnamu chimdae)(1995)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04818\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04818\n\n감독(Director) : 강제규(Kang Je-Kyu, Park Cheol-Min)\n출연 : 한석규(수현),심혜진(선영),진희경(미단),신현준(황장군),김학철(병원장),김명국(진명),류순철(노공노악사),지춘성(노공제자),최학락(영철동생),홍성덕(영철),유연수(영철형),이일수(수철),김희철(동료강사),박종문(돌아이),배장수(협회간부),이범수(후배),송미남(노파),최영래(트럭운전사),김미리(다림),이왕구(의사들),이광호(의사들),황창선(의사들),김지원(의사들),박영숙(영안실여자),이현정(간호사),김혜연(골목길여자),장수정(리포터),최일순(체험자들),유혜선(체험자들),장도순(체험자들),이지형(체험자들),김인섭(체험자들),조한희(체험자들),김선경(체험자들),최우진(기자들),서우식(기자들),김소정(기자들),백성일(기자들),이기호(기자들),송재범(C.T기사),박광춘(C.T기사),남혁우(어린종문),김다영(어린미단),민충원(왕),신소미(왕비),구경은(궁녀),이호진(가야금대역)\n\n줄거리 : 석판화가이자 대학 강사인 수현과 외과의사인 선영은 서로 사랑하는 사이다. 그의 일상은 안정돼 보이고 평범했지만 우연히 노천시장에서 은행나무 침대를 만나면서 혼란에 빠져든다. 그에게는 자신도알지 못한 전생의 사랑이 존재한 것이다. 궁주악사와 공주와의 이룰수 없었던 사랑이 평화로운 들판의 두 그루 은행나무가 되고, 또다시 은행나무 침대의 영혼이 되면서 천년의 시간속에 그를 찾아헤맨 영혼의 사랑이 모습을 드러낸 것이다. 그는 전새의 미단공주의 기억을 찾아헤매고 과거로부터 미단을 쫓는 무섭도록 집요한 사랑의 화신 황장군의 위협을 받게 된다. 현세의 연인 선영은 과학으로 설명할 수 없는 그들의 존재를 증명하기 위해 실험을 강행하고 이제 더 이상 현생으로 되돌아올 수없는 미단은 황장군으로부터 수현을 구하기 위해 마지막 선택을 한다.\n\nCasts : Han Seok-Kyu, Shim Hye-Jin, Jin Hee-Kyeong, Shin Hyeon-Jun\n\nSYNOPSIS : Soohyun is an artist who teaches at a college. His girlfriend Sunyoung is a surgeon. A strange and mesmerizing reincarn ated love story begins when Soohyun buys and old gingko bed at a market. In his earlier life Soohyun was a musician for the royal family one thousand years ago. He and Princess Midan Were deep ly in love. However, General Hwang, who was also in love with the princess, kills Soohyun. And Midan's spirit hides insi de the gingko bed. Midan appears in front of Soohyun after one thousand years but the spirit of General Hwang, still in love with Midan, does not allow them to meet. Soohyun's present girlfriend, Sunyoung, decides to prove the existence of the spirits by risking her own life. Midan makes her last choice in order to save Sunyoung from General Hwang.",
      "id": "PbRYKuwiuUg",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:23:39.927Z"
}