{
  "imdbId": "youtube-hzLtdV5FLfU",
  "title": "Die Wall Street Verschwörung - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hzLtdV5FLfU",
      "title": "Die Wall Street Verschwörung - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Wirtschafts-Thriller \"Die Wall Street Verschwörung“ in ganzer Länge bei #Moviedome sehen.\n\nIn naher Zukunft sieht sich die USA mit einer massiven Wirtschaftskrise konfrontiert: Der ehemalige Broker Guy Clifton wird von der Regierung angeworben, um einen drohenden Cyber-Angriff zu verhindern – eine Attacke, welche, von einer geheimnisvollen Terrorzelle ausgehend, die gesamte Weltwirtschaft lahmlegen könnte. Dabei scheinen die Terroristen stets einen Schritt voraus zu sein. Doch während Guy und sein Team versuchen, die einzelnen Puzzleteile zusammenzusetzen, wird ihnen immer klarer, dass sie einer Verschwörung auf der Spur sind, deren Wurzeln bis in allerhöchste Regierungskreise zu reichen scheinen.\n\nEin mit Oscar®-Nominee Minnie Driver und John Leguizamo hochwertig besetzter Wirtschafts-Thriller, der durch Aktualität besticht und dabei ein furchteinflössendes Bild einer ungezügelten Weltwirtschaft zeichnet.\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo \n\nJetzt “Die Wall Street Verschwörung” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama\n \nFilmlänge: 84 Minuten \nOriginaltitel: Jekyll Island\nRegie: Aram Rappaport\nFSK: 12\nDVD-Start (DE): 2018\n\nDie Darsteller\nFrank Grillo in der Rolle des Guy Clifton\nMinnie Driver in der Rolle der Shannon Clifton\nAnna Sophia Robb  in der Rolle der Creason Clifton\nChristopher MacDonald in der Rolle des Del Banco\nJohn Leguizamo in der Rolle des George Diebold\nMaggie Q in der Rolle der Schwester Hilary\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nDen Thriller \"Die Wall Street Verschwörung“ in voller Länge auf deutsch ansehen.",
      "id": "hzLtdV5FLfU",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:03.653Z"
}