{
  "imdbId": "youtube-unimG4UjB2Y",
  "title": "(Bela Lugosi) Glen or Glenda (Drama, 1953) directed by Edward D. Wood Jr. | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=unimG4UjB2Y",
      "title": "(Bela Lugosi) Glen or Glenda (Drama, 1953) directed by Edward D. Wood Jr. | Full Movie",
      "description": "World Shocked by Gender - A psychiatrist tells the stories of a transvestite (Glen or Glenda) and a pseudohermaphrodite (Alan or Anne).\n\nOriginal tilte: Glen or Glenda (1953) AKA: He or She / The Transvestite / I Changed My Sex/ I Led 2 Lives\n\nBlack & White version: https://youtu.be/jgvEvgYXa4o\n\n\nMany subtitle languages available for this movie\nDirector & Writer: Edward D. Wood Jr.\nStars: Edward D. Wood Jr, .Bela Lugosi, Lyle Talbot & Dolores Fuller\nGenre: Colorized classics, Comedy, Drama\n\n00:00 Full Movie (with subtitles)\n02:00 Exploration of identity and societal norms through a man's struggles with cross-dressing and self-acceptance.\n09:48 Exploration of gender transition and societal norms through storytelling and acceptance.\n16:00 Exploration of modern gender norms and fashion choices, highlighting differences between men and women.\n18:48 Exploration of gender identity and societal acceptance through the story of Glen and Glenda.\n23:18 A drama film exploring the complexities of gender identity and relationships before a wedding.\n28:57 A man struggles with his desire to transition while being engaged to a woman he loves.\n32:09 A man reveals his dual identity to his wife, leading to a decision about their marriage.\n50:24 Exploration of gender identity through two advanced cases: Glen's self-discovery and Alan's desire to be a girl.\n58:28 Alan undergoes a gender transition process with medical interventions and surgeries.\n1:01:37 A story of gender transformation and acceptance, highlighting the journey of Alan becoming Anne.\n1:04:51 Exploration of gender identity, love, and acceptance in a dramatic film.\n\n@CultCinemaClassics",
      "id": "unimG4UjB2Y",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:39:25.937Z"
}