{
  "imdbId": "youtube-OrwvMM3QhB4",
  "title": "True Blood 1989 | Action Movie | Jeff Fahey, Chad Lowe, Sherilyn Fenn, Billy Drago | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OrwvMM3QhB4",
      "title": "True Blood 1989 | Action Movie | Jeff Fahey, Chad Lowe, Sherilyn Fenn, Billy Drago | Full Movie",
      "description": "On the streets blood is thicker than evil.\nStreet gang member, Ray Trueblood, is framed by an enemy in a rival gang, Billy \"Spider\" Masters. Ray is accused of killing a cop and he has to escape leaving behind his little brother, Donny. Ten years later Ray returns to his neighborhood to take his brother with him, but things are worse than he could expect: his brother, now 18 years old, hates him and is a member of Billy Masters' gang. Furthermore, Billy Masters is looking for revenge and... the police are still after Ray for the murder of the police officer.\n\nOriginal title: True Blood (1989)  AKA: Edge of Darkness\n\nDirector & Writer: Frank Kerr\nCast: Jeff Fahey, Chad Lowe, Sherilyn Fenn & Billy Drago\nGenres: Action, Drama\n\n\n0:00 A man named Trueblood and his brother Donny plan to go to Wyoming, but get involved in a violent confrontation with Billy Masters and his gang.\n28:09 Ray Trueblood returns and confronts his former boss, Mr. Santos, to find his brother who is now part of Santos' family.\n40:27 Two brothers reunite after ten years and face a difficult conversation.\n51:12 A man named Frank Santos is questioned about a kid named Donny Trueblood and his brother who is accused of killing a police officer.\n1:02:42 Two brothers discuss their plans to leave their current situation and start a new life in Wyoming, but their conversation takes a dark turn when they talk about their deceased mother and the dangers they face in their current city.\n1:10:50 Jennifer confronts Frank and offers to talk to him after her dance class.\n1:15:51 A detective and his brother seek revenge on the man who killed their partner.\n1:33:48 A man is forced to leave town and embarks on a journey to Denver.\n\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "OrwvMM3QhB4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:28.432Z"
}