{
  "imdbId": "youtube-YKrYZUryPgU",
  "title": "A. J. Cronin's Working-Class Heroes | The Stars Look Down (1940) | Colorized | Full Movie",
  "year": 1940,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YKrYZUryPgU",
      "title": "A. J. Cronin's Working-Class Heroes | The Stars Look Down (1940) | Colorized | Full Movie",
      "description": "A Gripping Tale of Injustice and Resilience\nA coal miner's son named Davey Fenwick (Sir Michael Redgrave), dreams of escaping the working-class life in a mining town. However, his ambitions are challenged as he witnesses the struggles, hardships, and injustices faced by the miners and their families in the face of exploitative mining owners.\n\nOriginal title: The Stars Look Down\n\nOriginal Black & White version: https://youtu.be/o-3xd1pAwCw\n\nDirector: Carol Reed\nWriters: A.J. Cronin, J.B. Williams, A. Coppel\nStars: Michael Redgrave, Margaret Lockwood, Edward Rigby\nGenre: Colorized classics, Drama\n\n\n00:00 Full Movie\n02:43 Struggles of working-class heroes in a mining town, facing union disputes and family tensions.\n11:25 Working-class struggles, ambition, and conflict unfold in a colorized movie set in a mining town.\n17:37 Struggles and aspirations of working-class characters in a 1940 colorized movie based on A. J. Cronin's novel.\n24:35 Encounter at a Restaurant: Joe and Davey meet at a restaurant and discuss business and personal matters, with a hint of romantic interest.\n29:25 Drama unfolds as characters navigate relationships, politics, and ambitions in a small town setting.\n35:29 Betrayal, heartbreak, and sacrifice unfold as Jenny struggles with her feelings for Joe and David while facing societal expectations.\n41:55 Romantic drama unfolds in a working-class setting, featuring discussions on education, coal mining, and a young woman's loneliness.\n48:48 Struggles of working-class heroes in a 1940 colorized movie. A son's aspirations, family conflicts, and societal pressures unfold.\n56:05 Drama unfolds as characters discuss career setbacks, teaching opportunities, and family dynamics.\n1:01:00 Struggles of working-class heroes in a coal mining community, involving union conflicts, personal ambitions, and political maneuvering.\n1:07:01 Betrayal, conflict, and danger unfold as personal vendettas impact a mining community.\n1:16:04 Struggles and triumphs of working-class heroes in a dramatic film.\n1:29:49 Struggles of working-class heroes in a dramatic film set in a mining town, involving health issues, family dynamics, and a tragic event.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "id": "YKrYZUryPgU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:39:41.255Z"
}