{
  "imdbId": "youtube-o6Jy7Kipzto",
  "title": "[4K] 순교자 (1965) / The Martyred (Sungyoja)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=o6Jy7Kipzto",
      "id": "o6Jy7Kipzto",
      "title": "[4K] 순교자 (1965) / The Martyred (Sungyoja)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01170\n\n영화글  \nhttps://www.kmdb.or.kr/story/937/8813\nhttps://www.kmdb.or.kr/story/10/1008\n\n감독(Director) : 유현목 (Yu Hyun-mok)\n출연 : 김진규 , 남궁원 , 장동휘 , 박암 , 윤일봉\n\n줄거리 :  6ㆍ25 당시 국군은 평양을 함락하고 계속 북으로 진격하고 있다. 평양 군국정보부의 이대위(남궁원)는 장대령(장동휘)의 지시에 따라 인민군들에게 피살당한 열명의 목사들을 위한 위령제를 준비한다. 그러기 위해 구사일생으로 살아남은 신 목사(김진규)를 찾아가 피살 당시의 참상을 알아보려고 한다. 그러나 신 목사는 좀처럼 입을 열지 않는다. 신도들은 그런 신 목사를 배신자로 생각하여 유다로 몰아붙이고 규탄 시위를 벌인다. 이러한 혐의는 신 목사 자신의 고백으로 더욱 굳어진다. 그러나 국군에게 잡힌 인민군 정 소좌는 당시 자신이 사살한 열명의 목사들은 죽음 앞에서 목숨을 구걸한 위선적인 목사였고 오직 신 목사만이 대단한 신앙의 소유자라서 죽이지 않았노라고 고백한다. 자신은 신의 존재를 인정하지 않아도, 신이 없으면 약해질 수밖에 없는 교인들을 위해서 신의 존재를 설파하는 신 목사는, 중공군들의 침략으로 월남하자는 이 대위의 권고를 물리치고 북한에 남아있는 신도들을 돌본다.\n\nCasts : Kim Jin-kyu,  Nam Koong Won, Jang Dong-hee, Park Am, Yoon Il-bong\n\nSYNOPSIS : During the Korean War (1950-1953), twelve church ministers have been abducted and killed in the occupied territory. But two ministers survive and return to their place, while becoming to doubt the existence of God. The story is composed of various incidents that happen while hiding the truth about those dying ministers. In the course of investigation, the intelligence officer comes to realization of what is real martyrdom and what is the true value of the age.",
      "addedAt": "2025-12-26T00:21:21.046Z",
      "thumbnail": "https://i.ytimg.com/vi/o6Jy7Kipzto/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC2s3IiellxgTufWKefdvG3Uzeumw",
      "duration": 7956,
      "language": "ko",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:21.090Z"
}