{
  "imdbId": "youtube-b6LQttB3zOo",
  "title": "FELLINI SAYS... a documentary by Bruno Mattei (Italian audio)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b6LQttB3zOo",
      "id": "b6LQttB3zOo",
      "title": "FELLINI SAYS... a documentary by Bruno Mattei (Italian audio)",
      "description": "Explore Fellini's artistic world as a limitless workshop packed with unique characters, creating an engaging and intriguing space within the film universe. \"Fellini Dice\" aims to incorporate previously unreleased material into the episodes, offered in a triptych, to provide both entertainment and a fresh angle for critically analyzing Fellini's cinematic legacy, and homage to this great master of the cinema.\n\nOriginal Title: Fellini Dice... AKA: Fellini Says (2004)\n\nDirector: Bruno Mattei \nProducers: Faso Film, La Perla Nera \nCast: \nAnouk Aimée\nArmando Brancia\nMarcello Mastroianni \n\nPhotography: Nicola Pecorini \nMusic: Ludovico Einaudi \nEditing: Bruno Mattei, Elio Lamari, Daniele Campelli \nGenre: Documentary \nYear: 2004 \nCountry: Italy\n\n\n00:00 Full Documentary\n01:45 Insight into Federico Fellini's journey as a screenwriter, actor, and director, and the challenges faced during film screenings.\n11:00 Insights into the making of La Dolce Vita and the collaboration with Federico Fellini.\n19:18 Marcello Mastroianni recalls his experiences working with Federico Fellini in La Dolce Vita and The Nights of Cabiria.\n26:22  Insight into the creative process and inspiration behind a character named 'The Sack Man' in Rome.\n33:30 Insights on working with Federico Fellini and his unique approach to filmmaking.\n42:08 Insight into Fellini's casting process and the unique characters he creates through collaboration with actors.\n52:47  Insight into Fellini's filmmaking process and collaboration with actors, reflecting on the impact of television on storytelling.\n56:21 Exploration of Donald Sutherland's unique experience working with Fellini on the film Casanova.\n1:02:47 Exploration of the making of a film based on Casanova, with challenges and controversies faced by the director.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdZ6EP499IAECCqonINmQ2QR",
      "addedAt": "2025-12-27T00:36:00.512Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/b6LQttB3zOo/maxresdefault.webp?v=66c68ba7",
      "duration": 4569,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:00.616Z"
}