{
  "imdbId": "youtube-lRLrehsvo6I",
  "title": "Blazing Sun (Ttaengbyeot)(1984)",
  "year": 1984,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lRLrehsvo6I",
      "title": "Blazing Sun (Ttaengbyeot)(1984)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03824\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03824\n\n영화글 : https://www.kmdb.or.kr/story/10/5240\n\n감독(Director) : 하명중(Hah Myung-Joong)\n출연 : 하명중(춘호),조용원(순이),이혜영(A)(향심),박종설(판출),최주봉(몽태),김종구(장씨),주상호(이주사),이인옥(강릉댁),조학자(제천댁),최일(마을장정),박광진(마을장정),유일문(마을장정),김경란(마을아낙),김애라(마을아낙),양춘(마을아낙),최준(의사),제갈숙(간호원),유명순(어부아낙),원유제(아역),양일민(어부),박병기(어부),주일몽(어부),김유행(어부),이석구(어부)\n\n줄거리 : 1930년대, 일제 강점기의 한국. 춘호와 그의 아내 순이는 살곳을 찾아 전국을 찾아 헤맨다. 번번이 실패만하는 춘호는 순이와 함께 탄광촌을 자리 잡지만 순이를 상습적으로 윽박지르고 폭행한다. 그러던 중 서울에서 일본인과 큰일을 하는 삼촌을 소개시켜준다는 술집여자 향심의 말에 넘어간 춘호는 순이에게 뒷돈을 구해오라며 윽박지르며 폭행한다. 순이는 돈을 구하기 위해 사채업자 이주사의 첩의 집에 찾아가지만 이주사랑 마주치게 되고 반항하는 순이를 돈으로 유혹해 범하고만다. 순이를 통해 돈을 구한 춘호는 향심과 서울의 향심의 삼촌을 찾아간다. 한편 돈을 갚지 못해 이주사에게 겁탈을 당한 한 아낙네의 시체가 물에 떠내려 오자 마을사람들은 분노하여 이주사의 집과, 모두를 향락의 길로 이끈 향심의 술집을 습격한다. 집으로 돌아온 춘호는 향심과 마을을 떠나기 위해 살림도구를 챙기지만 마을사람들에 의해 폭행을 당하고 순이가 마을사람들을 말리는 사이, 춘호는 향심을 만나기 위해 사력을 다해 도망친다. 수소문끝에 향심과 향심의 삼촌을 찾게되지만 그들의 모습은 창녀와 거지 폐병환자였고 향심의 삼촌이 실은 향심의 남편이라는 것을 알게 된다. 실의에 빠진 춘호는 다시 순이를 찾아가지만 뱃속의 아기가 죽은채로 오래 방치돼 생명이 위험하다는걸 알게 된다. 병원비가 없는 춘호는 일본인 병원을 찾아가지만 수술비를 지불해야만 수술해 주겠다고 하고, 이에 순이는 수술을 거부하는데.\n\nCasts : Hah Myung-Joong, Cho Yong-Won, Lee Hye-Young, Ju Sang-Ho\n\nSYNOPSIS : It is the 1930s and Korea is under the Japanese occupation. The Korean people barely survive day to day under the cruel and difficult conditions of the Japanese. Chun-ho and his wife Sun-ie wander about the whole country looking for a place to live. As his wife lags behind, Chun-ho yells at her. He tries to throw away the kettle that she is holding but she holds on to it with her dear life. Chun-ho fails over and over at gambling and gold mines. They settle down in a mining village. Due to his troubles, Chun-ho habitually beats and berates Sun-ie but she works diligently, loving and watching over him. He doesn't understand why Sun-ie wants a child. Chun-ho puts all his energy into getting out of his present misery, at all costs. He listens intently to Hyang-sim, a barmaid, when she says she'll introduce him to her uncle in Seoul who is well connected to the Japanese. Chun-ho yells and beats Sun-ie to get some extra money. In order to get some money, Sun-ie goes to the home of Lee's mistress. Lee is a loan shark. His mistress is willing to pay in advance for precious mountain ginseng. But when Sun-ie gets there, the mistress is out and she runs into Lee instead. Lee has always had his eye on Sun-ie. He tries to violate her as she fights him off desperately. In the end, Lee gives her money and takes her. With the money Sun-ie has gotten him, Chun-ho goes to Seoul with Hyang-sim to meet her uncle. Meanwhile, a wife of the village is found floating dead in the river. When she couldn't pay back the money, Lee loaned her and raped her. The villagers are all outraged. They attack Lee's house for he has exploited many villagers. They also go after the bar where Hyang-sim works at for leading the villagers into self-indulgence. On his way back to the village with Hyang-sim, Chun-ho learns of the outburst through a friend. Chun-ho asks Hyang-sim to run away with him but she tells him that they should go back to get their things. She leaves him and goes to the bar. Chun-ho returns home where Sun-ie is alone.  Ignoring and beating her up, Chun-ho gathers up their things. When he tries to take Sun-ie's favorite kettle, she desperately fights to keep it. At this time, the villagers arrive at Chun-ho's house and they start beating him up when Sun-ie holds the villagers back. Grabbing this chance, Chun-ho escapes to meet with Hyang-sim who he regards as his last hope. Chun-ho wanders the whole country looking for Hyang-sim and her uncle. After asking around, he finally finds them. But now, Hyang-sim is a shabby prostitute and her uncle, a beggar with tuberculosis. It also turns out that Hyang-sim's uncle is actually her husband. Disheartened, Chun-ho heads back to the village. On his way back, Chun-ho runs into a friend who is headed to Manchuria for he no longer can bear to live in Korea under Japanese rule. From his friend, Chun-ho hears news of Sun-ie. Chun-ho vows not to abandon Korea and goes looking for Sun-ie. Upon returning to the village, Chun-ho learns that Sun-ie is sick due to starvation. Sun-ie also left alone a dead fetus in her belly too long. Her life is in danger. Having no money for the hospital, Chun-ho takes Sun-ie to a Japanese hospital and tries to get her treated. However, the Japanese doctor mistakes her as a live subject for biological experiments. Sun-ie cannot be a subject for his experiment. The doctor refuses to operate on her unless she has the money. Sun-ie rejects the surgery.",
      "id": "lRLrehsvo6I",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [
    "blocked"
  ],
  "qualityNotes": "YouTube video blocked/unavailable",
  "lastUpdated": "2025-12-26T00:23:19.289Z"
}