{
  "movieId": "youtube-69DhzDrHVeI",
  "title": "Madame White Snake (Baeksabu-in)(1960)",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=69DhzDrHVeI",
      "id": "69DhzDrHVeI",
      "title": "Madame White Snake (Baeksabu-in)(1960)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00603\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00603\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희,신성일,한은진,최삼,고성진,옥경희,이영,최찬식,추봉,김호연,박병기,이기홍,정득순,백송,지방열,최현,임동훈,이창식,송일근,이업동,고선애\n\n줄거리 : 인간으로 변신한 천년 묵은 뱀인 백사부인(최은희)은 젊은 약사 허선(신성일)과 사랑에 빠져 결혼하고, 몇 번의 위기를 겪지만 서로의 사랑은 꺾이지 않는다. 하지만 함부로 인간으로 환생한 백사에게 법해선사와 관음보살은 7월 7석까지 그녀가 선계로 돌아와야 한다고 명령한다. 슬픔 속에 이별을 준비하던 백사는 그녀를 탐내는 대윤(최삼)의 음모로 위기에 빠져 약속을 지키지 못하고, 사랑하는 남편을 위해 목숨을 건다. 그들의 사랑에 감동한 관음보살은 마침내 그들의 사랑을 허락한다.\n\nCasts : Choi Eun-Hee,Shin Seong-Il,Kim Dong-Won\n\nSYNOPSIS : A thousand-year-old snake that has transformed itself into a human, Madame White Snake (Choe Eun-hui), falls in love with a young pharmacist named Heo-Seon. Although they encounter difficulties, they are wed, and their love for each other does not change. However, Beophaeseonsa (a Zen priest) and Gwaneumbosal (the Buddhist goddess of mercy) order Madame White Snake, who had transformed into human without being granted permission to do so, to return back to the world of the gods before July 7. Grieving, she prepares to say goodbye to her beloved husband.  But before she can return to the world of the gods in time, she falls into a trap set by Dae-yun (Choe Sam), who is attracted to her. Because of the trap, she is not able to keep the promised deadline, and ends up risking her life to save her husband. Touched by this display of their true love, Gwaneumbosal permits the two lovers to live happily together.",
      "addedAt": "2025-12-26T00:24:01.817Z",
      "thumbnail": "https://i.ytimg.com/vi/69DhzDrHVeI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLADJ677dw0l_CAf59mBqRiCmHP0qA",
      "duration": 5537,
      "language": "ko",
      "year": 1960,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:01.879Z"
}