{
  "movieId": "youtube-XW-1D9G1Hj0",
  "title": "Der Winterprinz - Miras magisches Abenteuer (FANTASY ABENTEUER ganzer Film auf Deutsch, Abenteuer)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XW-1D9G1Hj0",
      "id": "XW-1D9G1Hj0",
      "title": "Der Winterprinz - Miras magisches Abenteuer (FANTASY ABENTEUER ganzer Film auf Deutsch, Abenteuer)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Der grausame Zauberer Snerk hat das einst friedliche Märchenreich Ridderdalen in ein finsteres Schattenreich verwandelt. Königin Eiril flieht in unsere Welt und bittet ihren alten Freund Kevin um Hilfe. Gemeinsam wagen sie die Rückkehr durch das verschlossene Tor – und stellen sich dem scheinbar unbesiegbaren Herrscher.\n\nDER WINTERPRINZ - MIRAS MAGISCHES ABENTEUER (2015)\nOriginaltitel: Julekongen\nMit: Stella Stenman, Bjarte Tjøstheim, Tone Beate Mostraum\nRegie: Thale Persen\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nEine fantasievoll erzählte Geschichte für die ganze Familie: Basierend auf einer der erfolgreichsten TV-Serien Norwegens, setzt „Der Winterprinz – Miras magisches Abenteuer“ die Geschichte von Eiril und Kevin in Spielfilmlänge fort und versteht es mit einer spannenden Fantasy-Geschichte um Freundschaft, Vertrauen und Zusammenhalt auf zauberhafte Weise die wahren Werte des Weihnachtsfestes zu beschwören und dabei bestens zu unterhalten.\nWeihnachten ist wieder in Gefahr! Drei Jahre sind bereits vergangen, seit Eiril gezwungen war, das Portal zwischen dem magischen Königreich Ridderdalen und unserer Welt zu schließen, um das Weihnachtsfest vor dem Bösen zu schützen. Doch die Dunkelheit kehrt in Gestalt von Lord Snerk zurück, um Eiril von ihrem Thron zu vertreiben und selbst die Macht zu ergreifen. Getrennt von ihrem besten Freund Kevin, der einen Weg zurück nach Ridderdalen sucht, ist Eiril auf ihrer Flucht dazu gezwungen, das Portal zwischen den Welten wieder zu öffnen. Können die beiden Freunde erneut das Fest der Liebe retten und den Geist der Weihnacht in beiden Welten zu neuem Leben erwecken?\n#Netzkino #ganzerFilm #Fantasy\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:47:02.151Z",
      "thumbnail": "https://i.ytimg.com/vi/XW-1D9G1Hj0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBU5F-Cj-VwRpeswZAWJNLy164akQ",
      "duration": 5588,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}