{
  "imdbId": "youtube-uawic9pXjic",
  "title": "Rediscovering Christmas One Kiss at a Time | Christmas In Mistletoe | Christmas Hallmark 2025 Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uawic9pXjic",
      "title": "Rediscovering Christmas One Kiss at a Time | Christmas In Mistletoe | Christmas Hallmark 2025 Movie",
      "description": "Rediscovering Christmas One Kiss at a Time | Christmas In Mistletoe | Christmas Hallmark 2025 Movie - A disillusioned Christmas movie location scout rediscovers her Christmas spirit while falling in love with the perfect leading man in the cozy mountain town of Mistletoe.\n\nWatch Christmas in Mistletoe, a full Hallmark Christmas movie where a disillusioned Christmas movie location scout travels to the cozy mountain town of Mistletoe and slowly rediscovers her holiday spirit. As snow falls and festive charm fills the town, she unexpectedly falls in love with the perfect leading man. Perfect for fans of Hallmark Christmas movies, romantic holiday films, full free Hallmark Christmas movies, cozy winter romances, and heartwarming festive stories, Christmas in Mistletoe delivers seasonal magic, charm, and a feel-good Christmas love story.\n\nStars: Kabby Borders, Tom Gipson, Chantey Colet\n*Licensed from Vision Films. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#christmasfilm #hallmarkmovie #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "uawic9pXjic",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "blocked": [
          "AE",
          "AR",
          "AT",
          "BH",
          "BO",
          "BR",
          "CH",
          "CL",
          "CO",
          "CR",
          "CU",
          "CY",
          "DE",
          "DO",
          "EC",
          "EG",
          "GB",
          "GT",
          "HN",
          "IE",
          "IL",
          "IQ",
          "IR",
          "JO",
          "KW",
          "LB",
          "MX",
          "NI",
          "OM",
          "PA",
          "PE",
          "PL",
          "PR",
          "PS",
          "PY",
          "QA",
          "SA",
          "SV",
          "SY",
          "TR",
          "UY",
          "VE",
          "YE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T23:59:22.279Z"
}