{
  "movieId": "youtube-3aK4UL25Hhg",
  "title": "Even the Clouds are Drifting (Gureumeun Heulleodo)(1959)",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3aK4UL25Hhg",
      "id": "3aK4UL25Hhg",
      "title": "Even the Clouds are Drifting (Gureumeun Heulleodo)(1959)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00518\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00518\n\n감독(Director) : 유현목(Yoo Hyeon-Mok)\n출연 : 김영옥,박성대,엄앵란,박광수,이해랑,황정순,조미령,조현주,변기종,한미나,최남현,정애란,김승호,허장강,김칠성,황해,김종원,최무룡,도금봉,김아미,최인봉,주선태,이일선,남방운,노강,한림\n\n줄거리 : 광산촌에 사는 말숙(김영옥) 4남매는 부모 없이 어렵게 살아가지만 한결같이 착하고 성실하다. 그러나 광산에서 일하던 큰 오빠 동석(박성대)이 해고되는 바람에 살길이 막막해진다. 동석과 큰 언니 양숙(엄앵란)은 돈을 벌러 타향으로 떠나고, 말숙과 작은 오빠 동일(박광수)은 이웃집에 맡겨지지만 주인 내외로부터 심한 구박을 받는다. 말숙은 힘겨운 하루하루를 꾸준히 일기에 담으며 마음의 위로를 삼는다. 친구인 광산회사 사장딸 집에 놀러갔던 말숙은 실수로 조각상을 깨뜨린다. 그리고 미안한 마음에서 친구에게 자신의 일기를 선물로 준다. 말숙의 일기를 본 친구 가족들은 크게 감명받고, 출판사에 일했던 친구 언니(조미령)는 일기의 출판을 제안한다. 단행본으로 나온 말숙의 일기는 베스트셀러가 된다. 동석이 광산회사에 다시 채용됨에 따라 남매들은 다시 함께 살게 된다.\n\nCasts : Kim Young-Ok,Park Seong-Dae,Eom Aeng-Ran,Park Kwang-Su\n\nSYNOPSIS : Mal-Suk (Kim Yeong-ok) and his three brothers and sisters live as orphans in an impoverished mining town.  They are good and diligent children. But when the eldest brother (Park Seong-dae) is laid off from his job in the mines, the children are left with no way to support themselves. Two of the children, including the eldest brother, Dong-suk, and another sibling, Yang-suk (Eom Aeng-ran), leave home to make money.  Mal-suk and Dong-il (Park Kwang-su) are sent to live with a neighbor, but the neighbor harshly abuses them. Mal-suk finds her sole consolation in keeping a diary. When she breaks a sculpture by mistake at her wealthy friend's house, she gives her friend her diary to read as consolation.  Her friend's family members are deeply moved by what Mal-suk has written, and her sister (Jo Mi-ryeong) suggests that she publish the diary. The diary becomes a bestseller. Meanwhile, Dong-suk finally finds work, and the brothers and sisters are able to reunited once again under one roof.",
      "addedAt": "2025-12-26T00:23:31.405Z",
      "thumbnail": "https://i.ytimg.com/vi/3aK4UL25Hhg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLACm6T_1M2Qh9wUiEc4UuqbTYiaZg",
      "duration": 5635,
      "language": "ko",
      "year": 1959,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:31.439Z"
}