{
  "imdbId": "youtube--XRj-uHWfjA",
  "title": "Hard Knox 1984 | Robert Conrad, Red West, Alan Ruck (Comedy, Drama) Full Movie, subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-XRj-uHWfjA",
      "title": "Hard Knox 1984 | Robert Conrad, Red West, Alan Ruck (Comedy, Drama) Full Movie, subtitles",
      "description": "Reporting for duty: A brigade of misfits.\nColonel Joe Knox, a tough career Marine fighter pilot instructor, is reluctantly sidelined, and takes on the role of temporary head at a military high school. With his no-nonsense approach, he shakes up the school, and raises morale so that they are able to win the \"brass-axe\" competition versus another local military academy.\n\nOriginal title: Hard Knox (1984)\n\nThis movie is subtitled in many languages.\n\nDirector: Peter Werner\nWriters: David J. Kinghorn, Robert Conrad\nStars: Robert Conrad, Red West, Joan Sweeny, Alan Ruck\nGenres: Classics, Comedy, Drama, Military\n\n\n00:00 Full Movie (with subtitles)\n00:58 A decorated fighter pilot faces challenges and receives tough feedback in his military career.\n09:16 A retired Colonel visits his old military school and reconnects with former colleagues and family.\n17:13 Military school faces closure, new principal challenges tradition, students adapt to changes.\n24:34 Cadets face strict discipline and new athletic director at a military school.\n31:30 A comedic and dramatic portrayal of life at a military school, focusing on discipline, camaraderie, and challenges.\n39:53 Struggles and challenges faced by cadets at a military academy under strict leadership.\n47:56 Cadets face tough challenges at military academy, leading to conflicts and unexpected events.\n54:13 Cadets participate in a war game, face challenges, and prepare for a social mixer event.\n1:03:49 A rebellious cadet at a military academy learns to take control and find purpose through aviation.\n1:14:05 Competitive team challenge with balloons and strategy unfolds in a high school setting.\n1:30:35 A cadet earns a prestigious position and receives appreciation from his peers and superiors at a military academy.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "-XRj-uHWfjA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:26.148Z"
}