{
  "movieId": "youtube-dgYmuKXBO1Q",
  "title": "The Secret Santa That Sparked a Journey | The Christmas Gift | 2025 Hallmark Christmas Movie",
  "year": 2025,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dgYmuKXBO1Q",
      "id": "dgYmuKXBO1Q",
      "title": "The Secret Santa That Sparked a Journey | The Christmas Gift | 2025 Hallmark Christmas Movie",
      "description": "The Secret Santa That Sparked a Journey | The Christmas Gift | 2025 Hallmark Christmas Movie - A journalist decides to write a holiday piece about her search for a `Secret Santa' from her childhood whose anonymous gift made a huge impact on her life.\n\nWatch The Christmas Gift, a full Hallmark Christmas movie where a journalist sets out to uncover the identity of her childhood Secret Santa, whose anonymous gift left a lasting impact on her life. Her holiday quest leads to unexpected discoveries, romance, and the magic of Christmas. Perfect for fans of Hallmark Christmas movies, heartwarming holiday films, full free Hallmark Christmas movies, cozy festive romances, and feel-good winter stories, The Christmas Gift delivers warmth, joy, and the true spirit of giving during the holiday season.\n\nStars: Michelle Trachtenberg, Sterling Sulieman, Jacob Johnson\n*Licensed from Tesera. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#christmasmovie #hallmarkchristmasmovies #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-26T23:59:23.717Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/dgYmuKXBO1Q/maxresdefault.webp",
      "duration": 5261,
      "language": "en",
      "year": 2025,
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:23.762Z"
}