{
  "imdbId": "youtube-25tTCL8Z8h8",
  "title": "My Man Godfrey 1936 (Comedy, Drama film) William Powell, Carole Lombard, Alice Brady",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=25tTCL8Z8h8",
      "id": "25tTCL8Z8h8",
      "title": "My Man Godfrey 1936 (Comedy, Drama film) William Powell, Carole Lombard, Alice Brady",
      "description": "From Rags to Riches and Back Again...! When High Society Meets the Streets.\nHomeless man Godfrey Smith's life takes a surprising turn when he becomes a butler for a dysfunctional rich family. His mysterious past and unassuming wisdom not only help mend their fractured lives but also lead to unexpected love and redemption.\n\nOriginal title: My Man Godfrey 1936 \nThis film is available with Italian, Portuguese & Spanish audio.\nSubtitles are available in many more languages.\n\n\nBlack & White original version: https://youtu.be/4Vxa1wZ0I5Q\n\nDirector: Gregory La Cava\nWriters: Morrie Ryskind, Eric Hatch, Zoe Akins\nStars: William Powell, Carole Lombard, Alice Brady\nGenres: Comedy, Drama, Romance\n\n\n02:27  A quirky scavenger hunt takes a hilarious, unexpected twist.\n08:25 -A wealthy family’s discovery of a homeless man sparks chaos and comedy.\n15:22  A new butler meets the eccentric and unpredictable Bullocks.\n30:27  The Bullock family’s absurd antics reach new heights of confusion.\n37:54  Godfrey, the mysterious butler, starts to reveal his true self.\n45:02  A lavish party spins into a whirlwind of drama and wit.\n51:26  A missing pearl necklace ignites suspicion and comedy.\n1:06:38  The family’s dynamic with Godfrey highlights class tensions.\n1:23:16  Financial ruin brings shocking revelations and Godfrey’s departure.\n1:28:36  A chaotic, unlicensed wedding plan leads to comedic disaster.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:34.789Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/25tTCL8Z8h8/maxresdefault.webp",
      "duration": 5595,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:34.917Z"
}