{
  "imdbId": "youtube-2wc2dtOmI_Q",
  "title": "A Petty Middle Manager ( Samdeung Gwajang )(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2wc2dtOmI_Q",
      "title": "A Petty Middle Manager ( Samdeung Gwajang )(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00646\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00646\n\n영화글 : https://www.kmdb.or.kr/story/10/2060\n\n감독(Director) : 이봉래(Lee Bong-Rae)\n출연 : 김승호(구 소장),도금봉(영희),황정순(구 소장 부인),김희갑(송 전무),방수일(권오철),박성대,윤인자(명옥),복혜숙(할머니),석금성,이일선,윤왕국,최삼,한림,김숙일,김아미,독고성,김심명\n\n줄거리 : 삼천리운수주식회사의 동부영업소 소장으로 근무하고 있는 구준택(김승호)은 아버지, 어머니(복혜숙), 부인(황정순), 아들 영구(박성대), 딸 영희(도금봉) 등 대가족을 이끌고 있는 가장이다. 딸이 삼천리운수에서 함께 일하게 된 첫날부터 구 소장은 딸 앞에서 송전무(김희갑)에게 야단을 맞는 등 망신을 당한다. 어느 날 송 전무는 구 소장에게 영업소 2층에 자신의 내연녀 명옥(윤인자)을 위해 댄스교습소를 마련해줄 것을 부탁한다. 구 소장은 댄스교습소를 만들어주고 본사 후생과장으로 승진한다. 한편 구 소장의 딸 영희는 같은 회사 후생과에 근무하는 권오철(방수일)과 명옥이 다방에서 만나는 것을 보고, 회사에 두 사람의 관계에 대한 소문을 퍼트린다. 그러나 권오철과 명옥은 친척지간으로 권오철은 명옥에게 전무와의 관계를 정리하라고 말하기 위해 만난 것뿐이었다. 송 전무는 아내와 말다툼 끝에 명옥이 구 과장의 내연녀라고 거짓말을 하고, 화가 난 구 과장의 아내는 집을 나와 송 전무의 아내와 술을 마시다 명옥의 집으로 쳐들어간다. 이때 송 전무는 명옥의 집에서 목욕 중이었고 송 전무의 아내는 이 광경을 목격한다. 구 과장의 아내는 오해를 풀고 다시 가정으로 돌아오고, 명옥은 전무와의 관계를 청산하고 시골로 낙향하기로 마음을 먹는다. 이런 사실을 알게 된 영희는 권오철에게 사과하고 화해한다.\n\nCasts : Kim Seung-Ho, Do Keum-Bong, Hwang Jeong-Sun, Kim Hee-Gap, Bang Su-Il, Bok Hye-Suk\n\nSYNOPSIS : Gu, a branch manager of a transport company, is asked by Song, an executive of the company, if he can turn the second floor of the branch into a dancing school. Song's mistress Myeong-ok will run the school, he says. Gu does as Mr. Song wants, and is promoted to the head of the welfare division of the headquarters. Gu's daughter, Yeong-hui, who recently got a job at the company, happens to see Gwon O-cheol of the welfare division spending time with Song's mistress. She shares what she saw with many people at the office, spreading rumors. But as it turns out, Gwon and Myeong-ok are related through marriage and grew up together. When Yeong-hui sees them together, Gwon persuades her to end the relationship with Song. One day Song, arguing with his wife, says that Myeong-ok is Mr. Gu's mistress. Mr. Song's wife tells this to Gu's wife, and the two women storm into Myeong-ok's house, where Song is taking a bath. Gu's wife sees that her husband did nothing wrong, and Myeong-ok decides to end the relationship and to go back to her hometown. Yeong-hui apologizes to Mr. Gwon.",
      "id": "2wc2dtOmI_Q",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:19.443Z"
}