{
  "imdbId": "youtube-0gb9DJJNO6Q",
  "title": "The Violent and the Damned 1962 (Crime, Drama) Arturo de C처rdova, Carlos Cotrim | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0gb9DJJNO6Q",
      "title": "The Violent and the Damned 1962 (Crime, Drama) Arturo de C처rdova, Carlos Cotrim | Movie",
      "description": "Run Convict-Run for the Sun- ...The Cry is Escape Now or Die!\nA bloody riot provides a cunning inmate with the opportunity to break out of his South American prison.\n\nOriginal title: Med mord i bagaget & Edited from M찾os Sangrentas (1955)\n\nColorized version: https://youtu.be/-uqPx2SirIY\n\n\nAvailable with subtitles in many language options\n\nDirectors: Carlos Hugo Christensen, Jerry Warren\nWriters: Carlos Hugo Christensen, Pedro Juan Vignalle\nStars: Arturo de C처rdova, Carlos Cotrim, Sadi Cabral\nGenres: Classics, Crime, Drama\n\n\n00:00 Full Movie\n01:13 Criminal activities in Panama involving international criminals and military personnel lead to tension and conflict.\n04:57 Psychologist called in to address increasing violence among prisoners, but doubts arise about his qualifications and effectiveness.\n07:38 Intense discussion between a doctor and a visitor about prison conditions and policies.\n10:03 Understanding the impact of the environment on mental health, the responsibility of personnel, and the need for reevaluation of perceptions.\n16:03 Escape plan executed, weapons secured, and a long-awaited moment.\n21:32: Tensions rise as characters discuss money, freedom, and a looming threat. A quick escape is planned as danger approaches.\n34:44 Tension rises as a group faces threats and betrayal while pursuing their target.\n\n\n@CultCinemaClassics",
      "id": "0gb9DJJNO6Q",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:39:15.630Z"
}