{
  "imdbId": "youtube-7ZR0mrW6qMA",
  "title": "COUNTERMOVE",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7ZR0mrW6qMA",
      "title": "COUNTERMOVE",
      "description": "The adventurous duology, beginning with the film \"The Detached Mission\"  https://youtu.be/rALCUZv_cyk vividly portrays one of the significant episodes of a major military exercise in the early 1980s, involving marine infantry ships and airborne paratrooper units. Set against the backdrop of intense troop maneuvers, the movie follows elite reconnaissance groups deployed behind enemy lines to execute daring sabotage missions and uncover a disguised command post. The story highlights the intense camaraderie, strategic planning, and high-stakes action typical of Soviet military operations during the Cold War era. Featuring gripping combat sequences, authentic military tactics, and a powerful portrayal of duty and honor, this classic Soviet war movie appeals to fans of military drama, historical adventure, and action-packed films. Ideal for viewers searching for \"Soviet war movies,\" \"military adventure films,\" \"paratrooper action,\" and \"Cold War military exercises,\" this cinematic work continues to captivate audiences with its realism and emotional depth.\n\nCOUNTERMOVE (1981) | Full movie with english subs.\n\nDirector: Mikhail Tumanishvili\n\nThe actors: Mikhail Volontir, Boris Galkin, Vadim Spiridonov, Elena Glebova, Anatoly Kuznetsov, Alexander Pyatkov, Leonid Belozorovich, Vladimir Marenkov, Daniil Netrebin, Laimonas Noreika, Anatoly Romashin, Mikhail Chigarev\n\nWitness the intensity of a **soldier** and **special forces** team preparing for a high-stakes **military** operation. This gripping footage showcases their rigorous **military training** and strategic planning, as they utilize calculated **ambush tactics**. Experience the raw power of the **army** in action, rooted in rich **military history**.",
      "id": "7ZR0mrW6qMA",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-23T03:43:47.918Z"
}