{
  "imdbId": "youtube-AK6m0BjJSWc",
  "title": "The Palace of Ambition (Pung-un-ui gungjeon)(1957)",
  "year": 1957,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AK6m0BjJSWc",
      "title": "The Palace of Ambition (Pung-un-ui gungjeon)(1957)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00350\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00350\n\n감독(Director) : 정창화(Jeong Chang-Hwa)\n출연 : 김미선(구슬아기),이승화(보해태자),김승호(화피달),변기종(진평대감),고향미(화선아기),양일민(태을라),김신재,성소민,허장강,장훈,김옥란,조항,최성호,김세라,김웅,이성일,이동훈,임해림,최운,한장봉,임훈,김주오,거인(특별출연),이순근(특별출연),양형균\n\n줄거리 : 마한시대를 배경으로 한 궁중 사극. 첫눈에 반한 이름모를 여인에 대한 연정으로 간택 자리에 가기를 꺼려하던 보해태자(이승화)는 왕의 명으로 간택에 나선다. 간택 자리에는 진평대감(변기종)의 딸 구슬아기(김미선)와 화피달(김승호)의 딸 화선아기(고향미)가 나온다. 태자는 이름도 모른 채 연모하던 여인이 바로 구슬아기라는 사실을 알고 기뻐한다. 그러나 자신의 딸 화선아기가 태자비로 간택되어 권력을 얻기를 원한 화피달은 진평 대감을 역적으로 몰아 옥에 가두고 궁을 점령한다. 도망친 구슬아기는 남장을 하고 산을 넘다가, 화피달의 모함을 받아 부친을 잃고 산적 생활을 하는 돼지라 불리는 해모수(이성일)를 만난다. 구슬아기와 해모수는 궁중으로 잠입해 화피달 일당을 물리치고 진평대감을 구해낸다. 태자는 구슬아기를 태자비로 맞는다.\n\nCasts : Kim Mi-Seon, Seong So-Min, Kim Wung, Kim Seung-Ho\n\nSYNOPSIS : It is a historical court drama set against the background of the Mahan Age. Crown Prince Bo-hae (Lee Seung-hwa) is reluctant to go to the place where the Crown Princess will be selected, because of affections for an unknown woman whom he had fallen in love with at first sight. But because of the king's orders, he goes there. There are two women waiting to be selected. One is Guseulagi (Kim Mi-seon), a daughter of Lord Jin-pyeong (Byeon Ki-jong), and the other is Hwaseonagi (Ko Hyang-mi), a daughter of Hwa Pidal (Kim Seung-ho). He is pleased by the fact that the unknown woman, whom he is in love with, is Guseulagi. But Hwa Pidal, who wants his daughter to be selected to gain power, accuses Lord Jin-pyeong for being a traitor and puts him in jail. Guseulagi runs away, disguising herself as a man. While crossing a pass, she runs into Haemosu (Lee Seong-il), named Pig. His father died because of Hwa Pidal's trickery and Haemosu turned into a bandit. Guseulagi and Haemosu steal into the palace and beat off Hwa Pidal and his group to rescue Lord Jun-pyeong. Guseulagi becomes the Crown Princess.",
      "id": "AK6m0BjJSWc",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:23:51.747Z"
}