{
  "movieId": "youtube-4qibUC40OCo",
  "title": "Ninja – Im Zeichen des Drachen - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4qibUC40OCo",
      "id": "4qibUC40OCo",
      "title": "Ninja – Im Zeichen des Drachen - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Aktion-Thriller \" Ninja – Im Zeichen des Drachen“ in ganzer Länge bei #Moviedome sehen.\n\nDas Königreich der Samarza im Himalaya ist ein Hort des Friedens und der Ruhe. Doch dann werden der König und seine Familie vom Skanji Imperium, die das Reich versklaven wollen, brutal überfallen und tödlich verletzt. Verantwortlich dafür: Die weibliche Ninja-Kampfmaschine und extrem tödliche Assassine Nadia. Damit ist die Herrschaftslinie über das Königreich eigentlich beendet - und der Weg frei zur Übernahme durch die bösartigen Skanjis. Doch kurz vor seinem Tod verrät der König seinem engsten Vertrauten, dass er eine geheim gehaltene Tochter in Amerika namens Jan hat. Als letzte Überlebende der Familie wäre sie somit rechtmäßige Thronfolgerin. Der Vertraute des Königs, Adam Arthavan, reist also in die USA, um das Mädchen ausfindig zu machen und sie unter bestmöglichem Schutz in das Königreich zu bringen. Die lebt dort wohlbehütet mit ihrem vermeintlichen Vater und hat keine Ahnung von ihren familiären Verquickungen. Doch das ändert sich schnell. Denn auch die Gegenseite ist, in Form der eiskalten Killerin Nadia, auf der Jagd nach Jan. Und die gibt natürlich erst auf, wenn ihr Auftrag beendet ist und die Linie der Samarzas ausgelöscht ist. Auf dem Weg und hinterlässt dabei eine Spur der Verwüstung. Je näher die Killerin der Prinzessin kommt, desto mehr verschwimmt die Grenze zwischen Gut und Böse...\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\nJetzt “ Ninja – Im Zeichen des Drachen ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama\n \nFilmlänge: 90 Minuten \nOriginaltitel: Royal Kill\nRegie: Bob Ahmed\nFSK: 16\nDVD-Start (DE): 2012\n\nDie Darsteller\nAlexander Wraith in der Rolle des Adam Arthavan\nGail Kim in der Rolle der Assassin\nLalaine  in der Rolle der Jan\nPat Morita in der Rolle des Exhibition Manager\nEric Roberts in der Rolle des Vaters\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\nGanzer Film auf deutsch \n\nDen Aktion-Thriller \" Ninja – Im Zeichen des Drachen “ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:09.689Z",
      "thumbnail": "https://i.ytimg.com/vi/4qibUC40OCo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAseQsPi8jmWfhSfHnQPgooUlUrvQ",
      "duration": 5385,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "ninja",
      "name": "Ninja"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:09.750Z"
}