{
  "imdbId": "youtube-cykQq5GPu1A",
  "title": "Non aspettare Django, spara (1967) Western | Pelicula completa",
  "year": 1967,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cykQq5GPu1A",
      "id": "cykQq5GPu1A",
      "title": "Non aspettare Django, spara (1967) Western | Pelicula completa",
      "description": "Navarro, un fuorilegge al servizio di un certo Alvarez, uccide il signor Foster che aveva appena concluso con lo stesso Alvarez un affare da 100.000 dollari per una mandria di cavalli. Django, figlio di Foster, intende vendicarsi e ritrovare il denaro di famiglia. Giunto in un villaggio, vi incontra Navarro, e lo sfida a duello uccidendolo. A questo punto l'interesse si sposta sui soldi, e Django trova il supporto di un messicano che gli confida che il bottino si trova ancora nel villaggio. Ne è infatti in possesso Grey, che viene sfidato e ucciso da Django. Nel frattempo Alvarez, per recuperare la forte somma, si rivolge ad un professionista che rapisce la sorella di Django ed uccide a sangue freddo suo zio. Ma la ferocia del killer non si placa, e lo porta ad uccidere lo stesso Don Alvarez per poter mettere le mani sull'intero bottino. La resa dei conti finale è con Django che, con il fondamentale aiuto del messicano, elimina il killer, riportando a casa, salva, la sorella.\n\nNon aspettare Django spara! è un film del 1967 diretto da Edoardo Mulargia.\nEscritor: Vincenzo Musolino \nProtagonistas: Ivan Rassimov, Ignazio Spalla, Rada Rassimov\n\nEsta película está disponible con opciones de audio en inglés y español.\n\n00:00 Película completa (con subtítulos)\n01:28 Un hombre honesto es acusado de no cumplir con un trato de caballos, lo que lleva a una serie de eventos trágicos.\n19:52 Un hombre busca venganza y dinero en un pueblo, enfrentando amenazas y engaños.\n32:09 Un ranchero busca venganza después de un robo de dinero y caballos, que involucra a Django y Álvarez.\n45:44 Un encuentro fatal entre Barrica y Django conduce a un enfrentamiento mortal por los dólares.\n57:07 Django, se involucra en un plan para salvar a su hermana secuestrada y recuperar los dólares robados.\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdaYxUUeZrLnntVqlM4qijQM",
      "addedAt": "2025-12-27T00:44:47.239Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/cykQq5GPu1A/maxresdefault.webp",
      "duration": 4635,
      "language": "en",
      "year": 1967,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "DE",
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:44:47.416Z"
}