{
  "imdbId": "youtube-e-3rfGXP0zw",
  "title": "Obsessed - Deadly Games (PSYHOTHRILLER full movie German, full horror movies free, horror)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=e-3rfGXP0zw",
      "title": "Obsessed - Deadly Games (PSYHOTHRILLER full movie German, full horror movies free, horror)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Im Psychothriller Braid wollen zwei junge Frauen einer ehemaligen Freundin Geld stehlen. Doch diese ist aufgrund eigener Probleme unberechenbar.\n\nOBSESSED - TÖDLICHE SPIELE (2018)\nOriginaltitel: Braid\nMit: Madeline Brewer; Kurt Affair; Imogen Waterhouse\nRegie: Mitzi Peirone\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nTilda (Sarah Hay) und Petula (Imogen Waterhouse) handeln mit Drogen und stehen gerade vor dem Deal ihres Lebens. Doch dann stürmen Cops ihre Wohnung. Ihnen gelingt gerade so die Flucht, doch sie müssen alle ihre Drogen zurücklassen. Nun schulden die beiden Frauen einem mächtigen und gefährlichen Drogenboss viel Geld und sehen nur einen Ausweg. Sie wollen ihre wohlhabende, aber geistig gestörte Freundin Daphne (Madeline Brewer) um ihr Geld erleichtern. Diese wohnt zurückgezogen in einem langsam verfallenden Anwesen und zwingt jeden, der sie aufsucht, mit ihr ein merkwürdiges Spiel zu spielen. Tilda und Petula sehen darin erst kein Problem, bis sie nach und nach merken, dass die dafür genommenen Halluzinogene dafür sorgen, dass die Dinge gewaltig aus dem Ruder laufen….\n#Netzkino #ganzerFilm #Horrorfilme\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "e-3rfGXP0zw",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}