{
  "imdbId": "youtube-WVW_W5_rfJ8",
  "title": "Universal Soldier 2 - Brüder unter Waffen (GANZER ACTIONFILM auf Deutsch NEU, Sci Fi Actionfilme)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WVW_W5_rfJ8",
      "title": "Universal Soldier 2 - Brüder unter Waffen (GANZER ACTIONFILM auf Deutsch NEU, Sci Fi Actionfilme)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein in einem Geheimlabor der US-Armee reanimierter Soldat, der sich zunächst den Befehlen seiner Schöpfer unterwirft, rebelliert, als die Begegnung mit seinem Bruder und einer Reporterin die Erinnerung an seine frühere Existenz weckt.\n\nUNIVERSAL SOLDIER 2 - BRÜDER UNTER WAFFEN (1998)\nOriginaltitel: Universal Soldier II: Brothers in Arms\nMit: Matt Battaglia, Andrew Jackson, Eric Bryson\nRegie: Jeff Woolnough\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nNach den schrecklichen Ereignissen bei den ersten Tests der Universal Soldiers wurde das Budget von der Regierung gekürzt. Unter dem Befehl eines CIA-Direktors übernimmt eine Bande von Söldnern die Kontrolle über die neue Linie der Universal Soldiers und versucht, sie für den Diamantenschmuggel an den höchsten ausländischen Käufer einzusetzen. Als Luc Deveroux, Überlebender des ersten Vorfalls, weiterhin Probleme verursacht, wird sein neu gefundener jüngerer Bruder zusammen mit seiner Freundin, der Nachrichtenreporterin Veronica Reynolds, gefangen genommen.\n#Netzkino #ganzerFilm #actionfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "WVW_W5_rfJ8",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}