{
  "imdbId": "youtube-jxvZLaaConQ",
  "title": "The Murder Mansion 1972 | Horror, Thriller | Ida Galli, Analía Gadé, Lisa Leonardi",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jxvZLaaConQ",
      "title": "The Murder Mansion 1972 | Horror, Thriller | Ida Galli, Analía Gadé, Lisa Leonardi",
      "description": "What Horror Awaits in the Tomb of the Living Dead?\nA couple, lost in thick fog, take refuge in an old mansion next to a cemetery. Strange things start to happen.\n\nOriginal title: La mansion de la niebla  AKA: The Murder Mansion / Maniac Mansion\n\nThis film is available with English, Italian & Spanish dubbed audio. Go to settings ⚙️ to select your subtitle /audio options.\n\nDirector: Francisco Lara Polop\nWriters: Luis G. de Blain, Antonio Troiso\nStars: Ida Galli, Analía Gadé, Lisa Leonardi\nGenres: Spanish cinema, Horror, Thriller\n\n\n00:00 Full Movie (with dubbed audio and subtitles)\n00:06 Mysterious events unfold as characters navigate through personal and financial turmoil.\n13:33 Unexpected events unfold as a couple gets lost in the fog, leading to a chilling encounter.\n19:12 Unexpected encounters in a mysterious foggy area lead to eerie revelations and suspicions of a sinister plot.\n26:01 Mysterious events unfold in an abandoned village where visitors get trapped in a foggy night at a house with a dark history.\n31:02 Mysterious events unfold in an old mansion, leading to a shocking discovery.\n40:27: Mysterious events unfold in a mansion, leading to suspicion and tension among the characters.\n53:28 Mysterious events unfold in an eerie mansion, leading to a shocking discovery of a murder.\n1:03:51 Mystery unfolds as characters encounter disappearances, deaths, and a sinister presence in a mansion.\n1:16:31 A thrilling and suspenseful sequence of events unfolds in a mansion involving deception, terror, and tragedy.\n\n\n@CultCinemaClassics",
      "id": "jxvZLaaConQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:41.840Z"
}