{
  "movieId": "youtube-tsTpSYKS1vM",
  "title": "My All-American - Hope Never Dies (Full Movie BASED ON A TRUE STORY German complete)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tsTpSYKS1vM",
      "id": "tsTpSYKS1vM",
      "title": "My All-American - Hope Never Dies (Full Movie BASED ON A TRUE STORY German complete)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Bewegender Film NACH WAHREN BEGEBENHEITEN mit AARON ECKHART (\"The Dark Knight\"), FINN WITTROCK (\"American Horror Story\") & ROBIN TUNNEY (\"the Mentalist\"): Die wahre Geschichte des Football-Spielers, Underdog und Publikumsliebling FREDDIE STEINMARK, der sein Team zur Meisterschaft führte und kurz danach um sein Leben kämpfen musste...\n\nMY ALL-AMERICAN – DIE HOFFNUNG STIRBT NIE (2015)\nOriginaltitel: My All-American\nMit: Aaron Eckhart, Finn Wittrock, Robin Tunney\nRegie: Angelo Pizzo\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nFreddie Steinmark (Finn Wittrock) will Football spielen, mehr als alles andere im Leben. Obwohl er nicht den athletischen Mindestanforderungen für Football entspricht, trainiert ihn sein Vater (Michael Reilly Burke) hart für eine Profikarriere.\nFreddie beweist im richtigen Moment Kampfgeist, was nicht unbemerkt bleibt. Kein geringerer als der legendäre Coach der University of Texas, Darrell Royal (Aaron Eckhart), entdeckt ihn und bietet ihm die Chance mit einem Sportstipendium für die Texas Longhorns zu spielen.\nMit seiner Highschool-Liebe Linda (Sarah Bolger) zieht er nach Austin, wo ihn ein anstrengendes und straffes Trainingsprogramm erwartet. An der Seite seines alten Freundes Bobby Mitchell (Rett Terrell) und dem neuen Team-Kollegen James Street (Juston Street) absolviert er die zermürbenden Trainings. Die Anstrengungen zahlen sich aus. Die Texas Longhorns gewinnen 1969 nach einer aufregenden, wechselhaften Saison die Meisterschaft. Die unermessliche Freude über den Erfolg wird kurz darauf auf grausame Weise zerschmettert, als Freddie eine schockierende Diagnose erhält. Er ist an Knochenkrebs erkrankt.\nNun sieht er sich mit dem schwersten Kampf seines Lebens konfrontiert. Eine bewegende Geschichte über einen Jungen mit einem Herzen eines wahren Champions, der zum Liebling und Helden seiner Fans wurde.\n#Netzkino #ganzerFilm #WahreBegebenheit\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:46:17.260Z",
      "thumbnail": "https://i.ytimg.com/vi/tsTpSYKS1vM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAXkiQQWqJ0Qef7rLnvZ9a4EcSGrA",
      "duration": 7099,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}