{
  "imdbId": "youtube-N-OFOAH88k0",
  "title": "A Stranger in Town (1943, Romance) He's on the Side of Law, Order... AND Love!",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=N-OFOAH88k0",
      "title": "A Stranger in Town (1943, Romance) He's on the Side of Law, Order... AND Love!",
      "description": "Love and the law in a terrific tangle! It's Frank Morgan's heart-warming best! \nIn a small corrupt town, an honest crusading lawyer running for mayor gets unexpected help from a tourist who happens to be a Supreme Court judge.\n\nOriginal title: A Stranger in Town (1943)\n\nBlack & White version: https://youtu.be/XpFe9Mxi9pE\n\n\nDirector: Roy Rowland\nWriters: Isobel Lennart, William Kozlenko\nStars: Frank Morgan, Richard Carlson, Jean Rogers, Chill Wills\nGenre: Comedy, Drama, Romance, Colorized\n\n\n00:00 Full colorized movie (with subtitles).\n02:07 A judge declines an investigation due to exhaustion and plans to go hunting, sparking speculation among colleagues.\n07:00 Legal dispute over missed payment leads to court judgment against Thomas Cooney.\n11:56 A mayor faces a dilemma when a man asks for help without wanting charity, leading to concerns about a radical influence.\n17:40 Navigating a corrupt town, a man seeks to outsmart the system and avoid compromising his values.\n23:22 Legal implications of not stocking required automotive parts leading to potential judgment against a dealer.\n30:41 Unexpected altercation leads to misunderstandings and conflict in a small town hotel.\n36:00 Unexpected late-night visitor disrupts hotel guest's vacation with urgent request for assistance.\n44:09 Legal battle over hotel regulations regarding bed linens and spacing.\n50:04 Unexpected eviction due to termite infestation causes chaos in the office building.\n56:41 Demand for arrest warrants leads to confrontation with judge over alleged conspiracy and abuse of public office.\n1:02:14 Accusations of abusing office lead to warrant for arrest of outsider in a small town.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOQIrvVPHrt2cN14ktGA2Snw",
      "id": "N-OFOAH88k0",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:35:44.856Z"
}