{
  "imdbId": "youtube-BTkIzdZ1tks",
  "title": "Gib den Jungs zwei Küsse - Bewegendes Drama - Wahre Begebenheit - ganzer Film in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BTkIzdZ1tks",
      "id": "BTkIzdZ1tks",
      "title": "Gib den Jungs zwei Küsse - Bewegendes Drama - Wahre Begebenheit - ganzer Film in HD bei Moviedome",
      "description": "*GANZER FILM - WUNDERVOLLES, BEWEGENDES DRAMA*\nDas bewegende Drama „Gib den Jungs zwei Küsse“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Gib den Jungs zwei Küsse“:\nIMDb: *6,5* von 10\nAmazon: *4,4* von 5\n\n*Die Handlung von „Gib den Jungs zwei Küsse“*\nSeit ihrer Jugend sind Singe (Rafe Spall) und Kate Greene (Emilia Fox) ein unzertrennliches Liebespaar. Die beiden gründen eine laute, quirlige Familie und könnten glücklicher kaum sein. Doch ihr Leben wird auf den Kopf gestellt, als bei Kate eine schwere Erkrankung festgestellt wird. Ihre Gedanken kreisen fortan um die Zeit nach ihrem Abschied. Da überkommt Kate eine wundervolle Idee..\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\n\nJetzt den ganzen Spielfilm „Gib den Jungs zwei Küsse“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #DramaFilm #Drama #bewegend #ganzeFilme #FilmeKostenlos\n\nOriginaltitel: Mum’s List\nHerkunftsland: USA\nLaufzeit: 101 Minuten\nRegie: Niall Johnson\nFSK: 12\nErstveröffentlichung: 2016\n\n\n*Das sind die Schauspieler*\nRafe Spall (bekannt aus „The Big Short“, „Life of Pi“)\nin der Rolle des Singe Greene\nEmilia Fox (bekannt aus „Der Pianist“, „Cashback“)\nin der Rolle der Kate Greene\nElaine Cassidy (bekannt aus „Felicia, mein Engel“, „The Others“)\nin der Rolle der Rachel\nSophie Simnett (bekannt aus „Twist“, „Daybreak“)\nin der Rolle der Teenage Kate\n\n\n*Die Handlung und Szenen von „Gib den Jungs zwei Küsse“*\nBasierend auf einer wahren Geschichte: Singe (Rafe Spall) und Kate (Emilia Fox) sind ein Traumpaar wie es im Buche steht. Seit ihrer Jugend sind die beiden zusammen und lieben sich wie am ersten Tag. Mittlerweile haben sie eine Familie gegründet. Gemeinsam mit ihren beiden Söhnen Reef (William Stagg) und Finn (Matthew Stagg) scheint das Glück perfekt. Doch dann kommt plötzlich die Hiobsbotschaft: Bei Kate wird Brustkrebs im Endstadium festgestellt. Die Diagnose gleicht einem Todesurteil, da die Krankheit zu weit fortgeschritten ist, um sie zu bekämpfen. Trotz dem nahenden Ende bleibt Kate vor allem eines: eine liebende Mutter und Ehefrau. Sie setzt alles daran, auch nach ihrem Tod für ihre Familie da zu sein. In ihren letzten Tagen verfasst Kate eine Liste mit Gedanken und Ratschlägen für ihren Ehemann. Ihr Vermächtnis soll Singe dabei helfen, die gemeinsamen Söhne großzuziehen und sie auf die Höhen und Tiefen des Lebens vorzubereiten.\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt das bewegende Drama „Gib den Jungs zwei Küsse“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:55.426Z",
      "thumbnail": "https://i.ytimg.com/vi/BTkIzdZ1tks/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCojC1eGNL9XrRm9wheE0qsBjk4SA",
      "duration": 6096,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:33:55.642Z"
}