{
  "imdbId": "youtube-pfRpkNx2Qoc",
  "title": "Prince Yeonsan ( Yeonsan-gun )(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pfRpkNx2Qoc",
      "title": "Prince Yeonsan ( Yeonsan-gun )(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00700\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00700\n\n영화글 : https://www.kmdb.or.kr/story/10/5443\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 신영균(연산군),최은희(신비),신성일(진성대군),김동원(성종),주증녀(폐비윤씨),한은진(신씨),허장강(제안대군),김진규(박원종),도금봉(장녹수),전옥(인수대비),최남현(박승학 참판),김희갑(김자원),이예춘(임사홍),남궁원(황윤헌),황정순(계비윤씨),이민자,윤인자,유계선,이경희,김신재,김혜정,이빈화,김삼화,전영주,이향자,임예심,주선태,구봉서,양훈,최삼,김현주,김효심,박미영,강성재\n\n줄거리 : 연산군의 파란만장한 일대기를 그린 1960년대 초의 대표적인 사극. 성종(김동원)의 아들 연산군(신영균)은 어느 날 자신이 폐비 윤씨(주증녀)의 아들임을 알게 되고 큰 충격을 받는다. 임금으로 즉위한 후 그는 폐비 윤씨의 신원을 복원하고자 하나 인수대비(전옥)를 비롯한 신하들의 반대에 부딪히고 성격이 급격하게 비뚤어진다. 그는 더 없이 거칠어지고 술과 여자에 빠져 끔찍한 행패를 부린다. 꿈에서 억울하게 죽은 생모 윤씨의 모습을 본 그의 마음은 더욱 혼란으로 가득 찬다. 그러던 중 외조모(한은진)를 통해 윤씨의 억울한 사정을 듣고 윤씨의 피가 묻은 적삼을 받은 연산군은 당시 폐비와 관련된 모든 사람들에게 피의 복수를 한다. 화려한 의상과 세트, 연산군의 뒤틀어진 심리를 묘사하기 위한 과장된 카메라 앵글, 신영균의 과장된 연기가 칼라 시네마스코프에 걸 맞는 장대한 스펙터클을 제공해준다.\n\nCasts : Shin Young-Kyun, Do Keum-Bong, Kim Hee-Gap, Heo Jang-Kang\n\nSYNOPSIS : This is a typical historical drama from the early 1960s on Yeonsangun (Shin Young-kyun), a king who had a life of extreme ups and downs. He is a son of King Seongjong (Kim Dong-won) and in great shock as he finds out that he is the son of deposed queen Yoon (Ju Jeung-ryu). As soon as he ascends the throne, Yeonsangun tries to restore the queen title of his mother but faces opposition from his grandmother, Queen Dowager Insu (Jeon-Ok), and her courtiers, which turns him into a violent king. He becomes rougher than ever and loses his head over drinking and women. One night he meets his mother who had died under false accusation in his dream and he becomes even more confused. Meanwhile, he hears the story of his mother from his grandmother (Han Eun-jin) who gives him the bloody summer jacket the deposed queen wore on the day she was executed. Yeonsangun begins his bloody revenge on all those related to the deposing and execution of Queen Yoon. The film is surely spectacular with fancy dresses and set, exaggerated camera angles used to describe the twisted psychology of Yeonsangun, and actor Shin Young-kyun's over-the-top acting.",
      "id": "pfRpkNx2Qoc",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:12.481Z"
}