{
  "movieId": "youtube-1eJycz6VL00",
  "title": "West of the Badlands (1940 American Western film) directed by Joseph Kane",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1eJycz6VL00",
      "id": "1eJycz6VL00",
      "title": "West of the Badlands (1940 American Western film) directed by Joseph Kane",
      "description": "From New York's wanted list to the West's most feared outlaws – one doctor’s journey for justice.\nOn the run from the law, Eastern doctor Steve Kells heads West and is captured by the ruthless Border Legion. Pretending to join their ranks, he secretly plots their downfall, all while proving his innocence and finding redemption through his medical skills.\n\nOriginal title: The Border Legion (1940) AKA: West of the Badlands\n\n\nBlack & White version: https://youtu.be/55FcSUkrAPw\n\n\nDirected by: Joseph Kane\nWriters: Zane Grey, Olive Cooper, Louis Stevens\nCast: Roy Rogers, George \"Gabby\" Hayes, Carol Hugues, Joe Sawyer\nGenre: Colorized, Western, Drama, Musical\n\n\n00:00 Full Colorized Movie (with subtitles)\n02:20 Encounter between a traveler and a promoter leads to a confrontation over cheating in a poker game.\n09:40 Intrigue unfolds in a Wild West town as a mysterious operation takes place and a familiar face is recognized.\n15:19 A man named Steve is willing to sacrifice himself to protect someone, while dealing with financial matters involving gold nuggets.\n20:04 A doctor warns Jim Gulden of potential gangrene in his neglected leg, offering to save his life.\n23:44 Conflict arises over ownership of mining shares in Alder Creek, leading to a power struggle among partners.\n31:33  Sheriff faces challenges in pursuing criminals, criticized by companions for lack of action and planning.\n35:22 Undercover plan to capture the leader of a notorious gang in a deserted cow outfit.\n39:35 A man named Oscar McGooney pretends to be a Montmorency to impress a woman while discussing a gold train robbery.\n46:54 Deception leads to a planned attack on a wagon train loaded with men and guns.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:04.889Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/1eJycz6VL00/maxresdefault.webp",
      "duration": 3188,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:05.029Z"
}