{
  "imdbId": "youtube-u7DZTLtxN3M",
  "title": "난중일기(1977) / A War Diary (Nanjung-ilgi)",
  "year": 1977,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u7DZTLtxN3M",
      "title": "난중일기(1977) / A War Diary (Nanjung-ilgi)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03167\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03167\n\n감독(Director) : 장일호(Jang Il-ho)\n출연 : 김진규 , 장동휘 , 황해 , 정애란 , 태현실\n\n줄거리 : 전라좌수사 이순신은 왜침을 대비해서 거북선 제작에 열중하는데, 임진년 4월 13일 부산진,동래,양산,울진이 함락되자 출전하여 옥포대전과 한산대전에서 승리를 거둔다. 임진년 다음해 공의 나이 49세가 되던 해 삼도 수군통제사가 되어 진을 한산도로 옮기고 군비확장에 혼신의 힘을 기울이나 당파분쟁과 원균의 모략으로 투옥된다. 정유년 7월 5일 왜적이 재침하자 백의종군으로 석방된 공은 동 9월 12척의 전선을 이끌고 대승리를 거두며, 임진란을 일으킨 도요도미 히데 요시가 죽자 공은 노량해전에서 최후의 일전을 벌인다.\n\nCasts :Kim Jin-kyu , Jang Dong-hee , Hwang Hae , Jeong Ae-ran , Tae Hyun-sil  \nSYNOPSIS : Preparing for the Japanese attack, Admiral Lee Sun-shin concentrated on building the Turtle Boats. In the year of Imjin, April 13th, as Busan, Dongrae, Yangsan, and Wuljin all fall to the enemy, Admiral Lee goes to war and is victorious at the great battles of Okpo and Hansan ocean. The next year, at the age of 49, Admiral Lee is appointed Commander of the entire navy. He moves his military camp over to Hansan and puts all his might into expanding the army. Due to disputes among political parties and Won-gyun's tricks, Admiral Lee is thrown in jail. In the year of Jeongyu, July 5th, the Japanese army attacks again. Admiral Lee is released from prison and serves in the war as a commoner. In September, he takes 13 boats and makes a sweeping victory. Toyotomi Hideyoshi, who began the Imjin invasion, is killed. Admiral Lee has his greatest fight at the No-ryang strait.",
      "id": "u7DZTLtxN3M",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:21:28.163Z"
}