{
  "imdbId": "youtube-dvTTt7d8JXM",
  "title": "6 Non Smokers | Full Comedy Movie | Bridgetta Tomarchio",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dvTTt7d8JXM",
      "title": "6 Non Smokers | Full Comedy Movie | Bridgetta Tomarchio",
      "description": "Nobel winner Dr. Henry Caldwell, the world's foremost mediator, and his brilliant associate, Dr. Regina Powell, have resolved conflicts ranging from family to international disputes. His latest achievement, The Caldwell Method, is capable of resolving any conflict in 100 days using techniques and strategies he has assembled. His main rival, Dr. John-Michael Robertson, eager to contest Henry’s declaration, crashes the Method’s unveiling. John-Michael had conducted a study on Non-Familial Domestic Disputes, known as \"\"The Roommate Study,\"\" during which he encountered six roommates, known as the “6 Nonsmokers,” who cost him students, grants, book deals, and nearly his career. John-Michael’s challenge to Henry is to put the Method up against the 6 Nonsmokers and see which one comes out intact. Henry and Regina agree to John-Michael's challenge. To win, they will need to sort out six people whose only commonality is that none of them smoke: Lori, an anal retentive IRS bean counter; Stephan, a singer-songwriter with only one song; lbercto, an ambassador for an unknown country; Evelyn, an entrepreneurial publisher turned dominatrix; Vivian, an actress who can perform anywhere but on a stage; and Coleman, a borderline mental case with delusions of working for the CIA. Despite putting the roommates through dozens of evaluations and exercises, they show no sign of improvement. Henry’s unwillingness to stray from his method causes him to lose his grip. To save the day and preserve their reputations, it's up to Regina to figure out a way to make these six misfits get along.\n2016.  Stars: Bridgetta Tomarchio, Greg Thompson, Jim Murphy\n**Under non-exclusive license from Leomark Studios.  All rights reserved**\n\n*SUBSCRIBE to MOVIE CENTRAL!* - https://bit.ly/3mRDJox\nWelcome to Movie Central. Subscribe and watch more Awesome Movies! \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "dvTTt7d8JXM",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:44:21.109Z"
}