{
  "imdbId": "youtube-5ZwKV-ST7NE",
  "title": "The Vampire Bat (1933, Horror) Lionel Atwill, Fay Wray | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5ZwKV-ST7NE",
      "title": "The Vampire Bat (1933, Horror) Lionel Atwill, Fay Wray | Full Movie",
      "description": "These are the TALONS of The Vampire Bat\nA German village is stricken by a series of murders that appear to be the work of vampires.\n\nOriginal title: The Vampire Bat (1933) \n\nBlack & White version: https://youtu.be/IctQwO6YYpQ\n\nDirector: Frank R. Strayer \nWriter: Edward T. Lowe Jr. \nStars: Lionel Atwill, Fay Wray, Melvyn Douglas\nGenres: Colorized, Drama, Horror, Mystery, Romance, Sci-Fi\n\n\n00:00 Full Movie (with subtitles)\n02:46 Investigation into mysterious deaths in a village leads to debates on vampires and bats.\n07:32 Mysterious events unfold in a village, with talk of vampires and giant bats causing fear and suspicion.\n13:18 Strange murders in a village spark fear of a vampire. Suspicion falls on a man with a peculiar fascination with bats.\n20:53 Discussion on potential human vampire existence and suspicion towards Herman in a village.\n26:09 Deaths spark vampire suspicions in a town. Doctor investigates while a manhunt for a missing person commences.\n31:22 Mysterious events unfold in a village, leading to suspicion of a resident being involved in recent deaths.\n43:22 Mystery unfolds in a village as suspicion falls on Herman Gleib for the murders, leading to fear and paranoia.\n48:54 Murders in a village lead to suspicions of a vampire, but a detective investigates further to uncover the truth.\n57:52 A doctor creates life from tissue, leading to murder and chaos in a small town.\n\n\n@CultCinemaClassics",
      "id": "5ZwKV-ST7NE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:43:39.668Z"
}