{
  "imdbId": "youtube--0QdNpniOVE",
  "title": "The Moon Strikes Back | Impact | HD Sci-Fi Disaster Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-0QdNpniOVE",
      "id": "-0QdNpniOVE",
      "title": "The Moon Strikes Back | Impact | HD Sci-Fi Disaster Movie",
      "description": "The Moon Strikes Back | Impact | HD Sci-Fi Disaster Movie - After two scientists realize a rogue asteroid has struck the moon putting it on a path towards the Earth, they must put their differences aside and stop the collision or all of mankind could perish.\n\nWatch Impact, a full sci-fi action movie where the fate of the world hangs by a thread. After discovering that a rogue asteroid has struck the moon and set it on a collision course with Earth, two scientists must put aside their differences to prevent total destruction. Perfect for fans of disaster movies, full free action films, sci-fi thrillers, high-stakes survival adventures, and planetary catastrophe stories, Impact delivers intense tension, explosive action, and a gripping race against time to save all of mankind.\n\nStars: David James Elliott, Natasha Henstridge, Benjamin Sadler\n*Licensed from Tesera. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-26T23:59:26.737Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/-0QdNpniOVE/maxresdefault.webp",
      "duration": 11255,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:26.788Z"
}