{
  "imdbId": "youtube-_cDA5QhWoR8",
  "title": "When Acacias Bloom ( Acacia Kkochi Ppil Ttae )(1962)",
  "year": 1962,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_cDA5QhWoR8",
      "id": "_cDA5QhWoR8",
      "title": "When Acacias Bloom ( Acacia Kkochi Ppil Ttae )(1962)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00747\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00747\n\n감독(Director) : 조긍하(Cho Keung-Ha)\n출연 : 신영균,김혜정,김승호,박노식,장동휘,강미애,김동원,남춘역,김웅,장훈,추석양,최성호,채랑,김칠성,양일민,최삼,이업동,백송,이예민\n\n줄거리 : 아카시아 꽃이 필 때면 해마다 무덤을 찾는 한 여인(김혜정)이 있었다. 그녀는 연합군 첩보원이었다. 1942년 일본이 중국 대륙을 거의 짓밟고 있을 무렵, 양자강 유역,  왜경에게 쫓기던 독립군 청년(신영균)이 그녀의 집으로 피신하게 되었다. 그녀는 그에게 막대한 돈을 지불하고 중경까지 가는 길 안내를 부탁한다. 그러나 목적지에 도착했을 때 청년은 중요한 기밀문서를 잃어버렸다. 그에게는 총살형이 선고되고 그사이 그와 정이 든 그녀가 백방으로 손을 썼으나 형 집행정지 명령이 떨어졌을 때는 이미 그의 총살이 집행된 다음이었다. 그 무렵에도 아카시아 꽃은 만발해 있었다.\n\nCasts : Shin Young-Kyun, Kim Hye-Jeong, Jang Dong-Hwi, Nam Chun-Yeok\n\nSYNOPSIS : A woman visits a grave every year when acacias bloom. She was once a spy working for the allies. One day a fighter of the Korean Independence Army broke into her house to shake off the Japanese police chasing him. He asked her to be his guide, offering a huge sum of money. But when he got to his destination, he found out that he had lost an important secret document. This led him to a death by a firing squad. She did everything she can to save him, but it was too late when she finally obtained permission to stop the execution. The man had been already executed when acacias were in full bloom.",
      "addedAt": "2025-12-26T00:23:48.619Z",
      "thumbnail": "https://i.ytimg.com/vi/_cDA5QhWoR8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDkhJzupEG28K9zy-z4abUSfnVRcA",
      "duration": 5929,
      "language": "ko",
      "year": 1962,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:48.700Z"
}