{
  "movieId": "youtube-peDN9L2_Gbc",
  "title": "Made for Each Other 1939 (Drama, Romance) Carole Lombard, James Stewart, Charles Coburn",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=peDN9L2_Gbc",
      "id": "peDN9L2_Gbc",
      "title": "Made for Each Other 1939 (Drama, Romance) Carole Lombard, James Stewart, Charles Coburn",
      "description": "The whole town is talking about this grand down-to-earth love drama! \nYoung lawyer John Mason hastily marries Jane, challenges of skeptical in-laws, financial struggles, and unexpected tragedies test their love and resolve amidst life's unpredictability.\n\nColorized version https://youtu.be/NiYJliPNlhQ\n\nOriginal title: Made for Each Other (1939)\nThis film is available with English, Italian & German audio options, and subtitled in many languages.\n\n\nDirector: John Cromwell\nWriters: Jo Swerling, Rose Franken \nStars: Carole Lombard, James Stewart, Charles Coburn \nGenre: Classics, Comedy, Drama, Romance\n\n\n00:00 Full Movie (with dubbed audio & subtitles)\n02:38 Unexpected marriage leads to challenges and surprises for Mr. Mason and his new wife, Jane.\n09:56 A newlywed couple faces unexpected challenges and surprises as they embark on a journey together.\n16:42 Struggles with household preparations and servant issues before a dinner party lead to tension and ultimatums.\n23:12 A dinner conversation leads to the announcement of a new partner in a law firm.\n31:09 A courtroom drama unfolds as a couple navigates the challenges of parenthood and household dynamics.\n42:01 Struggling husband seeks recognition and advancement at work, encouraged by his supportive wife.\n46:58 A couple faces financial challenges and sacrifices in their professional lives, leading to a heartfelt conversation about their relationship.\n59:46 A woman feels unappreciated at home on New Year's Eve, leading to misunderstandings and family tension.\n1:05:25 Family struggles and medical emergency test a young couple's marriage in a classic romantic drama.\n1:14:25 Desperate father seeks help from Judge Doolittle to save his dying baby with pneumonia.\n1:20:42 A couple faces challenges in their relationship, family, and career, with a miraculous event changing their lives.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:23.898Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/peDN9L2_Gbc/maxresdefault.webp?v=66865dc6",
      "duration": 5570,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:24.008Z"
}