{
  "imdbId": "youtube-G3zN9cP91cw",
  "title": "Detour (1945, Film-Noir) directed by Edgar G. Ulmer | Starring Ann Savage & Tom Neal",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G3zN9cP91cw",
      "title": "Detour (1945, Film-Noir) directed by Edgar G. Ulmer | Starring Ann Savage & Tom Neal",
      "description": "He went searching for love... but Fate forced a DETOUR to Revelry... Violence... Mystery!\nChance events trap  hitchhiking nightclub pianist Al Roberts in a tightening net of film noir trouble, including deception, blackmail and death.\n\nOriginal title: Detour (1945)\nThis movie has dubbed Italian & Spanish audio, and subtitled in many more languages.\n\nBlack & White version: https://youtu.be/rteEkq6qz1w\n\n\nDirector: Edgar G. Ulmer\nWriters: Martin Goldsmith \nGenre: Colorized, Film Noir, Crime, Drama, Mystery & Suspense\nBudget: $30,000\n\nMain Cast: \nTom Neal\nAnn Savage\nClaudia Drake\nEdmund MacDonald\nTim Ryan\nEsther Howard\nPat Gleason\n\n\n00:00 Full colorized movie (with audio & subtitles).\n02:01 Encounter between two strangers on a journey, one seeking company and conversation.\n08:25 A couple's relationship is tested when one decides to pursue a career in Hollywood, causing tension and uncertainty.\n15:51 Unpredictable encounters while hitchhiking lead to cautious conversations and shared experiences on a long journey.\n20:56 A man recounts his misfortune in Miami and plans a lucrative return, driving through the night to reunite with his loved one.\n28:41 Desperate for safety, the protagonist assumes a new identity to evade suspicion and reach his destination.\n35:46 A man named Haskell encounters a woman named Vera on the road, leading to a mysterious and tense situation.\n39:48 Partners plan to sell a car under a new name to avoid being traced, sharing profits equally.\n45:33 Reflections on fate and mortality lead to boredom and anticipation of future plans.\n51:47 Couple negotiates car sale, reaching a compromise after haggling over price and inspection.\n56:49 A scheme involving an old man's death and a murder charge threat unfolds during a card game.\n1:01:40 Intense confrontation between Vera and Roberts escalates, leading to threats and a struggle over the phone.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "G3zN9cP91cw",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:35:41.233Z"
}