{
  "movieId": "youtube-6G7fP1PdHg8",
  "title": "The Idle Rich (MGM, 1929) LEILA HYAMS🍕 CONRAD NAGEL🍕 PRE-CODE ROM-COM",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6G7fP1PdHg8",
      "id": "6G7fP1PdHg8",
      "title": "The Idle Rich (MGM, 1929) LEILA HYAMS🍕 CONRAD NAGEL🍕 PRE-CODE ROM-COM",
      "description": "It's Friday @PizzaFLIX \nStars: Leila Hyams, Conrad Nagel, Bessie Love\nDirector: William C. de Mille\n\nReleased by Metro-Goldwyn-Mayer and directed by William C. de Mille, this early sound-era romantic comedy explores class clashes and love across social divides. Starring Conrad Nagel as a wealthy, soft-spoken businessman who falls for his secretary, played by Leila Hyams, the story explores the culture shock that ensues when he attempts to integrate into her working-class family.\n\nThe film cleverly mixes wit and warmth as the idealistic couple confronts everything from dinner table debates to deep-rooted resentments between economic worlds. Bessie Love adds charm and comedic spark as Hyams’ spirited sister, while character actor Edward J. Nugent rounds out the ensemble with energy and timing.\n\nWith dialogue-driven scenes and domestic settings, the film highlights the novelty of early talking pictures while capturing the shifting attitudes of post–Roaring Twenties America. Released just as the Great Depression began, the story takes on added resonance as it questions privilege, practicality, and whether love can really bridge the wealth gap.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nA brilliant, socially aware romantic comedy, this pre-Code gem is a glimpse into a changing era, where money talks, but love might have the final word.\n\n#TheIdleRich #ConradNagel #LeilaHyams #BessieLove #WilliamCdeMille #MGM #PreCodeHollywood #EarlyTalkies #ClassicCinema #RomanticComedy #SocialClassCinema",
      "addedAt": "2025-12-24T01:03:46.935Z",
      "thumbnail": "https://i.ytimg.com/vi/6G7fP1PdHg8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAlPFXJrxKemTQ8pyhG--IaTC8tHQ",
      "duration": 4861,
      "language": "en",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:46.935Z"
}