{
  "imdbId": "youtube-l6IXWBAV4sM",
  "title": "카인의 후예(1968) / Descendants of Cain(Cain-ui Huye) (1968)",
  "year": 1968,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=l6IXWBAV4sM",
      "title": "카인의 후예(1968) / Descendants of Cain(Cain-ui Huye) (1968)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01702\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01702\n\n영화글 : https://www.kmdb.or.kr/story/127/4105\n\n감독(Director) : 유현목(Yu Hyun-mok)\n출연 : 김진규 , 문희 , 박노식 , 장동휘 , 정민\n줄거리 :  해방 이듬해의 평안도 양지골. 해방 후 처음맞는 3.1절 경축잔치로 흥청대는 마을에 보안소장(장동휘)이 이끄는 조선 노동당 간부들이 도착한다. 이들 중에는 6년 전 아내 오작녀(문희)를 두고 마을을 떠났다가 순안 민청위원장이 된 최도 끼어 있다. 이들은 존경받아온 지주의 아들 박훈(김진규)이 세운 학당의 현판을 떼고 토지 개혁에 착수한다. 농민위원장이 살해당하자 노동당은 박훈이 살인 혐의자에게 반동사상이 담긴 책을 빌려주었다며 그에게 살인 사주 혐의를 뒤집어씌운다. 박훈 집안의 소작농들을 관리하던 마름 도섭 영감(박노식)은 시대가 바뀌자 노동당원이 되어 숙청 사업의 선봉에 선다. 도섭 영감의 딸 오작녀는 아버지와 달리 박훈에게 정성과 애정을 기울이지만, 그 때문에 아버지에게 심하게 맞고 몸져 눕는다. 인민재판이 있던 날, 노동당 간부와 마을 사람들은 박훈의 작은 아버지 집을 비롯한 자주들의 재산을 몰수한다. 박훈의 집에 들이닥친 보안소장이 박훈에게 유부녀를 농락한 죄를 뒤집어씌우자 오작녀는 박훈을 두둔한다. 박훈은 사촌동생 혁의 제안대로 남한으로 내려가기로 결심한다. 보안소장의 손에 아버지를 잃은 혁은 박훈에게 떠나기 전 생명의 은인인 도섭 영감이 더 이상 미친 짓을 벌이지 못하도록 자기 손으로 죽이겠다고 말한다. 박훈은 자신이 이 일을 처리하기로 결심한다. 으슥한 산속에서 박훈과 도섭 영감은 난투극을 벌인다. 난투극 끝에 정신을 차린 도섭 영감은 박훈에게 오작녀를 데리고 떠나라고 부탁한다.\n\nCasts : Kim Jin-kyu , Moon Hee , Park Nou-sik , Jang Dong-hee , Jeong Min\n\nSYNOPSIS : Shortly after Korea gained independence from Japan (1945), North Koreans decide to extort civilians' property in the name of revolutionalizing its land and settle class struggles for proletariats. The film depicts an anti North-Korean concept, detailing the country's situation after the independence.",
      "id": "l6IXWBAV4sM",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:18.512Z"
}