{
  "movieId": "youtube-Pewfjh5G4Ys",
  "title": "격퇴(우리는 이렇게 싸웠다)(1956) / Beat back (Gyeogtoe)",
  "year": 1956,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Pewfjh5G4Ys",
      "id": "Pewfjh5G4Ys",
      "title": "격퇴(우리는 이렇게 싸웠다)(1956) / Beat back (Gyeogtoe)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00292\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00292\n\n감독(Director): 이강천(Lee Kang-cheon) \n출연(Cast): 황남(Hwang Nam), 박노식(Park Nou-sik), 최봉(Choe Bong), 허장강(Heo Chang-kang), 독고성(Dok Go-sung) \n\n(줄거리) 김만술 대위의 6.25 참전 실화를 영화화한 작품. 한국군은 베티고지를 지키기 위해 김만술 상사(황남)를 소대장으로 하여 2개 분대를 보낸다. 2개 분대로는 고지 사수가 어려움에도 불구하고 김만술 소대장과 선임하사 김무철 상사(최봉)을 포함한 소대원들은 고지를 지키기 위해 전력을 다한다. 김만술 상사는 포로로 잡힌 부하를 홀로 구출하러 가는 등 부하들을 지키기 위해 목숨을 아끼지 않는다. 그럼에도 많은 대원들이 죽어가고 적들이 계속 압박을 해오는 가운데 육박전을 벌여 어렵사리 고지를 지켜낸다. 한편 통신병인 이강노(윤일봉) 하사는 고향에서 아내가 보내온 편지를 읽으며 아내와 딸을 그리워한다. 아내의 편지에 용기를 얻은 이강노 하사의 목숨을 건 노력으로 본대와 통신이 연결되어 포사격 지원을 받아 대승리를 거둔다. 밤새 전투에서 죽어간 전우를 뒤로하고 얼마 남지 않은 부대원들이 모인 가운데 김만술 소대장은 눈물을 머금고 적을 “산산이 부셔 송두리째 없애버리자”며 다시금 전의를 불태운다.\n\n(Synopsis) It is a documentary about Major Kim Man-il's service during the Korean War. The Korean forces dispatch two military units to defend the Baeti Heights led by Kim. Although it is hard to do so, Kim and his senior, Kim Mu-cheol (Choe Bong) and other soldiers do their best. Kim even risks his life to save his juniors, but many die as the enemy forces approach. Meanwhile Lee Kang-no (Yun Il-bong), a communications officer, reads a letter from his wife - missing her and his daughter. Encouraged by it, Lee risks his life to make successful communication between his military unit and the headquarters. His unit wins. Commander Kim Man-su gathers a small number of his subordinates because many had died, and encourages them to do their best to ward the enemy off.",
      "addedAt": "2025-12-26T00:22:53.710Z",
      "thumbnail": "https://i.ytimg.com/vi/Pewfjh5G4Ys/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBIhru26TYH4pO4cJPIDwznyWAF_A",
      "duration": 5056,
      "language": "ko",
      "year": 1956,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:53.731Z"
}