{
  "movieId": "youtube-a-zJn-tk1nU",
  "title": "Marauders -  mit Bruce Willis - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a-zJn-tk1nU",
      "id": "a-zJn-tk1nU",
      "title": "Marauders -  mit Bruce Willis - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt “Marauders” online bei #Moviedome sehen. Ein außergewöhnlicher Actionthriller zeigt den augenscheinlich perfekten Banküberfall. Mit Hollywoods Top-Star Bruce Willis in einer der Hauptrollen! Ganze Filme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nJetzt Marauders und den Trailer als ganzen Film in deutsch sehen\nMarauders I Trailer I 2016 I Alle Filminfos\n\n“Marauders” ist ein amerikanischer Action-Krimi aus dem Jahr 2016, der von Steven C. Miller inszeniert und von Michael Cody und Chris Sivertson geschrieben wurde. Die Rollen wurden unter anderem mit den Filmstars Christopher Meloni, Bruce Willis, Dave Bautista und Adrian Grenier besetzt. Der Film wurde am 1. Juli 2016 von Lionsgate Premiere veröffentlicht.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: http://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme: www.moviedome.de\n\n#Moviedome #marauders #BruceWillis\n\nFilmlänge: 1:47:01\nKinostart: 2016\n\nWer sind die Schauspieler?\nDie Darsteller werden unter anderem von folgenden Schauspielern verkörpert: \n\nBruce Willis (bekannt aus Stirb langsam, Unbreakable, Pulp Fiction) in der Rolle des Jeffrey Hubert\nChristopher Meloni (bekannt aus True Blood, Bound - gefesselt, Happy) in der Rolle des Special Agent Jonathan Montgomery\nDave Bautista in der Rolle des Agent Stockwell\nAdrian Grenier in der Rolle des Special Agent Wells\nLydia Hull in der Rolle der Special Agent Lydia Chase\nJohnathon Schaech in der Rolle des Detective Mims\nTara Holt in der Rolle der Reporterin Vanessa Adler\nChristopher Rob Bowen in der Rolle des Bradley Teegan\nTyler Jon Olson in der Rolle des Zach Derohan\nDanny A. Abeckaser in der Rolle des Detective Antonio Leon\nTexas Battle in der Rolle des Ranger TJ Jackson\n\n\nDie Handlung von “Marauders”\nFBI-Agent Jonathan Montgomery (Christopher Meloni) beschäftigt sich zusammen mit seinen Kollegen Stockwell (Dave Bautista) und Wells (Adrian Grenier) mit einem Raubmord in einer Bank, der von einer Truppe maskierter Elite-Bankräuber durchgeführt wurde. Diese konnten dabei Millionen Dollar in Bar stehlen und hinterließen dabei einen toten Bankmanager.\nIm Laufe ihrer Ermittlungen verdichten sich die Anzeichen, dass der Eigentümer der Bank Jeffrey Hubert (Bruce Willis) und seine Klienten in Korruption verstrickt sind.\nDabei ist nichts, wie es zu Beginn scheint, denn die FBI-Agenten stehen vor einem Rätsel.\nEs stellt sich bald heraus, dass sie einer geheimen Verschwörung auf der Spur sind, als ein neuer Banküberfall gemeldet wird. Der Eigentümer der Bank versucht sich, bedeckt zu halten und hat offensichtlich etwas zu verbergen.\nUm den Fall zu lösen, muss das FBI eine Verflechtung aus Intrigen und Korruption auflösen. Sie müssen bis an ihr Äußerstes gehen...\n\n\nDie Synchronisation \nDie deutsche Synchronisation der Verfilmung wurde durch die Firma DMT - Digital Media Technologie GmbH, Hamburg erstellt\n\nBruce Willis; Sprecher: Manfred Lehmann\nChristopher Meloni; Sprecher: Frank Röth\nDave Bautista; Sprecher: Oliver Stritzel\nLydia Hull; Sprecher: Jannika Jira\nTyler Jon Olson; Sprecher: Sascha Draeger\nJohnathon Schaech; Sprecher: Achim Buch\nTexas Battle; Sprecher: Tobias Schmidt\nChristopher Rob Bowen; Sprecher: Martin Sabel\nTara Holt; Sprecher: Kristina von Weltzien\nAdrian Grenier; Sprecher: Oliver Böttcher",
      "addedAt": "2025-12-26T00:36:24.576Z",
      "thumbnail": "https://i.ytimg.com/vi/a-zJn-tk1nU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDHtIEJjbQj_W6CTo5w2607byU_sg",
      "duration": 6409,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:36:24.667Z"
}