{
  "imdbId": "youtube-3Du_Mk5-SKw",
  "title": "Motor Patrol (1950, Crime) Don Castle, Jane Nigh, Reed Hadley | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3Du_Mk5-SKw",
      "id": "3Du_Mk5-SKw",
      "title": "Motor Patrol (1950, Crime) Don Castle, Jane Nigh, Reed Hadley | Movie",
      "description": "HIGHWAY HEROES! ROARING INTO ACTION AT BULLET SPEED! \nA police officer masquerades as a criminal to get information on a gang of car thieves.\n\nColorized version https://youtu.be/V3ingImxBx4\n\n\nOriginal title: Motor Patrol (1950) AKA: Highway Patrol\nThis film is subtitled in many languages.  Click ⚙️ for more options\n\nDirector: Sam Newfield\nWriters: Maurice Tombragel, Orville H. Hampton\nStars: Don Castle, Jane Nigh, Reed Hadley\nGenres: Comedy, Crime, Drama, Thriller\n\n\n00:00 Full Movie (with subtitles) \n06:25 Murder investigation unfolds after a hit-and-run accident involving a couple returning from a fashion conference.\n08:13 Investigation of the death of a man named Thompson reveals potential foul play and leads to questioning of his colleagues and acquaintances.\n14:19 Characters discuss a recent crime, personal relationships, and work-related issues.\n16:39 A series of events unfold after a hit-and-run incident, leading to a negotiation for the return of a stolen coin.\n20:11 A dispute over money, threats, and a potential divorce.\n30:26 Murder investigation and car theft unfold as officers work to solve the case.\n32:56 Undercover investigation of car theft ring led by Simmons and Miller, involving Haynes and a police officer.\n40:48 Investigation into a murder case involving Hank Simmons and United Garage leads to potential business opportunities and personal relationships.\n44:50 A police investigation uncovers a car theft and murder scheme involving multiple suspects and stolen vehicles.\n49:31 Undercover operation to catch a criminal involving stolen cars and a risky deal.\n58:04 A crime drama unfolds as Hank receives a call from Chicago and plans to meet Bud Haynes for a heist involving motorcycles.\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:39:01.295Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/3Du_Mk5-SKw/maxresdefault.webp?v=6579452b",
      "duration": 3941,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:01.380Z"
}