{
  "imdbId": "youtube-b_FTg0BSMvE",
  "title": "Sisters of Death 1976 | Mystery, Thriller | Claudia Jennings, Cheri Howell | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b_FTg0BSMvE",
      "id": "b_FTg0BSMvE",
      "title": "Sisters of Death 1976 | Mystery, Thriller | Claudia Jennings, Cheri Howell | Full Movie",
      "description": "During an all-girl secret society initiation, one of the new members is killed playing Russian Roulette. Many years later the survivors are invited for a reunion to a lavish estate, which turns out to be owned by the crazed father of the girl who died.\n\nDirector: Joe Mazzuca\nWriters: Peter Arnold, Elwyn Richards  \n\nMain cast:\nArthur Franz – Edmond Clybourn\nClaudia Jennings – Judy Peake\nSherry Boucher – Diana Holcomb\nPaul Carr – Mark Roberson\nJoe E. Tata – Joe\nCheri Howell – Sylvia Woodworth\nSherry Alberoni – Frances \"Francie\" Tomalillo\nElizabeth Bergen – Liz Clybourn\n\nGenres: Classics, Mystery, Thriller \nRelease date: April 18, 1976 (USA)\nFilming location: San Luis Obispo County, California\n\n\n00:00 Full Movie with subtitles\n00:30 Sisters Judy and Liz undergo a tense initiation into the secret society, setting the stage for lifelong vows and hidden dangers.\n09:10 Penny senses doom as the sisters receive mysterious invitations to a reunion, foreshadowing the darkness to come.\n21:19 Joe and Mark deliver the women to a remote hacienda, where the group realizes they are isolated and something is amiss.\n37:27 Mr. Clybourn confronts the sisters, accusing one of them of murdering his daughter Elizabeth during their initiation.\n49:19 The group discovers the electrified fence and the first shocking death, confirming they are trapped with a killer.\n1:03:02 Tensions rise as the sisters and their companions attempt escape plans, but paranoia and fear escalate with each failed attempt.\n1:13:36 Judy and the survivors uncover the true power source of the deadly fence, leading to a desperate final confrontation.\n1:19:04 Sylvia reveals her guilt and the tragic truth behind Elizabeth’s death, culminating in a deadly showdown and the survivors’ escape.\n\n\nThe PG rating in 1976 reflects its tame violence by modern standards.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:31:00.252Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/b_FTg0BSMvE/maxresdefault.webp",
      "duration": 5235,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:31:00.414Z"
}