{
  "imdbId": "youtube-xW-C9h8dkHE",
  "title": "Eine Prinzessin zu Weihnachten - romantischer Weihnachtsfilm - Ganzer Weihnachtsfilm bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xW-C9h8dkHE",
      "title": "Eine Prinzessin zu Weihnachten - romantischer Weihnachtsfilm - Ganzer Weihnachtsfilm bei Moviedome",
      "description": "*GANZER FILM - Dieser bezaubernde Weihnachtsfilm versüßt euch mit einer wundervollen Liebesgeschichte die Weihnachtszeit*\n\nDen Spielfilm „Eine Prinzessin zu Weihnachten“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*Die Handlung von „Eine Prinzessin zu Weihnachten“*\nJules Daly darf den Traum aller Mädchen Wirklichkeit werden lassen, als sie zusammen mit ihrer Nichte Maddie und ihrem Neffen Milo über Weihnachten der Einladung eines entfernten Verwandten folgt, das Fest auf einem europäischen Schloss zu verbringen. Denn völlig unerwartet verliebt sie sich in Ashton, den Prinz von Castlebury und sieht sich dem schönsten Weihnachtsgeschenk gegenüber.\n\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Eine Prinzessin zu Weihnachten“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Weihnachtsfilm #GanzerFilm #Weihnachtsfilm #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: A Princess for Christmas\nFilmlänge: 91 Minuten\nRegie: Michael Damian\nFSK: 6\nErstveröffentlichung: 2011\n\n\n*Das sind die Schauspieler von „Eine Prinzessin zu Weihnachten“*\nKatie McGrath in der Rolle der Jules Daly\nRoger Moore in der Rolle des Edward, Graf von Castlebury\nSam Heughan in der Rolle des Ashton, Prinz von Castlebury\n\n\n*Die Handlung und Szenen von „Eine Prinzessin zu Weihnachten“* \nJules Daly darf den Traum aller Mädchen Wirklichkeit werden lassen, als sie zusammen mit ihrer Nichte Maddie und ihrem Neffen Milo über Weihnachten der Einladung eines entfernten Verwandten folgt, das Fest auf einem europäischen Schloss zu verbringen. Denn völlig unerwartet verliebt sie sich in Ashton, den Prinz von Castlebury und sieht sich dem schönsten Weihnachtsgeschenk gegenüber.\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Eine Prinzessin zu Weihnachten“ in voller Länge auf deutsch ansehen.",
      "id": "xW-C9h8dkHE",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:30:41.712Z"
}