{
  "imdbId": "youtube-WOtGAYeWMCA",
  "title": "Lethal Punisher: Kill or be Killed - Action movie with Dolph Lundgren - Full movie in HD - Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WOtGAYeWMCA",
      "title": "Lethal Punisher: Kill or be Killed - Action movie with Dolph Lundgren - Full movie in HD - Moviedome",
      "description": "►Ganzer Film. Der knallharte Actionfilm „Lethal Punisher“ mit Action-Legende Dolph Lundgren und Actionfilm-Veteran Cung Le kostenlos und in ganzer Länge bei Moviedome.\n\n►Die Handlung:\nNach einem Irak-Einsatz kehrt John nach Hause zurück, er leidet am posttraumatischen Belastungssyndrom. Nichts ist für ihn mehr, wie es einmal war, doch John versucht redlich, sein Leben in den Griff zu kriegen. Das bisschen Frieden, das er sich geschaffen hat, wird an einem schicksalhaften Tag zerstört, als er ein Call Girl vor einer Gruppe gewalttätiger Zuhälter rettet.\n\nAbonniere Moviedome kostenlos für mehr ganze Filme ► http://bit.ly/MoviedomeAbo\n\nJetzt den Film „Lethal Punisher: Kill or be Killed“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Action #Actionfilm #ganzeFilme #DolphLundgren #knallhart #brutal #Kampf\n\nOriginaltitel: A Certain Justice\nFilmlänge: 86 Minuten\nRegie: Giorgio Serafini, James Coyne\nFSK: 16\nErstveröffentlichung: 2014\n\n\nDie Darsteller\nDolph Lundgren (bekannt aus „Rocky IV“, „The Expendables“) \nin der Rolle des Hollis\nCung Le (bekannt aus „Tekken“, „The Man with the Iron Fists“, „The Grandmaster“) \nin der Rolle des John Nguyen\nVinnie Jones (bekannt aus „Snatch: Schweine und Diamanten“, „Midnight Meat Train“) \nin der Rolle des Bennett\nGianni Capaldi (bekannt aus „A Day To Die“, „River Runs Red“, „The Commando“) \nin der Rolle des Vin\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nJetzt den Actionfilm „Lethal Punisher“ in voller Länge auf deutsch ansehen.",
      "id": "WOtGAYeWMCA",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:34:10.353Z"
}