{
  "movieId": "youtube-QAxs_xpfkU8",
  "title": "Bob Steele | The Kid Ranger 1936 (Romance, Western) Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QAxs_xpfkU8",
      "id": "QAxs_xpfkU8",
      "title": "Bob Steele | The Kid Ranger 1936 (Romance, Western) Colorized Movie",
      "description": "Pounding hoofs and whistling bullets as Bob Steele rides in defense of the law.\nRanger Ray plans to marry stage driver Bill Mason’s daughter Mary, but there are problems ahead.\n\nOriginal title: The Kid Ranger (1936) \n\nBlack & White version: https://youtu.be/u3xbHwp1WrQ\n\nThis film is available with subtitles in many language options.\nDirector & Writer: Robert N. Bradbury\nStars: Bob Steele, William Farnum, Joan Barclay \nGenres: Colorized classics, Drama, Romance, Western \n\n\n00:00 Full Movie - opening credits\n00:51 A Western drama unfolds as old friends confront each other, leading to a tense standoff.\n13:27 A dramatic Western-themed story unfolds with love, betrayal, and a deadly confrontation.\n22:45 A man confronts his past and seeks revenge in a small town.\n30:58 A man is accused of murder and seeks to clear his name while confronting his past.\n37:06 A man named Jim Guthrie returns to town, causing tension and conflict with the locals, including Niles Hendry.\n45:26 A tense and dramatic confrontation between characters at a ranch, involving suspicions of murder and a potential showdown.\n58:23 A dramatic story of love, betrayal, and revenge unfolds with tense confrontations and a deadly showdown.\n1:04:44 A dramatic story of betrayal, accusation, and revenge leading to a deadly confrontation.\n1:12:41 A western-themed video where a misunderstanding is cleared up, leading to reconciliation and goodbyes.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:39:16.934Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/QAxs_xpfkU8/maxresdefault.webp?v=657f89a0",
      "duration": 3440,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:17.102Z"
}