{
  "imdbId": "youtube-ePXzhU_AZ6I",
  "title": "When murder is easier! Scotland Yard Inspector (1952) Colorized | Film-Noir | Cesar Romero",
  "year": 1952,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ePXzhU_AZ6I",
      "title": "When murder is easier! Scotland Yard Inspector (1952) Colorized | Film-Noir | Cesar Romero",
      "description": "Shock-sock suspense In this murder mystery! A woman’s brother is killed in a freak accident, or so she believes. Fortunately for her, an American journalist is more suspicious and so begins roaming the London streets in search of the killer.\n\nOriginal title: Lady in the Fog (1952) AKA: Scotland Yard Inspector\n\nOriginal Black & White version 👉 https://youtu.be/K3u7q_i3dUw \n\n\nDirectors: Sam Newfield, Pat Jackson\nWriters: Orville H. Hampton, Lester Powell\nStars: Cesar Romero, Lois Maxwell, Bernadette O'Farrell, Geoffrey Keen\nGenre: Colorized classics, Mystery\n\n00:00 Full Movie\n02:34 A love story unfolds during a sailing race, leading to an accident and a lunch invitation.\n06:53 A man attends a party and becomes infatuated with a woman named Ines de Montalban.\n15:31 A man travels to meet a woman in Pyla, but she is not there.\n23:28 A conversation between two individuals discussing friendship and a potential business deal.\n37:35 Inspector Fabre questions Mr. Winemaker about Lucien Bonnet's murder at 56 rue Pigalle.\n40:04 A man named Vigneron is suspected of killing his valet and is interrogated by a judge.\n54:11 A man named Ricardo de Montalban testifies about lending 1,100,000 francs to the accused, Vigneron.\n1:03:29 Ines de Montalban, the mistress of Jean Vigneron, comes forward as a witness and reveals their relationship to the court.\n1:04:52 A man named Lucien Bonnet was blackmailing someone with incriminating photographs, but was killed by the person he was blackmailing.\n1:11:59 A couple discusses the presence of someone lurking around their house armed to the teeth.\n1:20:37 A couple discusses their troubled relationship and the possibility of one of them dying.\n\n\n@CultCinemaClassics",
      "id": "ePXzhU_AZ6I",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:40:19.939Z"
}