{
  "imdbId": "youtube-dN-soiY8o6Q",
  "title": "High Lonesome (1950, Western) John Drew Barrymore, Chill Wills | Full Movie, subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dN-soiY8o6Q",
      "title": "High Lonesome (1950, Western) John Drew Barrymore, Chill Wills | Full Movie, subtitles",
      "description": "Ghost fingers pressed the trigger - and death flashed from the shadows...\nWhen a sudden spurt of murders occurs in Texas Big Bend country, suspicion immediately falls on a young drifter who just moved to the area.\n\nOriginal title: High Lonesome (1950) \nDirector & Writer: Alan Le May\nActors: John Drew Barrymore, Chill Wills, John Archer, Kristine Miller \nGenres: Classics, Western\n\n00:00 Full Movie\n01:40  This video is about the High Lonesome Country and a mysterious event that occurred there.\n13:00  A boy confesses to killing a man and explains how two strangers were involved in planning a robbery.\n17:08  A group of people discuss a boy who claims to have killed someone and the mystery surrounding it.\n22:34  A creepy kid tells a story about two men who are dead, but are now haunting the ranch.\n35:27  A man shows a boy the remains of a fence that caused a feud between two families and resulted in the death of a herd of cattle.\n36:57  The characters discuss the appearance of dead men and attend a party.\n49:37  A boy interrupts a performance to warn the group of danger and asks for their help.\n50:44  A rancher is determined to find out who killed his parents and is willing to risk everything to do so.\n56:39  A conflict arises over tearing down a fence, leading to a series of events and misunderstandings.\n1:05:53  Two characters discuss the possibility of a hidden body and their plans to find it.\n1:13:50  A man prepares to confront his enemies and protect his family.\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "dN-soiY8o6Q",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:41:53.153Z"
}