{
  "movieId": "youtube-ClohLa-2KH4",
  "title": "Kolle - Ein Leben für Liebe und S*x (ganze Filme auf Deutsch anschauen, kompletter Film Deutsch)*HD*",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ClohLa-2KH4",
      "id": "ClohLa-2KH4",
      "title": "Kolle - Ein Leben für Liebe und S*x (ganze Filme auf Deutsch anschauen, kompletter Film Deutsch)*HD*",
      "description": "► Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Dir gefällt Netzkino? Dann lass uns ein Like da: http://bit.ly/NetzkinoFacebook\n► Packendes Biopic über einen der berühmtesten Se*xualanarchisten der Welt Oswalt Kolle (\"S*xreport 2008 – So lieben die Deutschen\").\n\n..................................................................\n\nKOLLE - EIN LEBEN FÜR LIEBE UND S*X (2002)\nOriginaltitel: Kolle - Ein Leben für Liebe und S*x\nMit: Sylvester Groth, Annett Renneberg, Petra Zieser\nRegie: Susanne Zanke\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nEnde der 60er Jahre: Inmitten der politischen und gesellschaftlichen Turbulenzen zwischen Revolte und Reaktion streitet der Journalist und Filmemacher Oswalt Kolle mit viel Engagement und bisweilen missionarischem Eifer für seine Ideen einer liberalen S*xualaufklärung. Aber Kolle muss sich gegen heftige Widerstände wehren: Die Freiwillige Selbstkontrolle der deutschen Filmwirtschaft (FSK) will seinen neuesten Film “Das Wunder der Liebe” auf den Index setzen. Kolle muss in einem harten und bisweilen unfreiwillig komischen Kampf durch drei Instanzen gehen, bis er mit Hilfe seines agilen Produzenten Lenz Schäfer und dem findigen Rechtsanwalt Dr. Fritz Ascher die vollständige Freigabe des Films erstreitet. Parallel dazu laufen bereits die Dreharbeiten zu Kolles nächstem Film und auch dabei geht es ziemlich turbulent zu. Damit nicht genug: Kolles Erzfeind, der konservative Staatsanwalt Dr. Schubert, versucht mit allen Mitteln den “S*xualanarchisten” hinter Gitter zu bringen. Auch die studentische Linke hat für Kolle, den “Scheinliberalen”, nur Spott und Verachtung übrig. Aber ausgerechnet zwischen dem vermeintlichen Biedermann Kolle und der engagierten Journalistin Christiane, die im Auftrag des linken Magazins Spontan mit dem “S*xualdemokraten” abrechnen will, funkt es heftig. Kolle ist verheiratet und Vater dreier Kinder. Seine Frau Marlies hat bislang die zahllosen Affären ihres Mannes gelassen hingenommen. Schließlich führen sie eine offene Ehe. Kolle propagiert die “soziale Treue” und Eifersucht ist für ihn der Anfang vom Ende jeder wahren Liebe. Doch diesmal ist alles anders: Christiane, die sich ihre Gefühle für Kolle zuerst nicht eingestehen will, gibt sich nicht damit zufrieden, die Geliebte eines verheirateten Mannes zu sein. Und auch Marlies akzeptiert seine Liebe zu Christiane nicht. Die beiden Frauen zwingen Kolle, sich zwischen ihnen zu entscheiden.\n#Spielfilm #ganzerFilm\n\n\n\n..................................................................\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/NetzkinoAndroid\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n✘ Google+ - https://plus.google.com/+netzkino\n\n........................................­..........................\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-24T00:11:50.899Z",
      "thumbnail": "https://i.ytimg.com/vi/ClohLa-2KH4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBfa508zdlyuMNtZmqp19hdiCYCIQ",
      "duration": 4751,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:11:50.899Z"
}