{
  "imdbId": "youtube-VW695alOk2M",
  "title": "Planet Dune + Collision Earth | Hollywood Action Movie | New 2024 Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VW695alOk2M",
      "title": "Planet Dune + Collision Earth | Hollywood Action Movie | New 2024 Movie",
      "description": "Planet Dune: In the distant future, space exploration has advanced, and a rescue mission is launched to retrieve a team of scientists who have become marooned on the desolate planet of Dune, a world with a brutal, unforgiving desert landscape. The rescue crew, led by a seasoned captain, is tasked with extracting vital research data from a now-silent base. As the team approaches the planet's surface, they quickly realize that Dune is far from uninhabited. The harsh desert is home to apex predators—ancient, massive sandworms capable of growing to immense lengths. These creatures, capable of burrowing through the desert sands at incredible speeds, are not only a physical threat but are intelligent and driven by instincts far beyond simple survival. \n\nAs the team fights to complete their mission and escape, they uncover a dark secret buried beneath the sands—an ancient civilization long thought to be extinct. The sandworms are not just mindless beasts but guardians of this lost world, and their attacks are connected to something much more sinister. With limited resources and no way to contact their ship, the crew must fight to survive against an enemy they cannot see and escape a world on the brink of becoming their tomb. Will they succeed in their mission, or will they become the prey in a deadly predator-prey cycle on a world that’s forgotten humanity?\n\n2024.  Stars: Sean Young, Emily Killian, Anna Telfer\n\nCollision Earth: In \"Collision Earth,\" a catastrophic asteroid the size of a city is on a collision course with Earth, and humanity's fate hangs in the balance. As the world braces for impact, global governments scramble to launch advanced defense systems to prevent the destruction of the planet. However, when their military protocols fail, panic spreads across the globe, and cities begin to crumble in the wake of chaos. A team of elite astronauts and scientists is assembled to take on the impossible task of preventing the asteroid from wiping out all life. As the clock ticks down, the team’s mission becomes increasingly perilous as they uncover deeper flaws in the technology meant to save the planet.\n\nThe team must navigate a series of life-threatening obstacles as they make their way into space to directly confront the asteroid. The emotional stakes rise as tensions flare within the crew, with personal sacrifices and complex relationships adding emotional weight to the high-stakes thriller. Meanwhile, Earth continues to fall apart as governments collapse and civilization teeters on the brink. As the asteroid looms ever closer, the team faces the question of whether they can stop the unthinkable and, even if they succeed, whether humanity can survive the aftermath of the destruction. \"Collision Earth\" is a gripping disaster film that explores the limits of human resilience, survival, and the ultimate fight against extinction.\n\n2024.  Stars: Kate Watson, Joseph Michael Harris, Daniel O'Reilly\n**Under license from The Asylum. All rights reserved**\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#2024actionmovie #hollywoodmovies #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "VW695alOk2M",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "PH",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:02:02.722Z"
}