{
  "imdbId": "youtube-vsGwX96VgjU",
  "title": "Cruel Jaws 1995 (Action, Horror film) directed by Bruno Mattei 🦈  New Terror Surfaces 🦈",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vsGwX96VgjU",
      "title": "Cruel Jaws 1995 (Action, Horror film) directed by Bruno Mattei 🦈  New Terror Surfaces 🦈",
      "description": "A small coastal town in Florida becomes the hunting ground for a large tiger shark. As the shark attacks, a group of locals must band together to stop the carnage, uncovering dark secrets and corporate greed along the way. This film delivers a campy homage to classic shark horror. A notorious 'Jaws' rip-off! Directed by Bruno Mattei.\n\nOriginal title: Cruel Jaws (1995) AKA: Jaws 5\n\nThis film is available with Italian audio, and subtitled in many languages\n\nDirector: Bruno Mattei\nWriters: Peter Benchley, Robert Feen, Bruno Mattei\nStars: David Luther, George Barnes Jr., Scott Silveria, Kirsten Urso\nGenres: 90's, Action, Adventure, Comedy, Horror, Thriller\n\n\n0:00:00 Full Movie with subtitles \n0:00:06 Billy and his team uncover a secret military cargo in Cleveland, setting the stage for chaos.\n0:09:42 Billy suspects a shark is behind the gruesome injuries, sparking fear in the town.\n0:23:45 A young woman is attacked, confirming the shark's presence and escalating tensions.\n0:36:03 The town installs shark nets and patrols to protect the boat race, but doubts linger.\n0:48:19 A shark attack disrupts the boat race, causing panic and tragedy among the participants.\n1:00:11 Billy devises a plan to destroy the shark's lair with explosives, risking everything.\n1:12:02 The team faces the shark in a final underwater showdown, testing their resolve.\n1:20:18 The town celebrates the shark's defeat, but scars of the battle remain.\n\n\n @CultCinemaClassics",
      "id": "vsGwX96VgjU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:33:19.217Z"
}