{
  "imdbId": "youtube-SPGPA1W06do",
  "title": "Wolf - Er wird dich holen (GANZER HORRORFILM auf Deutsch, Historische Horrorfilme, ganzer Film neu)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SPGPA1W06do",
      "title": "Wolf - Er wird dich holen (GANZER HORRORFILM auf Deutsch, Historische Horrorfilme, ganzer Film neu)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Wenn vier von Rom gesandte Boten einer Seuche vermisst werden, bleibt Rom keine andere Wahl, als zehn ihrer besten Boten über den Hadrianswall zu schicken, um sie zu finden und zurückzubringen.\n\nWOLF - ER WIRD DICH HOLEN (2019)\nOriginaltitel: Wolf\nMit: Stuart Brennan; Mark Paul Wake; George McCluskey\nRegie: Stuart Brennan\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nVier Boten des römischen Reichs gehen auf eine Friedensmission nach Kaledonien (liegt im heutigen Schottland). Die Boten verschwinden. Rom entsendet zehn seiner besten Soldaten, um die verschwundenen Männer wiederzufinden. Die Soldaten müssen durch die unwirtliche Winterlandschaft nördlich des Hadrianswalls. Die tapferen Kämpfer bekommen es mit einem Gegner zu tun, der sehr gefährlich ist – viel gefährlicher als marodierende Söldner oder die Pest. Nach und nach werden die Soldaten zu Opfern eines Grauens, das in den Wäldern wohnt...\n#Netzkino #ganzerFilm #Horrorfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "SPGPA1W06do",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}