{
  "movieId": "youtube-8F3XpkbP4UI",
  "title": "서울의 지붕밑(1961) 복원본 / Under the Sky of Seoul ( Seoul-ui Jibungmit ) Restoration Version",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8F3XpkbP4UI",
      "id": "8F3XpkbP4UI",
      "title": "서울의 지붕밑(1961) 복원본 / Under the Sky of Seoul ( Seoul-ui Jibungmit ) Restoration Version",
      "description": "게시일: 2019. 10. 1.\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/...\n(English) https://www.kmdb.or.kr/eng/db/kor/det...\n\n영화글\nhttps://www.kmdb.or.kr/story/10/1351\nhttps://www.kmdb.or.kr/story/10/2062\nDVD 소책자 : https://www.kmdb.or.kr/history/book/2351\n\n감독(Director) : 이형표(Lee Hyeong-Pyo)\n출연 : 김승호(김학규),허장강(박주사),김희갑(노몽현),최은희(김현옥),김진규(최두열),신영균(김현구),도금봉(점례),한은진(김학규 아내),황정순(점례 어머니),남미리,고선애,곽규석,구봉서(설창구),신성일(영길),정득순\n\n줄거리 : 서울 작은 골목의 터줏대감인 한의사 김학규(김승호)는 쓸데없는 심술을 부려 아내(한은진), 자식들과 불화를 겪는다. 나하나 미장원을 경영하는 젊은 미망인인 딸 김현옥(최은희)은 건너편의 산부인과 의사 최두열(김진규)과 서로 좋아하지만, 양의를 못마땅하게 여기는 김학규는 최두열을 시기하고 질투하여 사사건건 그의 일을 방해한다. 아들 김현구(신영균)는 동네 술집 여주인(황정순)의 딸 점례(도금봉)와 사귀는데 점례가 임신을 해 결혼을 하려고 하나, 김학규는 반대하며 아들을 쫓아낸다. 한편 관상쟁이 박주사(허장강), 복덕방 주인 노몽현(김희갑)과 유유자적하며 최두열을 방해할 궁리만 짜내던 김학규는 최두열이 시의원 선거에 나간다는 소식을 듣고, 자신도 입후보하여 전 재산을 쏟아부으며 선거에 몰두한다. 최두열은 김학규를 위해 시의원 후보를 사퇴하지만, 김학규는 결국 낙선의 고배를 마신다. 자신의 고집으로 인한 실패감에서 헤어나지 못하던 김학규는 집을 나와 거리를 배회하던 중 교통사고를 당한다. 병원에서 깨어난 김학규는 마침내 그간 자신을 걱정해준 최두열을 사위로 받아들이기로 하고, 때마침 자신의 손자를 낳은 점례를 며느리로 인정한다.\n\nCasts : Kim Hee-Gap, Hwang Jeong-Sun, Kim Seung-Ho\n\nSYNOPSIS : An oriental doctor Kim, Hak-gyu (Kim, Seung-ho) is a cantankerous man who is the longest-term householder in a small village in Seoul. He often causes domestic trouble by being nasty to his wife (Han, Eun-jin) and his children. Kim, Hyeon-ok (Choi, Eun-hee), a daughter of a young widow who runs Nahana Beauty Shop, is in love with Choi, Du-yeol (Kim, Jin-gyu), an obstetrician across the street. Kim, Hak-gyu has great distaste for western medicine, and at the same time, is jealous of the obstetrician. He always gets in the way of Choi, Du-yeol. Kim's son, Hyeon-gu (Shin, Young-kyun), dates Jeomryae, a daughter of a bar owner (Hwang, Jeong-soon). When Jeomryae gets pregnant, Hyeon-gu plans to marry her only to enrage his father who rejects their relationship and kicks his son out. While busy deliberating on ways to hinder Choi, Du-yeol with his friend Park, Ju-sa (Heo, Chang-kang), a physiognomist, and Roh, Mong-hyun (Kim, Hee-gap), a real-estate agent, Kim comes across the news that Choi will be running for city mayor and runs in the election himself. He spends all his money on the campaign but defeats. Kim who experienced failure due to his stubbornness accepts his son's family and the marriage of his daughter.",
      "addedAt": "2025-12-26T00:23:07.027Z",
      "thumbnail": "https://i.ytimg.com/vi/8F3XpkbP4UI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDRamJgvHIK2f1ojdNzt1iCQlV7wA",
      "duration": 7444,
      "language": "ko",
      "year": 1961,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:07.039Z"
}