{
  "imdbId": "youtube-DmYVrjINoa8",
  "title": "Seong Chun-hyang ( Seong Chun-hyang )(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DmYVrjINoa8",
      "title": "Seong Chun-hyang ( Seong Chun-hyang )(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00631\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00631\n\n영화글 : https://www.kmdb.or.kr/story/10/5147\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희(성춘향),김진규(이몽룡),도금봉(향단),허장강(방자),이예춘(변학도),한은진(월매),서월영,임예심,최삼,박암,양석천,양훈(허봉사),구봉서(포졸),김희갑(포졸),최걸,석운아,조항,이업동,고선애,정득순,박옥초,추봉,이기홍,이창식,박성근,김호연,박빈,임생출,길유성,이영,문미봉,윤선자,송일근,지방열,최찬식,임동훈,임해림,조석근,최흥숙,라점옥,강석제,석귀녀\n\n줄거리 : 남원 사또 자제 이 도령(김진규)은 단옷날 광한루로 나왔다가 그네를 타는 춘향(최은희)을 본다. 하인 방자(허장강)에게 춘향을 데려오라 하나, 어미는 기생이지만 아비는 참판이고, 기생 짓은 마다하고 글 읽기와 서화에 골몰하는 콧대 높은 춘향은 호감을 감추고 남의 집 처자를 오라 가라 한다며 거절한다. 어느 밤 춘향의 집에 찾아온 이 도령은 춘향 어미 월매(한은진)에게 춘향을 아내 삼기로 맹세한 후 첫날밤을 치른다. 행복한 신혼 생활을 하던 중, 이 도령은 한양으로 부임하게 된 아버지를 따라가야 할 처지가 된다. 함께 한양 갈 꿈에 부풀은 춘향이지만, 기생집에 출입한다고 부친에게 호된 꾸지람을 들은 이 도령은 돌아오겠다고 약속하고 한양으로 떠난다. 신관 사또로 부임한 변학도(이예춘)는 춘향의 미색에 홀려 수청을 명하나, 춘향은 기생은 사람도 아니고 절개도 없냐며 수청을 거절하고 하옥된 후 모진 고초를 당한다. 한편 장원급제한 이 도령은 암행어사로 제수 받고 남원으로 내려와 월매를 만난 후 짐짓 몰락한 척하며 노잣돈이라도 얻으러 왔다 한다. 옥중에서 이 도령을 만난 춘향은 자신의 처지도 잊고 월매와 향단(도금봉)에게 그를 극진히 대해줄 것을 부탁한다. 다음날 변학도의 생일잔치 중 춘향이 처형을 당하는 찰나, 암행어사로 등장한 이 도령은 변학도를 파직하고 춘향을 구한다.\n\nCasts : Choi Eun-Hee,Kim Jin-Kyu,Han Eun-Jin,Heo Jang-Kang\n\nSYNOPSIS : Chun-hyang, the only daughter of an old gisaeng named Wolmae, falls in love with Lee Mong-nyong and promises to marry him. But Lee leaves for Seoul with his father who's an aristocrat, and the new governor, Byeon Hakdo, covets Chun-hyang because she is the most beautiful girl in town. When Chun-hyang rejects his order to serve him at night, Governor Byeon sends her to jail. In the mean time, Lee passes the state exam and becomes a special undercover agent of the king. He comes back to where Chun-hyang lives to save her and punishes Governor Byeon.",
      "id": "DmYVrjINoa8",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:24:51.891Z"
}