{
  "movieId": "youtube-QV5_i5O4Ee0",
  "title": "Die Kammer der toten Kinder (KRIMI THRILLER ganzer Film Deutsch, komplette Mystery Filme anschauen)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QV5_i5O4Ee0",
      "id": "QV5_i5O4Ee0",
      "title": "Die Kammer der toten Kinder (KRIMI THRILLER ganzer Film Deutsch, komplette Mystery Filme anschauen)",
      "description": "► Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Ein überfahrener Familienvater und zwei Millionen Euro verschwundenes Lösegeld sind nur der Auftakt zu einer ganzen Kette bizarrer Verbrechen... Wendungsreicher Hochglanz-Thriller mit MÉLANIE LAURENT!\n\nDIE KAMMER DER TOTEN KINDER (2007)\nOriginaltitel: La Chambre des morts (Englisch: Room of Death)\nMit: Mélanie Laurent, Eric Caravaca, Gilles Lellouche, Jonathan Zaccaï, Céline Sallette\nRegie: Alfred Lot\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nMitten in der Nacht überfahren zwei arbeitslose Computerprogrammierer auf dem einsamen Gelände eines Windkraftwerks einen Mann, der noch am Unfallort stirbt. Neben dem Toten finden sie eine Tasche voller Bargeld. War er ein Bankräuber? Oder ein Dealer? Wen kümmert's? Zwei Millionen Euro fallen dir in den Schoß. Es gibt keine Zeugen. Was würdest du tun? Die Cops rufen, oder das Beste aus diesem unglaublichen Glücksfall machen? Vigo und Sylvain fällt die Entscheidung nicht schwer.\nAm nächsten Tag wird ein blindes Mädchen tot in einem Lagerhaus in der Nähe des Unfallorts gefunden. Wenn die Scheine nun als Lösegeld für sie bestimmt waren? Und wenn der Mörder die beiden Todesfahrer am Ende gesehen hat?\nDann wird ein weiteres Mädchen entführt; eine Diabetikerin - jetzt tickt die Uhr und die Polizei in der Provinzstadt Dünkirchen gerät in Panik. Mit derartigen Verbrechen fühlen sich die örtlichen Beamten überfordert, und obendrein fehlt ihnen die notwenige Ausrüstung. Mit Unterstützung ihres aufmerksamen Kollegen Pierre wagt sich Polizeineuling Luice an ihre erste große Ermittlung...\n#Netzkino #ganzerFilm #Thriller\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinem monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-24T00:05:38.337Z",
      "thumbnail": "https://i.ytimg.com/vi/QV5_i5O4Ee0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDuRUjlJvpzETPxQg9Ebz2nRuFNHQ",
      "duration": 6695,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:05:38.337Z"
}