{
  "movieId": "youtube-E7QKZ9iSYeg",
  "title": "KEANU REEVES & ANA DE ARMAS in EXPOSED (Thriller full movie in German 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E7QKZ9iSYeg",
      "id": "E7QKZ9iSYeg",
      "title": "KEANU REEVES & ANA DE ARMAS in EXPOSED (Thriller full movie in German 2025)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Bevor sie für \"Ballerina\" aus dem gefeierten \"John Wick\"-Universum gemeinsam vor der Kamera standen, kam das bemerkenswerte Duo KEANU REEVES (\"Matrix\" & \"Speed\") und Shooting Star ANA DE ARMAS (\"James Bond 007: No Time to Die\" & \"Blade Runner 2049\") für diesen hoch-spannenden Thriller erstmals zusammen: Ein Polizist sucht den Mörder seines Partners und ist dabei auf die Hilfe der einzigen Zeugin angewiesen\n\nEXPOSED – BLUTIGE OFFENBARUNG (2016)\nOriginaltitel: Exposed\nMit: Keanu Reeves, Ana de Armas, Mira Sorvino, Christopher McDonald, Danny Hoch\nRegie: Declan Dale\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nAls Detective Scotty Galban (Keanu Reeves) erfährt, dass sein Partner und langjähriger Freund Detective Cullen erstochen wurde, setzt er alles daran, seinen Mörder zu finden. Während der Ermittlungen verfestigt sich die Vermutung, dass Cullen in Drogendeals verwickelt war und nach und nach sterben Leute, die ihn kannten. Cullens Frau Janine (Mira Sorvino) und sein Boss versuchen, Galban von weiteren Ermittlungen abzubringen, um Cullens Namen und den Ruf der Polizei nicht zu beschmutzen.\nGalbans einzige Hoffnung indes ist Isabel (Ana de Armas), die am Tatort gesehen wurde. Die junge gläubige Frau war Zeugin übernatürlicher Geschehnisse, die sie für ein Wunder hält. Wie Galban kämpft auch Isabel mit den Dämonen ihrer Vergangenheit und es ist Galbans Aufgabe, Licht in ein dunkles Kapitel zu bringen.\n#ganzerFilm #KeanuReeves #AnaDeArmas\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:37:21.523Z",
      "thumbnail": "https://i.ytimg.com/vi/E7QKZ9iSYeg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAgB4EgVKlkf2jwCHmedFhBVik22w",
      "duration": 5866,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}