{
  "imdbId": "youtube-lxgb26wocyM",
  "title": "Panic in Echo Park (Drama, 1977) Dorian Harewood, Robin Gammell | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lxgb26wocyM",
      "title": "Panic in Echo Park (Drama, 1977) Dorian Harewood, Robin Gammell | Full Movie",
      "description": "A young black M.D. tries to prove that the community of Echo Park is endangered by a deadly epidemic. But he has to fight his superior in the hospital and city government who accuse him of just causing panic.\n\nOriginal title: Panic in Echo Park (1977) \n\nDirector: John Llewellyn Moxey\nWriter: Dalene Young\nStars: Dorian Harewood, Robin Gammell, Catlin Adams \nGenres: Medical Drama, Made for TV\n\n\n00:00 Full Movie (with subtitles)\n01:51 Drama unfolds in a hospital setting as Dr. Stoner deals with various challenges and conflicts.\n06:57 A conversation between Cynthia and Shane's friend leads to plans for a lunch meeting with parents.\n13:03 Medical drama unfolds as a director faces challenges in a hospital setting with mysterious symptoms and urgent tests.\n19:52 Chaos ensues as a doctor investigates a potential health threat linked to a local market.\n25:52 Meeting between doctors and friends leads to discussions about healthcare and personal relationships.\n30:19 Drama unfolds as characters navigate through personal and professional challenges in Echo Park.\n33:58 Drama unfolds as a doctor investigates mysterious illness outbreak in a community clinic.\n39:21 Investigation into contaminated water supply leads to tension and conflict at a hospital.\n45:15 Investigation into suspicious construction activities at Seventh and Melrose building.\n50:54 A drama unfolds as a doctor investigates a suspicious case involving a company owner and environmental pollution.\n56:07 Intense drama unfolds as Michael seeks evidence against Lamberti with Cynthia's help.\n1:04:09 Investigation into a potential disaster involving chemicals and construction projects in the town.\n1:09:03 TV show featuring a doctor named Stoner, who is praised for his bravery in uncovering the truth behind corruption in Lovato Palms.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "lxgb26wocyM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:25.799Z"
}