{
  "imdbId": "youtube-7yoqbHvDGb8",
  "title": "Dieses magische Weihnachtsmärchen könnte ich immer wieder schauen: Wunder einer Winternacht",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7yoqbHvDGb8",
      "title": "Wunder einer Winternacht",
      "id": "7yoqbHvDGb8",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7yoqbHvDGb8",
      "title": "Dieses magische Weihnachtsmärchen könnte ich immer wieder schauen: Wunder einer Winternacht",
      "description": "*GANZER FILM - Die schönsten Weihnachtsfilme für Weihnachten 2025 findet ihr bei Moviedome*\n\nDen Spielfilm „Wunder einer Winternacht: Die Weihnachtsgeschichte“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Wunder einer Winternacht: Die Weihnachtsgeschichte“:\nIMDb: *7,1* von 10\nAmazon: *4,4* von 5\n\n*Die Handlung von „Wunder einer Winternacht: Die Weihnachtsgeschichte“*\nWeit oben in Lappland lebt der Waisenjunge Nikolas. Die Menschen im Dorf sorgen gemeinsam für ihn, indem er jedes Jahr bei einer anderen Familie wohnt. Am Weihnachtsabend zieht er weiter zur nächsten Familie – und hinterlässt den Kindern stets ein kleines Geschenk, um sich zu bedanken.\n\n\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Wunder einer Winternacht: Die Weihnachtsgeschichte“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\n\n#Weihnachten2025 #ganzerFilm #Weihnachtsfilm #FilmeKostenlos #MoviedomeFilm\n\nRegie: Juha Wuolijoki\nLaufzeit: 83 Minuten\nFSK: 6\nErstveröffentlichung: 2007\n\n\n*Das sind die Schauspieler von „Wunder einer Winternacht: Die Weihnachtsgeschichte“*\nHannu-Pekka Björkman als Nikolas\nKari Väänänen als Iisakki\nMikko Leppilampi als Hannus\n\n\n*Die Handlung und Szenen von „Wunder einer Winternacht: Die Weihnachtsgeschichte“* \nNikolas, ein Waisenjunge aus einem Dorf in Lappland, wächst bei wechselnden Familien auf. Jedes Jahr an Heiligabend zieht er zur nächsten weiter. Zum Dank schenkt er den Kindern kleine Geschenke, bevor er aufbricht.\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Wunder einer Winternacht: Die Weihnachtsgeschichte“ in voller Länge auf deutsch ansehen.",
      "id": "7yoqbHvDGb8",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:27:48.016Z"
}