{
  "imdbId": "youtube-MiC30pGUKCU",
  "title": "Candlelight in Algeria 1943 (Mystery, War film) James Mason, Carla Lehmann, Raymond Lovell",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MiC30pGUKCU",
      "id": "MiC30pGUKCU",
      "title": "Candlelight in Algeria 1943 (Mystery, War film) James Mason, Carla Lehmann, Raymond Lovell",
      "description": "Where Love Meets Espionage in the Heat of Battle.\nAn American sculptress in wartime Algiers gets mixed up with a British agent and a Nazi spy who knows that a top-secret meeting of Allied military leaders will be taking place in Algeria - and that the British agent has a camera that has photographs of the meeting place.\n\nOriginal title: Candlelight in Algeria (1944)\nSubtitles are available.\n\n\nBlack & White version: https://youtu.be/_Jxsig6eHi0\n\nDirector: George King\nProducers: George King, John Stafford\nWriters: Brock Williams, Katherine Strueby, Dorothy Hope, John Clements\nStars: James Mason, Carla Lehmann, Raymond Lovell\nGenres: Classics, Colorized, Drama, History, War\n\n\n00:00 Full Movie (with subtitles).\n01:10 Introduction.\n06;06 During WWII, Susan Foster finds herself embroiled into espionage in North Africa, leading to a mysterious adventure.\n14:28 Intrigue unfolds in wartime Algeria, involving a mysterious map, a hidden camera, and a risky mission.\n24:02 Susan gets involved in a dangerous mission during wartime in Algeria.\n30:26 A mysterious encounter unfolds, involving love, deception, and unexpected twists.\n36:57 Intrigue and loyalty unfold as a woman faces suspicion and danger during wartime in Algeria.\n44:13 Mystery unfolds as characters navigate deception and danger.\n58:00 Danger surrounds a group planning a secret meeting near Hazard promontory in North Africa & a dangerous negotiation.\n1:06:13 Navigating through suspicious activities and unexpected encounters during wartime.\n1:14:51 Intrigue and action unfold during World War II in Algeria, involving German officers, American uniforms, and a daring escape.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:28.386Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/MiC30pGUKCU/maxresdefault.webp",
      "duration": 4887,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:28.493Z"
}