{
  "imdbId": "youtube-ZE5edBN_d5o",
  "title": "Tony 10 (Familienfilm Deutsch in voller Länge, kompletter Film Deutsch, ganzer Film Deutsch)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZE5edBN_d5o",
      "id": "ZE5edBN_d5o",
      "title": "Tony 10 (Familienfilm Deutsch in voller Länge, kompletter Film Deutsch, ganzer Film Deutsch)",
      "description": "► Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Dir gefällt Netzkino? Dann lass uns ein Like da: http://bit.ly/NetzkinoFacebook\n► Familienfilm von Mischa Kamp aus dem Jahr 2012.\n\n..................................................................\n\nTONY 10 (2012)\nOriginaltitel: Tony 10\nMit: Faas Wijn, Jeroen Spitzenberger, Rifka Lodeizen, Annet Malherbe\nRegie: Mischa Kamp\nFSK: ohne Altersbeschränkung\n\nINHALTSANGABE:\nTony ist fast 10 Jahre alt. Zu seinem bevorstehenden Geburtstag wünscht er sich eigentlich nur zwei Dinge: Endlich möchte er „Das Biest“ bezwingen, einen schwer zu steuernden Kran aus der Firma seines Vaters. Denn Tony hat von seinem Vater die Leidenschaft für Kräne geerbt, je größer desto besser. Aber fast noch sehnlicher wünscht sich Tony, dass seine Eltern wieder zusammen finden und so glücklich verliebt sind, wie am Anfang ihrer Beziehung. Doch alles hat sich verändert seit sein Papa als Minister arbeitet. Seitdem hat er kaum noch Zeit für die Familie, immer häufiger streiten sich seine Eltern, sein Vater bleibt manchmal nächtelang weg und zieht schließlich ganz aus. Er hat eine neue Freundin. Doch Wanda, so heißt die Neue, hat kein Kranblut und ist für Tony auch ansonsten ein Dorn im Auge. Denn im Gegensatz zu seiner Mutter, die zwar ein wenig zu fürsorglich ist, aber ansonsten eine liebenswerte und ruhige Person, die ihren kleinen Porzellanladen mit Herzblut führt, ist die Neue eine berechnende böse Stiefmutter, wie sie im Buche steht. Schnell ist Tony sich sicher, dass er bis zu seinem Geburtstag nichts unversucht lassen wird, seine Eltern wieder zusammen zu bringen…",
      "addedAt": "2025-12-24T00:12:25.567Z",
      "thumbnail": "https://i.ytimg.com/vi/ZE5edBN_d5o/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCJFo1CGJVUAbxeXnyRNgnwTDQ_Tg",
      "duration": 4933,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:12:25.567Z"
}