{
  "movieId": "youtube-mUfhHPcmjIo",
  "title": "Sword of Venus 1953 (Adventure, Romance) Robert Clarke, Catherine McLeod, Dan O'Herlihy | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mUfhHPcmjIo",
      "id": "mUfhHPcmjIo",
      "title": "Sword of Venus 1953 (Adventure, Romance) Robert Clarke, Catherine McLeod, Dan O'Herlihy | Colorized",
      "description": "A young nobleman, the son of the legendary Count of Monte Cristo, finds himself ensnared in a web of deceit and treachery when he's falsely accused of a crime he didn't commit. With his family's honor and fortune at stake, he must navigate a dangerous game of intrigue and betrayal to clear his name and thwart the sinister ambitions of his father's sworn enemy.\n\nBlack & White version: https://youtu.be/M6vI8jQhPtI\n\n\nOriginal title: Sword of Venus (1953) AKA: Island of Monte Cristo\nThis film is available with subtitles in many language options.\n\nDirector: Harold Daniels\nWriters: Jack Pollexfen, Aubrey Wisberg\nStars: Robert Clarke, Catherine McLeod, Dan O'Herlihy \nGenres: Colorized Classic, Adventure, Crime, Romance\n\n\n00:00 Full Movie (with subtitles)\n09:11 A duel ensues between Dantes and Louis over fidelity issues, with a surprising outcome.\n12:00 Intrigue and deception unfold as characters plan to destroy the heir of Monte Cristo.\n18:45 A tale of deception, betrayal, and intrigue unfolds in a remote inn during a stormy night.\n28:10 A murder trial unfolds with hidden identities, legal manipulation, and a desperate plea for help.\n34:08 A dramatic turn of events unfolds as a man faces trial, bribery, and a surprise wedding night in prison.\n43:26 Intrigue and betrayal unfold as a prisoner escapes and plans are made to ensure his silence in a colorized adventure film.\n51:43 Deception and intrigue unfold as a man is mistaken for a deceased heir and a plan is set in motion to secure a fortune.\n58:53 Intrigue and deception unfold as a man assumes a new identity to seek revenge and reclaim his fortune.\n1:06:11 Intrigue and betrayal unfold as a man seeks revenge and uncovers a sinister plot during a high-stakes business deal.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:48.633Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/mUfhHPcmjIo/maxresdefault.webp",
      "duration": 4393,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:48.783Z"
}