{
  "imdbId": "youtube-Q1R3GEWVDyw",
  "title": "Iceman - Der Krieger aus dem Eis - mit Donnie Yen - Ganzen Film kostenlos schauen in HD - Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Q1R3GEWVDyw",
      "title": "Iceman - Der Krieger aus dem Eis - mit Donnie Yen - Ganzen Film kostenlos schauen in HD - Moviedome",
      "description": "Jetzt den Martial Arts Action-Film \"Iceman – Der Krieger aus dem Eis\" in ganzer Länge bei #Moviedome sehen. \n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo \n\nDie vier Waisen Ying (Donnie Yen), Sao (Wang Baoqiang), Yuanlong (Simon Yam) und Niehu (Yu Kang) wachsen zur Zeit der Ming Dynastie in einem kleinem Dorf namens Taoyuan auf. Sie bekleiden die höchsten Positionen innerhalb der kaiserlichen Wachen. Nachdem die vier gemeinsam den Anführer der japanischen Truppen töten, erhält Ying vom Kaiser den Befehl, das Goldene Rad der Zeit, zurück ins kaiserliche Reich zu bringen. Auf dem Weg wird Ying von seinen drei Freunden überrascht, die ihm mitteilen, dass Tu, ein sehr mächtiger General, ihn für den Tod seiner Familie verantwortlich macht. Tu hat bereits eine Truppe in das Heimatdorf der Vier geschickt. In einem verzweifelten Kampf versucht Ying, die Bewohner von Taoyuan zu retten und wird dabei unter einer riesigen Schneelawine begraben. 400 Jahre später sind Ying, Sao und Niehu wieder aus dem Eis befreit und müssen sich im Hongkong der Neuzeit zu Recht finden. Um das Schicksal seines Dorfes zu ändern, muss Ying selbst das Goldene Rad der Zeit benutzen! \n\nIn den Hauptrollen dieser außergewöhnlichen Martial-Arts-Saga kämpfen die Kung-Fu Stars Donnie Yen („Ip Man“, „Star Wars: Rogue One“), Simon Yam („Ip Man“) und Wang Baoqiang („Kung Fu Killer“) für das Überleben ihres Dorfes.\n\nJetzt “Iceman – Der Krieger aus dem Eis” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #abenteuer #martial arts #action #ip man #donnie yen #zeitreise #hong kong #verrat #ehre\n\nOriginaltitel: Bing feng: Chong sheng zhi men\nRegie: Wing-cheong Law\nProduktionjahr: 2014\nProduktionsland: China\nFilmlänge: 100 Minuten \nFSK: Frei ab 16\nDVD-Start (DE): 23.05.2016\n\nDie Darsteller \nDonnie Yen in der Rolle des Ho Ying\nBaoqiang Wang in der Rolle des Sao\nShengyi Huang in der Rolle der May\nKang Yu in der Rolle des San Ko\nSimon Yam\n\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nDas chinesische Action-Abenteuer “Iceman – Der Krieger aus dem Eis” in voller Länge auf deutsch ansehen.",
      "id": "Q1R3GEWVDyw",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:56.292Z"
}