{
  "imdbId": "youtube-0HmBBebD4hY",
  "title": "La decisión para: Liquidar | PELÍCULA DE ESPÍAS | Subtitulos en Español",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0HmBBebD4hY",
      "title": "La decisión para: Liquidar | PELÍCULA DE ESPÍAS | Subtitulos en Español",
      "description": "Película de acción sobre una operación especial para eliminar al terrorista Shamil Basayev. La película está basada en hechos reales y toca una de las páginas más horribles del pasado reciente de la Federación Rusa. Como resultado de una operación altamente compleja de los servicios especiales, el líder terrorista Shamil Basayev fue asesinado. Fue él quien se convirtió en el prototipo del principal personaje negativo de la película, Shamil Bazgayev.\n\nShamil Basayev es responsable de atroces actos de terrorismo:\n- El atentado de Budennovsk (1995)\n- El secuestro del trabajador de Médicos Sin Fronteras en Chechenia (2001)\n- Asedio de Nord-Ost (2002)\n- Atentado suicida con bomba en la sede del gobierno checheno (2002)\n- Serie de atentados suicidas (2003)\n- Bombardeo de gasoductos y líneas de transmisión de energía en la región de Moscú (2004)\n- Ataque terrorista en Grozny el 9 de mayo de 2004\n- Ataques terroristas en Moscú (2004)\n- Explosiones de aviones (2004)\n- El asedio a la escuela de Beslan (2004)\n- Avería del sistema eléctrico en Moscú\n- Incendio provocado en el Teatro Stanislavsky y Nemirovich-Danchenko (2005)\n\nEl guión de Decisión: Liquidación se basó en las memorias de los participantes directos de la operación del FSB.\n\nAño de producción: 2018\n\nDirigida por: Alexandr Aravin\nEscrito por: Alexey Buzin, Pavel Kosov, Pavel Pavlov\nDirector de fotografía:\nMúsica: Yuri Poteyenko\nDiseño de producción: Alik Tagirov\nIntérpretes: Igor Petrenko, Alexey Vertkov, Ayub Tsingiev, Dmitry Parastayev, Alexey Shevchenkov, Ivan Shakhnazarov\n\n¡Suscríbete a nuestro canal de YouTube y asegúrate de hacer clic en la campana para no perderte las mejores películas soviéticas!",
      "id": "0HmBBebD4hY",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T03:43:59.432Z"
}