{
  "imdbId": "youtube-6WUvLiU6DnY",
  "title": "Someone Wants Her Silent | Her Stolen Past | American 2025 Suspense Action Thriller",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6WUvLiU6DnY",
      "id": "6WUvLiU6DnY",
      "title": "Someone Wants Her Silent | Her Stolen Past | American 2025 Suspense Action Thriller",
      "description": "Someone Wants Her Silent | Her Stolen Past | American 2025 Suspense Action Thriller - When Sonya Daniels finds the birth certificate of a kidnapped baby, hidden in her late mother's home, she's shocked. What was her parents' connection to the missing little girl and could her mother's murder somehow be connected? Sonya hires attractive detective Brandon Hayes to help her investigate. But someone will stop at nothing to prevent them from uncovering the truth. Determined to unravel the mystery, Sonya doesn't realize how deadly the answers she's looking for will be. Based on Lynette Eason's Harlequin Love Inspired - Suspense novel Her Stolen Past.\n\nWatch Her Stolen Past, a full suspense thriller based on Lynette Eason’s Harlequin Love Inspired novel. When Sonya Daniels discovers the birth certificate of a kidnapped baby hidden in her late mother’s home, she uncovers secrets that may link her mother’s murder to the missing child. Teaming up with detective Brandon Hayes, Sonya races to uncover the truth, unaware of the deadly forces determined to stop them. Perfect for fans of mystery thrillers, suspenseful action movies, full free action films, crime drama full movies, and romantic suspense stories, Her Stolen Past delivers gripping twists, intense investigation, and high-stakes danger in a thrilling story you won’t be able to turn away from.\n\nWatch another intense Thriller Movie here - https://www.youtube.com/watch?v=CUDUo63UYBg\n\r\nStars: Shanice Banton, Krista Bridges, Darlene Cooke\n*Licensed from DuBow. All rights reserved*\n\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#hdthrillermovie #FullFreeMovies #MovieCentral #FreeYouTubeMovies\n00:00:00 Skip the opening credits\n00:01:15 Her Stolen Past Full Movie\n01:26:05 Skip the closing credits",
      "addedAt": "2025-12-26T23:59:32.780Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/6WUvLiU6DnY/maxresdefault.webp",
      "duration": 5228,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:32.867Z"
}