{
  "imdbId": "youtube-jAqeN3mzrTk",
  "title": "Off Limits – We are the law (CRIME THRILLER German full movie, new German movies complete)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jAqeN3mzrTk",
      "title": "Off Limits – We are the law (CRIME THRILLER German full movie, new German movies complete)",
      "description": "💙 Filme auf Deutsch & komplett kostenlos streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Spannender und toll inszenierter Krimi-Thriller aus Frankreich: Als ein Routineeinsatz außer Kontrolle gerät, sehen sich zwei Polizeibeamte mit der zwielichtigen Unterwelt der Stadt konfrontiert und sind entschlossen, ihren Namen reinzuwaschen...\n\nOFF LIMITS – WIR SIND DAS GESETZ (2010)\nOriginaltitel: Gardiens de l'ordre\nMit: Cécile De France, Fred Testot, Julien Boisselier, Nicolas Marié\nRegie: Nicolas Boukhrief\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nEin Routineeinsatz wird für die Polizisten Julie und Simon zu einem Albtraum, als sie in Notwehr den Sohn eines einflussreichen Politikers niederschießen. Bis die Umstände ihrer Tat aufgeklärt sind werden sie vom Streifendienst suspendiert. Als sie jedoch feststellen, dass ihr Opfer unter Einfluss der Designerdroge Sphinx stand, die Menschen in aggressive Bestien verwandelt, beschließen sie, auf eigene Faust zu ermitteln. Dabei stoßen sie auf das weit verzweigte Netz eines brutalen Drogensyndikats. Doch je mehr sie sich den Herstellern der Droge nähern, umso durchsichtiger wird ihre Tarnung. Die beiden Cops stehen kurz vor der Lösung ihres gefährlichsten Falls - und zugleich vor einem tödlichen Abgrund ...\n#Netzkino #ganzerFilm #Thrillerfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "jAqeN3mzrTk",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.125Z"
}