{
  "movieId": "youtube-BazW4Khzlcc",
  "title": "Django: Ein Sarg voller Blut - Western - Jetzt den ganzen Film kostenlos in HD schauen bei Movied",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BazW4Khzlcc",
      "id": "BazW4Khzlcc",
      "title": "Django: Ein Sarg voller Blut - Western - Jetzt den ganzen Film kostenlos in HD schauen bei Movied",
      "description": "*GANZER FILM - Italienischer Western-Klassiker aus den 60er Jahren*\n\nDen Spielfilm „Django: Ein Sarg voll Blut“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Django: Ein Sarg voll Blut“:\nIMDb: *5,8* von 10\nAmazon: *4,1* von 5\n\n*Die Handlung von „Django: Ein Sarg voll Blut“*\nDie beiden Revolverhelden Django (George Hilton) und Bull (Walter Barnes) kommen in das kleine Städtchen Laredo, wo sie von Richter Warren beauftragt werden, nach verschwundenen 500.000 US-Dollar in Gold zu suchen. Dieser Goldschatz gehörte eigentlich den Konföderierten Staaten von Amerika und wurde von einem Offizier im Kampf ums Überleben irgendwo im Ort versteckt.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Django: Ein Sarg voll Blut“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Western #Klassiker #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Il momento di uccidere\nLaufzeit: 92\nRegie: Giuliano Carnimeo\nFSK: 12\nErstveröffentlichung: 1968\n\n\n*Das sind die Schauspieler*\nGeorge Hilton (bekannt aus \"Django - Schieß mir das Lied vom Sterben“)\nin der Rolle des Django\nWalter Barnes (bekannt aus „Ein Fremder ohne Namen“, „Der Mann aus San Fernando“)\nin der Rolle des Bull\nLoni von Friedl (bekannt aus \"Zwei unter Millionen“, „Unfall im Weltraum“)\nin der Rolle der Regina Forester\n\n\n*Die Handlung und Szenen von „Django: Ein Sarg voll Blut“* \nDie beiden Outlaws Bull (Walter Barnes)und Lord (George Hilton) werden engagiert, um einen verschwundenen Schatz wiederzufinden. Der rechtmäßigen Erbin Regina (Loni von Friedl) liegt viel daran, die wertvollen Hinterlassenschaften ihres gefallen Vaters zu bekommen. Doch auch eine andere Gruppe von Banditen hat sich auf die Suche nach dem Geld gemacht und es dabei auf Bull und Lord abgesehen. Diese setzen sich mit aller Macht gegen die Gangster zur Wehr, doch müssen sie schon bald erkennen, dass irgendjemand hier ein doppeltes Spiel spielt...\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Django: Ein Sarg voll Blut“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:32:58.196Z",
      "thumbnail": "https://i.ytimg.com/vi/BazW4Khzlcc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDaRT6vw_kC7T6KVk2Mz2zhtnTCyg",
      "duration": 4936,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:32:58.243Z"
}