{
  "movieId": "youtube-kpvs0HRjUN8",
  "title": "Raiders of the Lost Ark",
  "year": 1981,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kpvs0HRjUN8",
      "id": "kpvs0HRjUN8",
      "title": "The Lost (Psychothriller full movie German, new German movies complete, full-length movies)",
      "description": "💙 Filme komplett auf Deutsch & in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Atmosphärischer Psychothriller mit düsterer Stimmung, guten Darstellerleistungen und einem geschickten Twist: Ein berühmter Psychiater behandelt ein junges Mädchen mit multipler Persönlichkeitsstörung, doch als er sich näher mit ihren Persönlichkeiten befasst, erkennt er, dass möglicherweise dunklere Mächte im Spiel sind...\n\nTHE LOST (2009)\nOriginaltitel: The Lost\nMit: Armand Assante, Dina Meyer, Lacey Chabert\nRegie: Bryan Goeres\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nKevin war einmal Psychiater, ehe er eine erfolgreiche Karriere als Autor begann. Während der Präsentation seines neuesten Buches in New York bittet ihn Mira, die Schwester einer ehemaligen Patientin, um Hilfe. Er soll mit ihr nach Barcelona zurückkehren, wo ihre Schwester Jane aufgrund seines Gutachtens vor drei Jahren in eine geschlossene Anstalt eingeliefert wurde und seitdem extrem leidet. Ein Fall von Schizophrenie – oder war es doch eine Fehldiagnose? Von Schuldgefühlen geplagt, willigt Kevin ein. Doch schon seine Ankunft in der spanischen Stadt, in der er einst gelebt und gearbeitet hat, bestärkt ihn in dem Bewusstsein, einen Fehler begangen zu haben. Je mehr er in den Fall eintaucht, desto klarer wird: Jane ist nicht nur Jane, sondern viele Persönlichkeiten ... Und eine davon hat ein Verbrechen begangen.\n#Netzkino #ganzerFilm #Psychothriller\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:36:47.500Z",
      "thumbnail": "https://i.ytimg.com/vi/kpvs0HRjUN8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD0bsrc_IEZ3fcDEWCB1ZQ0RqnBzQ",
      "duration": 5908,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-31T02:11:22.425Z"
}