{
  "imdbId": "youtube-KrOGyWQI0XM",
  "title": "Death on the Fourposter (1964, Horror) John Drew Barrymore, Gloria Milland, Luisa Rivelli | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KrOGyWQI0XM",
      "id": "KrOGyWQI0XM",
      "title": "Death on the Fourposter (1964, Horror) John Drew Barrymore, Gloria Milland, Luisa Rivelli | Movie",
      "description": "The party turns deadly! Mystery, mind games & murder.\nA group of friends visit a mansion owned by Riccardo, an artist. Strange events unfold, including predictions of tragedy and murder. As suspicion grows, they uncover dark secrets hidden within the castle.\n\nColorized version: https://youtu.be/hCv0bBMguTw\n\n\nOriginal title: Delitto allo specchio (1964) AKA: Sexy Party / Death on the Fourposter \n\nThis film has English audio, and subtitled in many languages.\n\nDirectors: Jean Josipovici, Ambrogio Molteni\nWriters: Jean Josipovici, Giorgio Stegani\nStars: John Drew Barrymore, Gloria Milland, Luisa Rivelli\nGenre: Italian giallo film, Horror, Thriller\n\n\n00:00 Full Movie (with subtitles)\n00:33 Exploration of a mysterious castle with intriguing characters and unexpected events.\n08:04 Mysterious events unfold at a castle party, involving relationships and secrets among the guests.\n12:36 Intriguing events unfold during a party at a secluded location, involving various characters and interactions.\n20:23 A group of friends engage in a dice game that reveals their true desires and tests their relationships.\n26:58 Supernatural occurrences unfold during a chilling experiment involving past and future revelations.\n39:37 Mysterious events unfold during a gathering, leading to unexpected discoveries and revelations.\n52:27 A group of individuals encounter a series of mysterious events involving prophecies and disappearances.\n57:56 Investigation of a mysterious murder reveals missing ring, potential suspects, and motive.\n1:07:32 Mysterious events unfold as a group searches for a missing person in a secluded location, leading to suspicion and fear.\n1:14:47 A group searches for a missing person in a mysterious house, uncovering secrets and facing danger.\n1:23:56 Murder mystery unfolds as Ricky is accused of killing Franca, with evidence implicating him found in a garden.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:38.366Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/KrOGyWQI0XM/maxresdefault.webp?v=661396cc",
      "duration": 5504,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:38.485Z"
}