{
  "movieId": "youtube-61Yqj6_fqrY",
  "title": "Lady Gangster 1942 | Film-Noir | Faye Emerson, Julie Bishop, Frank Wilcox | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=61Yqj6_fqrY",
      "id": "61Yqj6_fqrY",
      "title": "Lady Gangster 1942 | Film-Noir | Faye Emerson, Julie Bishop, Frank Wilcox | Full Movie",
      "description": "An actress gets involved with a criminal gang and winds up taking the rap for a $40,000 robbery. Before being sent to prison, she steals the money from her partners and hides it, she is thinking to use it as a bargaining chip to be released from prison. However, her former partners don't have the same ideas.\n\nOriginal title: Lady Gangster (1942)\n\nColorized version https://youtu.be/Wk2fF05nWgo\n\nDirector: Robert Florey \nWriters: Anthony Coldeway, Dorothy Mackaye \nStars: Faye Emerson, Julie Bishop, Frank Wilcox & Jackie Gleeson\nGenre:  Classics, Crime, Drama, Mystery, Film Noir\n\nThis film is available with dubbed French audio.  \nGo to video settings ⚙️  to change your audio / subtitle language options.\n\n00:00 Full Movie\n00:56  A woman witnesses a man with a knife about to attack another woman and calls for help.\n11:24  A woman named Dorothy Drew is being interrogated by Kenneth Phillips about her involvement in a gang, but Lewis Sinton wants to collaborate with her.\n15:14  Dot reveals her involvement in the robbery and wants to make amends.\n21:18  Dot Burton is in prison and is determined to help other women in there.\n31:59  Burton's sister is actually a man and knows where the money is.\n34:52  Dot Burton is requesting parole and it is revealed that she is the only one who knows the whereabouts of the stolen money.\n40:39  Burton is suspected of knowing where the money is and Phillips wants her to reveal its location before approving her release.\n45:27  Burton reveals to X that he knows where the money is and proposes a plan to get it back.\n51:02  A woman is in danger and needs protection while trying to retrieve some money.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:35.318Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/61Yqj6_fqrY/maxresdefault.webp?v=65417922",
      "duration": 3685,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:35.424Z"
}