{
  "movieId": "youtube-YfkwB25pPsM",
  "title": "Melodrama |Lost, Lonely and Vicious (1958) by Frank Myers | Colorized Movie",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YfkwB25pPsM",
      "id": "YfkwB25pPsM",
      "title": "Melodrama |Lost, Lonely and Vicious (1958) by Frank Myers | Colorized Movie",
      "description": "Boys and Girls Clawing Their Way to Success in Hollywood!\nJohnnie Dennis, a rising Hollywood actor, becomes fixated on death and consorts with his older-woman dramatic coach. His obsession leads him to the brink of suicide. However, his path crosses with Barbara Wilson, an innocent drugstore clerk, who intervenes and talks him out of taking his own life. \n\nOriginal title: Lost, Lonely and Vicious (1958)\n\nBlack & White version: https://youtu.be/rJe0pFAij0c\n\nThis film has many subtitle options\n\nDirector: Frank Myers\nWriter: Norman Graham\nStars: Ken Clayton, Barbara Wilson, Lilyan Chauvin\nGenre:  Colorized classics, Drama, Melodrama, Psychotronic \n\n\n00:00 Full Movie\n01:55 Behind-the-scenes drama of a young actor's struggles in a captivating town, seeking meaning in a world of imagination and reality.\n09:29 Drama unfolds in a small town as characters interact and discuss their ambitions, relationships, and struggles.\n15:30 Intense drama unfolds as a teacher navigates a complex relationship with a talented student and his coach, leading to feelings of isolation and longing.\n21:34 Tension and conflict arise among the characters as they navigate through jealousy, loneliness, and a sense of being lost.\n28:53 Struggle of an artist to attend a movie premiere, facing fear of crowds and self-doubt.\n34:40 A famous actor encounters a strange encounter while on his way to a swimming pool, leading to a series of bizarre interactions.\n42:01 Loneliness, personal connection, and memories are discussed during a conversation between Preacher and Johnnie.\n48:33 Struggles of Hollywood actors and their aspirations to be recognized in the industry, family dynamics, and personal relationships.\n52:43 Drama unfolds as characters navigate relationships, careers, and personal decisions in a small town setting.\n57:44 Drama unfolds as Johnnie and Tanya have a tense conversation, leading to Johnnie getting injured and leaving a mysterious letter for Tanya.\n1:06:34 A dramatic portrayal of inner turmoil and self-discovery, as Johnnie struggles with love, fear, and the conflict of reality.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:39:25.187Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/YfkwB25pPsM/maxresdefault.webp?v=65aa1908",
      "duration": 4353,
      "language": "en",
      "year": 1958,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:25.308Z"
}