{
  "imdbId": "youtube-LWnpGB3qO0Y",
  "title": "The Fate Of America Is In His Hands | America Has Fallen: Election Day | HD 2025 Political Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LWnpGB3qO0Y",
      "id": "LWnpGB3qO0Y",
      "title": "The Fate Of America Is In His Hands | America Has Fallen: Election Day | HD 2025 Political Movie",
      "description": "The Fate Of America Is In His Hands | America Has Fallen: Election Day | HD 2025 Political Movie - Francisco Suarez has the unique opportunity to interview one of the Presidential candidates. Torn by his desire to be objective, he is left with a choice that could mean the end of his career--but the deliverance of his country.\n\nWatch America Has Fallen: Election Day, a full HD 2025 political movie that puts the fate of the nation in one man’s hands. Francisco Suarez is given the chance to interview a Presidential candidate, but his struggle to remain objective forces him to make a choice that could end his career or determine the future of his country. Perfect for fans of political thrillers, HD free movies, full free action films, intense drama movies, and suspenseful election stories, America Has Fallen: Election Day delivers high stakes, gripping tension, and a thrilling story of courage, responsibility, and the price of truth.\n\r\nWatch another intense Thriller Movie here - https://www.youtube.com/watch?v=CUDUo63UYBg\n\r\nStars: Randy Vasquez, Rick Ravanello, Fernanda Moya\n*Licensed from Uncork'd. All rights reserved*\n\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies\n00:00:00 Skip the opening credits\n00:00:34 Full Movie Starts Here\n01:20:31 Skip the closing credits",
      "addedAt": "2025-12-26T23:59:32.403Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/LWnpGB3qO0Y/maxresdefault.webp",
      "duration": 5124,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:32.475Z"
}