{
  "imdbId": "youtube-4kuhbXBJnTg",
  "title": "Mars Needs Women (Sci-Fi, 1968) Tommy Kirk, Yvonne Craig | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4kuhbXBJnTg",
      "title": "Mars Needs Women (Sci-Fi, 1968) Tommy Kirk, Yvonne Craig | Movie",
      "description": "They Were Looking For Women. . . To Go All The Way!\nDop leads his fellow Martians to Earth on an interplanetary quest for females. Dop proves that Martians have impeccable taste when one of his first conquests turns out to be sexy scientist Dr. Marjorie Bolen. \n\nOriginal title: Mars Needs Women (1968) \n\nWith multiple subtitle languages\n\nDirector & Writer: Larry Buchanan\nStars: Tommy Kirk, Yvonne Craig, Byron Lord \nGenres: Classics, Cult, Sci-Fi\nBudget: $20,000 approximately \n\n00:00 Full Movie\n03:40  Mysterious signals from Mars are decoded, revealing that Mars needs women for a mission.\n11:07  The Martians demand the abandonment of the mission and threaten to leave without cooperation.\n23:02  A group of individuals discuss their roles in Operation Frozen Sleep and their mission on Earth.\n36:19  Mr. Fast is hypnotized and sent back to Seattle\n46:58  The interview with Dr. Bolen discusses the possibility of Aliens from Mars and their impact on Earth.\n53:52  Mars is the only planet where the possibility of life exists, with controversial canals believed to be an irrigation system\n1:07:27  Experts confirm the disappearance of three women in less than 12 hours, suspecting Martians and identifying a potential target for a secret raid.\n1:14:21  The theories and discoveries of Dr. Gustave Bolens, a renowned genetic expert, are exhibited in museums across the country.\n\n\nJoin us on a trip to planet CCC:\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdab9LsjsyqpseqaKefjzFvQ\n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "4kuhbXBJnTg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:39:00.255Z"
}