{
  "imdbId": "youtube-3QH-e6NyPAg",
  "title": "The Amazing Transparent Man (1960, Sci-Fi) Marguerite Chapman, Douglas Kennedy, James Griffith",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3QH-e6NyPAg",
      "title": "The Amazing Transparent Man (1960, Sci-Fi) Marguerite Chapman, Douglas Kennedy, James Griffith",
      "description": "Invisible and Deadly! A nation at his mercy!\nPaul Krenner, an ex-major with delusions of grandeur, has forced scientist Peter Ulof to develop a radiation-based technique to turn men invisible, with which process he plans to create an invisible army to sell to the highest bidder. He busts safecracker Joey Faust out of prison and forces him to undergo the invisibility treatment so he can steal more radium to further the experimentation. Plans go awry when Faust discovers there is a side-effect to the invisibility treatments he didn't count on.\n\nColorized version: https://youtu.be/Mg3T7xva0TY\n\n\nOriginal title: The Amazing Transparent Man (1960)\n\nDirector: Edgar G. Ulmer\nWriter: Jack Lewis\nStars: Marguerite Chapman, Douglas Kennedy, James Griffith\nGenres: Classics, Cult, Sci-Fi, Horror, Crime\nBudget: $100,000\n\n\n00:00 Full Movie (with subtitles)\n03:26 A criminal is recruited by a former military officer for a dangerous mission involving fissionable materials.\n09:57 A secretive laboratory conducts dangerous experiments with a new ray technology.\n22:40 Intrigue and betrayal unfold as characters navigate a dangerous situation involving a powerful ray gun.\n30:16 Intrigue and betrayal unfold as Faust becomes invisible, leading to a dangerous deal with Krenner.\n36:59 A scientist experiments with invisibility, leading to a heist plan and ethical dilemmas.\n42:24 A criminal plans heists using invisibility. Authorities struggle to stop him and his accomplice.\n50:36 A man with radiation poisoning is manipulated to help create an invisible army for a deranged military officer.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "3QH-e6NyPAg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:27.381Z"
}