{
  "imdbId": "youtube-2NFOg0w-c8A",
  "title": "Bloodline (HORRORFILM mit SEANN WILLIAM SCOTT, Horror Thriller ganzer Film auf Deutsch, neue Filme)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2NFOg0w-c8A",
      "title": "Bloodline (HORRORFILM mit SEANN WILLIAM SCOTT, Horror Thriller ganzer Film auf Deutsch, neue Filme)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Von den Machern von \"Sinister\" & \"Insidious\": Getrieben vom Wunsch, Kinder zu schützen, überschreitet ein Lehrer die Grenze zwischen Fürsorge und Wahnsinn – und verwandelt sich in einen eiskalten Rächer. Mit \"American Pie\" Schauspieler SEANN WILLIAM SCOTT!\n\nBLOODLINE (2018)\nOriginaltitel: Bloodline\nMit: Henry Jacobson\nRegie: Seann William Scott, Mariela Garriga, Dale Dickey\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nEvan (Seann William Scott) liebt seine Frau Lauren (Mariela Garriga) und seinen neugeborenen Sohn über alles – so sehr, dass er notfalls auch über Leichen gehen würde, um diese zu beschützen. Und nicht nur seine eigene Familie: Als Vertrauenslehrer an einer Highschool hat er tagtäglich mit Kindern und Jugendlichen zu tun, die zu Hause von ihren Eltern oder anderen Erwachsenen missbraucht und misshandelt werden. Während er die Geschichten von Schülern und Schülerinnen wie Ray (Sean H. Scully), Kelly (Larsen Thompson) oder Chris (Raymond Cham) anhören muss und sich auch zu Hause die Probleme ansammeln, rastet Evan irgendwann aus und mutiert zum Serienkiller, der die Erwachsenen, die seine Schüler misshandeln, brutal ermordet. Doch schon bald kommt ihm die Polizei auf die Schliche...\n#Netzkino #ganzerFilm #Horrorfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "2NFOg0w-c8A",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}