{
  "imdbId": "youtube-Jy9n_gsnmI4",
  "title": "Soil (Heulg)(1960)",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Jy9n_gsnmI4",
      "title": "Soil (Heulg)(1960)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00548\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00548\n\n감독(Director) : 권영순(Kwon Young-Sun)\n출연 : 김진규,문정숙,조미령,박암,이빈화,김승호,김동원,최남현,황정순,한미나,김아미,주선태,성소민,황해,허장강,김현주,김영옥,전영주,서월영,이해랑,조항,정애란,한은진,남미랑,고설봉,백송,윤왕국,임운학,이업동,맹만식,중윤수\n\n줄거리 : 1930년대 일제의 학정이 심하던 시대, 흙에서 태어나 흙과 더불어 살다 죽겠다는 허승(김진규)은 윤참판의 덕택으로 서울로 올라와 대학에 다닌다. 그는 대학을 마치고 자신이 목표하던 대로 고향 산여울로 돌아가고자 하나, 윤참판의 권유로 일본에 가서 고등문관시험을 보고 우수한 성적으로 시험에 붙는다. 허승은 고향에 두고 온 애인 유순(조미령)이 그가 오기만을 기다리고 있음에도 그녀를 버리고 윤참판의 딸 정선(문정숙)과 결혼한다. 정선은 남편이 판검사가 되어 성공하고 부자가 되기를 바라나 허승은 변호사가 되고 그녀의 기대를 만족시켜주지 못한다. 처음부터 고향으로 돌아가 농촌사업을 하고 싶었던 그는 유순을 사랑하는 한갑(성소민)을 비롯해 고향사람 몇이 일제의 학정에 항의하다 감옥에 갇히자, 그들을 돕기 위해 고향으로 내려간다. 남편이 못마땅한 정선은 남편의 친구인 김갑진(박암)과 바람을 핀다. 한편 허승은 온힘을 다해 마을 사람들이 풀려날 수 있도록 돕는다. 고향에서 허승은 농촌사업이야말로 나라를 위하는 일임을 다시 한번 확인하고 귀농할 것을 결심한다. 잠시 서울로 올라 온 허승은 정선의 외도를 알게 되고 그녀의 뜻 대로 하라는 편지를 남기고 고향으로 돌아간다. 상심한 정선은 비속에서 기찻길을 헤매며 자살을 시도하나, 이를 본 아버지 윤참판이 그녀를 구하고 대신 죽는다. 한쪽 다리를 잃은 정선은 그제야 남편의 뜻을 이해한다. 그녀는 허승을 사모해 같이 농촌사업을 하고 싶어하던 선희(이빈화)와 함께 허승이 있는 곳으로 찾아간다.\n\nCasts : Kim Jin-Kyu, Moon Jeong-Sun, Kim Seung-Ho, Cho Mi-Ryeong\n\nSYNOPSIS : During the 1930s, the oppression of Japanese rule was severe. Heo Seung (Kim Jin-gyu) who states that he was \"born from soil, will live in soil, and die in soil,\" goes to live at Yun's house, a government official in Seoul.  In Seoul, he attends college, and after graduating, he plans to go back to his hometown in Sannyeoul, but Yun persuades him to go to Japan and take the High Civil Service Examination, which he passes with flying colors. Although Heo Seung's lover, Yu Sun (Joe Mi-ryeong), waits for him in his hometown, he dismisses her and marries Yun's daughter, Jeong-un (Mun Jeong-suk). Although Jeong-seon wants Heo Seung to succeed and become a judge or public prosecutor and be rich, Heo Seung becomes a lawyer and does not live up to her expectations. Heo Seung, who had wanted to work in the agricultural sector in the first place, goes back to his hometown to help Han Gap (Seong So-min)who is now courting Yu Sun and the other villagers, who have been imprisoned after protesting against Japanese oppression. Displeased by her husband's choices, Jeong-seon has an affair with his friend, Kim Gap-jin (Park Am), even while Heo Seung is helping to free the villagers. Discovering once again that farm work is the true way to help his country, he decides to return to his village. In Seoul for a short while, however, Heo Seung finds out about his wife's affair, returning to his hometown after writing her a letter telling her to do as she pleases. Grieved by the news that her husband has left her, Jeong-seon attempts suicide by putting herself in front of a train, but her father dies while trying to save her.  Losing her leg in the attempt, Jeong-seon slowly begins to understand her husband and his passions. She, along with Seon-hui (Lee Bin-hwa), who admires Heo Seung and had been wanting to work on a farm as well, go down to the village to be with him.",
      "id": "Jy9n_gsnmI4",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:00.177Z"
}