{
  "imdbId": "youtube-2AM2YEpVHaU",
  "title": "What You Didn't Know About This Cult Film : Rocket Attack U.S.A. (1960) Audio Commentary",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2AM2YEpVHaU",
      "id": "2AM2YEpVHaU",
      "title": "What You Didn't Know About This Cult Film : Rocket Attack U.S.A. (1960) Audio Commentary",
      "description": "Rocket Attack U.S.A. is a cultural artifact where propaganda, poverty-row filmmaking, and atomic anxiety collide – essentially proving that bad movies can be great historical documents. Featuring  C. Courtney Joyner,  and  Mark Jordan Legan (Film Freaks Forever podcast) \n\nWatch the film without commentary: \n\nNuclear Paranoia Amplified\nThe commentary dissects how the film weaponizes atomic-age fears, with absurdly low-budget special effects .\n\nBarry Mahon's \"Auteur\" Flair\nHighlights director Mahon's transition from Disney animator to exploitation kingpin, noting his signature moves: recycled stock footage, wooden actors delivering apocalyptic monologues, and propaganda masquerading as plot.\n\nCold War Zeitgeist\nThe analysis emphasizes how the film reflects 1960s civil defense hysteria – particularly the \"duck and cover\" mentality – while accidentally revealing how poorly funded anti-communist films actually were.\n\nMST3K Legacy\nMystery Science Theater 3000's cemented its place in bad-movie history. The commentary draws parallels between Cold War propaganda and later \"so bad it's good\" culture.\n\nStar Power?\nLead actor John McKay's previous credit: \"guy who reads civil defense pamphlets\" in government films.\n\nHistorical Irony: Released months before the Cuban Missile Crisis, making its hysterical tone suddenly less ridiculous.",
      "addedAt": "2025-12-24T00:59:14.440Z",
      "thumbnail": "https://i.ytimg.com/vi/2AM2YEpVHaU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBM-XeK-krotPDnnKShBtIJ-VBWeQ",
      "duration": 3818,
      "language": "en",
      "year": 1960,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:59:14.440Z"
}