{
  "imdbId": "youtube-0xpPuJDTwlM",
  "title": "Have a Nice Night (1990, Crime) Guy Marchand, Michael Brandon | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0xpPuJDTwlM",
      "title": "Have a Nice Night (1990, Crime) Guy Marchand, Michael Brandon | Movie",
      "description": "The star Barbara Jenkins, after two years of absence, makes her return by honoring the presence of the auction of her costumes in Cannes, for the benefit of the fight against AIDS.\n\nOriginal title: Passez une bonne nuit (1990).\nThis film has English & French audio, and subtitles in many language option.\n\nDirectors: Jeannot Szwarc, Nicolas Zappi\nWriters: James Hadley Chase, Alec Medieff, Sergio Gobbi\nStars: Michael Brandon, Marisa Berenson, Guy Marchand, Alexandra Lorska\nGenre: Crime\n\n\n00:00 Full Movie (with subtitles)\n02:58 High-stakes poker night brims with intrigue, as personal and professional challenges collide.\n10:40 Secrets unravel at a hotel, plunging guests into mystery and unexpected twists.\n20:31 Mysterious events at a music festival lead to a suspected suicide at a hotel.\n26:08 An undercover mission unfolds at a glamorous hotel event featuring a famous actress and a priceless emerald.\n33:44 A movie star's valuable jewel becomes the center of a mystery and a suspicious death.\n41:11 A tragic revelation strikes at a high-profile hotel gala.\n55:21 A detective uncovers hidden identities while investigating a false lead and a missing person.\n1:06:32 A hotel auction spirals into chaos, ending in a tense hostage situation.\n1:16:52 A thrilling robbery sparks a chase, poker game, and celebrity interview at a hotel.\n\n\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdaVNpTE5NfgyPqL-rKc8VsL",
      "id": "0xpPuJDTwlM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:39.191Z"
}