{
  "movieId": "youtube-zJAQ2xvbzGE",
  "title": "War Western | Renegade Girl (1946) directed by William Berke | Colorized Movie",
  "year": 1946,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zJAQ2xvbzGE",
      "id": "zJAQ2xvbzGE",
      "title": "War Western | Renegade Girl (1946) directed by William Berke | Colorized Movie",
      "description": "A Leader Among Outlaws...Yet Just a Woman in Love! \nIn Missouri, a Civil War border state, the leaders of a Union cavalry troop realize that they are being spied on by Jean Shelby (Ann Savage), whose family is allied with the notorious William Quantrill (Ray Corrigan). The Union men set out to track down Shelby, and Captain Fred Raymond (Alan Curtis) ends up finding Jean. But Capt. Raymond and Jean rapidly fall in love, all the while realizing that a romantic relationship would test their loyalties and endanger their lives.\n\nOriginal title: Renegade Girl\nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/KELIrMhO6lM\n\n\nDirector: William Berke\nWriter: Edwin V. Westrate\nStars: Ann Savage, Alan Curtis, Edward Brophy & Ray Corrigan\nGenres: Colorized classics, Western, War, Romance\n\n\n00:00 Full Movie (with subtitles)\n02:20 A group of soldiers embarks on a dangerous mission to ensure the safety of a woman named Shelby in Missouri.\n06:54 A young woman named Jean Shelby gets involved in a dangerous situation with soldiers and outlaws.\n13:53 Jean helps a captured Yankee soldier escape, leading to a confrontation with a group of men.\n20:52 A dramatic story unfolds as Fred Raymond helps Jean in a time of need during the Civil War.\n29:08 Tensions rise as former enemies reunite in a post-war setting, discussing past conflicts and uncertain futures.\n33:35 A woman is approached to join a group seeking revenge after the Civil War, leading to unexpected developments.\n38:27 A rebellious woman seeks revenge against White Cloud with the help of a gang.\n44:24 The pursuit of the fugitive White Cloud intensifies as tensions rise among the group of men.\n48:34 Conflict arises as plans are disrupted and trust is questioned among a group of individuals in a Western setting.\n52:41 Love, betrayal, and reunion unfold as Jean and Bob navigate through past relationships and future plans.\n1:01:00 A tale of love, betrayal, and redemption unfolds as two characters navigate a dangerous world in pursuit of their desires.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:20.252Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/zJAQ2xvbzGE/maxresdefault.webp",
      "duration": 3987,
      "language": "en",
      "year": 1946,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:20.371Z"
}