{
  "imdbId": "youtube-Y6D136RHiVc",
  "title": "[4K] 그 섬에 가고싶다(1993) / To the Starry Island(Geu seom-e gago sipda)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y6D136RHiVc",
      "title": "[4K] 그 섬에 가고싶다(1993) / To the Starry Island(Geu seom-e gago sipda)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04678\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04678\n\n감독(Director) : 박광수(Park Heonsu)\n출연 : \n안성기 , 문성근 , 심혜진 , 안소영 , 이용이 \n줄거리 :   문재구는 자신을 고향인 섬에 묻어달라는 아버지 문덕배의 유언에 따라 꽃상여를 싣고 섬으로 향한다. 섬에 가까와지자 섬사람들의 맹렬한 반대가 시작되고, 혼자 섬에 도착한 재구의 친구 김철은 네여인에 대한 추억과 그해 여름날의 한 사건을 떠올린다. 한국전쟁이 일어나던 해, 딸을 잃고 정신나간 넙도댁, 타고난 색기를 지닌 벌떡녀, 죽은 엄마의 영혼을 만나게 해준 업순네, 그리고 마을 아낙들이 억지로 시집보낸 날 늙은 신랑을 내쫓고 아이들과 놀아주고, 혼수상태의 철에게 젖을 물려주던 옥님이. 무장한 인민군이 반동분자 색출을 시작하자, 모든 사태가 섬에서 쫓겨난 덕배의 농간이라 생각한...\n\nCasts : Ahn Sung-ki, Moon Sung-keun, Shim Hye-jin, Ahn So-young, Lee Yong-yi\nSYNOPSIS : The starry island is symbolic of a place where w all want to go, a place where there are no conflicts, and no fighting exists Four women who have their own life styles live on this island. Their names are Oknimi, Bulttoknyo, Nupdodaek, and Upsoonne, They are very tough survivors. Oknimi believes that if a human being dies, he or she becomes a star in the sky, which means that human beings are very important and are as permanent as stars in the sky. On the sea in summer, a funeral boat is passing The chief mourner and friends in the boat are overcome which sorrow Moon Jae-Goo, The chief mourner, remembers his father's desire to be buried in his home village. It is too heavy a burden for Moon to carry out poet Kim Chul, a friend of Moon's insists that Moon's to carry out poet Kim Chul, a freind of Moon's insists that Moon's father's wish should be carried out. As expected the island people insist that Moon's father should not be buried on their island, even if he was born on this island. Poet Kim Chul lands alone on this island and remembers the four women mentioned above and an affair that he had with one of them one summer long age.",
      "id": "Y6D136RHiVc",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:21:30.721Z"
}