{
  "imdbId": "youtube-2RodJvBhjT0",
  "title": "Offseason - Island of Horror (HORROR full movie German, horror movies full length German 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2RodJvBhjT0",
      "title": "Offseason - Island of Horror (HORROR full movie German, horror movies full length German 2025)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein atmosphärischer Horror-Gruseltrip, der Großmeistern wie John Carpenter & H.P. Lovecraft huldigt! Nachdem sie einen mysteriösen Brief erhalten hat, reist eine Frau in eine verlassene Inselstadt und ist bald in einem Albtraum gefangen... \n\nOFFSEASON – INSEL DES GRAUENS (2021)\nOriginaltitel: Offseason\nMit: Jocelin Donahue, Joe Swanberg, Richard Brake\nRegie: Mickey Keating\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nMarie (Jocelin Donahue, „The House of the Devil“) erhält eine mysteriöse Nachricht, dass das Grab ihrer Mutter auf der entlegenen Lone Palm Island verwüstet worden ist. Mit ihrem Freund George (Joe Swanberg, „You’re Next“) kommt sie gerade auf der nebelverhangenen Insel an, bevor die einzige Brücke bis zur nächsten Feriensaison geschlossen wird. Schnell dämmert es Marie, dass an dem einsamen Ort und seinen feindseligen Bewohnern etwas faul ist. Und findet sich in einem Albtraum wieder, aus dem es kein Entkommen zu geben scheint…\n#Netzkino #ganzerFilm #horrorfilme \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "2RodJvBhjT0",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}