{
  "imdbId": "youtube-aag4qYYtm6k",
  "title": "Hysteria –  In guten Händen (Komödie mit Starbesetzung, Ganze Komödie, Liebesfilm in voller Länge)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aag4qYYtm6k",
      "title": "Hysteria –  In guten Händen (Komödie mit Starbesetzung, Ganze Komödie, Liebesfilm in voller Länge)",
      "description": "► Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Im Zeitalter der grossen Erfindungen macht sich ein Mann daran, ein Heilmittel zu finden für das Leiden der Frauen... und elektrisierte ganz nebenbei unser aller Liebesleben!\n\nHYSTERIA –  IN GUTEN HÄNDEN (2011)\nOriginaltitel: Hysteria\nMit: Maggie Gyllenhaal, Hugh Dancy, Jonathan Pryce\nRegie: Tanya Wexler\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nUm 1880 befindet sich die viktorianische Prüderie auf dem Höhepunkt, während gleichzeitig die Elektrizität ihren Siegeszug beginnt. In London ist derweil der leidenschaftliche junge Arzt Mortimer Granville (HUGH DANCY) auf der Suche nach einem neuen Job und stösst dabei auf Dr. Robert Dalrymple (JONATHAN PRYCE). Als Hysterie- und vermeintlicher Frauen-Experte hat er es mit einer stetig steigenden Zahl von Patientinnen zu tun. Zur Heilung legen Dalrymple und sein junger Kollege an ziemlich intimen Stellen Hand an – und haben damit durchschlagenden Erfolg.\nAls er in beiden Händen von Krämpfen geplagt wird, findet Mortimers medizinische Laufbahn genau wie seine Verlobung mit der jüngeren Tochter seines Chefs (FELICITY JONES als Emily) ein im wahrsten Sinne des Wortes unbefriedigendes Ende. Um eine schnelle Lösung zu finden, tut er sich mit seinem alten Freund und Wissenschaftler Edmund St. John-Smythe (RUPERT EVERETT) zusammen.\nDie Elektrizität hat ihre ganz eigene Faszination und beflügelt Mortimer schliesslich zur Erfindung des Vibrators. Somit erweist er nicht nur seinen hysterischen Patientinnen, sondern auch der sexuellen Befreiung der Frau im Allgemeinen einen grossen Dienst. Und es dauert nicht lange, bis auch zwischen ihm und Emilys fortschrittlicher Schwester Charlotte (MAGGIE GYLLENHAAL) \n die Funken sprühen.\n#Spielfilm #ganzerFilm #Komödie\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "aag4qYYtm6k",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [
    "blocked"
  ],
  "qualityNotes": "YouTube video blocked/unavailable",
  "lastUpdated": "2025-12-24T00:09:29.195Z"
}