{
  "imdbId": "youtube-js4xc_n2bvA",
  "title": "[4K] 살인마(1965) / A Bloodthirsty Killer ( Sal-inma )",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=js4xc_n2bvA",
      "title": "[4K] 살인마(1965) / A Bloodthirsty Killer ( Sal-inma )",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\n\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01192\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01192\n\n\n감독(Director) : 이용민(Lee Yong-Min)\n출연 : 도금봉,이예춘,정애란,이빈화,남궁원,추석양,강문,조석근,나정옥,이업동,김확실,최정애,임윤희,한재경\n\n\n줄거리 : 이시목(이예춘)은 갤러리에서 오래 전에 죽은 아내 애자(도금봉)의 초상화를 발견한다. 택시를 탄 그는 수상쩍은 화가 춘철의 집으로 끌려가고 화가는 막무가내로 초상화를 가져가라고 하면서 급하게 이시목을 침대 밑에 숨긴다. 침대 밑에 숨은 그는 화가(추석양)가 어느 여자에게 살인당하는 장면을 목격하고 자신이 살인범으로 몰릴까봐 도망친다. 그러나 그 초상화를 집에 가져오고 나서 괴이한 일들이 발생한다. 오래 전에 죽은 아내 애자가 나타나 아이들을 잡아가고, 불공을 드리고 오던 어머니 허씨(정애란)는 애자에 의해 죽임을 당한다. 애자의 혼령은 허씨의 몸으로 들어오고, 이로 인해 허씨는 고양이와 유사한 행동을 한다. 이시목의 아내 혜숙(이빈화) 역시 애자에게 죽임을 당한다. 이를 막으려던 이시목을 의문의 여인이 막아선다. 결국 혜숙은 죽고, 이시목은 자신의 어머니가 고양이 귀신이 붙었다는 것을 알고 죽인다. 이시목은 초상화가 화근이라고 생각하고 초상화를 찢으려 한다. 이때 그는 화가가 남긴 일기를 발견하고 비극의 전말을 알게 된다. 박 의사(남궁원)와의 애정행각 장면을 며느리 애자에게 발각당한 허씨와, 애자와 이시목의 금슬을 시기하던 애자의 친척 동생 혜숙은 이시목이 출장 간 사이 애자에게 약을 먹여 말을 하지 못하도록 하고, 애자가 화가 춘철과 불륜관계에 있는 것처럼 꾸민다. 돌아온 이시목은 화를 내고 허씨와 혜숙은 애자를 춘철의 집으로 쫓아낸다. 애자의 말문이 트일 즈음 허씨와 혜숙은 애자에게 독약을 먹인다. 춘철이 죽어가는 애자를 겁탈하려하자 애자는 한을 품으며 칼로 찔러 자살한다. 애자는 자신의 고양이에게 한을 풀어달라고 하며 죽고, 고양이는 애자의 피와 살을 먹으며 큰다. 애자의 한을 품은 고양이는 자라 박 의사와 허씨, 혜숙에게 복수를 한 것이다. 의문의 여인은 이시목의 마당에 있는 보살로서 그녀는 무사히 아이들을 돌려보낸다.\n\n\nCasts : Lee Ye-Chun, Do Keum-Bong, Lee Bin-Hwa\n\n\nSYNOPSIS : There live a husband and a wife, who are married so happily that her jealousy mother-in-law, his stepmother, poisons her daughter-in-law with the help of her housemaid. This is a horror movie about the revenge done by the woman's ghost who has been murdered undeservedly and reincarnated in a cat, upon the mother-in-law and the housemaid.",
      "id": "js4xc_n2bvA",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw",
      "regionRestriction": {
        "blocked": [
          "RU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:24.529Z"
}