{
  "movieId": "youtube-rf2LORKLEwo",
  "title": "Daughter of Horror (1955) [Film Noir] [Horror] [Mystery]",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rf2LORKLEwo",
      "id": "rf2LORKLEwo",
      "title": "Daughter of Horror (1955) [Film Noir] [Horror] [Mystery]",
      "description": "\"Daughter of Horror\" (also known in a slightly altered version as \"Dementia\") is an American film by John Parker, incorporating elements of the horror film, film noir and expressionist film. It was produced in 1953, but not released until 1955.\n\nA young woman awakens from a nightmare in a run down hotel. She leaves the building and wanders through the night, passing a newspaper man. The news headline \"Mysterious stabbing\" catches her eye, and she quickly leaves. In a dark alley, a whino approaches and grabs her. A policeman rescues her and beats up the drunken man. Shortly later, another man approaches her and talks her into escorting a rich man in a limousine. While they cruise the night, she remembers her unhappy youth with an abusive father, whom she stabbed to death with a switchblade after he had killed her unfaithful mother. The rich man takes her to various clubs and then to her noble apartment. As he ignores her while having an extensive meal, she tries to tempt him. \n\nWhen he advances her, she stabs him with her knife and pushes the dying man out of the window. Before his fall, he grabs her pendant. The woman runs down onto the street and, as the dead man's hand won't relieve her pendant, cuts off the hand while being watched by faceless passerby's. Again, the patrol policeman shows up and follows her. She flees and hides the hand in a flower girl's basket. The pimp shows up again and drags her into a night club, where an excited audience watches a jazz band playing. The policeman enters the club, while the rich man, lying at the window, points out his murderess with his bloody stump. The crowd encircles the woman, laughing frantically. The woman wakes up in her hotel room, her encounters have supposedly been a nightmare. In one of her drawers, she discovers her pendant, clutched by the fingers of a severed hand. The camera leaves the hotel room and moves out into the streets, while a desperate cry can be heard.\n\n---\n\nDirected by John Parker, produced by John Parker, Ben Roseman and Bruno VeSota (as Bruno Ve Sota), written by John Parker, starring Adrienne Barrett, Bruno VeSota (as Bruno Ve Sota), Ben Roseman and Angelo Rossitto.\n\n---\n\nSource: \"Dementia (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 4 April 2013. Web. 29 May 2013. http://en.wikipedia.org/wiki/Daughter_of_Horror.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:22.758Z",
      "thumbnail": "https://i.ytimg.com/vi/rf2LORKLEwo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBLf3Prw8yjc-Wlw9ghj2vaUsw0BQ",
      "duration": 3283,
      "language": "en",
      "year": 1955,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T22:41:22.758Z"
}