{
  "movieId": "youtube-95NF5f47i0w",
  "title": "Mary Higgins Clark: Dass du ewig denkst an mich (KRIMI ganzer Film auf Deutsch, Mystery Thriller)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=95NF5f47i0w",
      "id": "95NF5f47i0w",
      "title": "Mary Higgins Clark: Dass du ewig denkst an mich (KRIMI ganzer Film auf Deutsch, Mystery Thriller)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Die Studentin Laurie wird beschuldigt, ihren Englischprofessor ermordet zu haben – doch sie kann sich an nichts erinnern. Am Tatort finden sich ihre Fingerabdrücke überall, auch auf der Tatwaffe. Der Mordprozess beginnt.\n\nMARY HIGGINS CLARK: DASS DU EWIG DENKST AN MICH (2002)\nOriginaltitel: All Around the Town\nMit: Nastassja Kinski; Tobias Moretti; Andrea Roth\nRegie: Paolo Barzman\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nAls der beliebte College-Professor Allan Grant (Kevin Jubinville) ermordet wird, trauern viele um ihn. Aber auch seine Frau Karen (Nastassja Kinski) weiß, dass er nicht nur gerne flirtetet , sondern ein regelrechter Frauenheld war. Wegen dieses Rufs ist eine seiner attraktiven Studentinnen, Laurie Kinmount (Kim Schraner), schnell die Hauptverdächtige bei den Ermittlungen, vor allem nachdem sie sich öffentlich mit dem Professor gestritten hatte. Dies macht die Dinge schnell kompliziert, da Lauries Schwester Sarah (Andrea Roth) die Staatsanwältin ist, und mit dem Fall betraut wurde. Da Laurie sich nicht an die Geschehnisse in der Mordnacht erinnern kann, ziehen Sarah und Detective Brandon Moody (Ron Lea) einen Psychiater hinzu, um Lauries Erinnerungvermögen wieder herzustellen. Dieser diagnostiziert eine dissoziative Identitätsstörung. Er findet aber Zugang zu Laurie und kann Schritt für Schritt die Erinnnerungen wieder herstellen. Was dabei ans Licht kommt, ist mehr, als irgendjemand verkraften kann ..\n#Netzkino #ganzerFilm #krimi\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:47:19.305Z",
      "thumbnail": "https://i.ytimg.com/vi/95NF5f47i0w/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA5bHexlG3P8ndqP34cip5QCprYdQ",
      "duration": 5210,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}