{
  "movieId": "youtube-lZuHHzKdovM",
  "title": "Film-Noir | Shock (1946) Vincent Price, Lynn Bari | Movie, Subtitles",
  "year": 1946,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lZuHHzKdovM",
      "id": "lZuHHzKdovM",
      "title": "Film-Noir | Shock (1946) Vincent Price, Lynn Bari | Movie, Subtitles",
      "description": "He never dreamed what it would all lead to...and she didn't care !\nA psychologically distraught woman is committed to a private sanitarium by the man she witnessed commit a murder.\n\nColorized version: https://youtu.be/q1LpMXjAL9Q\n\nThis film is available in English and with Spanish & German dubbed audio, and subtitles in many language options.\n\nDirector: Alfred L. Werker\nWriters: Eugene Ling\nStars: Vincent Price, Lynn Bari, Frank Latimore \nGenre:  Classics, Cult Film,  Film-Noir, Thriller \nBudget: $375,000\n\n\n00:00 Full Movie (with subtitles)\n01:21 A woman named Janet suffers a shock upon reuniting with her husband Lt. Stewart, leading to a need for medical help.\n10:22 Medical drama unfolds as a doctor assesses a woman's mysterious condition, leading to a plan for her care.\n16:32 Medical drama unfolds as a doctor helps a patient with amnesia recall a murder she witnessed.\n23:56 A doctor consults with a colleague about a patient's condition and treatment plan, while facing suspicions and dilemmas.\n32:42 A psychological thriller unfolds as a woman's hallucinations lead to a murder mystery.\n39:34 Patient suffering from delusions in a mental institution, convinced doctors are murderers. Doctor tries to convince patient of delusions.\n46:48 A doctor is approached by the district attorney's office to investigate his wife's death, leading to suspicions and dark plans.\n51:25 A dark plot unfolds involving murder, deception, and a suspicious nurse in a 1946 film.\n58:36 Medical treatment using insulin shock therapy leads to unexpected revelations and a life-threatening situation.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:52:11.416Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/lZuHHzKdovM/maxresdefault.webp?v=666e71f2",
      "duration": 4198,
      "language": "en",
      "year": 1946,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:52:11.570Z"
}