{
  "movieId": "youtube-gPJdkZkPb0s",
  "title": "The Phantom from 10,000 Leagues (1955, Horror) Kent Taylor, Cathy Downs | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gPJdkZkPb0s",
      "id": "gPJdkZkPb0s",
      "title": "The Phantom from 10,000 Leagues (1955, Horror) Kent Taylor, Cathy Downs | Movie",
      "description": "Sheer horror as a living nightmare stalks the ocean floor!\nA seaside community is terrorized by a hideous sea monster, which has been created by experiments in atomic radiation. Human bodies, charred and radioactive, begin to drift ashore.\n\nColorized version: https://youtu.be/QoBLeGrdb4M\n\n\nOriginal title: The Phantom from 10,000 Leagues (1955)\nThis film is subtitled in many languages.\n\nDirector: Dan Milner\nWriters: Lou Rusoff, Dorys Lukather\nStars: Kent Taylor, Cathy Downs, Michael Whalen\nGenres: Classics, Cult Film, Horror, Sci-Fi\nBudget: $100,000\n\n\n00:00 Full Movie (with subtitles)\n03:57 Mysterious events unfold as individuals with hidden motives converge near a burnt boat found in the ocean.\n24:52 Mysterious events unfold around a professor and a fisherman's body, leading to a request for a detailed ocean study.\n31:52 Scientist discovers a radioactive light source on the ocean floor, theorizes about mutations and potential weaponization.\n36:45 A mysterious encounter leads to discussions about betrayal, scientific discoveries, and hidden motives.\n49:57 A tale of mystery, intrigue, and danger unfolds as various characters become entangled in a web of deceit and treachery.\n1:05:51 Intrigue unfolds as suspicions arise regarding a murder at the school, leading to a surprising revelation.\n1:10:21 A discovery of a powerful force leads to destructive consequences, prompting a search for answers and a race against time.\n\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:24.785Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/gPJdkZkPb0s/maxresdefault.webp?v=661cd2e0",
      "duration": 4824,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:24.887Z"
}