{
  "imdbId": "youtube-1MiPJ6muYKM",
  "title": "Three Desperate Men (Western, 1951) Preston Foster, Jim Davis, Virginia Grey",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1MiPJ6muYKM",
      "title": "Three Desperate Men (Western, 1951) Preston Foster, Jim Davis, Virginia Grey",
      "description": "There was no turning back... This was their  \"last raid\"!\nTwo deputies from Texas travel to California to rescue their brother from the gallows, but after their daring escape, they find themselves hunted by the law and tempted by the allure of outlaw life, leading to a series of escalating crimes that shake the entire territory and threaten their own survival.\n\nColorized version: https://youtu.be/44Sgd9xK18g\n\n\nOriginal title: Three Desperate Men (1951) AKA: The Daltons Last Raid / Three Outlaws\nThis film is is subtitled with many language options.\n\nDirector: Sam Newfield\nWriter: Orville H. Hampton\nStars: Preston Foster, Jim Davis, Virginia Grey\nGenres: Action, Crime, Western\n\n\n00:00 Full Movie (with subtitles)\n02:49 Three outlaws plan their next move while facing financial challenges and a burial dilemma in a western setting.\n12:25 Three brothers seek justice for falsely accused sibling in a train robbery and murder case.\n17:31 Three men face escalating trouble after a wrongful hanging leads to a series of crimes in the Wild West.\n27:20 Three outlaws on the run discuss their past crimes and dwindling funds at a remote cabin.\n37:50 Three men plan a train robbery to escape charges, but betrayal and guilt complicate their scheme.\n46:22 Three outlaws plan a heist in their hometown while evading a former lawman on Thanksgiving Day.\n1:00:24 Three outlaws plan a heist, but face unexpected challenges and consequences in a Western setting.\n\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "1MiPJ6muYKM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:10.629Z"
}