{
  "imdbId": "youtube-1OUaw_JDPVs",
  "title": "Lee Van Cleef | The Big Combo 1955 (Film-Noir, Crime) Colorized Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1OUaw_JDPVs",
      "id": "1OUaw_JDPVs",
      "title": "Lee Van Cleef | The Big Combo 1955 (Film-Noir, Crime) Colorized Full Movie",
      "description": "In the world of crime, Justice has a high price.\n\nThe relentless police lieutenant Leonard Diamond is determined to bring down a cunning crime kingpin, Mr Brown.  But navigating a treacherous path of corruption, betrayal and obsession,  will he risk everything for the truth & justice?\n\nOriginal title: The Big Combo 1955\n\nBlack & White version:  https://youtu.be/OITrTnAqWI8\n\n\nDirector: Joseph H. Lewis\nWriter: Philip Yordan\nStars: Lee Van Cleef, Cornel Wilde, Richard Conte, Jean Wallace\nGenres: Crime, Drama, Film-Noir, Thriller\n\n00:00 Full Movie\n01:49 A police officer named Leonard is determined to bring down a criminal organization led by Mr. Brown, but struggles to gather evidence and convince his superiors to support him.\n09:53 Mr. Brown's girlfriend, Susan, attempts suicide and is arrested for homicide.\n20:52 A police lieutenant interrogates Mr. Brown about a woman named Alicia.\n22:47 A conversation between two individuals about false arrests and a missing person leads to a revelation about a potential connection between a hoodlum and a closed case.\n38:06 Lt. Diamond interrogates a man named Bettini in order to gather information about Brown and his associates.\n41:17 Lt Diamond investigates the mysterious disappearance of Alicia Brown and uncovers a possible murder plot.\n48:11 A man named Mr. Diamond confronts Joe Brown about his ruthless actions and urges him to leave his organization.\n56:54 Mr. Diamond learns about Miss Lowell's complicated relationship with Mr. Brown and her desire to change her life.\n1:05:40 Alicia is alive and living in Sicily, disproving the murder theory\n1:15:08 A witness against Mr. Brown reveals his crimes and the police investigate the murders.\n1:19:52 Criminals plan a heist, but things go wrong and they must figure out who betrayed them.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:33.122Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/1OUaw_JDPVs/maxresdefault.webp?v=656e75e9",
      "duration": 5248,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:33.227Z"
}