{
  "movieId": "youtube-a_JgD1lLfvs",
  "title": "The Blackcoat's Daughter (MYSTERY HORROR FILM with EMMA ROBERTS Movies German complete 2024)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a_JgD1lLfvs",
      "id": "a_JgD1lLfvs",
      "title": "The Blackcoat's Daughter (MYSTERY HORROR FILM with EMMA ROBERTS Movies German complete 2024)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Raffinierter Mystery-Horror um zwei junge Frauen, die über die Winterferien alleine in ihrem Internat zurückbleiben, wo immer merkwürdigere Dinge geschehen... Mit starken Performances von EMMA ROBERTS (\"American Horror Story\" & \"Wir sind die Millers\") & KIERNAN SHIPKA (\"Red One - Alarmstufe Weihnachten\" & \"Chilling Adventures of Sabrina\") von OSGOOD PERKINS, dem Regisseur vom aktuellen Kino-Hit \"Longlegs\"!\n\nDIE TOCHTER DES TEUFELS (2015)\nOriginaltitel: The Blackcoat's Daughter\nMit: Emma Roberts, Lucy Boynton, Kiernan Shipka, Lauren Holly\nRegie: Osgood Perkins\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nWeil ihre Eltern seltsamerweise versäumen, sie abzuholen, sehen sich die Schülerinnen Kat (Kiernan Shipka) und Rose (Lucy Boynton) gezwungen, im Bradford-Internat zu überwintern. Und wegen eines heftigen Wintereinbruchs ist dieses wie von der Außenwelt abgeschnitten. Während Rose ihren Eltern absichtlich ein falsches Datum genannt hat, weiß Kat nicht, was mit ihren los ist - aber noch kurz zuvor träumte sie von einem schrecklichen, tödlichen Unfall. Und bald suchen neue Visionen das Mädchen heim, die stetig schlimmer zu werden scheinen, je näher sich eine weitere junge Frau der Schule nähert: die mysteriöse Joan (Emma Roberts). Joan möchte nach Bradford gelangen und wird von Flashbacks einer grausamen Vergangenheit verfolgt. Auf dem Weg begegnet sie Bill (James Remar), der sie auf der Straße aufliest und ihr von seiner verstorbenen Tochter erzählt...\n#Netzkino #ganzerFilm #emmaroberts\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:49:24.027Z",
      "thumbnail": "https://i.ytimg.com/vi/a_JgD1lLfvs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB77RlWtxQ4a__3D2NzWyL5nCpJwA",
      "duration": 5669,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}