{
  "imdbId": "youtube-8LBI5t2q8k4",
  "title": "Three-Oh-One, Three-Oh-Two(301, 302)(Samgong-il samgong-iᐸ301.302ᐳ)(1995)",
  "year": 1995,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8LBI5t2q8k4",
      "id": "8LBI5t2q8k4",
      "title": "Three-Oh-One, Three-Oh-Two(301, 302)(Samgong-il samgong-iᐸ301.302ᐳ)(1995)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04767\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04767\n\n영화글 : https://www.kmdb.or.kr/story/10/1137\n\n감독(Director) : 박철수(Park Cheol-Su)\n출연 : 방은진(301),황신혜(302),김추련(형사),박철호(강준식),최재영(아버지),장영주(어머니),박영록(형사),이지연(윤희),노유림(진영),정희경(진영모),임주연(여자),홍승희(아이),정유진(아이)\n\n줄거리 : 꿈과 희망을 준다는 새희망바이오 아파트 301호에 대식증의 여자 송희가 이사해 오고, 거식증의 302호 여자 윤희와의 갈등이 시작된다. 송희는 결혼후 남편을 위해 끊임없이 음식을 만들고 거기서 삶의 보람을 찾으나 남편의 외면으로 음식에 집착하는 대식증에 걸린다. 급기야 남편의 애완견을 요리로 만들고 그로 인해 이혼당한 과거를 가졌다. 윤희는 어릴적 정육점을 하던 의붓아버지로부터 성폭행을 피해 냉동고에 숨곤하던 자신을 흉내내다 얼어죽은 동네아이를 본 후로 음식과 섹스를 거부하는 거식증에 걸리지만 아리러니하게 여성잡지에 성에 관한 글을 기고하는 자유기고가이다. 송희는 윤희에게 끊임없이 음식을 만들어 나르고 윤희는 어떤 음식도 받아들이지 못하고 토해버린다. 둘의 갈등은 극에 달하나 서로의 과거를 알게된 이들은 서로를 이해하고 정신적 교감을 얻는다. 윤희는 자신을 음식재료로 써줄 것을 제안하고 송희는 이를 받아들인다.\n\nCasts : Hwang Shin-Hye, Bang Eun-Jin, Kim Chu-Ryeon, Park Cheol-Ho\n\nSYNOPSIS : This film depicts the stories of two women who suffer from binge-eating and anorexia, one eats too much and another eats too little. Song-hui lives at house number 301 of New Hope Bio-Apartment which is thought to realize dreams and bring hope those who live there. But sadly, Song-hui suffers from binge-eating. She eats too much. Song-hui is married and takes great pleasure in caring for her husband, even though he scorns her efforts. Discouraged, she becomes a binge-eater. In revenge, she serves up the family pet to him, signaling the end of their marriage. Yoon-hui lives at house number 302 of the same apartment house suffers from the opposite, a loss of appetite, she eats too little. They do not get along with each other. Yoon-hui is struggling with a dark past of sexual abuse at the hands of her stepfather. Her tragedy has lessened her appetite for food and love. Their tragic pasts and food disorders bring them together but their pursuits of happiness are completely different. It is a story of their struggles",
      "addedAt": "2025-12-26T00:24:46.534Z",
      "thumbnail": "https://i.ytimg.com/vi/8LBI5t2q8k4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDkuiTMO4F4WqA-aB3botQX1DWhbw",
      "duration": 5903,
      "language": "ko",
      "year": 1995,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:46.754Z"
}