{
  "imdbId": "youtube-3Px41mdNlE4",
  "title": "게임의 법칙 (1994) / The rules of the game (Geimui beopchik)",
  "year": 1994,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3Px41mdNlE4",
      "title": "게임의 법칙 (1994) / The rules of the game (Geimui beopchik)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04723\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04723/credit\n\n영화글 : https://www.kmdb.or.kr/story/134/2926\n\n감독(Director) : 장현수(Jang Hyun-soo)\n출연 : 박중훈 , 이경영 , 오연수, 하용수, 이일재\n\n줄거리 :  지방 세차장에서 일하는 용대와 그를 사랑하는 미용사 태숙은 멋진 인생을 꿈꾸며 주먹세계의 대부인 유광천이라는 이름 하나만 들고 서울로 향한다. 그러나 서울로 가는 기차에서 만난 사기꾼 만수에게 몽땅 털리고 빈털털이가 된다. 유광천을 찾아 전전하던 용대는 급한 김에 태숙을 포주에게 팔아 넘기면서까지 유광천을 찾는다. 우연한 기회에 위기에 처한 유광천을 만나 몸을 던져 그를 구한 용대는 드디어 유광천의 똘마니가 된다. 한편 용대와 태숙은 어느 술집에서 만나게 되는데, 호스테스가 된 태숙은 그래도 용대를 사랑한다. 용대에게 내려진 첫 임무는 유광천의 돈을 떼먹고 달아난 사기꾼 만수를 잡아 들이는 것이다. 결국 사기꾼 만수는 용대에게 붙잡혀 다리를 잘리는 댓가를 치루게 되지만 용대에게 책임질 것을 강요하면서 용대와 태숙의 주위를 맴돈다. 그러나 그는 여전히 도박판을 전전하는 밑바닥 인생을 살아간다. 그러던중 용대를 이용만 하려는 광천파는 조직을 위협하는 김검사 암살임무를 용대에게 내린다. 이일을 마지막으로 용대는 ......\n\nCasts :Park Joong-hoon, Lee Geung-young, Oh Yun-soo, Hah Yeong-soo, Lee Ill-jae\nSYNOPSIS :In his film, walking All the Way to heaven, director chang Hyun-Soo touchingly depicted the lives of the poor people in the outskirts of a big city In his second film The Rules of the Game, Chang touchingly depicts love and the struggles of such poor people as swindlers, prostitutes, and gangsters Audiences will enjoy the Korean gangsters and the Korean life styles in the back streets. Youg-Dae and his girlfriend Tae-Sook come to Seoul to locate the kwangchun gangster group in order to join it But he finds out that it is almost impossible to meet Kwangchun (the boss of the Kwangchun gangster group in seoul) Young-Dae has no money So, he sells his girlfriend into prostitution. A good opportunity comes to him He gets a chance to save the gangster boss Kwangchun, who is in danger Young-Dae then joins the gangster group and begins the life of a gangster.",
      "id": "3Px41mdNlE4",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:19.426Z"
}