{
  "imdbId": "youtube-0zk26npAAhc",
  "title": "Dog Eat Dog (ACTION THRILLER | Unzensier exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0zk26npAAhc",
      "id": "0zk26npAAhc",
      "title": "Dog Eat Dog (ACTION THRILLER | Unzensier exklusiv für Netzkino-Members)",
      "description": "DOG EAT DOG (2016)\nOriginaltitel: Dog Eat Dog\nMit: Nicolas Cage, Willem Dafoe, Christopher Matthew Cook, Omar J. Dorsey, Louisa Krause\nRegie:  ‎ Paul Schrader\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDrei Männer haben das Gefängnis hinter sich und versuchen, sich an ein Leben in Freiheit zu gewöhnen. Einen Ausrutscher dürfen sie sich nicht erlauben, denn auch der kleinste Verstoß gegen die kalifornischen Bewährungsauflagen würde sie wieder hinter Gitter bringen. Doch Troy (Nicolas Cage), Diesel (Christopher Matthew Cook) und Mad Dog (Willem Dafoe) wollen nach ihren eigenen Regeln leben: Troy, ein arrogantes Genie, träumt zwar von einem einfachen beschaulichen Leben, doch die Schatten der Vergangenheit lassen ihn nicht los. Diesel dagegen steht auf der Gehaltsliste der Mafia und verliert zunehmend das Interesse an seinem Vorstadt-Zuhause und seiner nörgelnden Frau. Und der unberechenbare Mad Dog schlittert von einer Katastrophe in die Nächste. Gemeinsam wollen die drei das perfekte Verbrechen durchziehen. Doch die Polizei ist ihnen dicht auf den Fersen…\n#Netzkino #ganzerFilm #NicolasCage\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "addedAt": "2025-12-24T00:01:08.782Z",
      "thumbnail": "https://i.ytimg.com/vi/0zk26npAAhc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBxfU84ctCS8lqr_etAeazJlW8tVA",
      "duration": 5501,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:01:08.782Z"
}