{
  "imdbId": "youtube-Ru1PX5yMho0",
  "title": "Nylon Noose 1963 (Mystery, Crime film) directed by Rudolf Zehetgruber",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ru1PX5yMho0",
      "title": "Nylon Noose 1963 (Mystery, Crime film) directed by Rudolf Zehetgruber",
      "description": "Unravel the mystery and escape the knots of fate!\nIn the eerie confines of a mansion, stockholders convene for a company meeting, unaware of the sinister experiments being conducted by a mad doctor within its walls. As the gathering unfolds, a chilling mystery unravels, with lifeless bodies emerging, each marked by the distinct and gruesome signature of death by nylon noose strangulation.\n\nOriginal Title: Die Nylonschlinge (1963)\n\nBlack & White version: https://youtu.be/iNLCI74gzRk\n\nDirector: Rudolf Zehetgruber\nWriters:  Fred Ignor, Thomas Engel\nStars: Richard Goodman, Helga Sommerfeld, Laya Raki\nGenres: Colorized classics, Crime, Drama, Mystery\n\n00:00 Full Movie\n04:54  Inspector Powers is investigating a murder at a bar and suspects a customer who was blackmailed.\n13:39  Inspector Harvey from Scotland Yard questions Sir David about a murder at Elford Manor.\n19:40  Inspector Harvey arrives at Elford Manor to investigate two murders and questions the guests about blackmail letters.\n24:03  A police inspector investigates a murder at a nightclub and suspects the involvement of a dancer and the owner of Elford Manor.\n31:57  Inspector investigates the murders at Elford Manor and suspects Henry, a servant.\n37:50  Inspector Harvey investigates a murder and encounters suspicious characters.\n50:45  A mysterious conversation reveals plans for revenge, a marriage for money, and the sale of diamonds.\n53:12  A detective investigates a series of murders and uncovers a plot involving stolen diamonds.\n1:04:01  A murder mystery unfolds as Jane confronts Mr. Harrison about the killing of her parents and his plans to silence her.\n\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "Ru1PX5yMho0",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:51.897Z"
}