{
  "imdbId": "youtube-oKF3iwROmZY",
  "title": "Hands of a Stranger (1962, Horror) Paul Lukather, Joan Harvey, James Noah | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oKF3iwROmZY",
      "title": "Hands of a Stranger (1962, Horror) Paul Lukather, Joan Harvey, James Noah | Movie",
      "description": "They gave him the hands of a killer!\nA surgeon must graft new hands on a concert pianist to replace his badly mangled ones. However, after the operation, the pianist comes to believe that his new hands have a mind of their own, and are trying to force him to commit evil acts.\n\nColorized version: https://youtu.be/DwDtYririX4\n\n\nOriginal title: Hands of a Stranger (1962) AKA: The Answer\nSubtitles available in many language options.\n\nDirector & Writer: Newt Arnold \nStars: Paul Lukather, Joan Harvey, James Noah \nGenres: Classics, Cult Film, Horror, Thriller\n\n\n00:00 Full Movie (with subtitles)\n03:47 A mysterious murder investigation unfolds during a piano concert, revealing intricate details about the victim.\n11:23 The significance of hands and relationships in a mysterious and dramatic storyline.\n15:39 Uncovering the dark truth behind a man's severed and bloody gloves leads to a shocking revelation.\n21:18 A medical experiment goes wrong, leading to ethical dilemmas and potential consequences for the characters involved.\n29:58 Mysterious events unfold after a man's hand is injured in a taxi accident, leading to unexpected consequences.\n32:23 Medical experiment results in successful hand transplant, challenging beliefs and showcasing courage and creativity.\n39:23 A medical drama unfolds as a patient faces the reality of having new hands and must decide to accept or fight against it.\n48:48 A mysterious encounter leads to a chilling revelation about a new pair of hands.\n53:08 A pianist helps a troubled man cope with loss and find peace through music.\n56:52 Exploration of the impact of hand transplants on individuals' lives and identities.\n1:09:19 Summary of a horror movie involving a mysterious death and a doctor's investigation.\n1:14:16 Mysterious events unfold after a man finds his son dead, leading to a series of tragic incidents involving human hands.\n1:19:39 A mysterious conversation unfolds between two individuals regarding a significant event.\n\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "oKF3iwROmZY",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:04.370Z"
}