{
  "imdbId": "youtube-k-n3W8OXaY8",
  "title": "[4K] 서편제(1993) / Sopyonje (Seopyeonje)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k-n3W8OXaY8",
      "title": "[4K] 서편제(1993) / Sopyonje (Seopyeonje)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail//movie/K/04629\n(English) https://www.kmdb.or.kr/eng/db/kor/detail//movie/K/04629\n\n영화글 : https://www.kmdb.or.kr/story/154/4215\n\n감독(Director) : 임권택(Im Kwon-Taek)\n출연 : 김명곤(유붕),오정해(송화),김규철(동호),신새길(금산댁),안병경(낙산거사),최동준(송도상),최종원(천가),강선숙(세월네),주상호(약장수),이인옥(도상처),유명순(주모),김경란(계꾼),박예숙(계꾼),정미경(계꾼),조학자(계꾼),이석구(창극단원),유형관(창극단원),김기천(남편약장수),방은미(아내약장수),고동업(한량),박길수(한량),손영호(한량),송영탁(웨이터),권호웅(건재상주인),이은숙(작부),오연실(기생),윤혜영(기생),조영재(고수),김유경(춘향),김송(아역),고승유(아역),김지훈(아역),문혜지(아역),㈜MTM(보조출연)\n\n줄거리 : 1960년대 초, 어느 산골 주막에 30대 남자가 도착한다. 그는 주막 여인의 판소리에 회상에 잠긴다. 어린 시절 동네에 소리꾼인 유봉(김명곤)이 찾아온다. 동네 아낙인 동호(김규철)의 어머니는 유봉과 사랑에 빠져 마을을 떠난다. 유봉의 딸 송화(오정해)와 넷이 살던 중, 동호의 어머니는 아기를 낳다 죽는다. 유봉은 송화에게 소리를 가르치고, 동호에게는 북치는 법을 가르친다. 그러다가 전쟁으로 인해 생활이 어려워지고, 소리를 가르치기 위해 쉴 틈 없이 다그치는 유봉을 이해하지 못하는 동호는 유봉과 싸우고 떠나 버린다. 동호가 떠난 뒤 송화가 식음을 전폐하고 소리도 포기한 채 그를 기다리자, 유봉은 한이 맺혀야 진정한 소리를 할 수 있다는 생각에 송화의 눈을 멀게 만든다. 동호는 낙산거사(안병경)를 만나 송화의 소식을 듣고 수소문 끝에 대폿집에서 송화와 재회한다. 둘은 어떤 말도 하지 않고 한 명은 소리를, 또 한 명은 북을 치면서 밤새 한을 풀어낸다. 아침이 되고 동호와 송화는 말없이 헤어진다. 송화는 한 소녀를 앞세우고 길을 떠난다.\n\nCasts : Oh Jeong-Hae, Kim Myeong-Kon, Kim Kyu-Cheol, Ahn Byeong-Kyeong, Choi Dong-Jun\n\nSynopsis : It is early 1960s. A man in his thirties arrives at a small tavern in the mountain village. He is lost in memories at the sound of pansori sung by the tavern owner. In his memory, he is young and Yu-bong (Kim Myung-kon), a pansori singer comes to the village. A village woman, Dong-ho's (Kim Kyu-chul) mom, falls in love with Yu-bong and leaves the village with Dong-ho and Yubong. Dong-ho and his mother, Yu-bong and his daughter Song-hwa (Oh Jeong-hae), form a family. But Dong-ho's mom passes away giving birth to a baby. Yu-bong teaches pansori to Song-hwa and drumming to Dong-ho. Then the war breaks out and as it becomes more difficult to live, Dong-ho can't stand the way Yu-bong pushes Song-hwa and him to learn pansori. Eventually, Dong-ho gets into a quarrel with Yu-bong and leaves the town. After Dong-ho leaves, Song-hwa refuses food and drink, just waiting for him to return. Seeing this, Yu-bong makes Song-hwa become blind believing that one can truly learn to sing pansori only when the person has great resentment in life. Dong-ho coincidentally comes across Naksangeosa (Ahn Byung-kyung) and hears what happened to Song-hwa. After a long search for her whereabouts, he finally meets Song-hwa at a groggery. Without any word, they do pansori. Song-hwa sings and Dong-ho drums for her, resolving their deepest sorrow. When the morning arrives, Dong-ho and Song-hwa part one another without words. Song-hwa takes off with a girl guiding her way.",
      "id": "k-n3W8OXaY8",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:01.131Z"
}