{
  "imdbId": "youtube-wAtv8RVedL4",
  "title": "Blood and Diamonds (1977, Thriller) Claudio Cassinelli, Barbara Bouchet | Italian Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wAtv8RVedL4",
      "id": "wAtv8RVedL4",
      "title": "Blood and Diamonds (1977, Thriller) Claudio Cassinelli, Barbara Bouchet | Italian Movie",
      "description": "A man is arrested and condemned to five years in jail for robbery. After serving his term, he is out for revenge on the gang members he considers were to blame for his arrest. The prize for this deadly fight is a large cache of diamonds.\n\nOriginal title: Diamanti sporchi di sangue (1977) AKA: Blood and Diamonds\nThis film has Italian audio, and subtitled in many languages.\n\nDirector & Writer: Fernando Di Leo\nStars: Claudio Cassinelli, Martin Balsam, Barbara Bouchet, Pier Paolo Capponi\nGenres: Crime, Drama, Thriller\n\n\n00:00 Full Movie (with subtitles)\n00:43 A thrilling story unfolds involving a robbery, betrayal, and revenge among criminals.\n17:17 A thrilling tale of betrayal, revenge, and criminal activities unfolds, leading to tragic consequences.\n27:29 A tense confrontation between Rizzo and Guido leads to a deadly ultimatum.\n31:10 A criminal operation involving diamonds, alibis, and ultimatums unfolds with tensions rising among key players.\n43:39 A criminal plot unfolds involving stolen diamonds, betrayal, and murder.\n52:39 A woman involved in a criminal scheme tries to protect herself and navigate dangerous situations in Rome.\n1:05:12 Murder, betrayal, and mystery unfold as characters search for diamonds in a thrilling Italian movie.\n1:18:48 Tension rises as accusations are made regarding a series of deaths and criminal activities.\n1:21:43 Betrayal, revenge, and honor lead to a deadly confrontation between two former allies.\n\n\n\n@CultCinemaClassics \nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:09.311Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/wAtv8RVedL4/maxresdefault.webp?v=65e8567e",
      "duration": 5887,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:09.437Z"
}