{
  "imdbId": "youtube-UpK5MNuIKq8",
  "title": "Cowboy Western | Deputy Marshal (1949) Directed by William Berke | Colorized Movie",
  "year": 1949,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UpK5MNuIKq8",
      "id": "UpK5MNuIKq8",
      "title": "Cowboy Western | Deputy Marshal (1949) Directed by William Berke | Colorized Movie",
      "description": "One man justice! Faces ruthless rustlers in a lawless frontier!\nA Deputy Marshal tracks fugitive bank robbers to Wyoming, and then fights to help ranchers save their land from a railroad land scheme.\n\nOriginal title: Deputy Marshal (1949)\nThis film is is subtitled with many language options.\n\nBlack & White version: https://youtu.be/fvflcMMamig\n\n\nDirector: William Berke\nWriters: William Berke, Charles Heckelmann\nStars: Jon Hall, Frances Langford, Dick Foran, Russell Hayden, Julie Bishop\nGenre: Colorized classics, Western, Musical\n\n\n00:00 Full Movie (with subtitles)\n11:17 Deputy Marshal investigates a murder in a Western town, facing challenges and suspects along the way.\n12:4 Investigation of a murder at a hotel involving multiple suspects and a mysterious gun.\n18:40 A deputy marshal, Ed Garry, and Claire Benton discuss a message from Joel Benton and search for Colt Redwood and Jed Northey.\n23:01 Deputy Marshal confronts a wanted criminal, faces challenges, and resists unethical practices in a Western town.\n34:06 Deputy Marshal Ed Garry investigates Colt Redwood and Jed Northey, while discussing hidden weapons and potential threats with Sheriff Lance and his wife.\n38:01 Deputy Marshal investigates land dispute and shooting incident, uncovering secrets and motives in a Western setting.\n44:49 Deputy Marshal investigates a murder in a small town involving stolen cattle and a gun owner.\n54:22 Investigation into a murder case leads to unexpected alliances and revelations in a Western film.\n1:02:40 Law enforcement officers negotiate a deal involving a gun, map, and money during a wedding ceremony.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:28.563Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/UpK5MNuIKq8/maxresdefault.webp",
      "duration": 4086,
      "language": "en",
      "year": 1949,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:28.713Z"
}