{
  "imdbId": "youtube-VF0yHHdICW4",
  "title": "West of the Divide 1934 | John Wayne, Gabby Hayes | Western Movie | Subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VF0yHHdICW4",
      "id": "VF0yHHdICW4",
      "title": "West of the Divide 1934 | John Wayne, Gabby Hayes | Western Movie | Subtitles",
      "description": "Ted Hayden impersonates a wanted man and joins Gentry's gang only to learn later that Gentry was the one who killed his father. He saves Virginia Winters' dad's ranch from Gentry and also rescues his long-lost brother Spud.\n\nOriginal title: West of the Divide (1934)\n\nColorized version: https://youtu.be/j4FCv1DERdg\n\nDirector & Writer: Robert N. Bradbury\nStars: John Wayne, Virginia Brown Faire, George 'Gabby' Hayes\nGenres: Classics, B movie, Action, Adventure, Romance, Western\n\nA Man's Quest for Justice, a Ranch Owner's Battle, and the Sinister Truth Unveiled \n\n00:00 Full Movie\n01:23 A man and his son visit a familiar location and reminisce about a past event involving gunfire and the man's father protecting him.\n07:35 A ranch owner refuses to sell, leading to a plan to rob and ruin her, but she is saved by a group of prospectors.\n17:14 A group of individuals discuss a job involving eliminating someone and taking over their ranch.\n25:53 A man is worried about a person he has seen before and is discussing a plan to kill someone named Winters.\n42:00 ! Gentry is revealed to be the mastermind behind the murders of Jim's father and brother.\n43:31 Gentry is accused of murder and kidnapping, but it is revealed that he is innocent and the real culprit is Ted Eden. Ted is confronted and arrested, and the Winters family is reunited.\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:41:48.747Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/VF0yHHdICW4/maxresdefault.webp?v=64f527cb",
      "duration": 3181,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:41:48.855Z"
}