{
  "movieId": "youtube-wWjznQN41s4",
  "title": "(Spencer Tracy, Joan Bennett) Father's Little Dividend 1951 | Comedy, Drama, Romance | 4k Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wWjznQN41s4",
      "id": "wWjznQN41s4",
      "title": "(Spencer Tracy, Joan Bennett) Father's Little Dividend 1951 | Comedy, Drama, Romance | 4k Full Movie",
      "description": "Shortly after coming to terms with his daughter's marriage, a father faces the prospect of becoming a grandfather.\n\nOriginal title: Father's Little Dividend (1951)\n\nBlack & White version: https://youtu.be/86ELIeyTBmU\n\nThis film is available with French, German, Italian & Spanish dubbed audio. \nGo to settings ⚙️ to modify your audio / subtitle language options\n\nDirector: Vincente Minnelli\nWriters: Albert Hackett, Frances Goodrich\nStars: Spencer Tracy, Joan Bennett, Elizabeth Taylor \nGenres: Colorized classics, Comedy, Drama, Romance\nBudget: $941,000 (estimated)\n\n00:00 Full Movie\n02:08  A man comes home feeling optimistic about life, but his wife reveals they have received good news about a business deal instead of expecting a baby.\n08:19  Stanley Banks is shocked to learn that his daughter is pregnant and he will become a grandfather.\n16:05  Ellie suggests that Kay and Buckley move in with them to help take care of the baby.\n21:07  A couple discusses their new house and preparations for their baby's arrival.\n26:27  A family discusses possible names for their upcoming baby, causing tension and arguments.\n32:33  A couple discusses their concerns about a new approach to childbirth with a doctor, but their daughter goes missing.\n39:28  A couple has a heated argument and the wife leaves, causing the husband to call the police and search for her.\n51:31  A couple anxiously prepares for the birth of their baby and rushes to the hospital.\n58:23  A grandfather struggles to bond with his grandson but eventually learns to accept and love him.\n1:17:04  A baby is lost in the park and the grandfather frantically searches for him.\n1:19:21  The video captures the christening of the narrator's grandchild and his feelings towards becoming a grandfather.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:05.344Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/wWjznQN41s4/maxresdefault.webp?v=65bc43a4",
      "duration": 4881,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:05.476Z"
}