{
  "imdbId": "youtube-w4TmCSR0LnU",
  "title": "Havenhurst – Evil lives here (MYSTERY HORRORFILM auf Deutsch, Horrorfilme in voller Länge, Thriller)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=w4TmCSR0LnU",
      "title": "Havenhurst – Evil lives here (MYSTERY HORRORFILM auf Deutsch, Horrorfilme in voller Länge, Thriller)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Die alkoholkranke Jackie zieht nach dem Entzug nach Havenhurst, einem gotischen Apartmentkomplex. Hier verschwand einst ihre Freundin auf mysteriöser art...\n\nHAVENHURST – EVIL LIVES HERE (2016)\nOriginaltitel: Havenhurst\nMit: Josh Stamberg, Julie Benz, Belle Shouse\nRegie: Andrew C. Erin\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nIn New York City steht eines der größten und ältesten Apartmentgebäude der Stadt: Das HAVENHURST. Um das gotische Haus mit seinen skurrilen Bewohnern und seiner bewegten Geschichte ranken sich viele düstere Legenden. Die junge Jackie (JULIE BENZ aus DEXTER) zieht in genau das Apartment, das bis zuletzt von ihrer plötzlich spurlos verschwundenen Freundin Danielle bewohnt wurde. Bereits beim Einzug spürt sie, dass etwas mit dem Gebäude und vor allem dessen Managerin Eleanor nicht stimmt. Schon bald häufen sich mysteriöse Vorfälle, die darauf schließen lassen, dass die vermisste Danielle Havenhurst niemals verlassen hat. Als Jackie tiefer in die Geschichte des Hauses eintaucht und dabei dunkle Mächte weckt, gerät ihr Leben in Gefahr. Nicht nur ihre inneren Dämonen lauern ihr auf, sondern auch die wahrhaftigen, die in den Wänden von Havenhurst ihr Unwesen treiben.\n#Netzkino #ganzerFilm #horrorfilme\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "w4TmCSR0LnU",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}