{
  "imdbId": "youtube-7aguY6VfwfA",
  "title": "Rival Broadcasters Find Love Again | Broadcasting Christmas | Full Hallmark Christmas Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7aguY6VfwfA",
      "title": "Rival Broadcasters Find Love Again | Broadcasting Christmas | Full Hallmark Christmas Movie",
      "description": "Rival Broadcasters Find Love Again | Broadcasting Christmas | Full Hallmark Christmas Movie - Two news broadcasters who previously were in love, fight for a position as a morning talk show host that they both want, ultimately finding what made them like each other so much in the first place.\n\r\nWatch Rival Broadcasters Find Love Again, a full Hallmark Christmas Movie that combines holiday charm with romance and career rivalry. Two news broadcasters, once in love, compete for the same morning talk show host position, only to rediscover the spark that brought them together. Perfect for fans of Hallmark Christmas movies, romantic holiday films, winter love stories, cozy Christmas romances, and full free holiday romance movies, Broadcasting Christmas delivers laughter, love, and festive cheer in a heartwarming story about second chances and the magic of the season.\n\nWatch another US exclusive FREE Hallmark Christmas movie here: https://www.youtube.com/watch?v=sCeCv9KmOHM\n\r\nStars: Melissa Joan Hart, Dean Cain, Cynthia Gibb\n*Licensed from Tesera. All rights reserved*\n\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies\n00:00:00 Skip the opening credits\n00:01:12 Broadcasting Christmas Full Movie\n01:24:12 Skip the closing credits",
      "id": "7aguY6VfwfA",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T23:59:33.249Z"
}