{
  "imdbId": "youtube-U2sBH_P0_rM",
  "title": "Second Chorus (Musical, 1940) Paulette Goddard, Fred Astaire, Burgess Meredith | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U2sBH_P0_rM",
      "id": "U2sBH_P0_rM",
      "title": "Second Chorus (Musical, 1940) Paulette Goddard, Fred Astaire, Burgess Meredith | Movie",
      "description": "Two musical maestros, one chance at center stage.\nWhen perennial college students Danny O'Neill and Hank Taylor are forced to make it on their own, the competitive pair get jobs with Artie Shaw's band and reunite with ex-manager Ellen Miller. \n\nAlso available Colorized: https://youtu.be/LNmVnnulO8U\n\n\nOriginal title: Second Chorus (1940)\n\nThis film has English, Italian & Spanish audio options, and subtitled in many more languages.\n\nDirector: H.C. Potter \nWriters: Frank Cavett, Elaine Ryan \nStars: Fred Astaire, Burgess Meredith, Paulette Goddard, & Artie Shaw \nGenre: Classics, Comedy, Musical, Romance\n\n\n00:00 Full Movie (with dubbed audio & Subtitles)\n01:39 A group of friends reminisces about their college days and faces a dilemma regarding a long-overdue payment.\n06:43 Musical film featuring Paulette Goddard, Fred Astaire, and Burgess Meredith with a comedic storyline.\n11:00 Musical film featuring humorous dialogue and dance routines, showcasing the struggles and aspirations of the main characters.\n19:31 Musical film featuring Paulette Goddard, Fred Astaire, and Burgess Meredith with a twist in the plot.\n26:06 Musical film featuring Paulette Goddard, Fred Astaire, and Burgess Meredith in a band audition.\n30:50 Musical film scene with characters interacting before a music audition.\n36:48 Musical conversation between Hank and Danny about music, relationships, and an upcoming concert.\n49:56 Exploration of the music world, relationships, and aspirations of artists in a musical film.\n53:25 Musical drama unfolds as relationships are tested and secrets revealed during a pivotal concert preparation.\n59:57 A tale of mistaken identity and redemption unfolds during a musical performance.\n1:02:14 Two characters discuss a folk song for a concert, leading to a musical performance.\n1:06:07 Musical rehearsal preparations and arrangements for a concert, including a trumpet player's involvement and secret communication.\n1:18:29 Musical performance by Danny O'Neil impresses Artie Shaw, leading to a job offer.\n\n\n@CultCinemaClassics  ​\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:54.618Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/U2sBH_P0_rM/maxresdefault.webp?v=660274ee",
      "duration": 5015,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:54.737Z"
}