{
  "imdbId": "youtube-n6RRjughV_E",
  "title": "The Devil and Leroy Bassett 1973 (Action, Drama) Cody Bearpaw, John F. Goff | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=n6RRjughV_E",
      "title": "The Devil and Leroy Bassett 1973 (Action, Drama) Cody Bearpaw, John F. Goff | Movie",
      "description": "A Tale of Hillbilly Hate and Redneck Revenge!\nLeroy Bassett and his dim-witted brothers go on the lam after freeing their friend Keema from jail.\n \nOriginal title: The Devil and Leroy Bassett (1973) AKA: Pistol-Packin' Leroy\n\nThis film has many subtitle language options\n\nDirector & Writer: Robert E. Pearson \nStars: Cody Bearpaw, John F. Goff, George 'Buck' Flower \nGenres: Action, Drama\n\n\n00:00 Full Movie (with subtitles)\n02:05 A tale of family conflict, religious beliefs, and a plan to rescue a brother from jail.\n06:54 A plan to trade a warm beer for a police car unfolds during a conversation about getting a prisoner out of jail.\n12:55 The mysterious disappearance of Keema and the events leading up to it in a small town.\n22:19 A tale of crime and revenge unfolds in a small town involving Sheriff Trask, Keema, Wilbur, and Leroy.\n31:37 A sheriff faces challenges from old acquaintances, contemplates retirement, and makes a significant decision over a meal.\n38:48 A tale of conflict and redemption unfolds in a small town, involving a troubled individual and the local sheriff.\n48:21 A family encounters unexpected trouble on a remote property, leading to a tense situation with law enforcement.\n51:56 Family drama unfolds as a man seeks dental help from an unexpected source, leading to conflict and resentment.\n1:03:35 A man named Wilbur faces a series of unfortunate events involving his family and Leroy Bassett.\n1:07:44 Conflict escalates as Leroy Bassett threatens violence and challenges authority figures in a tense situation.\n1:16:00 Pursuit of Leroy Bassett leads to a deadly showdown in the mountains.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "id": "n6RRjughV_E",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:39:02.616Z"
}