{
  "imdbId": "youtube-lZ3rK3pS_jY",
  "title": "Boar (HORROR THRILLER ganzer Film Deutsch | Horrorfilme in voller Länge auf Deutsch anschauen | 4K)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lZ3rK3pS_jY",
      "title": "Boar (HORROR THRILLER ganzer Film Deutsch | Horrorfilme in voller Länge auf Deutsch anschauen | 4K)",
      "description": "► Komplette Filme kostenlos anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n🐗 Im australischen Outback wird ein wildgewordener Keiler zum Alptraum einer Familie, die sich gerade auf einem Campingausflug befindet...\n\nBOAR (2017)\nOriginaltitel: Boar\nMit: Chris Sun\nRegie: Nathan Jones, Bill Moseley, John Jarratt, Steve Bisley\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nEigentlich wollten die Monroes nur einen entspannten Familienurlaub im australischen Outback mit dem längst überfälligen Besuch ihres Schwagers Bernie (Nathan Jones) verbinden, aber kaum ist die fünfköpfige Familie in dem gottverlassenen kleinen Kaff angekommen, durchkreuzt ein blutrünstiger Neuzugang die Ausflugsplanung: Ein monströser Keiler zieht mit seinen mächtigen Hauern eine Spur der Verwüstung durch den Busch, und es dauert nicht lange, bis alle um ihr Leben rennen. Als selbst die erfahrensten Veteranen im Dorf dem gnadenlosen Biest auf übelkeitserregende Weise zum Opfer fallen, muss Schwager Bernie mit dem verbliebenen Rest der Familie wohl oder übel einen Weg finden, das grauenhafte Blutbad ein für allemal zu stoppen. Es wird ein langer und wilder Ritt\n...\nBOAR, das neue Creature Feature von CHARLIE'S FARM-Regisseur Chris Sun, ist eine fabelhafte Hommage an den einzig wahrhaftigen australischen Monsterschocker der 80er Jahre, RAZORBACK. Bis zum Bersten vollgestopft mit praktischen Spezialeffekten, einem hervorragenden Creature Design und eimerweise Kunstblut donnert BOAR wie eine außer Kontrolle geratene Diesellok über die Leinwand und präsentiert so ganz nebenbei mit legendären Darstellern wie Bill Moseley (THE DEVIL'S REJECTS), John Jarratt (WOLF CREEK), Roger Ward (MAD MAX) und Nathan Jones (MAD MAX) die Créme de la Créme des modernen Terrorkinos. Ein Höllenspaß! \n#Spielfilm #ganzerFilm #HorrorThriller\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinem monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "lZ3rK3pS_jY",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-24T00:05:47.536Z"
}