{
  "imdbId": "youtube-cISEN_toFuA",
  "title": "난장이가 쏘아올린 작은공(1981) / A dwarf Launches a Little Ball (Nanjang-iga sso-a-ollin jag-eun gong)",
  "year": 1981,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cISEN_toFuA",
      "title": "난장이가 쏘아올린 작은공(1981) / A dwarf Launches a Little Ball (Nanjang-iga sso-a-ollin jag-eun gong)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03547\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03547\n\n영화글 : https://www.kmdb.or.kr/story/10/5041\n\n감독(Director) : 이원세(Lee Won-Se)\n출연 : 전양자(어머니),안성기(영수),김추련(박우철),금보라(영희),전영선(명희),이효정(영호),김불이(김불이),추석양,성명순,최석,김민규,오세장,주상호,이백,박일,박용팔,문미봉,권일정,정미경,김지영,정미자,조승룡,박승규,김수진,송지은\n\n줄거리 : 지방 극장과 서커스 무대에서 나팔을 불던 난쟁이 김불이는 극장과 서커스 무대가 없어지자 일자리를 잃고, 카바레 앞에서 손님 호객 행위를 하는 신세가 된다. 공부를 잘해서 성공하고 싶었던 난쟁이의 큰아들 영수(안성기)는 형편이 여의치 않자 결국 공장에서 쇳물 녹이는 일을 한다. 영수는 어릴 적 친구이자 애인인 명희(전영선)가 가난 때문에 술집에 가게 되어도 붙잡을 수 없다. 염전 일을 하는 아내(전양자)는 가족이 모여 살 집만 있으면 행복하다 생각하고, 두 아들과 딸은 사람들에게 아버지가 난쟁이라 놀림을 받으며 컸지만 서로 사랑하고 의지하며 살아간다. 하지만 염전 일이 사양 산업으로 바뀌고 염전에 공장과 아파트가 들어서게 되자 염전 인근 주민들은 재개발 열풍으로 순식간에 철거민이 되고, 아파트 분양권을 살 형편이 못되는 사람들은 헐값에 분양권을 팔고 떠나야할 상황에 처한다. 영수네도 돈이 없어 아파트 분양권을 팔게 되고 영희(금보라)는 아파트 분양권을 얻기 위해 부동산업자 박우철(김추련)을 따라 집을 나간다. 영희가 돌아올 때까지 집을 지키던 가족들은 결국 자신들이 오랫동안 일군 집이 철거당하는 현장을 지켜보게 된다. 한편 영희는 우철의 집 금고에서 아파트 분양권을 몰래 가지고 나와 분양권을 얻게 되지만, 집에 도착하자마자 굴뚝에서 떨어져 자살한 아버지의 시체와 만난다.\n\nCasts : Ahn Seong-Ki, Jeon Yang-Ja, Kim Chu-Ryeon, Keum Bo-Ra\n\nSYNOPSIS : Kim Bul is a midget who lives in Happy Village with his wife, his eldest son Young-su, a salt farmer, Young-ho, his second son who works at the boxing gym and Young-hi, his daughter.  But his family moves from the village when the ocean water becomes too polluted and in return receives the deed to a house. But Kim Bul is outwitted by the real estate broker, Pak Wu-cheol and loses the deed to Wu-cheol. Wu-cheol seduces Young-hi and she goes to his house with him.  There she finds the deed to their rightful home. She rushes back to Happy Village to find that  her father has passed away.",
      "id": "cISEN_toFuA",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:41.715Z"
}