{
  "movieId": "youtube-8urw36dsA3I",
  "title": "A Triangular Trap(Samgag-ui hamjeong )(1974)",
  "year": 1974,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8urw36dsA3I",
      "id": "8urw36dsA3I",
      "title": "A Triangular Trap(Samgag-ui hamjeong )(1974)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02851\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02851\n\n영화글 : https://www.kmdb.or.kr/story/10/5358\n\n감독(Director) : 이만희(Lee Man-Hee)\n출연 : 문숙(문숙),오지명(상국),백일섭(춘호),유장현(영일),김기종,주일몽,정미경,강숙경,석인수,김지연\n\n줄거리 : 패션디자이너 지숙은 과거에 자신을 추행하고 재벌인 남편까지 살해한 상국에 대한 두려움 속에서 산다. 어느날 건달 춘호에게 추행당하려는 지숙을 학원강사 영일이 우연히 구해준 것을 계기로 지숙과 영일은 급속히 가까워진다. 남편의 유산처리 문제를 두고 고민하던 지숙은 영일에게 모든 것을 의지하고 출옥한 상국을 살해한다. 그러나 상국이 다시 살아나고,그녀의 재산을 탐하여 접근했던 영일의 정체가 밝혀지자 지숙은 오열한다. 결국 욕망의 화신인 상국과 영일은 결투를 벌이다가 절벽에서 떨어져 죽고 지숙은 절벽 아래로 감회가 깃든 꽃송이를 뿌린다.\n\nCasts : Yoo Jang-Hyeon, Moon Suk, Baek Il-Seob\n\nSYNOPSIS : Ji-Suk, a fashion designer, is in fear about Sang-Kuk who raped her and even killed her husband, a big business, a long time ago. One day Ji-Suk was almost harassed by a bad fellow called Chun-Ho. As Young-Il, an instructor of an institution, saved her by chance, they soon were getting closer. Ji-Suk, who was in trouble how to manage her husband's inherits, totally depends on Young-Il and murdered Sang-Kuk who was released from prison. But as Sang-Kuk revived and Young-Il's true colors were unveiled, Ji-Suk madly cried. In fact Young-Il approached her because of her properties. After all the two incarnations of desire, Sang-Kuk and Young-Il fought and fell down from a cliff. Ji-Suk sprinkled petals of sentiments under the cliff where two evil men died.",
      "addedAt": "2025-12-26T00:23:44.468Z",
      "thumbnail": "https://i.ytimg.com/vi/8urw36dsA3I/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAj9zX7nsZsSxtJ4VQYhaNkyQhnbA",
      "duration": 5240,
      "language": "ko",
      "year": 1974,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:44.559Z"
}