{
  "imdbId": "youtube-gJ3ZA5rWXMY",
  "title": "Half Shot at Sunrise 1930 (American pre-Code comedy film) starring the duo Wheeler & Woolsey",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gJ3ZA5rWXMY",
      "id": "gJ3ZA5rWXMY",
      "title": "Half Shot at Sunrise 1930 (American pre-Code comedy film) starring the duo Wheeler & Woolsey",
      "description": "Love and Laughter in the City of Love, Paris!\nSoldiers Tommy and Gilbert are on the run in Paris, dodging military police and wooing local beauties during World War I. Their escapades take them from romantic serenades to the front lines of battle, all while trying to stay one step ahead of trouble...\nTommy's romantic pursuits lead to trouble when he unknowingly falls for the daughter of his commanding officer, while Gilbert's antics with a charming local woman add to the chaos.\n\nOriginal title: Half Shot at Sunrise (1930)\nThis movie is available with subtitles and many language options.\n\nBlack & White version: https://youtu.be/rvdcJCgYPMg\n\n\nDirector: Paul Sloane\nWriters: James Ashmore Creelman, Anne Caldwell, Ralph Spence\nStars: Bert Wheeler, Robert Woolsey, Dorothy Lee\nGenres: Colorized, Comedy, Musical\nBudget: $529,000\n\n\n00:00 Colorized Movie (with subtitles in many language options).\n1:23 Military chaos ensues as two men go AWOL in Paris, causing diplomatic tensions and jeopardizing crucial war plans.\n04:55 Impersonating MPs.\n08:18 Cruising for chicks as captains & majors.\n9:34 Banter and humor ensue as guests at a social event discuss fashion and gender roles.\n11:34 Some French stereotyping.\n17:19 Mischievous antics ensue as characters navigate social interactions and military encounters.\n18:49 Flirting with the Colonel's daughter.\n20:52 Whistling the Blues Away - Music; Harry Tierney, Lyrics; Anne Caldwell.\n28:23 Scheming to catch impostors, a Colonel's daughter teams up with a sergeant in a humorous pursuit.\n37:04 Two individuals encounter a woman who plans to profit from their presence in Paris.\n46:07 Unusual dining requests lead to comical exchanges between a customer and waiter.\n55:11 Flirtatious banter between Jim and Eileen as Jim prepares to deliver important papers to General Hale.\n1:02:20 A comedic conversation unfolds between two characters discussing their origins and potential heroic actions.\n1:10:17 Mission to deliver important papers to General Hail amidst danger and sacrifice.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:42.890Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/gJ3ZA5rWXMY/maxresdefault.webp",
      "duration": 4713,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:42.999Z"
}