{
  "imdbId": "youtube-gqE5xOzWJcA",
  "title": "Zane Grey | Buffalo Stampede (Western, 1933) Randolph Scott, Judith Allen, Buster Crabbe | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gqE5xOzWJcA",
      "title": "Zane Grey | Buffalo Stampede (Western, 1933) Randolph Scott, Judith Allen, Buster Crabbe | Movie",
      "description": "Fearless frontiersmen fighting for fortune... hunting wild buffalo... hunted by savage Indians! \nAmong them a fearless adventurer who rode into the \"badlands\"... and rode out with a beautiful girl.\nA buffalo hunter tries to stop a thief and his minions from stealing hides.\n\nColorized version: https://youtu.be/EtM2D3NgFw4\n\n\nOriginal Title: Buffalo Stampede (1933) AKA: The Thundering Herd \nThis film is subtitled in many languages.  And also dubbed with Spanish audio.\n\nDirector: Henry Hathaway\nWriters: Zane Grey, Jack Cunningham \nStars: Buster Crabbe, Randolph Scott, Judith Allen, Noah Beery, Harry Carey\nGenre: Classic western movie.\n\n\n00:00 Full Movie (with subtitles)\n00:02 Drama unfolds as characters navigate through buffalo hide trading and encounters with thieves.\n08:34 Conflict arises in a Western camp as power dynamics shift and suspicions grow.\n13:41 Drama unfolds as characters navigate through relationships and decisions in a Western setting.\n18:53 Conflict arises over a partnership due to a romantic entanglement, leading to a shooting incident and a change of plans.\n27:58 Wild west adventure unfolds as Buffalo Stampede disrupts hunting camp, leading to a chase and potential conflict.\n42:20 Conflict arises over stolen hides, leading to a split in the group and plans for winter.\n47:54 Dramatic events unfold as a wagon train faces danger on the trail, requiring assistance to avoid being wiped out.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "gqE5xOzWJcA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:05.977Z"
}