{
  "imdbId": "youtube--FUNea1REbA",
  "title": "NEW HD RESTORATION 🍕Monster from Green Hell (1957) HORROR SCI-FI 🍕JIM DAVIS🍕 FULL MOVIE",
  "year": 1957,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-FUNea1REbA",
      "id": "-FUNea1REbA",
      "title": "NEW HD RESTORATION 🍕Monster from Green Hell (1957) HORROR SCI-FI 🍕JIM DAVIS🍕 FULL MOVIE",
      "description": "It's Friday @PizzaFLIX \nStars: Jim Davis, Barbara Turner, Robert Griffin \nDirector: Kenneth G. Crane\nMusic Score: Albert Glasser\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TXEBMtSqYpWfok-xg95KXao\n🍕NEW BRILLIANT HD RESTORATION🍕\nStep into the atomic age of sci-fi horror with this cult classic from Gross-Krasne Productions! This thrilling adventure takes viewers deep into the uncharted jungles of Africa, where a scientific experiment gone wrong unleashes a terrifying menace. Directed by Kenneth G. Crane, this black-and-white gem blends science fiction with jungle survival, exploring the unintended consequences of radiation on nature.\n\nThe film stars Jim Davis as Dr. Quent Brady, a government scientist who travels to the African interior to investigate a series of mysterious deaths and encounters a monstrous mutation. Barbara Turner appears as Lorna Lorentz, providing a rare female presence in mid-century sci-fi. At the same time, Vladimir Sokoloff plays Dr. Lorentz, a local physician with deep knowledge of the region.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Don’t forget to like, comment, and subscribe for more rare, vintage films every Friday on PizzaFLIX.\n\nFilled with 1950s-era special effects and a haunting score by Albert Glasser, this film remains a standout among genre enthusiasts and vintage horror collectors alike. Whether you're a fan of atomic monster movies or classic adventure thrillers, this is a must-watch piece of cinema history.\n\n#fullmovie #MonsterFromGreenHell #ClassicSciFi #1950sHorror #AtomicAgeCinema #JimDavis #BarbaraTurner #KennethGCrane #UnitedArtists #SciFiHorror #VintageMovies #Friday@PizzaFLIX #pizzaflix",
      "addedAt": "2025-12-24T01:03:05.257Z",
      "thumbnail": "https://i.ytimg.com/vi/-FUNea1REbA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDWaetfCUt8CyE1uPlksc8bV_oP9A",
      "duration": 4218,
      "language": "en",
      "year": 1957,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:05.257Z"
}