{
  "imdbId": "youtube-8iCCEHpkdFs",
  "title": "Lee Jang-ho's Baseball Team (Lee Jang-ho-ui oeingudan)(1986)",
  "year": 1986,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8iCCEHpkdFs",
      "title": "Lee Jang-ho's Baseball Team (Lee Jang-ho-ui oeingudan)(1986)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03967\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03967\n\n감독(Director) : 이장호(Lee Jang-Ho)\n출연 : 안성기,이보희,박암,신충식,박정자,최재성,맹상훈,이진영,나한일,최재현,권순철,권용운,임도완,이은영,김선애,김미경,김진경,노인령,임귀련,김현철,김대환,이준영,이경희,김헌준,송완모,문태선,신찬일,이석구,이기영,박민호,이지산,박용팔,신동욱,유명순,이한숙,박장호,정석현,최태운,박정삼,한상철(아역),안연홍,성종훈,하일성(특별출연)\n\n줄거리 : 불우하게 자랐지만 야구에 천부적인 재능을 타고난 오혜성은 그를 감싸주고 돌봐주었던 엄지를 사랑하게 되나 엄지의 전학으로 이들은 헤어지고 몇 년 후 야구장에서 재회하지만 엄지는 고교 천재타자 마동탁의 애인이 되어 있었다. 그 후 동탁과 혜성은 엄지를 사이에 두고 야구로 끝없이 대결하며 각각 다른 프로야구 구단에서 활약하지만 혜성은 심한 어깨 부상으로 야구를 포기하고 만다. 그러나 도태된 선수들의 야구를 향한 집념을 모아 외인구단을 만드는 손병호 감독 밑에서 지옥훈련을 받은 혜성은 다시 야구계로 돌아온다. 엄지를 차지한 동탁과 혜성의 대결이 다시 계속된다.\n\nCasts : Ahn Seong-Ki, Lee Bo-Hee, Choi Jae-Seong, Lee Eun-Young, Maeng Sang-Hun\n\nSYNOPSIS : Hye-sung grew up poor but he has a gifted talent for baseball. Eom-ji has watched over him since they were young. Hye-sung falls in love with Eom-ji but when she transfers to another school, they don't see each other for years. Hye-sung and Eom-ji meet again at a baseball field but Um-ji is now the girlfriend of the exceptional hitter of high school, Ma Dong-tak. Hye-sung competes endlessly with Dong-tak over Eom-ji. But he ends up with a serious shoulder injury and gives up baseball. Then Manager Sohn Byung-ho gathers up dismissed baseball players and forms a team. Manager Sohn puts his team through extreme training and Hye-sung returns to the baseball world. He competes once more with Dong-tak, who is by Eom-ji's side.",
      "id": "8iCCEHpkdFs",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:23:39.075Z"
}