{
  "imdbId": "youtube-fr72odZCzEo",
  "title": "Girls of Spider Island (1960 Horror) He strangles his victims with his mammoth claws!",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fr72odZCzEo",
      "title": "Girls of Spider Island (1960 Horror) He strangles his victims with his mammoth claws!",
      "description": "Shock upon shock! Terror upon terror!\nA team of chorus girls finds themselves caught in a deadly web when they are shipwrecked on a remote South Seas island. The lush, tropical isle seems an ideal place to await their rescue, but hidden in the jungle are giant poisonous spiders. A venomous bite transforms the girls' escort into a disfigured beast, half-man and half-insect. Consumed with lust and craving blood, the monster hunts down the defenseless girls and slaughters them one by one. The ensuing panic drives the dancers to squabble and fight amongst themselves until they realize that their only hope for survival is to work together in a final stand against the monster...\n\nOriginal title: Ein Toter hing im Netz (1969) AKA: Horrors of Spider Island, A Corpse Hung in the Web, Girls of Spider Island\n\nBlack & White version: https://youtu.be/7P0wm-lypVk\n\n\nDirector: Fritz Böttger\nWriters: Fritz Böttger, Eldon Howard, Albert G. Miller\nGenres: Colorized, Horror, Science Fiction, Exploitation\nMain Cast: \nHarald Maresch as Joe\nHelga Franck as Georgia\nAlexander D'Arcy as Gary\nHelga Neuner as Ann\nDorothee Parker as Gladys\nGerry Sammer as May\nHelma Vandenberg as Kate\nBarbara Valentin as Babs\n\n\n00:00 Full Colorized Movie\n01:55 Auditions for a dancing troupe in Singapore lead to hiring dancers with various backgrounds and talents.\n07:29 Survivors of a plane crash find land, water, and hope after days adrift on the ocean.\n20:34 Group of women stranded on an island discover a dead man in a cabin with a mysterious creature lurking.\n24:23 Girls on an island face danger as they are hunted by a mysterious killer.\n35:35 A group find themselves in danger on a deserted island after a mysterious disappearance.\n48:06 Stranded on an island they await rescue, with romantic tensions and mysterious disappearances.\n54:17 A tale of love, jealousy, and betrayal unfolds among a group of dancers in a tropical setting.\n1:01:51 A group of girls on an island encounter a dangerous creature with claws, leading to a series of events.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "fr72odZCzEo",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:34:30.759Z"
}