{
  "movieId": "youtube-TlR4xHzkiEg",
  "title": "Blizzard of Souls - Between the Fronts (WAR FILM in German complete, War Drama Movies NEW)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TlR4xHzkiEg",
      "id": "TlR4xHzkiEg",
      "title": "Blizzard of Souls - Between the Fronts (WAR FILM in German complete, War Drama Movies NEW)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Nachdem er seine Mutter und sein Haus verloren hat, findet Arturs einigen Trost darin, der Armee beizutreten. Doch der Krieg ist nicht so, wie er es sich vorgestellt hat...\n\nBLIZZARD OF SOULS - ZWISCHEN DEN FRONTEN (2019)\nOriginaltitel: Dveselu putenis\nMit: Oto Brantevics, Greta Trusina, Martins Vilsons\nRegie: Dzintars Dreibergs\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie Liebesgeschichte des sechzehnjährigen Arturs wird durch den Ersten Weltkrieg unterbrochen. Nachdem er seine Mutter und sein Zuhause verloren hat, findet er Trost im Eintritt in die Armee, da das Russische Reich zum ersten Mal nationale Bataillone zulässt. Doch der Krieg ist nicht so, wie Arturs ihn sich vorgestellt hat - kein Ruhm, keine Fairness. Er ist brutal und schmerzhaft. Arturs ist nun völlig allein, denn der Krieg fordert das Leben seines Vaters und seines Bruders. Auch bei der versprochenen schnellen Beendigung des Krieges und der rechtzeitigen Rückkehr nach Hause gibt es keine Fortschritte. In dem Bewusstsein, dass nur er allein nach Hause zurückkehren will und dass sein Heimatland nur ein Spielplatz für andere Nationen ist, findet Arturs die Kraft für die letzte Schlacht und kehrt schließlich nach Hause zurück, um alles von Grund auf neu zu beginnen, genau wie sein neu geborenes Land.\n#Netzkino #ganzerFilm #Kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:25.465Z",
      "thumbnail": "https://i.ytimg.com/vi/TlR4xHzkiEg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAy2gziLxmG8PIn7xY-kwI3-miqmA",
      "duration": 6259,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}