{
  "imdbId": "youtube-CMgtODtrdLI",
  "title": "My dear KeumHong(Geumhong-a Geumhong-a)(1995)",
  "year": 1995,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CMgtODtrdLI",
      "id": "CMgtODtrdLI",
      "title": "My dear KeumHong(Geumhong-a Geumhong-a)(1995)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04768\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04768\n\n감독(Director) : 김유진(Kim Yu-Jin)\n출연 : 김갑수(이상),김수철(구본웅),이지은(금홍),윤정빈(변동림),김우란(최경자),박지일(김기림),고인배(정지용),하덕성(김유정),주호성(이태준),고동업(박태원),정경희(김영숙),김종구(변호사),한성식(무슈우),안병경(전당포주인),양택조(신문사국장),이석구(잡지사부장),이예민(본웅 집사),추봉(국향여관 집사),윤일주(이상 부),전숙(이상 모),박용팔(다방 주인),정선우(주모),홍명구(주모남편),박현아(옥희),이은석(문인1),홍진웅(문인2),이준성(학예부원1),전수환(학예부원2),조재국(학예부원3),김경호(학예부원4),송영재(복덕방친구),홍동은(사진사),이선미(국향여관 하녀),김성룡(건달1),신근호(건달2),최영진(신여성),임창대(다방급사),이찬(일본기녀1),서지선(일본기녀2),김은영(기생),박이정(장고),조정원(가야금),송민정(춤),김보연(민요),김홍준(우정출연),송능한(우정출연),육상효(우정출연)\n\n줄거리 : 1932년 일본유학을 마치고 귀국한 본웅은 야수파의 칭호를 받으며 성공리에 열린 귀국전시회에서 청년시인 이상을 만난다. 이후 두사람은 거의 매일 같이 다니면서 온갖 기행을 즐긴다. 이상의 요양을 이유로 황해도 백천에 이른 둘은 금홍과 천박하고도 음란한, 또 한편으론 가슴아픈 사랑에 빠진다. 본웅은 마음속으로 금홍을 사모하나 이상과 기이한 애정행각을 벌이는 금홍을 지켜볼 수 밖에 없다. 경성에 올라가서도 금홍을 잊지 못하던 이상은 금홍에게 서울에 다방을 차려주고 한때나마 다정한 시간을 보낸다. '오감도'로 인해 이상은 문학적인 위기를 맞게되고 금홍은 다방을 살리려 애쓰다 이상과 크게 다투고 떠난다. 금홍이 떠난후 이상의 기벽은 극에 달하고 이후 다시 만난 둘은 서로 돌이킬 수 없는 상처를 안은채 헤어진다. 중년이 된 본웅은 금홍에게 이상이 오래전 동경에서 죽었음을 알리고 그의 유품을 전해준다.\n\nCasts : Kim Gap-Su, Kim Su-Cheol, Lee Ji-Eun, Yoon Jeong-Bin, Park Ji-Il, Ko In-Bae, Joo Ho-Seong, Kim Wu-Ran, Ha Deok-Seong\n\nSYNOPSIS : This is the true story of the Fauvist painter Bon-woong and Lee Sang, the poet and writer. The story takes place during the period of Japanese Imperialism in Korea. It tells the tale of the life and loves of one peculiar poet. In 1932, Bon-wwong returned from studying fine arts in Japan. He is known as a painter of the Fauvism school of the Art. At the first successful exhibition of his works, he meets a young man, Lee Sang, a poet with really queer character. Soon Lee Sang and Bon-woong become close friends, and they meet almost every day and enjoy all kinds of interesting and usual events. Lee Sang goes to visit Backchon (a health resort) for medical treatment. Bon-woong follow him. At Backchon, Lee and Bon-woong meet Gumhong (a famous waitress) and both fall in love with her. Lee loves Gumhong physically, vulgarly, and indecently. On the contrary, Bon-woong loves her spiritually and platonically with respect. So, he can do nothing but watch the torrid love affair between Lee and Gumhong.",
      "addedAt": "2025-12-26T00:23:34.230Z",
      "thumbnail": "https://i.ytimg.com/vi/CMgtODtrdLI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCYmcdDrhFr9Eh0A-A1CqHBfhtgfg",
      "duration": 5743,
      "language": "ko",
      "year": 1995,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:34.297Z"
}