{
  "imdbId": "youtube-gxl43GjzTfg",
  "title": "1973 Horror - The Death Wheelers - Ride with the Living Dead!",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gxl43GjzTfg",
      "id": "gxl43GjzTfg",
      "title": "1973 Horror - The Death Wheelers - Ride with the Living Dead!",
      "description": "Tom Latham, a charming and unhinged leader of the rebellious biker gang \"The Living Dead,\" is influenced by his mystic mother, a practitioner of dark arts, to take a dramatic leap into the unknown and return as \"undead.\" Turning his crew into unstoppable chaos-makers who terrorize their English town, Tom’s wild ride spirals into a high-octane clash between life, death, and the ultimate price of power, with his loyal friend Abby caught in the crossfire.\n\nOriginal title: Psychomania (1973)\nAlternative title: The Death Wheelers\n\nDirector: Don Sharp\nWriters: Arnaud d'Usseau, Julian Zimet\n\nMain cast:\nNicky Henson - Tom Latham\nBeryl Reid - Mrs. Latham\nGeorge Sanders - Shadwell\nMary Larkin - Abby Holman\n\nGenres: Dark comedy, Horror, Supernatural, Bikersploitation\nRelease date: 1973\nFilming location: Surrey, England\n\n\n00:00 Full Movie with subtitles\n02:44 Tom Latham and his biker gang, The Living Dead, create chaos in their English town.\n13:22 Tom confronts his mother, Mrs. Latham, demanding the secret of returning from the dead, setting his supernatural quest in motion.\n27:28 Tom, in a reckless act, rides his motorcycle off a bridge, sacrificing himself to prove his belief in resurrection.\n41:43 Tom, now undead, calls Shadwell and Mrs. Latham, boasting about his return and unsettling the living with his presence.\n46:26 Tom reclaims leadership of the gang, urging them to die and return like him, testing their faith and loyalty.\n52:03 Abby discovers that Henky hesitated at the last moment and did not return, while Jane has become one of the dead.\n69:22 Abby, revived after a near-death experience, is questioned by the inspector about the gang’s obsession with death.\n1:22:34 Mrs. Latham seals her fate in a final occult ritual with Shadwell, accepting the eternal consequences for her and Tom.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:31:31.017Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/gxl43GjzTfg/maxresdefault.webp?v=6802038b",
      "duration": 5401,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "AT",
          "CH",
          "DE",
          "ES",
          "FR",
          "GB",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:31:31.164Z"
}