{
  "movieId": "youtube-tPgWec8G6F0",
  "title": "A Wife’s Journey Through The Multiverse | Ingress | Full 2025 Sci-Fi Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tPgWec8G6F0",
      "id": "tPgWec8G6F0",
      "title": "A Wife’s Journey Through The Multiverse | Ingress | Full 2025 Sci-Fi Movie",
      "description": "A Wife’s Journey Through The Multiverse | Ingress | Full 2025 Sci-Fi Movie - A woman with the ability to travel between parallel realities is shattered when she loses her husband in a tragic accident. To heal, she must confront her past trauma and journey through the multiverse in search of a reality where he’s still alive.\n\nWatch Ingress, a full sci-fi drama and action movie about love, loss, and the power of parallel realities. After a tragic accident takes her husband, a woman with the ability to travel between multiple universes must confront her past trauma and navigate the multiverse in search of a reality where he is still alive. Perfect for fans of sci-fi thrillers, full free action movies, multiverse adventures, emotional drama films, and high-stakes science fiction stories, Ingress delivers suspense, heart, and a gripping journey across realities in the quest to reclaim love and hope.\n\nStars: Rachel Noll James, Johnny Ferro, Christopher Clark\n*Licensed from Distribution Solutions. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-26T23:59:26.396Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/tPgWec8G6F0/maxresdefault.webp",
      "duration": 7150,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:26.446Z"
}