{
  "imdbId": "youtube-vbaGfMklyFg",
  "title": "Sins of Jezebel 1953 | Paulette Goddard, George Nader | Queen's Temptation, Kingdom's Downfall.",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vbaGfMklyFg",
      "title": "Sins of Jezebel 1953 | Paulette Goddard, George Nader | Queen's Temptation, Kingdom's Downfall.",
      "description": "Most shameless sirens of all the ages!\nBiblical costume drama starring Paulette Goddard as the beautiful pagan Jezebel, corruptor of men.\nThe aging Ahab, king of Israel, comes under the influence of a young and beautiful but scheming pagan woman named Jezebel and, against the advice of his advisers and the prophet Elijah, marries her. Her plan to introduce her pagan idols to Israel angers God, who decides to wreak vengeance on Israel.\n\nOriginal title: Sins of Jezebel (1953)\n\nDirector: Reginald Le Borg\nWriter: Richard H. Landau\nGenres: Drama, History, Romance\nBudget: $100,000\n\nMain Cast:\nPaulette Goddard - Jezebel\nGeorge Nader - Jehu\nEduard Franz - Ahab\nJohn Hoyt - Elijah\nLudwig Donath - Naboth\n\n\n00:00 Full Movie (with subtitles)\n01:15 Jezebel, the striking pagan beauty, captures the eye of King Ahab, beginning her rise to power.\n10:42 Against the prophet Elijah’s warnings, Ahab marries Jezebel, setting the stage for Israel’s fall.\n18:23 Jezebel introduces pagan idols to Israel, stirring unrest and angering the prophet.\n28:35 Elijah prophesies divine vengeance as Jezebel’s influence corrupts Ahab and the kingdom.\n39:10 Ahab faces growing pressure from his advisers to reject Jezebel’s paganism, but his obsession deepens.\n50:22 As Jezebel’s power solidifies, the wrath of God looms over Israel, foretold by Elijah.\n1:02:17 A daring rebellion led by Jehu rises, challenging Jezebel’s hold on Ahab and the kingdom.\n1:13:45 Jezebel’s fate is sealed as divine retribution unfolds, fulfilling Elijah’s prophecy.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "vbaGfMklyFg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:41:24.505Z"
}