{
  "imdbId": "youtube-Qu-nU7YwKh0",
  "title": "Ganzer ÜBERLEBENSFILM nach wahrer Geschichte: The 12th Man - Kampf ums Überleben - auf Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Qu-nU7YwKh0",
      "title": "Ganzer ÜBERLEBENSFILM nach wahrer Geschichte: The 12th Man - Kampf ums Überleben - auf Moviedome",
      "description": "*GANZER FILM - Sie waren 12 Saboteure. Die Nazis töteten 11 von ihnen. Dies ist die wahre Geschichte desjenigen, der davongekommen ist*\n\nDen Spielfilm „The 12th Man - Kampf ums Überleben“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „The 12th Man - Kampf ums Überleben“:\nIMDb: *7,3* von 10\nAmazon: *4,4* von 5\n\n*Die Handlung von „The 12th Man - Kampf ums Überleben“*\nTromsø, Norwegen, 1943: Der Widerstandskämpfer Jan Baalsrud (Thomas Gullestad) und seine Gruppe geraten auf See in einen deutschen Hinterhalt. Während seine Kameraden gefangen genommen und brutal verhört werden, gelingt Baalsrud schwer verwundet die Flucht. An Land kämpft er sich durchnässt und geschwächt durch die eisige Winterlandschaft Nordnorwegens, stets verfolgt von der Gestapo unter der gnadenlosen Führung von Kurt Stage (Jonathan Rhys Meyers).\n\n\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „The 12th Man - Kampf ums Überleben“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\n\n#Moviedome #ganzerFilm #Historienfilm #FilmeKostenlos #MoviedomeFilm\n\nRegie: Harald Zwart\nLaufzeit: 135 Minuten\nFSK: 12\nErstveröffentlichung: 2017\n\n\n*Das sind die Schauspieler von „The 12th Man - Kampf ums Überleben“*\nThomas Gullestad als Jan Baalsrud\nJonathan Rhys Meyers als Kurt Stage\nMarie Blokhus als Gudrun Gronvoll\n\n\n*Die Handlung und Szenen von „The 12th Man - Kampf ums Überleben“* \nTromsø, Norwegen, 1943: Der Widerstandskämpfer Jan Baalsrud (Thomas Gullestad) und seine Gruppe geraten auf See in einen deutschen Hinterhalt. Während seine Kameraden gefangen genommen und brutal verhört werden, gelingt Baalsrud schwer verwundet die Flucht. An Land kämpft er sich durchnässt und geschwächt durch die eisige Winterlandschaft Nordnorwegens, stets verfolgt von der Gestapo unter der gnadenlosen Führung von Kurt Sage (Jonathan Rhys Meyers).\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „The 12th Man - Kampf ums Überleben“ in voller Länge auf deutsch ansehen.",
      "id": "Qu-nU7YwKh0",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:28:25.359Z"
}