{
  "imdbId": "youtube-If9aWPnBDYY",
  "title": "Lady Behave! (1937, Comedy) Sally Eilers, Neil Hamilton, Joseph Schildkraut | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=If9aWPnBDYY",
      "id": "If9aWPnBDYY",
      "title": "Lady Behave! (1937, Comedy) Sally Eilers, Neil Hamilton, Joseph Schildkraut | Colorized",
      "description": "It's bad enough that Clarice Kendall Andrews, Paula's irresponsible sister, comes home from celebrating Mardi Gras and drunkenly mentions that she got married during the festivities. What's worse is the fact that Paula knows that Clarice is still married to an equally irresponsible gigolo. \n\nOriginal title: Lady Behave! (1937)\nThis film is subtitled in many languages.\n\n\nBlack & White version: https://youtu.be/bxkCc9lOC7I\n\n\nDirector: Lloyd Corrigan\nWriters: Joseph Krumgold, Olive Cooper\nStars: Sally Eilers, Neil Hamilton, Joseph Schildkraut \nGenres: Colorized, Classics, Comedy, Romance\n\n\n00:00 Full Colorized Movie (with subtitles)\n01:28 A comedic chaos unfolds as a woman discovers she accidentally married a millionaire and seeks a divorce.\n07:01 A chaotic situation unfolds as a woman impersonates a married lady to avoid legal consequences, with unexpected twists and turns.\n12:11 A man offers to help a family in exchange for money and revenge, involving a letter, a horse, and a devious plan.\n17:36 A comedic story unfolds as a family tries to raise money for a good cause through unconventional means.\n23:04 An eventful evening unfolds with unexpected guests, fainting spells, and a missing person causing chaos.\n29:59 A group of individuals discuss a plan to prevent a woman from leaving with a man who claims to be her husband.\n37:26 A chaotic situation unfolds as a family tries to prevent a woman from running away with a manipulative man.\n43:08 A chaotic situation unfolds as characters navigate love, deception, and legal troubles.\n48:48 Family drama unfolds as a man's wife and sister-in-law confront him about a scandalous affair.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:03.654Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/If9aWPnBDYY/maxresdefault.webp",
      "duration": 3185,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:03.812Z"
}