{
  "imdbId": "youtube-nJ6BJd6V5tw",
  "title": "Dead on Arrival (1949) Colorized | Film Noir | Edmond O'Brien, Pamela Britton | with subtitles",
  "year": 1949,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nJ6BJd6V5tw",
      "id": "nJ6BJd6V5tw",
      "title": "Dead on Arrival (1949) Colorized | Film Noir | Edmond O'Brien, Pamela Britton | with subtitles",
      "description": "Time's ticking. A poisoned man's race to solve his own murder.\na man discovers he has been poisoned, and has only hours to unravel the mystery of his impending death, leading him on a relentless and suspenseful quest for the truth.\n\nOriginal title: D.O.A. (1949) AKA: Dead on Arrival\n\nBlack & White version:  https://youtu.be/BhbPMf7Jz10\n\nDirector: Rudolph Maté\nWriters: Russell Rouse, Clarence Greene\nStars: Edmond O'Brien, Pamela Britton, Luther Adler \nGenre:  Classics, Cult Film, Drama, Mystery, Film Noir\n\n00:00 Full Movie\n02:14 A man named Frank Bigelow is informing someone about a murder he claims to be the victim of, and he urgently requests to speak to the person in charge.\n12:22 Frank Bigelow is on vacation in San Francisco and receives a message from someone named Phillips who wants to urgently speak with him.\n20:54 A man discovers he has been poisoned and has only a short time to live.\n31:55 A man discovers that he has been poisoned and seeks answers about who did it and why.\n42:53 A man named Phillips was involved in a shady deal with a rare and expensive metal called iridium, which was stolen. He was arrested but released on bail, and later committed suicide. There are suspicions surrounding the circumstances of his death.\n49:56 A mysterious conversation takes place regarding the whereabouts of Reynolds and Phillips, as well as the existence of a sale document.\n1:01:06 A conversation takes place where one person is seeking someone named Raymond Rakubian, but the other person is suspicious and accuses them of meddling in their affairs.\n1:10:51 A person expresses their love for someone, but the other person refuses their help and leaves. Later, a letter is discovered revealing a secret affair and the person is poisoned.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:41:31.203Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/nJ6BJd6V5tw/maxresdefault.webp?v=64dc8867",
      "duration": 5017,
      "language": "en",
      "year": 1949,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:41:31.331Z"
}