{
  "imdbId": "youtube-c8P9_rSAKYY",
  "title": "Roaring City (1951 Film-Noir) Pistol Point Suspense! Action-packed thrills",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c8P9_rSAKYY",
      "id": "c8P9_rSAKYY",
      "title": "Roaring City (1951 Film-Noir) Pistol Point Suspense! Action-packed thrills",
      "description": "Roaring City (Sisters in Crime) is a 1951 American crime film produced and directed by William Berke. It was distributed by the independent Lippert Pictures as a second feature intended for the cinema, as well as  for television (under the name Sisters in Crime).\n\nSummary:\nA San Francisco private eye finds himself under suspicion while investigating a prizefighter's murder.\n\nMain Actors:\nHugh Beaumont - Dennis O'Brien\nEdward Brophy - 'Professor' Frederick Simpson Schicker\nRichard Travis - Inspector Bruger\nJoan Valerie - Irma Rand\nWanda McKay - Sylvia Rand\nRebel Randall - Gail Chase\nWilliam Tannen - Ed Gannon\nGreg McClure - Steve Belzig, alias Vic Lundy\nAnthony Warde - Bill Rafferty\nAbner Biberman - Eddie Paige\nStanley Price - Harry Barton\n\n\nB&W version: https://youtu.be/9d9tMq3ANaE\n\n\n00:00 Full movie (with subtitles)\n05:21 Boat rental owner Dennis \"Denny\" O'Brien is drawn into a suspicious betting scheme by fight manager Harry Barton.\n12:45 A doctor reveals that boxer Ham Harper risks his life in a rigged fight due to a dangerous blood clot.\n20:10 In a shocking twist, Vic Lundy defies expectations and refuses to lose the match, creating chaos.\n30:25 A threatening note uncovers Barton's deeper involvement in a conspiracy surrounding the boxing world.\n40:02 After a violent confrontation, Denny finds himself framed for the murder of Steve Rand.\n50:15 Confronting Bill Rafferty reveals his connection to Sylvia and a hidden fortune tied to the case.\n56:00 Sylvia confesses her stepmother Irma’s crimes, leading to a dramatic resolution and justice served.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:33:39.975Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/c8P9_rSAKYY/maxresdefault.webp",
      "duration": 3458,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:33:40.072Z"
}