{
  "imdbId": "youtube-FcDfIn9qysk",
  "title": "Das Geheimnis des wilden Mustangs - Ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FcDfIn9qysk",
      "id": "FcDfIn9qysk",
      "title": "Das Geheimnis des wilden Mustangs - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt “Das Geheimnis des wilden Mustangs”, online, in ganzer Länge bei #Moviedome sehen. Dieser Pferdefilm mit mystischem Einschlag erzählt von Freundschaft und Verlust. Mehr ganze Filme entdecken: Abonnieren ►https://bit.ly/MoviedomeAbo\n\nJetzt den Film kostenlos als ganzen Film in deutsch sehen\nDer Abenteuer- und Tierfilm “Das Geheimnis des wilden Mustangs” wurde 2009 in den USA veröffentlicht und handelt von der jungen Hannah Mills, die ihre Mutter verliert und auf einer Farm mit Pferden wieder ins Leben finden soll. Ein Film über Freundschaft und Verlust, der unter anderem vom Mythos des geheimnisvollen wilden Mustangs erzählt, den das kleine Mädchen und ihre Freundin finden und so ein unvergleichliches Abenteuer erleben. \n\n►Abonniere #Moviedome​ für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo​ \n►Mehr kostenlose HD Filme: www.moviedome.de\n\nFolge uns auch auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome​ \n► Instagram ► https://www.instagram.com/moviedome_de\n►Noch mehr tolle Pferdefilme ►http://bit.ly/NochMehrPferdefilme\n\n#Moviedome #DasGeheimnisdeswildenMustangs #GanzerFilm\n\nFilmlänge: 83 Minuten\nKinostart (DE): 06.10.2009\n\n\nWer sind die Schauspieler?\n\nDie Darsteller werden von folgenden Schauspielern verkörpert: \nMiranda Cosgrove (bekannt aus Ich einfach unverbesserlich oder iCarly: Party mit Victorious) in der Rolle der Hannah Mills \nDanielle Chuchran (bekannt aus Haunt - das Böse erwacht sowie Osombie) in der Rolle der C.j\nFred Ward (bekannt aus 2 Guns oder Flucht von Alcatraz) in der Rolle des Frank Mills Connie Sellecca in der Rolle der Mattie\nK.C Clyde in der Rolle des Dallas Brody \n\n\nDie Handlung und Szenen von “Das Geheimnis des wilden Mustangs”\nHannah Mills, ein junges Mädchen aus Cleveland, verliert auf tragische Weise ihre Mutter. Daher beschließt ihr Vater, Hannah über die Sommerferien auf eine Farm zu schicken, auf der sie ihre neue beste Freundin CJ kennenlernt. Die vielen Pferde und ihre neue Freundin helfen ihr, über den Schmerz hinweg zu kommen, doch etwas Mystisches geht in der Gegend der Farm vor sich. Nach einiger Zeit erfährt die junge Hannah von einer Sage über einen wilden Mustang, der nachts Stuten von den Pferdefarmen klauen soll. So beschließen die zwei Freundinnen, das Geheimnis um den mysteriösen Mustang zu ergründen und ein Abenteuer beginnt.\n\nEin spannender und zugleich herzerwärmender Film über Freundschaft und Trauer, bereichert durch die junge Star-Schauspielerin Miranda Cosgrove  \n\nDie Synchronisation \nDie deutsche Synchronisation der Verfilmung wurde durch die Firma DMT - Digital Media Technologie GmbH, Hamburg\n\nDanielle Chuchran; Sprecher: Linda Fölster\nK.C. Clyde; Sprecher: Nicolas König\nMiranda Cosgrove; Sprecher: Manuela Bäcker\nConnie Sellecca; Sprecher: Anne Moll\nCorbin Allred; Sprecher: Christian Stark\nGib Gerard; Sprecher: Leonhard Mahlich \n\n\n#Kinofilm #Film #FullMovie #Movie",
      "addedAt": "2025-12-26T00:36:29.031Z",
      "thumbnail": "https://i.ytimg.com/vi/FcDfIn9qysk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC1YMXIdWz9RbpLe8X54o2wIlQ3pQ",
      "duration": 4929,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:36:29.132Z"
}