{
  "imdbId": "youtube-H2P_AFNeNj8",
  "title": "The Zone - No Entry (THRILLER full movie German, new thriller films German completely new)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H2P_AFNeNj8",
      "id": "H2P_AFNeNj8",
      "title": "The Zone - No Entry (THRILLER full movie German, new thriller films German completely new)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Dystopisch-beklemmender Thriller über ein Mexiko der totalen Überwachung: Die Bewohner eines abgeschotteten Viertels mitten in Mexiko-Stadt sind schockiert von einem Gewaltverbrechen. Für einen der Bewohner, den jungen Alejandro, spitzt sich das Drama zu, als er auf den einsamen Jungen trifft, der dem Verbrechen entkommen ist und sich innerhalb der Grenzen des Viertels versteckt...\n\nLA ZONA - BETRETEN VERBOTEN (2007)\nOriginaltitel: La zona\nMit: Daniel Giménez Cacho, Daniel Tovar, Alan Chávez\nRegie: Rodrigo Plá\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nIn einer stürmischen Nacht dringen drei Jugendliche aus einem Slumviertel von Mexiko-City in das streng bewachte Villenviertel La Zona ein. Beim Einbruch in eines der Luxushäuser werden sie überrascht und zwei von ihnen auf der Flucht kaltblütig erschossen. Nur der junge Miguel kann entkommen und versteckt sich in einem Keller des Viertels. Ein Fall für die Polizei, doch in La Zona herrschen eigene Gesetze: Hier regieren Geld und Macht - der Hass auf den Abschaum der Slums kennt keine Grenzen. Panisch und von Rachelust getrieben gründen die Zonen-Bewohner eine Bürgerwehr, und die gnadenlose Hetzjagd auf Miguel beginnt. Wird es ihm gelingen, seinen übermächtigen Verfolgern zu entkommen?\n#Netzkino #ganzerFilm #ThrillerFilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:19.248Z",
      "thumbnail": "https://i.ytimg.com/vi/H2P_AFNeNj8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCZFTg1Q8upDKQbOv4kL8qVhqDaKg",
      "duration": 5483,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}