{
  "imdbId": "youtube-P_lVVgrtePM",
  "title": "Impact 1949 (Thriller, Film-Noir) Wanted By Two Women! One For Love! One For Murder!",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=P_lVVgrtePM",
      "title": "Impact 1949 (Thriller, Film-Noir) Wanted By Two Women! One For Love! One For Murder!",
      "description": "Impact is a 1949 American film noir drama directed by Arthur Lubin, and the screenplay was based on a story by film noir writer Jay Dratler.\n\nSynopsis: \nAn unfaithful wife plots with her lover to kill her husband, but when the lover dies in a botched attempt, the husband, left for dead, starts a new life—only to return and clear his name.\n\nMain Actors: \nBrian Donlevy - Walter Williams\nElla Raines - Marsha Peters\nCharles Coburn - Lt. Tom Quincy\nHelen Walker - Irene Williams\nAnna May Wong - Su Lin Chung\nRobert Warwick - Captain Callahan\nClarence Kolb - Darcy\nArt Baker - Eldredge - Defense Attorney\nWilliam Wright - Prosecutor\nMae Marsh - Mrs. King (Marsha's mother)\nTony Barrett - Jim Torrence\nPhilip Ahn - Ah Sing\n\nBlack & White version: https://youtu.be/8tM1Cu_9rk8\n\n\n00:00 Full Movie (with dubbed Spanish audio and subtitles in many languages)\n01:35 Walter Williams secures a major business deal with confidence and authority.\n05:15 Irene Williams feigns illness to avoid a trip with Walter, setting a mysterious tone.\n12:00 Walter picks up Jim Torrance, a supposed relative, for a road trip.\n22:56 A suspicious flat tire leads to a tense interaction between Walter and Jim.\n32:36 Irene learns of Walter's \"death\" in a fiery car crash, reacting with calculated grief.\n47:48 Lieutenant Quincy uncovers evidence linking Irene to a conspiracy.\n1:06:05 Walter, alive and under a new identity, starts a fresh life in Larkspur, Idaho.\n1:16:01 Walter reveals his true identity to Marsha, grappling with his past.\n1:25:50 Irene's lies unravel as new evidence surfaces, implicating her in a murder plot.\n1:32:00 A hotel key becomes the critical clue tying Irene to her lover and the crime.\n1:38:14 Irene's courtroom confession exposes her guilt, clearing Walter's name.\n1:39:18 Walter is exonerated, choosing to rebuild his life with newfound clarity.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "P_lVVgrtePM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:33:44.665Z"
}