{
  "imdbId": "youtube-hCv0bBMguTw",
  "title": "Sexy Party / Death on the Fourposter (Thriller, 1964) by Josipovici & Molteni | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hCv0bBMguTw",
      "id": "hCv0bBMguTw",
      "title": "Sexy Party / Death on the Fourposter (Thriller, 1964) by Josipovici & Molteni | Colorized Movie",
      "description": "Secrets, seances, and strangulation!\nA group of 60's hipsters set out for a party at a creepy castle, where they become embroiled in love triangles and bizarre mind games. As strange prophecies start coming true, the evening takes a deadly turn, revealing unexpected twists and a campy, unpredictable plot with a low body count.\n\nBlack & White version: https://youtu.be/KrOGyWQI0XM\n\n\nOriginal title: Delitto allo specchio (1964) AKA: Death on the Fourposter / Sexy Party\n\nDirectors: Jean Josipovici, Ambrogio Molteni\nWriters: Jean Josipovici, Giorgio Stegani\nStars: John Drew Barrymore, Gloria Milland, Luisa Rivelli\nGenre: Colorized classics, Italian giallo film, Horror, Thriller\n\nThis film has English audio, and subtitled in many languages\n\n\n00:00 Full Movie\n00:17 A group of friends arrive at a castle for a weekend getaway, encountering mysterious and intriguing characters.\n09:32 Intriguing events unfold during a gathering at a castle, where relationships and secrets come to light.\n20:11 A group plays a revealing game at a party, uncovering illusions and desires.\n26:40 Mysterious events unfold during a gathering, leading to a chilling revelation.\n51:17 Tragedy strikes as a murder occurs during a mysterious gathering at an old-fashioned dress shop.\n53:04 Murder mystery unfolds as group suspects each other based on alibis and timelines.\n59:26 A murder mystery unfolds as tension rises among a group of individuals in a secluded location.\n1:14:42 Murder mystery unfolds as group searches for missing person in a secret stairway.\n1:27:02 Murder mystery unfolds with intricate plot twists, revealing hidden motives and a shocking revelation.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:37.888Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/hCv0bBMguTw/maxresdefault.webp",
      "duration": 5504,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:38.002Z"
}