{
  "imdbId": "youtube-DHy5W-Gx3dI",
  "title": "The Family Pedigree   (Jogbo)(1978)",
  "year": 1978,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DHy5W-Gx3dI",
      "title": "The Family Pedigree   (Jogbo)(1978)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03286\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03286\n\n영화글\nhttps://www.kmdb.or.kr/story/10/2038\nhttps://www.kmdb.or.kr/story/5/1316\n\n감독(Director) : 임권택(Im Kwon-Taek)\n출연 : 주선태,하명중,한혜숙,최남현,김신재,윤양하,주상호,김석훈,독고성,이향,김기범,최재호,박광진,임해림,이정애,임예심,김지영,전숙,김웅,지방열,박병기,박달,추봉\n\n줄거리 : 경기도청 총력1과에 근무하는 일본인 청년 다니는 총독부의 명령에 따라 창씨개명 작업을 수임한다. 다니가 찾은 곳은 설씨 집안이 모여사는 곳으로 종손 설진영은 완강하고 강직한 조선인이었다. 다니는 설진영의 인간성과 그의 딸 옥순의 아름다움에 끌리고 조선인의 족보를 지키려는 정신에 감동, 갈등을 겪는다. 설진영의 창씨개명 거부는 딸의 약혼자를 경찰에 끌려가게 하여 파혼당하게 하는가 하면 다른 가족에게까지 배척을 받게 된다. 그는 급기야 면사무소에 나가 가족 모두의 창씨개명을 서명하기에 이르른다. 그러나 끝내 자신만은 '설진영' 그대로 둔 채 돌아와 족보 마지막장에 사유를 쓰고 자결한다.\n\nCasts : Joo Seon-Tae,  Hah Myung-Joong,  Han Hye-Suk,  DokKo Seong\n\nSYNOPSIS : Dani, a Japanese official who works at the Gyunggi-do provincial government to have Koreans change their names to Japanese ones according to the Governor General's order. Sul Jin-young is a stubborn and proud Korean who refuse to change his name. Dani comes to respect Sul and falls in love with his daughter Ok-sun. Therefore the conflict between his duty and respect for Suls' proud heritage to keep their family pedigree faces cruel consequences. Ok-sun gets drafted for labor which leads to breakage of their engagement. Sul realizes that he was jeopardizing the lives of his family so signs up to change all their names yet except for his name. He comes back home and kills himself with his last words on a page of the family pedigree.",
      "id": "DHy5W-Gx3dI",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:07.179Z"
}