{
  "imdbId": "youtube-hkWHyxCZ_jE",
  "title": "[4K] 과부춤 (1983) / Widow Dance (Gwabu-chum)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hkWHyxCZ_jE",
      "id": "hkWHyxCZ_jE",
      "title": "[4K] 과부춤 (1983) / Widow Dance (Gwabu-chum)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01511\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01511\n\n영화글 : https://www.kmdb.or.kr/story/10/2020\n\n감독(Director) : 이장호(Lee Jang-ho)\n출연 : 박원숙 , 이보희 , 박정자 , 박송희 , 현석\n\n줄거리 :   홍말숙은 아이가 하나 있는 과부이다. 말숙은 결혼상담소 권소장의 권유로 재일교포 미망인 행세를 하며 사기행각을 벌이게 된다. 그녀의 오빠 홍찬일은 청소부로서 딸,아들을 키우며 단란하게 산다. 찬 일의 집 건넌방에는 금선이라는 과부가 이사를 오고, 시골에서 살다 온 과부 조씨댁은 꿋꿋하게 살지만 아들이 말썽을 부린다. 홍말숙은 사기행각으로 옥살이를 하게 되고, 홍찬일은 어느날 교통사고로 죽는다. 갑자기 과부가 된 동식이 엄마는 어느 빌딩의 청소부로 취직한다. 말숙은 신흥 개척교회의 광신자가 되나 이용만 당하고 과부들은 가난한 앞날을 헤쳐나갈 결심을 한다.\n\nCasts : Park Won-suk, Lee Bo-hee, Park Jung-ja, Park Song-hui, Hyeon Seok\nSYNOPSIS : Hong Mal-suk is a widow with one child. Persuaded by Manager Kwon of a marriage consultation company, Mal-suk pretends to be a Korean-Japanese war widow, participating in the con. Hong Chan-il, Mal-suk's brother, is a cleaning man. He lives a harmonious life raising a son and daughter. A widow named Keum-sun moves into the house across from Chan-il. The widow is from the country. She lives a solid life but her son is a troublemaker. Mal-suk ends up in jail due to her cons. Chan-il dies in a car accident one day. Suddenly a widow, Chan-il's wife gets a job as a cleaning woman at a building. Mal-suk becomes a religious fanatic at a newly established church but she only gets used. The widows decide to fight in the future.",
      "addedAt": "2025-12-26T00:21:14.962Z",
      "thumbnail": "https://i.ytimg.com/vi/hkWHyxCZ_jE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBIdjct88M64XOvqNf40I36-D9qeA",
      "duration": 6570,
      "language": "ko",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:15.011Z"
}