{
  "imdbId": "youtube-YyPKLcWwxk0",
  "title": "When the Buckwheat Flowers Blossom ( Memilkkot Pil Muryeop )(1967)",
  "year": 1967,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YyPKLcWwxk0",
      "title": "When the Buckwheat Flowers Blossom ( Memilkkot Pil Muryeop )(1967)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01589\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01589\n\n영화글 : https://www.kmdb.or.kr/story/10/2675\n\n감독(Director) : 이성구(Lee Seong-Ku)\n출연 : 박노식,김지미,김희갑,허장강,도금봉,이순재\n\n줄거리 : 젊은 시절부터 함께 다니던 장돌뱅이 허생원(박노식)과 조선달(김희갑), 윤봉운(허장강)은 오늘도 봉평장에 자리를 잡는다. 최근들어 나이 탓에 쇠약해지고, 현대식으로 장사를 하는 사람들 때문에 더욱 형편이 어려워진 그들은 하루 벌어 하루 먹고 사는 떠돌이 인생들이다. 그러나 그들은 또한 큰 욕심 없이 그저 밥 세 끼나 먹고 저녁에 주막에서 막걸리나 한 사발 걸칠 수 있는 정도면 그저 그만인 사람들이기도 하다. 허생원 일행은 술이나 한 잔 하기 위해 들른 충주 집에서 낮에 장에서 젊은 손님을 빼앗겼던 젊은 장돌뱅이 동이(이순재)와 마주치는데, 충주댁이 동이에게 홀린 것을 보고는 부아가 치민 허생원은 동이의 따귀를 때려 쫓아버리고 만다. 그날, 메밀꽃 밭을 지나던 세 사람은 우연히 젊은 시절의 추억을 떠올리며 허생원의 지난 이야기를 듣게 된다. 젊은 시절에도 봉평장에서 장돌뱅이를 하던 허생원은 포목전에서 분이(김지미)를 보고는 첫눈에 반해버린다. 어느 날 밤, 그는 냇가에서 목욕을 하고 있던 분이를 보고, 마음이 끌려 하룻밤을 지내게 된다. 이후, 허생원은 분이와 평생을 함께 할 생각으로 분이 아버지가 진 빚 삼백 냥을 벌기 위해 씨름판에 가기도 하고, 아끼던 나귀를 팔기도 한다. 겨우 돈을 구해 봉평에 온 허생원은 분이가 이미 빚 때문에 팔려갔다는 소식을 듣게 되자, 장돌뱅이를 그만두고 분이를 찾아 떠난다. 어린 아들과 함께 다닌다는 분이를 찾아 떠돌기를 몇 해, 소문을 듣고 가는 곳마다 또 다른 곳으로 팔려갔다는 이야기 뿐, 생사조차 알지 못하게 되자, 허생원은 장돌뱅이로 돌아오고 만다. 그 후, 이렇게 평생을 장돌뱅이로 지내게 되었다는 허생원의 이야기가 끝이 나고, 다음 장터로 이동을 하던 중, 몸이 쇠약했던 윤봉운이 숨을 거두게 되고, 쓸쓸히 죽어가는 친구를 바라보던 조선달도 장돌뱅이 생활에 신물을 느끼고 집으로 돌아간다. 어차피 돌아갈 곳도 없어 혼자 가야했던 길에 마침 함께 길을 나섰던 동이가 동행하게 되고, 이런저런 이야기 끝에 허생원은 동이가 예전부터 어머니와 함께 떠돌아다녔고, 어머니의 고향이 봉평이라는 말을 듣게 된다. 설마했던 허생원은 동이가 왼손으로 담배불을 붙이는 것을 보고는 확신에 차 동이의 어머니가 있다는 제천으로 함께 길을 향한다.(영화 +『여원』 요약)\n\nCasts : Park No-Shik, Kim Jee-Mi, Kim Hee-Gap, Heo Jang-Kang,, Do Keum-Bong\n\nSYNOPSIS : Heo, an itinerary market dealer, had a short and passionate love with a girl called Bun when he was young and still cherishes that memory in his heart. One day, he happens to meet a young market dealer who is left-handed like him. While talking to him, he finds out that the man is actually his son. He cannot tell him that he is his father but just follows him to find Bun, for whom he has been looking for all of his life.",
      "qualityMarks": [
        "video-issues"
      ],
      "id": "YyPKLcWwxk0",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-10T18:24:36.604Z"
}