{
  "movieId": "youtube-9de7_vWZhmM",
  "title": "Alone at the Front (FULL WAR MOVIE in German, films based on true events, war drama)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9de7_vWZhmM",
      "id": "9de7_vWZhmM",
      "title": "Alone at the Front (FULL WAR MOVIE in German, films based on true events, war drama)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein portugiesischer Soldat, der während der Schlacht von La Lys von seinem Team getrennt wurde, kämpft sich durch die deutschen Stellungen, damit er die Sicherheit seiner Kameraden gewährleisten kann.\n\nALLEIN AN DER FRONT (2018)\nOriginaltitel: Soldado Milhões\nMit: Miguel Borges, João Luís Arrais, Raimundo Cosme, Isac Graça, Tiago Teotónio Pereira\nRegie: Gonçalo Galvão Teles & Jorge Paixão da Costa\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nFlandern im April 1918: In den engen schlammigen Schützengräben von La Lys tobt einer der härtesten Überlebenskämpfe des Ersten Weltkriegs. Dicht gedrängt sehen sich die jungen Soldaten einer portugiesischen Einheit der grausamen Übermacht eines immer wieder zuschlagenden Feindes ausgesetzt, dessen Kugelhagel langsam ihre Reihen dezimiert. Als der Kommandant endlich den Befehl zum Rückzug gibt, bleibt ein einziger Soldat an vorderster Front, um den Vormarsch der Gegner zu stoppen. Im Alleingang hält er tagelang die Stellung in den Gräben und rettet unzählige Leben. Er kämpft, er blutet und er siegt. Er wird als gefeierter Nationalheld in die Geschichte Portugals eingehen und unzählige Lieder und Geschichten werden ihn unsterblich machen. Sein Name ist Anibal Augusto Milhais, und dies ist seine Geschichte. Hundert Jahre sollte es dauern, bis der große Kampf des Anibal Milhais seine verdiente filmische Würdigung in Form von ALLEIN AN DER FRONT erfahren sollte.\n#Netzkino #ganzerFilm #kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:52.701Z",
      "thumbnail": "https://i.ytimg.com/vi/9de7_vWZhmM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCNNCYQPOqiluzd6HVWTNR29Wehhw",
      "duration": 5039,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}