{
  "imdbId": "youtube-meG5MK5T3qw",
  "title": "James Bond 007, For Our Eyes Only (Documentary) #jamesbond",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=meG5MK5T3qw",
      "id": "meG5MK5T3qw",
      "title": "James Bond 007, For Our Eyes Only (Documentary) #jamesbond",
      "description": "Exploration of the Evolution of the Iconic Character James Bond 007 Through Various Actors and Films: A Documentary on the Journey of James Bond Across Decades, Films, and Adversaries, Highlighting Locations, Villains, and Bond Girls from 1985 to 2002\n\nIn anticipation of the 25th chapter in the iconic James Bond Saga, based on the novels of British writer Ian Fleming, Sabbatical Entertainment presents \"For Our Eyes Only\" an enthralling documentary that recounts and relives all of 007's menacing missions throughout this legendary cinematic franchise, from 1962's premiere of \"Dr. No\", to the highly anticipated \"No Time To Die.\"\n\n\nThis Documentary has English & Portuguese audio, and subtitled in many lanugages\n\nDirector: Miguel Somoza\nWriters: Carla Duarte, Miguel Somoza\n\n\n00:00 Full Documentary with subtitles\n02:23 Exploration of the evolution of the iconic character James Bond 007 through various actors and films.\n07:59 Evolution of James Bond actors and characters explored through the decades.\n14:02 The iconic journey of James Bond through various films and adversaries.\n20:29 Exploration of James Bond films, highlighting locations, villains, and Bond girls across various missions.\n27:34 Exploration of James Bond movies from 1985 to 2002, highlighting villains, Bond girls, and locations.\n34:59 Exploration of the iconic James Bond franchise through the portrayal of Bond girls and key plot points.\n42:16 Exploring the iconic elements of James Bond movies, from vehicles to weapons and romantic encounters.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:37.259Z",
      "thumbnail": "https://i.ytimg.com/vi/meG5MK5T3qw/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGHIgVSg8MA8=&rs=AOn4CLAFs612k3TUQ6rrZBgjMexV6dm3QA",
      "duration": 2769,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:37.404Z"
}