{
  "imdbId": "youtube-NUTxvmn6okA",
  "title": "월급쟁이(1962) / A Salaryman (Wolgeubjaeng-i) (1962)",
  "year": 1962,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NUTxvmn6okA",
      "title": "월급쟁이(1962) / A Salaryman (Wolgeubjaeng-i) (1962)",
      "description": "사운드 필름이 소실되어 30:38~42:12 구간에 소리가 없습니다. 자막을 켜고 관람하시기 바랍니다.\nNo sound from 30:38 to 42:12 due to the sound film is lost. Please turn on subtitles. \n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00759\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00759\n\n감독(Director) : 이봉래(Lee Bong-rae)\n출연 : 김승호, 주증녀, 엄앵란, 이수련, 방성자\n\n줄거리 :  경리계장인 박중달(김승호)는 청렴결백하여 10년간의 무사고 경력을 갖고 있다. 그는 대학과 고교에 다니는 두 딸(엄앵란, 방성자)과 국민학교에 다니는 아들(안성기), 이 삼남매를 키우며 가난한 월급장이 생활을 해오고 있다. 어느 날 그가 술자리에서 만난 불우한 후배(박암)에게 월급봉투를 몽땅 주어버림으로써 사건이 일어난다. 그는 사장이 미국에 가있는 사이 부정을 꾀하는 상사(김희갑ㆍ주선태)들의 꼬임을 거부하고 우직하게 살아간다. 상사들은 부정을 하고 싶어도 경리계장 때문에 엄두를 내지 못하던 중 궁여지책으로 그를 모함해 퇴직시킨다. 하루아침에 실직당한 그의 가정은 고생이 말이 아니다. 하지만 오래지 않아 그의 퇴직이 부당한 것이었음을 알게 된 사장이 찾아와 지난 일을 사과하고 그를 과장으로 승진시키고 가족은 다시 행복을 되찾는다.\n\nCast : Kim Seung-ho , Ju Jeung-ryu , Um Aing-ran , Lee Su-ryeon , Bang Seong-ja\n\nSYNOPSIS (CONTAINS SPOILERS) : A man is a chief of accounting who does business honestly, never cheating anyone in his 10 years at the company. But his boss is a completely different man. Regarding him as an obstacle keeping him from stealing the company's money, the boss lays a trap to get him fired. The boss' plot is successful. Now jobless, he and his family suffer a lot. But not long after, the president of the company finds out what's been going on. He comes to see him to apologize and lets him know that he is not only reinstated but also promoted.",
      "id": "NUTxvmn6okA",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:13.174Z"
}