{
  "imdbId": "youtube-UGiM41pPiHI",
  "title": "Tekken – Kazuya´s Revenge - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UGiM41pPiHI",
      "title": "Tekken – Kazuya´s Revenge - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Action-Martial-Arts Film \" Tekken – Kazuya´s Revenge „ in ganzer Länge bei #Moviedome sehen.\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\nDie Welt ist düster - gespalten in arm und reich, Gewalt regiert. Kazuya Mishima (Kane Kosugi) soll von einem Einsatzkommando festgenommen werden, kann aber fliehen, doch gerät anschließend in einen schweren Unfall. Als er wieder erwacht, muss er feststellen, dass er nach Tekken City entführt wurde, wo er für einen mysteriösen Pfarrer Auftragsmorde begehen muss. Kazuya, der den Namen K bekommt, weil er keine Erinnerung an seine Vergangenheit mehr hat, wird von einer unbekannten Stimme in seinem Kopf verfolgt und versucht, sich aus den Fängen des Pfarrers zu befreien. Innerhalb der Killertruppe brodelt es und es kommt zum blutigen Aufstand, der Kazuya schließlich zum wahren Herrscher von Tekken City führt!\nEine atemberaubende Melange aus Actionfilmen wie Mortal Kombat, Ong-Bak und Boodsport. Mit Martial-Arts-Ikone Kane Kosugi (Ninja Pfad der Rache, D.O.A. Dead or Alive) in der Hauptrolle.\nJetzt “ Tekken – Kazuya´s Revenge ” kostenlos als ganzen Film auf deutsch sehen.\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer # Action-Martial-Arts \n \nFilmlänge: 85 Minuten \nFSK: ab 16 Jahren\nDVD-Start (DE): 2015\n\nDie Darsteller\nCary-Hiroyuki Tagawa in der Rolle des Heihachi Mishima\nKane Kosugi in der Rolle des Kazuya Mishima\nGary Daniels in der Rolle des Bryan Fury\nKelly Wenham in der Rolle der Rhona Anders\n\n\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nDas Action-Martial-Arts Film „ Tekken – Kazuya´s Revenge ” in voller Länge auf deutsch ansehen.",
      "id": "UGiM41pPiHI",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:35:23.398Z"
}