{
  "imdbId": "youtube-v5E_yjvcJBc",
  "title": "아제아제 바라아제(1989) / Aje Aje Bara Aje (Aje Aje Bara Aje)",
  "year": 1989,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=v5E_yjvcJBc",
      "id": "v5E_yjvcJBc",
      "title": "아제아제 바라아제(1989) / Aje Aje Bara Aje (Aje Aje Bara Aje)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04193\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04193\n\n감독(Director) : 임권택(Im Kwon-Taek)\n출연 : 강수연(순녀),진영미(진성스님),유인촌(현종),한지일(박현우),전무송(스님),윤인자(은선스님),윤양하,김세준(대학생),안병경(송기사),최종원(비구),신충식,김애경(순녀모),김복희,이정애,정미경,조학자,권일정,송희연,홍원선,이석구,조주미,오영화,박예숙,임예심,홍성연,이숙희,백순정,강지영,김해주,김성순,김지현,이은경,이명숙,김유경,장광남\n\n줄거리 : 고등학생 순녀는 손길이 닿지 않는 부성의 아픔만 남기고 떠난 아버지 윤봉스님, 고리대금업을 하는 어머니 제주댁을 뒤로하고 덕암에 찾아와 은선스님을 모시고 비구니가 된다. 순녀는 박현우라는 사람을 구출한 일로 파계아닌 파계를 하여 끝없는 시련을 맞는다. 남해안에서 구도의 길을 찾아 만행중인 진성을 만나 비금도 병원생활을 시작하나 다른 인간의 아픔을 체득하는 기간이었다. 송기사를 건지려던 그녀는 송기사의 죽음으로 덕암사를 다시 찾아 진리,자유,구원 그 어떠한 지순지고의 가치도 사람이 아플때 뿌리내리지 않고는 의미가 없다는 가르침을 스승인 은선으로부터 배운다.\n\nCasts : Kang Su-Yeon, Jin Young-Mi, Yoo In-Chon, Han Ji-Il\n\nSYNOPSIS : A high school girl student Sun-nyeo's father, Buddhist monk Yun Bong, dies. The paternal pain is the only legacy her father left her. Soon-nyeo leaves behind her money-lending mother for Deokam Temple, where she serves Buddhist monk Eun-seon as a Buddhist nun. Sun-nyeo saves a man named Pak Hyun-wu and so starts her 'violation of commandments' and she deals with endless conflict. Sun-nyeo meets Monk Jin-sung who is searching for 'the way' of spiritual morality as he travels along the southern coast. They begin to work at a hospital on Bi-geum Island where Sun-nyeo experiences the pain of humans. Sun-nyeo tries to save Song Ki-sa but is unable to. After Song Ki-sa's death, Sun-nyeo returns to Deokam Temple where she learns about the infinite value of truth, freedom, and salvation from Buddhist monk Eun-seon.",
      "addedAt": "2025-12-26T00:21:35.235Z",
      "thumbnail": "https://i.ytimg.com/vi/v5E_yjvcJBc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD4elmAl-m_B4OG-J1KlUcp5td4EA",
      "duration": 7266,
      "language": "ko",
      "year": 1989,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:35.254Z"
}