{
  "imdbId": "youtube-DwDtYririX4",
  "title": "Horror Transplant | Hands of a Stranger (Thriller, 1962) by Newt Arnold | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DwDtYririX4",
      "title": "Horror Transplant | Hands of a Stranger (Thriller, 1962) by Newt Arnold | Colorized Movie",
      "description": "His new hands had a mind of their own, that of a killer!\nA concert pianist loses his hands in a car crash, but a surgeon gives him new ones. The experimental medical procedure goes awry when the new hands drive the pianist mad.\n\nOriginal title: Hands of a Stranger (1962) AKA: The Answer\nSubtitles are available in many languages. \n\nBlack & White version: https://youtu.be/oKF3iwROmZY\n\n\nDirector & Writer: Newt Arnold \nStars: Paul Lukather, Joan Harvey, James Noah \nGenres: Colorized classics, Cult Film,  Horror, Thriller\n\n\n00:00 Full Movie (with subtitles)\n03:47 A thrilling encounter unfolds as a doctor investigates a mysterious death and uncovers shocking details.\n11:23 A chilling tale of hands transplant and its consequences in a thriller movie from 1962.\n15:39 A thrilling story unfolds as a doctor is faced with a moral dilemma during a surgery involving a man's severed hands.\n21:29 Medical team faces ethical dilemma after transplanting mysterious hands, leading to unforeseen consequences.\n26:29 Medical thriller involving a mysterious murder case, a secret experiment, and a miraculous hand transplant.\n32:15 Medical breakthrough in hand transplant surgery leads to successful outcome.\n39:23 Medical drama unfolds as a patient grapples with a life-changing surgery and the challenge of accepting new hands.\n45:44 Unexpected twists and revelations unfold in a thrilling encounter between two individuals.\n51:55 Intense emotional turmoil unfolds as two individuals navigate a complex relationship filled with dependency and a desire for independence.\n56:52 Exploration of medical advancements and ethical dilemmas in a thriller movie.\n1:12:49 A mysterious death leads to unsettling revelations and a deepening sense of unease.\n1:14:16 Mystery unfolds as a man discovers his son dead with broken fingers, leading to a calculated crime scene setup.\n1:19:33 A thriller movie involving a doctor's unethical actions and a patient seeking revenge.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "DwDtYririX4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:03.920Z"
}