{
  "imdbId": "youtube-o30iGGpNG_M",
  "title": "Kansas Pacific 1953 | Western | Sterling Hayden, Eve Miller, Barton MacLane | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=o30iGGpNG_M",
      "title": "Kansas Pacific 1953 | Western | Sterling Hayden, Eve Miller, Barton MacLane | Full Movie",
      "description": "Built by bullets, dynamite, and blood-stained spikes! \nWith the Civil War about to begin, Southern saboteurs attack frontier railroad construction. Army captain Nelson is sent out to oppose them. As the tracks push westward, Nelson must contend with increasingly violent sabotage, while trying to romance the foreman’s pretty daughter Barbara.\n\nOriginal title: Kansas Pacific (1953) \n \nDirector: Ray Nazarro\nWriter: Daniel B. Ullman \nStars: Sterling Hayden, Eve Miller, Barton MacLane \nGenres: Classics, Western\n\n00:00 Full Movie\n02:48  A telegram arrives at the Rockwood office for Mr. Johnson from Washington, interrupting construction on the Kansas Pacific railroad.\n09:58  A construction engineer is sent to supervise the building of a railroad, but the current crew is resistant to his presence.\n16:25  New construction engineer; Mr. Nelson arrives in town & faces opposition from the locals.\n27:26  A railroad engineer suggests using block and tackles to save manpower in setting up rails.\n29:21  A young engineer named Nelson arrives to work on a railroad construction project in Kansas, facing resistance from the local workers, including Joe Bruce and his father.\n34:04  A construction crew faces sabotage and threats as they try to build a railroad line.\n42:51  A group of men work together to finish a railroad line before the war begins, facing danger and obstacles along the way.\n55:48  The Kansas Pacific railroad is being built and faces challenges from outlaws who want to stop its progress.\n1:05:39  In this video, a plan is made to hold up a troop train and a successful attack is carried out.\n\n@CultCinemaClassics",
      "id": "o30iGGpNG_M",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:40:21.056Z"
}