{
  "imdbId": "youtube-xat8ZmhrG5o",
  "title": "Space Dogs (Kinderfilm in voller Länge, kompletter Film auf Deutsch, ganzer Film) *HD*",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xat8ZmhrG5o",
      "title": "Space Dogs (Kinderfilm in voller Länge, kompletter Film auf Deutsch, ganzer Film) *HD*",
      "description": "► Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Dir gefällt Netzkino? Dann lass uns ein Like da: http://bit.ly/NetzkinoFacebook\n► Kinderfilm von Inna Evlannikova und Svyatoslav Ushakov aus dem Jahr 2010.\n\n..................................................................\n\nSPACE DOGS (2010)\nOriginaltitel: Space Dogs\nMit: Anna Bolshova, Elena Yakovleva, Evgeniy Mironov\nRegie: Inna Evlannikova und Svyatoslav Ushakov\nFSK: Freigegeben ohne Altersbeschränkung\n\nINHALTSANGABE:\nVor rund fünfzig Jahren betrat mit dem Russen Juri Gagarin der erste Mensch den Weltraum – bereits vier Jahre zuvor, im November 1957, schickte die Sowjetunion mit der Hündin Laika das erste Lebewesen ins All. Doch nicht Laika, deren Rückflug nie vorgesehen war, sondern die beiden Hunde Belka und Strelka waren 1960 neben vierzig Mäusen und zwei Ratten die ersten Lebewesen, die unter russischer Flagge in den Orbit flogen und heil auf die Erde zurückkehrten.\n\nAls Star des Moskauer Zirkus' genießt die Hündin Belka ein Leben voller Annehmlichkeiten, bis eines Tages ein Raketen-Kunststück schief läuft und die tierische Akrobatin irgendwo in den Moskauer Straßen eine Bruchlandung hinlegt. Hier trifft sie auf die Straßenhündin Strelka sowie die clevere Ratte Lyonya und macht Bekanntschaft mit einigen raufsüchtigen Kampfhunden. Am liebsten möchte Belka schnurstracks zurück in den Zirkus, doch ein Hundefänger macht diesen Plan zunichte und befördert die neuen Freunde in ein Ausbildungscamp für Kosmonauten, wo sie ein hartes Training absolvieren müssen. Der weitaus größte Teil von Space Dogs spielt in diesem Ausbildungslager, das mit seinen hohen Stacheldrahtzäunen, dem militärischen Drill und dem rauen Schäferhund-Ausbilder anfänglich an ein Arbeitslager erinnert. Als nach einer Weile auch die Kampfhunde von der Straße im Camp aufschlagen, müssen Belka und ihre Freunde ihre Differenzen überwinden, um sich für den Raketenstart zu qualifizieren...\n#Spielfilm #ganzerFilm #Kinderfilm\n\n\n\n..................................................................\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/NetzkinoAndroid\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n✘ Google+ - https://plus.google.com/+netzkino\n\n........................................­..........................\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "xat8ZmhrG5o",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:11:26.313Z"
}