{
  "imdbId": "youtube-XMyBmK8enLg",
  "title": "Burning Mountain ( Sanbul )(1967)",
  "year": 1967,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XMyBmK8enLg",
      "title": "Burning Mountain ( Sanbul )(1967)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01475\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01475\n\n영화글 : https://www.kmdb.or.kr/story/10/5232\n\n감독(Director) : 김수용(Kim Su-Yong)\n출연 : 신영균(공비),주증녀(점례),도금봉(사월),황정순(사월 친어머니),한은진(점례 시어머니),김정옥,전영주,김효진,김영옥,안인숙,송미남,이일선,윤산,정득순,전숙,윤신옥,김신명,고경애,김덕자\n\n줄거리 : 한국전쟁이 일어나고 마을의 남자들은 모두 전장으로 나가 죽거나 행방불명이 된다. 오랫동안 홀로 남아 있던 여자들은 남자의 품을 그리워한다. 그러던 중 여자들만 남은 산골 마을, 점례(주증녀)네 집 대밭에 교사였던 빨치산 규복(신영균)이 숨어든다. 그는 시어머니(한은진)를 모시고 사는 과부 점례를 협박해 자신을 숨겨달라고 하고, 점례는 먹을 것을 주며 그와 정을 통하게 된다. 점례의 행동이 수상한 것을 눈치 챈 다른 과부 사월(도금봉)이 그 사실을 알게 되고, 사월은 자신의 욕망을 채우기 위해 밀고를 하겠다며 점례와 규복을 협박하여 규복과 관계를 갖는다. 그런데 사월이 임신을 하고 마을에 소문이 퍼진다. 한편 빨치산 토벌을 위해 경찰이 대밭에 불을 질러 규복은 연기에 질식해 죽고, 사월은 자살을 한다. 점례는 죽은 규복을 쓰다듬으며 흐느껴 운다.\n\nCasts : Shin Young-Kyun, Do Keum-Bong, Joo Jeung-Nyeo, Hwang Jeong-Sun\n\nSYNOPSIS : In the early 1950s when Korea is still at war, Kyu-bok (Shin Young-kyun) who escaped from the North Korean People's Army secretly sneaks into a small village in the mountainside. This village has turned into a widow village due to the war and widows Jum-rye (Ju Jeung-ryu) and Sa-wol (Do Kum-bong) live across from one another. Jum-rye had to take care of her mother-in-law (Han, Eun-jin) who was also a widow, a dote grandfather-in-law, and mentally deranged sister-in-law (Kim Yeong-ok). Sawol lives with her mother (Hwang, Jung-soon). Sawol's husband was a soldier from the South and Jum-rye's was a soldier from the North, making the two women hostile towards one another. At first, it was Jum-rye who hid Kyu-bok sneaking around the village in an underground tunnel and slept with him. Later, Sawol finds out about the existence of Kyu-bok and threatens him to have sex with her. Afraid that Kyu-bok may be arrested, Jum-rye silently approves the relationship between Kyu-bok and Samwol, and a strange sense of solidarity begins to form between the two women as they get to possess the same man. Meanwhile, a mopping-up operation on remaining soldiers from the North takes place in the village and the troop sets the bamboo field on fire to arrest any soldiers possibly hiding in the mountain. When this mission is to take place in the village, Samwol realizes she is pregnant with Kyu-bok's baby. Samwol's mother finds out and Samwol commits suicide by drinking lye (sodium hydroxide) water. In the chaos of the bamboo field burning down, villagers cry out for its loss because the bamboo field symbolized their own life. In the meantime, Kyu-bok is lost and wanders around the burning mountain crying out in despair until he eventually descends the mountain and ends up dying near a stream. Jum-rye holds Kyu-bok's dead body as she cries in despair in front of the troops and other villagers.",
      "id": "XMyBmK8enLg",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:09.283Z"
}