{
  "imdbId": "youtube-PlPoTeWINSg",
  "title": "영자의 전성시대(1975) 복원본 / Yeong-Ja's Heydays (Yeongja-ui jeonseongsidae) Restoration Version",
  "year": 1975,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PlPoTeWINSg",
      "title": "영자의 전성시대(1975) 복원본 / Yeong-Ja's Heydays (Yeongja-ui jeonseongsidae) Restoration Version",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02874\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02874\n\n영화글 : https://www.kmdb.or.kr/story/10/5315\n\n감독(Director) : 김호선(Kim Ho-Seon)\n출연 : 염복순(영자),송재호(창수),최불암,이순재,도금봉,박주아,윤영,김기종,김승남,김기범,백송,임해림,임성포,임생출,김대연,문일,김호범,조영준,최성종,최민규,신재훈,박예숙,조학자,권일정,이정애,김애라,성명순,김지영,김승미,김영애,김경란,김인성,윤주성,하숙\n\n줄거리 : 베트남전에 참전했다 귀환한 목욕탕 때밀이 창수(송재호)는 경찰서 보호실에서 우연히 영자(염복순)를 만난다. 3년 전, 철공소 노동자였던 창수는 사장 집의 가정부로 일하던 영자를 알게 된다. 순진하고 착한 영자에게 반한 창수는 영자에게 청혼하고 베트남으로 떠난다. 그러나 그 사이에 영자는 망나니 같은 사장 아들의 손에 놀아나다 집에서 쫓겨난다. 건실하게 살고 싶은 영자는 봉제공장에 취직하지만 공장에서 받는 월급으로는 생활이 되지 않고, 아는 언니의 권유로 술집에도 나가보지만 적응하지 못한다. 영자는 이윽고 버스 안내양이 되지만, 교통사고로 팔 한쪽을 잃고 이내 매춘부로 전락한다. 창수는 3년 만에 재회한 영자가 아무런 희망 없이 살아가고 있는 것을 보고, 그녀를 구원하기 위해 온갖 정성을 기울인다. 그러나 영자는 창수의 장래를 위해 그의 곁을 떠난다. 다시 몇 년 후, 영자의 거취를 알게 된 창수는 그녀의 집을 찾아간다. 그곳에서 창수는 장애인인 남편(이순재)과 결혼해 아이까지 낳고 행복하게 살고 있는 영자를 보고 기꺼운 마음으로 떠난다.\n\nCasts : Song Jae-Ho, Yeom Bok-Sun, Choi Bul-Am, Do Keum-Bong\n\nSYNOPSIS : After discharging from the army, Chang-Su ,a massagist at a public bath, happens to meet Young-Ja at the police station. Three years ago, when he was an ironworker, he fell in love with Young-Ja, a housemaid in a rich family. After being raped by her employer's son during Chang-Su' military service period, she works in a sewing factory but she quits the job because of poor pay. Then she works as a barmaid and bus conductless. Young-Ja loses one arm by car accident and tries to kill herself but fails. Then becomes a prostitute. Chang-Su makes her an artificial arm. After several years, Chang-Su sees Young-Ja living a happy married life and wishes her happiness married recalling Young-Ja's heydays,",
      "id": "PlPoTeWINSg",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:09.660Z"
}