{
  "movieId": "youtube-XwgOequ9cM8",
  "title": "유관순 (1959) / Yu Gwan-Sun (Yu Gwansun)",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XwgOequ9cM8",
      "id": "XwgOequ9cM8",
      "title": "유관순 (1959) / Yu Gwan-Sun (Yu Gwansun)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어)https://www.kmdb.or.kr/db/kor/detail/movie/K/00471\n(English)https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00471\n감독: 윤봉춘\n출연: 도금봉 , 고설봉 , 한은진 , 이해룡 , 윤태병\n1919년 3ㆍ1독립운동 당시 16세의 어린 소녀로서 독립만세 대열에서 선봉에 섰다가 일본경찰에게 잡혀 투옥되어 항일 투쟁 끝에 죽기까지 유관순의 순국정신과 짧은 생애를 영화화한 작품. 학생들의 독립운동이 심해지자 일제는 휴교령을 내린다. 집에 내려온 유관순(도금봉)은 전국적으로 일어나는 독립운동에 참여하기 위해 동네 사람들을 비롯, 40여 부락을 돌아다니며 사람들을 설득시킨다. 아내 장터에서의 만세운동은 군중들의 참여로 성공적으로 이뤄지지만, 관순은 주모자로 일경에게 잡힌다. 관순은 지독한 고문을 견뎌내고 재판정에서도 일본인들에게 저항하며 감옥에서도 사람들을 독려하여 만세운동을 계속한다. 결국 관순은 일제에 의해 지하실에서 죽음을 당한다.\n\nDirector: Yun Bong-chun \nCasts : Do Kum-bong , Ko Seol-bong , Han Eun-jin , Lee Hae-ryong , Yun Tae-byeong\n\nSynopsis: This film is about of the life of the young patriotic martyr Yu Gwan-sun, who fought for the liberation of her country during the Independence Movement in 1919. As the Independence Movement becomes more and more intense among Korean students, the Japanese authorities order schools closed temporarily. Yu Gwan-sun (Do Geum-bong) persuades her neighbors to join the national movement, and continues her aggressive struggle against Japanese rule. An independent campaign at Aunae, a market site, is successful with the passionate participation of many people. She is arrested by the Japanese police for leading the campaign and has to endure horrible tortures. But she never gives up her fight, encouraging her cell mates to participate in the movement. She is finally taken to an underground room by the Japanese police and murdered.",
      "addedAt": "2025-12-26T00:23:08.889Z",
      "thumbnail": "https://i.ytimg.com/vi/XwgOequ9cM8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB4URDQn4ktQd5NATUKEaWtM5qIIQ",
      "duration": 6158,
      "language": "ko",
      "year": 1959,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:08.900Z"
}