{
  "imdbId": "youtube-r8X5APKkMW8",
  "title": "Five Days / Paid to Kill (1954, Film-Noir) by Montgomery Tully | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r8X5APKkMW8",
      "id": "r8X5APKkMW8",
      "title": "Five Days / Paid to Kill (1954, Film-Noir) by Montgomery Tully | Colorized Movie",
      "description": "Death Before Debt!?\nA failed business deal forces James Nevill to blackmail his weak-willed friend into murdering him so that his wife can collect his life insurance, but circumstances suddenly change, and not for the better...\n\nOriginal title: Five Days (1954) AKA: Paid to Kill \nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/fhdPo-4gLhs\n\n\nDirector: Montgomery Tully\nWriter: Paul Tabori\nStars: Dane Clark, Cecile Chevreau, Paul Carpenter\nGenres:  Colorized, Crime, Drama, Film-Noir, Mystery, Thriller\n\n\n00:00 Full Movie (with subtitles)\n01:35 A conversation between characters regarding a business deal and a pending decision.\n06:03 A dramatic turn of events unfolds as a business rivalry intensifies, leading to personal sacrifices and hidden agendas.\n12:20 A man is pressured to carry out a deadly task for money, leading to a tense confrontation.\n15:54 A suspenseful conversation unfolds between two characters discussing a plan involving deceit and potential harm.\n20:58 A suspenseful film revolving around a murder case and a web of deceit and betrayal.\n27:10 In a corporate setting, a young chairman's potential mistake is discussed at a party, leading to a meeting with a new associate.\n31:13 A series of events unfold as characters discuss business matters and personal relationships.\n34:47 Betrayal, deception, and urgency unfold in a noir film as characters navigate through dangerous situations.\n42:38 Mystery unfolds as characters search for Paul Kirby, encountering deception and danger.\n48:35 Investigation into a bombing incident leads to intense interrogations and suspicions among the characters.\n53:52 Secret dealings and suspicions arise as characters navigate a complex web of deceit and danger.\n58:48 A twisted plot unfolds as characters navigate through deceit and danger.\n1:05:33 A dramatic confrontation leads to a plea for mercy and a potential tragedy.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:00.182Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/r8X5APKkMW8/maxresdefault.webp",
      "duration": 4232,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:00.284Z"
}