{
  "imdbId": "youtube-tduhauGTKAM",
  "title": "Mein Freund Shadow - Abenteuer auf der Pferdeinsel - Ganzen Film kostenlos bei Moviedome schauen",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tduhauGTKAM",
      "title": "Mein Freund Shadow - Abenteuer auf der Pferdeinsel - Ganzen Film kostenlos bei Moviedome schauen",
      "description": "Jetzt den romantischen Abenteuerfilm “Mein Freund Shadow - Abenteuer auf der Pferdeinsel” in ganzer Länge bei #Moviedome sehen. \n\nMehr #GanzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\n►Wovon handelt der Film \"Mein Freund Shadow - Abenteuer auf der Pferdeinsel\"\nLisa verbringt ihre Ferien mit ihrer Mutter und ihrer Schwester auf der Insel Ameland, wo sie auf Kai und seinen Vater treffen. Die beiden Männer kümmern sich um die Pferde, die dort leben. Lisas Aufmerksamkeit wird von dem wilden Hengst Shadow geweckt. Während sie versucht das Tier zu zähmen, kommt sie Kai näher, der unter einem tragischen Schicksalsschlag leidet.\n\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme: www.moviedome.de\n\nFolge uns auch auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n►Noch mehr tolle Pferdefilme ►http://bit.ly/NochMehrPferdefilme\n\n#Moviedome #Pferde #Abenteuer #PennysShadow #movie #film #drama #MeinFreundShadow #AbenteueraufderPferdeinsel #film\n\nOriginaltitel: Penny's Shadow\nRegisseur: Steven de Jong\nFilmlänge: 99 Minuten\nErstveröffentlichung: 2011\n\n►Die Schauspieler:\nLevi van Kempen in der Rolle des Kai\nLiza Sips in der Rolle der Lisa\nValerie Pos in der Rolle der Tess\nTanja Jess in der Rolle der Daphne\nRick Engelkes in der Rolle des Erik\nBas de Nijs in der Rolle des Dino\nMonic Hendrickx in der Rolle der Moeder van Kai\nJob Bovelander in der Rolle des Yuksal\n\n\n►Die Handlung und Szenen von “Mein Freund Shadow – Abenteuer auf der Pferdeinsel”:\nLisa und Tess verbringen ihre Ferien mit ihrer Mutter auf der Insel Ameland. Dort treffen sie auf Erik und seinen Sohn Kai, die sich um die Pferde, die dort leben, kümmern. Während die Mutter schnell Interesse an dem Vater findet, ist  Lisa viel mehr an den Tieren interessiert. Schnell verguckt sie sich in den majestätischen Hengst Shadow. Sie bemerkt, dass Kai das Pferd unter Verschluss hält und es keinen Menschen an sich heran lässt. Erst lange Zeit später erfährt Lisa, dass Kais Mutter bei einem Reitunfall mit dem Hengst namens Shadow ums Leben kam.\nSie versucht ohne Kais Zustimmung eine Beziehung zu Shadow aufzubauen, um ihn wieder an Menschen zu gewöhnen. Obwohl der wilde Hengst sehr stur ist, ist es Lisas Ziel mit ihm auf der Insel auszureiten.\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. \n\nJetzt Film und Trailer kostenlos auf deutsch schauen\nMein Freund Shadow – Abenteuer auf der Pferdeinsel I Trailer I 2012 I Alle Filminfos",
      "qualityMarks": [
        "video-issues"
      ],
      "id": "tduhauGTKAM",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-10T18:24:36.604Z"
}