{
  "imdbId": "youtube-3ER9-pWmdxQ",
  "title": "Cary Grant | Penny Serenade (Drama, 1941) by George Stevens | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3ER9-pWmdxQ",
      "id": "3ER9-pWmdxQ",
      "title": "Cary Grant | Penny Serenade (Drama, 1941) by George Stevens | Full Movie",
      "description": "Theirs The Love We All Dream of Finding!\nWhile listening to a recording of Penny Serenade, Julie begins reflecting on her past. She recalls her impulsive marriage to newspaper reporter Roger Adams, which begins on a deliriously happy note but turns out to be fraught with tragedy. Other songs remind her of their courtship, their marriage, their desire for a child, and the joys and sorrows they have shared. A flood of memories come back to her as she ponders on their present problems and how they arose.\n\nOriginal title: Penny Serenade (1941)\n\nColorized version: https://youtu.be/tA4mZvL9XEs\n\nThis film is available with English, Italian, & Spanish audio, and subtitled in many more languages.\n\nDirector: George Stevens\nWriters: Morrie Ryskind, Martha Cheavens\nStars: Cary Grant, Irene Dunne, Beulah Bondi \nGenre:  Classics, Drama, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:19 A dramatic scene unfolds as characters discuss their past and future, reflecting on relationships and dreams.\n11:28 Reflections on relationships, career opportunities, and marriage decisions during a New Year's Eve party.\n18:47 A romantic and emotional journey on a cruise ship with moments of farewell and new beginnings.\n26:43 A couple discusses their future plans and financial situation, leading to a decision about a planned trip.\n34:18 A discussion about adoption and aspirations takes place between characters in a small town.\n42:33 A couple discusses adopting a child, facing challenges and uncertainties in the process.\n46:54 A social worker visits a couple's home to assess their suitability for adoption.\n53:30 A couple is surprised with the arrival of a baby girl and considers adopting her, despite initial hesitation.\n1:03:43 Exploration of a custody battle and family dynamics in a 1941 drama film.\n1:26:56 Legal battle over custody of a child, highlighting the emotional attachment of foster parents.\n1:29:38 A heartwarming story unfolds as a man pleads to keep a child in his life, celebrating birthdays and sharing gifts.\n1:37:19 A dramatic scene unfolds as characters navigate through emotions and decisions in a heartfelt conversation.\n1:54:22 Drama unfolds as relationships are tested and decisions are made in a 1941 film by George Stevens.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:24.849Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/3ER9-pWmdxQ/maxresdefault.webp?v=65dedbc8",
      "duration": 7184,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:24.978Z"
}