{
  "imdbId": "youtube-SmFC98W0dIE",
  "title": "Wings of Honour – Luftschlacht über Deutschland (KRIEGSFILM ganzer Film auf Deutsch, Kriegsdrama)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SmFC98W0dIE",
      "title": "Wings of Honour – Luftschlacht über Deutschland (KRIEGSFILM ganzer Film auf Deutsch, Kriegsdrama)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein waghalsiger Bombenangriff, eine Notlandung über Nazi-Deutschland – und ein tödliches Katz-und-Maus-Spiel hinter den feindlichen Linien.\n\nWINGS OF HONOUR - LUFTSCHLACHT ÜBER DEUTSCHLAND (2013)\nOriginaltitel: Angel of the Skies\nMit: Nicholas Van Der Bijl, Andre Frauenstein, Brad Backhouse, Lillie Claire, Nic Rasenti\nRegie: Christopher-Lee dos Santos\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\n1944: Der Luftkrieg über Europa ist in der entscheidenden Phase. Die deutsche Luftwaffe kämpft mit allen Mitteln gegen die alliierten Bombenangriffe.\nFlight Officer Earl Kirk hat in der Luftschlacht um England gute Freunde verloren und ist nun ein erfahrener Pilot in der britischen Royal Air Force. Mit seiner B-24 Bomberstaffel wird auf er eine Mission über Deutschland geschickt: Er und seine Männer sollen Benzinlager in der Nähe von Bremen angreifen, um den Nachschub für deutsche Panzer zu unterbinden.\nDoch die Mission ist ein Himmelfahrtskommando, der Dauerbeschuss durch die deutsche 88er Flak ist gnadenlos, deutsche Jagdflugzeuge greifen den Verband an. Als seine Maschine mehrere Treffer erhält, muss Earl eine harte Entscheidung treffen. Wird er es schaffen, seine Crew zurück nach Hause zu bringen?\n#Netzkino #ganzerFilm #Kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "SmFC98W0dIE",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}