{
  "movieId": "youtube-PYmmn8lTer4",
  "title": "Claude Chabrol’s Blutige Hochzeit - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PYmmn8lTer4",
      "id": "PYmmn8lTer4",
      "title": "Claude Chabrol’s Blutige Hochzeit - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Krimi von Claude Chabrol \" Blutige Hochzeit “ in ganzer Länge bei #Moviedome sehen.\n\nLucienne, die Frau eines Kleinstadtbürgermeisters hat ein leidenschaftliches Verhältnis mit Pierre Maury (Michel Piccoli). Ihr Mann ahnt nichts davon. Er macht den Nebenbuhler, der seine seit langer Zeit schwer depressive Frau durch Gift umgebracht und dabei einen Selbstmord fingiert hat, sogar zum Stadtrat und zu seinem Stellvertreter. Luciennes Tochter Hélène hat ein Gespür für Verschwiegenes. Sie deckt das Verhältnis der Mutter, da sie den Stiefvater nicht mag und will, dass Lucienne glücklich wird. Als Paul ahnt, was hinter seinem Rücken passiert, stellt er Lucienne eine Falle.\n\nStimmungsvolles Bild einer obsessiven, erotischen Affäre zweier Verheirateter - mit dramatischer Konsequenz.\n\nChabrol und die Nouvelle Vague\nClaude Henri Jean Chabrol gilt als einer der Vertreter der Nouvelle Vague und stellt sich damit zu Jean-Luc Godard, Jacques Rivette, Éric Rohmer, Jacques Rozier und François Truffaut. Ende der 1950er Jahre entstand in Frankreich eine neue avantgardistische Szene von jungen Cineasten, die sich dem damals zeitgenössischem französischen Kino abkehrten. Dazu zählen Filme wie Hiroshima, mon amour (Alain Resnais, 1959), Außer Atem (\"À bout de souffle\", Jean-Luc Godard, 1960), Schießen Sie auf den Pianisten (\"Tirez sur le pianiste\", F. Truffaut, 1960), Paris gehört uns (\"Paris nous appartient\", Jacques Rivette, 1961), Letztes Jahr in Marienbad (\"L’année dernière à Marienbad\", Alain Resnais, 1961), Lola, das Mädchen aus dem Hafen (Jacques Demy, 1961), Die Geschichte der Nana S. (\"Vivre sa vie\", J.-L. Godard, 1962), Adieu Philippine (Jacques Rozier, 1962), Jules und Jim (\"Jules et Jim\", F. Truffaut, 1962), Elf Uhr nachts (\"Pierrot le fou\", J.-L. Godard, 1965), Geraubte Küsse (\"Baisers volés, F. Truffaut, 1968), Die untreue Frau (\"La femme infidèle\", Claude Chabrol, 1969) oder Tisch und Bett (\"Domicile conjugal\", F. Truffaut, 1970). Bedeutende Schauspieler waren Maurice Ronet, Jeanne Moreau, Lino Ventura, Stéphane Audran, Jean-, Anne Wiazemsky, Paul Belmondo, Anna Karina oder Michel Piccoli. Die Anfänger der Bewegung liegen in den ehemaligen Chefautoren der französischen Filmzeitschrift Cahiers du cinéma André Bazin und Jacques Doniol-Valcroze, worin 1954 auch François Truffaut (Les Quatre Cents Coups 1959, Jules et Jim 1962, La nuit américaine 1973) seinen berühmten Artikel “Une certaine tendance du cinéma français“ verfasste. Claude Chabrol hat sich in seinen Filmen immer wieder sozialkritisch mit der französischen Bourgeoisie befasst. Gerne hat er auch auf Vorlagen bekannter Autoren zurückgegriffen, wie zum Beispiel von Henry James, Cornell Woolrich, Flaubert, Henry Miller oder Patricia Highsmith. Zu Chabrols bekanntesten Filmen zählen: Die Enttäuschten (1958), Biester (1995), Eine Frauensache (1988), Das Leben ist ein Spiel (1997). Der Einfluss der Nouvelle Vague ist auch heute noch zu Spüren. Quentin Tarantino oder Martin Scorsese haben viele Ideen der französischen Avantgardisten in ihren eigenen Film zitiert.\n\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\nJetzt “ Blutige Hochzeit ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama\n \nOriginaltitel: Les noces rouges\nFilmlänge: 92 Minuten \nRegie: Claude Chabrol\nFSK: 16\nDVD-Start (DE): \n\nDie Darsteller\nSréphane Audran in der Rolle der Lucienne Delamare\nMichel Piccoli in der Rolle des Pierre Maury\nClaude Piéplu in der Rolle des Paul Delamare\nClotilde Joano in der Rolle der Clotilde Maury\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nDen Krimi von Claude Chabrol \" Blutige Hochzeit “ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:04.576Z",
      "thumbnail": "https://i.ytimg.com/vi/PYmmn8lTer4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDTjpwqGvrh_BFWWX42owodiT4elQ",
      "duration": 5521,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:04.712Z"
}