{
  "movieId": "youtube-uootfUV7t1E",
  "title": "Stranger on Horseback (1955 Western) Directed by Jacques Tourneur",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uootfUV7t1E",
      "id": "uootfUV7t1E",
      "title": "Stranger on Horseback (1955 Western) Directed by Jacques Tourneur",
      "description": "Thunder in the saddle ... greased lightning with his guns ... there never rode a man to match him !\nA determined circuit judge rides into a corrupt frontier town dominated by the powerful Bannerman family, who manipulate the law to maintain their control. Despite resistance and challenges to his authority, the judge pursues a trial to restore order and hold the guilty accountable.\n\n\nDirector: Jacques Tourneur\nWriters: Herb Meadow, Don Martin, Louis L'Amour\nGenres: Drama, Western\n\nMain Cast:\nJoel McCrea - Judge Richard 'Rick' Thorne \nMiroslava - Amy Lee Bannerman \nKevin McCarthy - Tom Bannerman\nJohn Carradine - Col. Buck Streeter\nNancy Gates - Caroline Webb\nEmile Meyer - Sheriff Nat Bell\nRobert Cornthwaite - Arnold Hammer\n\n\n00:00 - Full movie with subtitles \n02:09 - Judge Richard Thorne arrives in town, determined to uphold the law in a territory dominated by the Bannerman family.\n05:21 - Thorne confronts the Bannermans after learning about Tom Bannerman’s involvement in a fatal shooting.\n15:03 - Thorne arrests Tom Bannerman for murder, defying the Bannerman family’s influence and authority.\n25:14 - Thorne meets with the Bannerman family, who attempt to intimidate him into releasing Tom.\n35:10 - Thorne and his allies secretly prepare to transport Tom and key witnesses to Cottonwood for a fair trial.\n45:39 - A tense confrontation unfolds as the Bannermans pursue Thorne and his group through the wilderness.\n55:16 - Thorne and his companions face off against the Bannermans in a dramatic showdown on the trail to Cottonwood.\n1:00:13 - The final confrontation between Thorne and the Bannermans culminates in a decisive moment of justice and reckoning.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:32:15.505Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/uootfUV7t1E/maxresdefault.webp?v=6780e35b",
      "duration": 3951,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:32:15.654Z"
}