{
  "imdbId": "youtube-dwMuEUuJ3ns",
  "title": "Train Drivers Diary (Full Movie) Dark Comedy, Drama",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dwMuEUuJ3ns",
      "title": "Train Drivers Diary (Full Movie) Dark Comedy, Drama",
      "description": "(English subtitles) Statistics show that during their career every railroad engineer working unintentionally kills 15 to 20 people. This is a story about the innocent mass murderers and their lives.  Ilija is a 60-year-old train driver, close to retiring. His 19 years old adopted son Sima is preparing to take over the family trade and his father's job. Trying to help him, his father finds suicidal people, negotiates with them, offering them to swap jumping off a bridge or skyscraper with falling under the wheels of a train. \nWinner FEST International Film Festival, Films Infest, Jaipur International Film Festival\n\nDirected by:  Milos Radovic\n2016\nStarring Lazar Ristovski, Petar Korac, Mirjana Karanovic\nEdited for YouTube ad standards\n\nWatch more free movies at Popcornflix.com, or on the Popcornflix app available on mobile devices, Roku, Xbox, Sony, PlayStation and many more! \n\nWatch more free movies and TV series at Popcornflix.com, or on the Popcornflix app available on mobile devices, Roku, Xbox, Sony, Amazon Fire, PlayStation and many more! \n\n#Popcornflix, Full length free movies and TV series.\nLike us on Facebook: https://www.facebook.com/Popcornflix\nFollow us on Twitter: https://twitter.com/Popcornflixnews\nPopcornflix is owned/operated by Screen Media Ventures",
      "id": "dwMuEUuJ3ns",
      "channelName": "Popcornflix",
      "channelId": "UCVFYikepF-avelvuIaQ_lHA",
      "regionRestriction": {
        "allowed": [
          "AS",
          "CA",
          "GU",
          "MP",
          "PR",
          "US",
          "VI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T21:48:30.961Z"
}