{
  "imdbId": "youtube-a7KH7vG3ca8",
  "title": "It Stalked the Ocean Floor (1954) Up from the forbidden depths comes a Tidal Wave Of Terror!",
  "year": 1954,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a7KH7vG3ca8",
      "title": "It Stalked the Ocean Floor (1954) Up from the forbidden depths comes a Tidal Wave Of Terror!",
      "description": "Monster from the Ocean Floor is an American 1954 science fiction film about a sea monster that terrorizes a Mexican cove. The film was directed by Wyott Ordung and produced by Roger Corman.\n\nBlack & White version:  https://youtu.be/eZwcLIDchGI\n\nSynopsis:\nJulie, an American on vacation in Mexico, spots a giant, one-eyed monster rising from the ocean, but when she tries to tell the authorities, no one believes her. She finally teams up with Steve, a marine biologist in an attempt to destroy it.\n\nMain Cast:\nAnne Kimbell - Julie Blair\nStuart Wade - Steve Dunning\nDick Pinner - Dr. Baldwin\nWyott Ordung - Pablo\nInez Palange - Tula\nJonathan Haze - Joe\nDavid Garcia - Jose\nRoger Corman - Tommy\n\n\n00:00 - Full movie with subtitles\n00:48 - Julie learns about the mysterious legends surrounding the bay from the locals.\n05:45 - Steve introduces himself as a marine biologist and invites Julie to explore his submarine.\n10:53 - A diver mysteriously vanishes, leaving only his suit behind, sparking fear of a sea monster.\n21:22 - Julie encounters a giant octopus, fueling her belief in the bay's monstrous secrets.\n31:12 - Julie connects the monster's origins to post-war nuclear testing in 1946.\n50:35 - Steve and Dr. Baldwin analyze a strange tissue sample, suspecting a giant amoeba.\n59:53 - Julie risks her life to confront the monster, leading to a tense underwater rescue.\n1:03:20 - Steve apologizes to Julie, acknowledging her bravery and the truth about the monster.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "a7KH7vG3ca8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:33:18.085Z"
}