{
  "imdbId": "youtube-rw6_bk8fdwA",
  "title": "Desert Nights (MGM, 1929) JOHN GILBERT🍕 MARY NOLAN",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rw6_bk8fdwA",
      "id": "rw6_bk8fdwA",
      "title": "Desert Nights (MGM, 1929) JOHN GILBERT🍕 MARY NOLAN",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: John Gilbert, Mary Nolan, Ernest Torrence\nDirector: William Nigh\n🍕PRESENTED WITH THE ORIGINAL VITAPHONE SCORE🍕\n Set against the unforgiving Kalahari, this pre-Code classic blends action, romance, and suspense as a diamond company manager is abducted by posing aristocrats turned thieves, played by Mary Nolan and Ernest Torrence. Stranded in the wilderness, the trio battles the elements, deception, and their own desires.\n\nThis overlooked gem from the final days of the silent era marks John Gilbert’s poignant farewell to the era before the arrival of sound reshaped Hollywood. Mary Nolan, in a career-defining role, simmers with intensity as the femme fatale caught between survival and seduction. Shot on location and packed with authentic desert visuals, Desert Nights showcases early MGM’s technical ambition and flair for gritty adventure storytelling.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🎭 Subscribe for more Oscar-winning films, vintage musicals, and Pre-Code Hollywood \n\nA must-watch for fans of silent film history, classic Hollywood stars, and the transitional era of 1920s cinema, this film captures the last flickers of silent screen grandeur before the talkies revolution began.\n\nDiscover the film that closed an era—with stunning performances, harsh landscapes, and a haunting glimpse at fame on the brink.\n\n#gems#SilentFilm #JohnGilbert #MaryNolan #ClassicHollywood #MGM #1920sCinema #PreCodeHollywood #FilmHistory #LostClassics",
      "addedAt": "2025-12-24T01:03:59.210Z",
      "thumbnail": "https://i.ytimg.com/vi/rw6_bk8fdwA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBRmeCF76Wwo_hbR-U84GJ_UAZFHw",
      "duration": 3763,
      "language": "en",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:59.210Z"
}