{
  "imdbId": "youtube-h5hdtwn-yLg",
  "title": "Experience the origins of psychological manipulation : Gaslight (1940) Colorized Version",
  "year": 1940,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h5hdtwn-yLg",
      "title": "Experience the origins of psychological manipulation : Gaslight (1940) Colorized Version",
      "description": "A melodrama of a strange love!\nBeautiful and trusting, Paula Anton is slowly tormented by mysterious happenings in her luxurious Victorian home. The suspect is her devoted husband.\n\nOriginal title: Gaslight (1940) AKA: A Strange Case of Murder\n\nBlack & White version: https://youtu.be/JBhhK_PPI6Y\n\n\nDirector: Thorold Dickinson\nWriters: Patrick Hamilton, A.R. Rawlinson, Bridget Boland\nStars: Anton Walbrook, Diana Wynyard, Frank Pettingell\nGenres: Colorized, Psychological Thriller, Mystery, Literary\n\n\n00:00 - Full colorized movie (with subtitles)\n01:11 - Eerie events unfold in a mysterious household filled with secrets and manipulation.\n14:08 - A woman suffers psychological manipulation and gaslighting, leading to distress and confusion.\n25:28 - A mysterious encounter inspires an act of kindness towards children on the street.\n27:46 - In a vintage setting, manipulation, mistrust, and hidden motives come to light.\n34:17 - Accusations and suspicions arise during a social event, revealing psychological manipulation.\n44:01 - A sinister psychological manipulation scheme is uncovered through strange occurrences in a house.\n53:56 - A woman grapples with manipulation by her husband, causing confusion and distrust.\n59:17 - Gaslighting by her husband leads to a woman's deteriorating mental state and desperation.\n1:05:28 - A plot of psychological manipulation and identity deception unravels in a vintage film.\n1:09:56 - Deception escalates as a man denies his true identity while gaslighting a woman.\n1:19:43 - Betrayal and madness culminate as a woman confronts her husband over stolen rubies.\n\n\nFun Facts: The play opened in New York with the title changed to \"Angel Street\" on 5 December 1941, starring Vincent Price (his first role as a villain) and Judith Evelyn. Leo G. Carroll. It became the longest-running melodrama in Broadway history, playing for 1,293 performances.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "h5hdtwn-yLg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "JP"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:35:07.992Z"
}