{
  "imdbId": "youtube-mT2jDwR-M3k",
  "title": "John Agar | Night Fright (1967) Horror, Sci-Fi | with Carol Gilley, Dorothy Davis (full movie)",
  "year": 1967,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mT2jDwR-M3k",
      "title": "John Agar | Night Fright (1967) Horror, Sci-Fi | with Carol Gilley, Dorothy Davis (full movie)",
      "description": "Mutants in the Moonlight: Night Fright Strikes\nWhen a government space experiment exploring the effects of cosmic rays on animal life goes awry, the residents of Satan's Hollow find themselves terrorized by a mutant monster.\n\nOriginal title: Night Fright (1967)  AKA:  E.T.N.: The Extraterrestrial Nasty\n\nDirector: James A. Sullivan\nWriters: Russ Marker\nStars: John Agar, Carol Gilley, Dorothy Davis, Ralph Baker Jr. \nGenres: Cult Film, Horror, Sci-Fi\n\nMany subtitles available for this movie\n\n00:00 Full Movie\n00:42 A couple visits a spooky location and hears a news bulletin about a mysterious crash in the area.\n06:12 Two friends discuss philosophical thoughts and share funny stories before encountering a crashed rocket.\n21:22 A murder case involving a girl who was chewed up and a boy who is barely alive is being investigated by Clint and Wes.\n25:14 A sheriff confronts a group who are investigating a UFO sighting & tells them to leave town.\n30:14 A reporter talks to the Sheriff about a story while a group of teenagers plan a secret outing.\n33:53 A mysterious puzzle involving a crime lab and a dangerous location unfolds as the characters try to solve the mystery.\n43:28 A group of people get trapped and attacked by a mysterious creature in Satan's Hollow.\n1:02:06 A government space program project called Operation Noah's Ark resulted in a rocket containing mutated animals crashing near a town.\n1:04:03 A group of people gather supplies for a mysterious mission involving duck hunting and decoys.\n\n\n@CultCinemaClassics",
      "id": "mT2jDwR-M3k",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:03.701Z"
}