{
  "imdbId": "youtube-gePRB24JIQ8",
  "title": "Viva Elvis (2023 Biography) directed by Gerardo Rissotti",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gePRB24JIQ8",
      "title": "Viva Elvis (2023 Biography) directed by Gerardo Rissotti",
      "description": "Throughout modern history, there have been many singers with a myriad of different talents. But only one individual had it all. The looks, the charm, the magnetism, and a disruptive style of his own. Although many imitators exist, only one transcends time and culture to live forever. From his birth in Tupelo Mississippi through his meteoric rise, join us as we highlight some of the milestones that formed Elvis into one of the greatest entertainers of all times.  Through this documentary, relive Elvis’ controversial rise to stardom, his military service, acting career and his reclaim to fame before his unexpected and tragic death in Graceland.  Learn more about the pivotal relationships he developed with Colonel Tom Parker, Priscilla Ann, Ann Margaret, among others.  Viva Elvis!\n\nDirector: Gerardo Rissotti\nWriters: Carla Durarte, Miguel Somoza\nNarrator: Vanessa Elise\nGenres: Music, Biography, Documentary\n\nThis documentary is available with English & Spanish audio, and subtitles in many languages.\n\n00:00 Full Documentary (with subtitles).\n04:37 The life and impact of Elvis Presley, a legendary rock and roll icon from Tupelo, Mississippi.\n07:34 Elvis Presley's rise to fame through music and acting, managed by Colonel Tom Parker.\n13:16 Elvis Presley's rise to fame through television appearances, music releases, and iconic performances.\n18:51 Elvis Presley's early career milestones and personal life events in the 1950s.\n24:15 Elvis Presley's successful music and film career, personal life, and impact on popular culture.\n29:45 Elvis's Return to the Stage: A Legendary Comeback Performance\n35:13 Elvis Presley's career resurgence in the late 1960s through music performances and film projects.\n39:34 Elvis Presley's career highlights from 1971 to his iconic performance in Hawaii in 1973.\n44:44 The life and legacy of Elvis Presley, the King of Rock and Roll, is remembered through his final performances and impact on music history.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "gePRB24JIQ8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:05.376Z"
}