{
  "imdbId": "youtube-BrJC_7Rlh8g",
  "title": "Inspector Hornleigh Goes To It (1941) [Crime] [Drama]",
  "year": 1941,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BrJC_7Rlh8g",
      "id": "BrJC_7Rlh8g",
      "title": "Inspector Hornleigh Goes To It (1941) [Crime] [Drama]",
      "description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | Inspector Hornleigh Goes To It\" is a British detective film directed by Walter Forde and starring Gordon Harker, Alastair Sim, Phyllis Calvert and Edward Chapman. It was the third and final film adaptation of the Inspector Hornleigh stories.\n\nIt was released in America by 20th-Century Fox under the title \"Mail Train\".\n\n---\n\nDirected by Walter Forde, produced by Edward Black , written by  Val Guest, Frank Launder, J.O.C. Orton and Hans Wolfgang Priwin (radio series), starring Gordon Harker as Inspector Hornleigh, Alastair Sim as Sergeant Bingham, Phyllis Calvert as Mrs. Wilkinson, Edward Chapman as Mr. Blenkinsop, Charles Oliver as Dr. Wilkinson, Raymond Huntley as Dr. Kerbishley, Percy Walsh as Inspector Blow, David Horne as Commissioner, Peter Gawthorne as Colonel, Wally Patch as Sergeant Major, Betty Jardine as Daisy, O. B. Clarence as Professor Mackenzie, John Salew as Mr. Tomboy, Cyril Cusack as Postal Sorter, Bill Shine as Hotel Porter, Sylvia Cecil, Edward Underdown, Marie Makine and Richard Cooper.\n\n---\n\nSource: \"Inspector Hornleigh Goes To It\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 14 September 2017. Web. 30 Dezember 2017. https://en.wikipedia.org/wiki/Inspector_Hornleigh_Goes_To_It. If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:40:55.643Z",
      "thumbnail": "https://i.ytimg.com/vi/BrJC_7Rlh8g/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDjSwyGg2DRTXWCWzW3xjRjtz0gsg",
      "duration": 5008,
      "language": "en",
      "year": 1941,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T22:40:55.643Z"
}