{
  "imdbId": "youtube-AkfIVIoWUBo",
  "title": "The Comeuppance / L'ardoise (1970, Drama) Salvatore Adamo, Michel Constantin | French Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AkfIVIoWUBo",
      "id": "AkfIVIoWUBo",
      "title": "The Comeuppance / L'ardoise (1970, Drama) Salvatore Adamo, Michel Constantin | French Movie",
      "description": "Philippe, a student, is imprisoned for assaulting his father's manipulative business partner, who ultimately led to his father's death. In jail, Philippe befriends his cellmates, Théo Giuliani and Bob Daniels. Driven by a desire for retribution and to avenge his father, Philippe forms a pact with his cellmates to break into the partner's office, retrieve incriminating evidence, and divide the spoils. However, their plan faces complications when the police become involved.\n\nOriginal title: L'ardoise (1970) AKA: The Comeuppance\n\nThis film has French audio, and subtitled in many languages.\n\nDirector: Claude Bernard-Aubert\nWriters: Claude Bernard-Aubert, Jean-Marie Durand, Pascal Jardin\nStars: Salvatore Adamo, Michel Constantin, Elisabeth Wiener\nGenres: French cinema, Crime, Drama\n\n\n00:00 Full Movie (with subtitles)\n00:49 A drama unfolds as a group navigates through betrayal, loss, and revenge in a French movie.\n11:40 A dramatic sequence unfolds at a farm with discussions on work, relationships, and societal issues.\n19:38 Mysterious events unfold as characters navigate through complex relationships and legal implications.\n26:59 A dramatic encounter unfolds between individuals with hidden motives and past grievances.\n33:50 Reunion after 7 years sparks memories and discussions about past events and debts.\n54:35 A dramatic turn of events unfolds as a man orchestrates a robbery and sets a trap for his accomplice, leading to a fiery confrontation.\n1:01:28 Summary of a French drama film involving a criminal scheme and its consequences.\n1:07:36 Investigation into a mysterious death reveals a tangled web of lies and deceit in a French movie.\n1:16:28 Revelations about a crime lead to accusations and confrontations among individuals involved.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:27.890Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/AkfIVIoWUBo/maxresdefault.webp?v=661cd260",
      "duration": 4920,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:28.075Z"
}