{
  "movieId": "youtube--uqPx2SirIY",
  "title": "Jerry Warren | The Violent and the Damned (Crime, 1962) Full Movie | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-uqPx2SirIY",
      "id": "-uqPx2SirIY",
      "title": "Jerry Warren | The Violent and the Damned (Crime, 1962) Full Movie | Colorized",
      "description": "When chain gang prisoners attack their guards, some of the hardened criminals escape Brazil’s infamous Anchieta Prison amidst all the pick-ax carnage. The government dispatches a machine-gun squad to round up the fugitives, who have fled by foot and boat and now have begun to turn on each other.\n\nOriginal title: Med mord i bagaget & Edited from Mãos Sangrentas (1955)\n\nBlack & White version: https://youtu.be/0gb9DJJNO6Q\n\n\nDirectors: Carlos Hugo Christensen, Jerry Warren\nWriters: Carlos Hugo Christensen, Pedro Juan Vignalle\nStars: Arturo de Córdova, Carlos Cotrim, Sadi Cabral\nGenres: Colorized classics, Crime, Drama\n\nThis film is subtitled in many language options.\n\n00:00 Full Movie\n01:13 Criminal activities and challenges faced in Panama by a group of individuals, including resistance from military forces.\n04:57 Psychologist called to address rising violence in prison. Concerns about lack of change despite multiple visits and new situations.\n7:38 Intense conversation between a doctor and a visitor about the treatment of prisoners and a recent violent incident.\n10:03 Understanding the psychological impact of the environment on individuals in a notorious island prison.\n12:36 Prison break, detailed plan, weapons stash, 7 years of waiting.\n21:24 Tensions rise as characters discuss money and escape plans, followed by a dramatic encounter in a cafe.\n34:44 Intense drama unfolds as characters navigate through a dangerous situation.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:39:14.994Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/-uqPx2SirIY/maxresdefault.webp?v=65a8381c",
      "duration": 3437,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:15.135Z"
}