{
  "movieId": "youtube-bxkCc9lOC7I",
  "title": "Lady Behave! 1937 (Romantic Comedy) American film directed by Lloyd Corrigan",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bxkCc9lOC7I",
      "id": "bxkCc9lOC7I",
      "title": "Lady Behave! 1937 (Romantic Comedy) American film directed by Lloyd Corrigan",
      "description": "Things go hay-wire when Fate throws them together in a rollicking riot of dizzy romance!\nClarice Kendall Andrews returns home from Mardi Gras with an unexpected announcement—she's married. However, her previous marital entanglements come to light, setting off a chain of comedic events as she tries to sort out her love life while keeping her family oblivious to her romantic mishaps.\n\nColorized version: https://youtu.be/If9aWPnBDYY\n\n\nOriginal title: Lady Behave! (1937)\nThis film is subtitled in many languages.\n\nDirector: Lloyd Corrigan\nWriters: Joseph Krumgold, Olive Cooper\nStars: Sally Eilers, Neil Hamilton, Joseph Schildkraut \nGenres: Classics, Comedy, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:28 A chaotic situation unfolds as a young woman unknowingly marries a millionaire and seeks a divorce.\n07:01 A comedic tale of mistaken identity and marital schemes involving a woman named Clarice.\n12:11 A man is hired to help a family get rid of a woman by pretending to be interested in her, in exchange for money.\n17:36 Mischievous siblings try to raise money for their sick sister by involving a wealthy woman in their scheme.\n24:41 A chaotic situation unfolds as a woman faints, leading to confusion and a search for a missing person.\n29:59 A romantic comedy unfolds with a woman caught in a mistaken identity situation, leading to a proposal and a potential threat of abduction.\n37:26 A situation unfolds as family members try to prevent a woman from running away with a man named Andrews.\n46:45 A romantic comedy film involving a love triangle and misunderstandings among characters.\n48:48 Family drama unfolds as a man's marriage is complicated by his sister-in-law, leading to a potential divorce and legal issues.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:04.193Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/bxkCc9lOC7I/maxresdefault.webp?v=667bbe4f",
      "duration": 3186,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:04.352Z"
}