{
  "imdbId": "youtube-XSIc3hYP9MU",
  "title": "Reclaim - At your own risk (ACTION THRILLER full movie German, action movies German completely new)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XSIc3hYP9MU",
      "title": "Reclaim - At your own risk (ACTION THRILLER full movie German, action movies German completely new)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Spannender Actionthriller mit RYAN PHILLIPPE (\"Eiskalte Engel\" & \"L.A. Crash\") & JOHN CUSACK (\"Zimmer 1408\" & \"2012\"): Ein Paar reist nach Puerto Rico, um ein kleines Mädchen zu adoptieren. Als dieses dann jedoch verschwindet, beginnt für alle Beteiligten ein Kampf ums nackte Überleben...\n\nRECLAIM – AUF EIGENES RISIKO (2014)\nOriginaltitel: Reclaim\nMit: John Cusack, Ryan Phillippe, Rachelle Lefevre, Jacki Weaver\nRegie: Alan White\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDas junge Paar Steven und Shannon beschließt, das haitianische Waisen-Mädchen Nina zu adoptieren und reist dafür nach Puerto Rico, um die letzten Details zu klären. Alles scheint perfekt und die frischgebackenen Eltern warten nur noch auf die Ausreisedokumente ihrer neuen Tochter. Doch dann verschwindet Nina spurlos und auch das Adoptionsbüro existiert nicht mehr. Allmählich begreifen die beiden, dass auch der Fremde Benjamin, der dem Paar scheinbar zufällig am Strand begegnet ist, seine Finger mit im Spiel hat. Schnell entwickelt sich die Suche für alle Beteiligte zu einem Kampf ums nackte Überleben …\n#ganzerFilm #JohnCusack #RyanPhillippe\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "XSIc3hYP9MU",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}