{
  "imdbId": "youtube-TtW-At6_4yE",
  "title": "Teenage Gang Debs (Crime, 1966) Diane Conti, Linda Gale, Eileen Dietz | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TtW-At6_4yE",
      "title": "Teenage Gang Debs (Crime, 1966) Diane Conti, Linda Gale, Eileen Dietz | Colorized Movie",
      "description": "The Go-Go Girls Who Go Too Far!\nTerry moves into a neighborhood that is the turf of the Rebels, a female teenage gang. She quickly rises to the top of the gang, and sets her sights on the leader of the local neighborhood tough guys.\n\nOriginal title: Teenage Gang Debs (1966) AKA: Leather Jacket Jungle\nThis film has subtitles in many languages.\n\nOriginal Black & White version: https://youtu.be/fwttitYSH08\n\n\nDirector: Sande N. Johnsen\nWriters: Hy Cahl, William Shakespeare (uncredited Macbeth reference)\nStars: Diane Conti, Linda Gale, Eileen Dietz, Sandra Kane\nGenres:  Colorized classics, Crime, Literary\n\n\n00:00 Full Movie (with subtitles) \n08:00 Drama unfolds as new arrival Terry navigates the dynamics of a teenage gang led by Nino.\n10:59 Teenage gang members discuss moving to a new territory, conflicts within the group, and a secret meeting in a forbidden room.\n22:06 Intense conversation between characters regarding loyalty, marking, and power dynamics.\n28:06 Teenage gang leader Nino asserts dominance over the group, leading to a violent confrontation with Johnny.\n35:53 Violent gang conflicts in Brooklyn lead to a deadly stabbing, sparking revenge plans and escalating tensions.\n50:54 A group discusses plans for a future attack and the consequences of recent events.\n55:31 Summary of a colorized crime movie involving teenage gang members facing challenges and forming partnerships.\n1:00:51 Tension rises as members consider leaving the gang, leading to a confrontation with Nino.\n1:04:30 Teenage gang members confront each other at a club, leading to a potential violent confrontation.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "TtW-At6_4yE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:50.406Z"
}