{
  "imdbId": "youtube--KVlufKEuWg",
  "title": "Western | Young Bill Hickok 1940 | with Roy Rogers, Gabby Hayes, Julie Bishop | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-KVlufKEuWg",
      "id": "-KVlufKEuWg",
      "title": "Western | Young Bill Hickok 1940 | with Roy Rogers, Gabby Hayes, Julie Bishop | Colorized",
      "description": "Hickok, is a young man working as a freight-line agent. When a valuable gold shipment becomes the target of ruthless villains seeking to steal both gold and land, Hickok must spring into action to protect it. Along the way, he forms an unlikely alliance with Calamity Jane and her horse-trader uncle, who assist him in his quest. As Hickok battles the outlaws, he also finds himself drawn to Louise, the woman he loves. \n\n\nBlack & White version: https://youtu.be/SMrLsdt3P5Q\n\n\nOriginal title: Young Bill Hickok (1940)\nThis film is available with subtitles in many language options.\n\nDirector: Joseph Kane\nWriters: Norton S. Parker, Olive Cooper \nStars: Roy Rogers, George 'Gabby' Hayes, Julie Bishop \nGenres: Colorized, Western, Musical, Drama\n\n\n00:00 Full colorized movie (with subtitles)\n02:09 Action-packed Western film involving a group planning to disrupt communication lines for personal gain.\n07:57 A tale of bravery and reward unfolds as Wild Bill Hickok saves the day and receives recognition and a large sum of money.\n11:12 A story of love, betrayal, and a dangerous mission involving a gold shipment in the Wild West.\n16:49 Romantic complications and a risky gold shipment jeopardize a wedding in the Old West.\n21:17 Adventure unfolds as characters chase after stolen gold in the Wild West.\n27:47 Suspicion falls on Bill Hickok for a gold robbery orchestrated by Nicolas Tower, leading to a pursuit and confrontation.\n36:54 Trouble brews as Bill Hickok investigates the Overland Raiders with his companions and faces unexpected challenges.\n42:14 A group suspects Tower of leading the Overland Raiders and stealing gold after the Civil War.\n46:01 Bill Hickok helps in capturing the Overland Raiders and elopes with his partner to avoid being caught.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYDDUshEcMs1CHZW1booguo",
      "addedAt": "2025-12-27T00:36:01.318Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/-KVlufKEuWg/maxresdefault.webp",
      "duration": 3204,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:01.448Z"
}