{
  "imdbId": "youtube-D8DqNsX_t1c",
  "title": "The Hooligan Wars: Einer gegen die Ultras (GANGSTER THRILLER | Unzensiert exklusiv für Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=D8DqNsX_t1c",
      "title": "The Hooligan Wars: Einer gegen die Ultras (GANGSTER THRILLER | Unzensiert exklusiv für Members)",
      "description": "📺 Packender Film zwischen Gangster-Thriller und Sozialdrama, der einen erschütternden Einblick in die britische Unterwelt gibt...\n\nTHE HOOLIGAN WARS: EINER GEGEN DIE ULTRAS (2012)\nOriginaltitel: The Ice Cream Wars\nMit: Nick Nevern, Glen Murphy, Peter Barrett, Mark Harris, Simon Phillips\nRegie: Paul Tanter\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nAls sich Profifußballer Andy Hollington (Nick Nevern) während einer Kneipenschlägerei schwer am Bein verletzt, schmeißt ihn sein Verein kurzerhand aus dem Team. Seiner Existenzgrundlage beraubt, muss sich der Kicker etwas anderes einfallen lassen – zumal er in Kürze Vater wird und auf jeden Penny angewiesen ist. Von seinen Ersparnissen kauft er schließlich einen Eiswagen und hofft so auf neues Einkommen. Doch die Konkurrenz schläft nicht und beginnt Andy unter Druck zu setzen. Als er sich eines Tages dagegen wehrt, geht sein Eiswagen in Flammen auf.\nVerzweifelt wendet sich Andy an den dubiosen Geschäftemacher Nick Brooks (Peter Barrett). Dieser leiht ihm das Geld für einen neuen Wagen und bietet ihm zusätzlich Schutz an. Doch all das passiert natürlich nicht ohne Hintergedanken. Der Preis: Andy soll neben Eis auch Drogen verkaufen. Dafür steht ihm eine Gruppe von Fußball-Hooligans zur Seite, die auch vor brutalster Gewalt nicht zurückschrecken. Eines Tages aber findet Andy sich im Visier der Polizei wieder. Verzweifelt sucht er nach einem Ausweg aus dem Teufelskreis von Versteckspiel, Lügen und Gewalt. Aber es kommt, wie es kommen muss – zur Katastrophe. Und Andy muss sich endgültig entscheiden welchen Weg er weiter geht.\n#Netzkino #ganzerFilm #Thriller\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "id": "D8DqNsX_t1c",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:01:08.007Z"
}