{
  "imdbId": "youtube-K63b_d6r8nc",
  "title": "Mörderland – La Isla Mìnima (SPANNENDER THRILLER auf Deutsch, Krimi Thriller in voller Länge)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=K63b_d6r8nc",
      "title": "Mörderland – La Isla Mìnima (SPANNENDER THRILLER auf Deutsch, Krimi Thriller in voller Länge)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Aufregender Polizei-Thriller: Im Sommer 1980 verschwinden zwei Schwestern im abgelegenen Sumpfland Südspaniens. Zwei ungleiche Ermittler stoßen bei ihrer Suche auf ein Netz aus Schweigen, Gewalt und Angst – und auf einen Serienkiller, der seit Jahren im Marschland wütet.\n\nMÖRDERLAND (2014)\nOriginaltitel:  La isla mínima\nMit: Javier Gutiérrez und Raúl Arévalo\nRegie: Alberto Rodríguez\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie abgelegenen Winkel des Sumpflandes von Guadalquivir im Süden Spaniens gehorchen ihren eigenen Regeln: Abgeschnitten von der Zivilisation und vergessen von der Welt herrscht hier die eiserne Hand alter Traditionen. Als im Sommer 1980 zwei Schwestern spurlos verschwinden, beginnen zwei Ermittler in der verschworenen und verschwiegenen Gemeinschaft des verwinkelten Marschlandes nach den beiden vermissten Mädchen zu fahnden. Doch je tiefer sie sich in die Sümpfe vorwagen, umso deutlicher wird, dass beide Polizisten einen gefährlichen Serienkiller jagen, der den Landstrich seit Jahren mit Angst überzieht...\n#Netzkino #ganzerFilm #Thriller\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "K63b_d6r8nc",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.125Z"
}