{
  "imdbId": "youtube-g-QDDlA30yQ",
  "title": "Alien Terror | Night of the Blood Beast (1958, Sci-Fi) by Roger Corman | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g-QDDlA30yQ",
      "title": "Alien Terror | Night of the Blood Beast (1958, Sci-Fi) by Roger Corman | Colorized Movie",
      "description": "No girl was safe as long as this head-hunting thing roamed the land!\nDuring re-entry into Earth's atmosphere, an astronaut named Steve is killed, but his body is seeded with rapidly gestating extraterrestrial organisms. As the embryos begin to hatch, a full-grown alien being emerges. It then stalks and terrorizes the research team, absorbing knowledge from one of the scientists and communicating via his voice.\n\nOriginal title: Night of the Blood Beast (1958) AKA: Monster from Galaxy 27\nThis film is subtitles in many languages.\n\nBlack & White version: https://youtu.be/6X0SIqNPjPE\n\n\nDirector: Bernard L. Kowalski\nWriters: Gene Corman, Martin Varno \nProducer: Roger Corman\nStars: Michael Emmet, Angela Greene, John Baer, Ed Nelson \nGenres: Colorized classics, Cult Film, Horror, Sci-Fi, B-movie\nBudget: $68,000\n\n\n00:00 Full Movie (with subtitles)\n00:07 A space mission goes awry, leading to a fatal crash and a mysterious lack of body rigidity.\n10:55  A team at a remote lab experiences communication and power issues, along with a mysterious creature attack.\n17:59 Strange events unfold at a remote location, involving a mysterious blood sample and a magnetic field.\n23:42 A space mission goes wrong, leading to mysterious events and a shocking discovery.\n31:48 Close encounters with an alien creature that has taken over a man's body, leading to a debate on whether to destroy it or give it a chance to justify itself.\n43:25 A group encounters a mysterious creature and debates its intentions and capabilities.\n45:28 A team plans to communicate with a mysterious creature and prepares for a potential confrontation.\n49:44 A mysterious creature uses a human body to communicate and seeks to offer a better way of life, despite suspicion and fear.\n57:51 Alien warns of impending doom and offers a solution, but faces resistance and sacrifice.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "g-QDDlA30yQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:43.347Z"
}