{
  "imdbId": "youtube-i_oNa8dKE_4",
  "title": "Where East is East (MGM, 1929) LON CHANEY🍕LUPE VELEZ",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=i_oNa8dKE_4",
      "title": "Where East is East (MGM, 1929) LON CHANEY🍕LUPE VELEZ",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Lon Chaney, Lupe Vélez, Estelle Taylor\nDirector: Tod Browning\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TUzR3YhpzxOuBM6YrZ91UVG\n🍕Presented with the original synchronized orchestral score and sound effects🍕\nStep into the shadowy world of jungle intrigue and forbidden love in this intense pre-Code drama from Metro-Goldwyn-Mayer. Directed by the legendary Tod Browning, this atmospheric tale stars Lon Chaney as a fierce animal trapper whose troubled past collides with his daughter's future. Lupe Vélez delivers a fiery performance as the devoted daughter, while Estelle Taylor stuns as a dangerously seductive figure from their past.\n\nProduced by Metro-Goldwyn-Mayer and set against a backdrop of Southeast Asian mystique, this film explores themes of obsession, betrayal, and the primal forces of nature and desire. With Browning’s signature blend of melodrama and menace, the story unfolds with emotional intensity and striking visual style. Chaney’s powerful presence and Vélez’s charm drive a narrative that remains riveting nearly a century later. \n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nBe sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every WEEK on PizzaFLIX.\n\nTRIVIA: This is the 8th of eight films TOD BROWNING directed LON CHANEY for M-G-M between 1925 and ‘29.\n\n#fullmovie #WhereEastIsEast #LonChaney #LupeVelez #TodBrowning #PreCode #MetroGoldwynMayer # synchronizedsound #SilentFilmEra #classicmoviemonday #pizzaflix",
      "id": "i_oNa8dKE_4",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:07.006Z"
}