{
  "imdbId": "youtube-LoMuZf2iX1I",
  "title": "Women of Yi-Dynasty ( Ijo Yeoin Janhogsa )(1969)",
  "year": 1969,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LoMuZf2iX1I",
      "title": "Women of Yi-Dynasty ( Ijo Yeoin Janhogsa )(1969)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01893\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01893\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희,김지미,윤정희,남정임,황정순,주증녀,한은진,김지수,도금봉,사미자,석인수,나정옥,이용남,이정애,지계순,박예숙,윤신옥,문미봉,김신명,김소저,김경란,김지영,신영균,오영일,남궁원,박암,최성,이향,장훈,최삼,박기범,변기종,강계식,김웅,양일민,장인환,채훈,조덕성,김기주,박부양,장정국,박승의,홍성중,이난희,이종철,신필림배우실 일동\n\n줄거리 : 3부로 구성된 옴니버스 영화. 1부 여필종부. 강진사(박암)의 딸 소연(남정임)은 안대감의 죽은 아들 만득과 혼인한다. 망자와 혼인한 소연이 열녀에 오르는 바람에 강진사는 벼슬길에 오른다. 열녀로 칭송을 받지만 생과부로 사는데 지친 소연은 몰래 집을 떠나려고 결심한다. 이를 안 소연의 아버지는 소연을 기다리고 있다 활로 쏘아 죽이고는 소연이 마치 남편을 따라 자결한 것처럼 꾸민다. 그후 소연의 정절을 기리기 위해 열녀문이 세워진다. 2부 칠거지악. 시집온 지 10년이 지나도록 아들을 못 낳은 한씨 부인(최은희)은 치성을 드리고 돌아오다 말더듬이 머슴 성칠(신영균)과 정사를 나누어 임신한 후 아들을 낳는다. 한씨 부인의 남편(남궁원)은 약을 지으러 한의사를 찾아갔다 자신이 성불구라는 사실을 알고 한씨 부인에게 누구의 아이를 낳은 것이냐고 닦달한다. 위기에 처한 한씨 부인은 자신을 믿어달라는 유언을 남기고 자결한다. 3부 금중비색. 상침나인 이씨(김지미)는 밤마다 임금의 잠자리를 지켜보는 게 주어진 임무다. 임금과 후궁의 잠자리를 지키던 이씨는 성욕을 참지 못하고 밖으로 뛰쳐나온다. 그때 나타난 한 무관이 이씨를 강간하는 바람에 이씨는 임신한다. 상궁들의 보호 하에 이씨는 궁궐 안의 폐쇄된 장소인 연고당에서 아이를 낳는다. 그리고 이씨 모자를 궐 밖으로 내보내기 위해 죽은 기밀상궁의 시체와 이씨 모자를 바꿔치기 한다. 나인은 시체가 되어서만 궐 밖으로 나갈 수 있기 때문이다. 이씨 모자를 실은 관이 막 궁문을 나왔을 때, 소문을 들은 내시가 시체를 확인하겠다며 창으로 관을 찌른다. 그는 아이 울음소리를 듣지만 상궁들의 속내를 눈치 채고 모른 척 눈감아준다. 이씨는 무사히 궁을 빠져나간다.(영화)\n\nCasts : Choi Eun-Hee, Nam Jeong-Im, Oh Young-Il, Shin Young-Kyun, NamGung Won\n\nSYNOPSIS : The movie is an omnibus film about women of Joseon Dynasty victimized by the feudalistic conventions.  1.  Yeopiljongbu: A tragic life of a woman who has to marry a young boy because her father wants to have a relation with the minister's family.  2.  Chulgawoein: A woman is falsely accused and killed because her mother-in-law thinks she has taken away her son.  3.  Chilgeojiak: A woman married to an impotent man commits a suicide after she sleeps with a servant.  4.  Gungjungbisaek: A court lady gives a birth to a baby not related to the king.  She faces death threats but escapes from the palace.",
      "id": "LoMuZf2iX1I",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:29.487Z"
}