{
  "imdbId": "youtube-1hg4aUvjbOI",
  "title": "The Adventures of Captain Bontekoe's Cabin Boy - The Curse of the Tides (Full Adventure Movie)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1hg4aUvjbOI",
      "id": "1hg4aUvjbOI",
      "title": "The Adventures of Captain Bontekoe's Cabin Boy - The Curse of the Tides (Full Adventure Movie)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Der 14-jährige Hajo wird Matrose auf der „Nieuw-Horn“ und erlebt mit seinen Freunden Padde und Rolf Stürme, Krankheiten und Abenteuer. Nach einem Schiffsunglück stranden sie auf einer tropischen Insel und kämpfen gemeinsam ums Überleben – eine Geschichte über Mut, Zusammenhalt und Freundschaft.\n\nDIE ABENTEUER VON KAPITÄN BONTEKOES SCHIFFSJUNGEN - DER FLUCH DER GEZEITEN (2007)\nOriginaltitel: De scheepsjongens van Bontekoe\nMit: Pim Wessels, Martijn Hendrickx, Billy Zomerdijk\nRegie: Steven de Jong\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nDer 14-jährige Hajo träumt davon, wie sein verstorbener Vater Matrose zu werden. Er heuert auf der \"Nieuw‑Horn\" unter Kapitän Bontekoe an und lernt die Gleichaltrigen Padde und Rolf kennen. Gemeinsam trotzen sie Stürmen, Krankheiten und rauen Matrosen. Nach einer Explosion bricht das Schiff auseinander – sie treiben tagelang auf offenem Meer, bis sie auf einer tropischen Insel stranden. Dort und auf dem Weg nach Java stellen sie sich Gefahren, kämpfen ums Überleben und finden auf dem Rückweg ihre Stärke in Zusammenhalt. Bontekoe selbst überlebt und rettet Padde schließlich vor einer drohenden Strafe auf Java.\n#Netzkino #ganzerFilm #Abenteuer\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:35:30.977Z",
      "thumbnail": "https://i.ytimg.com/vi/1hg4aUvjbOI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCvlMtelLGV3_7dfXivKJHI0LCDwA",
      "duration": 7878,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.124Z"
}