{
  "movieId": "youtube-srnMQxRl-5w",
  "title": "Long Live Your Death (1971, Western) Franco Nero, Eli Wallach | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=srnMQxRl-5w",
      "id": "srnMQxRl-5w",
      "title": "Long Live Your Death (1971, Western) Franco Nero, Eli Wallach | Full Movie",
      "description": "The bottoms-up comedy hit that will fill your seats.\nA self-proclaimed Russian prince, a Mexican bandit, and a radical Irish female journalist team up during the Mexican Revolution to find fortune and notoriety.\n\nOriginal title: ¡Viva la muerte... tua! AKA: Long Live Your Death (1971)\n\nThis film is subtitled with many language options.\n\nDirector: Duccio Tessari\nWriters: Dino Maiuri, Massimo De Rita, Juan de Orduña\nStars: Franco Nero, Eli Wallach, Lynn Redgrave\nGenres: Action, Adventure, Comedy, War, Western\n\n00:00 Full Movie (with subtitles)\n02:48 A blind priest, hidden gold, and a daring escape in Yuma unfold in this Western adventure.\n08:06 High-stakes escape, confessions, and an impending execution keep tensions high.\n13:53 Treachery, traps, and a quest for gold drive this intense Western showdown.\n20:27 Misunderstandings, ancient Greece references, and a tense standoff in Mexico.\n25:33 A bounty hunt in Mexico reveals alliances and motives for capture.\n32:51 Treasure hunts, escapes, and an epic Western confrontation.\n41:47 The final showdown: gold, a deadly criminal, and justice at last.\n1:03:15 A revolutionary woman leads a daring coup against a Mexican dictator.\n1:13:31 Betrayal and battle erupt as military forces clash in a dramatic standoff.\n1:28:20 Franco Nero and Eli Wallach star in a Western featuring royal intrigue, revolution, and a plot for a coup.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:46.874Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/srnMQxRl-5w/maxresdefault.webp?v=672476b3",
      "duration": 5663,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:46.998Z"
}