{
  "movieId": "youtube-O93VyfpebUM",
  "title": "여고시절(1972) 불완전판 / Girls' High School Days (Yeogosijeol) Incomplete version",
  "year": 1972,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=O93VyfpebUM",
      "id": "O93VyfpebUM",
      "title": "여고시절(1972) 불완전판 / Girls' High School Days (Yeogosijeol) Incomplete version",
      "description": "* 2분 35초부터 11분 37초까지 네거티브 필름이 유실되었습니다. 자막을 키고 관람해주시기 바랍니다. / The film negative was lost from 2 minutes 35 seconds to 11 minutes 37 seconds. Please watch with subtitles enabled.\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02565\n\n감독(Director) : 강대선(Kang Dae-sun)\n출연(Casts) : 김미영(Kim Mi-yeong), 박지훈(Park Ji-hun), 이순재(Lee Soon-jae), 최남현(Choi Nam-Hyun), 강계식(Kang Kye-shik)\n\n줄거리 : 여름방학을 맞아 시골에서 합숙을 하며 봉사활동을 하던 여고생 미례는 남자고등학교의 생물반 학생으로 고산식물을 채집하다 하산하던 태호와 산속을 헤매다 만나게 된다. 둘은 짙은 안개속을 헤매다 어느 산장안에서 날이 새기를 기다리던 중 그들을 찾아 나선 인솔교사들에게 발견된다. 기성세대와 학교선생들은 이들의 순결함을 믿지 못하고 퇴학처분을 내린다. 세월이 흐른 후 미례는 태호와의 사랑을 이루지 못하고 다른 청년과 결혼식을 올린다.\n\nSYNOPSIS : Mi-Rye is a high school girl who participates in volunteer service in a rural village during summer vacation. When she gets lost in the mountain, she meets Tae-Ho who is a member of biology club of boys' high school. He is on his way down to village after he finishes gathering herbs and plants on high altitude. They stray in the thick fog and finds a villa where they stay awake. The next morning, they are found by teachers. They are expelled from school because the older generation and teachers don't believe their sexual morality. Years later, Mi-Rye fails to accomplish her love with Tae-Ho, and marries to another man.",
      "addedAt": "2025-12-26T00:21:16.601Z",
      "thumbnail": "https://i.ytimg.com/vi/O93VyfpebUM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDKnrUCz30PUQRmMsHgASmgvelmrg",
      "duration": 5542,
      "language": "ko",
      "year": 1972,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:16.646Z"
}