{
  "imdbId": "youtube-g7Depp17waI",
  "title": "Love Me Once Again ( Miweodo Dasi Han Beon )(1968)",
  "year": 1968,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g7Depp17waI",
      "title": "Love Me Once Again ( Miweodo Dasi Han Beon )(1968)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01726\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01726\n\n영화글 : https://www.kmdb.or.kr/story/10/5244\n\n감독(Director) : 정소영(Jeong So-Young)\n출연 : 신영균(신호),문희(혜영),전계현(신호 아내),박암,이충범,김정옥,김정훈(영신)\n\n줄거리 : 혜영(문희)은 신호(신영균)가 유부남인지 모르고 그를 사랑하게 된다. 혜영은 신호와 결혼을 꿈꾸지만 신호는 진실을 얘기하지 못한다. 결국 시골에서 신호의 아내(전계현)와 자식이 상경해서야 혜영은 그 사실을 알게 된다. 혜영은 신호 곁을 떠나 혼자 신호의 아들 영신(김정훈)을 낳아 기른다. 하지만 8년 후 그녀는 아들의 장래를 위해 신호를 찾아가 아이를 길러줄 것을 부탁한다. 아이는 새로운 환경에 적응하지 못하여 외로운 나날을 보내고 엄마만을찾는다. 외로운 영신은 엄마를 찾아 나왔다가 길을 잃어버리고, 집안사람들은 영신을 찾아 나선다. 집을 찾아온 영신을 혼내는 신호를 훔쳐 본 혜영은 영신을 자신이 키워야겠다고 결심한다. 신호의 가족들도 영신을 혜영의 품으로 돌려보내기로 하고 혜영은 신호를 데리고 시골로 내려간다.\n\nCasts : Shin Young-Kyun, Moon Hee, Jeon Kye-Hyeon, Kim Jeong-Hun, Park Ahm, Lee Chung-Beom, Kim Jung-Ok, kim Jung-Hun\n\nSYNOPSIS : Hye-young (Moon Hee), a kindergardten teacher, and Shin-ho (Shin Young-kyun) are in love. Hye-young takes care of Shin-ho who lives alone as a boarder, dreaming of a happy future together. But one day, Shin-ho's wife (Jeon Gye-hyeon) arrives unexpectedly with his two children. Hye-young, shocked about Shin-ho being a married man, leaves him and disappears. After 8 years, Shin-ho has become a successful businessman living happily with his family. This is when Hye-young re-appears with his son Young-shin (Kim Jung-hoon). When Hye-young left him eight years ago, she was already pregnant with his baby. She's been raising the baby alone. Young-shin is now ready to enter elementary school and he has always longed for his father. Hye-young decides to send her son to his father for a better future. Finally, Young-shin gets to live with his father and his father's family but he doesn't get along well with his step brother and sister. Also, he longs for his mother and finally decides to go back to where he lived with his mom. Shin-ho and his family look for Young-shin all night long when Hye-young is hiding around Shin-ho's house longing to see her son from a distance. Deep in the night, Young-shin returns home having no success finding a way to get to his mom and is spanked by his angry father. Hye-young catches the sight and decides to take her son back with her. On the next day, Hye-young takes her son back to her house while the rest of the family watches the mother and son leave the house.",
      "id": "g7Depp17waI",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:25:08.463Z"
}