{
  "imdbId": "youtube-oOT4ArijCA8",
  "title": "강원도의 힘(1998) / The Power of Kangwon Province(Gang-wondo-ui him)",
  "year": 1998,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oOT4ArijCA8",
      "title": "강원도의 힘(1998) / The Power of Kangwon Province(Gang-wondo-ui him)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\nhttps://www.kmdb.or.kr/db/kor/detail/movie/K/04942\n\n영화글 : https://www.kmdb.or.kr/story/10/73\n\n감독(Director) : 홍상수(Hong Sang-soo)\n출연 : 백종학 , 오윤홍 , 김유석 , 전재현 , 박현영\n줄거리 : 지숙(오윤홍), 은경(박현영), 미선(임선영)은 강릉으로 여행을 와 우연히 한 경찰(김유석)을 만나 민박집을 소개받는다. 그날 밤 술자리에서 말다툼 끝에 미선은 지숙이 유부남 상권(백종학)과 사귄 것을 비난하고, 술에 취한 지숙과 경찰은 경비초소에서 함께 밤을 보낸다. 서울에 와서도 경찰과 연락하던 지숙은 강원도로 내려가 경찰을 만난다. 지숙은 경찰로부터 지난 여행에서 스쳤던 여성이 산에서 추락사했고, 동행이었던 남성이 누군가의 제보에 의해 잡혔다는 이야기를 듣는다. 술자리 끝에 모텔에 들어선 그들은 섹스 때문에 가벼운 실랑이를 벌이다 그냥 잠이 든다. 한편 상권은 후배 재완(전재현)과 강원도로 여행한다. 그들은 지숙 일행과 같은 열차를 탔지만 그 사실을 알지 못한다. 두 사람은 산에서 홀로 여행하는 여인을 만나 차를 마시기로 하지만 그녀는 나타나지 않는다. 콘도에서 그녀를 본 상권은 동행인 남자 앞에서 그녀에게 왜 약속을 지키지 않았느냐고 따진다. 서울로 올라온 상권은 신문을 보고 강원도에서 만난 여성이 추락사한 것을 알고, 그녀에게 동행 남성이 있었다는 사실을 경찰에 제보한다. 얼마 후 교수가 된 상권은 지숙을 불러낸다. 상권은 섹스를 원하지만, 지숙은 상권에게 이제 만나지 않는 사람의 아이를 실수로 임신하여 낙태 수술을 받아 섹스는 안 된다고 말한다.\n\nCasts :Baek Jong-hak , Oh Yoon-hong , Kim Yu-seok , Jeon Jae-hyun , Park Hyun-young\nSYNOPSIS : It's another hot humid summer in Seoul and a trip to the mountain and temples of Kangwon Province could be just the thing to revive the spirit in the aftermath of a breakup. Or not... One the rebound from a love affair with Sang-Kwon, her married university instructor, Ji-Sook joins two girlfriends a trip to Kangwondo. Although Ji-Sook is the only woman he's ever loved, Sang-Kwon seems to have moved on and is now searching for a tenured position. His trip to Kangwondo coincides with Ji-Sook's, and up in the mountains, both have a brush with the same tragedy. Both also have drunken spats with friends and indulge in joyless flirtations. Ji-Sook meets a friendly policeman she later returns to visit and Sang-Kwon, who has missed a rendezvous with a beautiful woman, ends up having unsatisfying sex with a prostitue. Ultimately, both leave Kangwondo lonelier than ever. Will the ephemeral ties which bind the two lovers ever gain substance in the smog of Seoul?",
      "id": "oOT4ArijCA8",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:23.721Z"
}