{
  "imdbId": "youtube-qpVlNIgjuos",
  "title": "Western Movie | The Proud Rebel (1958) Alan Ladd, Olivia de Havilland, Dean Jagger",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qpVlNIgjuos",
      "id": "qpVlNIgjuos",
      "title": "Western Movie | The Proud Rebel (1958) Alan Ladd, Olivia de Havilland, Dean Jagger",
      "description": "A Confederate veteran living in the Yankee North struggles with his son's shock induced muteness and the hate of the Northerners.\n\nOriginal title: The Proud Rebel (1958) \n\nDirector: Michael Curtiz\nWriters: Joseph Petracca, Lillie Hayward\nStars: Alan Ladd, Olivia de Havilland, Dean Jagger\nGenres: Classic Western\n\n00:00 Full Movie (with subtitles)\n04:27 Father seeks cure for son's mutism, visits Dr. Davis in Illinois, who suggests specialist in Minnesota.\n11:32: Conflict arises over stolen dog in a Western town, leading to accusations and a courtroom showdown.\n17:44 A woman defends a man in court, offers to pay his fine, and faces societal pressure to marry in a Western movie.\n22:13 A man helps a woman with her farm, facing challenges and building a bond in a Western setting.\n37:25 Chandler refuses to sell his champion sheepdog despite tempting offers, while bonding with a sensitive boy named David.\n46:12: A doctor brings good news to Chandler about a possible cure for a child's paralysis.\n50:14: A father struggles to make a tough decision regarding his son's future and his beloved dog.\n55:57 Interaction and events unfold in a rural setting involving repairs, saving lives, and social interactions.\n1:18:38 Chandler struggles with selling a dog named Lance and its consequences.\n1:32:01 Conflict arises over a stolen sheepdog, leading to a tense confrontation with a father and his sons in a Western setting.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:47:35.818Z",
      "thumbnail": "https://i.ytimg.com/vi/qpVlNIgjuos/maxresdefault.jpg?v=666e71d8",
      "duration": 6185,
      "language": "en",
      "year": 1958,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:47:35.880Z"
}