{
  "imdbId": "youtube-YPcaIxTSBiw",
  "title": "Love Island 1952 (Comedy, Romance) Paul Valentine, Eva Gabor, Malcolm Lee Beggs | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YPcaIxTSBiw",
      "title": "Love Island 1952 (Comedy, Romance) Paul Valentine, Eva Gabor, Malcolm Lee Beggs | Movie",
      "description": "Throbbing adventure and blazing lips! \nUS-Navy pilot Lt. Richard Tabor crash-lands on a south Pacific isle called Love Island in English. Richard befriends the Balinese beauty Sarna. The bad and jealous Jaraka doesn't like their friendship, so he has Sarna's father Aryuna arrested on a vague charge. Jaraka tells Aryuna that he only will be released when his daughter marries him.\n\nColorized version: https://youtu.be/k8YfEZ80xOc\n\n\nOriginal title: Love Island (1952)\n\nThis film is available with subtitles in many language options.\n\nDirectors: Bud Pollard\nWriter: John E. Gordon \nStars: Paul Valentine, Eva Gabor, Malcolm Lee Beggs\nGenre: Adventure, Classics, Comedy, Drama, Romance\n\n\n0:00 Full Movie (with subtitles)\n01:25 Love Island's romantic and comedic tale unfolds on Tuba Tara, where Lieutenant Taber recounts his thrilling rescue.\n07:36 Romantic entanglements and marital aspirations unfold in a small coastal village in 1952.\n14:26 Marriage customs, and cultural differences explored in a 1952 comedy romance movie set in a foreign land.\n22:41:Love and marriage customs in a Balinese village unfold, involving arranged marriages, ceremonies, and family drama.\n39:00 A revelation shakes a family as a daughter's true parentage comes to light, affecting her impending marriage.\n43:42 Romantic comedy unfolds as promises, love, and misunderstandings lead to a wedding dilemma.\n52:34 Betrayal and deception unfold as a key is hidden and a love triangle is revealed.\n\n\n@CultCinemaClassics\n\n https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "YPcaIxTSBiw",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:09.073Z"
}