{
  "imdbId": "youtube-xxqTPmS_A-g",
  "title": "Exploding Sun | Part 1 of 2 | FULL MOVIE | Thriller, Action | 2013",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xxqTPmS_A-g",
      "id": "xxqTPmS_A-g",
      "title": "Exploding Sun | Part 1 of 2 | FULL MOVIE | Thriller, Action | 2013",
      "description": "In Part 1: A historic space launch triggers a solar-storm event that could have cataclysmic repercussions for the planet if it isn’t stopped in time—and time is running out. The world watches in awe as the;Roebling;Clipper is launched into space. Using state-of-the-art scalar engines to fly around the Moon and back in just hours, the maiden voyage of the first-ever trans-lunar passenger ship is about to make history. Among those on board: First Lady Simone Mathany, space-exploration entrepreneur Steve Roebling, Dr. Denise Balaban, pilot Fiona Henslaw, and a very lucky lottery winner. But while en route, a massive solar flare sparks a cosmic-ray burst that accelerates Aurora’s engine and blows the ship away from Earth’s orbit. Now out of control, it’s hurtling straight for the sun. At Mission Control, along with the desperate President Thomas Mathany, an increasingly anxious team of experts puts a plan into motion—an interception by a shuttle attached to the International Space Station. When that ends in disaster, the Aurora only picks up speed. Now being pulled toward the sun at three percent of the speed of light, it’s only a matter of hours before it burns. With that, the scalar engine will trigger cosmic ray bursts, and a giant electromagnetic pulse storm that will blow Earth back into the Stone Age. Now, preparing for the inevitable seems the last—and only—terrifying option. A combination of scientific reality, intense human drama, and state-of-the-art special effects, EXPLODING SUN is a new-wave disaster miniseries of epic proportions.\n\nWatch part 2 here!: https://youtu.be/vGHIiUc_r4Y\n\r\nDavid James Elliott\nJulia Ormond\nNatalie Brown\nAnthony Lemke\n\nAction\nThriller\n\n2013\nDirected by Michael Robison\n\r\nMORE Popcornflix MOVIES, FREE on YouTube!\r\n\r\n Action: https://bit.ly/2XC8pvv\r\n Romance: https://bit.ly/2NVnIQ2\r\n Horror: https://bit.ly/2LeNNaK\r\n Crime: https://bit.ly/2NK201z\r\n Drama: https://bit.ly/2G6Uasy\r\n Comedy:  https://bit.ly/2LPCNQD\r\n Western: https://bit.ly/2S7FRc4\r\n Popcornflix Channel page: https://bit.ly/2Saak9p\r\n\r\nWatch more free movies and TV series at Popcornflix.com, or on the Popcornflix app available on Roku, Amazon FireTV, iOS, Android, Chromecast, and AppleTV.\r\n\r\n#Popcornflix, Full length free movies and TV series.\r\nLike us on Facebook: https://www.facebook.com/Popcornflix\r\nFollow us on Twitter: https://twitter.com/Popcornflixnews\r\nPopcornflix is owned/operated by Screen Media Ventures",
      "addedAt": "2025-12-23T23:36:13.883Z",
      "thumbnail": "https://i.ytimg.com/vi/xxqTPmS_A-g/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC0oqeoEncUg_kdgOSYpLHwajBUKA",
      "duration": 5314,
      "language": "en",
      "channelName": "Popcornflix",
      "channelId": "UCVFYikepF-avelvuIaQ_lHA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T23:36:13.883Z"
}