{
  "movieId": "youtube-z6AJb-n92j8",
  "title": "All Husband’s Have Secrets | Claire in Motion + The Merry Gentleman | Mystery Thriller",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=z6AJb-n92j8",
      "id": "z6AJb-n92j8",
      "title": "All Husband’s Have Secrets | Claire in Motion + The Merry Gentleman | Mystery Thriller",
      "description": "All Husband’s Have Secrets | Claire in Motion + The Merry Gentleman | Mystery Thriller\n\nClaire In Motion: Three weeks after her husband vanishes under mysterious circumstances, Claire is unwilling to believe that the truth has been lost. As the police conclude their investigation and her son starts to mourn, Claire reveals unsettling secrets, including a close relationship he maintained with a manipulative graduate student.\n\nAs she delves further, Claire finds it challenging to reconcile the man she believed she knew with the truth of his concealed existence, ultimately leading her to question her own identity and sense of self.\n\nClaire In Motion is a captivating psychological drama and thriller, intertwining suspense, familial tension, and dark secrets into a riveting narrative of loss, exploration, and self-discovery.\n2016.  Stars: Betsy Brandt, Chris Beetem, Zev Haworth\n\nThe Merry Gentleman: After escaping from an abusive marriage, a woman embarks on a new chapter in Chicago, seeking tranquility and autonomy. There, she forms a friendship with a man who is experiencing a significant emotional turmoil—unbeknownst to her, he is a hired assassin. Concurrently, a committed detective is diligently pursuing the investigation into the enigmatic hitman.\n\nAs bonds develop and hidden truths come to light, the intersection of danger and romance creates a tense and compelling narrative that delves into themes of trust, redemption, and the potential for personal transformation.\n\nFeaturing performances by Michael Keaton, Kelly Macdonald, and Bobby Cannavale, The Merry Gentleman is an enthralling drama thriller that weaves together elements of crime, suspense, and profoundly human storytelling.\n2008.  Stars: Michael Keaton, Kelly Macdonald, Bobby Cannavale\n\n*Both movies licensed from Breaking Glass Pictures. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\n\n#FullFreeMovies #MovieCentral #freeyoutubemovies \n00:00:00 Claire In Motion Full Movie\n01:19:20 The Merry Gentleman Full Movie\n02:51:22 Credits",
      "addedAt": "2025-12-27T00:00:10.951Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/z6AJb-n92j8/maxresdefault.webp",
      "duration": 10858,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:00:11.026Z"
}