{
  "movieId": "youtube-b1RdzFeGZjg",
  "title": "The Jill & Tony Curtis Story (Documentary) A-listers to animal angels: their untold ride",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b1RdzFeGZjg",
      "id": "b1RdzFeGZjg",
      "title": "The Jill & Tony Curtis Story (Documentary) A-listers to animal angels: their untold ride",
      "description": "Jill Vandenberg Curtis, wife of Hollywood legend Tony Curtis, shares her incredible journey from the glitz and glamour of Hollywood to her true passion—rescuing horses.  Disillusioned by the emptiness of celebrity life, Jill and her husband, screen legend Tony Curtis, founded Nevada’s Shiloh Horse Rescue, dedicating themselves to saving horses from slaughterhouses and lobbying for animal rights. The documentary juxtaposes their glamorous past with gritty, never-before-filmed footage of auctions, slaughterhouse rescues, and heartfelt rehabilitation efforts—culminating in the emotional milestone of saving their 400th horse.\nBalancing personal and political stakes, the film captures their partnership with allies like Bo Derek to push legislation in Washington, D.C., while revealing intimate moments: Tony’s candid reflections on art and aging, Jill’s unyielding resolve, and the couple’s shared mission to redefine purpose beyond fame. Awarded Best Documentary at the 2008 Bel Air Film Festival, it blends raw activism with a love story—both for horses and each other—proving that fulfillment often lies in unexpected, life-changing callings.\n“A story of redemption, not just for the horses, but for the human spirit.”\n\nDirected by Ian Ayres\nBest Documentary at the 2008 Bel Air Film Festival\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:31:13.133Z",
      "thumbnail": "https://i.ytimg.com/vi/b1RdzFeGZjg/maxresdefault.jpg",
      "duration": 3332,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:31:13.258Z"
}