{
  "imdbId": "youtube-8CjCCcR8noA",
  "title": "The Mummy Strikes 1964 | Horror Movie | Richard Webb, John Burton",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8CjCCcR8noA",
      "title": "The Mummy Strikes 1964 | Horror Movie | Richard Webb, John Burton",
      "description": "A scientist hypnotically regresses a woman to a previous life, a Mayan princess, who leads him to a secret tomb where the princess was buried - and the mummy of an ancient warrior, cursed to live after death and guard the treasure buried with her. Edited by Jerry Warren from the Mexican horror film LA MOMIA AZTECA, and following its general plot but with 36 minutes of new, American-made footage added and English narration in lieu of dubbed dialogue\n\nOriginal title: Attack of the Mayan Mummy (1964)   AKA: The Mummy Strikes\n\nDirectors: Rafael Portillo, Jerry Warren\nWriters: Guillermo Calderón, Alfredo Salazar, Jerry Warren \nStars: Nina Knight, Richard Webb, John Burton\nGenres:  Classics, Cult Film, Horror \n\n00:00 The Full Movie\n02:07 Dr. Munson discusses his decision to give up radio and television work and reflects on the consequences of scientific discoveries.\n08:30 Dr. Edmond Redding withholds information about his findings on the Mayan civilization, causing surprise and disappointment among attendees at a symposium.\n11:47 Two individuals discuss their careers in medicine and research, and consider the possibility of uncovering Mayan gold.\n16:07 A leak of information about a search for the pyramids has already begun flowing into the speaker's office, and they plan to learn the developments as if they were going along with the search.\n20:28 Dr. Redding and his team embark on a search of the great pyramid in Yucatan to uncover ancient secrets.\n31:51 An expedition to a pyramid in Yucatan uncovers a mummy and leads to the death of Dr. Redding.\n52:53 Dr. Munson discusses the chaos surrounding the broadcast and his plan to take charge at Cowan to study the mummy.\n57:39 Dr. Janning is asked to steal a mummy from the Cowan Research Foundation.\n1:08:27 A journalist confronts a doctor about a mummy story, questioning its accuracy and the doctor's motives.\n\n@CultCinemaClassics:",
      "id": "8CjCCcR8noA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:48:36.960Z"
}