{
  "movieId": "youtube-4LJRy0jtRj0",
  "title": "Three Guys Named Mike 1951 | Jane Wyman, Van Johnson, Howard Keel (Comedy, Romance) American film",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4LJRy0jtRj0",
      "id": "4LJRy0jtRj0",
      "title": "Three Guys Named Mike 1951 | Jane Wyman, Van Johnson, Howard Keel (Comedy, Romance) American film",
      "description": "Which Mike will she choose?\nA stewardess becomes romantically involved with an airline pilot, a college professor, and a successful businessman…all of whom are named Mike. When the three find out about each other, she has to decide which one she loves the most.\n\nColorized version: https://youtu.be/jy7uhfy33tI\n\n\nOriginal title: Three Guys Named Mike (1951)\n\nDirector: Charles Walters\nWriters: Sidney Sheldon, Ruth Brooks Flippen, Ethel Wells \nStars: Jane Wyman, Van Johnson, Howard Keel, Barry Sullivan\nGenres: Classics, Comedy, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:25 A young woman named Marcy prepares to become an airline stewardess, facing rejection but showing determination and enthusiasm.\n07:20 A group of stewardesses embark on their first flights, facing challenges and forming connections.\n18:20 A comedic and romantic film featuring a stewardess causing chaos on a flight to Nashville.\n28:42 A chance encounter on a flight leads to a charming conversation about stars, dogs, and VIP passengers.\n42:59 Four women plan to share a house due to a housing shortage, discuss over lunch, and prepare to look for a new home.\n44:00 Three individuals interact in Chicago, discussing a scientist and advertising, leading to dinner invitations and missed connections.\n50:18 Three individuals named Mike help a family move into a new house, showcasing their camaraderie and helpfulness.\n56:33 Three men help a woman move, leading to a dinner invitation and a scientific demonstration in a comedy romance film.\n1:07:21 A young woman named Marcy impresses a group with her advertising idea for Gardenia soap.\n1:13:23 Unexpected visit from the airline president leads to praise for Marcy's exceptional work in public relations.\n1:16:39 A chaotic evening unfolds during an advertising campaign, involving a stewardess, a photographer, and a pilot.\n1:23:19 Romantic comedy film where Marcy faces career and love dilemmas involving three men named Mike.\n1:33:21 Opportunities for starting a business with SMC, offering support, resources, and high-profit products.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:15.658Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/4LJRy0jtRj0/maxresdefault.webp?v=666e71be",
      "duration": 5415,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:15.802Z"
}