{
  "imdbId": "youtube-oqcAabjVCpE",
  "title": "The Gunman from Bodie (Western, 1941) with Buck Jones & Tim McCoy | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oqcAabjVCpE",
      "title": "The Gunman from Bodie (Western, 1941) with Buck Jones & Tim McCoy | Full Movie",
      "description": "Buck poses as a wanted killer and Sandy as a cook as the trio help ranchers stop a ruthless crook from taking over the area's water rights and help an orphaned baby.\n\nColorized version: https://youtu.be/NR156RV81jg\n\n\nOriginal title: The Gunman from Bodie (1941) AKA: Bad Man from Brodie\n\nDirector: Spencer Gordon Bennet\nWriter: Adele Buffington\nStars: Buck Jones, Tim McCoy, Raymond Hatton\nGenres: Classics, Crime, Western, Drama\n\n00:00 Full Movie (with subtitles)\n07:10 Joe's father and several others were killed in a massacre on their ranch, and Joe is determined to find the culprits and stop the theft of their cattle.\n12:05 A stranger arrives at the Circle B farm and asks to speak to Miss Ellis about the wrestlers and the lack of action from the authorities.\n18:22 A United States Marshal visits Larabee Land and Water to warn them that a wanted man, Bill Cook, may be in the area.\n30:37 A United States marshal comes to town and accuses Bill Cook of murdering Pete Gibbs and his wife.\n32:11 The United States Marshal arrests Bill Cook for the murder of Pete Gibbs and his wife, and a new ranch chief named Bodhi takes over.\n39:00 A man named Bill Cook escapes from prison and a herd leader named Body Bronson plans to attack a herd of cattle.\n51:46 A United States marshal tries to bring law and order to Larabee, but faces resistance from a gang led by Bronson.\n53:32 A marshal and a posse pursue a rancher suspected of cattle theft.\n1:01:01 A group of people work together to take care of a small razor and resolve their conflicts.\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "oqcAabjVCpE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:46.938Z"
}