{
  "imdbId": "youtube-jmQieXK_EBM",
  "title": "Das Wunder von New York - Weihnachtsfilm - Jetzt den ganzen Film kostenlos schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jmQieXK_EBM",
      "title": "Das Wunder von New York - Weihnachtsfilm - Jetzt den ganzen Film kostenlos schauen bei Moviedome",
      "description": "►Ganzer Film! Paul Rudd spielt in dieser weihnachtlichten Komödie einen Ex-Ganoven, der sich jetzt am Weihnachtsbaumverkauf versucht.\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nJetzt den Comedy Film \" Das Wunder von New York “ in ganzer Länge bei #Moviedome sehen.\n\n►Die Handlung:\nDer Kleinkriminelle Dennis ist frisch aus dem Knast und muss versuchen wieder auf die Beine zu kommen. Das Schwierige dabei: Keine Verbrechen! Er rauft sich mit seinem Ex-Partner Rene zusammen und gemeinsam versuchen sie ihr Glück mit einem Weihnachtsbaumverkauf. Das Geschäft aber läuft schleppend... sehr schleppend. Doch um seiner Tochter den größten Weihnachtswunsch vom eigenen Klavier zu erfüllen, ist Dennis bereit alles zu geben.\n\nJetzt den #Comedy Film \" Das Wunder von New York “ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Action #Krieg #Drama #DasWundervonNewYork #PaulRudd #Comedy\n\nOriginaltitel: All is Bright\nFilmlänge: 107 Minuten\nRegie: Phil Morrison\nFSK: 12\nDVD-Start (DE): 2013\n\n\nDie Darsteller\nPaul Giamatti (bekannt aus „San Andreas“, „12 Years a Slave”) als Dennis\nPaul Rudd (bekannt aus „Ant-Man“, „Avengers: Infinity War“) als Rene\nSally Hawkins (bekannt aus „Shape of Water“, „Godzilla 2: King of Monsters“) als Olga\nAmy Landecker (bekannt aus „Doctor Stranger“, „Dan - Mitten im Leben!“) als Therese\n\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nJetzt den Comedy Film \" Das Wunder von New York “ in voller Länge auf deutsch ansehen.\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \n\nBei Fragen wenden Sie sich bitte an:  copyright.berlin@plaion.com \nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com",
      "id": "jmQieXK_EBM",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:34:43.068Z"
}