{
  "imdbId": "youtube-VYIt1ZFbNu8",
  "title": "Safari Express (Action, 1976) with Ursula Andress & Jack Palance | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VYIt1ZFbNu8",
      "title": "Safari Express (Action, 1976) with Ursula Andress & Jack Palance | Movie",
      "description": "Two safari tour-guides and business partners find in the African jungle a wandering stunning blonde who suffers from amnesia.\n\nOriginal title: Safari Express (1976)\n\nThis film is available with English & Italian audio. And subtitled in many languages.\nGo to video settings ⚙️  to change your audio / subtitle language options.\n\n\nDirector: Duccio Tessari\nWriters: Mario Amendola, Gianfranco Clerici, Bruno Corbucci\nStars: Giuliano Gemma - Ursula Andress - Jack Palance - Enzo Bottesini - Giuseppe Maffioli\nGenres: Action, Adventure, Comedy\n\n\n00:00 Full Movie  Adventure in the African wilderness - a daring safari expedition.\n05:20 A safari trip encounters danger and deception, leading to a tense confrontation with a mysterious figure.\n13:30 A thrilling encounter in Africa involving a group of individuals with memory loss, mistaken identities, and a dramatic escape from danger.\n19:15 Adventure unfolds as characters interact on a train, discussing a variety of topics and encountering unexpected situations.\n25:11 A lucrative job offer, involving dangerous cargo transportation in Africa.\n29:58 A chaotic scene unfolds as the characters argue and fight, leading to a visit to Dr. Walker for urgent help.\n36:04 A thrilling safari adventure involving memory recovery, medical treatment, and a dangerous encounter with a woman.\n50:57 A thrilling safari expedition uncovers a large uranium deposit, leading to a series of dangerous events and a plot to become the king of Batongas.\n55:59 Action-packed scene from Safari Express involving a thwarted weapon delivery and a daring escape.\n1:02:27 A thrilling action movie involving a dangerous plot, deceit, and a race against time on a safari express in Africa.\n1:11:54 Drama unfolds as characters confront dangerous plans and moral dilemmas in the movie Safari Express.\n1:19:32 Adventure and romance unfold as characters navigate through a series of events in the African wilderness.\n\n\nYou want more Jack Palance movies? \n👉 https://www.youtube.com/playlist?list=PL2gsu7VGzgdbIoWXeqvVD9_02uEt-OCNU\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "VYIt1ZFbNu8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:52.367Z"
}