{
  "imdbId": "youtube-fvBdiOlbqd8",
  "title": "NEW 4K RESTORATION🍕 Apache Rifles (1964) AUDIE MURPHY",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fvBdiOlbqd8",
      "title": "NEW 4K RESTORATION🍕 Apache Rifles (1964) AUDIE MURPHY",
      "description": "It's FRIDAY@PizzaFLIX\nDirector: William Witney\nStars: Audie Murphy, L.Q. Jones, Michael Dante, Linda Lawson\n🍕 New HD 4K RESTORATION from the Original Negative🍕 \nExperience a tense and action-filled Western directed by veteran filmmaker William Witney. Set in the rugged Arizona Territory, this 1964 CinemaScope feature stars Audie Murphy as Capt. Jeff Stanton, a tough but principled Army officer, assigned to suppress a growing Apache uprising. As conflict escalates, Stanton must confront not only the violence on the frontier but also his own changing beliefs about justice and peace.\n\nThis fast-paced Western also stars Michael Dante as the proud Apache leader, and Linda Lawson as the strong-willed missionary’s daughter caught in the crossfire. Adding grit to the cast is L.Q. Jones—later a frequent face in Sam Peckinpah’s legendary posse—bringing classic frontier toughness to the screen.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nA standout entry in the final era of traditional Hollywood Westerns, this production delivers compelling performances and cinematic style. Whether you’re a fan of Audie Murphy’s filmography or a student of 1960s Westerns, this restored presentation brings the frontier back to life.\n\n#ApacheRifles #AudieMurphy #WesternMovies #WilliamWitney #ClassicWesterns #MichaelDante #LindaLawson #CinemaScope #LQJones",
      "id": "fvBdiOlbqd8",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:55.223Z"
}