{
  "imdbId": "youtube-w0Vo4rRyz1M",
  "title": "미지왕(1996) / Ambiguous Man (Miji-wang) (1996)",
  "year": 1996,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=w0Vo4rRyz1M",
      "title": "미지왕(1996) / Ambiguous Man (Miji-wang) (1996)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04870\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04870\n\n감독(Director) : 김용태(Kim Yong-tae)\n출연 : 조상기 , 정상인 , 임지선 , 김현희 , 문소연\n\n(줄거리) 희대의 바람둥이 왕창한과 열살 연상의 재벌 외동딸 엄청난의 결혼식날. 조촐히 치루기로 합의한 결혼식에 양가 친척 60여 명이 모이고 신랑의 입장을 기다리는 순간 왕창한이 나타나지 않는다. 갑자기 사라져버린 신랑 때문에 결혼식장은 술렁이게 되고 마침 하객으로 온 두 경찰과 가족의 협조로 신랑을 찾기 위한 긴급 수사본부가 설치되면서 신랑 주변인물들이 차례로 불려온다. 첫번째 증인 신부 엄청난부터 시작해 왕창한의 부친, 신랑의 친구인 나도해, 설소희,또 다른 친구 봉기성 등등이 차례로 출두하는데 갑자기 신랑의 첫사랑 견풍미가 증인으로 나타난다. 식장은 점입가경으로 식객들은 술에 취해 난리 굿판이 벌어지고, 경찰은 실마리가 보이지 않자 철수를 준비하는데, 마지막 증인이 나타난다. 결혼식 전날밤 첫사랑의 추억이 깃든 장소에서 밤을 함께 했다는 정주라가 나선다. 어른들이 광란의 시간을 보내는 동안 식장 밖에서 놀던 아이들이 왕창한을 발견한다.\n\n(Cast) Cho Sang-kee , Jung Sang-in , Lim Ji-sun , Kim Hyeon-hui , Mun So-yeon\n\n(Synopsis) Wang Chang-han, a well-known womanizer, plans to marry Eom Chung-nan, the daughter of a wealthy conglomerate who is ten years his senior. On the wedding day, around sixty friends and relatives are invited as it was supposed to be a modest wedding. But things become complicated when the groom goes missing. The wedding hall becomes chaotic when all the guests begin to look for the groom. With the help of two police detectives and the cooperation of Wang's friends and relatives, an investigation takes place. The bride, Chung-nan, groom's friends and family are called in one by one for questioning. The investigation takes a strange turn when Wang's first love, Gyun Poong-mi, comes into to testify. The wedding hall soon turns into a big party when the guests begin to get drunk and the two detectives have no choice but to close the investigation. As they are about to wrap things up, the last witness enters. It is Jeong Jura, who claims she spent the last night of Wang' bachelorhood with him. As the party guests go oblivious to what is going on, children who have been playing outside the hall find Wang.",
      "id": "w0Vo4rRyz1M",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:43.349Z"
}