{
  "imdbId": "youtube-3zJM54YISCk",
  "title": "Mine 9 (SPANNENDER THRILLER auf Deutsch komplett, ganzer Film kostenlos, Überlebensthriller Filme)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3zJM54YISCk",
      "title": "Mine 9 (SPANNENDER THRILLER auf Deutsch komplett, ganzer Film kostenlos, Überlebensthriller Filme)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Neun Bergleute werden nach einer Methanexplosion in Mine 9 in einer Appalachen-Kohlemine verschüttet. Mit Sauerstoff, der nur noch für eine Stunde reicht, beginnt nun der Überlebenskampf...\n\nMINE 9 (2019)\nOriginaltitel: Mine 9\nMit: Terry Serpico, Mark Ashworth, Kevin Sizemore, Clint James, Drew Starkey\nRegie: Eddie Mensore\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie Männer um Vormann Zeke sind eine eingeschworene Truppe: Vom Leben gehärtete Bergleute, die täglich unter größter Gefahr in der beklemmenden Enge der Kohleminen für wenig Lohn dem gnadenlosen Stein das schwarze Gold entreißen. Trotz eines höchst verdächtigen Zwischenfalls entschließt sich das Team zu einer erneuten Einfahrt, um ihre Arbeitsplätze nicht zu gefährden - unter ihnen auch Ryan, Zekes erst achtzehnjähriger Neffe, der widerwillig seine erste Schicht antritt. Kurz darauf führt eine gewaltige Methanexplosion zu einer Kettenreaktion, die den Schacht zum Einsturz bringt. Von draußen ist dank eingesparter Sicherheitsmaßnahmen keine sofortige Hilfe zu erwarten, und schnell spitzt sich die Lage für die wenigen Überlebenden dramatisch zu: Zwischen Feuerstürmen, Gaswolken und unterirdischen Flutbächen kämpfen die Männer in den engen Stollen verzweifelt gegen den sicher scheinenden Tod...\n#Netzkino #ganzerFilm #Thriller\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "3zJM54YISCk",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}