{
  "imdbId": "youtube-44Sgd9xK18g",
  "title": "The Daltons Last Raid (Western, 1951) Directed by Sam Newfield | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=44Sgd9xK18g",
      "title": "The Daltons Last Raid (Western, 1951) Directed by Sam Newfield | Colorized Movie",
      "description": "They knew but one law... The Law Of Vengeance!\nTom and Fred Denton, rush to California to save their brother Matt from a wrongful hanging following a train robbery charge. After rescuing Matt, they are framed for crimes they didn't commit and become entangled in more criminal activities with outlaw Bill Devlin. Upon returning to Fort Grant, they plan to rob two banks filled with cattle money, escalating tensions in the territory.\n\nOriginal title: Three Desperate Men (1951) AKA: The Daltons Last Raid / Three Outlaws\n\nBlack & White version: https://youtu.be/1MiPJ6muYKM\nThis film is is subtitled with many language options.\n\nDirector: Sam Newfield\nWriter: Orville H. Hampton\nStars: Preston Foster, Jim Davis, Virginia Grey\nGenres: Action, Crime, Western\n\n\n00:00 Full Movie (with subtitles)\n09:01 A mother and her sons discuss a burial, back pay, and outlaws in a Western setting.\n11:34 Injustice and betrayal unfold as brothers seek justice for a wrongfully convicted sibling in a train robbery case.\n17:31 Outlaws on the run face betrayal and pursuit after a wrongful accusation, leading to a desperate escape attempt.\n27:20 Outlaws plan to meet at a fishing cabin after committing crimes and being pursued by the law.\n37:50 Outlaws plan a train robbery to escape charges, but betrayal and guilt unravel their scheme.\n50:15 Outlaws plan a final heist in familiar territory as Thanksgiving approaches, with a former lawman on their trail.\n56:17 Outlaws plan a final heist but encounter unexpected obstacles and betrayal.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "44Sgd9xK18g",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:10.173Z"
}