{
  "movieId": "youtube-fvflcMMamig",
  "title": "Deputy Marshal (1949, Western) Frances Langford, Russell Hayden, Jon Hall | Classic Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fvflcMMamig",
      "id": "fvflcMMamig",
      "title": "Deputy Marshal (1949, Western) Frances Langford, Russell Hayden, Jon Hall | Classic Movie",
      "description": "Marshal Law Vs. 6-shooter Law!... In a terror-stricken town of ruthless rustlers!!\nTwo deputies from Texas travel to California to rescue their brother from the gallows, but after their daring escape, they find themselves hunted by the law and tempted by the allure of outlaw life, leading to a series of escalating crimes that shake the entire territory and threaten their own survival.\n\nOriginal title: Deputy Marshal (1949)\nThis film is is subtitled with many language options.\n\nColorized version: https://youtu.be/UpK5MNuIKq8\n\n\nDirector: William Berke\nWriters: William Berke, Charles Heckelmann\nStars: Jon Hall, Frances Langford, Dick Foran, Russell Hayden\nGenre: Classic Western film.\n\n\n00:00 Full Movie (with subtitles)\n03:40 Deputy Marshal Frances Langford encounters a shooting incident in a classic Western setting.\n13:19 Mysterious events unfold in a saloon as Garry is suspected of a murder he didn't commit.\n18:40 Mysterious encounter in a western town leads to a demand for a message and a hunt for two men.\n23:20 A deputy marshal is tasked with maintaining peace in a town by apprehending a wanted criminal.\n30:45 Deputy Marshal seeks information from suspects in a small town to solve crimes.\n38:19 Murder, deceit, and land disputes unravel in a small town as the deputy marshal investigates.\n46:29 Mystery unfolds in a classic western as Deputy Marshal investigates a ranch shooting and cattle rustling.\n51:58 A deputy marshal investigates a series of killings and uncovers a conspiracy involving gun purchases and cattle rustling.\n1:04:15 Deception, betrayal, and a wedding in a classic Western film.\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:29.100Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/fvflcMMamig/maxresdefault.webp?v=661dc52c",
      "duration": 4086,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:29.222Z"
}