{
  "imdbId": "youtube-yxa4oN4nmJk",
  "title": "Till the Clouds Roll By 1949 (Musical, Biography) Lena Horne, Frank Sinatra, Judy Garland",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yxa4oN4nmJk",
      "title": "Till the Clouds Roll By 1949 (Musical, Biography) Lena Horne, Frank Sinatra, Judy Garland",
      "description": "The mammoth musical of Jerome Kern's dramatic life story! \nBiography of songwriter, Broadway pioneer, Jerome Kern. Unable to find immediate success in the USA, Kern sought recognition abroad. He journeyed to England where his dreams of success became real and where he met his future wife Eva.\n\nOriginal title: Till the Clouds Roll By (1949) AKA: Silver Lining\n\nThis film is available with original english audio, and dubbed French, Portuguese & Spanish.  And subtitled in many more language options. \n\nDirectors: Richard Whorf, Vincente Minnelli\nWriters: Guy Bolton, George Wells\nStars: Robert Walker, Van Heflin, Lucille Bremer, Lena Horne, Frank Sinatra, Judy Garland, Angela Lansbury\nGenres: Classics, Biography, Musical\nBudget: $2,841,000 (estimated)\n\n\n00:00 Full Movie (with subtitles).\n00:01 🎵 Main Title, Show Boat Medley - The Jerome Kern Orchestra & Chorus.\n02:00 Musical journey showcasing life on the Mississippi river, backstage drama, and love stories through song and dance.\n19:23 Musical journey of a songwriter seeking guidance and inspiration from a renowned composer.\n23:45 A songwriter's journey to London, seeking success in the music industry, with the support of friends and family.\n34:36 🎵 How'day Like to Spoon With Me, Angela Lansbury.\n36:49 Musical film featuring a charming swing number and a composer meeting a producer.\n41:02 A man visits a woman's house and plays his songs on the piano, leading to a romantic conversation.\n44:58 🎵 They Didn't Believe Me, Dorothy Patrick.\n49:33 Musical journey of a composer striving for success in Broadway amidst personal and professional challenges.\n52:19 🎵 They Didn't Believe Me, Dinah Shore. (Reprise)\n58:24 Musical journey of a composer's life, culminating in love and success.\n1:00:00 🎵 Till The Clouds Roll By, Ray McDonald.\n1:07:59 Musical biography depicting the life and career of a successful composer and his relationships.\n1:08:32 🎵 Leave It to Jane & Cleopatterer, June Allyson.\n1:14:00 🎵 Look for the Silver Lining, Judy Garland.\n1:18:00 Challenges and decisions in a theater production affecting a young actress's role and aspirations.\n1:24:52 Struggles of a young performer in the theater industry and the impact on her relationships.\n1:27:43 🎵 Sunny Who? Judy Garland & The Jerome Kern Orchestra & Chorus.\n1:36:53 Musical journey of a songwriter facing loss and writer's block, finding inspiration through friendship and music.\n1:44:18 🎵 One More Dance, Lucille Bremer (dubbed by Trudy Erwin).\n1:45:30 🎵 I Won't Dance, Van Johnson & Lucille Bremer (dubbed by Trudy Erwin).\n1:49:20 Musical biography showcasing the journey of Sally and Uncle Jerry in the music industry.\n1:54:00 🎵 She didn't Say Yes, The Wilde Twins.\n1:55:54 🎵 The Last Time I Saw Paris, Dinah Shore.\n1:58:43 🎵 The Land Where the good Songs Go, Lucille Bremer (dubbed by Trudy Erwin).\n2:01:05 🎵 A Fine Romance, Virginia O'Brien.\n2:02:30 🎵 All The Things You Are, Tony Martin.\n2:04:28 🎵 Why Was I Born, Lena Horne.\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "yxa4oN4nmJk",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:05.011Z"
}