{
  "imdbId": "youtube-pTts6FN_sj4",
  "title": "JENNIFER LOPEZ in LILA & EVE (Thriller mit VIOLA DAVIS, ganzer Film in voller Länge auf Deutsch)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pTts6FN_sj4",
      "title": "JENNIFER LOPEZ in LILA & EVE (Thriller mit VIOLA DAVIS, ganzer Film in voller Länge auf Deutsch)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Powerfrauen JENNIFER LOPEZ (\"Out of sight\" & \"Genug\") & VIOLA DAVIS (\"The Help\" & \"How to get away with Murder\"): Lila trauert um ihren Sohn, der bei einer Schießerei starb. Gemeinsam mit Eve, deren Tochter in derselben Nacht getötet wurde, sucht sie Vergeltung. Doch ihre Rachepläne nehmen eine dunkle Wendung, als eine erschütternde Wahrheit ans Licht kommt...\n\nBLINDE RACHE - LILA & EVE (2015)\nOriginaltitel: Lila & Eve\nMit: Viola Davis, Jennifer Lopez, Shea Whigham\nRegie: Charles Stone III\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDer Sohn von Lila (Viola Davis) wurde bei einem Drive-By-Shooting erschossen. Um das zu verarbeiten, besucht Lila eine Therapie-Gruppe. Dort lernt sie Eve (Jennifer Lopez) kennen, deren Tochter in der gleichen Nacht getötet wurde. Die Ermittlungen der Polizei bringen einfach kein Ergebnis, es gibt keinen konkreten Tatverdächtigen, keine Beweisstücke. Lila fühlt sich von der Polizei zunehmend alleingelassen. Und so fasst sie einen Entschluss: Gemeinsam mit Eve macht sich Lila nun allein auf die Suche nach dem Mörder ihres Jungen. Um Gerechtigkeit zu erlangen, macht sie auch vor dem Äußersten nicht Halt und die Gewalt eskaliert. Zudem findet sie auch noch etwas gänzlich Unerwartetes heraus. Eine schockierende Wahrheit wartet auf Lila & Eve, die ihr gesamtes Leben für immer verändert...\nWer denkt, dass nur Männer ihr Schicksal in die eigenen Hände nehmen können, hat wohl das komplette 20. Jahrhundert verpennt. Denn wenn Frauen zu den Waffen greifen, dass wissen wir spätestens seit „Thelma & Louise“ oder „Lara Croft“, wird den Machos gehörig der Marsch geblasen. Und so ist es auch in dem provokanten Psychothriller „Lila & Eve“ über zwei Frauen auf einem schonungslosen Rachefeldzug, die alles tun, um Vergeltung zu üben und sich selbst um Gerechtigkeit kümmern. Und mit der zweifach Oscar-nominierten Viola Davis („How to Get Away with Murder“, „The Help“) und Superstar Jennifer Lopez („Out of Sight “, „U-Turn-Kein Weg zurück“) geht hier ein echt starkes Duo an den Start...\n#Netzkino #ganzerFilm #jenniferlopez \n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "pTts6FN_sj4",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}