{
  "imdbId": "youtube-Bo7THocbqMQ",
  "title": "Ich weiß, wer mich getötet hat (MYSTERY THRILLER mit LINDSAY LOHAN Filme Deutsch komplett neu 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Bo7THocbqMQ",
      "title": "Ich weiß, wer mich getötet hat (MYSTERY THRILLER mit LINDSAY LOHAN Filme Deutsch komplett neu 2025)",
      "description": "💙 Filme auf Deutsch & komplett kostenlos streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Mehrfach ausgezeichneter Mysterythriller mit LINDSAY LOHAN (\"Mean Girls\" & \"Freaky Friday\"): Eine junge Frau, die als vermisst galt, taucht wieder auf, behauptet jedoch, eine ganz andere Person zu sein...\n\nICH WEISS, WER MICH GETÖTET HAT (2007)\nOriginaltitel: I Know Who Killed Me\nMit: Lindsay Lohan, Julia Ormond, Neal McDonough, Spencer Garrett, Brian Geraghty\nRegie: Chris Sivertson\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nAubrey Fleming ist eine clevere High-School-Schülerin mit einer viel versprechenden Zukunft; sie lebt in einer intakten Familie, hat einen Freund und ihre Clique. Doch eines Nachts verschwindet sie plötzlich wie vom Erdboden... Zwei Wochen später wird sie schwer verletzt mitten im Wald gefunden: Aubrey war von einem brutalen Serienkiller entführt worden, konnte aber fliehen. Sie wird ins Krankenhaus gebraucht, wo sie vom FBI verhört wird. Doch sie kann sich an nichts erinnern und noch schlimmer: Ihre Eltern und Freunde müssen realisieren, dass sie ihre Identität leugnet und alles, was jemals zuvor in ihrem Leben passiert ist, offenbar vergessen hat. Die Ärzte vermuten hingegen, dass sie an einem post-traumatischen Stress-Symptom leidet und versuchen ihr Zeit zu geben. Doch die junge Frau beginnt tief in ihrem Unterbewusstsein zu spüren, dass sie erst den Killer finden muss, bevor sie das Rätsel um ihre Vergangenheit lösen kann...\n#Netzkino #ganzerFilm #LindsayLohan\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "Bo7THocbqMQ",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:58:45.666Z"
}