{
  "imdbId": "youtube-q-S06lKSCSs",
  "title": "Biggles: Adventures in Time 1986 (Sci-Fi, War) The Ultimate Weapon. The Ultimate Hero.",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q-S06lKSCSs",
      "title": "Biggles: Adventures in Time 1986 (Sci-Fi, War) The Ultimate Weapon. The Ultimate Hero.",
      "description": "Meet Jim Ferguson. He lived a daring double-life with one foot in the 20th century and the other in World War I.\nDaring British WWI fighter pilot James \"Biggles\" Bigglesworth and 1980s low-level business executive Jim Ferguson discover that they can time travel to each other's eras. They try to stop the Germans from changing the outcome of WWI.\n\nOriginal title: Biggles: Adventures in Time (1986)\n\nDirector: John Hough\nWriters: W.E. Johns, John Groves, Kent Walwin\nStars: Neil Dickson, Alex Hyde-White, Fiona Hutchison\nGenres: Adventure, Sci-Fi, War\n\n\n00:00 Full Movie (with subtitles)\n02:57 James Ferguson stumbles upon strange events and meets Biggles, a time traveler with a mission.\n10:34 A thrilling time-travel adventure thrusts James into World War I, filled with unexpected twists.\n22:59 Sent back in time, James must stop the enemy from changing history with a deadly secret weapon.\n31:17 Time-traveling agent Biggles faces dangerous foes and allies in a high-stakes mission during World War I.\n39:22 A wild time-travel adventure in World War I involves a psychiatrist, a nun's disguise, and a powerful weapon.\n49:59 A heroic pilot leads a daring escape, facing enhanced weapons and perilous skies in a thrilling chase.\n1:12:50 Amidst chaos, a daring mission to destroy a devastating weapon and protect civilians leads to a surprising wedding celebration.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "q-S06lKSCSs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:22.596Z"
}