{
  "imdbId": "youtube-rkUZss5GVKQ",
  "title": "They Were so Young 1954 | Colorized Crime Movie | Scott Brady, Raymond Burr | Subtitles added!",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rkUZss5GVKQ",
      "id": "rkUZss5GVKQ",
      "title": "They Were so Young 1954 | Colorized Crime Movie | Scott Brady, Raymond Burr | Subtitles added!",
      "description": "Their Hearts Were So High in the Clouds...They Never Knew Their Feet Were in the Dirt!\nA melodrama about young European models sent to South America to be used by crooks.\n\nOriginal title: Mannequins für Rio (1954) AKA;  They Were so Young \n\nOriginal black and white version https://youtu.be/dGxdxV5zdGw\n\nDirector: Kurt Neumann\nCasting: Scott Brady, Johanna Matz, Raymond Burr\nGenres: Colorized Classics, Crime, Drama, Mystery, Thriller\n\nsummary:\n A Mysterious Murder on Copacabana Beach Leads to International Intrigue, Misunderstandings at a Social Gathering, Frustrations and Fears of a Model, Recounting of Events and Potential Threats, Apologies and Reports of a Missing Person, Good News for Senor Coltos, Suspicion and a Broken Ferry, Past Conversations and a Missing Girl, Accusations, Evidence, and a Plan to Escape\n\n\nCCC Chapters:\n0:00:00 Full Length Movie\n01:21 🌊 A body of a young girl was found on the north side of Copacabana beach, and it is believed she was a foreigner. The case may be handed over to Interpol.\n07:13 Fashion show\n09:58: 😳 A conversation between multiple individuals takes place at a social gathering, with misunderstandings and tensions arising\n14:37 ...or you'll what?\n16:16 Mme. Lansowa-The penny drops\n23:42: 🔎 A person recounts a series of events involving a misunderstanding and a potential threat.\n31:51: 🔍 A person apologizes for interrupting and informs the listener that they went to the police and consulate after someone named Connie went missing.\n0:41:51 Raymond Burr's guest \n0:51:56 Bedtime \n1:01:47: 🔎 A man accuses someone of hiding a girl and provides evidence, including the location of a boat where the girl is being taken.\n1:10:41: 💼 A plan is made to distract a guard so that Connie can escape, \n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:45:11.470Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/rkUZss5GVKQ/maxresdefault.webp?v=6513da9a",
      "duration": 4663,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:45:11.598Z"
}