{
  "imdbId": "youtube-VWR47jTK0SM",
  "title": "Terror in the Midnight Sun (1959 monster film) John Carradine, Barbara Wilson | USA version",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VWR47jTK0SM",
      "title": "Terror in the Midnight Sun (1959 monster film) John Carradine, Barbara Wilson | USA version",
      "description": "Can earth stop the savage onslaught of beast-men from space?\nAliens release a furry critter in the wilds of Lapland where it takes a woman captive and threatens a group of scientists.\n\nColorized version: https://youtu.be/0BHNNX-vPSg\n\n\nOriginal title: Invasion of the Animal People (1959) AKA: Terror in the Midnight Sun\n\nDirector: Jerry Warren, Virgil W. Vogel\nWriters: Robert M. Fresco, Arthur C. Pierce\nStars: John Carradine, Barbara Wilson, Sten Gester, Robert Burton \nGenres: Cult Classic, Horror, Sci-Fi, Monster Movie\nBudget: $40,000 (estimated)\n\n\nOriginal Swedish version:  https://youtu.be/9pYWlOrBCbg\n\n\"Invasion of the Animal People\" was the title retained for the version distributed to television by Medallion. Some of the cut Swedish footage was restored and Jerry Warren shot additional scenes to pad the running time up to 81 minutes, nearly 12 minutes longer than the original version.\n\n\n00:00 Full Movie (with subtitles)\n00:13 Exploration of science, human limitations, and a mysterious seizure in a suburban community.\n09:45 Mysterious cases of hysteria and paranoia lead to a discussion about a possible connection to a past incident involving flying saucers and strange sounds.\n17:16 Scientists investigate mysterious transmissions and a possible extraterrestrial encounter in a remote village.\n23:13 Mysterious events unfold in a snowy village, involving a meteor, avalanche, and a charming geologist.\n34:30 Mysterious events unfold after a meteor crash in a remote location, prompting a team to investigate.\n47:44 A group stranded in snowy terrain faces communication challenges and a possible storm while searching for Dr. Wilson.\n57:51 A thrilling tale of survival and mystery unfolds in a remote village as a group faces a creature from another world.\n\n\n\nCopyrighted :\n\"The US cut Invasion of the Animal People is Public Domain, we own the original version worldwide in perpetuity. Contract with the original producer. We own it, and have the restored version thru the SFI, and will contest anyone claiming to own the film.\"\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "VWR47jTK0SM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:19.667Z"
}