{
  "movieId": "youtube-q14LyFajorA",
  "title": "The Over-the-Hill Gang (Western, 1969) Walter Brennan, Edgar Buchanan | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q14LyFajorA",
      "id": "q14LyFajorA",
      "title": "The Over-the-Hill Gang (Western, 1969) Walter Brennan, Edgar Buchanan | Movie",
      "description": "They will fight one last battle for justice ! (until the sequel)\nIn the wild and rollicking Old West town, a spirited young newspaper editor takes on the corrupt \"tinhorn\" mayor, backed by a trigger-happy sheriff and whiskey-soaked judge.  As his campaign gains traction, the editor is joined by a former Texas Ranger and three formidable straight shooters, igniting a riotous showdown. Filled with charm, wit, and a sprinkle of frontier justice.\n\nOriginal title:  The Over-the-Hill Gang (1969)\nThis film is available with English & Spanish audio.  And subtitles in many more language options.\n\nDirector: Jean Yarbrough\nWriters: Jameson Brewer, Leonard Goldberg \nExecutive producer: Aaron Spelling \nStars: Walter Brennan, Edgar Buchanan, Andy Devine, Jack Elam & Gypsy Rose Lee\nGenres: Comedy, Western\n\n\n00:00 Full Movie (with subtitles)\n00:07 Meeting old acquaintances in a small town, discussing political campaigns and revealing hidden truths.\n05:53 Elderly cowboys reminisce about past adventures and face off against a dangerous outlaw in a small town.\n12:31 Retired Texas Ranger called to action by former captain's urgent message, embarks on journey to Nevada.\n16:08 A group of men, including George Agnew, faces challenges and adventures in the Old West.\n20:56 A group of men prepare for a showdown in a town with corrupt officials and a upcoming election.\n24:50 A group of retired Rangers faces off against a corrupt sheriff in a peaceful town, leading to a showdown.\n32:43 Retired Rangers plan to confront a villain, reminisce about past battles, and strategize using their intelligence.\n36:28 Old friends reunite for a mission involving deception, law enforcement, and political manipulation in a small town.\n41:14 Summary of a western movie involving poker, deception, and political schemes in a small town before an election.\n45:57 A group of men discuss a corrupt mayor and a plan to expose him before the election.\n52:28 A group of dangerous gunslingers join forces to outsmart a corrupt politician in a Western movie.\n58:23 Elderly gang led by Hayes fights lawlessness in town, gains support, and restores peace.\n1:06:15 Retired cowboys reminisce about past adventures and plan future meet-ups in the Wild West.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:12.982Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/q14LyFajorA/maxresdefault.webp?v=65f267db",
      "duration": 4207,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2026-01-11T21:16:20.054Z"
}