{
  "imdbId": "youtube-TE2FjqeJgxQ",
  "title": "Shotgun (1955, Western Movie) with Yvonne De Carlo, Sterling Hayden | Directed Lesley Selander",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TE2FjqeJgxQ",
      "title": "Shotgun (1955, Western Movie) with Yvonne De Carlo, Sterling Hayden | Directed Lesley Selander",
      "description": "They were Three of a Kind...ALL BAD!\nMarshal Clay Hardin (Sterling Hayden) vows to avenge his fellow marshal's murder. He forms a team with bounty hunter Reb Carleton (Zachary Scott) and Abby (Yvonne De Carlo). Tracking the killer leads them into Apache territory, where they uncover a plot to arm the Indians. Hardin and his companions must now face a deadly threat from both the outlaws and the Native Americans.\n\nOriginal title: Shotgun (1955)\nAlternative titles:  Son Dernier Combat, Ritt in die Hölle, Amour, fleur sauvage, Canne infuocate, La pradera sangrienta, Escreveu Seu Nome a Bala, O Vingador,  死闘の丘, Για να σκοτώσεις, χρειάζεται θάρρος, \n\nDirector: Lesley Selander\nWriters: Clarke Reynolds, Rory Calhoun, John C. Champion\nBudget: $260,000 (estimated)\n\nMain Cast:\nSterling Hayden as Marshal Clay Hardin\nYvonne De Carlo as Abby\nZachary Scott as Reb Carleton\nRobert J. Wilke as Bentley\n\n\n00:00 Full movie (with subtitles)\n05:14 Ben Thompson hunts down Marshals Clay Hardin and Mark Fletcher, sparking a tense standoff in a small town.\n10:40 A deadly plan to take down a notorious outlaw goes wrong, forcing a life-or-death escape.\n18:54 Betrayal and danger strike as the group faces off against deadly foes in the Wild West.\n34:15 The Arizona Territory turns hostile as characters struggle to survive in a lawless land.\n38:31 With Apache threats looming, a showdown with the dangerous Hardin ignites personal conflicts.\n46:45 Betrayal, revenge, and survival collide in a deadly battle for loyalty in the Wild West.\n58:20 Loyalties crumble as a vengeful pursuit pushes everyone to their limits.\n1:04:11 Clay and Reb’s fierce face-off over stolen gold erupts into a deadly gunfight.\n1:13:58 Clay confronts Delgadito in a high-stakes clash over the fate of a kidnapped girl.\n\n\n@CultCinemaClassics",
      "id": "TE2FjqeJgxQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:34:14.847Z"
}