{
  "movieId": "youtube-2zaHwl-3dMg",
  "title": "McCanick: Bis in den Tod -  Ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2zaHwl-3dMg",
      "id": "2zaHwl-3dMg",
      "title": "McCanick: Bis in den Tod -  Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Film “McCanick: Bis in den Tod”, online und in ganzer Länge bei #Moviedome sehen. Ein Action-Thriller mit spannendem Katz-und-Maus-Spiel zwischen einem Ex-Häftling und dem Drogenfahnder Eugene „Mack“ McCanick.  ►https://bit.ly/MoviedomeAbo\n\n\nJetzt “McCanick” als ganzen Film in Deutsch sehen.\n\n\nIn diesem starbesetzten Thriller beeindruckt David Morse als in die Jahre gekommener Drogenfahnder und der 2013 verstorbene Jungschauspieler Cory Monteith als Ex-Häftling auf freiem Fuss in einem gnadenlosen Kampf.\n\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: ►https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme: www.moviedome.de\n\n\nFolge uns auf unseren Social Media-Kanälen!\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de\n\n\n#Moviedome #McCanick #GanzerFilm\n\n\n\nFilmlänge: 96 Minuten\nErscheinungsjahr: 2015\n\n\nWer sind die Schauspieler?\nDie Darsteller werden von folgenden Schauspielern verkörpert: \nDavid Morse (bekannt aus True Detective, World War Z und Disturbia) in der Rolle des Eugene „Mack“ McCanick.\nCory Monteith (bekannt aus Glee, Unsichtbar – Zwischen zwei Welten, Final Destination 3)  in der Rolle des Simon Weeks.\nMike Vogel (bekannt aus Under the Dome, Der perfekte Ex, Cloverfield)  in der Rolle des Floyd Intrator\nRachel Nichols (bekannt aus Chicago Fire, Conan, Criminal Minds, G.I. Joe – Geheimauftrag Cobra) in der Rolle der Amy Intrator\nTrevor Morgan (bekannt aus Brotherhood – die Bruderschaft des Todes, The Glass House, Jurassic Park III) in der Rolle des Louis\nAaron Yoo in der Rolle des Carl\nTracie Thoms in der Rolle der Sister Alice\nCiaran Hinds in der Rolle der Quinn\n\n\nDie Handlung von “McCanick: Bis in den Tod”\nDer klein-kriminelle Simon Weeks (Cory Monteith) wird nach sieben Jahren aus dem Gefängnis entlassen. Das stößt auf Unverständnis des in die Jahre gekommenen Drogenfahnders Eugene \"Mack\" McCanick (David Morse), der einst zusammen mit seinem Boss Quinn für dessen Verhaftung verantwortlich war. Doch Weeks kennt ein dunkles Geheimnis aus Macks Vergangenheit. Also hängt Mack sich zusammen mit seinem Partner Floyd an dessen Fersen.\n\nDie Synchronisation \nRachel Nichols; Sprecherin: Simona Pahl\nDavid Morse; Sprecher: Helmut Gauß\n\n\n“McCanick: Bis in den Tod” ist mit Untertiteln auf diesem Kanal nicht verfügbar.\n\n\nBeschreibung:\nJetzt Film und Trailer kostenlos auf Deutsch schauen\nMcCanick: Bis in den Tod I Trailer I 2015 I Alle Filminfos",
      "addedAt": "2025-12-26T00:36:21.496Z",
      "thumbnail": "https://i.ytimg.com/vi/2zaHwl-3dMg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDkdDIphzp2Z9yM1tin3OPxfE0slA",
      "duration": 5778,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:36:21.574Z"
}