{
  "imdbId": "youtube-pJlcETFg4-0",
  "title": "The Brothers O'Toole (Western, 1973) John Astin, Pat Carroll | Movie, Subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pJlcETFg4-0",
      "title": "The Brothers O'Toole (Western, 1973) John Astin, Pat Carroll | Movie, Subtitles",
      "description": "The brothers, a couple of ne'er-do-wells, turn a sleepy mining town upside-down in their search for quick riches.\n\nOriginal title: The Brothers O'Toole (1973)\n\nThis film is subtitled in many languages.\n\nDirector: Richard Erdman\nWriters: Marion Hargrove, Tim Kelly\nStars: John Astin, Pat Carroll, Hans Conried \nGenres: Comedy, Western\n\n\n00:00 Full Movie (with subtitles)\n02:41 A humorous Western film involving family dynamics, deception, and a quest for help in a small town.\n09:59 A wild west showdown and arrest unfolds in a small town, involving a notorious criminal and the local sheriff.\n16:47 Humorous interactions unfold in a Western town involving a man named O'Toole and various characters.\n27:49 A town prepares for a hanging while discussing the upcoming trial and the condemned man.\n34:38 A man named Michael is mistaken for his brother, leading to a series of misunderstandings and accusations.\n41:25 A humorous Western movie involves a plot to escape from prison and a valuable discovery.\n55:14 Legal proceedings in a Western film involve accusations of bank robbery, assault, and conspiracy, with a defendant represented by a lawyer.\n56:43 Legal proceedings involving a bar prisoner, a disruptive witness, and a mysterious financial scandal unfold in a courtroom drama.\n1:03:05 Discussions about an idea of opening a potential casino or  a gambling hall causes chaos and excitement in a small town\n1:11:38 A simple-looking gunslinger, financial advisor, and a marriage proposal.\n1:31:24 A man named O'Toole is urged to marry a girl, while encountering various characters and music performances.\n\n\n@CultCinemaClassics \nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "pJlcETFg4-0",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:37.190Z"
}