{
  "imdbId": "youtube-V3ingImxBx4",
  "title": "Highway Patrol / Motor Patrol 1950 (Thriller, Crime) directed by Sam Newfield |Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=V3ingImxBx4",
      "title": "Highway Patrol / Motor Patrol 1950 (Thriller, Crime) directed by Sam Newfield |Colorized Movie",
      "description": "The Signals Changed to CRIME When a Terror Gang Hit the Road...\nA cop poses as a member of a stolen-car ring to capture the men responsible for the murder of his fiancee’s brother.\n\nOriginal title: Motor Patrol (1950) AKA: Highway Patrol\n\nBlack & White version: https://youtu.be/3Du_Mk5-SKw\n\n\nDirector: Sam Newfield\nWriters: Maurice Tombragel, Orville H. Hampton\nStars: Don Castle, Jane Nigh, Reed Hadley\nGenres: Comedy, Crime, Drama, Thriller\n\nThis film is subtitled in many languages.  Click ⚙️ for more options\n\n00:00 Full Movie\n05:51 Highway Patrol officers investigate a hit and run incident involving a young man. The incident leads to questions and concerns among the people involved.\n09:04 Fatal incident investigation reveals surprising details about the victim's life and associates.\n14:19 Undercover investigation of a crime scene involving a hit-and-run, arguments, and a suspicious death at a cafe.\n19:19 A series of events unfold as a man tries to get a refund from a phone operator, leading to a conversation about a mysterious death and a stolen car.\n25:38 Police investigation into a stolen car leads to a homicide case involving a young hood from Chicago. Larry's death is linked to Thompson's, and Ken Foster offers to help solve the case.\n34:17 Undercover detective investigates a car theft operation linked to a garage owner and a criminal organization.\n41:57 Crime investigation reveals car theft and murder connections in a thrilling plot.\n47:26 Undercover operation uncovers stolen car racket and potential suspect in hit-and-run case.\n55:44 Undercover operation reveals car theft and hit-and-run scheme, leading to arrests and a new career opportunity.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "V3ingImxBx4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:39:01.843Z"
}