{
  "imdbId": "youtube-d6sCwH0YTLg",
  "title": "They won't stay dead!: Night of the Living Dead (1968) Colorized Full Movie",
  "year": 1968,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=d6sCwH0YTLg",
      "title": "They won't stay dead!: Night of the Living Dead (1968) Colorized Full Movie",
      "description": "They keep coming back in a bloodthirsty lust for HUMAN FLESH!...\nThere is panic throughout the nation as the dead suddenly come back to life. The film follows a group of characters who barricade themselves in an old farmhouse in an attempt to remain safe from these bloodthirsty, flesh-eating zombies.\n\nOriginal title: Night of the Living Dead (1968)\nColorized movie\n\nBlack & White version: https://youtu.be/l-FGlw6jWgQ\n\nThis film is available with French, German, Italian, Portuguese & Spanish dubbed audio. 👉 go to video settings ⚙️  to change your audio / subtitle language options.\n\nDirector: George A. Romero\nWriters: John A. Russo  George A. Romero \nStars: Duane Jones, Judith O'Dea, Karl Hardman \nGenres: Classics, Cult Film, Horror, Thriller\nBudget:$114,000.  Gross: $236,452\n\nSummary: Terrifying Encounters with Unidentified Killers, Unfolding Crisis of Violent Events and Cannibalism, Safety Measures and Differences in Opinions, Radio and Television Broadcasts on Murders and the Undead, Connection Between Radiation and Mutations, Plans to Escape and Destroy Infected Bodies,  Escape Flesh-Eating Monsters, Authorities' Progress, Strategies, and Challenges in Controlling Killers.\n\n00:00  Full Movie\n00:38  A group of people discuss their plans and concerns while trying to protect themselves from an unknown threat.\n05:13   Barb & Johnny in the cemetery\n11:44   He's still coming to get you Barbara\n25:24  A person recounts a terrifying encounter with a group of unidentified killers during an epidemic of mass murders.\n33:47  A crisis is unfolding with reports of violent events and cannibalism, prompting the President to assemble his cabinet and call in the F.B.I.\n42:40  A discussion about safety measures and differences in opinions during a crisis.\n50:44  A group of people discuss the radio and television broadcasts about murders and the undead, and contemplate their options for survival.\n58:35  Discussion about the connection between radiation and mutations, plans to escape and destroy the infected bodies.\n1:03:40  A group of people discuss their plans to unlock a door, find gas, and escape to a reception center amidst a catastrophic event involving flesh-eating monsters.\n1:18:48  Authorities discuss the ongoing situation, including progress, strategies, and challenges in controlling the killers.",
      "id": "d6sCwH0YTLg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:40:44.783Z"
}