{
  "imdbId": "youtube-VTIOShyXvcg",
  "title": "여섯개의 시선 (2003) / If You Were Me (Yeoseotgae-ui Siseon)",
  "year": 2003,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VTIOShyXvcg",
      "title": "여섯개의 시선 (2003) / If You Were Me (Yeoseotgae-ui Siseon)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/06064\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/06064\n\n감독(Director) : 임순례(Lim Soon-rye), 정재은(Jeong Jae-eun), 여균동(Yeo Kyun-dong), 박진표(Park Jin-pyo), 박광수(Park Kwang-su), 박찬욱(Park Chan-wook)\n출연(Cast) : 이설희(Lee Seul-hee), 이진숙(Lee Jin-sook), 배장수(Bae Jang-su), 주진모(Joo Jin-mo), 조한희(Jo Han-hui) \n\n줄거리 :   \n그녀의 무게-여상에 다니는 선경은 몸무게도 많이 나가고 얼굴도 그다지 예쁘지 않은 평범한 학생이다. 3학년이 되자 취업을 위해 몸매를 관리하라고 닥달하는 선생님들의 성화가 시작되고 학생들도 성형수술을 하는 등의 노력을 한다. 선경은 쌍꺼풀 수술을 하거나 단식원에 가기를 원하지만 무심한 엄마는 선경의 청을 거절한다. 선경은 쌍꺼풀 수술을 하기 위해 위험한 결단을 내리게 되는데...\n그남자의 사정-시공간이 모호한 신도시의 주거형 아파트, 4각의 건축모형인 이 아파트는 가운데의 공간이 뚫려 있어 어디서든지 주민들의 행동거지가 한눈에 보이는 신개념의 공간이다. 이 아파트에는 최근 가상의 성범죄 사이트에서 신상이 공개된 A모씨가 살고 있다. 이웃으로부터 심하게 왕따를 당하는 A모씨에게 유일한 관심을 갖는 이는 이웃의 오줌싸개 아이. 밤마다 이불에 오줌을 싸는 아이는 옷을 벗긴 채 소금을 받아오라는 엄마의 형벌을 받는다. \n대륙횡단-김문주라는 한 뇌성마비 2급 장애인의 일상적인 사건, 감정, 기록을 열세편의 짧은 장면으로 구성한 영화. 장애인 이동투쟁으로 잡혀간 친구를 생각하며 홀로 광화문 네거리를 무단으로 횡단하는 장면은 다시 한번 장애인의 조그만 외침을 마주하게 된다.\n신비한 영어나라-서울에 있는 한 명문 유치원에서는 크리스마스 발표회가 한창이다. 여섯 살 종우는 부모들의 바램에 부응하듯 아주 멋지게 영어로 발표하고 있다. 하지만 종우의 엄마는 어쩐지 만족스럽지가 않다. 종우의 영어 발음이 외국아이들에 비해 좀 떨어지는 것 같이 들린 것이다. 그로부터 3년 후, 종우는 한 어린이치과 수술대 위에 누워있다. 약간의 아픔이 따르겠지만 L발음과 R발음을 향상시키기 위함이다. 과연 엄마의 생각대로 종우의 장밋빛 미래는 순탄하게 펼쳐질 것인가?\n얼굴값-서울의 한 병원에 위치한 장례식장의 주차장. 주차 매표 요원인 여자와 주차를 하기 위한 운전자 사이에서 시비가 붙는다. 이 여자의 직업이 외모에 어울리지 않는다는 남자의 생각에서 출발한 하찮은 실랑이는 결국은 '얼굴값 한다'는 수준으로까지 이어진다. 한편, 실랑이가 끝날 무렵, 영구행렬이 지나가는 차의 영정, 스치듯 내뱉는 남자의 한마디. '죽기엔 아까운 얼굴이야!'\n믿거나 말거나, 찬드라의 경우-1999년, 서울의 한 섬유공장에서 보조 미싱사로 일하던 네팔 노동자 찬드라 구룽은 공장 근처 식당에서 라면을 시켜 먹는다. 뒤늦게 지갑이 없는 사실을 안 찬드라는 계산을 하지 못하고, 식당 주인은 그를 경찰에 신고한다. 경찰은 한국어를 더듬는 찬드라를 행려병자로 취급해, 결국 6년 4개월 동안 정신병원에 수감된다.\n\nSynopsis: \nThe Weight of Her. Seon-gyeong is a plain, overweight girl who goes to a commercial high school. As she becomes a senior at school, teachers are always telling the girls to lose weight, and some of her classmates have plastic surgery. Seon-gyeong wants to get plastic surgery on her eyes or to enter a fasting house, but her mother says no. Seon-gyeong makes a risky decision to make enough money for her plastic surgery.\nThe Man’s Affairs. The residential apartment in the newly built city is square and the center is left empty. Thus, one can see everything that his neighbor is doing. One of the residents of this apartment is Mr. A whose personal information had been disclosed at a virtual sex crime related site. He is ignored by all his neighbors except a bed wetter boy living in the neighborhood. The boy, who wets his bed every night, is stripped and told to go to his neighbors and ask for a bowl of salt as punishment from his mother.\nCrossing. 13 short scenes of the life, emotions and records of Kim Mun-ju, who has 2nd degree cerebral palsy. The scene where he crosses the Gwanghwamun crossroad alone, thinking of his friend who had been arrested while demonstrating for the rights of the handicapped, is a small outcry of the handicapped people in our society.\nTongue Tie. At a highly reputed kindergarten in Seoul, the children are giving their Christmas performance. Six-year-old Jong-wu is giving his speech in English, and he is very good. But somehow, his mother doesn’t seem to be very pleased. She thought her son’s pronunciation was not as fluent as foreign children. Three years later, Jong-wu is sitting at a dentist’s. Though it will hurt a little, it is to improve his pronunciation of L and R, he is told. Will Jong-wu’s future be as bright as his mother hopes it to be?\nFace Value. It is the parking lot of a funeral ceremonial hall attached to a hospital. The woman at the parking lot ticketing booth and the driver are quarreling. It was started by the man’s comment that her looks didn’t match with her job. Finally the man says that she is ‘acting out her pretty face.’ As their argument is drawing to an end, an obituary car passes by with a portrait of the deceased. The man blurts out “that face is a waste to have died.”\nN.E.P.A.L. In 1999 Seoul, Chandra Gureung who came from Nepal was working at a sweat shop as an assistant. In a nearby diner he orders ramen. Later he discovers that he doesn’t have his wallet, and the owner reports him to the police. The police think he is a sick homeless person when he stutters trying to speak in Korean, and he is committed to a mental institution for six years and four months.",
      "id": "VTIOShyXvcg",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:33.490Z"
}