{
  "movieId": "youtube-LfxIfK8ThFc",
  "title": "Aimless Bullet ( Obaltan )(1961) Restoration",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LfxIfK8ThFc",
      "id": "LfxIfK8ThFc",
      "title": "Aimless Bullet ( Obaltan )(1961) Restoration",
      "description": "TBS 영화해설 : https://www.youtube.com/watch?v=AnqOF9xWRvY\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00641\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00641\n\n영화글 : https://www.kmdb.or.kr/story/10/1880\n\n감독(Director) : 유현목(Yoo Hyeon-Mok)\n출연 : 김진규(철호),최무룡(영호),서애자(명숙),김혜정,노재신(어머니),문정숙(아내),윤일봉,유계선,남춘역,박경희,고설봉,지방열,최명수,이룡,이경천,박춘,서경희,이지나,최길호,김승,최백,최성,송경삼,박원,유용환,최건,김미숙,문혜란,이대엽\n\n줄거리 : 계리사 사무소 서기인 철호(김진규)는 전쟁통에 미쳐 “가자!”를 외치는 어머니(노재신), 영양실조에 걸린 만삭의 아내(문정숙)와 어린 딸, 양공주가 된 여동생 명숙(서애자), 실업자인 퇴역군인 동생 영호(최무룡), 학업을 포기하고 신문팔이에 나선 막내 동생 민호를 거느린 한 집안의 가장이다. 그러나 계리사의 월급으로는 한 가족을 먹여 살리기도 빠듯해, 철호는 치통을 앓으면서도 치과에 갈 엄두를 못 낸다. 영호는 비관적인 현실을 타개하기 위하여 은행 강도를 저지르지만 실패한다. 철호는 경찰로부터 영호가 은행을 털다 붙잡혔다는 전화를 받는다. 영호를 면회하고 집으로 돌아온 철호는 아내가 아이를 낳으려고 한다는 소식을 듣고 병원으로 가지만 아내는 숨을 거둔 뒤다. 잇따른 불행에 좌절한 철호는 아내의 시신을 보지도 않고 병원을 나와 길거리를 방황하다 치과에 들러 이를 뺀다. 발치에 따른 출혈과 고통으로 몸을 제대로 가누지 못하는 철호는 택시에 올라타 무기력하게 “가자”고 중얼거린다.\n\nCasts : Choi Mu-Ryong,Kim Jin-Kyu,Moon Jeong-Suk,Seo Ae-Ja,Kim Kye-Jeong\n\nSYNOPSIS : Cheol-ho (Kim Jin-kyu) is a clerk at a CPA office, who lives with his mother (Noh Jae-sin), his pregnant wife (Moon Jung-suk), a younger sister (Seo Ae-ja), and a younger brother (Choi Moo-ryong). His life is hard with his mother who became deranged during the war and always screams \"Let's go!\" His wife is pregnant but malnourished, his sister is a prostitute for foreigners and his younger brother is an unemployed veteran. However, it is difficult to take care of his family along with his salary. Even with a terrible toothache, going to the dentist isn't an option for him. One day, he receives a phone call from the police saying that his younger brother Yeong-ho was arrested for robbing a bank. When he returns from the police station, he hears the news that his wife is just about to deliver a baby. He heads for the hospital right away but his wife has already died from giving brith. Deeply despaired, Cheol-ho leaves the hospital without even seeing his wife's dead body and wanders around the street. Then he goes to the dentist and gets his rotten tooth pulled out. Cheol-ho cannot manage himself because of blood and pain in his mouth and gets in a taxi. Wearily, he mumbles, \"Let's go.\"",
      "addedAt": "2025-12-26T00:23:15.828Z",
      "thumbnail": "https://i.ytimg.com/vi/LfxIfK8ThFc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAh2V28Hv3BkW9FmtfdcHTD8wOEqA",
      "duration": 6440,
      "language": "ko",
      "year": 1961,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:15.841Z"
}