{
  "imdbId": "youtube-CRWNXvopX2U",
  "title": "Devil's Partner (1960 Horror) Half man, half beast-- he sold his soul for passion! 4K",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CRWNXvopX2U",
      "id": "CRWNXvopX2U",
      "title": "Devil's Partner (1960 Horror) Half man, half beast-- he sold his soul for passion! 4K",
      "description": "An old hermit (Ed Nelson) who lived outside of dusty Furnace Flats New Mexico, dies, and his nephew, Nick (also Nelson), arrives in town.  A wave of eerie omens, cursed creatures, and arcane forces sweeps through the town—along with his growing obsession for Nell (Jean Allison). As Doc Lucas (Edgar Buchanan) unearths sinister signs of sorcery, it’s clear Nick’s charm is cloaked in something far more unholy than meets the eye.\n\nAlternative title: Enter the Devil (1960)\n\nColorized version: https://youtu.be/fZOn-lUl91Q\n\n\nDirector: Charles R. Rondeau\nWriters: Stanley Clements, Laura Jean Mathews\nActors: Ed Nelson, Edgar Buchanan, Jean Allison, Richard Crane\n\nGenres: Supernatural, Horror\nRelease date: 1961 (USA)\nFilming location: Los Angeles, California\n\n\n00:00 Full Movie with subtitles \n04:20 Nick Richards arrives in Furnace Flats and inherits his uncle Pete’s mysterious cabin.\n08:47 Nick secretly performs a dark ritual, summoning evil forces in the desert night.\n16:32 Doc Lucas investigates a series of bizarre animal attacks that unsettle the townsfolk.\n25:10 Nell Lucas confides in David Simpson about her growing fears for Nick’s strange behavior.\n34:55 Nick manipulates Nell with supernatural powers, deepening his hold over her.\n46:18 Sheriff Tom tracks a trail of violence back to Nick’s cabin and uncovers occult evidence.\n56:03 David confronts Nick in a dramatic showdown as the town’s secrets unravel.\n1:07:20 Nell and David escape the burning cabin, breaking Nick’s evil influence forever.\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:30:40.186Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/CRWNXvopX2U/maxresdefault.webp?v=68421152",
      "duration": 4432,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:30:40.296Z"
}