{
  "movieId": "youtube-O5aQimEN84E",
  "title": "Compañeros (Western, 1970) with Franco Nero, Tomas Milian | a Sergio Corbucci movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=O5aQimEN84E",
      "id": "O5aQimEN84E",
      "title": "Compañeros (Western, 1970) with Franco Nero, Tomas Milian | a Sergio Corbucci movie",
      "description": "Death was their trademark, money their code of honor.\nA Swedish arms dealer and a Mexican peon team up to rescue the intellectual leader of the Revolutionary cause, while taking part in numerous misadventures along the way.\n\nWatch the uncensored version: https://youtu.be/vsgQrCxl30k\n\n\nOriginal title: Vamos a matar, compañeros (1970)\nAlternative titles: Companeros, Död åt companeros, Companheiros, Lasst uns töten, Laßt uns töten, Les compagnons de la gloire, 꼼빠네로스, Los compañeros, Zwei Companeros, Egy kincskereső Mexikóban, ガンマン大連合, Комбина, Напарники, Οι κομπανέρος, 同伴, 황야의 동업자\n\nThis film is available with English audio and subtitles in many languages.\n\nDirector: Sergio Corbucci\nWriters: Dino Maiuri, Massimo De Rita, Günter Ebert\nStars: Franco Nero, Tomas Milian, Fernando Rey\nGenres: Action, Comedy, Spaghetti Western\n\n\n00:00 Full Spaghetti Western Movie\n02:16 The arrival of a mysterious Swedish arms dealer nicknamed \"The Penguin\" in Mexico\n15:25 The Penguin meets General Mongo and negotiates a deal to retrieve Professor Xantos from Fort Yuma.\n49:41 Professor Xantos is rescued from Fort Yuma during a carefully orchestrated prison break.\n1:13:58 A dramatic chase ensues as government forces pursue Xantos and his rescuers through the desert.\n1:29:13 General Mongo threatens to execute twenty prisoners unless Professor Xantos surrenders himself.\n1:35:17 Professor Xantos arrives to confront General Mongo in a tense standoff.\n1:43:28 The final battle begins at San Bernardino as revolutionaries clash with government forces.\n1:47:41 The Penguin must make his final choice between leaving with the money or staying to fight for the revolution.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdaYxUUeZrLnntVqlM4qijQM\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:48.131Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/O5aQimEN84E/maxresdefault.webp?v=66ed416c",
      "duration": 6615,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:48.294Z"
}