{
  "imdbId": "youtube-GJ-TQFtoNyw",
  "title": "Die kleine Meerjungfrau (GANZER FANTASYFILM auf Deutsch, Fantasy Familienfilme, ganzer Film 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GJ-TQFtoNyw",
      "title": "Die kleine Meerjungfrau (GANZER FANTASYFILM auf Deutsch, Fantasy Familienfilme, ganzer Film 2025)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Auf der Suche nach einer Sensation entdeckt ein Reporter eine gefangene Meerjungfrau – und mit ihr eine Geschichte, die sein Leben für immer verändert.\n\nDIE KLEINE MEERJUNGFRAU (2018)\nOriginaltitel: The Little Mermaid\nMit: William Moseley, Poppy Drayton, Loreto Peralta\nRegie: Blake Harris, Chris Bouchard\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nDer junge Reporter Cam Harrison (William Moseley) wird von seinem Boss auf eine unglaubliche Geschichte aufmerksam gemacht: Meerjungfrauen soll es wirklich geben und eine davon wurde in einem Zirkus in einer kleinen Stadt entdeckt. Obwohl Cam nicht an solche Fabelmärchen glaubt, macht er sich, begleitet von seiner neugierigen Nichte Elle (Loreto Peralta), auf dem Weg zum Zirkus. Dort treffen sie tatsächlich auf die Meerjungfrau Elizabeth (Poppy Drayton), gefangen in einem kleinen Wassertank. Das wunderschöne Wesen erzählt den beiden ihre traurige Geschichte. Cam ist von der geheimnisvollen Meerjungfrau fasziniert und enthüllt eine Legende, die so mysteriös ist, wie der Zirkus selbst, in der sie die Meerjungfrau vorfinden.\n#Netzkino #ganzerFilm #Abenteuer\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "GJ-TQFtoNyw",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}