{
  "imdbId": "youtube-fRBSQDofYr0",
  "title": "Marcel Pagnol | Yacout (1934 film) Nagib El-Rihani, Aimée Provence, Badi Khayri | French-Arabic",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fRBSQDofYr0",
      "id": "fRBSQDofYr0",
      "title": "Marcel Pagnol | Yacout (1934 film) Nagib El-Rihani, Aimée Provence, Badi Khayri | French-Arabic",
      "description": "Egyptian version of a popular play by French writer Pagnol. A timid and naive schoolteacher is taken advantage of. A wealthy aristocrat uses him in a money making scheme and the teacher now seems to enjoy the new corruption.\n\nOriginal title: Yacout (1934)\n\n\nBlack & White version: https://youtu.be/dKcyIiaKGNk\n\nDirectors: Nagib El-Rihani, Willy Rozier\nWriters: Marcel Pagnol, Nagib El-Rihani, Badi Khayri\nStars: Nagib El-Rihani, Aimée Provence, Badi Khayri\nGenres: Colorized, Literary, Comedy, Drama\nLanguages: Arabic - French\n\n\n00:00 Full colorized movie. \n04:32 Exploration of a comedic and musical scene with characters discussing wealth, happiness, and societal expectations.\n16:56 Interactions between characters in a comedic and light-hearted manner in a multi-lingual setting.\n23:41 A comedic conversation between two characters discussing various topics and making jokes.\n30:48 A summary of a French-Arabic film featuring Nagib El-Rihani and Aimée Provence with comedic and dramatic elements.\n47:55 Discussion and banter between characters in a French-Arabic film scene.\n1:01:59 Interactions and misunderstandings unfold between characters in a comedic setting involving drinking, dancing, and social etiquette.\n1:11:48 Interpersonal conflicts and misunderstandings arise during a conversation about responsibilities and travel plans.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:31.379Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/fRBSQDofYr0/maxresdefault.webp",
      "duration": 4754,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:31.513Z"
}