{
  "movieId": "youtube-Qe-EL72kQ1k",
  "title": "Sinners in Paradise 1938 (Drama, Romance) Madge Evans, John Boles, Bruce Cabot",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Qe-EL72kQ1k",
      "id": "Qe-EL72kQ1k",
      "title": "Sinners in Paradise 1938 (Drama, Romance) Madge Evans, John Boles, Bruce Cabot",
      "description": "A seaplane departs for China. \nOn board are a nurse escaping a loveless marriage to do work with refugees, a woman hoping to surprise her estranged son, a wealthy heiress trying to distance herself from labor troubles, an oily politician, a moll and a mobster fleeing the wrath of the gangs they've double-crossed, two rival munitions salesmen out to cash in on the misery of war, and a fresh-faced young steward.  Are caught in a course-altering storm, a crash-landing destroys the plane, kills the plane's officers, and tosses the surviving passengers into the sea. They are washed ashore on an isolated island inhabited solely by mysteriously reclusive Mr. Taylor and his servant, Ping. Until Taylor decides if, how and when he will allow them to take his boat back to China for help, this disparate band must work together, change their self-centered ways, and examine their motives for wanting to escape from the island and their pasts.\n\nColorized version https://youtu.be/Q6rUC5ISwL4\n\n\nOriginal title: Sinners in Paradise (1938) \nThis film is subtitled in many languages.\n\nDirector: James Whale\nWriters: Lester Cole , Harold Buckley \nStars: Madge Evans, John Boles, Bruce Cabot \nGenres: Classics, Adventure, Drama, Romance\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:30.768Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Qe-EL72kQ1k/maxresdefault.webp?v=66400de7",
      "duration": 3801,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:30.881Z"
}