{
  "imdbId": "youtube-choJioh1IRg",
  "title": "John Wayne | Paradise Canyon 1935 (Colorized Western) Classic Cowboy Movie | subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=choJioh1IRg",
      "id": "choJioh1IRg",
      "title": "John Wayne | Paradise Canyon 1935 (Colorized Western) Classic Cowboy Movie | subtitles",
      "description": "Authorities Investigate a Medicine Show Involved in Counterfeit Money Circulation Near the Mexican Border; John Joins the Show and Rehearses a New Act with Linda; Cowboy Approached to Help Get the Carter Medicine Show Out of Town; Showman Promotes Indian Remedies and Thrilling Marksmanship Exhibition; Cowboy and Girl Encounter Trouble in Town; American Government Agent Seeks Assistance from Mexican Authorities to Capture Counterfeiting Gang; Federal Man Overpowered in Attempted Arrest of Curly Joe, Leading to Battle and Chase to Hideout\n\nOriginal title: Paradise Canyon (1935) \n\nBlack & White version: https://youtu.be/6yxN47XYQSI\n\nDirector: Armand Schaefer\nWriters: Lindsley Parsons, Lindsley Parsons\nActors: John Wayne, Nancy Shubert, Lane Chandler \nGenres: Colorized classics, Action, Western\n\nThis film has French & Spanish dubbed audio, go to settings ⚙️  to change your audio / subtitle language.\n\n00:00  Full Movie (with subtitles)\n01:25  The authorities are investigating a medicine show involved in circulating counterfeit money near the Mexican border.\n09:36  John joins a medicine show and rehearses a new act with Linda.\n19:31  A cowboy is approached by someone from the Mexican side who wants him to help get the Carter medicine show out of town.\n26:04  A showman promotes his Indian remedies and introduces a thrilling exhibition of marksmanship.\n28:37  A cowboy and a girl are part of a show and encounter some trouble in town.\n41:04  An American government agent is after a counterfeiting gang and seeks assistance from Mexican authorities.\n44:31  A federal man tries to arrest Curly Joe but is overpowered, leading to a battle and a chase to a hideout.",
      "addedAt": "2025-12-27T00:41:15.323Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/choJioh1IRg/maxresdefault.webp?v=66163aea",
      "duration": 3190,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:41:15.443Z"
}