{
  "imdbId": "youtube-OE4QtesVvhM",
  "title": "The Forest 1982 (Horror, Thriller) Dean Russell, Gary Kent, Tomi Barrett | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OE4QtesVvhM",
      "title": "The Forest 1982 (Horror, Thriller) Dean Russell, Gary Kent, Tomi Barrett | Full Movie",
      "description": "If you go down to the woods today - you might never get out alive!\nA cannibal hermit living in the woods preys on campers and hikers for his food supply. \n\nOriginal title: The Forest (1982) AKA: Terror in the Forest\n\n\nThis film has English and French audio options, and is subtitled in many languages.\n\n\nDirector: Don Jones \nWriter: Don Jones (as Evan Jones) \nStars: Dean Russell, Gary Kent, Tomi Barrett, John Batis\nGenre: Cult Movies, Horror, Thriller\n\n00:00 Full Movie (with subtitles)\n01:57 Exploration of a mysterious forest leads to unsettling encounters and ominous warnings.\n09:38 A group plans a camping trip, but faces danger and disagreement over gender discrimination.\n13:45 Exploration of a mysterious forest at night leads to unexpected events.\n23:57 Mysterious events unfold as individuals go camping in the forest at night.\n32:43 Encounter with mysterious individuals in the forest leads to suspicion and unease.\n44:16 A mysterious encounter in the forest leads to unsettling revelations and a sense of impending danger.\n56:20 Group of individuals in the wilderness facing a dilemma on splitting up or staying together.\n1:07:41 A chilling tale of survival and family secrets in the forest.\n1:22:06 A family bids farewell as they prepare to leave a camp, facing emotional challenges and uncertainty.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "OE4QtesVvhM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:36:42.938Z"
}