{
  "imdbId": "youtube-vfwWE_fYmhQ",
  "title": "남자와 기생(1969) A Man And a Gisaeng (Namjawa Gisaeng)",
  "year": 1969,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vfwWE_fYmhQ",
      "id": "vfwWE_fYmhQ",
      "title": "남자와 기생(1969) A Man And a Gisaeng (Namjawa Gisaeng)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01814\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01814\n\n영화글 : https://www.kmdb.or.kr/story/10/5399\n\n감독(Director): 심우섭(Shin Sang-ok)\n출연(Cast): 구봉서(Koo Bong-seo), 도금봉(Do Kum-bong), 허장강(Heo Chang-hyeon), 김청자(Kim Jeongja), 양훈(Yang Hun) \n\n(줄거리) 근무 시간에 수를 놓는 등 여자 같은 성격 때문에 허사장(허장강)의 회사에서 쫓겨난 태호(구봉서)는 기생집에서 지배인으로 일하는 후배(양훈)의 권유로 어느 요정에 여장을 하고 기생으로 나간다. 스물다섯인 산월이(구봉서)의 인기는 대단해서 그를 해고시킨 허사장과 도사장을 비롯해 수많은 남자들이 접근해온다. 산월은 그를 찾는 손님들 사이를 왔다갔다 하면서, 적당히 빼면서 술시중을 들어 신분이 탄로나지 않게 한다. 그러는 동안 그는 부친의 사업실패와 어머니의 병환, 동생들의 뒷바라지 때문에 어쩔 수 없이 기생 생활을 해야 하는 정미를 사랑하게 된다. 태호와는 정반대로 남자 같은 성격의 태권도 사범인 여동생 태숙(김청자)은 약혼을 하게 되는데 그 남자는 다름 아닌 허사장의 아들 동일이다. 한편, 허사장은 가정을 소홀히 한 채 지나치게 잦은 요정 출입과 외박을 해 부인(도금봉)으로부터 질타를 받는데, 허사장의 부인은 남편들이 왜 요정출입을 하고 외도를 하는지를 몸소 견학해 보겠다며 남장을 하고 다른 부인들과 합세해서 요정을 찾아간다. 허사장의 부인은 산월이 남자들에게 교태를 부리며 마음을 사로잡는 것을 보고는, 남편의 마음을 잡아두는 건 첫째도 서비스, 둘째도 서비스, 셋째도 서비스... 라고 여기게 된다. 서로를 사랑해 앞날을 기약하기 위해 기생생활을 그만둔 태호와 정미는 조그마한 옷가게를 차려 정미가 운영한다. 허사장 아들 동일과 청자의 상견례 자리에서 태호는 자신이 산월이 행세를 할 수 밖에 없었던 이유를 이야기 해 허사장을 설득시켜 판매과장으로 복직된다. 허사장의 가정에도 화목한 기운이 감돌아 아내는 서비스가 좋아지고, 허사장은 아내에게 다정하게 키스한다. \n\n(Synopsis) A young man who was fired from his job for being unmanly decides to dress as a woman and work as a gisaeng.  He gets proposals from several of his male clients including his former boss, Heo.  He earns enough money to clear his gisaeng life and opens his own business with his friend Jeong-hui.  Meanwhile his sister tells him that she is getting married.  Later he finds out that her future brother in-law is the son of Heo.  He doesn't know how to react. But Heo takes the man back to his company.",
      "addedAt": "2025-12-26T00:22:58.694Z",
      "thumbnail": "https://i.ytimg.com/vi/vfwWE_fYmhQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBY6SFQiIa9Ig9uRibOQ_kjAC6zbA",
      "duration": 5182,
      "language": "ko",
      "year": 1969,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:58.728Z"
}