{
  "imdbId": "youtube-UcLvn1Obnqg",
  "title": "Side Street (RKO, 1929) CRIME DRAMA🍕FULL PRE-CODE MOVIE",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UcLvn1Obnqg",
      "title": "Side Street (RKO, 1929) CRIME DRAMA🍕FULL PRE-CODE MOVIE",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Tom Moore, Owen Moore, Matt Moore, and George Raft\nDirected by: Malcolm St. Clair\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TUzR3YhpzxOuBM6YrZ91UVG\n🍕 GEORGE RAFT'S EARLIEST CAMEO🍕 \nFrom Radio Pictures and RKO Productions comes a big-city tale of three Irish brothers — one cop, one crook, and one caught in the crosshairs.\" \n\nThe three brothers are portrayed by real-life siblings Tom Moore, Owen Moore, and Matt Moore, all well-known screen stars of the silent and early sound periods. Their dynamic performances give the story a sense of authenticity and emotional depth rarely seen in early talkies.\n\nAdding to the film’s historical value is a brief appearance by George Raft in his earliest surviving film cameo. Long before he became a gangster film icon, Raft made his mark here, making this a must-watch for classic Hollywood fans and collectors alike.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nBe sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every WEEK on PizzaFLIX.\n\nThis RKO release, directed by Malcolm St. Clair, is a hidden gem of Depression-era filmmaking, blending family loyalty, law enforcement, and urban crime into a tight, emotionally driven narrative.\n\nSubscribe for more rare cinematic treasures restored for today’s audiences!\n\n#SideStreet1929 #fullmovie #GeorgeRaft #RKO #ClassicMovies #RadioPictures#TomMoore #OwenMoore #MattMoore #MalcolmStClair #CrimeDrama #PreCodeHollywood #ClassicMovieMonday #PizzaFLIX",
      "id": "UcLvn1Obnqg",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:02.379Z"
}