{
  "imdbId": "youtube-s5G8Pl9TB9Q",
  "title": "Mary Higgins Clark: Sieh dich nicht um (KRIMI FILME auf Deutsch komplett, Mystery Thriller 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s5G8Pl9TB9Q",
      "id": "s5G8Pl9TB9Q",
      "title": "Mary Higgins Clark: Sieh dich nicht um (KRIMI FILME auf Deutsch komplett, Mystery Thriller 2025)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Eine erfolgreiche New Yorker Immobilienmaklerin gerät zufällig in einen Mordfall, als sie die Mutter einer vermeintlich verunglückten jungen Frau trifft – und Beweise findet, die tödliche Aufmerksamkeit erregen.\n\nMARY HIGGINS CLARK: SIEH DICH NICHT UM (2002)\nOriginaltitel: Pretend You Don't See Her\nMit: Emma Samms, Hannes Jaenicke, Beau Starr\nRegie: René Bonnière\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nWas passiert, wenn eine junge Frau zufällig in einen gefährlichen Kriminalfall verwickelt wird, nur weil sie zur falschen Zeit am falschen Platz ist? Lacey Farrell hat es geschafft: Sie gehört zu den erfolgreichsten Immobilienmaklerinnen New Yorks. Als sie den Auftrag erhält, eine sehr elegante Maisonettenwohnung in der Nähe der Fifth Avenue zu verkaufen, lernt sie Isabelle Waring kennen, deren Tochter Heather bei einem Autounfall ums Leben kam. Isabelle ist jedoch davon überzeugt, dass Heather ermordet wurde. Hartnäckig hält sie gegen den Willen ihres Exmannes Jimmy Landi an dieser Theorie fest und schüttet Lacey ihr Herz aus. Vor allem nachdem die Heathers Tagebücher im Apartement findet. Sie könne nun endlich beweisen, dass ihre Tochter keines natürlichen Todes starb...\n#Netzkino #ganzerFilm #krimi\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:46:05.791Z",
      "thumbnail": "https://i.ytimg.com/vi/s5G8Pl9TB9Q/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBRtcNU5tBY0tiUibtQojZzde-XUA",
      "duration": 5216,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}