{
  "movieId": "youtube-jmYqg2UwQOQ",
  "title": "Dongsimcho (Dongsimcho)(1959)",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jmYqg2UwQOQ",
      "id": "jmYqg2UwQOQ",
      "title": "Dongsimcho (Dongsimcho)(1959)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00489\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00489\n\n영화글 : https://www.kmdb.or.kr/story/10/1135\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희,김진규,엄앵란,주증녀,김석훈,도금봉,김승호,이민,김동원,한은진,주선태,서월영,임양,정연자,최은연,남양일\n\n줄거리 : 6ㆍ25때 남편을 여읜지 8년. 이숙희(최은희)는 양장점을 하다가 빚을 지고, 출판사 전무 김상규(김진규)가 빚청산을 도와주면서 둘은 사랑에 빠진다. 그러나 상규는 사장딸 옥주(도금봉)과 약혼한 사이고 누이(주증녀)는 그의 출세를 위해 이 결혼을 서두른다. 숙희의 장성한 딸 경희(엄앵란)는 어머니의 행복을 위해 상규와의 재가를 권유하지만, 숙희는 자신에게 주어진 사회적 관습과 윤리적 도덕관 때문에 갈등한다. 숙희와 상규는 진실로 사랑하지만, 숙희는 헤어지는 길을 택하고 서울 집을 팔아 고향으로 떠난다. 몸져 누워있던 상규는 이 소식을 듣고 서울역으로 나가 이 여사가 탄 기차를 바라보며 괴로워한다.\n\nCasts : Choi Eun-Hee, Kim Jin-Kyu, Eom Aeng-Ran\n\nSYNOPSIS : Lee Suk-hui (Choe Eun-hui) lost her husband to the Korean War eight years ago. She runs a dressmaking shop that has fallen into debt. When Kim Sang-gyu (Kim Jin-gyu), the executive director of a publishing company, helps her pay off debts, she falls in love with him. He, however, is engaged to the daughter of his boss, Ok-ju (Do Geum-bong). His sister (Ju Jeung-nyeo) pushes him to marry the boss's daughter, hoping that will bring him rapid success.  Meanwhile, Suk-hui's grown-up daughter Gyeong-hui, wanting her mother to be happy, urges her mother to marry Sang-gyu, but Suk-hui vacillates between social mores and her own happiness.  Even though she and Sang-gyu truly love each other, she decides to leave him and heads for her country home after selling her house in Seoul. Hearing the news, he who is ill in bed hurries to Seoul station, but it is too late. All he can do is just to stand on the platform and to watch her train pulling away.",
      "addedAt": "2025-12-26T00:24:17.496Z",
      "thumbnail": "https://i.ytimg.com/vi/jmYqg2UwQOQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAN4v-IhHnNnoGAqhK-0Kg1rrexkQ",
      "duration": 7580,
      "language": "ko",
      "year": 1959,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:17.533Z"
}