{
  "imdbId": "youtube-vkm1W4adTyM",
  "title": "Maytime in Mayfair 1949 (Musical, Romance) Anna Neagle, Michael Wilding, Peter Graves | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vkm1W4adTyM",
      "id": "vkm1W4adTyM",
      "title": "Maytime in Mayfair 1949 (Musical, Romance) Anna Neagle, Michael Wilding, Peter Graves | Movie",
      "description": "A sparkling romantic musical in beautiful technicolor!\nWhen a penniless English playboy unexpectedly inherits a prestigious Mayfair fashion salon, his initial plan to sell it is upended when he encounters Ellen, the talented chief designer and manager. As he navigates the glitzy world of high fashion, he discovers that pursuing both the business of \"rags for riches\" and romance could be the key to his newfound fortune.\n\nOriginal title: Maytime in Mayfair (1949)\n\nThis film is subtitled in many languages.\n\nDirector: Herbert Wilcox\nWriter: Nicholas Phipps \nStars: Anna Neagle, Michael Wilding, Peter Graves \nGenres: Classics, Comedy, Musical, Romance\n\n\n00:00 Full Movie (with subtitles)\n03:38 A man unexpectedly inherits a dress shop and meets the fierce manageress, leading to comedic interactions and misunderstandings.\n07:55 A musical romance unfolds as a businessman unexpectedly decides to take a personal interest in a dressmaking business.\n13:27 A musical romance unfolds as colleagues bond over work and social events, leading to late-night conversations and a late arrival the next day.\n21:07 A romantic musical unfolds in a fashion business setting, where compliments and honesty clash.\n26:52 A discussion between two individuals about fashion designs and partnerships in a club setting.\n35:23 Romantic evening turns chaotic with spilled tea, drunken antics, and unexpected arrests.\n43:37 A comedic tale involving two soldiers, a mistaken arrest, and a potential scandal, causing chaos and confusion.\n56:55 A tale of business drama and romantic aspirations unfolds as a woman seeks a new job opportunity.\n1:02:01 Musical business trip to Paris leads to romantic phone call and humorous interactions.\n1:09:57 Romantic comedy unfolds as characters navigate business deals, love interests, and unexpected twists in Mayfair.\n1:18:46 Romantic entanglements unfold as a woman faces consequences of revealing secrets, leading to a hospital visit and bail for a troubled man.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:56.960Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/vkm1W4adTyM/maxresdefault.webp?v=664b09f3",
      "duration": 5066,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:57.075Z"
}