{
  "movieId": "youtube-9KhSagCu3R8",
  "title": "Counterspy Meets Scotland Yard 1950 | by Seymour Friedman (Film-Noir, Crime) Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9KhSagCu3R8",
      "id": "9KhSagCu3R8",
      "title": "Counterspy Meets Scotland Yard 1950 | by Seymour Friedman (Film-Noir, Crime) Colorized",
      "description": "Sleuth joins forces with daring British agent in ruthless spy chase!\nWhen enemy agents obtain leaked secrets about a guided missile reservation, the chief of America's counterspy division (Howard St. John) and Scotland Yard's best investigator Ron Randell get on an investigative trail which quickly leads to a reservation secretary.\n\nOriginal title: Counterspy Meets Scotland Yard (1950)\nThis film is subtitled in many language options.\n\nBlack & White version: https://youtu.be/0dRz6kHJk-4\n\n\nDirector: Seymour Friedman\nWriters: Harold Greene, Phillips Lord\nStars: Howard St. John, Ron Randell, Amanda Blake\nGenres: Colorized classics, Film-Noir, Crime, Drama\n\n\n00:00 Full Movie (with subtitles) \n00:38 Government building guarded by Counterspy in Washington, D.C.; Central Files Division in Croftona Reservation.\n08:19 Encounter between two law enforcement agents discussing autopsy and body snatching suspicions.\n13:33 A meeting between Mr. Langton and Professor Schuman leads to the need for long range tests on a control mechanism.\n22:24 Undercover agent investigates suspicious activities involving Dr. Victor Gilbert and Karen Michelle.\n29:18 Covert operations involving missile installation, personnel movements, and romantic intrigue.\n35:40 A dinner conversation leads to suspicions about a colleague's death and a potential discovery.\n41:10 Undercover agent monitors house for crucial information exchange.\n50:25 Technician fixes electrical overload in a house for surveillance operation.\n59:31 Doctor Gilbert examines Mr. Wilbur for headaches, interrupted by a mysterious delivery.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:46.402Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/9KhSagCu3R8/maxresdefault.webp",
      "duration": 4033,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:46.526Z"
}