{
  "imdbId": "youtube-dylYPGJwB1w",
  "title": "First Encounter (1997 Sci-Fi) The First Contact...Between Earthlings and Aliens Can Be Fatal",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dylYPGJwB1w",
      "title": "First Encounter (1997 Sci-Fi) The First Contact...Between Earthlings and Aliens Can Be Fatal",
      "description": "Scientists and military operatives races against time to decode a mysterious signal from deep space, only to find themselves face-to-face with a formidable alien presence. A captain wants to revive aliens in suspended animation, leading his lieutenant to lead a mutiny against him, as chaos erupts and the stakes skyrocket; they must unravel the secrets of this extraterrestrial threat before humanity faces catastrophic consequences in a heart-pounding battle for survival.\n\nOriginal title: First Encounter (1997)  Alternative title: Moral Code\n\nDirector & Writer: Redge Mahaffey\nStars: Veronica Bird, Holly Fields, Trevor Goddard, Roddy Piper, Stacie Randall\nGenre: Aliens, Sci-Fi Movie\n\n\n00:00  Full Movie with Subtitles\n05:21  Captain Ramsey Travis is tasked with investigating a mysterious alien spacecraft.\n18:32  The crew of the Gallant Fox discovers an enormous alien ship, initiating first contact.\n37:15  A perilous boarding mission reveals the alien crew in suspended animation.\n52:48  Lieutenant Lopez faces a dangerous incident with the alien technology, gaining unexpected insights.\n1:09:03  A moral dilemma arises as the crew debates the fate of the dormant aliens.\n1:22:17  A secret test from the aliens evaluates the crew’s decision-making and humanity's readiness for contact.\n1:28:42  The climactic revelation: Earth has passed the test, unlocking new alliances among intelligent species.\n\n\n@CultCinemaClassics",
      "id": "dylYPGJwB1w",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:33:11.752Z"
}