{
  "movieId": "youtube-gUbG3wQ9GtQ",
  "title": "Five Marines ( O in-ui haebyeong )(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gUbG3wQ9GtQ",
      "id": "gUbG3wQ9GtQ",
      "title": "Five Marines ( O in-ui haebyeong )(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00679\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00679\n\n영화글 : https://www.kmdb.or.kr/story/74/1645\n\n감독(Director) : 김기덕(Kim Ki-Deok)\n출연 : 신영균(오덕수 소위),최무룡(우종국),황해(김훈구),박노식(장영선),후라이보이(마주한),독고성(정충길 하사관),김승호(오석만 중령),남양일(하영규 해병),박암(해병 여단장),윤일봉(중대장),남방운(작전참모),김지미(순이),최봉(덕한),황정순(훈구의 모),김명희(훈구의 매)\n\n줄거리 : 어려서부터 형에 비해 차별을 받아왔다고 생각하는 오덕수 소위(신영균)는 아버지 오석만 중령(김승호)이 대대장으로 있는 부대에 소대장으로 부임한다. 강한 개성의 소유자인 해병대원들은 간혹 충돌하기도 하지만 오소위를 중심으로 전우애를 쌓아간다. 어느 날 소대원들의 사랑을 독차지하던 막내 하용규 해병(남양일)이 정찰 중 사망하는 사건이 발생한다. 이에 분노해 홀로 북한군 진영에 숨어 들어갔다 상처를 입고 탈출한 분대장(독고성)은 북한군이 총공격을 위해 방대한 탄약고를 증설 중임을 알리고 사망한다. 분대장의 진심을 깨달게 된 우정국(최무룡), 장영선(박노식), 김훈구(황해), 마주한(곽규석) 등 4명의 소대원들은 오소위와 함께 북한군의 탄약고를 폭파시키는 위험한 임무를 위해 자원한다. 출발에 앞서 오소위는 마침내 아버지와의 오해를 풀고 5명의 해병대원은 적진에 진입하여 임무를 완수하지만 우정국을 제외한 4명은 장렬히 목숨을 바친다. 함께 탈출했지만 보트 위에서 숨진 오소위의 시신을 안고 귀환한 우정국은 오중령에게 오소위가 탈취한 기밀문서와 유물을 전해준다.\n\nCasts : Choi Mu-Ryong, Shin Young-Kyun, Hwang Hae, Kwak Kyu-Seok, Park No-Shik\n\nSYNOPSIS : Oh Deok-su (Shin Young-kyun) is a second lieutenant in the Korean Navy where his father Oh Seok-man (Kim Seung-ho) serves as a commander. He believes he was always treated unequally from his older brother since his youth. Other marines at the base are highly individualistic and get into some skirmishes occasionally, but they soon build a sense of togetherness. One day, the youngest marine, Ha Yong-gyu (Nam Yang-il), who was the most liked in the base, gets killed while on a scouting mission. Enraged by this tragic incident, squad commander (Dok Go-sung) sneaks into the North Korean camp alone. After suffering a severe injury, he escapes from the enemy camp, and right before he dies, he informs the base that the North Korean Army is expanding their ammunition dump in preparation for a full-scale attack. The marines, including Woo Jeong-guk (Choi Moo-ryong), Jang Yeong-seon (Park No-sik) Kim Hong-gu (Hwang Hae) and Ma Ju-han (Kwak Gyu-seok), volunteer for a risky mission of bombing the ammunition dump of North Korea with Oh. Before leaving, Oh resolves all the misunderstanding he has had with his father. 5 marines infiltrate the enemy camp and complete their mission. However, 4 marines, excluding Woo, bravely sacrifice their lives for the success of the mission. Woo Jung-guk returns to his base carrying the dead body of Oh, who died on the boat after the escape. He hands over the confidential documents that Oh had seized from the enemy and what Oh left behind for his father.",
      "addedAt": "2025-12-26T00:25:29.250Z",
      "thumbnail": "https://i.ytimg.com/vi/gUbG3wQ9GtQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCmIBsH8exqOr7YwMr6BylDAvV09Q",
      "duration": 7121,
      "language": "ko",
      "year": 1961,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:29.275Z"
}