{
  "imdbId": "youtube-RsTQEO5YEUo",
  "title": "The Midnight Sun(1972)",
  "year": 1972,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RsTQEO5YEUo",
      "title": "The Midnight Sun(1972)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02528\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02528\n\n영화글 : https://www.kmdb.or.kr/story/10/1014\n\n감독(Director) : 이만희(Lee Man-Hee)\n출연 : 허장강(장중한 (330수사대장)),신성일(박형사),윤정희(장중한 처),김창숙(혜령),문오장(이민수),나오미(박순녀),고강일,이승현(장규석),김영일,박시명,김기범,한명환,박동룡,심상현\n\n줄거리 : 장중한은 부인과 아들 규식을 둔 330부대의 대장이다. 규식이 우연히 알게 된 시골소년 인돌로부터 누나를 찾아달라는 부탁을 받는다. 오토바이로 강도질을 하던 한쌍의 남녀를 수배중이던 330부대는 규식의 납치사건을 당한다. 7년전 아들의 병원비 때문에 돈을 훔친 김민수는 아들을 위해 체포하지 말아달라고 부탁하지만 장중한에 의해 체포당하고 교도소에 간다. 출감한 후 아내는 개가를 하였고 아들은 치료를 받지 못해 죽는다. 이를 보복으로 규식을 납치한 것이었으나 규식의 천진함을 보고 보복을 포기한다. 장중한은 오토바이 사건을 해결하여 그 여자가 인돌의 누나임을 알고 그녀는 과오를 반성한다.\n\nCasts : Heo Jang-Kang, Yoon Jung-Hee\n\nSYNOPSIS : Jang Jung-Han is a commander of 330 unit who is with his wife and son Kyu-Shik. By chance Kyu-Shik meets a country boy In-Dol who asks him to find out his sister. The 330 unit comes upon Kyu-Shik's kidnap while it is searching for a couple burglar on motor cycle. Kim Min-Su stole money to pay for his son's medical charge 7 years ago. At that time he solicited Jang Jung-Han not to arrest him but he is arrested and jailed. After finishing his imprisonment, he finds that his wife remarried and his son is dying of maltreatment. He kidnaps Kyu-Shik to retaliate, but he gives up because Kyu-Shik is so simple and innocent. The commander solves the motor cycle case and finds that the woman is In-Dol's sister who feels regret her faults.",
      "id": "RsTQEO5YEUo",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:31.805Z"
}