{
  "imdbId": "youtube-0BHNNX-vPSg",
  "title": "Invasion of the Animal People (1959) Swedish-American film directed by Jerry Warren | USA re-release",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0BHNNX-vPSg",
      "title": "Invasion of the Animal People (1959) Swedish-American film directed by Jerry Warren | USA re-release",
      "description": "What is this intergalactic creature, and can it be stopped?\nAfter a herd of reindeer are mysteriously found dead following a meteor crash in a remote part of Sweden, soldiers and a geologist are called out to investigate. They discover that the meteor is actually a spaceship... As they try to scape, a monster attacks and kidnaps a helpless woman. \n\nBlack & White version: https://youtu.be/VWR47jTK0SM\n\n\nOriginal title: Invasion of the Animal People (1959) AKA: Terror in the Midnight Sun (original Swedish version)\n\nDirector: Jerry Warren, Virgil W. Vogel \nWriters: Robert M. Fresco, Arthur C. Pierce\nStars: John Carradine, Barbara Wilson, Sten Gester, Robert Burton\nGenres: Colorized Classic, Horror, Sci-Fi, Monster Movie, cult film\n\nJerry Warren's B&W version: https://youtu.be/VWR47jTK0SM\nOriginal Swedish version:  https://youtu.be/wTmDbkvxHbU\n\nRe-released in the USA as \"Invasion of the Animal People\", and distributed to television by Medallion. The film was shortened and scenes with John Carradine were added. Jerry Warren and Virgil W. Vogel are given co-director credit for the U.S. version.  Some of the cut Swedish footage was restored and Jerry Warren shot additional scenes to pad the running time up to 81 minutes, nearly 12 minutes longer than the original version.\n\n\n00:00 Full Movie (with subtitles)\n00:13 Unusual seizure leads to investigation of girl's condition after family conflict over Olympic plans.\n09:53 Investigation into mysterious cases of hysteria and paranoia linked to possible extraterrestrial activity.\n15:04 Scientists investigate mysterious events in Arctic after a girl's strange experience leads to a global discovery.\n23:13 Mysterious events unfold in a snowy village after a meteor sighting, involving a geologist, an Olympic star, and an impending danger.\n34:31 Exploration team investigates mysterious meteor impact site in remote village.\n47:44 Remote team in search for missing individuals encounters challenges and mysterious signals in snowy terrain.\n57:51 A group faces challenges when a creature causes chaos and a search for a missing person ensues.\n\n\nCopyrighted :\n\"The US cut Invasion of the Animal People is Public Domain, we own the original version worldwide in perpetuity. Contract with the original producer. We own it, and have the restored version thru the SFI, and will contest anyone claiming to own the film.\"\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "0BHNNX-vPSg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:19.189Z"
}