{
  "imdbId": "youtube-UcVv9tSiBvU",
  "title": "A Sisterhood with Blood on Its Hands | Lethally Blonde | Full 2025 Thriller Drama Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UcVv9tSiBvU",
      "title": "A Sisterhood with Blood on Its Hands | Lethally Blonde | Full 2025 Thriller Drama Movie",
      "description": "A Sisterhood with Blood on Its Hands | Lethally Blonde | Full 2025 Thriller Drama Movie - A mother must risk her own life to save her daughter from the clutches of a campus sisterhood that manipulates young women into committing crimes for money and prestige.\n\nWatch Lethally Blonde, a full crime thriller movie where a mother will stop at nothing to save her daughter from a dangerous campus sisterhood. What appears to be an elite group of young women hides a sinister operation, manipulating members into committing crimes for money and prestige. As the danger escalates, a mother risks her own life to expose the truth and rescue her child. Perfect for fans of suspense thrillers, crime drama movies, full free thriller films, intense psychological stories, and high-stakes rescue missions, Lethally Blonde delivers gripping tension, shocking twists, and a powerful fight for justice.\n\nStars: Tammy-Anne Fortuin, Shelby Yardley, Clara Carlo\n*Licensed from Tesera. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "UcVv9tSiBvU",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:21.163Z"
}