{
  "imdbId": "youtube-pCpW4TmieIU",
  "title": "[4K] 피막(1980) / The Hut(Pimag)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pCpW4TmieIU",
      "id": "pCpW4TmieIU",
      "title": "[4K] 피막(1980) / The Hut(Pimag)",
      "description": "* 본 저작물은 저작권법 제50조에 의거하여 이용 승인을 얻은 저작물임(법정허락-2021.4.30)\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03495\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03495\n\n영화글 : https://www.kmdb.or.kr/story/10/5207\n\n감독(Director): 이두용(Lee Doo-yong)\n출연(Cast): 유지인(Yu Ji-in), 남궁원(Nam Koong Won), 황정순(Hwang Jung-seun), 최성호(Choe Seong-ho), 김윤경(Kim Yun-gyeong) \n\n(줄거리) 장남 성민이 가망 없는 중병에 걸리자, 강 진사(최성호)와 노마님(황정순)은 전국에서 용하다는 무당을 불러 모은다. 그중 옥화(유지인)라는 무당이 영험한 모습을 보이자 이들은 옥화에게 굿을 해달라고 부탁한다. 치성을 드리던 옥화는 마을 외딴 곳에 묻힌 호리병을 찾아내고, 그 호리병에 있던 원혼이 성민에게 씌어 병이 났다고 말한다. 이에 강 진사 집 사람들은 옥화에게 20여 년 전의 일을 들려준다. 남자들이 단명하여 청상과부가 넘쳐나던 강 진사집안의 둘째 며느리(김윤경)가 정욕을 이기지 못해 은장도로 허벅지를 찔러 화농으로 죽어가게 된다. 죽어가는 사람을 버려두는 피막으로 며느리를 옮기게 한 노마님은 마지막 한을 남기지 않도록 피막지기 삼돌(남궁원)에게 그녀를 품도록 한다. 그러나 그녀는 삼돌의 극진한 치료로 살아나고 둘은 사랑하게 되어 임신까지 하게 된다. 그 사실을 알게 된 강 진사와 노마님은 남녀를 죽이고, 삼돌의 혼령을 호리병에 넣어둔 것이다. 옥화가 굿을 하는 과정에 전 날 옥화를 강간했던 강 진사의 숙부와 친척, 그리고 노마님이 갖가지 사고로 죽음을 당하고 성민은 살아난다. 그녀는 삼돌이 피막지기가 되기 전에 숨겨둔 딸이었고, 자신의 아버지의 복수를 위해 이런 일을 벌인 것이다. 그녀는 피막으로 가 그간 그곳에서 억울하게 죽어간 원혼을 달래고, 강 진사마저 죽이려다 마음을 바꿔 살려준 후 피막과 자신을 함께 불태운다.\n\n(Synopsis) When Seong-min, the oldest son of Kang of Suri village, falls sick, he calls Ok-hwa, a shaman priestess.  She performs a ritual and finds the calabash containing the spirit of Sam-dol who was the village hut guard. When the oldest daughter-in-law was dying from a disease, they took her to the hut to die.  Sam-dol nursed her back to health and they became close.  She even became pregnant with his baby which Kang found out. He punished them in secret.  Ok-hwa avenges her father, Sam-dol's death by killing Kang.  She becomes possessed by a real spirit and the bitterness of generations of women burn and she dances with their spirits.",
      "addedAt": "2025-12-26T00:21:11.326Z",
      "thumbnail": "https://i.ytimg.com/vi/pCpW4TmieIU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLChkTBFFgaVlMU8qRxLz8Z1p5LuUg",
      "duration": 5797,
      "language": "ko",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:11.420Z"
}