{
  "imdbId": "youtube-XBIiB2EkQP8",
  "title": "The Love Marriage (Ja-yugyeolhon)(1958)",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XBIiB2EkQP8",
      "title": "The Love Marriage (Ja-yugyeolhon)(1958)",
      "description": "TBS 영화해설: https://www.youtube.com/watch?v=nALcZjOPqJk\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00408\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00408\n\n감독(Director) : 이병일(Lee Byeong-Il)\n출연 : 최은희,이민자,조미령,김승호,최남현,고선애,석금성,이룡,박광수,성소민,최현,박암,이숙향,양성난,전미희,한성숙,송향숙,공진수\n\n줄거리 : 의학박사인 고박사(최남현)네 큰딸 숙희(최은희)는 신혼여행 첫날 밤 자신의 과거를 용서해달라는 남편의 고백에, 그녀 역시 그런 사랑이 있었음을 고백한다. 그러자 남자는 파혼을 하고 미국으로 떠나버리고, 숙희는 그 후 3년을 두문불출하며 보낸다. 둘째 딸 문희(이민자)는 가난한 문학청년인 가정교사 준철(최현)과 사랑에 빠지지만, 집안의 반대에 부딪히자 가출을 감행한다. 결혼에 관심이 없던 셋째 딸 명희(조미령)는 전도유망한 사업가 청년보다 아버지의 도도한 조수(박암)를 선택한다. 숙희의 남편은 반성을 한 뒤 귀국해 둘은 재회하고, 이런 식으로 모든 연애결혼은 성공한다.\n\nCasts : Seong So-Min, Cho Mi-Ryeong, Lee Min-Ja, Choi Eun-Hee, Park Am, Choi Hyeon\n\nSYNOPSIS : A medical doctor, Ko (Choi Nam-hyeon), has three daughters. The first daughter, Suk-hee (Choi Eun-hee), confesses her past when her husband asks her to forgive his past, on the first night of their honeymoon. When he breaks off the marriage and goes to America, Suk-hee confines herself to her home for three years. The second daughter (Lee Min-ja) falls in love with a poor, literary man Jun-cheol (Choi Hyeon), a private tutor, but leaves home when her parents oppose him. The third daughter, Myeong-hee (Jo Mi-ryeong), who is indifferent to marriage, chooses her father's arrogant assistant (Park Am), instead of a promising businessman. Suk-hee's husband repents and returns home and reunites with her. In movies all love marriages are successful",
      "id": "XBIiB2EkQP8",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:24:55.876Z"
}