{
  "imdbId": "youtube-BY9QpXx8C90",
  "title": "Charleston & Trinity 1974 (Comedy, Crime) Giuliano Gemma, Ricky Bruch | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BY9QpXx8C90",
      "id": "BY9QpXx8C90",
      "title": "Charleston & Trinity 1974 (Comedy, Crime) Giuliano Gemma, Ricky Bruch | Full Movie",
      "description": "Sonny, a New York wise guy, dreams of becoming a feared gangster. He runs errands for the mob with some success, as a result the \"Don\" gives him, as a reward, the control of Mulberry Street, which also faces a boxing gym...\n\nOriginal title: Anche gli angeli tirano di destro (1974) \n\nMany subtitle language options available\n\nDirector: Enzo Barboni\nWriter: Enzo Barboni\nStars: Giuliano Gemma, Ricky Bruch, Laura Becherelli\nGenres: Italian cinema, Comedy, Crime\n\n\n00:00 Full Movie\n02:33 A chaotic and humorous journey to New York City.\n12:50 A mysterious encounter on a train leads to a job offer involving illegal activities and a new living arrangement.\n18:19 A series of conversations and events unfold, leading to a decision to marry.\n25:08 A confusing and chaotic conversation between multiple characters.\n30:51 Two characters discussing protection money and insurance, with a hint of humor.\n37:08 A dramatic conversation between two individuals, discussing their readiness to take down someone and their secret identities.\n45:25 A dramatic and mysterious encounter unfolds in a late-night setting, involving a criminal, a guardian, and a game of chance.\n58:29 An intense scene unfolds with mysterious characters and hidden motives.\n1:06:11 A mysterious encounter at a St. Patrick's Day celebration leads to a request for help.\n1:13:39 An action-packed scene unfolds in a street confrontation between rival gangs.\n1:24:57 A radio conversation unfolds, involving gangs, a press conference, and a plea for forgiveness.\n1:33:16 A dramatic and intense conversation unfolds between characters, involving secrets, betrayal, and law enforcement.\n1:39:51 A chaotic and humorous situation unfolds involving a monk, a love triangle, and a commitment to a long-term relationship.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:39:51.136Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/BY9QpXx8C90/maxresdefault.webp?v=6568c810",
      "duration": 6575,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:51.221Z"
}