{
  "movieId": "youtube-bqo7KL2DrMY",
  "title": "People in the Slum (Kkobangdongne salamdeul)(1982)",
  "year": 1982,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bqo7KL2DrMY",
      "id": "bqo7KL2DrMY",
      "title": "People in the Slum (Kkobangdongne salamdeul)(1982)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03614\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03614\n\n영화글 : https://www.kmdb.or.kr/story/10/5248\n\n감독(Director) : 배창호(Bae Chang-Ho)\n출연 : 김보연,안성기(주석),김희라,공옥진,송재호(공목사),김형자(길자),이인옥,홍성민(형사),조주미,추석양,천동석(준일),김성찬,이재진,김경란,김지영,권일정,양일민,박종설,박용팔\n\n줄거리 : 서울 빈촌에 사는 명숙(김보연)은 늘 검은 장갑을 끼고 다닌다. 그녀는 어린 아들 준일(천동석)을 홀로 키우다 태섭(김희라)과 결혼해 생계를 책임진다. 열심히 모은 돈으로 가게를 내고 제법 장사가 잘되던 중, 준일의 친부인 주석(안성기)이 찾아온다. 현재 주석은 택시운전을 하고 있지만 예전에는 소매치기였다. 주석은 명숙에게 자신이 준일의 친부임을 주장하며 돌아오라고 말한다. 이 사실을 알게 된 태섭은 주석에게 떠나라고 한다. 주석이 자신의 친\n부임을 알게 된 준일은 집을 나가고, 명숙은 준일을 찾아 헤맨다. 주석 때문에 준일이 혼란스러워한다는 것을 안 명숙은 가게를 정리하고 이사를 가기로 한다. 건달 시절 살인을 한 사실을 숨겨온 태섭은 공소시효가 며칠 남지 않은 때에 자신이 죽인 남자의 부인을 만나고 죄책감에 시달린다. 이를 안 명숙은 가게를 팔아 그 부인에게 돈을 주고 태섭과 떠나려 한다. 그러나 태섭은 죗값을 치러야 한다며 자수를 하고, 주석에게 명숙과 떠날 것을 권유한다. 아들과 함께 리어카에 짐을 싣고 홀로 길을 떠나던 명숙 앞에 주석의 택시가 서고, 주석을 원망하던 명숙의 검은 장갑이 벗겨진다. 한편 고물장수 공 목사(송재호)는 마을 사람들에게 믿음을 주기 위해 공터에 교회를 세우고 스스로 자립하도록 사람들을 돕는다. 폐인이다시피 살아온 길자(김형자)는 그런 공 목사를 좋아하고, 그로 인해 새 출발을 하게 된다.\n\nCasts : Kim Bo-Yun, Ahn Seong-Ki, Kim Hee-Ra, Kim Hyeong-Ja\n\nSYNOPSIS : In the poor district of town, there lived a woman known as the Black Glove. Taking her young son, she remarries a man named Tae-sub whom nobody knows anything about. Tae-sub has an enormous secret. He relies on the Black Glove to support him. One day, Ju-seok, her ex-husband shows up. He's been released from jail and is now a cabbie. The almost ruined Kil-ja yearns for the neighborhood minister, Gong. The Black Glove decides to give up her ex-husband and her son. An innocent widow who has lost her husband shows up and reveals Tae-sub's secret. Tae-sub had committed murder but the stature of limitations is almost over on the crime. Tae-sub changes due to the widow's compassion. The Black Glove and her son leave the district.",
      "addedAt": "2025-12-26T00:25:16.434Z",
      "thumbnail": "https://i.ytimg.com/vi/bqo7KL2DrMY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAjLNp3wjLrQxWXYFnp110JEIQxPg",
      "duration": 6722,
      "language": "ko",
      "year": 1982,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:16.526Z"
}